{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-tax-regime-save-more-itr-nps-benefit-key-details-explained-2685103-2025-02-25",
      "headline": "New Tax Regime: Income up to Rs 13.7 lakh can be tax-free. Here's howFollowing the Union Budget 2025, annual income up to Rs 12 lakh became tax-free. But there's a way to push it even further to Rs 13.7 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-proposes-tighter-rules-for-index-derivatives-heres-what-it-means-2685106-2025-02-25",
      "headline": "Sebi proposes tighter rules for index derivatives. Here's what it meansIn a consultation paper released late Monday, Sebi said it wants to link stock derivative position limits to the cash market. The idea is to cap the market-wide position limit at the lower of 15% of a stock's free-float market cap or 60 times its average daily delivery value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-holiday-open-or-close-on-maha-shivratri-2025-dalal-street-trading-sensex-nifty-nse-bse-2685083-2025-02-25",
      "headline": "Dalal Street holiday: Is the stock market open or close on Maha Shivratri 2025?Stock markets usually operate from Monday to Friday, except on declared holidays. They remain closed on Saturdays and Sundays."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tata-capital-clears-ipo-plan-to-issue-230-million-new-shares-2685061-2025-02-25",
      "headline": "Tata Capital IPO to soon make Dalal Street debut as board clears listing plansTata Capital will be the first company from the Tata Group to launch an IPO since Tata Technologies went public in November 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-higher-snap-losing-streak-but-fii-selling-remains-a-concern-2685058-2025-02-25",
      "headline": "Sensex, Nifty snap losing streak to open higher, but FII selling remains concernThe S&P BSE Sensex was up 81.16 points to 74,535.57, while the NSE Nifty50 gained 11.40 points to 22,564.75 as of 9:25 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-stock-market-tech-stocks-fall-donald-trump-latest-order-triggers-sharp-sell-off-ali-baba-2685049-2025-02-25",
      "headline": "Donald Trump's latest order triggers sharp sell-off in China tech stocksThe Hang Seng Tech Index dropped by as much as 4.4% on Tuesday, marking its biggest fall since November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-play-airtel-digital-tv-near-merger-as-dth-fights-streaming-ott-wave-report-2685034-2025-02-25",
      "headline": "Tata Play, Airtel Digital TV near merger as DTH fights streaming wave: Report The merger is expected to be done through a share swap, allowing Airtel to increase its non-mobile revenue by offering a combination of telecom, broadband, and DTH services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-india-co-operative-bank-depositors-relief-rbi-allows-rs-25000-withdrawal-2684967-2025-02-24",
      "headline": "New India Co-op Bank depositors get relief as RBI allows Rs 25,000 withdrawal Withdrawals can be made through branches or ATMs, but the total amount a depositor can withdraw will be capped at Rs 25,000 or the balance available in their account, whichever is lower."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-plans-to-eliminate-loan-foreclosure-charges-and-prepayment-penalties-2684812-2025-02-24",
      "headline": "RBI plans to eliminate loan foreclosure charges and prepayment penalties The central bank has invited feedback from the public and stakeholders on a draft circular directing banks not to levy foreclosure charges and pre-payment penalties on loans by March 21, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/these-3-banks-slash-loan-interest-rates-after-rbi-repo-rate-cut-bom-sbi-pnb-2684760-2025-02-24",
      "headline": "These 3 banks slash loan interest rates after RBI's repo rate cut The RBI, after a gap of five years, announced a reduction in the repo rate by 25 bps to 6.25%. A dip in the repo rate can lead to lower interest rates on loans, thereby making loans cheaper, and vice versa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-reciprocal-tariffs-india-impact-explained-2684743-2025-02-24",
      "headline": "Will Donald Trump's tariffs hurt India? Here's what S&P saysIn its latest report, titled 'Asia-Pacific Economies Likely To Be Hit By US Trade Tariffs', S&P pointed out that countries like Vietnam, Taiwan, Thailand, and South Korea have stronger trade ties with the US."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-dalal-street-ends-in-red-sensex-loses-over-850-points-it-stocks-crash-wipro-infosys-2684708-2025-02-24",
      "headline": "Dalal Street ends in red: Sensex loses over 850 points, IT stocks crashThe S&P BSE Sensex lost 856.55 points to close at 74,454.41, while the NSE Nifty50 shed 242.55 points to end at 22,553.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tax-planning-2025-3-easy-ways-to-maximise-tax-savings-before-march-31-2684662-2025-02-24",
      "headline": "Tax planning 2025: 3 easy ways to maximise tax savings before March 31One can invest in Equity Linked Saving Schemes (ELSS), Public Provident Fund (PPF), life insurance premiums, National Savings Certificate (NSC) and tax-saving fixed deposits, to claim deductions of up to Rs 1,50,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nifty-set-for-its-longest-losing-streak-in-28-years-should-you-be-worried-2684694-2025-02-24",
      "headline": "Nifty set for longest losing run in 28 years. Should you be worried?The Nifty losing for five months straight is a rare sight. Last time this happened was in 1996, and before that in 1994-95, when it fell 31.4% over eight months. Right now, the index has fallen over 11% since October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/former-icici-bank-chief-chanda-kochhar-launches-podcast-journey-unscripted-youtube-2684681-2025-02-24",
      "headline": "Former ICICI Bank chief Chanda Kochhar launches podcast Chanda Kochhar, 63, joined ICICI Bank in 1984 and worked her way up to become its Managing Director (MD) and Chief Executive Officer (CEO) in 2009. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-rate-cut-expectations-reduce-lending-rates-again-in-april-policy-meeting-governor-sanjay-malhotra-2684655-2025-02-24",
      "headline": "Will RBI reduce lending rates again in April policy meeting?The recent MPC meeting, held from February 5-7, saw all members agreeing that a rate cut was needed to support slowing economic growth, as inflation was no longer a major concern."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sip-investment-options-nps-ppf-or-mutual-funds-which-is-best-for-you-2684617-2025-02-24",
      "headline": "NPS, PPF, or mutual funds: Which SIP investment should you opt for? Are you looking to invest in SIP but unsure where to put your money? Read to know whether you should opt for PPF, NPS, or mutual funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-bill-what-is-clubbing-of-income-under-family-taxation-2684606-2025-02-24",
      "headline": "Income Tax Bill: What is clubbing of income under family taxation In certain cases, income earned by an individual can be included in another taxpayer's income. In such cases, the latter is eligible to pay taxes not only on his income but also on the income of the other person as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-today-5-things-to-know-about-sensex-nifty-crash-2684586-2025-02-24",
      "headline": "Sensex, Nifty in red. 5 things to know about stock market bloodbathSeveral factors are behind the bloodbath on Dalal Street, especially the exodus of foreign institutional investors (FIIs) who have sold stocks over Rs 2 lakh crore since October 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/earning-up-to-rs-1275-lakh-why-you-should-opt-for-new-income-tax-regime-2684562-2025-02-24",
      "headline": "Earning up to Rs 12.75 lakh? Why you should opt for new income tax regimeEarlier, taxpayers earning up to Rs 7 lakh paid nil taxes under the new regime. Now that limit has been raised to Rs 12 lakh. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-800-points-nifty-down-3-reasons-why-stock-market-is-falling-today-nse-bse-fiis-it-stocks-2684495-2025-02-24",
      "headline": "Sensex tanks 800 points: 3 reasons why stock market is falling todayThe S&P BSE Sensex lost 676.83 points to 74,634.23, while the NSE Nifty50 fell 203.05 points to 22,592.85 as of 10 AM. IT stocks were the worst hit, with HCLTech falling nearly 3%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-red-sensex-down-700-points-hcltech-falls-3-percent-2684485-2025-02-24",
      "headline": "Stock market opens in red: Sensex down 700 points. HCLTech falls 3%The S&P BSE Sensex lost 672.83 points to 74,638.23, while the NSE Nifty50 shed 216.80 points to 22,579.10 as of 9:40 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-fii-selling-dampens-investor-sentiment-dalal-street-when-will-it-stop-sensex-nifty-2684477-2025-02-24",
      "headline": "FII selling dampens investor sentiment on Dalal Street: When will it stop? Foreign institutional investors (FII) have been on a selling spree which has hampered investor sentiment on Dalal Street, affecting Sensex and Nifty as they are moving funds to other markets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/quality-power-ipo-listing-market-debut-dalal-street-check-latest-gmp-2684459-2025-02-24",
      "headline": "Quality Power IPO listing: Will it make a strong market debut? Check latest GMPQuality Power IPO opened for subscription on February 14, 2025, aiming to raise Rs 858.70 crore. The public issue consisted of a fresh issue of 53 lakh shares worth Rs 225 crore and an offer for sale (OFS) of 1.49 crore shares worth Rs 633.70 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-rewards-executives-with-200-percent-bonus-despite-ongoing-job-cuts-3600-layoff-2684450-2025-02-24",
      "headline": "Meta rewards executives with 200% bonuses despite ongoing job cutsThe bonus for top executives was increased to 200% from 75% and the decision was approved by Meta's Compensation, Nominating, and Governance Committee (CNGC) after recent layoff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/health-insurance-4-tips-to-reduce-premiums-for-senior-citizens-2683576-2025-02-21",
      "headline": "Health insurance: 4 tips to reduce premiums for senior citizens Purchasing a health insurance policy at a younger age can help in securing reduced premium rates. Generally, lower insurance premiums are offered to younger people as they are considered low risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/index-funds-vs-etfs-5-key-things-every-investor-should-know-2683517-2025-02-21",
      "headline": "Index Funds vs. ETFs: 5 key things every investor should know Exchange-Traded Funds are traded like shares on the stock market and can be sold or purchased at existing market prices during the day, while Index Funds are traded only once at the closure of the share market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icmai-seeks-cost-accountant-inclusion-as-accountant-in-income-tax-bill-2683530-2025-02-21",
      "headline": "ICMAI demands 'accountant' status for cost accountants in new Income Tax BillIn its memorandum, ICMAI highlighted the extensive training of Cost and Management Accountants (CMAs), which includes expertise in taxation, finance, auditing, corporate laws, and strategic risk management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-regime-3-deductions-that-can-help-taxpayers-maximise-savings-nps-gratuity-standard-deduction-2683419-2025-02-21",
      "headline": "New tax regime: 3 deductions that can help taxpayers maximise savings  Though the new regime offered concessional tax rates, it reduced several popular deductions and exemptions, like HRA, LTA, interest on home loans, Section 80C, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ai-to-take-center-stage-at-the-3rd-digital-news-publishers-association-conclave-2683481-2025-02-21",
      "headline": "AI to take centre stage at the 3rd Digital News Publishers Association ConclaveThrough various keynote sessions, panel discussions and expert presentations, this year's DNPA Conclave aims to decode various critical issues, future strategies, opportunities and models that can power an equitable, inclusive and sustainable digital media ecosystem in an era of rapid technological advancement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/association-of-mutual-funds-amfi-launches-chhoti-sip-tarun-yojana-and-mitra-all-you-need-to-know-2683468-2025-02-21",
      "headline": "AMFI launches Chhoti SIP, Tarun Yojana, and MITRA. All you need to knowThe latest initiative by AMFI reinforces its goal of making mutual fund investments accessible to all investors across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-fall-another-session-auto-stocks-tumble-2683435-2025-02-21",
      "headline": "Sensex, Nifty end lower for another session; auto stocks tumbleThe S&P BSE Sensex ended 424.90 points to 75,311.06 at the closing bell, while the NSE Nifty50 fell 117.25 points to settle at 22,795.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/best-high-conviction-stocks-should-you-invest-or-not-explained-2683399-2025-02-21",
      "headline": "Explained: What are 'high-conviction stocks' and why investors should track themHigh-conviction stocks are shares that investors, analysts, or fund managers strongly believe will deliver higher-than-average returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-when-will-it-be-formed-a-look-at-the-past-trends-2683359-2025-02-21",
      "headline": "8th Pay Commission: When will it be formed? A look at the past trendsA Pay Commission recommends changes to the salary structure, allowances and benefits to be offered to employees depending upon the prevailing economic structure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahindra-and-mahindra-share-price-falls-6-percent-today-rights-issue-subsidiaries-explained-2683333-2025-02-21",
      "headline": "Explained: Why M&M share price tumbled 6% todayThe stock tumbled after the company said it will put money into a rights issue for its two subsidiaries—Mahindra & Mahindra Financial Services (MMFSL) and Mahindra Lifespace Developers (MLDL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/worried-about-volatile-stock-market-check-these-10-best-multibagger-stocks-investment-2683312-2025-02-21",
      "headline": "Worried about volatile stock market? Check these 10 potential multibagger stocksThe most important factor for determining multibagger stocks is to check earnings and growth potential. Investors should seek stocks that consistently deliver revenue and profit, check metrics like PE ratio and dividend yield, and compare their performance with sectoral or broader market trends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/planning-to-start-sip-2-reasons-why-you-should-consider-nps-national-pension-scheme-2683286-2025-02-21",
      "headline": "Planning to start SIP? 2 reasons why you should consider NPSBy investing in NPS, individuals can claim tax benefits of up to Rs 1.5 lakh under Section 80C and an additional Rs 50,000 under Section 80CCD (1B)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/religare-enterprises-stock-price-jump-up-to-9-percent-today-burman-family-takeover-2683282-2025-02-21",
      "headline": "Explained: Why Religare Enterprises share price jumped up to 9% today Soon after the announcement, Religare's stock price climbed 8.52% to hit Rs 242 on the Bombay Stock Exchange. At around 11:24 am, shares of the company were trading 2.31% higher at Rs 228.15. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-may-let-foreign-electric-vehicle-makers-like-tesla-test-market-before-investing-2683262-2025-02-21",
      "headline": "India may let foreign EV makers like Tesla test market before investing: ReportThe government may let foreign electric vehicle makers like Tesla sell cars first and invest later, with final SMEC guidelines expected soon to kickstart local manufacturing incentives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-the-share-market-falling-today-3-key-reasons-to-know-2683247-2025-02-21",
      "headline": "Sensex tanks nearly 500 points. 3 reasons why stock market is falling todayThe S&P BSE Sensex was down 461.08 points to 75,274.88 at 11:32 am and the NSE Nifty50 fell 144.45 points to trade at 22,768.70. Here are 3 things investors need to know about today's stock market downturn."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tanmay-bhat-x-account-hacked-comedian-warns-followers-2685118-2025-02-25",
      "headline": "Tanmay Bhat's X account hacked, comedian warns followersTanmay Bhat's X account recently got hacked, leading to fraudulent messages being posted online. The comedian shared a post on his Instagram and warned his followers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-vrishank-khanal-haldi-pics-pre-wedding-festivties-wedding-karjat-2685070-2025-02-25",
      "headline": "Prajakta Koli-Vrishank Khanal can't take their eyes off each other in haldi picsActor Prajakta Koli is set to marry longtime boyfriend Vrishank Khanan on February 25. Ahead of the grand day, the actor shared pictures from her haldi function. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/anupam-mittal-on-india-got-latent-backlash-not-lost-episode-of-satyamev-jayate-2685071-2025-02-25",
      "headline": "Anupam Mittal on India's Got Latent backlash: Not a lost episode of Satyamev JayateAnupam Mittal weighs in on the India's Got Latent row, arguing that YouTube should also be held accountable. He calls Big Tech the real culprit, criticising digital platforms for fueling outrage-driven content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bobby-deol-says-aashram-helped-him-break-industry-image-explore-new-roles-2685062-2025-02-25",
      "headline": "Bobby Deol says Aashram helped him break industry image, explore new rolesActor Bobby Deol is all set to return as Baba Nirala in Prakash Jha's series, Aashram 3 part 2. The actor confessed that he wanted to step out of his comfort zone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-waking-of-a-nation-trailer-taaruk-raina-fights-to-prove-jallianwala-act-was-planned-2684901-2025-02-24",
      "headline": "Waking of Nation trailer: Taaruk Raina fights to prove Jallianwala Bagh was plannedA new show that explores the events surrounding the Jallianwala Bagh massacre is set to premiere on Sony LIV on March 8. Starring Taaruk Raina in the lead role, the series is titled The Waking of a Nation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-responds-to-rumours-of-drug-use-2684862-2025-02-24",
      "headline": "Singer Justin Bieber responds to rumours of drug useJustin Bieber's representative has reacted to the reports of the singer's drug use and called them false. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/ranveer-allahbadia-runs-to-car-after-recording-statement-in-latent-probe-2684803-2025-02-24",
      "headline": "Ranveer Allahbadia runs to car after recording statement in Latent probeRanveer Allahbadia was clicked in a hurried state, running towards his car as the paparazzi tried to capture his pictures on Monday. The YouTuber visited the Maharashtra Cyber office in Mahape after recording his statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kaushaljis-vs-kaushal-review-a-simple-yet-complex-tale-of-second-chance-in-love-2684706-2025-02-24",
      "headline": "Kaushaljis vs Kaushal review: A simple yet complex tale of second chance in loveReleased-Fri Feb 21, 2025Kaushaljis vs Kaushal movie review: This film is a heartfelt exploration of second chances in love, focusing on a middle-aged couple navigating the complexities of separation and familial expectations. Set in the relatable backdrop of Kannauj, the film captivates with its simplicity and stellar performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dupahiya-trailer-a-wedding-a-missing-bike-and-a-lot-of-chaos-in-offing-2684642-2025-02-24",
      "headline": "Dupahiya trailer: A wedding, a missing bike and a lot of chaos in offingThe first full trailer of Prime Video's upcoming comedy series, Dupahiya, is here. The show will feature actors such as Sparsh Shrivastava and Gajraj Rao in pivotal roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-dances-to-zingaat-with-fiance-at-mehndi-ceremony-watch-2684622-2025-02-24",
      "headline": "Bride-to-Be Prajakta Koli dances to Zingaat with fiance at mehndi ceremony. WatchPrajakta Koli shared glimpses of her mehndi ceremony as she danced joyfully with fiance Vrishank Khanal. The couple is set to marry on February 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zero-day-netflix-review-robert-de-niro-angela-bassett-jesse-plemons-political-drama-2684414-2025-02-24",
      "headline": "Zero Day review: Star power can't save this weakly executed political dramaReleased-Thu Feb 20, 2025Zero Day, directed by Lesli Linka Glatter, is a political drama featuring a stellar cast including Robert De Niro and Angela Bassett. While the performances are strong, the series struggles with plot depth and resolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/watch-jennie-and-doechii-bring-the-heat-with-extral-ahead-of-ruby-2684489-2025-02-24",
      "headline": "Watch: Jennie and Doechii bring the heat with ExtraL ahead of RubyJennie and Doechii are making waves with their latest collaboration, ExtraL. As Jennie gears up for her solo debut with the album Ruby, fans can expect a bold new chapter in her musical journey."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-assembly-session-atishi-aap-mlas-suspended-marshalled-out-uproar-cag-report-rekha-gupta-bjp-2685095-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Atishi, 11 AAP MLAs suspended after chaos over CAG report in Delhi Assembly Live UpdatesAs the Delhi Assembly session commenced for the day, Lt Governor VK Saxena address to the House was disrupted by AAP legislators as they resorted to loud sloganeering against the BJP government. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/usaid-funding-row-bangladesh-first-reaction-anwar-hossain-doge-slashes-money-president-donald-trump-2685088-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Money not seen in our records: Bangladesh official on $29 million USAID grantOn February 16, the Elon Musk-led US Department of Government Efficiency announced its decision to cut $723 million in foreign aid funding, which included $21 million for India and $29 million for Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/united-states-donald-trump-un-resolution-russia-ukraine-war-europe-votes-2684995-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US sides with Russia at UN on Ukraine vote in stunning move, India abstainsThe United Nations General Assembly on Monday adopted two resolutions on Russia's war in Ukraine. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/preity-zinta-statement-after-new-india-cooperative-bank-writes-off-18-crore-loan-2685099-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Preity Zinta blasts Kerala Congress 'for promoting fake news' amid loan claimsPreity Zinita called reports of New India Cooperative Bank writing off her Rs 18-crore loan false. She blasted Congress for promoting fake news by linking her with Bharatiya Janata Party (BJP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/makhana-is-a-super-food-but-its-also-super-expensive-heres-why-2684778-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Makhana is a super food, but it's also super expensive. Here's whyMakhana is a superfood with a super price tag. The real story behind makhana's high cost lies not just in its nutritional value but in the intricate process of harvesting and processing these delicate seeds. As demand continues to rise, understanding the challenges faced by farmers and producers can help them appreciate the true worth of this superfood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/emmanuel-macron-interrupts-donald-trump-fact-checks-ukraine-funding-viral-video-2685030-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Macron intervenes, fact-checks Trump in real time on Ukraine aid: No, we paidAs the US President was answering a question about Europe's funding to Ukraine, Macron grabbed Trump's arm to interrupt him and issued a fact check."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/heatwave-alert-mumbai-thane-raigad-ratnagiri-february-temperature-imd-2685090-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Heatwave to scorch Mumbai, Thane, mercury to touch 38 degrees this weekThe India Meteorological Department issued a heatwave alert for Mumbai, Thane and Maharashtra's Konkan belt, with temperatures likely to be in the range of 37 to 38 degrees Celsius in the coming days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/shows/story/the-buzz-watch-hackers-allegedly-play-ai-video-of-trump-kissing-elon-musks-feet-on-hud-monitors-glbs-2684997-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AI video of Trump kissing Elon Musk's feet played on TVs at US government officeHackers allegedly hijacked HUD building monitors to play an AI-generated video of Trump kissing Musk's feet, mocking their relationship. The incident went viral, sparking online debate and official concern.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/timothee-chalamet-sag-awards-speech-about-aspirations-and-greatness-goes-viral-2685100-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Timothee Chalamet's SAG Awards speech about aspirations and 'greatness' goes viralActor Timothee Chalamet became the youngest person ever to win the Best Actor award at SAG. The 29-year-old owned his win and the stage by delivering a captivating speech about his \"pursuit of greatness\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/lpus-2025-batch-final-year-student-bags-rs-103-crore-118000-placement-package-2682322-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LPU's 2025 Batch Final Year Student Bags Rs 1.03 Crore ($1,18,000) Placement Package-Betireddy Naga Vamsi Reddy B. Tech student has secured a 1.03 Crore ($1,18,000) package with an AI robotics company and is set to graduate in May 2025. \r\n\r\n-Over 1,700 students have received packages ranging from Rs 10 LPA – Rs 1 Crore per annum \r\n\r\n-1,912 students received multiple job offers while Adireddy Vasu, secured 7 job offers, setting a rare and impressive record."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-tunnel-collapse-8-workers-trapped-rat-miners-join-rescue-2685087-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Telangana tunnel collapse: All-out efforts on to rescue 8 trapped men, hopes fadeThe rescue efforts in the Telangana tunnel collapse intensified as expert rat miners began assessing the conditions inside the SLBC tunnel to reach the eight workers trapped inside. The workers were stranded after a concrete segment slipped, blocking their exit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-endorses-vivek-ramaswamy-for-ohio-governor-amid-rift-reports-good-luck-2685109-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk-Vivek Ramaswamy's X-change over Ohio Governor bid: Let's rollElon Musk endorsed his former DOGE partner Vivek Ramaswamy for the post of Governor of Ohio as he launched his campaign on Monday night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/can-the-viral-moroccan-nila-powder-really-help-brighten-your-skin-2684864-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can the viral 'Moroccan Nila powder' really help brighten your skin?Nila Powder is taking the internet by storm, with influencers covering themselves in striking shades of blue to achieve brighter skin. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-thiruvananthapuram-mass-murder-venjaramoodu-family-members-girlfriend-accused-affan-2684957-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man walks into police station, says he killed 6, including mother and girlfriend A 23-year-old man killed four of his family members, including his brother, and his girlfriend at three separate locations in Kerala's Thiruvananthapuram before walking into a police station and surrendering."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pakistani-media-black-magic-theory-on-india-win-champions-trophy-viral-video-2685114-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistani media's bizarre 'black magic' theory on India's win. Watch viral videoA video from a Pakistani news channel featuring a panel discussing how their country lost to India due to 'black magic' has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-keeps-employees-loyal-to-their-company-hr-survey-says-2683290-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What keeps employees loyal to their company? HR survey says…Innovation, upskilling and ample career progression are key factors determining how long employees will stick around, indicates a survey by a top staffing firm\r\n "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/indian-fashion-blooms-on-the-white-lotus-season-3-2685125-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian fashion blooms in The White Lotus season 3The White Lotus Season 3 is back with a hearty dose of drool-worthy vacation style inspiration. This season, the fashion factor boasts an Indian touch as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-ultimatum-email-war-us-federal-employees-firings-confusion-2685139-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk doubles down on mail to federal staff: Will result in terminationElon Musk issued another ultimatum as the deadline to reply to his proof-of-work email ended on Monday. Several US departments asked their employees not to comply with the email."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-tax-regime-save-more-itr-nps-benefit-key-details-explained-2685103-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New Tax Regime: Income up to Rs 13.7 lakh can be tax-free. Here's howFollowing the Union Budget 2025, annual income up to Rs 12 lakh became tax-free. But there's a way to push it even further to Rs 13.7 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtras-buldhana-hair-loss-toxic-wheat-behind-sudden-baldness-study-claims-2684999-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Toxic wheat behind sudden baldness in Maharashtra's Buldhana, study claims Around 300 individuals across 18 villages in Maharashtra's Buldhana--many of them college students and young girls--experienced severe hair loss, with most becoming completely bald. A study has now found the reason."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/who-is-ias-vijay-vardhan-failed-35-government-exams-cracked-upsc-twice-stmp-2685148-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "He failed 35 exams but refused to give up, then cracked UPSC twice and became IASVijay Vardhan from Haryana faced 35 government exam failures before cracking the UPSC civil services exam twice and achieving his dream of becoming an IAS officer. Here's his inspiring story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/maha-kumbh-mela-final-amrit-snan-mahashivratri-1-crore-devotees-prayagraj-uttar-pradesh-2685041-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kumbh Mela area to be no vehicle zone, over 1 crore to attend last Amrit SnanTill date, nearly 64 crore devotees have taken a holy dip in the Triveni Sangam, the confluence of Ganga, Yamuna and Saraswati rivers, since the Maha Kumbh commenced on January 13."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rcb-vs-upw-wpl-richa-ghosh-run-out-ms-dhoni-2685098-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Richa Ghosh pulls off MS Dhoni-like run-out in RCB vs UPW gameRoyal Challengers Bengaluru wicketkeeper Richa Ghosh affected a MS Dhoni-like last-ball run out in the team's WPL game against UP Warriorz. Richa forced the game into WPL's first ever Super Over with some quick thinking.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-proposes-tighter-rules-for-index-derivatives-heres-what-it-means-2685106-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sebi proposes tighter rules for index derivatives. Here's what it meansIn a consultation paper released late Monday, Sebi said it wants to link stock derivative position limits to the cash market. The idea is to cap the market-wide position limit at the lower of 15% of a stock's free-float market cap or 60 times its average daily delivery value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/parineeti-chopra-gears-up-for-her-first-netflix-yet-to-be-titled-thriller-series-2685151-2025-02-25",
      "headline": "Parineeti Chopra gears up for her first Netflix yet-to-be-titled thriller seriesActor Parineeti Chopra is set to make her series OTT debut with a Netflix project. The actor shared a post and informed about sharing screen space with Nimrit Kaur, Soni Razdan, and others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/shah-rukh-khan-hugs-aadar-jain-blesses-alekha-at-their-wedding-2685134-2025-02-25",
      "headline": "Shah Rukh Khan hugs Aadar Jain, blesses Alekha at their weddingShah Rukh Khan attended Aadar Jain and Alekha Advani's wedding in Mumbai, accompanied by Gauri Khan. Dressed in a black suit, SRK posed with the couple and blessed the bride in a candid moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tanmay-bhat-x-account-hacked-comedian-warns-followers-2685118-2025-02-25",
      "headline": "Tanmay Bhat's X account hacked, comedian warns followersTanmay Bhat's X account recently got hacked, leading to fraudulent messages being posted online. The comedian shared a post on his Instagram and warned his followers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/timothee-chalamet-sag-awards-speech-about-aspirations-and-greatness-goes-viral-2685100-2025-02-25",
      "headline": "Timothee Chalamet's SAG Awards speech about aspirations and 'greatness' goes viralActor Timothee Chalamet became the youngest person ever to win the Best Actor award at SAG. The 29-year-old owned his win and the stage by delivering a captivating speech about his \"pursuit of greatness\". "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-knocked-out-cannot-win-tournaments-parthiv-patel-2685105-2025-02-25",
      "headline": "Outdated Pakistan do not have a team that can win tournamentsPakistan's early Champions Trophy exit, despite hosting the tournament, has raised concerns over their cricketing structure. Parthiv Patel and Dinesh Karthik pointed out flaws in the team's approach, coaching setup, and inability to perform in high-pressure ICC events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-virat-kohli-india-vs-pakistan-immortal-class-century-2685115-2025-02-25",
      "headline": "Clash of Champions: Virat Kohli's immortal class proves critics wrong againVirat Kohli has consistently silenced his doubters, proving his class once again with a match-winning century against Pakistan in the Champions Trophy. His redemption should remind fans to stand by their heroes, especially when they face challenging phases in their careers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rcb-vs-upw-wpl-richa-ghosh-run-out-ms-dhoni-2685098-2025-02-25",
      "headline": "Watch: Richa Ghosh pulls off MS Dhoni-like run-out in RCB vs UPW gameRoyal Challengers Bengaluru wicketkeeper Richa Ghosh affected a MS Dhoni-like last-ball run out in the team's WPL game against UP Warriorz. Richa forced the game into WPL's first ever Super Over with some quick thinking.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ms-dhoni-new-bat-weight-less-ipl-2025-csk-2685077-2025-02-25",
      "headline": "MS Dhoni set to use new bats for IPL 2025, says reportLegendary MS Dhoni might be using new bats for the upcoming edition of the Indian Premier League. A report suggests that Dhoni might reduce the weight of his bat for the 2025 season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-new-zealand-vs-bangladesh-najmul-shanto-batting-feilding-improvement-2685064-2025-02-25",
      "headline": "Shanto urges batting, fielding improvement after Bangladesh's crash outBangladesh captain Najmul Shanto defended his team's bowling efforts in the Champions Trophy despite their early exit but admitted the need for major improvements in batting and fielding. Expressing disappointment, he lamented yet another embarrassing ICC tournament failure for his side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-new-zealand-vs-bangladesh-rachin-ravindra-simple-batting-century-2685053-2025-02-25",
      "headline": "NZ's Rachin Ravindra reveals reason behind 'simple' batting vs BangladeshNew Zealand's Rachin Ravindra credited his ability to adapt to conditions in Rawalpindi for making his century against Bangladesh look effortless. In his comeback match from injury, Ravindra found the perfect balance between timing and aggression against a strong Bangladesh bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-brydon-carse-ruled-out-injury-england-vs-aghanistan-rehand-ahmed-replacement-2685042-2025-02-25",
      "headline": "England's Brydon Carse out of Champions Trophy, Rehan Ahmed to join squadEngland suffered a major blow as Brydon Carse was ruled out of the Champions Trophy due to a toe injury. Rehan Ahmed replaces him, but he won't arrive in time for England's must-win clash against Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-unwanted-record-knocked-out-new-zealand-vs-bangladesh-2685028-2025-02-25",
      "headline": "Champions Trophy exit in 6 days: Pakistan end 16-year tournament streak6 days after the start of the tournament, Pakistan were unceremoniously dumped out of the Champions Trophy 2025. Pakistan lost their matches against New Zealand and India in embarrassing fashion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-bagladesh-rachin-ravindra-freak-injury-comeback-century-2685021-2025-02-25",
      "headline": "From face injury to Champions Trophy 100: NZ's Ravindra reflects on comebackRachin Ravindra credited New Zealand's coaches, doctors, and family for his successful return from injury, marking his comeback with a stunning century against Bangladesh that sealed the Black Caps' Champions Trophy semi-final spot in a dominant victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-south-africa-preview-pitch-report-rawalpindi-2684853-2025-02-25",
      "headline": "AUS vs SA: Run-fest on cards as Australia, South Africa aim to boost semis hopesAustralia and South Africa are all set to lock horns in what promises to be a run-fest in Rawalpindi on February 25. Both teams will be looking to boost their semi-final hopes with a win and go to the top of Group B. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-rcb-up-warriorz-perry-ecclestone-2684968-2025-02-24",
      "headline": "Sophie Ecclestone heroics helps Warriorz beat RCB in historic Super Over WPL 2025: Deepti Sharma's UP Warriorz beat Smriti Mandhana's Royal Challengers Bengaluru (RCB) in a thrilling Super Over on Monday, February 24 at the M Chinnaswamy Stadium in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-brydon-carse-ruled-out-injury-england-vs-aghanistan-rehand-ahmed-replacement-2685042-2025-02-25",
      "headline": "England's Brydon Carse out of Champions Trophy, Rehan Ahmed to join squadEngland suffered a major blow as Brydon Carse was ruled out of the Champions Trophy due to a toe injury. Rehan Ahmed replaces him, but he won't arrive in time for England's must-win clash against Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-unwanted-record-knocked-out-new-zealand-vs-bangladesh-2685028-2025-02-25",
      "headline": "Champions Trophy exit in 6 days: Pakistan end 16-year tournament streak6 days after the start of the tournament, Pakistan were unceremoniously dumped out of the Champions Trophy 2025. Pakistan lost their matches against New Zealand and India in embarrassing fashion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-bagladesh-rachin-ravindra-freak-injury-comeback-century-2685021-2025-02-25",
      "headline": "From face injury to Champions Trophy 100: NZ's Ravindra reflects on comebackRachin Ravindra credited New Zealand's coaches, doctors, and family for his successful return from injury, marking his comeback with a stunning century against Bangladesh that sealed the Black Caps' Champions Trophy semi-final spot in a dominant victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-south-africa-preview-pitch-report-rawalpindi-2684853-2025-02-25",
      "headline": "AUS vs SA: Run-fest on cards as Australia, South Africa aim to boost semis hopesAustralia and South Africa are all set to lock horns in what promises to be a run-fest in Rawalpindi on February 25. Both teams will be looking to boost their semi-final hopes with a win and go to the top of Group B. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-rcb-up-warriorz-perry-ecclestone-2684968-2025-02-24",
      "headline": "Sophie Ecclestone heroics helps Warriorz beat RCB in historic Super Over WPL 2025: Deepti Sharma's UP Warriorz beat Smriti Mandhana's Royal Challengers Bengaluru (RCB) in a thrilling Super Over on Monday, February 24 at the M Chinnaswamy Stadium in Bengaluru. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}