{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-letter-of-intent-elon-musks-satellite-internet-venture-starlink-2721230-2025-05-07",
      "headline": "Government issues Letter of Intent to Musk's satellite internet venture StarlinkPrior to this, the government had issued licences to Eutelsat OneWeb and Jio Satellite Communications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ulips-mutual-funds-or-stocks-what-is-the-best-for-long-term-wealth-creation-2721078-2025-05-07",
      "headline": "ULIPs, mutual funds or stocks: What's the best for long-term wealth creation?Mutual funds, ULIPs, and stocks offer different paths to wealth. While ULIPs mix insurance with investment, mutual funds offer flexibility and professional management. Stocks offer high returns but carry more risk and demand expertise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-nps-rules-how-to-close-your-account-after-renouncing-indian-citizenship-2721011-2025-05-07",
      "headline": "New NPS rules: How to close your account after renouncing Indian citizenshipAny Indian citizen aged between 18 and 70 years can open an NPS account. Additionally, Non-Resident Indians (NRIs) and Overseas Citizens of India (OCIs) can also open an NPS account, as long as they meet the necessary requirements set by the PFRDA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-106-points-higher-nifty-above-24400-tata-motors-jumps-5-2720999-2025-05-07",
      "headline": "Sensex ends 106 points higher, Nifty above 24,400; Tata Motors jumps 5%The BSE Sensex was up 105.71 points higher to 80,746.78 at the closing bell, while the NSE Nifty50 rose 34.80 points to settle at 24,414.40. Most of the broader market indices also recovered after falling in early trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hdfc-bank-trims-these-lending-rates-mclr-from-may-7-will-your-emis-go-down-2720970-2025-05-07",
      "headline": "HDFC Bank trims these lending rates from May 7. Will your EMIs go down?This move comes shortly after the Reserve Bank of India (RBI) cut the repo rate by 25 bps in April, taking the total cut to 50 bps since February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/operation-sindoor-how-will-stock-markets-react-to-rising-indo-pak-tensions-2720948-2025-05-07",
      "headline": "Operation Sindoor: Should Dalal Street investors worry about what's next?There was no sell-off, no bloodbath, just a bit of volatility. For many retail investors, the calm felt unusual — shouldn't a military flare-up between nuclear neighbours spook the markets? But past data suggests otherwise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/taking-a-personal-loan-for-wedding-here-are-6-key-tips-to-keep-in-mind-2720932-2025-05-07",
      "headline": "Taking a personal loan for a wedding? Here are 6 key tips to keep in mindWeddings can tempt us to go overboard, but it's best to plan a realistic budget. See where you can cut costs or use your savings first. Borrow just the amount you really need, don't take a bigger loan just because you're eligible for it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-heres-how-to-choose-the-right-tax-regime-old-tax-regime-new-tax-regime-standard-deduction-2720891-2025-05-07",
      "headline": "Filing ITR? Here's how to choose the right tax regimeWhile the new regime offers reduced tax slabs, it doesn't let you claim the usual deductions available under the old regime. It's lower rates, but with fewer tax-saving options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-benefits-impact-goods-cheaper-costlier-decoded-2720888-2025-05-07",
      "headline": "Whisky, cars, and jobs: Inside India's game-changing UK free trade pactThe India-UK trade deal holds significance in a world drifting back toward trade barriers and tariff wars. With Trump-era protectionism rearing its head again, the timing of this pact couldn't be better."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pwc-to-lay-off-2-percent-of-us-workforce-report-2720852-2025-05-07",
      "headline": "PwC to cut 1,500 jobs in the US: ReportLast year, PwC was in the news for possibly cutting half of its auditing staff in China's financial services sector. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pakistan-karachi-stock-exchange-crashes-nearly-6-percent-operation-sindoor-military-strike-impact-2720824-2025-05-07",
      "headline": "Pakistan's Karachi Stock Exchange crashes nearly 6% after 'Operation Sindoor'The Karachi Stock Exchange 100 index (KSE-100) plunged 6,272 points in early trade, sliding to 107,296.64 — a sharp drop from Tuesday's close of 113,568.51."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/info-edge-share-price-down-80-percent-bse-trading-apps-reason-explained-2720820-2025-05-07",
      "headline": "Explained: Why Info Edge shares look like they've crashed 80% todayInfo Edge shares traded ex-split today after the company carried out a 1:5 stock split, its first since its 2006 listing. As a result, each share with a face value of Rs 10 has been subdivided into five shares of Rs 2 each."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/3-doors-downs-brad-arnold-diagnosed-with-stage-4-kidney-cancer-glbs-2721304-2025-05-08",
      "headline": "3 Doors Down's Brad Arnold diagnosed with stage 4 kidney cancerBrad Arnold of 3 Doors Down has been diagnosed with stage 4 kidney cancer, prompting tour cancellation. Despite the seriousness, he remains calm and hopeful, asking fans for prayers and support.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hips-dont-lie-turns-20-shakira-and-wyclef-jean-perform-iconic-hit-live-glbs-2721292-2025-05-08",
      "headline": "Hips Don't Lie turns 20: Shakira and Wyclef Jean perform iconic hit liveShakira and Wyclef Jean celebrated the 20th anniversary of Hips Don't Lie with a live reunion on The Tonight Show. She kicks off her largest stadium tour in May 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ladies-of-london-returns-bravo-unveils-2025-reality-show-lineup-glbs-2721287-2025-05-08",
      "headline": "Ladies of London Returns: Bravo unveils 2025 reality show lineupBravo is expanding its reality TV lineup with four new shows in 2025, including Real Housewives of Rhode Island and a Ladies of London reboot, while also bringing back several fan favorites.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jury-in-diddys-sex-trafficking-trial-to-be-finalized-friday-trial-starts-monday-glbs-2721283-2025-05-08",
      "headline": "Jury in Diddy's sex trafficking trial to be finalized Friday, trial starts MondayJury selection in Sean \"Diddy\" Combs' federal trial wraps on Friday, with opening statements set for Monday. He faces life in prison over serious sex trafficking and racketeering charges.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-on-her-pregnancy-journey-2721175-2025-05-07",
      "headline": "Deepika Padukone on her pregnancy: I went through a lotDeepika Padukone, who recently welcomed her baby girl Dua, opened up about her tough pregnancy journey and the emotional meaning behind her daughter's name. The actor is currently enjoying motherhood and has not announced her next film yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neil-nitin-mukesh-praises-deepika-padukone-she-inspires-me-2721186-2025-05-07",
      "headline": "Neil Nitin Mukesh wants to work with Deepika Padukone again: She inspires meActor Neil Nitin Mukesh reminisces about his experience working with Deepika Padukone in 'Lafangey Parindey', highlighting their bond and his admiration for her dedication and talent. Despite busy lives, Neil cherishes their friendship and wishes to reunite with her on screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-shares-first-look-poster-from-nc-24-his-first-pan-india-film-begins-shoot-2721076-2025-05-07",
      "headline": "Naga Chaitanya begins shoot for his first pan-India film NC 24Naga Chaitanya, riding high on the success of his recent release 'Thandel', released the first-look poster of his next film, a sci-fi action adventure, tentatively titled 'NC24'. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dulquer-salmaan-shares-adorable-moment-with-daughter-maryam-ameerah-salmaan-on-superbike-2721156-2025-05-07",
      "headline": "Dulquer Salmaan shares adorable moment with daughter on superbike. See picDulquer Salmaan was seen teaching his daughter Maryam to handle a bike on her 8th birthday, winning hearts online. The cute father-daughter moment came during a week full of celebrations in the Mammootty family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-reacts-to-career-destroyer-tag-says-i-just-do-my-job-2721129-2025-05-07",
      "headline": "Karan Johar reacts to 'career destroyer' tag, says 'I just do my job'Filmmaker Karan Johar responded to criticism claiming he has negatively impacted careers in Bollywood, stating that his support for outsiders is often overlooked, while the focus remains solely on the star kids he has launched."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hina-khan-begins-her-highly-exciting-trip-to-south-korea-shares-pictures-2721083-2025-05-07",
      "headline": "Hina Khan begins her 'highly exciting' trip to South Korea, shares photosHina Khan has embarked on her first trip to South Korea, calling it a 'much-needed' and 'highly exciting' journey. While battling cancer, she is enjoying traveling again and sharing happy moments with her fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/21-years-of-arya-allu-arjun-film-that-changed-his-life-forever-2721067-2025-05-07",
      "headline": "21 years of Arya, a film that changed Allu Arjun's life foreverAllu Arjun celebrates 21 years of Arya today - the film that marked the beginning of his career-changing journey. Reflecting on its impact, he expressed gratitude for the love and memories it created."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-to-be-honoured-with-humanitarian-award-at-72-miss-world-for-covid-19-relief-work-2721046-2025-05-07",
      "headline": "Sonu Sood to be honoured with Humanitarian Award for Covid-19 relief workActor Sonu Sood will receive the Humanitarian Award at the Miss World 2025 grand finale. The award will recognise Sood for his contributions during the Covid-19 pandemic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amul-tribute-shah-rukh-khan-met-gala-2025-debut-2721038-2025-05-07",
      "headline": "Amul celebrates Shah Rukh Khan aka 'India's Biggest Galakaar' after Met debutAmul celebrated Shah Rukh Khan's Met Gala debut in their new post, calling the actor 'India's biggest Galakaar'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-equal-pay-debut-production-film-subham-all-set-for-release-on-may-9-2721006-2025-05-07",
      "headline": "Samantha bats for equal pay as debut production film Subham gears up for releaseActor Samantha advocated for equal pay in a recent media interaction. Her debut production film, 'Subham' is all set for a grand release on May 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ahilyabai-biopic-announced-by-maharashtra-government-for-300th-birth-anniversary-2720979-2025-05-07",
      "headline": "Maharashtra government announces a biopic on AhilyabaiThe Maharashtra government will make a film on Ahilyabai Holkar's life for her 300th birth anniversary in 2025. The movie will be shown on Doordarshan and OTT platforms in Marathi and other languages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-kantara-2-sets-junior-artiste-dies-by-drowning-2720935-2025-05-07",
      "headline": "Junior artiste dies by drowning on Rishab Shetty's Kantara 2 setsRishab Shetty's 'Kantara: Chapter 1' has consistently faced several problems during its production. Now, a junior artiste from Kerala died by drowning on the sets of the highly anticipated film on Tuesday afternoon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-allu-arjun-mohanlal-celebs-hail-indian-forces-after-operation-sindoor-2720940-2025-05-07",
      "headline": "Mammootty, Allu Arjun, Mohanlal, celebs salute Indian forces for Operation SindoorFrom Mammootty and Mohanlal to Kichcha Sudeep and Samantha, celebrities across Indian cinema praised the Armed Forces and expressed solidarity following India's counterstrike on terror camps in Pakistan and Pakistan-occupied Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-defends-patriotism-in-cinema-amid-propaganda-debates-2720933-2025-05-07",
      "headline": "Exclusive: Suniel Shetty defends patriotism in cinema amid 'propaganda' debatesBollywood actor Suniel Shetty discusses the significance of patriotism in cinema, particularly through historical films like 'Kesari Veer'. Amid debates on propaganda in films, Shetty emphasises unity and empathy, asserting that such stories aim to celebrate and protect India's diverse history without inciting division.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neil-nitin-mukesh-regrets-rejecting-sondhi-rahul-bose-role-in-atul-sabharwal-film-berlin-exclusive-2720939-2025-05-07",
      "headline": "Exclusive: Neil Nitin Mukesh regrets rejecting a role in BerlinNeil Nitin Mukesh expresses regret over not taking a role in the film 'Berlin', realising its potential only after watching it. He attributes his decision to prior commitments and concerns about age-drafting for another project."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-sources-2-pronged-attack-air-force-army-terror-camps-pakistan-pok-2721188-2025-05-07",
      "headline": "Air Force in sky, Army on ground: Sources on 2-pronged attack on terror campsWhile the Indian Air Force (IAF) carried out air-to-surface missile attacks, the Indian Army simultaneously launched surface-to-surface missiles in Pakistan and POK, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-cross-border-shelling-along-loc-jk-kupwara-2721288-2025-05-08",
      "headline": "Pak initiates cross-border shelling along LoC in J&K's KupwaraPakistani troops resorted to cross-border shelling along the Line of Control (LoC) in Kupwara district of Jammu and Kashmir for the second consecutive day on Thursday, a day after Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-major-press-conference-oval-office-white-house-united-states-trade-deal-big-highly-respected-nation-2721331-2025-05-08",
      "headline": "Trump teases trade deal with 'big, highly respected country' tomorrowUS President Donald Trump teased the announcement of a major trade deal with a \"big, and highly respected, country\" on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-shabhashi-those-came-up-with-operation-sindoor-codename-image-2721275-2025-05-08",
      "headline": "Shashi Tharoor's 'shabhashi' to those who came up with Op Sindoor codename, imageCongress MP Shashi Tharoor praised the government and armed forces following the high-intensity cross-border strikes codenamed Operation Sindoor. The Congress MP praised both the operation, its name and image."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/papal-conclave-no-pope-elected-on-first-day-glbs-2721276-2025-05-08",
      "headline": "No pope elected on first day, black smoke emerges from Sistine ChapelBlack smoke rose from the Sistine Chapel chimney Wednesday night, signaling no pope was elected in the first conclave vote. Cardinals will resume voting Thursday as thousands wait in St. Peter's Square for white smoke to announce a new pontiff.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/we-will-avenge-pak-pm-shehbaz-sharif-vows-retaliation-in-address-to-nation-after-india-strikes-glbs-2721290-2025-05-08",
      "headline": "'We will avenge': Pak PM Shehbaz Sharif vows retaliation in address to nationPakistan PM Shehbaz Sharif vowed retaliation after India's major cross-border strikes hit nine terror sites in Pakistan and PoK. In his address to the nation, he called it a direct assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retires-test-cricket-india-tour-of-england-2721160-2025-05-07",
      "headline": "Rohit Sharma announces Test retirement via Insta story, to continue in ODIsCaptain Rohit Sharma announced his retirement from Test cricket. His decision comes days ahead of the selection of India's squad for the tour of England. The 38-year-old said he will continue to play for India in one-day internationals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-live-updates-indian-armed-forces-carried-out-precision-strike-at-terrorist-camps-2720648-2025-05-07",
      "headline": "Live: India activates all air defence units along LoC as Pak continues shellingOperation Sindoor Live Updates: India carried out precision strikes on terror camps in Pakistan and Pakistan-occupied Kashmir in response to the April 22 Pahalgam terror attack which killed 26 people. The government said its actions have been \"focused, measured and non-escalatory in nature\" and that \"no Pakistani military facilities have been targeted\". Prime Minister Narendra Modi told his colleagues in the Cabinet meeting that it was a proud moment for everyone following the operation. The government will hold an all-party meeting at 11 am today following Operation Sindoor.  Follow Indiatoday.in for the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-pm-narendra-modi-one-move-several-targets-starring-grandmaster-geopolitics-2721027-2025-05-07",
      "headline": "One move, several targets: Operation Sindoor starring Modi as grandmaster of geopoliticsOn the face of it, 'Operation Sindoor' is a coordinated strike on 9 targets in Pakistan and the parts of Kashmir it occupies. But before making this audacious move, Modi had already placed several pieces on the board, offering deep insights into his understanding of warfare and India's society and politics."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jawan-dies-pakistan-shelling-loc-jammu-and-kashmir-india-strike-terror-camps-dinesh-kumar-2721258-2025-05-07",
      "headline": "Jawan dies in Pak shelling along LoC in J&K after India's strike on terror campsAn Indian jawan was killed in Pakistan shelling along the Line of Control (LoC) in Jammu and Kashmir. This comes after India struck nine terror camps in Pakistan and Pakistan-occupied Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-terrorists-killed-india-strikes-pakistan-pak-terror-camp-bahawalpur-lashkar-2720720-2025-05-07",
      "headline": "Operation Sindoor - 25 minutes and 9 targets in Pak, PoK; 80 terrorists killedOperation Sindoor: More than 80 terrorists were killed in the cross-border precision strikes, which lasted just 25 minutes. The government said the military action was measured and the targets were selected based on credible intel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pak-army-vehicle-targeted-balochistan-blast-soldiers-dead-injured-2720524-2025-05-06",
      "headline": "12 Pak soldiers killed in blast targeting Army vehicle in Balochistan: ReportAn IED blast targeting a Pakistan Army vehicle killed twelve personnel in the restive southern province of Balochistan. According to the army, the Balochistan Liberation Army (BLA) was behind the attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-retirement-kkr-vs-csk-eden-gardens-kolkata-2721270-2025-05-08",
      "headline": "Dhoni breaks silence on potential retirement: Nothing for me to decide as of nowMS Dhoni commented on his potential retirement and claimed that there is nothing for him to decide at the moment. Dhoni said he will look at the six to eight months after the IPL and make a call. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-shashi-tharoor-praises-operation-sindoor-strike-terror-camps-pakistan-pok-2721251-2025-05-07",
      "headline": "Calibrated, calculated strike: Shashi Tharoor's big praise for Operation SindoorShashi Tharoor praised the precision of India's strikes on terror camps in Pakistan and Pakistan-occupied Kashmir. \"It was extremely well done. India hit legitimate target,\" Tharoor said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-no-grip-balochistan-quetta-security-especially-after-dark-former-pm-shahid-khaqan-abbasi-2721118-2025-05-07",
      "headline": "Pak has no grip on Balochistan, especially after dark, says former PMFormer Pakistani Prime Minister Shahid Khaqan Abbasi has revealed that both the federal government and the army are losing control over the restive province of Balochistan, especially after nightfall. He said senior government officials and ministers cannot move around in Balochistan without security escorts. Abbasi also challenged the narrative of Army Chief Asim Munir regarding the scale of rebellion in Balochistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/operation-sindoor-pakistan-shuts-airspace-over-lahore-islamabad-airports-amid-cross-border-tensions-glbs-2721285-2025-05-08",
      "headline": "Pakistan shuts airspace over Lahore, Islamabad airports amid cross-border tensionsPakistan closed its airspace after India launched Operation Sindoor, targeting terror sites in Pakistan and PoK. Islamabad condemned the strikes and warned of retaliation, citing civilian casualties.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/colonel-courageous-who-is-sophia-qureshi-the-army-officer-shining-at-op-sindoor-briefing-2721136-2025-05-07",
      "headline": "Colonel Courageous: Who is Sophia Qureshi, the army officer shining at Op Sindoor briefing?Col. Qureshi is an icon for young Indians who encourages women to join the military. Her message: \"Join the Army. Work hard for India and make everyone proud\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/putin-orders-three-day-truce-in-ukraine-ceasefire-now-in-effect-glbs-2721282-2025-05-08",
      "headline": "Putin's three-day ceasefire with Ukraine begins as Victory Day nearsA temporary ceasefire between Russia and Ukraine has come into effect after an order by President Vladimir Putin, Russian state media reported on Thursday. The three-day truce is now in place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-csk-dewald-brevis-noor-ahmad-urvil-patel-varun-chakravarthy-2721237-2025-05-07",
      "headline": "Dewald Brevis, Noor help CSK snap losing streak, dent KKR playoffs hopesChennai Super Kings (CSK) ended their four-match losing streak with a two-wicket win over Kolkata Knight Riders (KKR) in Match 57 of the Indian Premier League 2025 (IPL 2025). Dewald Brevis (52 off 25) and Noor Ahmad (4/31) played a key role in CSK's win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kkr-vs-csk-ipl-match-kolkata-eden-gardens-cricket-association-bengal-bomb-threat-mail-2721204-2025-05-07",
      "headline": "Bomb threat mail to Bengal cricket body amid KKR vs CSK matchThe Cricket Association of Bengal got a bomb threat mail during the KKR vs CSK match at Kolkata's Eden Gardens on Wednesday, May 7. The security at the Eden Gardens has been beefed up after the threat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-reacts-to-career-destroyer-tag-says-i-just-do-my-job-2721129-2025-05-07",
      "headline": "Karan Johar reacts to 'career destroyer' tag, says 'I just do my job'Filmmaker Karan Johar responded to criticism claiming he has negatively impacted careers in Bollywood, stating that his support for outsiders is often overlooked, while the focus remains solely on the star kids he has launched."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/school-students-cab-driver-killed-in-car-tipper-truck-collision-in-punjab-2721152-2025-05-07",
      "headline": "6 school students, cab driver killed in car-tipper truck collision in PunjabAnother student, who was onboard the ill-fated school cab, was admitted to a nearby hospital in a critical condition. He is currently admitted to the Intensive Care Unit (ICU)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-precision-strikes-indian-army-video-pakistan-pak-occupied-kashmir-2721030-2025-05-07",
      "headline": "Target locked, missile fired: Videos show India's precision strikes in Pak, POKNine targets-- Sawai Nalla, Sarjal, Muridke, Kotli, Kotli Gulpur, Mehmoona Joya, Bhimber and Bahawalpur – in Pakistan and Pakistan-occupied Kashmir were carefully chosen and hit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-retirement-kkr-vs-csk-eden-gardens-kolkata-2721270-2025-05-08",
      "headline": "Dhoni comments on potential retirement: Nothing for me to decide as of nowMS Dhoni commented on his potential retirement and claimed that there is nothing for him to decide at the moment. Dhoni said he will look at the six to eight months after the IPL and make a call. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharmas-wife-ritika-sajdeh-reacts-to-his-test-retirement-2721265-2025-05-07",
      "headline": "Rohit Sharma's wife Ritika reacts to his Test retirement in emotional Instagram storyIndia captain Rohit Sharma's wife, Ritika Sajdeh, has given an emotional reaction to his Test retirement on her Instagram story. Rohit hung up his boots from the longest format after playing 67 matches and scoring 4301 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-csk-dewald-brevis-noor-ahmad-urvil-patel-varun-chakravarthy-2721237-2025-05-07",
      "headline": "Dewald Brevis, Noor help CSK snap losing streak, dent KKR playoffs hopesChennai Super Kings (CSK) ended their four-match losing streak with a two-wicket win over Kolkata Knight Riders (KKR) in Match 57 of the Indian Premier League 2025 (IPL 2025). Dewald Brevis (52 off 25) and Noor Ahmad (4/31) played a key role in CSK's win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-test-retirement-gautam-gambhir-rishabh-pant-indian-cricket-2721247-2025-05-07",
      "headline": "Rohit Sharma Test retirement: Gautam Gambhir, Rishabh Pant and cricketing world reactGautam Gambhir, Rishabh Pant and others paid tribute to Rohit Sharma after the 38-year-old announced his decision to retire from Test cricket. Rohit announced his decision on May 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retirement-msk-prasad-exclusive-odi-world-cup-2721217-2025-05-07",
      "headline": "Rohit Sharma's Test retirement before England tour a selfless call: MSK PrasadSpeaking to IndiaToday.in, former chairman of the selection committee MSK Prasad praised Rohit Sharma for announcing his retirement ahead of the upcoming England tour. Prasad also reflected on the decision to promote Rohit to open in Tests, a move that played a key role in reviving his career in red-ball cricket."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-devdutt-padikkal-injured-mayank-agarwal-harry-brook-dc-2721218-2025-05-07",
      "headline": "IPL 2025: RCB lose Devdutt Padikkal to injury, DC sign Harry Brook replacementRCB suffer a big blow as Devdutt Padikkal has been ruled out of the remainder of the season due to an injury. Bengaluru have signed Mayank Agarwal as Padikkal's replacement for the rest of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-honours-indian-armed-forces-operation-sindoor-during-kkr-vs-csk-game-2721213-2025-05-07",
      "headline": "IPL 2025: BCCI honours Indian armed forces' Operation Sindoor during KKR vs CSK gameThe Board of Control for Cricket in India (BCCI) honoured the Indian Armed Forces' Operation Sindoor, which targeted terrorist infrastructure in Pakistan and Pakistan-Occupied Kashmir (PoK) in the aftermath of the Pahalgam terrorist attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-test-retirement-indias-new-test-captain-england-tour-2721203-2025-05-07",
      "headline": "Who will replace Rohit Sharma as Test Captain for England Test series?Following Rohit Sharma's Test retirement ahead of the all-important England tour, the Indian team is left with massive shoes to fill in. There are five candidates who could be the ideal fit as Rohit's successor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kkr-vs-csk-ipl-match-kolkata-eden-gardens-cricket-association-bengal-bomb-threat-mail-2721204-2025-05-07",
      "headline": "Bomb threat mail to Bengal cricket body amid KKR vs CSK matchThe Cricket Association of Bengal got a bomb threat mail during the KKR vs CSK match at Kolkata's Eden Gardens on Wednesday, May 7. The security at the Eden Gardens has been beefed up after the threat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-test-retirement-indian-team-fans-reaction-2721178-2025-05-07",
      "headline": "Thank you Rohit Sharma: Fans pay tribute to India captain after Test retirementFans paid tribute to Rohit Sharma after the 38-year-old announced his decision to retire from Tests with immediate effect on Wednesday, May 7. Rohit announced his decision via an Instagram story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retires-test-cricket-india-tour-of-england-2721160-2025-05-07",
      "headline": "Rohit Sharma announces Test retirement via Insta story, to continue in ODIsCaptain Rohit Sharma announced his retirement from Test cricket. His decision comes days ahead of the selection of India's squad for the tour of England. The 38-year-old said he will continue to play for India in one-day internationals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-honours-indian-armed-forces-operation-sindoor-during-kkr-vs-csk-game-2721213-2025-05-07",
      "headline": "IPL 2025: BCCI honours Indian armed forces' Operation Sindoor during KKR vs CSK gameThe Board of Control for Cricket in India (BCCI) honoured the Indian Armed Forces' Operation Sindoor, which targeted terrorist infrastructure in Pakistan and Pakistan-Occupied Kashmir (PoK) in the aftermath of the Pahalgam terrorist attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-test-retirement-indias-new-test-captain-england-tour-2721203-2025-05-07",
      "headline": "Who will replace Rohit Sharma as Test Captain for England Test series?Following Rohit Sharma's Test retirement ahead of the all-important England tour, the Indian team is left with massive shoes to fill in. There are five candidates who could be the ideal fit as Rohit's successor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kkr-vs-csk-ipl-match-kolkata-eden-gardens-cricket-association-bengal-bomb-threat-mail-2721204-2025-05-07",
      "headline": "Bomb threat mail to Bengal cricket body amid KKR vs CSK matchThe Cricket Association of Bengal got a bomb threat mail during the KKR vs CSK match at Kolkata's Eden Gardens on Wednesday, May 7. The security at the Eden Gardens has been beefed up after the threat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-test-retirement-indian-team-fans-reaction-2721178-2025-05-07",
      "headline": "Thank you Rohit Sharma: Fans pay tribute to India captain after Test retirementFans paid tribute to Rohit Sharma after the 38-year-old announced his decision to retire from Tests with immediate effect on Wednesday, May 7. Rohit announced his decision via an Instagram story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retires-test-cricket-india-tour-of-england-2721160-2025-05-07",
      "headline": "Rohit Sharma announces Test retirement via Insta story, to continue in ODIsCaptain Rohit Sharma announced his retirement from Test cricket. His decision comes days ahead of the selection of India's squad for the tour of England. The 38-year-old said he will continue to play for India in one-day internationals. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}