{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-portfolio-strategy-after-budget-trade-deals-volatility-silver-gold-etf-sgbs-2864926-2026-02-08",
      "headline": "Are mutual funds really the best place to invest your money right now?Headlines around the India–US trade deal, India–EU FTA, Budget 2026, sharp moves in gold and silver and a sudden sell-off in IT stocks have come in quick succession, and when so much happens at once, many investors fall into the trap of reacting to every market move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-today-exclusive-piyush-goyal-india-open-agriculture-dairy-sectors-us-bilateral-trade-deal-2864754-2026-02-07",
      "headline": "India agreed to open agriculture, dairy sectors to US players? Piyush Goyal answersEarlier, Piyush Goyal shared the details of the deal that followed a framework interim trade agreement between the two countries, aimed at boosting exports, jobs and market access. The trade deal will formally be signed in March."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-bilateral-trade-agreement-reduced-18-per-cent-us-tariffs-on-india-effective-all-about-it-2864659-2026-02-07",
      "headline": "Reduced US tariffs of 18% on India come into effect. What it meansThe agreement will reduce US reciprocal duties on Indian exports to 18 per cent, while scrapping tariffs entirely on items such as generic medicines, gems and diamonds, and aircraft components—opening up stronger export prospects across several key sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-bilateral-framework-boost-exports-safeguard-interest-farmers-piyush-goyal-2864639-2026-02-07",
      "headline": "India-US trade deal to boost exports, safeguard farmers' interests: Piyush GoyalUnion Commerce and Industry Minister Piyush Goyal said the India-US interim trade framework is a historic step toward achieving USD 500 billion in bilateral trade. He announced that reciprocal tariffs on Indian exports to the US will fall sharply from 50% to 18%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-poses-no-threat-to-farmers-msmes-piyush-goyal-rebuts-criticism-2864611-2026-02-07",
      "headline": "Protection of farmers' interest in US deal surprised some: Govt's dig at OppositionPiyush Goyal dismissed criticism that the India-US trade deal would harm farmers and small producers, asserting that the interim framework fully safeguards their interests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diamonds-pharma-items-smartphone-parts-to-face-zero-tariffs-piyush-goyal-on-india-us-trade-deal-2864608-2026-02-07",
      "headline": "How India flipped the agri script on Trump? Piyush Goyal revealsUnion Minister Piyush Goyal stressed that India maintained its red lines on agriculture and dairy in its trade deal with the US, while opening its market selectively for certain items like wines and spirits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/worlds-top-10-richest-donate-half-their-wealth-what-happens-global-poverty-healthcare-2864330-2026-02-07",
      "headline": "What happens if the world's 10 richest people donate half their wealth?A trillion dollars from the world's richest may feel impossible, but pledges like Vedanta chairman Anil Agarwal's prove that big commitments are possible. Imagine what happens if the top ten step forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-18-percent-reciprocal-tariffs-items-list-2864527-2026-02-07",
      "headline": "India–US trade deal: Decoding impact of lower 18% tariffs and duty-free boostIndian goods that were slammed with nearly 50% US tariffs last year will now face only 18%, and some key sectors even go duty-free. Here's how the interim pact changes the outlook for exporters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-interim-trade-deal-500-billion-products-tariff-trump-modi-washington-2864515-2026-02-07",
      "headline": "India to buy $500 billion of US goods in 5 years as new trade deal cuts tariffsIndia's USD 500 billion buying plan will anchor the interim trade framework, as New Delhi will cut tariffs on US goods and Washington will lower duties on Indian exports to 18 per cent under the proposed bilateral pact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-interim-trade-agreement-framework-key-points-benefits-explained-2864509-2026-02-07",
      "headline": "18% tariff, wider US market access: How India gains from trade pact with USIndia and the US have finally agreed on a framework for an interim trade agreement. In this article, we break down what it means and why it matters for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-framework-trump-tariffs-markets-open-lakhs-of-jobs-piyush-goyal-2864501-2026-02-07",
      "headline": "Tariffs to fall, markets to open, lakhs of jobs: Piyush Goyal on India-US dealThe agreement will see the US cut reciprocal tariffs on Indian goods to 18 per cent and eliminate duties on products such as generic pharmaceuticals, gems and diamonds, and aircraft parts, boosting export opportunities across key sectors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-india-release-framework-for-interim-trade-deal-2864482-2026-02-07",
      "headline": "India, US unveil interim trade pact; cut tariffs, open $30 trillion marketThe India-US trade deal marks a reset in trade ties, cutting Trump tariffs to 18 per cent and setting the stage for a sweeping bilateral deal amid geopolitical recalibrations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stocks-hit-historic-milestone-as-dow-jones-crosses-50000-points-for-first-time-ever-2864480-2026-02-07",
      "headline": "US stocks hit historic milestone as Dow crosses 50,000 points for first timeUS stocks surged Friday as tech shares rebounded and bitcoin steadied, pushing the S&P 500, Dow and Nasdaq sharply higher despite lingering worries over heavy AI spending and market volatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/google-ai-wave-q4-result-cross-400-billion-in-annual-revenue-ceo-sundar-pichai-gemini-cloud-services-2864278-2026-02-06",
      "headline": "How Google rode the AI wave to cross $400 billion in annual revenue for 1st timeGoogle said that the Gemini app alone has crossed 750 million monthly active users, showing that AI adoption is no longer limited to developers or businesses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/fractal-analytics-aye-finance-ipos-to-open-next-week-what-investors-should-know-2864265-2026-02-06",
      "headline": "Fractal Analytics, Aye Finance IPOs to open next week: What investors should knowInvestors will have two fresh IPO opportunities next week as Fractal Analytics and Aye Finance open their public issues on February 9. The offerings span technology and finance, drawing attention from those looking to diversify their portfolios."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-crash-wipes-2-trillion-what-triggered-biggest-crypto-slump-since-trumps-election-2864179-2026-02-06",
      "headline": "Bitcoin crash stuns markets. Decoding biggest crypto slump since Trump electionBitcoin has witnessed one of its sharpest corrections in recent years, wiping out more than $2 trillion from the global cryptocurrency market in a single day. The fall is the steepest since Donald Trump's election. It comes amid rising global risk aversion, weakness in technology and AI stocks, and sustained institutional selling pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-rebound-fmcg-high-it-stocks-bleed-tcs-infosys-shares-down-2864177-2026-02-06",
      "headline": "Sensex, Nifty rebound to close higher; IT stocks bleed to limit gainsThe S&P BSE Sensex added 266.47 points to close at 83,580.40, while the NSE Nifty50 gained 50.90 points to end at 25,693.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-uber-rapido-drivers-6-hour-strike-february-7-minimum-fares-key-demands-2864126-2026-02-06",
      "headline": "Why Ola, Uber and Rapido drivers are going on a 6-hour strike todayThe strike has been called by the Telangana Gig and Platform Workers Union, also known as TGPWU. The union represents app-based transport workers operating on platforms such as Ola, Uber and Rapido."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-jumps-rs-1000-silver-falls-rs-6000-should-you-buy-now-or-wait-longer-2864098-2026-02-06",
      "headline": "Gold jumps Rs 1,000, silver falls Rs 6,000: Should you buy now or wait longer?Recent swings in gold and silver prices have caught investors' attention, with the metals showing mixed trends after a strong run. The big question now is whether this is a pause before the next move — should you buy now or wait longer?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-budget-2026-putting-services-at-the-centre-of-indias-growth-strategy-2864036-2026-02-06",
      "headline": "Is Budget 2026 putting services at the centre of India's growth strategy?Budget 2026, in essence, quietly recognises that India's economic growth and job creation are and will continue to be powered by services – both tradable and non-tradable, while maintaining the focus on infrastructure and manufacturing."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/directors-guild-awards-2026-paul-thomas-anderson-wins-best-director-for-one-battle-after-another-2865135-2026-02-08",
      "headline": "Directors Guild Awards 2026: See the full list of winners The 78th Directors Guild Awards saw filmmaker Paul Thomas Anderson named Best Director for his film One Battle After Another. The ceremony also recognised new and established directors across categories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kennedy-trailer-rahul-bhat-sunny-leone-anurag-kashyap-noir-world-2865122-2026-02-08",
      "headline": "Kennedy trailer: Rahul Bhat turns lethal in Anurag Kashyap's noir world Anurag Kashyap's neo-noir drama Kennedy, starring Rahul Bhat and Sunny Leone, is set for a digital premiere, following its acclaimed festival run. The newly released trailer reveals a dark, morally complex tale of violence and redemption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aasif-sheikh-salman-khan-connection-collaborations-films-bhabiji-ghar-par-hain-fun-on-the-run-2865111-2026-02-08",
      "headline": "What is Aasif Sheikh's link with Salman Khan? Their bond explained Actors Aasif Sheikh and Salman Khan's connection goes back decades. Here's a look at their bond, film collaborations, and why their association is being discussed again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neena-gupta-opens-up-about-tolerating-director-abuse-on-set-i-needed-the-money-2865080-2026-02-08",
      "headline": "Neena Gupta opens up about tolerating director's abuse on set: I needed the money Actor Neena Gupta revealed her experience of being abused by a director on a film set. She also shared regrets over some of her past roles and cited financial pressures as a reason for certain choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rinku-singh-meets-shah-rukh-khan-ranveer-singh-viral-cricket-bollywood-crossover-2865037-2026-02-08",
      "headline": "Batter's day out: Rinku Singh hangs out with Shah Rukh and Ranveer Singh A photo of cricketer Rinku Singh with actors Shah Rukh Khan and Ranveer Singh has gone viral, sparking major buzz online. Here's what happened in this cricket-Bollywood crossover moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-praises-security-guard-who-returned-lost-credit-card-2865035-2026-02-08",
      "headline": "Honesty is alive: Anupam Kher praises security guard who returned lost credit card Anupam Kher praised a security guard named Sanjay Yadav after he honestly returned the actor's lost credit card."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kritika-kamra-gaurav-kapur-spark-wedding-rumours-2026-date-hinted-2865013-2026-02-08",
      "headline": "Kritika Kamra, Gaurav Kapur spark wedding rumours; 2026 date hinted Celebrity couple Kritika Kamra and Gaurav Kapur have sparked fresh wedding rumours after making their relationship official. Reports suggest the pair may be planning a wedding in 2026, though neither has confirmed the news."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ayushmann-khurrana-sara-ali-khan-pati-patni-aur-woh-do-gets-new-release-date-2865005-2026-02-08",
      "headline": "Ayushmann Khurrana-Sara Ali Khan's Pati Patni Aur Woh Do gets new release date Ayushmann Khurrana and Sara Ali Khan's Pati Patni Aur Woh Do has been postponed and will now release in theatres on May 15, 2026, instead of Holi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-war-film-battle-of-galwan-may-skip-april-release-details-inside-2864995-2026-02-08",
      "headline": "Salman Khan's war film Battle of Galwan may skip April release. Details inside Salman Khan's Battle of Galwan could face a change in its release plans and hit the theatres later than expected. Directed by Apoorva Lakhia, the war drama is currently scheduled for a theatrical release on April 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-says-india-needs-more-theatres-points-to-dhurandhar-box-office-run-2864971-2026-02-08",
      "headline": "Aamir Khan says India needs more theatres, points to Dhurandhar's box office run Aamir Khan stressed that India needs more cinema halls to help big films reach their true box-office potential, noting the country has far fewer screens than China. He said wider releases could significantly boost earnings, citing Dhurandhar as an example of how Indian films can grow with better infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/imran-khan-says-shah-rukh-khan-salman-khan-aamir-khan-need-to-adapt-as-they-age-out-of-lead-roles-2864953-2026-02-08",
      "headline": "Imran Khan says SRK, Salman, Aamir need to adapt as they age out of lead roles Imran Khan said that as actors grow older, they cannot continue playing traditional hero roles and must choose characters that suit their age. Speaking about Shah Rukh Khan, Salman Khan and Aamir Khan, he added that changing audience tastes are pushing stars to reinvent themselves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rhea-chakraborty-talks-about-difficult-career-phase-2864938-2026-02-08",
      "headline": "No one wanted to work with me: Rhea Chakraborty talks about difficult career phase Rhea Chakraborty spoke about the painful years when she struggled to find acting opportunities and nearly gave up on her dream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-says-he-was-never-part-of-ramayana-deletes-clarification-post-later-2864917-2026-02-08",
      "headline": "Vikrant Massey says he was never part of Ramayana, deletes clarification post later Vikrant Massey dismissed rumours of being part of Ranbir Kapoor's Ramayana, sharing a clarification on his Instagram Story that he later deleted. The actor criticised irresponsible media reports while maintaining he was never associated with the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/hanumankind-on-arijit-singh-stepping-away-from-playback-singing-2864912-2026-02-08",
      "headline": "Hanumankind on Arijit Singh stepping away from playback singing: Got to respect that Hanumankind has voiced support for Arijit Singh's decision to step away from playback singing, urging people to respect the singer's personal choice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/akanksha-chamola-hits-back-at-trolls-over-dance-videos-calls-out-double-standards-2864879-2026-02-08",
      "headline": "Akanksha Chamola hits back at trolls over dance videos, calls out double standards Akanksha Chamola has reacted to online trolling over her dance performances, saying loyalty in marriage is the bare minimum and that she is simply doing her job as an actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-afterthought-why-isnt-there-a-great-villains-role-for-arjun-rampal-2864834-2026-02-08",
      "headline": "Dhurandhar afterthought: Why isn't there a great villain's role for Arjun Rampal? As Major Iqbal in Dhurandhar, Arjun Rampal aces the villain's act again, after Raajneeti and Om Shanti Om. Yet, Bollywood is still to create a memorable antagonist for the actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mardaani-3-box-office-collection-day-9-rani-mukerji-action-drama-surpasses-rs-30-crore-mark-2864857-2026-02-08",
      "headline": "Mardaani 3 box office Day 9: Rani Mukerji's action drama surpasses Rs 30 crore mark Rani Mukerji's Mardaani 3 continues its steady box office run, crossing Rs 30 crore in India within nine days despite facing strong competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/brad-arnold-3-doors-down-lead-singer-dies-stage-4-kidney-cancer-2864846-2026-02-08",
      "headline": "Brad Arnold, lead singer of 3 Doors Down, dies at 47 after cancer battle Brad Arnold, 47, lead singer of Grammy-nominated rock band 3 Doors Down, died after a battle with Stage 4 kidney cancer, months after revealing his diagnosis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-recalls-third-rate-actor-comment-amid-u19-world-cup-win-2864809-2026-02-07",
      "headline": "3rd rate actor from 3rd world country: Big B recalls old dig amid U19 World Cup win Amitabh Bachchan reflected on a foreign journalist's remark calling him a 'third-rate actor from a third-world country.' He shared the experience while celebrating India's sixth U19 World Cup victory."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/face-of-fascism-congress-tmc-train-guns-at-bjp-over-assam-cm-himantas-point-blank-video-2864973-2026-02-08",
      "headline": "Opposition trains guns at BJP over Himanta's now-deleted 'point-blank' videoThe Assam BJP's official video showing Himanta Biswa Sarma symbolically firing at Muslims sparked widespread outrage and political condemnation. The controversial post was removed after it drew accusations of inciting violence and communal hatred."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/bodies-found-parked-car-delhi-peeragarhi-flyover-2865086-2026-02-08",
      "headline": "3 bodies found in parked car on Delhi flyover, poisoning suspectedBodies of a woman and two men were found inside a parked car in Delhi's Peeragarhi. All three victims have been identified."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/dalai-lama-never-met-jeffrey-epstein-tibetan-leaders-office-junks-reports-2865114-2026-02-08",
      "headline": "Dalai Lama never met Jeffrey Epstein: Tibetan leader's office junks reportsSeveral media reports mentioned that the Dalai Lama's name appeared several times in documents released by US authorities as part of material related to Jeffrey Epstein. The Tibetan spiritual leader's office clarified that the Dalai Lama never met Epstein."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/did-general-mm-naravane-do-right-thing-book-four-stars-of-destiny-military-memoir-india-china-army-2864663-2026-02-08",
      "headline": "Did General Naravane do the right thing?Former Army Chief General MM Naravane wrote in his unpublished memoir that he was handed a \"hot potato\" by the NDA government during the confrontation with China along the LAC in August 2020. India's history of \"hot potatoes\" suggests a pattern. The political leadership gives nothing but broad brush outlines to military leaders, who then exercise their judgement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-afterthought-why-isnt-there-a-great-villains-role-for-arjun-rampal-2864834-2026-02-08",
      "headline": "Dhurandhar afterthought: Why isn't there a great villain's role for Arjun Rampal?Handcrafted ByOur Editors As Major Iqbal in Dhurandhar, Arjun Rampal aces the villain's act again, after Raajneeti and Om Shanti Om. Yet, Bollywood is still to create a memorable antagonist for the actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/jeffrey-epstein-files-documents-doj-girls-lured-sexually-abused-us-paedophoile-financier-2864968-2026-02-08",
      "headline": "Scouting, scholarships, massages: How Epstein lured girls into pyramid of abuseOver decades, Jeffrey Epstein and Ghislaine Maxwell lured vulnerable girls with scholarships, cash, and promises of opportunity, grooming them into a network of abuse spanning Florida, New York, New Mexico, Europe, and the Virgin Islands."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rss-event-mumbai-mohan-bhagwant-100-yearss-of-sangh-hindus-in-bangladesh-2864948-2026-02-08",
      "headline": "If 1.25 crore Hindus decide to fight...: RSS chief's big remark on BangladeshSpeaking at an event in Mumbai to mark 100 years of the RSS, Mohan Bhagwat said that 1.25 crore Hindus in Bangladesh will get global Hindu support if they stay and fight for their rights amid rising violence against minorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-donald-trump-good-luck-usa-cricket-team-24-hours-india-defeat-mumbai-2865139-2026-02-08",
      "headline": "Donald Trump's good luck message to USA cricket team 24 hours after loss to IndiaT20 World Cup: Donald Trump posted a good luck message for Team USA's cricketers on Truth Social—24 hours after they'd already lost to India by 29 runs at the Wankhede Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neena-gupta-opens-up-about-tolerating-director-abuse-on-set-i-needed-the-money-2865080-2026-02-08",
      "headline": "Neena Gupta opens up about tolerating director's abuse on set: I needed the moneyActor Neena Gupta revealed her experience of being abused by a director on a film set. She also shared regrets over some of her past roles and cited financial pressures as a reason for certain choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-eng-vs-nep-nepal-spirited-display-england-win-mumbai-2865095-2026-02-08",
      "headline": "England hold off Nepal's spirited display in Mumbai to win T20 World Cup openerT20 World Cup 2026: Nepal pushed England to the final over in a thrilling T20 World Cup opener at Wankhede but fell agonizingly short by four runs. Their 12-year wait for a World Cup win continues despite a valiant effort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-bodybuilder-dies-suicide-girlfriend-shows-wedding-invite-new-saree-2865128-2026-02-08",
      "headline": "Bodybuilder kills self after girlfriend of 3 years shows wedding invite, new sareeThe man was planning a Valentine's Day gift for his girlfriend when she revealed that her marriage had been finalised with another man and showed him her wedding invite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-ireland-live-score-t20-world-cup-today-match-colombo-updates-2865085-2026-02-08",
      "headline": "SL vs IRE, Live Score: Sri Lanka take 20-run win over Ireland to begin campaignSL (Sri Lanka) vs IRE (Ireland) live score, T20 World Cup: A comprehensive bowling display from Sri Lanka have ensured that the co-hosts take the win in their opening game of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-gautam-gambhir-fight-relationship-clarified-devajit-saikia-bcci-2865134-2026-02-08",
      "headline": "Is there a rift between Kohli and Gambhir? BCCI secretary puts end to rumoursBCCI secretary Devajit Saikia dispels rumours of discord between Virat Kohli and Gautam Gambhir in the dressing room. Several reports in the media have claimed that the duo is not in a good relationship with each other in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/india-weather-forecast-tomorrow-snow-rain-north-india-imd-update-2865096-2026-02-08",
      "headline": "Northwest India to see rise in temperatures over next two daysA new Western Disturbance will bring snow and rain to the Himalayas on February 9, 2026. Discover the latest IMD forecast for Delhi, UP fog, and mountain weather."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/united-states-republican-congressman-brandon-gill-dallas-malls-pakistan-islamisation-claims-2864925-2026-02-08",
      "headline": "Feels like Pakistan, not Dallas: Row over US lawmaker's Islamisation remarkRepublican Congressman Brandon Gill claimed parts of Dallas are undergoing 'Islamisation' due to 'mass Islamic migration,' comments that add to his history of anti-immigration remarks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/japans-first-woman-pm-sanae-takaichi-wins-resounding-mandate-in-winter-snap-polls-2865131-2026-02-08",
      "headline": "Japan's first woman PM Sanae Takaichi wins resounding mandate in winter snap pollsSanae Takaichi was projected to deliver as many as 328 of the 465 seats in parliament's lower house for her Liberal Democratic Party (LDP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasa-rocket-ct-scan-aurora-electricity-northern-lights-alaska-2865089-2026-02-08",
      "headline": "Nasa to launch rockets into auroras. Here's whyNasa is launching a unique rocket mission to perform a 3D CT scan of the northern lights. The study aims to map the electrical circuits that impact our satellites and GPS."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/india-today-quiz-news-current-affairs-upsc-entertainment-technology-movies-pop-culture-sports-569-06-02-2026",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-jails-nobel-laureate-narges-mohammadi-for-7-years-after-hunger-strike-2865140-2026-02-08",
      "headline": "Iran jails Nobel Laureate Narges Mohammadi for 7 years after hunger strikeNobel Peace Prize laureate Narges Mohammadi, who was arrested in December, has been on a hunger strike in prison since February 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/news-analysis/story/chatgpt-astrology-numerology-tarot-reading-accurate-ai-future-prediction-2864819-2026-02-08",
      "headline": "I asked ChatGPT about my future. Its astrological predictions blew my mindHandcrafted ByOur Editors Astrology was once about planets and priests. Today, it's about prompts and predictions on ChatGPT. From questions about love life to picking interview outfits, and even forecasting job offers, people are turning to AI as their go-to astrologer. But, how accurate is it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kennedy-trailer-rahul-bhat-sunny-leone-anurag-kashyap-noir-world-2865122-2026-02-08",
      "headline": "Kennedy trailer: Rahul Bhat turns lethal in Anurag Kashyap's noir worldAnurag Kashyap's neo-noir drama Kennedy, starring Rahul Bhat and Sunny Leone, is set for a digital premiere, following its acclaimed festival run. The newly released trailer reveals a dark, morally complex tale of violence and redemption."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/what-happened-to-ranu-mondal-after-her-overnight-rise-to-fame-2864598-2026-02-08",
      "headline": "What happened to Ranu Mondal after her overnight rise to fame?Ranu Mondal's story, in all probability, is nothing short of tragic - a visual representation of riches to rags, and a metaphoric proof of the fact that fame is but fleeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-biker-death-aap-leader-saurabh-bhardwaj-detained-by-police-during-candle-march-2865124-2026-02-08",
      "headline": "AAP's Saurabh Bhardwaj detained during candle march over Delhi biker's deathWhile talking to the media during detention, Saurabh Bhardwaj alleged the police were detaining AAP leaders despite them having gathered only to pay tribute to the deceased, calling it a reflection of 'dictatorship'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/indias-sarvam-ai-beats-google-gemini-and-chatgpt-the-world-is-impressed-2865060-2026-02-08",
      "headline": "India's Sarvam AI beats Google Gemini and ChatGPT, the world is impressedIndia finally has an AI model that seems to be world-class, at least for some India-specific tasks. Sarvam AI has come out with an OCR tool called Vision that beats the likes of Gemini and ChatGPT in reading documents in Indian languages, as well as Bulbul V3 that excels at AI voice generation."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-hosts-team-dinner-delhi-india-namibia-t20-world-cup-2865141-2026-02-08",
      "headline": "Watch: Gautam Gambhir hosts special dinner for T20 World Cup team in New Delhi T20 World Cup: Indian head coach Gautam Gambhir hosted the team for a special dinner at his Delhi residence ahead of their T20 World Cup clash against Namibia, continuing his tradition of building team unity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-donald-trump-good-luck-usa-cricket-team-24-hours-india-defeat-mumbai-2865139-2026-02-08",
      "headline": "Donald Trump's good luck message to USA cricket team 24 hours after loss to India T20 World Cup: Donald Trump posted a good luck message for Team USA's cricketers on Truth Social—24 hours after they'd already lost to India by 29 runs at the Wankhede Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-gautam-gambhir-fight-relationship-clarified-devajit-saikia-bcci-2865134-2026-02-08",
      "headline": "Is there a rift between Kohli and Gambhir? BCCI secretary puts end to rumours BCCI secretary Devajit Saikia dispels rumours of discord between Virat Kohli and Gautam Gambhir in the dressing room. Several reports in the media have claimed that the duo is not in a good relationship with each other in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-t20-world-cup-pakistan-batting-2864878-2026-02-08",
      "headline": "Form aside, Babar Azam doesn't fit in Pakistan's T20I setup. Here's why T20 World Cup: Babar Azam scored 15 runs off 18 balls at No.4 against the Netherlands. Pakistan managed to win the match by three wickets, but the bigger question remains: is Babar suited for a strong middle-order role in T20Is?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dale-steyn-offers-coaching-to-nepal-after-spirited-t20-world-cup-clash-2865127-2026-02-08",
      "headline": "Dale Steyn's special message leaves Nepal bowler emotional after heroic fight vs England T20 World Cup, ENG vs NEP: Former South African pacer Dale Steyn praised Nepal and offered his support after their four-run loss to England on Sunday at the Wankhede Stadium in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-nepal-captain-rohit-paudel-sends-warning-to-other-teams-after-england-game-2865109-2026-02-08",
      "headline": "Not here just to participate: Nepal captain sends warning after scaring England Nepal captain Rohit Paudel sent a big warning message to the rest of the teams of T20 World Cup 2026 after fighting valiantly against England in a thrilling fixture in Mumbai. Nepal finished their innings on 180/6 chasing a massive target of 185."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-england-thrilling-t20-world-cup-match-wankhede-reactions-2865104-2026-02-08",
      "headline": "Keep your head high: Nepal win hearts after courageous fight against England T20 World Cup, ENG vs NEP: Nepal produced a spirited performance against England but fell agonisingly short as England edged the thriller by four runs at the iconic Wankhede Stadium in Mumbai. R Ashwin, Yuvraj Singh and others wished Nepal for their spirited efforts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-eng-vs-nep-nepal-spirited-display-england-win-mumbai-2865095-2026-02-08",
      "headline": "England hold off Nepal's spirited display in Mumbai to win T20 World Cup opener T20 World Cup 2026: Nepal pushed England to the final over in a thrilling T20 World Cup opener at Wankhede but fell agonizingly short by four runs. Their 12-year wait for a World Cup win continues despite a valiant effort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-ireland-live-score-t20-world-cup-today-match-colombo-updates-2865085-2026-02-08",
      "headline": "SL vs IRE, Live Score: Sri Lanka take 20-run win over Ireland to begin campaign SL (Sri Lanka) vs IRE (Ireland) live score, T20 World Cup: A comprehensive bowling display from Sri Lanka have ensured that the co-hosts take the win in their opening game of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-whistles-banned-chennai-ma-chidambaram-stadium-cop-clarifies-2865078-2026-02-08",
      "headline": "No Whistle Podu in Chennai for T20 World Cup 2026? Senior cop clears the air T20 World Cup 2026: Fans at Chepauk were barred from carrying whistles during the T20 World Cup match, sparking confusion. A senior cop clarified no official ban exists, though the timing amid elections raised eyebrows."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-nz-vs-afg-mujeeb-ur-rahman-jonathan-trott-press-conference-2865068-2026-02-08",
      "headline": "Mujeeb bowled well, but Afghanistan couldn't build enough pressure: Jonathan Trott T20 World Cup, NZ vs AFG: Speaking to the reporters after the match, Jonathan Trott said that Mujeeb Ur Rahman bowled well, but Afghanistan couldn't build enough pressure on the New Zealand batters at the Chepauk. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/tristane-stubbs-marco-jansen-south-africa-vs-canada-aiden-markram-press-conference-2865073-2026-02-08",
      "headline": "Stubbs or Jansen? South Africa yet to figure out best combination in T20 World Cup, says Aiden MarkramT20 World Cup 2026, SA vs CAN: Speaking to the reporters, South Africa skipper Aiden Markram said that the Proteas are yet to make a call on their playing XI going into their opening game against Canada on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-sooryavanshi-u19-world-cup-team-of-the-tournament-2865056-2026-02-08",
      "headline": "Vaibhav Sooryavanshi headlines ICC U19 Team of the Tournament, 3 Indians in XIThe ICC has announced the team of the tournament for the U19 World Cup. Vaibhav Sooryavanshi headlines the side which has 3 Indian players. India earlier hammered England in the final of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-t20-world-cup-noor-ahmad-omission-new-zealand-chennai-2865046-2026-02-08",
      "headline": "Did Afghanistan miss Noor Ahmad trick? Trott clarifies surprise call after NZ lossT20 World Cup, NZ vs AFG: Jonathan Trott defended Afghanistan's decision to leave out Noor Ahmad against New Zealand, saying the selection was right and blaming the defeat on the pacers' failure to execute rather than the absence of a specialist spinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-cricket-fans-vibrant-support-t20-world-cup-qualification-wankhede-mumbai-2865008-2026-02-08",
      "headline": "Mumbai or Kathmandu? Passionate Nepal fans paint Wankhede red in England clashNepal fans flocked to Wankhede Stadium in Mumbai for their T20 World Cup clash against England on Sunday. The passionate support underlined how Nepal's fans have long been the backbone of the national team, turning up in numbers and lending their voices wherever the side plays across the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-crowd-attendance-india-cricket-paglus-no-india-match-nz-vs-afg-fallout-2864981-2026-02-08",
      "headline": "Real cricket paglus: Fans pack Kolkata, Chennai for neutral T20 World Cup gamesKolkata and Chennai have brushed aside low-turnout worries at the T20 World Cup 2026 by turning up in strong numbers for neutral fixtures. From Eden Gardens to Chepauk, fans have shown the tournament buzz is alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-beat-afghanistan-t20-world-cup-highest-chase-spin-test-2864978-2026-02-08",
      "headline": "New Zealand pass Afghanistan spin test in Chennai to lay down early markerT20 World Cup, NZ vs AFG: New Zealand recorded their highest run-chase in the history of the tournament, beating Afghanistan by five wickets on Sunday at the MA Chidambaram Stadium in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-nepal-live-score-t20-world-cup-today-match-mumbai-updates-harry-brook-2864974-2026-02-08",
      "headline": "ENG vs NEP Highlights: England survive Nepal scare, win by 4 runs in MumbaiENG (England) vs NEP (Nepal) Highlights, T20 World Cup: England held their nerve in the final over as Sam Curran was immensely accurate and pulled off a remarkable four-run victory for his team. Lokesh Bam's was crestfallen after his heroic 39* (20) ended in vain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-pakistan-boycott-india-match-2864962-2026-02-08",
      "headline": "Bangladesh, Pakistan bhai bhai: BCB head meets PCB head ahead of ICC meetingThe Bangladesh Cricket Board chief has flown to meet PCB boss Mohsin Naqvi. The visit comes right ahead of ICC crucial meeting with Pakistan over their boycott of match against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-vs-tottenham-michael-carrick-surge-arsenal-mikel-arteta-title-push-2864957-2026-02-08",
      "headline": "Premier League: Carrick's United surge grows as Arsenal depth fuels title pushMichael Carrick's early impact at Manchester United is reshaping belief, while Arsenal face title-defining weeks ahead. With pressure mounting across the table, this Premier League run-in is quickly becoming a manager's survival test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-usa-suryakumar-yadav-arshdeep-singh-batting-promise-joke-viral-video-watch-2864936-2026-02-08",
      "headline": "Watch: Suryakumar Yadav makes fun Arshdeep batting promise after USA thrillerSuryakumar Yadav and Arshdeep Singh shared a hilarious post-match moment after India's tense win over the USA. The skipper even jokingly promised Arshdeep a batting promotion following their late partnership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-india-vs-usa-mohammed-siraj-wickets-ranji-trophy-line-length-mumbai-2864905-2026-02-08",
      "headline": "Ranji Trophy plans worked in T20 World Cup: Siraj explains his heroics vs USAMohammed Siraj credited his Ranji Trophy rhythm for his match-winning spell against the USA in India's T20 World Cup opener. Drafted in as a late replacement, Siraj stepped up instantly, taking three crucial wickets under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-sharda-ugra-criticism-social-media-cricket-twitter-2864874-2026-02-08",
      "headline": "As T20 World Cup begins, Gen Z need to realise journalists are not cheerleadersJust days before the T20 World Cup, a familiar script played out online: outrage, accusation, erasure. This time, the target was not a player or an administrator, but a veteran journalist who asked a couple of inconvenient questions. So, at India Today, we tried to figure out: Has India's cricket discourse gone down the drain?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-afghanistan-live-score-t20-world-cup-today-match-chennai-updates-2864891-2026-02-08",
      "headline": "NZ vs AFG Highlights: New Zealand crush Afghanistan by 5 wicketsNew Zealand (NZ) vs Afghanistan (AFG) Highlights, T20 World Cup 2026: New Zealand have started their campaign with a dominating 5 wicket win over a challenging Afghanistan in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/under-19-world-cup-final-vaibhav-sooryavanshi-india-vs-england-critics-silenced-century-2864534-2026-02-08",
      "headline": "Overhyped or not, Vaibhav silenced all critics with U19 World Cup final heroicsAt 14, most kids are worried about exams. Vaibhav Sooryavanshi was facing a nation's scrutiny after the Asia Cup final disappointment. His response? A staggering 175 in the U19 World Cup final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/winter-olympics-italy-police-tear-gas-water-canon-protest-hockey-venue-santagiulia-2864873-2026-02-08",
      "headline": "Italy police fire tear gas, water cannon to break Winter Olympics protestItalian police fired tear gas and used water cannons on February 7 after Winter Olympics protests in Milan turned violent. Demonstrators rallied against environmental and social impacts before clashes erupted near an Olympic venue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-india-squad-washington-sundar-injury-2864869-2026-02-08",
      "headline": "India boosted with return of Washington Sundar after USA scareICC T20 World Cup: All-rounder Washington Sundar has recovered from his injury and is set to make a return to the team ahead of India's 2nd match in the T20 World Cup. Sundar was sidelined with a side strain and a rib muscle tear during India's ODI series against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-usa-lessons-sunil-gavaskar-batting-collapse-depth-suryakumar-yadav-2864862-2026-02-08",
      "headline": "USA thriller exposed key T20 World Cup lessons for India: Gavaskar lists solutionsSunil Gavaskar believes India's win over the USA exposed key T20 World Cup lessons despite the 30-run margin. He warned that early collapses and sloppy powerplays could hurt India against stronger teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pak-vs-ned-pakistan-did-not-win-netherlands-lost-paul-van-meekeren-2864852-2026-02-08",
      "headline": "Pakistan didn't win, we lost against ourselves: Netherlands' pacer Paul Van MeekerenNetherlands pacer Paul van Meekeren said his team lost against themselves in their narrow T20 World Cup defeat to Pakistan. The Dutch quick rued missed chances that could have potentially ended Pakistan's campaign early."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-vs-liverpool-preview-2864779-2026-02-08",
      "headline": "Can Wirtz-Ekitike fire Liverpool past City in season-defining clash?Premier League: A blockbuster showdown awaits at Anfield on Sunday as Arne Slot's Liverpool welcome Pep Guardiola's Manchester City. While the two sides are not locked in a head-to-head title race as they have been in recent seasons, the fixture is still packed with intrigue, and the outcome could have far-reaching consequences for the rest of the campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-suryakumar-yadav-mathemagician-wankhede-stadium-mumbai-india-problem-2864833-2026-02-08",
      "headline": "At Wankhede, Mathemagician Suryakumar Yadav solves India's T20 World Cup problemT20 World Cup 2026: Suryakumar Yadav turned chaos into calculus against the USA. Scoops, sweeps, redefined angles, and resolve indicate he is ready to solve his legacy problem "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}