{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-over-200-points-nifty-above-25300-hcltech-shares-up-2-percent-2802727-2025-10-14",
      "headline": "Sensex jumps over 200 points, Nifty above 25,300; HCLTech up 2%The S&P BSE Sensex added 205.08 points to 82,532.13, while the NSE Nifty50 gained 60.60 points to 25,287.95 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-listing-today-latest-gmp-over-rs-400-how-much-investors-can-gain-market-debut-2802698-2025-10-14",
      "headline": "LG Electronics listing today: Investors eye big gains as GMP crosses Rs 400LG Electronics IPO opened for subscription on October 7 and closed on October 9. The price band for the issue was set between Rs 1,080 and Rs 1,140 per share."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claim-denied-insurance-star-health-ombudsman-irdai-manipal-hospital-mudit-agarwal-poonam-singhal-2802351-2025-10-14",
      "headline": "Every claim is a fight: Inside a family's months-long health insurance battleIn India, buying health insurance is easy, but claiming it is another battle. Families like Mudit Agarwal's often end up fighting bureaucracy instead of focusing on illness. In this week's story from our ongoing 'Claim Denied' series, we reveal how one family's ordeal exposes the cracks in the system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-share-price-market-debut-gmp-above-rs-400-bumper-opening-nse-bse-listing-gains-2802672-2025-10-14",
      "headline": "LG Electronics share listing today: Will it make bumper debut on stock market?LG Electronics IPO is one of the most talked-about offerings of 2025, attracting bids worth over Rs 4.4 lakh crore against the Rs 11,607 crore issue size."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-businessman-vijay-mallya-discontinues-bankruptcy-annulment-application-in-uk-ahead-of-his-hearing-2802568-2025-10-13",
      "headline": "Vijay Mallya discontinues bankruptcy annulment application in UK ahead of hearingThis means the \"Trustee in Bankruptcy\" can continue to pursue assets to help a consortium of banks led by the State Bank of India (SBI) realise the repayment of an estimated judgment debt of around 1.05 billion pounds owed by Vijay Mallya's now-defunct Kingfisher Airlines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-2025-shopping-on-credit-cards-here-how-no-cost-emi-flash-sale-offers-can-backfire-2802457-2025-10-13",
      "headline": "Diwali shopping on credit cards? Here's how offers can backfireFestive sales and flashy credit card deals may look irresistible, but hidden charges, interest traps and repayment delays can turn Diwali shopping into a debt headache."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-in-september-down-to-8-year-low-2802366-2025-10-13",
      "headline": "Retail inflation drops to 1.54% in September, lowest in over 8 yearsFood inflation remained negative for the fourth consecutive month, with the Consumer Food Price Index (CFPI) showing a year-on-year decline of 2.28%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nobel-prize-in-economic-sciences-awarded-to-joel-mokyr-philippe-aghion-and-peter-howitt-2802332-2025-10-13",
      "headline": "Joel Mokyr, Philippe Aghion, Peter Howitt win Nobel Prize in Economics 2025The Nobel Prize committee said the trio's research has helped economists and policymakers better understand the roots of economic progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-sensex-nifty-it-stocks-us-china-trade-woes-infosys-2802344-2025-10-13",
      "headline": "Sensex, Nifty end in red as IT stocks drag markets; Infosys down 2%The S&P BSE Sensex was down by 173.77 points to close at 82,327.05, while the NSE Nifty50 lost 58 points to end at 25,227.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/silver-prices-india-should-you-sell-buy-personal-finance-festive-season-shopping-2802291-2025-10-13",
      "headline": "Is silver the next big story after gold? Here's what you need to knowFrom households to industries and even central banks, silver is suddenly everyone's favourite metal, pushing its price higher. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/loan-rejected-despite-750-cibil-score-5-hidden-reasons-revealed-by-expert-2802284-2025-10-13",
      "headline": "Loan rejected despite 750 CIBIL score? 5 hidden reasons revealed by expertEven with a strong CIBIL score of 750, many borrowers face loan rejections. Experts say banks consider several hidden factors beyond your credit score that can impact approval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-diwali-bonus-taxable-for-salaried-employees-here-is-what-you-must-know-2802249-2025-10-13",
      "headline": "Is Diwali bonus taxable for salaried employees? Here's what you must knowAs Diwali draws near, salaried employees across India look forward to festive bonuses and gifts. But not all perks are tax-free, and understanding which ones attract tax is essential to avoid surprises from the Income Tax Department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-ipo-50-percent-listing-pop-stock-market-debut-2802227-2025-10-13",
      "headline": "LG Electronics IPO GMP rises: Can investors expect 50% listing pop tomorrow?LG IPO: While early chatter hinted at a 50% listing pop, current indicators suggest a slightly more modest, yet still impressive, gain. Read on to know more about the grey market trends, subscription frenzy, and what investors can realistically expect tomorrow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cryptocurrency-bitcoin-ethereum-dogecoin-rebound-after-massive-crash-here-is-what-investors-should-do-2802203-2025-10-13",
      "headline": "Crypto rebounds after massive crash. Here's what investors should doThe crypto market has regained lost ground following a sharp crash over the weekend. Bitcoin, Ethereum, and several altcoins are bouncing back, leaving investors to decide their next move carefully."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-climb-again-will-the-rally-continue-till-dhanteras-should-you-buy-gold-2802173-2025-10-13",
      "headline": "Gold prices climb again. Will the rally continue till Dhanteras?Gold is once again on the rise, drawing attention from investors and festive buyers alike. With prices touching record levels and global uncertainty at play, many are now wondering if the momentum will carry through to Dhanteras."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/disappointed-tata-capital-market-debut-5-reasons-why-not-to-worry-2802122-2025-10-13",
      "headline": "Why Tata Capital's weak stock market debut isn't a reason to worryTata Capital IPO: The shares opened at Rs 330 on listing day, roughly 1% above the IPO price of Rs 326—a flat, polite start for what was billed as the biggest public issue of the year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-capital-share-price-1-percent-premium-rs-330-bse-nse-flat-debut-stock-market-2802109-2025-10-13",
      "headline": "Tata Capital share price: 2025's biggest IPO makes flat debut on stock marketTata Capital shares listed at Rs 330 on both the NSE and the BSE, opening at a premium of just 1% over its issue price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-fall-stock-market-falling-rising-volatility-2802104-2025-10-13",
      "headline": "Sensex tumbles nearly 400 points: Why is the stock market falling today?Across Asia, markets opened lower, and India wasn't spared either. Profit booking after last week's gains and cautious sentiment ahead of key domestic events like the Tata Capital listing, Q2 earnings, and inflation data added to the drag."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-share-price-listing-date-latest-gmp-profit-for-investors-expected-gains-2802093-2025-10-13",
      "headline": "LG Electronics IPO set for a bumper listing tomorrow? Check latest GMPLG Electronics IPO was open for subscription from October 7 to October 9 and saw strong participation across all investor categories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-over-300-points-nifty-below-25200-indigo-airtel-among-top-gainers-2802084-2025-10-13",
      "headline": "Sensex, Nifty fall amid US-China tariff tensions; focus on Tata Capital listingThe S&P BSE Sensex fell over 300 points in early trade, while the NSE Nifty50 slipped around 100 points amid mild profit booking after last week's gains."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kbc-17-big-b-recites-agneepath-iconic-line-on-rishab-shetty-request-2802699-2025-10-14",
      "headline": "KBC 17: Big B recites Agneepath's iconic line on Rishab Shetty's request Actor-director Rishab Shetty featured on 'Kaun Banega Crorepati 17' with Amitabh Bachchan. The duo recreated a memorable dialogue from 'Agneepath' (1990), adding nostalgia to the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/pakistan-muslim-nation-to-get-love-island-people-sink-it-in-quran-verses-lazawal-ishq-ott-series-reality-dating-tv-show-2802581-2025-10-14",
      "headline": "Pakistan gets Love Island, people sink it in Quran verses Pakistani reality dating show, Lazawal Ishq, tried to channel Love Island but ended up delivering a cringe-fest of a series. Pakistanis used Quranic verses to brand it \"unIslamic\". There's awkward casting, archaic gender dynamics, and an experiment that goes wildly off the rails. But it seemingly shows aspects of Pakistani society that mainstream TV fails to highlight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-box-office-collection-crosses-rs-450-crore-in-12-days-2802714-2025-10-14",
      "headline": "Kantara Chapter 1 box office Day 12: Rishab's film sees big drop on 2nd Monday 'Kantara: Chapter 1' witnessed a significant drop in box office collections on its second Monday. Despite this, the film crossed Rs 450 crore nett in 12 days and will continue its successful run till Diwali."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-asks-fans-to-stay-calm-during-spain-race-event-2802692-2025-10-14",
      "headline": "Ajith Kumar signals fans to remain calm at Spain race event, urging restraint Actor Ajith Kumar gestured to his fans to control their excitement at a Spain racing event. The actor's calm gesture was met with immediate compliance from the crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/m-night-shyamalan-brad-falchuk-magic-8-ball-supernatural-drama-series-2802684-2025-10-14",
      "headline": "Director M Night Shyamalan turns Magic 8 Ball into supernatural TV series M Night Shyamalan and Brad Falchuk are teaming up for a supernatural drama inspired by the iconic Magic 8 Ball, reimagining the classic toy as a psychological thriller filled with suspense and character-driven storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-collaborates-tamil-composer-santhosh-narayanan-dhee-hanumankind-2802676-2025-10-14",
      "headline": "Ed Sheeran, Hanumankind, Dhee join forces with Tamil composer Santhosh Narayanan Ed Sheeran is set to collaborate with Tamil composer Santhosh Narayanan, his singer-daughter Dhee, and rapper Hanumankind on a new international track. This marks Santhosh Narayanan's first global collaboration, generating excitement among fans and music enthusiasts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/is-mtv-music-channel-shutting-down-after-40-years-heres-whats-really-happening-2802671-2025-10-14",
      "headline": "Is MTV music shutting down after 40 years? Here's what's really happening MTV will end its iconic UK music channels by December 2025, focusing on reality TV, sparking nostalgia and disappointment among fans and former hosts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-kantara-chapter-1-celebrates-women-as-both-soul-and-storm-of-film-2802617-2025-10-14",
      "headline": "The women of Kantara Chapter 1: Rishab Shetty turns feminine into cinematic power Rishab Shetty expands his cinematic universe in 'Kantara: Chapter 1', turning women into the story's driving force. From divine strength to human resilience, the prequel moves the gender conversation in the story with myth, strength, and power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-season-5-episode-lengths-confirmed-no-90-minute-episodes-netflix-release-2802663-2025-10-14",
      "headline": "Stranger Things 5: Volume 1 episode runtimes revealed after fan buzz The co-creator of 'Stranger Things', Ross Duffer, has clarified that the final season's episodes will not be the lengthy 90-minute features as rumoured on social media. Netflix will release the last season in three parts starting November 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/eminem-daughter-alaina-marie-announces-pregnancy-with-husband-matt-moeller-2802662-2025-10-14",
      "headline": "Eminem's daughter Alaina Marie announces pregnancy with husband Matt Moeller Eminem is gearing up to be a grandfather once more! His eldest daughter, Alaina Marie Scott, and her husband, Matt Moeller, are expecting their first child in 2026. The announcement, brimming with love and gratitude, quickly melted hearts online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/alec-baldwin-range-rover-crashes-into-tree-near-hamptons-home-unhurt-2802657-2025-10-14",
      "headline": "Actor Alec Baldwin's Range Rover crashes into tree near Hamptons home Actor Alec Baldwin narrowly escaped injury when his Range Rover crashed into a tree in the Hamptons amid rainy weather. Despite the accident, he and his brother remained unhurt, and no official statements have been released yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-51-farrhana-bhatt-shehbaz-badesha-clash-pani-puri-task-sets-nominations-2802628-2025-10-13",
      "headline": "Bigg Boss 19 episode 51: Farrhana-Shehbaz clash, pani puri task sets nominations The October 13 episode of 'Bigg Boss 19' had emotions, fights, and changing alliances, ending with a fun yet chaotic pani puri nominations task. Nehal saved Farrhana, while Gaurav, Mridul, Neelam, and Malti were up for public voting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-fulfils-promise-gifts-washroom-to-kbc-contestants-family-2802576-2025-10-13",
      "headline": "Amitabh Bachchan fulfils promise, gifts washroom to KBC contestant's family Amitabh Bachchan gifted a washroom to 'KBC' contestant Jayanta Dhule's family in Arambagh, Hooghly, fulfilling a promise he made on the show. The gesture has brought joy and improved hygiene for the women in the family, earning heartfelt gratitude from them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-learns-to-dance-at-68-grooves-to-tauba-tauba-2802562-2025-10-13",
      "headline": "Anupam Kher learns to dance at 68, grooves to Tauba Tauba. Watch Actor Anupam Kher surprised fans by sharing his first-ever dance video, showcasing a hook step he learned from choreographer Caesar. The 68-year-old actor said he took up dancing as a new challenge, proving it's never too late to try something new."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-season-4-release-date-when-and-where-to-watch-the-two-part-series-2802520-2025-10-13",
      "headline": "Bridgerton Season 4 release date: When and where to watch the two-part series Makers have announced the release dates for 'Bridgerton' Season 4, which will drop in two parts: Part 1 on January 29 and Part 2 on February 26. The season follows Benedict Bridgerton's romantic journey with Sophie Baek, inspired by Julia Quinn's 'An Offer from a Gentleman'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shatrughan-sinha-tribute-to-kishore-kumar-death-anniversary-2802517-2025-10-13",
      "headline": "Shatrughan celebrates Kishore Kumar's legacy: Complete entertainer, forever loved Veteran actor Shatrughan Sinha paid an emotional tribute to Kishore Kumar on his death anniversary today. He shared a post and recalled his timeless legacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-emotional-post-celebrates-triple-victory-for-bachchan-family-2802491-2025-10-13",
      "headline": "Amitabh Bachchan's emotional post celebrates triple victory for Bachchan family The Bachchan family made headlines at the Filmfare Awards 2025, with Amitabh, Jaya, and Abhishek each winning a trophy. Amitabh thanked fans for their support with a special social media post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-eras-tour-docuseries-concert-film-jiohotstar-2025-2802483-2025-10-13",
      "headline": "Taylor Swift announces Eras Tour documentary and finale film Pop star Taylor Swift to release a six-episode docuseries and concert film covering her Eras Tour. The series offers viewers behind-the-scenes insights and highlights fan traditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-ending-bermes-fight-explained-is-the-3rd-film-loading-2802456-2025-10-13",
      "headline": "Kantara Chapter 1 ending, Berme's fight explained: Is the 3rd film loading? Rishab Shetty's 'Kantara: Chapter 1' ends on a powerful note, leaving fans curious about what's next. Here's the full ending explained -- from Berme's divine awakening to hints of what makes a third film in Shetty's mythological universe."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-praises-pm-modi-egypt-gestures-shehbaz-sharif-behind-him-glbs-2802649-2025-10-14",
      "headline": "Trump praises 'good friend' Modi in Egypt, gestures to Shehbaz Sharif behind himDonald Trump, co-hosting the Gaza Peace Summit in Sharm el-Sheikh alongside Egyptian President Abdel Fattah al-Sisi, also praised the Pakistani Prime Minister and said regional peace \"depends on good friends doing good things\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-elections-updates-last-minute-hiccups-hit-seat-sharing-deal-between-jdu-and-bjp-2802652-2025-10-14",
      "headline": "Bihar NDA cracks? Last-minute hiccups hit seat-sharing deal between JD(U) and BJPSoon after the joint seat-sharing announcement was called off, senior BJP leaders Dharmendra Pradhan and Nityanand Rai, along with Bihar Transport Minister Nitin Nabin, flocked with Bihar Deputy Chief Minister Samrat Choudhary to JD(U) MP Sanjay Jha's residence and left around 9:30 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/why-a-young-kbc-17-contestants-behaviour-has-put-his-parents-in-the-firing-line-2802397-2025-10-13",
      "headline": "Why a young KBC contestant's behaviour has put his parents in the firing lineTen-year-old KBC contestant Ishit Bhatt has become the butt of memes and jokes on social media, and the reason is his overconfident demeanour. His parents, too, have been dragged into this, with strangers dissecting their \"parenting style\" based on a few televised minutes. Is that fair? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-student-sexual-assault-gang-rape-bid-south-asian-university-campus-2802739-2025-10-14",
      "headline": "Tore my clothes: Student claims gang-rape bid on Delhi university campusTore my clothes: Student claims gang rape bid on Delhi university campus"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claim-denied-insurance-star-health-ombudsman-irdai-manipal-hospital-mudit-agarwal-poonam-singhal-2802351-2025-10-14",
      "headline": "Every claim is a fight: Inside a family's months-long health insurance battleIn India, buying health insurance is easy, but claiming it is another battle. Families like Mudit Agarwal's often end up fighting bureaucracy instead of focusing on illness. In this week's story from our ongoing 'Claim Denied' series, we reveal how one family's ordeal exposes the cracks in the system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-day-5-live-score-shubman-gill-rahul-sai-delhi-2802696-2025-10-14",
      "headline": "Day 5: Rahul and Sai Sudharsan cautious on final morningIndia (IND) vs West Indies (WI), 2nd Test Day 5 Live Score: India are just 45 runs away from completing a 2-0 series whitewash over the West Indies on Day 5 morning of the second Test in Delhi. KL Rahul and Sai Sudharsan have continued from where they left off and are driving the hosts to victory with minimal fuss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/world-forgot-how-ancient-india-shaped-it-william-dalrymple-tells-fareed-zakaria-2802693-2025-10-14",
      "headline": "World forgot how ancient India shaped it, William Dalrymple tells Fareed ZakariaAs historian William Dalrymple puts it, the story of civilisation itself cannot be told without India, a land that once taught the world to think, count, and dream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jain-political-party-mumbai-bmc-election-pigeon-feeding-ban-dadar-kabootarkhana-monk-threat-politicians-marathi-2802446-2025-10-14",
      "headline": "How pigeons have given India its first Jain political partyMonths after a Jain monk's threat of \"taking up arms\" over a pigeon-feeding ban in Mumbai, the community has announced the launch of a political party, the Shanti Doot Jankalyan Party, with a pigeon as its symbol. The move, ahead of the long-delayed BMC polls, could shake up Mumbai's political landscape and split votes in key wards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-prime-minister-shehbaz-sharif-calls-us-president-donald-trump-peacemaker-italian-prime-minister-giorgia-melonis-expression-says-it-all-2802670-2025-10-14",
      "headline": "Watch: Another viral Meloni moment as Shehbaz Sharif praises TrumpAt the Gaza Peace Summit, Pakistan Prime Minister Shehbaz Sharif took many by surprise by hailing US President Donald Trump for his \"outstanding contributions\" to stop the India-Pakistan conflict. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/story/bihar-mahagathbandhan-seat-sharing-talks-stall-congress-rjd-clash-2802700-2025-10-14",
      "headline": "Bihar Mahagathbandhan impasse deepens, Congress bargains hard, RJD irked by symbolsSeat-sharing talks between the Congress and RJD in Bihar have stalled after inconclusive meetings in New Delhi and Patna. Congress's firm bargaining stance and the RJD's withdrawal of candidate symbols have deepened uncertainty within the Mahagathbandhan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-return-gautam-gambhir-shubman-gill-test-2802688-2025-10-14",
      "headline": "The Ro-Ko return: New leaders Gautam Gambhir and Shubman Gill in hot seatRohit Sharma and Virat Kohli return to international cricket this week, six months after their last outing. The spotlight now falls on Shubman Gill and Gautam Gambhir, who face a crucial test in ensuring a smooth transition on India's path to the 2027 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/pakistan-muslim-nation-to-get-love-island-people-sink-it-in-quran-verses-lazawal-ishq-ott-series-reality-dating-tv-show-2802581-2025-10-14",
      "headline": "Pakistan gets Love Island, people sink it in Quran versesPakistani reality dating show, Lazawal Ishq, tried to channel Love Island but ended up delivering a cringe-fest of a series. Pakistanis used Quranic verses to brand it \"unIslamic\". There's awkward casting, archaic gender dynamics, and an experiment that goes wildly off the rails. But it seemingly shows aspects of Pakistani society that mainstream TV fails to highlight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-kantara-chapter-1-celebrates-women-as-both-soul-and-storm-of-film-2802617-2025-10-14",
      "headline": "The women of Kantara Chapter 1: Rishab Shetty turns feminine into cinematic powerRishab Shetty expands his cinematic universe in 'Kantara: Chapter 1', turning women into the story's driving force. From divine strength to human resilience, the prequel moves the gender conversation in the story with myth, strength, and power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-gush-over-giorgia-meloni-at-egypt-summit-glbs-2802664-2025-10-14",
      "headline": "You don't mind being called beautiful, right? Trump gushes over Meloni in EgyptUS President Donald Trump drew attention after calling Italian Prime Minister Giorgia Meloni \"a beautiful young woman,\" praising her as an \"incredible leader\" in Egypt summit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-us-missile-shield-race-and-the-new-star-wars-2802537-2025-10-14",
      "headline": "China-US missile shield race and the new Star WarsThe US and China are reigniting a Cold War-style arms race in space, each racing to build advanced missile defence shields capable of intercepting intercontinental nuclear missiles. While Washington's USD 175 billion Golden Dome aims for full capability by 2029, Beijing claims to have already deployed a prototype global defence network."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengaluru-milk-parlour-owner-assaulted-bihar-man-rowdy-sheeter-kannadiga-migrant-debate-2802701-2025-10-14",
      "headline": "Send him back: Bengaluru parking dispute reignites 'outsider vs Kannadiga' debateThe violent parking dispute involving a Bihar rowdy-sheeter in Bengaluru has set off a fresh \"outsider vs Kannadiga\" debate online, with sharp calls for action against migrants flooding Karnataka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/nobel-prize-2025-richard-robsons-mofs-trap-carbon-pull-water-from-air-2802378-2025-10-14",
      "headline": "How a classroom demo helped Richard Robson trap carbon and win a Nobel PrizeAt 88, Professor Richard Robson has won the 2025 Nobel Prize in Chemistry for helping create molecular scaffolds known as metal–organic frameworks — crystal-like structures so advanced they can pull water from desert air, trap carbon emissions, and clean our planet's air and water. His discovery has opened new frontiers in sustainable chemistry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-pilots-want-all-air-india-boeing-787-planes-grounded-2802706-2025-10-14",
      "headline": "Why pilots want all Air India Boeing 787 planes groundedThe Federation of Indian Pilots has demanded an inquiry into the series of serious in-flight technical snags and a thorough examination of Boeing 787s operated by Air India\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-dgp-on-leave-after-ips-officer-suicide-harassment-allegations-glbs-2802650-2025-10-14",
      "headline": "Haryana top cop Shatrujeet Kapur sent on leave amid IPS officer's suicide rowHaryana DGP Shatrujeet Kapur was sent on leave after a senior IPS officer's suicide note named him for alleged harassment. The 52-year-old Kumar allegedly shot himself dead at his Sector 11 residence on October 7.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/loc-tension-kupwara-firing-blasts-infiltration-machil-dudniyal-2802647-2025-10-14",
      "headline": "Two terrorists killed in gunfight with security forces along LoC in J&K's KupwaraTwo terrorists have been killed along the Line of Control (LoC) near Machil and Dudniyal in Jammu and Kashmir's Kupwara as the Indian Army foiled a suspected infiltration attempt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/homesick-stressed-or-celebrating-the-health-impact-of-festive-overeating-2802461-2025-10-14",
      "headline": "Homesick, stressed, or celebrating? The health impact of festive overeatingAs emotions run high, people tend to overeat, sometimes out of celebration, sometimes out of stress or nostalgia. But what this does to the body is a bigger concern. Experts suggest ways to keep track of what you eat to stay mindful and balanced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/is-mtv-music-channel-shutting-down-after-40-years-heres-whats-really-happening-2802671-2025-10-14",
      "headline": "Is MTV music shutting down after 40 years? Here's what's really happeningMTV will end its iconic UK music channels by December 2025, focusing on reality TV, sparking nostalgia and disappointment among fans and former hosts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-slams-pakistan-cross-border-terrorism-child-rights-violations-defends-operation-sindoor-glbs-2802665-2025-10-14",
      "headline": "Op Sindoor balanced response to terrorism: India tears into Pak's narrative at UNIndia's statement at the UNGA firmly countered Pakistan's narrative, framing Operation Sindoor as a justified response to terrorism while criticising Islamabad for attacks on children and civilians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/cough-syrup-deaths-who-issues-alert-coldrif-children-died-sresan-pharmaceutical-mp-tamil-nadu-2802737-2025-10-14",
      "headline": "Cough syrup deaths: WHO issues global alert, asks nations to report detectionsAt least 22 children in Madhya Pradesh have died after consuming contaminated Coldrif cough syrup, prompting Tamil Nadu authorities to shut Sresan Pharmaceuticals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-curious-case-of-pradeep-ranganathan-dudes-rise-to-relevance-2802646-2025-10-14",
      "headline": "The curious case of Pradeep Ranganathan: Dude's rise to relevanceFrom short films to the big screen, Pradeep Ranganathan has carved a niche with just two movies, blending youth-centric storytelling, relatable characters, and sharp self-awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kbc-17-big-b-recites-agneepath-iconic-line-on-rishab-shetty-request-2802699-2025-10-14",
      "headline": "KBC 17: Big B recites Agneepath's iconic line on Rishab Shetty's requestActor-director Rishab Shetty featured on 'Kaun Banega Crorepati 17' with Amitabh Bachchan. The duo recreated a memorable dialogue from 'Agneepath' (1990), adding nostalgia to the show."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-odoi-series-josh-inglis-adam-zampa-2802697-2025-10-14",
      "headline": "IND vs AUS: Josh Inglis, Adam Zampa ruled out series opener India vs Australia: Wicketkeeper Josh Inglis and spinner Adam Zampa have been ruled out of Australia's side for their first ODI against India. Inglis has failed to recover from his calf strain in time for the opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-brian-lara-pens-emotional-note-west-indies-cricket-delhi-test-2802695-2025-10-14",
      "headline": "Brian Lara pens emotional note for West Indies cricket after attending Delhi Test West Indies legend Brian Lara penned a heartfelt note for the West Indies cricket team after attending the second Test against India at the Arun Jaitley Stadium in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-day-5-live-score-shubman-gill-rahul-sai-delhi-2802696-2025-10-14",
      "headline": "Day 5: Rahul and Sai Sudharsan cautious on final morning India (IND) vs West Indies (WI), 2nd Test Day 5 Live Score: India are just 45 runs away from completing a 2-0 series whitewash over the West Indies on Day 5 of the second Test in Delhi. KL Rahul and Sai Sudharsan will look to continue from where they left off and guide the hosts to victory with minimal fuss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-return-gautam-gambhir-shubman-gill-test-2802688-2025-10-14",
      "headline": "The Ro-Ko return: New leaders Gautam Gambhir and Shubman Gill in hot seat Rohit Sharma and Virat Kohli return to international cricket this week, six months after their last outing. The spotlight now falls on Shubman Gill and Gautam Gambhir, who face a crucial test in ensuring a smooth transition on India's path to the 2027 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-nitish-reddy-bowling-2802687-2025-10-14",
      "headline": "Nitish Reddy not bowling in Delhi Test? Decision baffles Aakash Chopra India vs West Indies: All rounder Nitish Kumar Reddy bowled a grand total of 4 overs in the 2-match Test series vs West Indies. The lack of overs for the player has baffled many, including Aakash Chopra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-kohli-india-vs-australia-vijay-hazare-2802346-2025-10-14",
      "headline": "Virat Kohli and Rohit Sharma should play Vijay Hazare Trophy: Parthiv Patel Former cricketer Parthiv Patel has urged senior India cricketers Virat Kohli and Rohit Sharma to participate in the Vijay Hazare Trophy. Parthiv requests the senior duo to play domestic cricket to maintain cricketing fitness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/aman-sehrawat-appeals-wfi-ban-after-weight-miss-world-championships-2802677-2025-10-14",
      "headline": "Wrestler Aman Sehrawat pleads WFI to reconsider ban on him, admits mistake Paris Olympics bronze medalist grappler Aman Sehrawat on Monday appealed to the Wrestling Federation of India (WFI) to reconsider the one-year ban handed to him for missing weight at the World Championships in Zagreb."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-on-rohit-sharma-virat-kohli-australia-tour-2025-2802631-2025-10-14",
      "headline": "Eager to see Ro-Ko back in Australia, hope Kohli scores 2 hundreds: Harbhajan Harbhajan Singh said that he is excited to see Rohit Sharma and Virat Kohli back in action during the Australia tour. Harbhajan also hopes that Kohli will score atleast two hundreds during the tour down under. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nigar-sultana-bangladesh-heartbreaking-loss-south-africa-womens-world-cup-2025-2802618-2025-10-13",
      "headline": "Bangladesh captain Nigar Sultana says team left in tears after heartbreaking SA loss Bangladesh captain Nigar Sultana said that her team was left in tears after their heartbreaking loss to South Africa in Vizag. Sultana said she was proud of the team's efforts in the close encounter against the Proteas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/play-the-spinners-effectively-maddy-green-on-how-new-zealand-can-beat-sri-lanka-2802606-2025-10-13",
      "headline": "Play the spinners effectively: Maddy Green on how New Zealand can beat Sri Lanka New Zealand's Maddy Green believes that the key to beating Sri Lanka in their World Cup league-fixtures is to play their spinners effectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/weve-done-well-against-new-zealand-in-the-past-but-thats-history-rumesh-ratnayake-2802596-2025-10-13",
      "headline": "We've done well against New Zealand in the past, but that's history: Rumesh Ratnayake Sri Lanka head coach, Rumesh Ratnayake, believes that their side may have done well against New Zealand in the recent past, but now it doesn't matter as they face a crucial game in the league stages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/aman-sehrawat-appeals-wfi-ban-after-weight-miss-world-championships-2802677-2025-10-14",
      "headline": "Wrestler Aman Sehrawat pleads WFI to reconsider ban on him, admits mistake Paris Olympics bronze medalist grappler Aman Sehrawat on Monday appealed to the Wrestling Federation of India (WFI) to reconsider the one-year ban handed to him for missing weight at the World Championships in Zagreb."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-on-rohit-sharma-virat-kohli-australia-tour-2025-2802631-2025-10-14",
      "headline": "Eager to see Ro-Ko back in Australia, hope Kohli scores 2 hundreds: Harbhajan Harbhajan Singh said that he is excited to see Rohit Sharma and Virat Kohli back in action during the Australia tour. Harbhajan also hopes that Kohli will score atleast two hundreds during the tour down under. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nigar-sultana-bangladesh-heartbreaking-loss-south-africa-womens-world-cup-2025-2802618-2025-10-13",
      "headline": "Bangladesh captain Nigar Sultana says team left in tears after heartbreaking SA loss Bangladesh captain Nigar Sultana said that her team was left in tears after their heartbreaking loss to South Africa in Vizag. Sultana said she was proud of the team's efforts in the close encounter against the Proteas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/play-the-spinners-effectively-maddy-green-on-how-new-zealand-can-beat-sri-lanka-2802606-2025-10-13",
      "headline": "Play the spinners effectively: Maddy Green on how New Zealand can beat Sri Lanka New Zealand's Maddy Green believes that the key to beating Sri Lanka in their World Cup league-fixtures is to play their spinners effectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/weve-done-well-against-new-zealand-in-the-past-but-thats-history-rumesh-ratnayake-2802596-2025-10-13",
      "headline": "We've done well against New Zealand in the past, but that's history: Rumesh Ratnayake Sri Lanka head coach, Rumesh Ratnayake, believes that their side may have done well against New Zealand in the recent past, but now it doesn't matter as they face a crucial game in the league stages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-ban-womens-world-cup-marizanne-kapp-chloe-tryon-south-africa-survive-bangladesh-scare-2802589-2025-10-13",
      "headline": "Women's World Cup: Kapp-Tryon fifties help South Africa survive Bangladesh scareWomen's World Cup 2025: Bangladesh's spirited bowling effort and late drama in the field weren't enough as South Africa's experienced duo, Marizanne Kapp and Chloe Tryon, held their nerve to seal a tense three-wicket win in a thriller at the Women's World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-west-indies-counter-kuldeep-yadav-2nd-innings-delhi-test-2802560-2025-10-13",
      "headline": "How West Indies countered Kuldeep Yadav after taking five wickets in first inningsKuldeep Yadav dominated West Indies in the first innings with a five-wicket haul. Despite this, Campbell and Hope's twin centuries in the second innings showcased West Indies' resilience and tactical adaptation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/italy-world-cup-qualifier-gennaro-gattuso-israel-clash-must-win-2802553-2025-10-13",
      "headline": "Italy's road to redemption: Gattuso warns of Israel danger in must-win tieItaly prepares for a decisive World Cup qualifying match against Israel in Udine, as coach Gennaro Gattuso warns of Israel's attacking quality and heightened security measures accompany a large pro-Palestinian march in the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-confident-to-end-century-drought-lead-england-ashes-2025-australia-2802539-2025-10-13",
      "headline": "Ashes 2025: Freed from captaincy, Joe Root ready to end century dry spell Down UnderJoe Root is determined to end his century drought in Australia during the 2025 Ashes series. His renewed focus and team-first mindset could be key to England reclaiming the Ashes urn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-wi-2nd-test-delhi-test-washington-sundar-press-conference-2802538-2025-10-13",
      "headline": "IND vs WI, 2nd Test: Washington Sundar jokes about Delhi Test going to Day 5India vs West Indies: After West Indies' spirited batting display on Day 4, Washington Sundar praised the Indian bowlers, saying taking 20 wickets on a slow Delhi pitch was commendable. India are closing in on a dominant win in the capital and a 2-0 series sweep.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-fitness-criticism-sanjay-bangar-india-tour-of-australia-2802534-2025-10-13",
      "headline": "Rohit Sharma worked hard after being called out for fitness, reveals ex-coachFormer India batting coach Sanjay Bangar compared Rohit Sharma's recent fitness transformation ahead of his ODI comeback in Australia to the hard work he put in after being dropped from the 2011 World Cup squad. Rohit has reportedly shed 10 kg as he gears up for his first international appearance since March."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/phf-advises-players-avoid-confrontation-india-sultan-of-johor-cup-2025-2802521-2025-10-13",
      "headline": "After Asia Cup fiasco, Pakistan hockey tells players to take sensible route vs IndiaThe Pakistan Hockey Federation has told its players to avoid any confrontations with the Indian stars during their upcoming clash at the Sultan Of Johor Cup in Malaysia on Tuesday, October 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-wi-delhi-test-day-4-washington-sundar-press-conference-2802504-2025-10-13",
      "headline": "Delhi Test: India find positives in bowling grind despite follow-on criticismIndia vs West Indies, 2nd Test:** All-rounder Washington Sundar said the conditions in Delhi were not bowler-friendly and expressed satisfaction with India managing to take 20 wickets despite a late fightback from the West Indies. India need 58 runs with nine wickets in hand to win the Test on Day 5.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-wi-2nd-test-delhi-test-washington-sundar-press-conference-2802538-2025-10-13",
      "headline": "IND vs WI, 2nd Test: Washington Sundar jokes about Delhi Test going to Day 5India vs West Indies: After West Indies' spirited batting display on Day 4, Washington Sundar praised the Indian bowlers, saying taking 20 wickets on a slow Delhi pitch was commendable. India are closing in on a dominant win in the capital and a 2-0 series sweep.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-fitness-criticism-sanjay-bangar-india-tour-of-australia-2802534-2025-10-13",
      "headline": "Rohit Sharma worked hard after being called out for fitness, reveals ex-coachFormer India batting coach Sanjay Bangar compared Rohit Sharma's recent fitness transformation ahead of his ODI comeback in Australia to the hard work he put in after being dropped from the 2011 World Cup squad. Rohit has reportedly shed 10 kg as he gears up for his first international appearance since March."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/phf-advises-players-avoid-confrontation-india-sultan-of-johor-cup-2025-2802521-2025-10-13",
      "headline": "After Asia Cup fiasco, Pakistan hockey tells players to take sensible route vs IndiaThe Pakistan Hockey Federation has told its players to avoid any confrontations with the Indian stars during their upcoming clash at the Sultan Of Johor Cup in Malaysia on Tuesday, October 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-wi-delhi-test-day-4-washington-sundar-press-conference-2802504-2025-10-13",
      "headline": "Delhi Test: India find positives in bowling grind despite follow-on criticismIndia vs West Indies, 2nd Test:** All-rounder Washington Sundar said the conditions in Delhi were not bowler-friendly and expressed satisfaction with India managing to take 20 wickets despite a late fightback from the West Indies. India need 58 runs with nine wickets in hand to win the Test on Day 5.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-1st-test-day-2-noman-ali-welding-glasses-heroics-lahore-2802496-2025-10-13",
      "headline": "PAK vs SA 1st Test: Noman Ali's 'welding glasses' and spin heroics light up Lahore TestNoman Ali's spin wizardry and 'welding glasses' left South Africa reeling on Day 2 in Lahore, as Pakistan's spinners once again dominated, reducing the visitors to a struggling position and keeping the home side firmly in control of the Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carlo-ancelotti-neymar-fitness-brazil-recall-world-cup-2026-2802490-2025-10-13",
      "headline": "Neymar remains in Brazil's plans, but must regain fitness for recall: AncelottiBrazil manager Carlo Ancelotti said that Neymar still remains in his plans but said that the Santos star needs to regain his fitness. Neymar has been struggling to remain fit ever since his major injury in 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-1st-test-lahore-babar-azam-sharp-catch-slips-ryan-rickelton-2802463-2025-10-13",
      "headline": "Watch: Babar Azam shows sharp reactions at slips, takes blinder to dismiss RickeltonBabar Azam returned to Test whites with a stunning catch against South Africa in Lahore. His fielding brilliance and spin bowling dominance set the tone, but batting concerns remain for Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brydon-carse-ben-stokes-mark-wood-fit-for-ashes-2025-australia-2802450-2025-10-13",
      "headline": "Ben Stokes, Mark Wood are raring to go for Ashes in Australia: Brydon CarseEngland pacer Brydon Carse has said that Ben Stokes and Mark Wood are raring to go for the Ashes series in Australia. Stokes and Wood are making their recoveries from respective injuries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-2nd-test-day-4-shai-hope-campbell-follow-on-call-question-2802413-2025-10-13",
      "headline": "Gritty West Indies make India toil, stretch Delhi Test to Day 5India vs West Indies, 2nd Test: West Indies showed rare grit with the bat on Day 4, frustrating India and stretching the Delhi Test to its final day, while India's follow-on and declaration decisions drew scrutiny from fans and experts alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jack-wilshere-appointed-luton-town-manager-to-revive-league-one-campaign-2802353-2025-10-13",
      "headline": "Former Arsenal midfielder Jack Wilshere named as Luton Town managerFormer Arsenal midfielder Jack Wilshere has been named as the new manager of Luton Town as the former England international looks to turn around the fortunes of the club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-concedes-100-runs-india-vs-west-indies-delhi-test-fightback-2802354-2025-10-13",
      "headline": "Kuldeep Yadav sets unwanted record, concedes 100 for 1st time in Delhi TestKuldeep Yadav conceded 100 runs for the first time in his Test career as West Indies fought back in Delhi. His costly spell highlighted India's struggles and put pressure on captain Shubman Gill's decision to enforce the follow-on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-tri-series-afghanistan-doubts-sri-lanka-t20-noc-conflict-2802341-2025-10-13",
      "headline": "PCB readies backup plans as Afghanistan participation in tri-series in doubt: ReportThe Pakistan Cricket Board is preparing an alternate plan for the upcoming tri-series amid doubts over Afghanistan's participation due to military tensions."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}