{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-320-points-lower-nifty-below-25800-hul-down-3-percent-2807806-2025-10-24",
      "headline": "Sensex closes 320 points lower, Nifty below 25,800; HUL down 3%Sensex closes 320 points lower, Nifty below 25,800; HUL down 3%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/mutual-fund-investing-best-returns-xirr-value-how-to-invest-expert-view-2807794-2025-10-24",
      "headline": "Have you been investing in mutual funds the wrong way all this time?Experts say that most investors rely only on absolute returns while judging a mutual fund's performance. They focus on the number showing how much profit they've made, without understanding the factors behind those returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-maize-import-talks-rattle-indian-farmers-as-prices-fall-below-msp-2807771-2025-10-24",
      "headline": "US maize import talks rattle Indian farmers as prices fall below MSPReports suggest that if the trade deal goes through and American maize starts entering Indian markets — prices could crash, and farmers may face huge losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-600-points-why-the-stock-market-is-falling-today-2807736-2025-10-24",
      "headline": "Sensex tumbles 600 points: Why the stock market is falling todayThe fall came as investors engaged in profit booking following recent gains. After sustained upward movements, it is common for markets to experience short-term corrections as participants secure returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-etfs-vs-physical-gold-what-smart-investors-are-looking-at-explains-expert-2807734-2025-10-24",
      "headline": "Gold ETFs vs physical gold: What smart investors are looking at, explains expertGold may be timeless, but the way Indians invest in it is changing fast. With rising awareness of hidden costs, gold ETFs are gaining traction as a smarter, hassle-free alternative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-pandey-ads-storytelling-emotion-fevikwik-cadbury-gujarat-tourism-2807721-2025-10-24",
      "headline": "How Piyush Pandey made India fall in love with adsPiyush Pandey transformed Indian advertising with heartfelt stories and local flavour. His campaigns blended wit and emotion, leaving a lasting cultural impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-pandey-who-was-he-fevicol-dairy-milk-asian-paints-famous-ads-adman-dies-age-70-tribute-2807686-2025-10-24",
      "headline": "Remembering Piyush Pandey: The ad legend who made brands immortalFor over four decades, the Jaipur-born storyteller reshaped Indian advertising, turning simple commercials into cultural phenomena and making brands like Fevicol, Cadbury, and Asian Paints inseparable from the Indian consciousness.​"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ca-explains-why-saving-before-spending-works-best-for-financial-stability-2807696-2025-10-24",
      "headline": "CA explains why saving before spending works best for financial stabilityWhile most people save whatever is left after spending, CA Meenal Goel flips the approach. Her mantra, prioritise savings before expenses, has helped her stay financially secure and stress-free."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/error-in-your-itr-filing-here-is-how-to-correct-it-with-an-updated-return-2807634-2025-10-24",
      "headline": "Error in your ITR filing? Here's how to correct it with an updated returnRealised there's an error in your ITR after submission? You're not alone. Many taxpayers make small mistakes while filing, but the good news is — you can still correct them through an updated return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/central-banks-gold-hoarding-2025-global-reserve-shift-2807616-2025-10-24",
      "headline": "Why the world's central banks are buying gold like never beforeNot just households and investors, but central banks around the globe are buying gold like it's Dhanteras every day. So why are the world's biggest buyers going for bullion? Read on to find out. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/target-announces-1800-job-cuts-in-a-decade-amid-falling-sales-employee-layoff-2807611-2025-10-24",
      "headline": "Target announces 1,800 job cuts in a decade amid falling salesAll corporate employees in the US have been asked to work from home next week as the company finalises its restructuring process. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-prices-slip-rally-cools-traders-watch-next-2807560-2025-10-24",
      "headline": "Gold, silver prices continue to fall: Is the rally over and what should you do next?After a nine-week winning streak, gold and silver prices are finally losing steam as investors book profits amid a stronger dollar, easing global tensions, and anticipation over key US economic data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-flat-defence-stocks-fmcg-metal-shares-2807557-2025-10-24",
      "headline": "Sensex, Nifty open flat as FMCG stocks offset metal gainsThe S&P BSE Sensex lost 96.63 points to 84,459.77, while the NSE Nifty50 was down by 24.20 points to 25,866.45 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/midwest-listing-share-price-latest-gmp-profit-for-investors-book-hold-market-debut-2807550-2025-10-24",
      "headline": "Midwest listing today: Will it give investors profit? See what GMP suggestsMidwest IPO was subscribed 92.36 times overall. The retail portion was booked 25.52 times, the Qualified Institutional Buyers (QIB) category saw 146.99 times, while the Non-Institutional Investors (NII) category was subscribed 176.57 times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bank-account-4-nominees-allowed-november-1-per-account-claim-settlement-process-banking-laws-amendment-2807527-2025-10-24",
      "headline": "Banks to allow up to 4 nominees per account from November 1. Here's how it helps youThe decision to allow four nominees aims to make the claim settlement process smoother, more transparent, and uniform across all banks in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-prices-rebound-amid-volatility-will-they-rise-today-bullion-2807349-2025-10-24",
      "headline": "Gold, silver prices rebound amid volatility. Will they rise today?Following a rough start earlier this week, gold and silver staged a mild recovery on Thursday. While the recovery lifted market mood, the outlook for today depends on global data and investor sentiment. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/apple-loses-uk-lawsuit-over-app-stores-unfair-30-developer-commissions-2807439-2025-10-23",
      "headline": "Apple loses UK lawsuit over App Store's unfair 30% developer commissionsApple has been found guilty in a London court for abusing its dominant position by charging app developers an unfair 30 per cent commission on its App Store. The ruling marks a significant legal challenge against the tech giant's business practices in the UK market.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dreamliner-aircraft-saw-31-faulty-deployment-of-emergency-turbine-in-14-years-2807364-2025-10-23",
      "headline": "Dreamliner aircraft saw 31 faulty deployment of emergency turbine in 14 yearsBoeing's Dreamliner aircraft reported 31 instances of faulty deployment of Ram Air Turbine, which is deployed automatically in the eventuality of a dual engine failure or total electric or hydraulic failure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/wasting-your-credit-card-reward-points-here-is-how-to-track-and-redeem-smartly-2807249-2025-10-23",
      "headline": "Wasting your credit card reward points? Here's how to track and redeem smartlyMost people use their credit cards daily but forget one key benefit — reward points. These points can fetch you free flights, hotel stays, or cashback, but only if tracked and redeemed wisely. Here's how to make every swipe count."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-130-points-higher-nifty-above-25800-infosys-up-4-percent-2807241-2025-10-23",
      "headline": "Sensex ends 130 points higher, Nifty above 25,800; Infosys up 4%The S&P BSE Sensex added 130.06 points to end at 84,556.40, while the NSE Nifty50 gained 22.80 points to close at 25,891.40. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dark-fascination-the-growing-obsession-of-serial-killers-in-films-and-web-series-2807699-2025-10-24",
      "headline": "Dark fascination: The growing obsession of serial killers in films and web series The fascination with serial killer stories has grown globally, with films and web series exploring both real and fictional crimes. Audiences are drawn to these dark tales for their suspense, insight into human nature, and the thrill of seeing justice unfold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/madhuri-dixit-jackie-shroffs-100-days-set-for-web-series-remake-2807782-2025-10-24",
      "headline": "Madhuri Dixit, Jackie Shroff's 100 Days set for web series remake | Exclusive Madhuri Dixit and Jackie Shroff's '100 Days' is set to be remade into a web series by its original producer, Jay Mehta.  The show will feature Abhishek Kumaarr and Srishti Singh in the lead.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/unruptured-brain-aneurysm-diagnosis-kim-kardashian-blames-health-issues-stress-from-kanye-west-marriage-2807769-2025-10-24",
      "headline": "Kim Kardashian reveals brain aneurysm, blames stress from marriage to Kanye West Kim Kardashian revealed she has been diagnosed with an unruptured brain aneurysm during a routine MRI, as shown in a new teaser for 'The Kardashians' Season 7. While doctors say she's not in immediate danger, Kardashian linked the health issue to years of emotional stress and her turbulent relationship with Kanye West."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sachin-sanghvi-charged-sexual-harassment-released-bail-investigation-2807758-2025-10-24",
      "headline": "Sachin Sanghvi of Sachin-Jigar duo accused of sexual harassment, released on bail Musician-composer Sachin Sanghvi of the Sachin-Jigar duo has been charged with alleged sexual harassment after a complaint by a 29-year-old. Sanghvi was arrested and later released on bail, with legal proceedings underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ken-karunaas-directorial-debut-school-life-entertainer-tamil-industry-stars-2807744-2025-10-24",
      "headline": "Actor Ken Karunaas's debut directorial begins, Karthi gives first clap Actor Ken Karunaas commenced his first film as director with a formal puja event. Industry figures including Vetri Maaran, Vishal, and Karthi attended the launch."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shreyas-talpade-alok-nath-allegedly-named-in-uttar-pradesh-investment-fraud-2807720-2025-10-24",
      "headline": "Shreyas Talpade, Alok Nath named in Uttar Pradesh investment fraud Bollywood actors Shreyas Talpade and Alok Nath have been named among 24 accused in a UP cooperative society fraud case that allegedly duped villagers with false investment promises. The Supreme Court has granted Talpade interim protection from arrest as the probe continues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/how-twinkling-watermelon-teaches-gen-z-what-means-truly-hear-your-parents-2807676-2025-10-24",
      "headline": "How Twinkling Watermelon teaches Gen Z what it means to truly hear your parents In this week's K-fix, we discuss how, 'Twinkling Watermelon' isn't just a time-travel K-drama, it's a heartfelt story about family, disability and communication. Through Eun-gyeol's journey as a CODA, the show beautifully explores what it really means to love, listen, and be understood.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-amitabh-bachchan-disappointed-after-contestant-fails-to-answer-rs-1-crore-question-2807727-2025-10-24",
      "headline": "KBC 17: Big B disappointed after contestant fails to answer Rs 1 crore question In the latest episode of 'Kaun Banega Crorepati 17', Amitabh Bachchan looked disappointed after the contestant failed to answer the Rs 1 crore question. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/piyush-pandey-advertising-icon-dies-tributes-smriti-irani-vivek-agnihotri-2807719-2025-10-24",
      "headline": "Advertising legend Piyush Pandey dies at 70, celebs pay tribute Advertising icon Piyush Pandey died at the age of 70. His death has deeply impacted the Indian advertising and entertainment communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-praised-by-allu-arjun-for-stellar-performances-and-technical-brilliance-2807707-2025-10-24",
      "headline": "Allu Arjun was in trance watching Kantara, applauds Rishab Shetty for one-man show Allu Arjun expressed admiration for 'Kantara Chapter 1' after viewing the film. The actor highlighted the film's performances and technical achievements in a detailed post. Directed by Rishab Shetty, the film's cast and crew received specific praise from Arjun."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nobody-wants-this-2-review-the-modern-day-therapy-we-didnt-know-we-needed-adam-brody-kristen-bell-2807691-2025-10-24",
      "headline": "Nobody Wants This 2 review: The modern-day therapy we didn't know we neededRelease Date:Thu Oct 23, 2025 'Nobody Wants This' on Netflix explores modern love, communication, and family, bringing together heart and relatability in a must-watch series. Season 2 of the hit show premiered on October 23. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-upset-over-ibrahim-ali-khan-calling-nadaaniyan-a-bad-film-report-2807688-2025-10-24",
      "headline": "Karan Johar upset over Ibrahim Ali Khan calling Nadaaniyan a bad film: Report Actor Ibrahim Ali Khan has stirred a controversy after calling his debut film 'Nadaaniyan' \"a really bad film.\" His remark hasn't gone down well with Karan Johar's camp, it seems, with close friends of the filmmaker calling it an act of ingratitude."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/idli-kadai-on-ott-when-and-where-to-watch-dhanush-directorial-drama-2807683-2025-10-24",
      "headline": "Idli Kadai on OTT: When and where to watch Dhanush's directorial drama Dhanush's comedy-drama 'Idli Kadai', which he also directed, is all set to premiere on Netflix on October 29. The film will stream in Tamil, Telugu, Hindi and Malayalam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/enforcement-directorate-summons-srikanth-krishna-kumar-in-money-laundering-cocaine-trafficking-2807689-2025-10-24",
      "headline": "ED summons Tamil actors Srikanth, Krishna Kumar in money laundering, drug probe The Enforcement Directorate has summoned Tamil actors Srikanth and Krishna Kumar for questioning in a money laundering probe linked to cocaine trafficking. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-films-censorship-2025-cbfc-cuts-haal-kerala-high-court-legal-challenge-2807639-2025-10-24",
      "headline": "Malayalam films under censor board scanner: Haal, Private, Janaki V and more Several Malayalam films have faced censorship challenges in 2025, with 'Haal' currently contesting CBFC cuts in Kerala High Court. The outcome could influence future certification and creative freedom in the industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tulsi-goes-global-as-smriti-irani-chats-with-bill-gates-on-faith-motherhood-watch-kyunki-saas-bhi-kabhi-bahu-thi-2-2807643-2025-10-24",
      "headline": "Tulsi goes global as Smriti Irani chats with Bill Gates on faith, motherhood. Watch Smriti Irani's 'Kyunki Saas Bhi Kabhi Bahu Thi 2' just got a global twist as Bill Gates joined Tulsi on a video call. In the lovely exchange, the two discussed motherhood, maternal health, and the Indian traditions that honour new mothers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pitbull-im-back-world-tour-india-december-2807641-2025-10-24",
      "headline": "Pitbull to bring his 'I'm Back' world tour to India this December Global sensation Pitbull is set to return to India in December for his 'I'm Back' world tour. He will perform in Hyderabad and Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bill-gates-digital-cameo-debut-bollywood-kyunki-saas-bhi-kabhi-bahu-thi-2-2807610-2025-10-24",
      "headline": "Before Kyunki 2, Bill Gates had a digital cameo debut in Bollywood. Guess the film Before 'Kyunki Saas Bhi Kabhi Bahu Thi 2', Bill Gates appeared in a Bollywood film, produced by Ektaa Kapoor. The film starred Arjun Kapoor and Shraddha Kapoor in lead roles. Can you guess the film? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/le-sserafim-spaghetti-single-featuring-j-hope-bts-2807618-2025-10-24",
      "headline": "J-hope eats it up in Le Sserafim's playful new single Spaghetti Le Sserafim has released their new single 'Spaghetti' featuring J-hope of BTS. The track blends playful food metaphors with polished pop, marking a unique collaboration in K-pop."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/china-builds-new-air-defence-site-near-india-border-satellite-images-reveal-retractable-missile-shelters-2807706-2025-10-24",
      "headline": "China builds new air-defence site near India border, satellite images revealSatellite imagery shows a new Chinese air-defence complex taking shape, comprising command and control buildings, barracks, vehicle sheds, munition storage, and radar positions. But the most intriguing feature of this facility, experts say, is a set of covered missile launch positions, believed to be equipped with retractable roofs for Transporter Erector Launcher vehicles that can carry, elevate, and fire missiles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/doctors-suicide-note-implicates-police-officers-phaltan-sexual-harassment-case-2807620-2025-10-24",
      "headline": "Maharashtra doctor dies by suicide, leaves note on palm accusing cop of rapeA woman doctor, who worked at a government-run hospital in Satara district, left a suicide note written on her hand, in which she accused a police officer of raping and sexually assaulting her over a period of five months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/afghanistan-to-restrict-water-build-dam-on-kunar-chitral-hydro-pakistan-after-india-pause-indus-waters-treaty-2807572-2025-10-24",
      "headline": "After India, Afghanistan to restrict river water to PakistanAfter India's suspension of the Indus Waters Treaty, Afghanistan is now moving to curb Pakistan's access to water from cross-border rivers. The Taliban's Supreme Leader has said that Kabul will build a dam on the Kunar river as soon as possible, just weeks after Afghanistan and Pakistan engaged in a war in which hundreds were killed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/bihar-assembly-polls-pm-narendra-modi-endorses-nitish-kumar-chief-minister-tejashwi-yadav-hits-back-2807778-2025-10-24",
      "headline": "PM endorses Nitish as Bihar Chief Minister amid Tejashwi's 'won't make him CM' attackIn a first, Prime Minister Narendra Modi endorsed Nitish Kumar as the BJP-led National Democratic Alliance's chief ministerial face, claiming that the alliance under his leadership would break all previous electoral records. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-pandey-ads-storytelling-emotion-fevikwik-cadbury-gujarat-tourism-2807721-2025-10-24",
      "headline": "How Piyush Pandey made India fall in love with adsPiyush Pandey transformed Indian advertising with heartfelt stories and local flavour. His campaigns blended wit and emotion, leaving a lasting cultural impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/investment-scams-bengaluru-delhi-ncr-hyderabad-rs-1500-crore-loss-2807740-2025-10-24",
      "headline": "30,000 people duped of Rs 1,500 crore, Bengaluru, Delhi worst hit: CentreInvestment scams have resulted in financial losses exceeding Rs 1,500 crore for over 30,000 people in India's top cities in the last six months. Bengaluru, Hyderabad, and Delhi-NCR account for the majority of impacted victims and financial damage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-reacts-chinese-russian-espionage-seduction-us-tech-2807511-2025-10-24",
      "headline": "If she's a 10, you're an asset: Elon Musk on 'sex warfare' in Silicon ValleyThe Times reported that attractive Chinese and Russian spies are infiltrating US tech companies by seducing employees to steal trade secrets. Tech magnate Elon Musk reacted to the report in his usual memelord style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/central-banks-gold-hoarding-2025-global-reserve-shift-2807616-2025-10-24",
      "headline": "Why the world's central banks are buying gold like never beforeNot just households and investors, but central banks around the globe are buying gold like it's Dhanteras every day. So why are the world's biggest buyers going for bullion? Read on to find out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/pakistan-afghanistan-war-india-border-history-gilgit-baltistan-1947-annexation-wakhan-corridor-betrayal-2807079-2025-10-24",
      "headline": "How treachery helped Pakistan wedge itself between neighbours India, AfghanistanWhile Afghanistan and Pakistan were engaged in a war this month, an image showing an India-Afghanistan border pillar from the 1930s went viral. India and Afghanistan shared a small land border through the Wakhan Corridor before Pakistan wedged itself in through treachery and the illegal occupation of Gilgit-Baltistan in 1947."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-pandey-who-was-he-fevicol-dairy-milk-asian-paints-famous-ads-adman-dies-age-70-tribute-2807686-2025-10-24",
      "headline": "Remembering Piyush Pandey: The ad legend who made brands immortalFor over four decades, the Jaipur-born storyteller reshaped Indian advertising, turning simple commercials into cultural phenomena and making brands like Fevicol, Cadbury, and Asian Paints inseparable from the Indian consciousness.​"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/tomatoes-vanish-pakistanis-pay-price-of-war-with-taliban-afghanistan-pak-torkham-chaman-trade-fruit-iran-qatar-2807697-2025-10-24",
      "headline": "Tomatoes vanish as Pakistanis pay price for war with AfghanistanPakistan conducted air strikes in Afghanistan, including Kabul, during the recent war, but it seems Pakistanis are having to pay through their nose for the aggression. Prices of tomatoes, among other essential vegetables, have surged by 400%. That is because key border crossings are shut and trade has been suspended since October 11. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/11-killed-as-bus-travelling-from-hyderabad-to-bengaluru-hits-two-wheeler-catches-fire-in-andhra-district-2807508-2025-10-24",
      "headline": "20 killed as Hyderabad-Bengaluru bus hits bike, catches fire in AndhraAt least 20 people were killed after a Hyderabad–Bengaluru bus caught fire following a collision with a two-wheeler in Andhra Pradesh's Kurnool district."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/yuzvendra-chahal-sister-kenaa-shares-emotional-note-for-him-amid-dhanashree-remarks-2807533-2025-10-24",
      "headline": "Yuzvendra Chahal's sister shares emotional note for him amid Dhanashree's remarksYuzvendra Chahal's sister Kenaa Dwivedi shared a heartfelt Bhai Dooj note praising her brother's dignity and silence amid tough times, which many saw as an indirect dig at his ex-wife Dhanashree Verma. Her post came soon after Dhanashree opened up about their marriage and split during her stint on 'Rise and Fall'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/fevicol-seals-the-deal-with-mission-impossible-post-on-louvre-jewellery-heist-2807651-2025-10-24",
      "headline": "Fevicol seals the deal with 'Mission Impossible' post on Louvre jewellery heistThe Instagram post, shared on Fevicol's official Instagram account, featured an emerald-and-diamond necklace and earrings displayed inside a glass case, but sealed shut with a thick coat of Fevicol. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-hockey-team-pull-out-junior-hockey-world-cup-india-2807716-2025-10-24",
      "headline": "After Asia Cup hockey, Pakistan pull out of junior World Cup in IndiaPakistan have pulled out of the upcoming junior Hockey World Cup in India. The International Hockey Federation has revealed that they would announce the replacement soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/therell-be-more-deputy-chief-ministers-tejashwi-yadav-day-after-india-blocs-mukesh-sahani-announcement-2807678-2025-10-24",
      "headline": "There'll be more Deputy Chief Ministers: Tejashwi Yadav says announcement soonRJD leader Tejashwi Yadav said that there will be more Deputy Chief Ministers. His remarks come a day after INDIA bloc's Mukesh Sahani announcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/how-twinkling-watermelon-teaches-gen-z-what-means-truly-hear-your-parents-2807676-2025-10-24",
      "headline": "How Twinkling Watermelon teaches Gen Z what it means to truly hear your parentsIn this week's K-fix, we discuss how, 'Twinkling Watermelon' isn't just a time-travel K-drama, it's a heartfelt story about family, disability and communication. Through Eun-gyeol's journey as a CODA, the show beautifully explores what it really means to love, listen, and be understood.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/air-india-youtuber-mahinergy-threatened-woman-passenger-not-speaking-marathi-mumbai-flight-badtameezi-2807538-2025-10-24",
      "headline": "Speak Marathi in Mumbai or...: Woman threatens YouTuber on Air India flightA YouTuber was threatened by a co-passenger for not speaking Marathi on an Air India flight. The incident has sparked widespread debate on linguistic intolerance and regional chauvinism in Maharashtra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/all-talk-no-action-fssais-sweet-confusion-over-the-orsl-row-dr-sivaranjani-santosh-ors-ban-india-2807709-2025-10-24",
      "headline": "All talk, no action? FSSAI's sweet confusion over the ORSL rowIt began as a public health win, with FSSAI cracking down on misleading \"ORS\" labels. Barely a week later, a stay order and a clarification have sown confusion. Instead of acting decisively, India's food watchdog seems slow to enforce its own rules"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/bollywood-fashion-trends-wedding-season-priyanka-chopra-alia-bhatt-ananya-panday-2806840-2025-10-24",
      "headline": "Diwali fits so good, they belong at the next wedding you attendWe scout five fashion trends from celebrity Diwali looks that you must carry forward into the wedding season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nobody-wants-this-2-review-the-modern-day-therapy-we-didnt-know-we-needed-adam-brody-kristen-bell-2807691-2025-10-24",
      "headline": "Nobody Wants This 2 review: The modern-day therapy we didn't know we neededRelease Date:Thu Oct 23, 2025'Nobody Wants This' on Netflix explores modern love, communication, and family, bringing together heart and relatability in a must-watch series. Season 2 of the hit show premiered on October 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/its-not-hunger-its-just-food-noise-and-heres-how-to-silence-it-overeating-cravings-2807157-2025-10-23",
      "headline": "It's not hunger, it's just food noise and here's how to silence itMany confuse emotional cravings with true hunger leading to overeating. Being mindful about eating and having balanced meals can help manage food urges and support healthy weight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sachin-sanghvi-charged-sexual-harassment-released-bail-investigation-2807758-2025-10-24",
      "headline": "Sachin Sanghvi of Sachin-Jigar duo accused of sexual harassment, released on bailMusician-composer Sachin Sanghvi of the Sachin-Jigar duo has been charged with alleged sexual harassment after a complaint by a 29-year-old. Sanghvi was arrested and later released on bail, with legal proceedings underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharma-farewell-match-joke-gautam-gambhir-viral-video-australia-vs-india-adelaide-odi-2807619-2025-10-24",
      "headline": "Aaj farewell match tha: Rohit Sharma reacts to Gambhir's joke after Adelaide 73AUS vs IND: India coach Gautam Gambhir's playful farewell joke brought a smile to Rohit Sharma after his gritty 73 in Adelaide. The light-hearted moment came amid fan speculation over the 38-year-old's ODI future."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-aaron-kuldeep-yadav-final-odi-india-vs-australia-2807813-2025-10-24",
      "headline": "Play Kuldeep, go with a batter short: Ex-India pacer's advice to Gambhir for 3rd ODI Varun Aaron has asked India to go with a batter short in the third ODI and play Kuldeep Yadav in the game in Sydney. Kuldeep is yet to play a match in the series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-game-time-advice-shreyas-iyer-mohammed-kaif-odi-comeback-australia-2807796-2025-10-24",
      "headline": "Virat Kohli needs to learn from Shreyas Iyer, play India A games to find form: Kaif Mohammed Kaif suggests Virat Kohli needs more game time to regain form after a tough ODI return. Kohli aims to bounce back in the final match against Australia and secure his place ahead of the 2027 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-ashwin-hope-for-runs-in-sydney-odi-final-2807772-2025-10-24",
      "headline": "Hope Virat Kohli scores in Sydney: Ashwin fears blame game if batter fails again India tour of Australia: Virat Kohli has failed to trouble the scorers on his return to international cricket. The former captain will be under immense pressure as India face Australia in the series final in Sydney on Saturday, October 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-kuldeep-yadav-sydney-odi-trump-card-adam-zampa-2807756-2025-10-24",
      "headline": "India keep Kuldeep Yadav in deck as Australia use Adam Zampa as trump card in Adelaide In what was a game of poker in Adelaide, India decided to keep their trump card, Kuldeep Yadav, in the deck while Australia used their ace, Adam Zampa, to get the win. India missed a trick with the spinner, who could have been a mystery for the Aussies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-hockey-team-pull-out-junior-hockey-world-cup-india-2807716-2025-10-24",
      "headline": "After Asia Cup hockey, Pakistan pull out of junior World Cup in India Pakistan have pulled out of the upcoming junior Hockey World Cup in India. The International Hockey Federation has revealed that they would announce the replacement soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-pratika-rawal-balanced-opening-partnership-india-womens-world-cup-semifinals-2807710-2025-10-24",
      "headline": "Calmness and clarity: What makes Smriti Mandhana, Pratika Rawal combination click? Former cricketer Anjum Chopra praises India's opening pair Mandhana and Rawal for their complementary styles. Their partnership played a crucial role in securing India's semifinal spot, raising hopes for a strong knockout performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-pratika-rawal-father-pradeep-rawal-exclusive-century-india-vs-new-zealand-2807705-2025-10-24",
      "headline": "From backyard dreams to World Cup 100: Pradeep Rawal on daughter Pratika's big moment Women's World Cup: India Speaking exclusively to India Today, Pradeep Rawal shared how his daughter Pratika's World Cup century felt like a dream come true. He recalled their countless backyard sessions that laid the foundation for her big moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-t20i-squad-glenn-maxwell-josh-hazlewood-changes-2807692-2025-10-24",
      "headline": "AUS vs IND: Glenn Maxwell returns from injury as Australia revise T20I squad India tour of Australia: All-rounder Glenn Maxwell will return to competitive action for the first time since September. He has been added to the Australian T20I squad for the last three matches of a five-match series, starting October 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ali-khan-tareen-accuses-pcb-mismanagement-intolerance-psl-franchise-dispute-2807617-2025-10-24",
      "headline": "Watch: PSL team owner tears legal notice from Pakistan cricket body in live video Multan Sultans co-owner Ali Khan Tareen has responded to the PCB's legal notice in a viral video, refusing to retract his criticism of PSL management. Tareen accused the board of mismanagement and a lack of openness to dialogue, as tensions rise between the franchise and league organisers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharma-farewell-match-joke-gautam-gambhir-viral-video-australia-vs-india-adelaide-odi-2807619-2025-10-24",
      "headline": "Aaj farewell match tha: Rohit Sharma reacts to Gambhir's joke after Adelaide 73 AUS vs IND: India coach Gautam Gambhir's playful farewell joke brought a smile to Rohit Sharma after his gritty 73 in Adelaide. The light-hearted moment came amid fan speculation over the 38-year-old's ODI future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pratika-rawal-father-pradeep-ind-vs-nz-womens-world-cup-2807539-2025-10-24",
      "headline": "Dad saw the spark at 3, Pratika Rawal lights up the World Cup 22 years later Pratika Rawal etched her name in the history books with her maiden century in the Women's World Cup against New Zealand in Navi Mumbai. After the match, her father, Pradeep Rawal, spoke to IndiaToday.in, recalling his daughter's journey to international cricket and addressing critics of her strike rate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-pratika-rawal-father-pradeep-rawal-exclusive-century-india-vs-new-zealand-2807705-2025-10-24",
      "headline": "From backyard dreams to World Cup 100: Pradeep Rawal on daughter Pratika's big moment Women's World Cup: India Speaking exclusively to India Today, Pradeep Rawal shared how his daughter Pratika's World Cup century felt like a dream come true. He recalled their countless backyard sessions that laid the foundation for her big moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-t20i-squad-glenn-maxwell-josh-hazlewood-changes-2807692-2025-10-24",
      "headline": "AUS vs IND: Glenn Maxwell returns from injury as Australia revise T20I squad India tour of Australia: All-rounder Glenn Maxwell will return to competitive action for the first time since September. He has been added to the Australian T20I squad for the last three matches of a five-match series, starting October 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ali-khan-tareen-accuses-pcb-mismanagement-intolerance-psl-franchise-dispute-2807617-2025-10-24",
      "headline": "Watch: PSL team owner tears legal notice from Pakistan cricket body in live video Multan Sultans co-owner Ali Khan Tareen has responded to the PCB's legal notice in a viral video, refusing to retract his criticism of PSL management. Tareen accused the board of mismanagement and a lack of openness to dialogue, as tensions rise between the franchise and league organisers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharma-farewell-match-joke-gautam-gambhir-viral-video-australia-vs-india-adelaide-odi-2807619-2025-10-24",
      "headline": "Aaj farewell match tha: Rohit Sharma reacts to Gambhir's joke after Adelaide 73 AUS vs IND: India coach Gautam Gambhir's playful farewell joke brought a smile to Rohit Sharma after his gritty 73 in Adelaide. The light-hearted moment came amid fan speculation over the 38-year-old's ODI future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pratika-rawal-father-pradeep-ind-vs-nz-womens-world-cup-2807539-2025-10-24",
      "headline": "Dad saw the spark at 3, Pratika Rawal lights up the World Cup 22 years later Pratika Rawal etched her name in the history books with her maiden century in the Women's World Cup against New Zealand in Navi Mumbai. After the match, her father, Pradeep Rawal, spoke to IndiaToday.in, recalling his daughter's journey to international cricket and addressing critics of her strike rate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-smriti-mandhana-outstanding-sophie-devine-reaction-indw-vz-nzw-2807562-2025-10-24",
      "headline": "Smriti Mandhana is outstanding, glad I don't have to deal with her: Sophie DevineWomen's World Cup: Sophie Devine said she is relieved to retire without facing Smriti Mandhana again, praising the Indian batter's record-breaking form and noting that she will continue to improve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-sophie-devine-farewell-ruined-colombo-rain-ind-vs-nz-2807546-2025-10-24",
      "headline": "How Colombo rain ruined Sophie Devine's farewell Women's World Cup campaignSophie Devine's farewell World Cup ended in frustration as New Zealand fell 53 runs short against India, officially knocking the White Ferns out. Part poor form, part Colombo's merciless rain, the campaign was sabotaged by abandoned matches against Pakistan and Sri Lanka, leaving points shared and hopes dashed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-kuldeep-yadav-3rd-odi-inclusion-parthiv-patel-batting-depth-2807542-2025-10-24",
      "headline": "Kuldeep Yadav a must for 3rd ODI vs AUS, can't keep adding batters: Parthiv PatelFormer India batter Parthiv Patel urges inclusion of Kuldeep Yadav in Sydney ODI. He says India must balance batting with spin options to take crucial wickets and strengthen their middle overs against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-desperate-batting-irfan-pathan-advice-straight-ducks-australia-vs-india-2807529-2025-10-24",
      "headline": "Virat Kohli must not bat desperately for runs vs AUS after 2 ducks: Irfan PathanIrfan Pathan urges Virat Kohli to remain calm after back-to-back ducks in Perth and Adelaide. He advises Kohli not to force runs and to enjoy batting, saying form will return naturally with patience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-pratika-rawal-inner-psychologist-india-vs-new-zealand-century-2807522-2025-10-24",
      "headline": "Pratika Rawal channels inner psychologist to give India fresh hopesWomen's World Cup, IND vs NZ: A student of psychology, Pratika Rawal scored 122 runs against New Zealand on Thursday, helping India secure their place in the semi-finals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-rohit-sharma-ugly-73-adelaide-world-cup-2027-ambitions-2807492-2025-10-24",
      "headline": "Rohit's most un-Rohit 73 in Adelaide is his strongest 2027 World Cup statement yetAUS vs IND, 2nd ODI Rohit Sharma's 73 in Adelaide was far from graceful, yet every run carried purpose. Battling pace, bounce, and scrutiny, he showed resilience and intent, proving that even un-Rohit innings can signal his readiness for the challenges leading to the 2027 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-vs-new-zealand-pratika-rawal-press-conference-richa-ghosh-injury-2807483-2025-10-24",
      "headline": "Centurion Pratika Rawal explains her success mantra, gives update on Richa's injuryWomen's World Cup: After producing a near-perfect game with her all-round performance against New Zealand, India opener Pratika Rawal explained her success mantra while crediting the calm dressing room and support from her parents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-frustrated-rain-impacts-new-zealand-womens-world-cup-exit-india-2807479-2025-10-24",
      "headline": "Bl**dy frustrating: Sophie Devine gutted after New Zealand exit Women's World CupSophie Devine lamented New Zealand's rain-hit Women's World Cup campaign, which ended with a 53-run DLS loss to India, despite strong individual performances from Brooke Halliday and Izzy Gaze. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-pratika-rawal-inner-psychologist-india-vs-new-zealand-century-2807522-2025-10-24",
      "headline": "Pratika Rawal channels inner psychologist to give India fresh hopesWomen's World Cup, IND vs NZ: A student of psychology, Pratika Rawal scored 122 runs against New Zealand on Thursday, helping India secure their place in the semi-finals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-rohit-sharma-ugly-73-adelaide-world-cup-2027-ambitions-2807492-2025-10-24",
      "headline": "Rohit's most un-Rohit 73 in Adelaide is his strongest 2027 World Cup statement yetAUS vs IND, 2nd ODI Rohit Sharma's 73 in Adelaide was far from graceful, yet every run carried purpose. Battling pace, bounce, and scrutiny, he showed resilience and intent, proving that even un-Rohit innings can signal his readiness for the challenges leading to the 2027 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-vs-new-zealand-pratika-rawal-press-conference-richa-ghosh-injury-2807483-2025-10-24",
      "headline": "Centurion Pratika Rawal explains her success mantra, gives update on Richa's injuryWomen's World Cup: After producing a near-perfect game with her all-round performance against New Zealand, India opener Pratika Rawal explained her success mantra while crediting the calm dressing room and support from her parents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-frustrated-rain-impacts-new-zealand-womens-world-cup-exit-india-2807479-2025-10-24",
      "headline": "Bl**dy frustrating: Sophie Devine gutted after New Zealand exit Women's World CupSophie Devine lamented New Zealand's rain-hit Women's World Cup campaign, which ended with a 53-run DLS loss to India, despite strong individual performances from Brooke Halliday and Izzy Gaze. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-vs-new-zealand-harmanpreet-kaur-reaction-2807478-2025-10-24",
      "headline": "Semi-final spot sealed, Harmanpreet Kaur hopes India can iron out bowling flawsWomen's World Cup: Captain Harmanpreet Kaur breathed a sigh of relief as India clinched the fourth spot in the semi-finals with a dominant victory over New Zealand, while noting that the team still had to sharpen its bowling before the knockout rounds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-pratika-rawal-india-win-womens-world-cup-2025-ind-vs-nz-2807476-2025-10-23",
      "headline": "Smriti Mandhana surprised with POTM award vs NZ: Pratika deserved it as much as meSmriti Mandhana said she was surprised to see her win the Player Of The Match award, saying that Pratika Rawal also deserved it as much as her after beating New Zealand. The Indian opening pair setup India's win with their hundreds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-ind-beat-nz-smriti-mandhana-pratika-rawal-2807449-2025-10-23",
      "headline": "Mandhana, Rawal masterclass powers India into semis, blows away New ZealandWomen's World Cup: Smriti Mandhana and Pratika Rawal lit up Navi Mumbai with blistering centuries as India snapped their three-match losing streak and stormed into the semi-finals of the ICC Women's Cricket World Cup 2025 with a commanding 53-run win over New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-reaction-break-red-ball-cricket-workload-management-2807451-2025-10-23",
      "headline": "Shreyas Iyer lifts the lid on his decision to take break from red-ball cricketAustralia vs India: Shreyas Iyer broke his silence on taking a break from red-ball cricket following India's narrow two-wicket defeat to Australia in the second ODI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-inter-miami-contract-extension-2028-mls-freedom-park-2807447-2025-10-23",
      "headline": "Lionel Messi extends Inter Miami stay, signs new contract till 2028Lionel has extended his stay with Inter Miami, signing a new contract with the club until 2028. Messi has led the club from the front since joining them in 2023 and is hoping to play at their new stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-sarfaraz-khan-selection-clarity-bcci-india-cricket-2807415-2025-10-23",
      "headline": "Hope Agarkar, BCCI has informed Sarfaraz Khan why he was dropped: Sunil GavaskarSunil Gavaskar hopes that Sarfaraz Khan got clarity from Chief selector Ajit Agarkar and the rest of the selection committee as to why he is out of the national team setup at the moment. Sarfaraz last played for India during the New Zealand home series in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-west-indies-3rd-odi-report-2-1-series-win-2807424-2025-10-23",
      "headline": "Bangladesh spin their way to 2-1 series win over West IndiesBangladesh spun a web around West Indies, crushing them by 179 runs in the third ODI to claim their first series victory since March last year. A scintillating 176-run opening partnership between Saif Hassan and Soumya Sarkar laid the foundation for Bangladesh's 296 for 8, leaving the visitors reeling as they were bowled out for just 117 in 30.1 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-2nd-odi-shreyas-iyer-press-conference-adelaide-oval-2807419-2025-10-23",
      "headline": "AUS vs IND: Shreyas Iyer admits series loss hurts but praises Australian battersIndia batter Shreyas Iyer admitted that the ODI series loss was painful but heaped praise on Australia's middle-order batters, who anchored their side to a narrow two-wicket victory in the second One-Day International at Adelaide Oval on Thursday. Iyer also noted that Australia's ability to make the most of bowler-friendly conditions helped them take an unassailable 2-0 lead in the series."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}