{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-must-lean-into-ai-to-stay-competitive-hemant-taneja-india-today-ai-summit-2026-2870116-2026-02-18",
      "headline": "India must lean into AI to stay competitive: Hemant TanejaTaneja drew a sharp line between foundational AI research and applied AI. According to him, 2025 was the year AI \"diffusion started,\" with enterprises using AI to boost productivity across departments, from coding to customer support and sales."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/general-catalyst-ceo-hemant-taneja-ai-opportunities-india-today-ai-summit-2026-2870090-2026-02-18",
      "headline": "Businesses won't be competitive if they don't lean into AI: Hemant TanejaSpeaking at the India Today AI Summit 2026, General Catalyst CEO Hemant Taneja described AI as a \"transformative force\" and argued that even if the current moment carries elements of hype, it is laying the groundwork for long-term change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-flat-it-stocks-down-infosys-wipro-tcs-2870067-2026-02-18",
      "headline": "Sensex, Nifty open flat as IT stocks tumble in early trade; Infosys down 2%The S&P BSE Sensex was up 19.33 points to 83,470.29, while the NSE Nifty50 added 12.50 points to 25,737.90 as of 9:41 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/dda-removes-parking-charges-from-flat-prices-mig-hig-karmayogi-awas-yojana-towering-heights-2025-2870058-2026-02-18",
      "headline": "Big relief for homebuyers as DDA removes parking charges from flat pricesThe authority has discontinued the levy of parking charges, including covered parking, in the overall cost of flats. This change is expected to reduce flat prices by Rs 5 lakh to Rs 12 lakh, depending on the category of the flat and the size of the parking space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-interest-rate-fy26-8-25-percent-what-it-means-for-pf-subscribers-2870036-2026-02-18",
      "headline": "EPFO may keep PF interest rate at 8.25% for FY26. What it means for your savingsThe EPFO is also working on creating an interest stabilisation reserve fund. The aim is to provide a stable and consistent interest rate to subscribers, even if markets are volatile. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dnpa-hosts-key-ai-and-journalism-dialogue-at-indiaai-impact-summit-2026-2869708-2026-02-17",
      "headline": "DNPA hosts key AI and journalism dialogue at IndiaAI Impact Summit 2026The session brought together senior leaders from India's most influential news organisations along with global publishing representation to examine how artificial intelligence is transforming journalism, and how India must shape that transformation responsibly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/draft-income-tax-rules-2026-could-change-your-tax-forms-what-it-means-for-you-2869689-2026-02-17",
      "headline": "Draft income tax rules 2026 could change your tax forms: What it means for you?Under the draft new law, statutory forms such as Form 26AS, Form 16 and Form 13 will be issued with new numbers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-close-higher-it-psu-bank-rally-infosys-anthropic-reliance-fall-2869668-2026-02-17",
      "headline": "Sensex, Nifty close higher as IT and PSU banking stocks rally; Infosys up 2%The IT sector played a key role in lifting the markets. The Nifty IT index, which is the second-heaviest sector on the benchmarks, climbed 1%. Shares of Infosys rose 1.9% after the company announced a partnership with US-based artificial intelligence firm Anthropic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/are-millennials-and-gen-z-behind-90-95-of-indias-home-purchases-2869594-2026-02-17",
      "headline": "Are millennials and Gen Z behind 90–95% of India's home purchases?For many borrowers under 40, applying for a home loan online is no longer optional, it is the preferred way. Around 72% of borrowers in this age group choose digital applications, and nearly half of borrowers above 60 are also getting comfortable with online processes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hal-bel-bharat-forge-bel-cochin-shipyard-defence-stocks-comeback-2869577-2026-02-17",
      "headline": "Cochin Shipyard, HAL, BEL: Are defence stocks set for a strong comeback?The defence theme is back on screens. Now it needs breadth, sustained volumes and follow-through to turn early strength into a lasting rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-announces-100-billion-to-build-ai-ready-green-data-centres-by-2035-2869553-2026-02-17",
      "headline": "Adani Group announces $100 billion to build AI-ready, green data centres by 2035The $100 billion direct investment is expected to catalyse an additional $150 billion across related sectors over the next decade. These include server manufacturing, advanced electrical infrastructure, sovereign cloud platforms, and semiconductor and compute ecosystems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/star-health-denies-lucknow-man-viral-allegation-mother-claim-rejection-pre-existing-condition-2869523-2026-02-17",
      "headline": "Star Health rejects Lucknow man's viral allegation over mother's claim rejectionIn a post, the man said he had been paying around Rs 50,000 every year as premium for his mother's health insurance policy. When she fell ill, he went to the Lucknow office of Star Health and Allied Insurance to seek claim support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-drops-over-rs-2500-silver-falls-rs-6000-are-bigger-price-cuts-on-the-way-2869510-2026-02-17",
      "headline": "Gold drops over Rs 2,500, silver falls Rs 6,000: Are bigger price cuts on the way?Gold and silver have taken a sharp hit, shaking confidence after weeks of strong gains. As volatility rises, investors are trying to understand whether this decline signals a larger trend shift."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/changed-your-salary-account-heres-what-happens-to-your-pf-withdrawals-now-2869486-2026-02-17",
      "headline": "Changed your salary account? Here's what happens to your PF withdrawals nowUpdating your account when there is no urgency is far easier than scrambling to fix it when you need funds quickly. Think of it as preventive maintenance for your finances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-tcs-hcltech-share-price-up-why-it-stocks-are-rising-today-anthropic-ai-deal-nifty-it-rebound-2869458-2026-02-17",
      "headline": "Infosys, TCS, HCLTech gain up to 3%: Why are IT stocks rising today?The main trigger for the rally was Infosys announcing a strategic partnership with artificial intelligence firm Anthropic. Investors reacted positively to the news, pushing Infosys shares nearly 3% higher to around Rs 1,407 during the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-anthropic-artificial-intelligence-ai-technology-complex-industry-advance-partnership-india-ai-2869430-2026-02-17",
      "headline": "Infosys shares jump 3% today after announcing partnership with AnthropicThis new partnership will help companies in tough, rule-heavy sectors use AI better, and improve efficiency in providing essential services to the public."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-it-rally-shares-up-2869428-2026-02-17",
      "headline": "Sensex, Nifty open lower but IT stocks rallyThe S&P BSE added 42.49 points to 83,319.64, while the NSE Nifty50 lost 17.05 points to 25,665.70 as of 10:10 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/global-tech-giants-lose-billions-ai-spending-concerns-microsoft-amazon-nvidia-2026-2869408-2026-02-17",
      "headline": "Global tech giants see billions erased amid rising AI cost concernsInvestors who once rewarded bold AI plans are now asking tougher questions about spending, profits and competition. Several of the largest US technology firms have lost hundreds of billions of dollars in market value since the start of 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-advances-with-focus-on-finalising-legal-agreement-2869135-2026-02-16",
      "headline": "India–US trade deal advances with focus on finalising legal agreementSpeaking on the development, Commerce Secretary Rajesh Agrawal said a joint statement outlining the contours of the agreement has already been signed. He said that these contours now need to be converted into a formal legal agreement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/record-msp-procurement-how-many-farmers-are-actually-benefiting-2869087-2026-02-16",
      "headline": "Record MSP procurement: How many farmers are actually benefiting?India's MSP system is clearly expanding, with higher spending, larger procurement and more beneficiaries than before. Yet the debate has shifted from scale to security."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/muay-thai-training-actor-babil-khan-speculation-new-role-fitness-journey-2870113-2026-02-18",
      "headline": "Babil Khan trains in Muay Thai in Thailand Actor Babil Khan's recent Muay Thai training in Thailand has sparked speculation about a possible new role, though he has not confirmed any project. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajpal-yadav-cheque-bounce-case-lender-says-he-cried-for-repayment-calls-it-loan-not-investment-2870115-2026-02-18",
      "headline": "Rajpal Yadav case: Lender says he cried for repayment; calls it loan, not investment Businessman Madhav Gopal Agrawal opened up about his financial dispute with Rajpal Yadav, claiming the money given for the actor's directorial debut was a loan, not an investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sivakarthikeyan-41st-birthday-celebration-family-friends-tamil-film-seyon-2870076-2026-02-18",
      "headline": "Inside Sivakarthikeyan's 41st birthday celebration with family and friends Tamil actor Sivakarthikeyan celebrated his 41st birthday with family and friends in Chennai. Videos from the birthday bash have been widely circulated on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/shia-labeouf-arrested-mardi-gras-fight-new-orleans-2870089-2026-02-18",
      "headline": "Actor Shia LaBeouf arrested after alleged Mardi Gras fight in New Orleans Actor Shia LaBeouf was arrested after allegedly assaulting two men during Mardi Gras celebrations in New Orleans. The incident adds to his history of legal troubles and public controversies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/miley-cyrus-announces-homecoming-as-hannah-montana-returns-in-march-2870081-2026-02-18",
      "headline": "Miley Cyrus announces homecoming as Hannah Montana returns in March Miley Cyrus is set to celebrate 20 years of Hannah Montana with a special premiere this March on Disney+. The anniversary event will feature a live conversation, recreated sets and unseen archival footage from the iconic series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/goat-review-animated-sports-drama-female-underdog-story-inspires-2870065-2026-02-18",
      "headline": "GOAT review: This heartfelt animated sports drama works as much for kids as adultsRelease Date:Fri Feb 20, 2026 GOAT movie review: Animated film GOAT tells the inspiring story of a young goat chasing his sports dreams. The film explores themes of resilience, community, and breaking gender norms in a vibrant fantasy world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/o-romeo-box-office-collection-day-5-detailed-report-shahid-kapoor-film-steady-nears-rs-50-crore-2870061-2026-02-18",
      "headline": "O' Romeo box office Day 5: Shahid Kapoor's film steady, nears Rs 50 crore Vishal Bhardwaj's O' Romeo, starring Shahid Kapoor and Triptii Dimri, continued a steady box office run after a decent opening weekend. Here's the day-wise breakup and how it compares to Shahid's recent releases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-speaks-out-on-health-scare-sensory-loss-that-paused-his-career-in-2025-2870047-2026-02-18",
      "headline": "Mammootty speaks out on health scare, sensory loss that paused his career in 2025 Malayalam actor Mammootty has revealed that he lost his sense of smell and taste during a health issue in 2025, sharing details of his experience and recovery process. He has since returned to acting, resuming work on major film projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kunal-nayyar-says-wealth-is-grace-as-he-donates-anonymously-to-medical-fundraisers-2870052-2026-02-18",
      "headline": "The Big Bang Theory star Kunal Nayyar's old interview on money and grace goes viral Kunal Nayyar revealed that he secretly donates to families' medical fundraisers on GoFundMe, saying wealth gives him the freedom to change lives. An old interview of the actor discussing money, kindness and personal responsibility is now going viral on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ssunita-ahuja-says-ongoing-cheating-rumours-add-stress-during-her-menopause-phase-2870032-2026-02-18",
      "headline": "Ssunita Ahuja says ongoing cheating rumours add stress during her menopause phase Ssunita Ahuja said she does not want to deal with added stress at this stage of her life, especially while going through menopause, as she addressed rumours about her marriage. She added that forgiveness is possible, but only if she feels heard and supported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salim-khan-hospitalised-mumbai-sanjay-dutt-salman-khan-visit-icu-lilavati-2870025-2026-02-18",
      "headline": "Sanjay Dutt visits Salim Khan at Mumbai hospital, extends support to family Actor Sanjay Dutt was seen visiting Salim Khan, admitted to Lilavati Hospital's ICU in Mumbai, where Salman Khan and family have also assembled amid concerns for the veteran screenwriter's health."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kohrra-2-barun-sobti-mona-singh-series-expose-social-faultlines-2869008-2026-02-18",
      "headline": "Kohrra 2: Barun Sobti and Mona Singh's series exposes several social faultlines Plot-wise, Kohrra Season 2 is a thriller that explores bonded labour. However, the gritty screenplay of the show, starring Mona Singh and Barun Sobti, is a sharp commentary on several other societal ills. Read to know more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/trisha-condemns-bjp-chiefs-sexist-remark-weaponising-women-tamil-nadu-politics-2869635-2026-02-18",
      "headline": "Trisha's stand in Vijay row is a refusal to be patriarchy's political weapon When Tamil Nadu BJP chief Nainar Nagendran invoked Trisha's name in a bid to discredit Vijay, he inadvertently sparked a larger conversation about women's agency in public discourse. Her swift and dignified response drew a firm line between political rivalry and personal dignity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anil-kapoor-credits-wife-sunita-for-inspiring-subedaar-2870005-2026-02-18",
      "headline": "Anil Kapoor credits wife Sunita for inspiring Subedaar: I dug into my relationship Actor Anil Kapoor shared that he drew inspiration from his marriage with Sunita Kapoor to portray the emotional conflict in Subedaar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ethan-hawke-on-actors-speaking-out-politically-last-place-you-probably-want-advice-2870002-2026-02-18",
      "headline": "Ethan Hawke says he's all for anything that fights fascism at Berlin film festival At the Berlin Film Festival, Ethan Hawke reflected on whether actors should speak on politics, saying celebrities aren't spiritual guides but cinema has the power to shape collective consciousness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angela-bassett-urges-hollywood-industry-to-choose-courage-over-comfort-2870001-2026-02-18",
      "headline": "Angela Bassett urges Hollywood to choose courage over comfort: Be brave Honoured with the Excellence in the Arts award at the 9th Annual ABFF Honors, actor Angela Bassett delivered a stirring speech about resilience, representation and the responsibility of those in power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pravina-deshpande-dies-veteran-actor-hindi-marathi-cinema-legacy-2869955-2026-02-18",
      "headline": "Pravina Deshpande, Salman Khan's co-actor in Ready, dies at 60 Actor Pravina Deshpande, known for her work in Hindi and Marathi cinema and television, died on February 17, 2026. Her death was confirmed by her family on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neena-gupta-on-marrying-husband-vivek-mehra-2869947-2026-02-17",
      "headline": "Did it out of compulsion: Neena Gupta on marrying Vivek Mehra Actor Neena Gupta shared in what way societal pressure shaped her decision to marry Vivek Mehra, and has a surprising take on love. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-father-sunil-malhotra-passes-away-delhi-family-mourns-loss-2869885-2026-02-17",
      "headline": "Sidharth Malhotra's father dies in Delhi after prolonged illness, actor shares post Actor Sidharth Malhotra's father, Sunil Malhotra, died in Delhi on Saturday, February 14, following a prolonged illness. He was surrounded by family at the time of his death."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/galgotias-university-asked-to-vacate-india-ai-summit-after-china-made-robodog-fiasco-sources-2870105-2026-02-18",
      "headline": "Galgotias University asked to vacate AI Summit after Chinese robodog fiascoGalgotias University, located in Noida, was directed to pull out of the AI Summit after facing massive backlash on social media over the robodog row. Even its statement that it never claimed to have built the device was fact-checked on X."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/what-happend-happened-indore-man-smiles-when-asked-motive-for-girlfriend-murder-2870066-2026-02-18",
      "headline": "What happened, happened: Indore man smiles when asked motive for girlfriend's murderDays after allegedly strangling his 24-year-old girlfriend and violating her body, accused Piyush Dhamnotia showed no remorse. Smiling, he told India Today, \"What had to happen has happened,\" and declined to explain further as police escorted him from a station in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sikandar-raza-zimbabwe-t20-world-cup-2026-super-8-redemption-story-2870059-2026-02-18",
      "headline": "Muqaddar ka Sikandar: How Raza turned heartbreak into happiness for ZimbabweT20 World Cup: Zimbabwe missed out on qualifying for the tournament in 2024, but this time around, Sikandar Raza's men have secured their berth in the Super 8. It was Raza, with his inspirational leadership and attitude, aims to keep his side grounded and continue their journey towards bigger goals at the T20 World Cup 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/general-catalyst-ceo-hemant-taneja-ai-opportunities-india-today-ai-summit-2026-2870090-2026-02-18",
      "headline": "Businesses won't be competitive if they don't lean into AI: Hemant TanejaSpeaking at the India Today AI Summit 2026, General Catalyst CEO Hemant Taneja described AI as a \"transformative force\" and argued that even if the current moment carries elements of hype, it is laying the groundwork for long-term change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/metallica-nothing-else-matters-uttar-pradesh-akhilesh-yadav-samajwadi-party-sp-chief-reel-amuses-puzzles-metalheads-2869641-2026-02-18",
      "headline": "Akhilesh uses Metallica to boast of metalled highway, Reel baffles metalheadsSP chief Akhilesh Yadav's use of Metallica's Nothing Else Matters to counter Chief Minister Yogi Adityanath's development pitch amused many on the internet. Did the soundtrack carry an optics, or was it just a random choice for an Instagram Reel by Akhilesh, whose musical taste inclines toward rock and metal?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-namibia-t20-world-cup-2026-must-win-clash-colombo-2870028-2026-02-18",
      "headline": "PAK vs NAM weather forecast: Will Pakistan suffer Australia's fate?Pakistan takes on Namibia in a crucial Group A fixture at the Sinhalese Sports Club in Colombo, needing a win to stay alive in the T20 World Cup 2026. But will the weather play spoilsport during the contest?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/anthropic-launches-claude-sonnet-46-says-it-is-best-at-coding-and-reasoning-2870071-2026-02-18",
      "headline": "Anthropic launches Claude Sonnet 4.6, says it is best at coding and reasoningAnthropic has introduced Claude Sonnet 4.6, saying it is its most powerful model yet for coding, reasoning and handling large volumes of data. The model is now available as the default option for users of its Claude chatbot and the Claude Cowork platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ca-husband-kills-pregnant-bank-manager-wife-stages-robbery-valentines-day-affair-suspicion-haryana-2870023-2026-02-18",
      "headline": "Man kills pregnant wife after celebrating Valentine's Day over affair suspicionThe victim, Mehak, a bank manager from Haryana, who had been married for four months, was found dead near a canal after the accused called Dial 112 claiming unidentified men had attacked them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/punjab-bride-showered-with-rs-85-crore-at-wedding-groom-family-denies-claim-tarn-taran-video-2870100-2026-02-18",
      "headline": "Punjab bride showered with Rs 8.5 crore at wedding? Groom's family denies claimA video from the ceremony in Tarn Taran, which has gone viral, shows the bride standing at the venue as currency notes are showered on her - a customary gesture at many Punjabi weddings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/delhi-ncr-rain-western-disturbances-hot-winter-showers-noida-gurgaon-cold-morning-sudden-rain-weather-pattern-2870060-2026-02-18",
      "headline": "Delhi rain: Where did it come from?The IMD issued a yellow alert for the day, forecasting very light to light rainfall accompanied by isolated thunderstorms, lightning, and gusty winds reaching 30–40 kmph, particularly during the forenoon and afternoon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/akhilesh-yadav-ai-impact-summit-traffic-jams-issues-delhi-bjp-centre-attack-2870082-2026-02-18",
      "headline": "If AI managed summit instead of BJP...: Akhilesh Yadav slams 'mismanagement'SP chief Akhilesh Yadav slammed the Centre over what he termed \"mismanagement\" of the India AI Impact Summit in Delhi, alleging that the event had caused widespread chaos, particularly for children, who were stuck in traffic jams despite their board exams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/galgotias-university-clarifies-chinese-robodog-controversy-ai-summit-delhi-learning-students-2870006-2026-02-18",
      "headline": "Galgotias under fire for displaying Chinese robodog as own at AI Summit, clarifiesGalgotias University has addressed online criticism over claims of developing and showcasing a Chinese-made robotic dog as its own at the India AI Impact Summit in Delhi, clarifying it never claimed to have developed the technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/goat-review-animated-sports-drama-female-underdog-story-inspires-2870065-2026-02-18",
      "headline": "GOAT review: This heartfelt animated sports drama works as much for kids as adultsRelease Date:Fri Feb 20, 2026GOAT movie review: Animated film GOAT tells the inspiring story of a young goat chasing his sports dreams. The film explores themes of resilience, community, and breaking gender norms in a vibrant fantasy world."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-teen-driver-suv-crash-biker-killed-dead-ran-over-dwarka-accused-father-grief-apologises-forgiveness-shock-sahil-dhaneshra-2869913-2026-02-17",
      "headline": "Grave mistake, very, very sorry: Father of Delhi teen who drove SUV over bikerThe father of the teen driver, whose SUV ran over a 23-year-old biker in Delhi's Dwarka on February 3, apologised for the incident and said their family is in deep shock in the aftermath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ceos-of-chanel-alphabet-adobe-all-indian-emmanuel-macron-big-praise-for-india-2870041-2026-02-18",
      "headline": "CEOs of Chanel, Alphabet, Adobe all Indian: Macron's big praise for IndiaEmmanuel Macron praised India's rising global influence in innovation at the India–France Innovation Forum in Mumbai, citing Indian-origin CEOs at IBM and Microsoft. He also noted that Chanel's CEO is from Kolhapur, Maharashtra, where he was delivering his address."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/magistrate-18-monitoring-staff-12-policemen-posted-for-single-board-examinee-in-jharkhand-2870063-2026-02-18",
      "headline": "Magistrate, 18 supervisors, 12 cops deployed for lone Jharkhand board candidateThe student, Shankar Kumar Singh, who had opted for Music, appeared at an examination centre under CCTV surveillance, with a magistrate, 18 monitoring personnel and 12 police personnel on duty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/ai-job-insecurity-among-indian-millennials-rises-amid-automation-2870103-2026-02-18",
      "headline": "The disposable worker syndrome: Why 'millennials' fear becoming replaceableMillennials in India are increasingly anxious about AI replacing their jobs. It's not about layoffs. It's about relevance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/trisha-condemns-bjp-chiefs-sexist-remark-weaponising-women-tamil-nadu-politics-2869635-2026-02-18",
      "headline": "Trisha's stand in Vijay row is a refusal to be patriarchy's political weaponWhen Tamil Nadu BJP chief Nainar Nagendran invoked Trisha's name in a bid to discredit Vijay, he inadvertently sparked a larger conversation about women's agency in public discourse. Her swift and dignified response drew a firm line between political rivalry and personal dignity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ai-startup-neosapien-founder-wearables-stolen-ai-summit-high-security-zone-delhi-police-files-case-2869887-2026-02-17",
      "headline": "Lost and found in 24 hours: Startup devices stolen from AI Summit recoveredA Bengaluru-based AI startup founder alleged that the company's wearable devices were stolen when exhibitors were asked to vacate their stalls ahead of the PM's visit. The stolen devices were recovered on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/india-today-ai-summit-kicks-off-today-promises-thought-provoking-discussions-from-global-ai-leaders-2870010-2026-02-18",
      "headline": "India Today AI Summit kicks off todayOn the sidelines of the AI Impact Summit in Delhi, India Today Group is hosting the AI Summit 2026. The day-long summit will see thought-provoking and captivating discussions from global AI leaders on a diverse set of AI-related issues and aspects. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/watch-satellite-captures-annular-solar-eclipse-turns-antarctic-day-into-night-2870112-2026-02-18",
      "headline": "Watch: Satellite captures annular solar eclipse darkening AntarcticaThe \"ring of fire\" eclipse occurred as the moon passed centrally in front of the sun, blocking 96% of its disk and creating a glowing annulus visible solely over remote Antarctic ice sheets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/google-pixel-10a-full-specs-leaked-ahead-of-pre-orders-here-is-what-you-need-to-know-2869756-2026-02-17",
      "headline": "Google Pixel 10a full specs leaked ahead of pre-orders, here is what you need to knowGoogle is gearing to launch the Pixel 10a on February 18. But ahead of pre-orders, a leak has revealed details about the smartphone's key specs. Here's what we know so far.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tarique-rahman-takes-oath-as-bangladesh-pm-but-is-muhammad-yunus-real-winner-will-history-be-kind-explainer-2869334-2026-02-17",
      "headline": "Tarique Rahman becomes PM, but is Yunus the real winner in Bangladesh?As BNP's Tarique Rahman takes oath today, Muhammad Yunus has emerged as the biggest winner in Bangladesh. He pulled off most things he set out to do in the last 18 months and conducted an election by barring his bete noire, Sheikh Hasina's Awami League, from it. How did an 85-year-old Yunus manage to get things done his way?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-ravi-river-shahpur-kandi-dam-water-flow-indus-treaty-2869727-2026-02-17",
      "headline": "India to turn off Ravi water tap for Pakistan ahead of summerWater woes for Pakistan are unlikely to end soon. Ahead of a harsh summer, India is now set to block surplus water flow from the Ravi River to Pakistan with the completion of the Shahpur Kandi barrage. How will it impact Pakistan? Read on to find out."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-india-boycott-u-turn-naqvi-dissanayake-t20-world-cup-2870101-2026-02-18",
      "headline": "Mohsin Naqvi names real hero behind Pakistan's India match boycott U-turn T20 World Cup: Mohsin Naqvi said that the actual hero behind Pakistan's India match boycott U-turn was Sri Lanka president Anura Kumara Dissanayake and thanked him for his timely intervention. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sikandar-raza-zimbabwe-t20-world-cup-2026-super-8-redemption-story-2870059-2026-02-18",
      "headline": "Muqaddar ka Sikandar: How Raza turned heartbreak into happiness for Zimbabwe T20 World Cup: Zimbabwe missed out on qualifying for the tournament in 2024, but this time around, Sikandar Raza's men have secured their berth in the Super 8. It was Raza, with his inspirational leadership and attitude, aims to keep his side grounded and continue their journey towards bigger goals at the T20 World Cup 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-namibia-t20-world-cup-2026-must-win-clash-colombo-2870028-2026-02-18",
      "headline": "PAK vs NAM weather forecast: Will Pakistan suffer Australia's fate? Pakistan takes on Namibia in a crucial Group A fixture at the Sinhalese Sports Club in Colombo, needing a win to stay alive in the T20 World Cup 2026. But will the weather play spoilsport during the contest?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-biopic-inspired-usman-tariq-pakistan-t20-world-cup-comeback-2870024-2026-02-18",
      "headline": "How Dhoni's Biopic sparked Usman Tariq's stunning cricket comeback T20 World Cup: Pakistan's Usman Tariq credited MS Dhoni's biopic for inspiring him to make a comeback in cricket and make his bow in the ongoing T20 World Cup 2026. Tariq has been one of Pakistan's main bowlers during the competition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-netherlands-t20-world-cup-preview-ahmedabad-pitch-report-predicted-playing-xi-2869857-2026-02-18",
      "headline": "IND vs NED: India look to enter Super Eight with a perfect group stage record T20 World Cup, India vs Netherlands: Already through to the Super Eights, India will look to extend their unbeaten run and cap off their group-stage campaign on a high when they take on the Netherlands at the Narendra Modi Stadium in Ahmedabad on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-vs-namibia-preview-pitch-report-predicted-xi-2869990-2026-02-18",
      "headline": "Bruised Pakistan hope to avoid Namibian nightmare in must-win game T20 World Cup: Pakistan play their final group-stage game in the T20 World Cup against Namibia. A loss in this match will mean that Pakistan will get knocked out of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/usman-tariq-press-conference-pakistan-vs-namibia-t20-world-cup-2869989-2026-02-18",
      "headline": "No panic in Pakistan camp: Usman Tariq on pressure before must-win Namibia clash T20 World Cup 2026, PAK vs NAM: Speaking to the reporters before Pakistan's must-win clash against Namibia, Usman Tariq opened up on the atmosphere inside the dressing room following the 61-run defeat to India on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usman-tariq-babar-azam-shaheen-afridi-pakistan-press-conference-t20-world-cup-2869987-2026-02-18",
      "headline": "Babar Azam, Shaheen Afridi under pressure after India debacle? Usman Tariq opens up T20 World Cup, PAK vs NAM: Usman Tariq has backed Shaheen Shah Afridi and Babar Azam to bounce back following their disappointing performance against India, which saw Pakistan suffer a 61-run defeat at the R. Premadasa Stadium in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-t20-world-cup-win-scotland-dipendra-airee-mumbai-2869974-2026-02-17",
      "headline": "Nepal end 4352-day long wait to finish T20 World Cup campaign on a high T20 World Cup, SCO vs NEP: Rohit Paudel's Nepal finished their campaign on a positive note after beating Nepal by seven wickets on Tuesday at the Wankhede Stadium in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-india-australia-t20-world-cup-kaif-comments-2869954-2026-02-17",
      "headline": "India would have beaten Australia had Hardik Pandya played World Cup 2023 final: Kaif T20 World Cup: Mohammad Kaif said that Hardik Pandya would have made the difference for India against Australia had he played in the 2023 ODI World Cup. On Tuesday, the Aussies were eliminated at the group stage of the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/imran-khan-jail-sourav-ganguly-gavaskar-kapil-letter-2869934-2026-02-17",
      "headline": "Hope Imran Khan gets the right treatment: Sourav GangulyFormer India captain Sourav Ganguly backed the letter signed by 14 former captains to the Pakistan government, seeking fair treatment for Imran Khan. Ganguly said that Imran put Pakistan on the world map and deserved to be treated well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-rajasthan-royals-indemnity-waiver-jaipur-stadium-safety-concerns-2869875-2026-02-17",
      "headline": "Royals seek waiver from state govt to host IPL in Jaipur after safety concernsRajasthan Royals are racing to get their home ground ready for the Indian Premier League and have sought an indemnity waiver from the state government to host matches in Jaipur. The request follows concerns over the venue's readiness raised by an independent auditor and the Board of Control for Cricket in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-ind-vs-ned-sitanshu-kotak-press-conference-2869879-2026-02-17",
      "headline": "No need to overanalyse Abhishek Sharma's duck against Pakistan: Sitanshu KotakT20 World Cup, IND vs NED: India batting coach Sitanshu Kotak said that there was no need to overanalyse Abhishek Sharma's form in the tournament. Abhishek came back into the line-up after recovering from illness, but got out for a duck against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-semi-final-karnataka-vs-uttarakhand-devdutt-padikkal-2869863-2026-02-17",
      "headline": "Devdutt Padikkal charges towards India spot as Karnataka inch closer to Ranji finalDevdutt Padikkal scored a career-best 232 to help Karnataka to a mammoth total in the Ranji Trophy semi-finals. Should Indian selectors consider him for the No.3 Test spot?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-netherlands-t20-world-cup-predicted-xi-arshdeep-singh-2869865-2026-02-17",
      "headline": "IND vs NED Predicted XI: Will Arshdeep Singh replace Kuldeep Yadav?T20 World Cup, IND vs NED: Suryakumar Yadav's India have qualified for the Super 8 and are favourites to finish at the top of their group. One potential change could be bringing Arshdeep Singh back in place of Kuldeep Yadav."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-plan-to-host-one-bbl-game-in-india-tnca-confirms-discussions-2869853-2026-02-17",
      "headline": "Cricket Australia plan to host one BBL game in India, TNCA confirms discussionsCricket Australia is exploring the possibility of staging a Big Bash League match in India next season as part of a broader strategy to tap into the country's vast and lucrative cricket market, according to a report by Sen Cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-netherlands-press-conference-bumrah-abhishek-2869822-2026-02-17",
      "headline": "No rest for Bumrah: India want valuable Ahmedabad experience before Super 8T20 World Cup: India will not be resting Jasprit Bumrah and Abhishek Sharma in their match against the Netherlands, said batting coach Sitanshu Kotak. India are playing their last group-stage game in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/icc-t20-world-cup-india-vs-netherlands-captain-scott-edwards-pre-match-press-conference-2869814-2026-02-17",
      "headline": "Netherlands urge more bilateral cricket for associates after strong T20 WC showNetherlands captain Scott Edwards said that a string of impressive performances from associate nations in the T20 World Cup should pave the way for more bilateral cricket against Test-playing countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-jammu-and-kashmir-near-maiden-final-auqib-nabi-2869777-2026-02-17",
      "headline": "Auqib Nabi outshines Bengal's Mohammed Shami as J&K close in on maiden finalAuqib Nabi claimed a nine-wicket match haul to outshine Mohammed Shami and push Jammu and Kashmir to the brink of a maiden Ranji Trophy final after Bengal were bowled out for 99 on day three."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sikandar-raza-zimbabwe-super-8-icc-t20-world-cup-fans-2869775-2026-02-17",
      "headline": "Sikandar Raza revels in emotional celebration with fans after Zimbabwe's Super 8 berthT20 World Cup, IRE vs ZIM: Sikandar Raza and his Zimbabwean teammates celebrated with passionate fans after securing a Super 8 spot. Following the match, Raza thanked the supporters and pledged to keep Zimbabwe's flag flying high."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-scotland-vs-nepal-live-score-today-match-update-mumbai-2869742-2026-02-17",
      "headline": "Scotland vs Nepal Highlights T20 World Cup 2026 updates from MumbaiScotland (SCO) vs Nepal (NEP) Highlights, T20 World Cup: Nepal beat Scotland by 7 wickets after chasing down 171 with three balls to spare at the Wankhede Stadium in Mumbai. Dipendra Singh Airee made an unbeaten 50 off 23 balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-australia-crash-out-zimbabwe-super-8-stage-washout-pallekele-2869716-2026-02-17",
      "headline": "Australia out, Zimbabwe reach Super 8 stage after Pallekele washoutT20 World Cup, IRE vs ZIM: Australia have been knocked out of the competition after the clash between Ireland and Zimbabwe in Pallekele on Tuesday was abandoned due to rain. The abandoned fixture sealed Zimbabwe's qualification for the Super 8 stage alongside Sri Lanka from Group B."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-world-cup-moved-out-of-india-in-future-2869698-2026-02-17",
      "headline": "IND-PAK conflict could force future World Cup out of India: ReportT20 World Cup: The geopolitical conflict between India and Pakistan might force future ICC tournaments outside the subcontinent, Australian media reported on February 16. As per the report, Australia could be the favoured destination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/lone-female-on-grid-f1-aspirant-atiqa-mir-climbs-higher-on-wsk-ladder-2869597-2026-02-17",
      "headline": "Lone female on grid,  F1 aspirant Atiqa Mir climbs higher on WSK ladderIndian racing prodigy Atiqa has shown skill and maturity beyond her years after making a voluntary switch from the Mini to the far more demanding Junior category, producing standout performances in the early part of her 2026 international karting season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ireland-vs-zimbabwe-t20-world-cup-live-score-today-match-updates-pallekele-2869592-2026-02-17",
      "headline": "IRE vs ZIM highlights : Australia out, Zimbabwe reach Super 8 after washoutIreland (IRE) vs Zimbabwe (ZIM) Highlights, T20 World Cup: The Group clash between Ireland cricket team and Zimbabwe cricket team in Pallekele was washed out due to heavy rain. The shared point confirmed Zimbabwe's place in the Super 8 and knocked out Ireland and 2021 champions Australia national cricket team from the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-canada-t20-world-cup-match-report-glenn-phillips-yuvraj-samra-chennai-2869589-2026-02-17",
      "headline": "New Zealand storm into Super 8s, knock Afghanistan out of T20 World CupT20 World Cup: New Zealand stormed into the Super 8s with an eight-wicket win over Canada in Chennai. Glen Phillips and Rachin Ravindra's chase ended Afghanistan's campaign despite Yuvraj Samra's record-breaking century."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pratika-rawal-returns-india-odi-squad-ankle-injury-recovery-australia-series-2869570-2026-02-17",
      "headline": "Pratika Rawal added to ODI squad for Australia tour after long injury lay offStar batter Pratika Rawal has been added to India's ODI squad after recovering from an ankle injury. India are set to take on Australia in a three-match ODI series beginning on February 24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/imran-khan-pakistan-government-humane-treatment-custody-kapil-sunil-14-captains-2869563-2026-02-17",
      "headline": "Treat Imran Khan fairly: Kapil, Gavaskar join 14 captains in appeal to Pak govtFormer India captains Kapil Dev and Sunil Gavaskar have joined a rare global cricketing appeal seeking better treatment for Imran Khan, the former Pakistan Prime Minister and 1992 World Cup-winning captain, who remains in jail amid growing health concerns.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hardik-singh-india-captain-fih-pro-league-hobart-leg-2869539-2026-02-17",
      "headline": "FIH Pro League: Hardik Singh to lead India in Hobart leg; Harmanpreet ruled outMidfielder Hardik Singh was named captain of the embattled Indian men's hockey team for its FIH Pro League matches in Hobart from February 20 to 25 after regular skipper Harmanpreet Singh opted out due to \"personal reasons.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/canada-yuvraj-samra-youngest-men-t20-world-cup-centurion-2869524-2026-02-17",
      "headline": "Canada's Yuvraj Samra becomes youngest centurion in T20 World Cup historyCanada opener Yuvraj Samra became the youngest centurion in men's T20 World Cup history during Canada's clash against New Zealand at the M. A. Chidambaram Stadium."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}