{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/nps-pensioners-to-get-more-benefits-under-unified-pension-scheme-ups-details-here-2734290-2025-06-02",
      "headline": "NPS pensioners to get more benefits under Unified Pension Scheme. Details hereEligible NPS retirees can either get a one-time payment based on their last drawn Basic Pay and Dearness Allowance (DA) for every six months of service, or receive a monthly top-up if their current pension is less than what they'd get under UPS with Dearness Relief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/leela-hotels-listing-opening-share-price-discount-7-percent-nse-bse-market-debut-2734250-2025-06-02",
      "headline": "Leela Hotels share price: Stock lists at 7% discount on Dalal StreetThe company's stock opened at Rs 406 on the NSE, which is Rs 29 below the issue price of Rs 435. On the BSE, it opened slightly higher at Rs 406.50, still lower by Rs 28.50, or about 6.55%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-today-why-is-sensex-and-nifty-falling-gdp-growth-global-cues-us-china-2734224-2025-06-02",
      "headline": "Sensex tumbles 700 points. Why is stock market falling despite strong GDP growth?The BSE Sensex was down 732.71 points to 80,718.30 around 9:25 am, while the NSE Nifty50 traded 197.45 points lower at 24,553.25. Most of the broader market indices also fell sharply amid a surge in volatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/leela-hotels-aegis-vopak-terminals-listing-market-debut-which-ipo-better-check-gmp-today-2734216-2025-06-02",
      "headline": "Leela Hotels vs Aegis Vopak listing: Which IPO will make stronger market debut?Leela Hotels and Aegis Vopak had their initial public offerings (IPOs) open for subscription from May 26 to May 28. While both IPOs were fully subscribed, they did not see very high demand during the bidding period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-fall-opening-bell-sensex-opens-587-points-lower-nifty-below-24600-ril-down-2-percent-it-stocks-2734212-2025-06-02",
      "headline": "Sensex, Nifty open lower as IT, metal stocks drag market despite good GDP dataThe S&P BSE Sensex declined 723 points to 80,728.03, while the NSE Nifty50 lost 191 points to 24,559.95 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-opening-trading-setup-nse-bse-trading-2734207-2025-06-02",
      "headline": "Stock market opening: Will Sensex, Nifty rally today after GDP numbers?India's economy grew by 7.4% in the January-March quarter, surprising many analysts. The growth was mainly driven by strong activity in the construction and manufacturing sectors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-indigo-nykaa-leela-hotels-tata-motors-bpcl-trading-bse-nse-2734196-2025-06-02",
      "headline": "Stocks to watch on June 2: IndiGo, Nykaa, Leela Hotels, Tata Motors, BPCLStocks such as Apollo Hospitals, IndiGo, Tata Motors, BPCL, Leela Hotels, and Aegis Vopak Terminals are expected to be in the spotlight, driven by recent news updates and their fourth-quarter earnings announcements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pankaj-tripathi-joins-hyundai-motor-india-as-brand-ambassador-2734190-2025-06-02",
      "headline": "Pankaj Tripathi joins Hyundai Motor India as brand ambassadorPankaj Tripathi is known for his roles in films and web series where he often plays characters that are relatable and grounded. Hyundai said this quality made him the right choice to represent the brand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-airbus-boeing-new-narrow-body-jet-order-supply-chain-issues-aviation-2734155-2025-06-02",
      "headline": "Air India in talks for another mega aircraft deal with Airbus, Boeing: SourcesThe plane orders come at a time when aircraft manufacturers are scrambling with supply chain issues leading to severe delays in aircraft delivery and a looming jet shortage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/air-india-to-move-jet-maintenance-work-from-turkey-firm-amid-diplomatic-tensions-2734134-2025-06-01",
      "headline": "Air India to move jet maintenance work from Turkey firm amid diplomatic tensionsAgainst the backdrop of Turkiye backing Pakistan and condemning India's strikes on terror camps in the neighbouring country in May, aviation security watchdog BCAS, on May 15, revoked the security clearance for Turkish company Celebi Airport Services India Pvt Ltd in the \"interest of national security\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zeptos-dharavi-licence-suspended-over-lapses-fungus-on-food-expired-goods-2734114-2025-06-01",
      "headline": "Fungus on food, expired goods: Zepto's Dharavi licence suspended over lapsesThe action against Zepto was taken after an inspection revealed fungal growth on food items, expired products, and unhygienic storage conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-delta-air-lines-air-france-klm-virgin-atlantic-air-connectivity-india-europe-north-america-2734012-2025-06-01",
      "headline": "IndiGo, Air France-KLM, Virgin Atlantic join hands to enhance travel to US, EuropeTo enhance air connectivity from India to Europe and North America, IndiGo, Delta Air Lines, Air France-KLM and Virgin Atlantic announced a partnership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-orders-indigo-to-end-agreement-with-turkish-airlines-amid-diplomatic-tensions-2733472-2025-05-31",
      "headline": "India orders IndiGo to end agreement with Turkish Airlines amid diplomatic tensionsThe Indian government has ordered IndiGo Airlines to terminate its damp lease agreement with Turkish Airlines by August 31. This decision comes in response to Turkey's continued support for Pakistan against India. The aviation regulator DGCA has granted a final three-month extension to the current lease, which was set to expire on May 31. IndiGo is currently operating two Boeing aircraft on damp lease from Turkish Airlines. The move is part of India's broader response to Turkey's actions, including supplying arms to Pakistan and condemning India's Operation Sindhu."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-reduces-import-tax-crude-edible-oils-to-10-bring-down-food-prices-2733414-2025-05-30",
      "headline": "India reduces import tax on crude edible oils by 10% to bring down food pricesThe reduction in import tax will effectively bring down the total import duty on the three oils to 16.5 per cent from an earlier 27.5 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-to-end-turkish-airlines-leasing-deal-by-august-31-2733344-2025-05-30",
      "headline": "IndiGo to cut ties with Turkish Airlines amid row over Ankara's support to PakThe Directorate General of Civil Aviation said IndiGo gave an undertaking that it will terminate the lease with Turkish Airlines by August 31 and will not seek a further extension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-1-and-itr-4-excel-utilities-out-check-who-can-file-and-what-new-this-year-itr-filing-2025-2733229-2025-05-30",
      "headline": "ITR-1 and ITR-4 Excel utilities out: Check who can file and what's new this yearExcel utilities for ITR-1 and ITR-4 are now available for AY 2025–26. Taxpayers can visit the income tax e-filing site to download and use them for filing returns for FY 2024–25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-misses-may-payment-for-loan-on-blusmart-cabs-report-2733215-2025-05-30",
      "headline": "Gensol misses May payment for loan on BluSmart cabs: ReportGensol Engineering reportedly missed a payment of about Rs 4 crore to its pass-through certificate (PTC) holders in May. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-economic-growth-hits-4-year-low-of-65-in-fy25-2733165-2025-05-30",
      "headline": "India's economic growth hits 4-year low of 6.5% in FY25The real GDP growth for the March quarter (Q4) stood at 7.4%, which is the fastest among all four quarters of the year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-182-points-lower-nifty-below-24800-it-stocks-drag-markets-infosys-hcltech-2733139-2025-05-30",
      "headline": "Sensex closes 182 points lower, Nifty below 24,800; IT stocks drag marketsThe S&P BSE Sensex was down by 182 points to end at 81,451.01, while the NSE Nifty50 lost 82.90 points to close at 24,750.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-instant-pf-withdrawals-via-upi-and-atms-to-online-corrections-5-expected-features-of-epfo-3o-2733090-2025-05-30",
      "headline": "From UPI withdrawals to online corrections: 5 expected features of EPFO 3.0EPFO's upcoming system aims to enhance financial flexibility for employees with features like instant UPI and ATM withdrawals, auto-claim settlements, and expanded withdrawal reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-leena-gandhi-tewari-the-suv-chairperson-who-bought-india-costliest-flats-2733045-2025-05-30",
      "headline": "Meet Leena Tewari, the USV chairperson who bought India's costliest flatsLeena is the chairperson of USV, a Mumbai-based pharmaceutical company, which was started by her late father, Vithal Gandhi, in partnership with Revlon in 1961. Forbes estimates Leena's net worth at $3.9 billion, as of May 30, 2025, making her one of India's richest women."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/arshad-warsi-maria-goretti-sebi-ban-1-year-why-reasons-shares-sadhna-broadcast-limited-sbl-2733005-2025-05-30",
      "headline": "Explained: Why Arshad Warsi, wife Maria Goretti were banned by Sebi for 1 yearArshad Warsi and Maria Goretti bought shares of Sadhna Broadcast Limited (now known as Crystal Business System Ltd) from other individuals who were also named in the Sebi order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donaldtrump-tariff-tsunami-impact-on-global-economy-explained-2733001-2025-05-30",
      "headline": "How Trump's tariff tsunami is reshaping global economyIn just over four months, Trump's flurry of trade actions, alternating between shock-and-awe tariffs and strategic pauses, has upended conventional expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/waiting-for-form-16-here-is-when-will-you-get-it-and-what-to-check-itr-filing-2025-2732994-2025-05-30",
      "headline": "Waiting for Form 16? Here's when will you get it and what to checkEmployers are required to issue Form 16 to employees if they've deducted TDS from their salary. It consists of two parts and shows how much salary was paid and how much tax was deducted during the year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/arshad-warsi-wife-maria-goretti-sebi-ban-57-others-stock-manipulation-case-sadhna-broadcast-ltd-2732975-2025-05-30",
      "headline": "Arshad Warsi, his wife, among 59 people banned from stock market for 1 yearSebi said the group was part of a scheme to artificially raise the price of Sadhna Broadcast shares before selling them to unsuspecting retail investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/veteran-investor-shankar-sharma-explains-why-most-investors-fail-in-markets-indian-stock-market-investment-tips-2732917-2025-05-30",
      "headline": "Veteran investor explains why most investors fail in marketsAce investor Shankar Sharma said many investors fail to ask tough questions and instead rely on myths. He was critical of the belief that great investors can see into the future, dismissing it as an unrealistic myth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gdp-data-today-q4-fy25-world-fourth-largest-economy-projections-inflation-2732908-2025-05-30",
      "headline": "India GDP data to be released today: What should investors expect?Earlier this year, the National Statistical Office had estimated that India's economy would grow by 6.5% in 2024–25, with an expected growth of 7.6% in the March quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-shares-tumble-10-percent-after-q4-net-loss-should-you-buy-hold-or-sell-2732905-2025-05-30",
      "headline": "Ola Electric shares nosedive 10% after Q4 net loss. Should you buy, hold or sell?Ola Electric's Q4 numbers have laid bare the challenges facing India's EV poster child, from falling volumes and margin pressures to delays in execution. While the company's aggressive bets on electric motorcycles and rural expansion could pay off, the near-term outlook is murky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/mazagon-dock-shares-snap-winning-streak-slide-sharply-q4-results-profit-halves-2732892-2025-05-30",
      "headline": "Mazagon Dock shares snap winning streak, tumble 8%. Here's whyThe stock fell to an intraday low of Rs 3,450, retracing from Thursday's close of Rs 3,749. Around 10:07 am, shares of the company were trading 4.75% lower at Rs 3,574.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/suzlon-energy-share-price-13-percent-rise-strong-q4-results-hold-or-sell-expert-view-outlook-2732887-2025-05-30",
      "headline": "Suzlon Energy share price up 13% over strong Q4 results: Should you buy?Suzlon Energy stock price: The shares jumped as much as 13% in early trade, reaching an intraday high of Rs 74.30 on the BSE. This rise comes after Suzlon Energy Ltd announced a sharp rise in its quarterly profit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-suzlon-energy-shares-rose-13-percent-after-strong-q4-results-2732871-2025-05-30",
      "headline": "Explained: Why Suzlon Energy shares rose 13% after Q4 resultsThe sharp rally came after Suzlon posted a 365% year-on-year jump in consolidated net profit for Q4FY25. Profit rose to Rs 1,182 crore from Rs 254 crore in the same quarter last year. Revenue from operations increased 73% to Rs 3,773 crore, compared to Rs 2,179 crore in the year-ago period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-150-points-lower-nifty-below-24800-infosys-down-over-1-percent-it-stocks-fall-2732862-2025-05-30",
      "headline": "Sensex opens 150 points lower; Nifty below 24,800; Infosys down over 1%The S&P BSE Sensex was down by 45.58 points to 81,587.44, while the NSE Nifty50 added 24.20 points to 24,857.80 as of 9:25 am."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/prostarm-info-systems-ipo-allotment-may-30-online-guide-check-status-subscription-gmp-today-listing-date-2732855-2025-05-30",
      "headline": "Prostarm Info Systems IPO allotment: Step-by-step guide to check statusProstarm Info Systems was subscribed to nearly 100 times. The IPO opened for subscription on May 27, 2025, and closed on May 29, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-to-open-higher-trading-setup-nse-bse-dalal-street-expectation-2732841-2025-05-30",
      "headline": "Stock market opening: Sensex, Nifty likely to open higher today. Here's whyAt 8:14 am, Gift Nifty futures were trading at 24,950, suggesting a positive start above Thursday's Nifty50 close of 24,833.6. This indicates that markets may open with gains in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-30-lic-baja-auto-ola-electric-nykaa-mazagaon-dock-indigo-2732836-2025-05-30",
      "headline": "Stocks to watch on May 30: LIC, Baja Auto, Ola, Nykaa, Mazagaon Dock, IndiGoAs the week nears its end, investors will be looking out for key movements on Friday, May 30, especially as several companies are expected to release their quarterly earnings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elf-beauty-buys-hailey-biebers-rhode-in-usd-1-billion-deal-2732645-2025-05-29",
      "headline": "Elf beauty buys Hailey Bieber's Rhode in $1 billion dealElf will acquire Rhode for $600 million in cash and $200 million of newly issued shares of Elf Beauty common stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mumbais-dharavi-to-get-a-rs-95790-crore-makeover-in-7-years-2732592-2025-05-29",
      "headline": "Mumbai's Dharavi to get a Rs 95,790 crore makeover in 7 yearsThe redevelopment is being led by a special purpose vehicle (SPV), Navbharat Mega Developers Private Limited (NMDPL), formed through a joint venture between the Maharashtra government's Slum Rehabilitation Authority (SRA) and the Adani Group's Dharavi Redevelopment Project Private Limited (DRPPL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mumbai-record-home-deal-usvs-chairperson-picks-up-duplexes-for-rs-639-crore-naman-xana-building-on-worli-sea-face-2732547-2025-05-29",
      "headline": "Mumbai's record home deal: USV's chairperson picks up duplexes for Rs 639 croreThese sea-facing homes are in the high-end 40-storey Naman Xana building on Worli Sea Face, offering stunning views of the Arabian Sea. The duplexes are spread across four floors – from the 32nd to the 35th, covering a total area of 22,572 sq ft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-321-points-higher-nifty-above-24800-indusind-bank-up-over-2-2732495-2025-05-29",
      "headline": "Sensex ends 321 points higher, Nifty above 24,800; IndusInd Bank up over 2%The BSE Sensex ended 320.70 points higher at 81,633.02, while the NSE Nifty50 settled 81.15 points higher at 24,833.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/key-financial-changes-in-june-2025-free-aadhaar-update-epfo-3-0-launch-financial-rule-changes-saving-credit-fd-rates-india-2732474-2025-05-29",
      "headline": "From PF access to free Aadhaar update: 5 key financial changes in June 2025The deadline to update your Aadhaar details online for free is June 14, 2025. Those who fail to update their identity and address proof documents by this date will incur a fee of Rs 25 for updates through the online portal or Rs 50 at physical Aadhaar centres. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-takes-charge-as-housefull-5-pune-event-turns-chaotic-2734298-2025-06-02",
      "headline": "Akshay Kumar takes charge as Housefull 5 Pune event turns chaoticAkshay Kumar, along with the entire team of 'Housefull 5', got together at an event in Pune. Amid all the craze for the upcoming film, a video showed fans getting emotional after seeing their favourite stars. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/wednesday-season-2-release-date-plot-cast-and-lady-gagas-mysterious-role-2734232-2025-06-02",
      "headline": "Wednesday Season 2: Release date, plot, cast, and Lady Gaga's mysterious roleThe popular Netflix gothic series 'Wednesday' returns with Season 2. The show will be released in two parts starting August 6, 2025, with darker twists, new mysteries, and familiar faces. Pop star Lady Gaga joins as a mysterious Nevermore teacher in Part 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jackie-chan-was-40-when-he-learnt-his-father-was-a-spy-my-original-name-is-fong-2734266-2025-06-02",
      "headline": "Jackie Chan was 40 when he learnt his father was a spy: My original name is FongActor Jackie Chan recently dropped a bombshell after he revealed that his father worked as a spy for the Chinese government. He learnt about his father's secret when he was 40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-birthday-note-to-mani-rathan-is-love-letter-to-their-cinematic-dream-2734263-2025-06-02",
      "headline": "Kamal Haasan's birthday note to Mani Ratnam is love letter to their cinematic dreamFrom 'Nayakan' to 'Thug Life', Kamal Haasan says he and Mani Ratnam share a common cinematic dream. The actor posted a heartfelt birthday tribute to the legendary director. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-director-vikram-sugumaran-dies-of-cardiac-arrest-at-47-2734243-2025-06-02",
      "headline": "Tamil director Vikram Sugumaran dies of cardiac arrest at 47Director Vikram Sugumaran was reportedly on his way back from Madurai when he experienced severe chest pain and was rushed to the hospital. He is survived by his wife and children. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-chuk-maaf-box-office-collection-day-10-detailed-report-strong-second-sunday-for-rajkummar-rao-film-2734228-2025-06-02",
      "headline": "Bhool Chuk Maaf box office Day 10: Strong second Sunday for Rajkummar Rao's film'Bhool Chuk Maaf' wrapped up its second weekend on a good note. The Rajkummar Rao and Wamiqa Gabbi-starrer has got four days to enjoy a smooth run at the box office before 'Housefull 5' hits the screens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/elvish-yadav-gang-member-gullu-wins-mtv-roadies-xx-takes-home-bike-rs-10-lakh-2734208-2025-06-02",
      "headline": "Elvish Yadav's gang member Gullu wins MTV Roadies XX, takes home bike, Rs 10 lakh MTV Roadies XX: This was Elvish Yadav's first season as a gang member, and his team's Gullu won it for him. The contestant took a cash prize of Rs 10 lakh and a bike. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/assams-9-year-old-binita-chetry-bags-third-place-on-britains-got-talent-2734107-2025-06-01",
      "headline": "Assam's 9-year-old Binita Chetry bags third place on Britain's Got TalentAssam's Binita Chetry secured third position on 'Britain's Got Talent' 2025 final. Chief Minister Himanta Biswa Sarma congratulated the nine-year-old on her achievement on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/comedian-gaurav-guptas-banter-with-pak-fan-at-us-show-chalo-hanuman-chalisa-padho-2734082-2025-06-01",
      "headline": "Comedian Gaurav Gupta's banter with Pak fan at US show: Chalo Hanuman chalisa padhoComedian Gaurav Gupta recently took a jibe at a Pakistani fan during a stand-up show as part of his US-Canada comedy tour, which led to mixed reactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-on-unexpected-romance-with-gauri-spratt-we-met-by-mistake-and-connected-2734063-2025-06-01",
      "headline": "Aamir Khan on unexpected romance with Gauri Spratt: We met by mistake and connectedActor Aamir Khan opened up on his bond with his partner Gauri Spratt. He recalled meeting her unexpectedly as he had not expected to find love again at this age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-ripped-tattoo-avatar-leaves-fans-amazed-2734052-2025-06-01",
      "headline": "Shah Rukh Khan's ripped and tattooed avatar leaves fans amazedShah Rukh Khan recently stunned fans with a new avatar, showcasing a muscular physique and flaunting his tattoos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bohot-sharafat-se-actor-mumtaz-recalls-yash-chopras-marriage-proposal-2734000-2025-06-01",
      "headline": "Bohot sharafat se... Actor Mumtaz recalls Yash Chopra's marriage proposalVeteran actor Mumtaz recalled once being proposed by the late filmmaker Yash Chopra. The 77-year-old spoke about her priorities at that time as an aspirational young actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-calls-marriage-to-reena-dutta-jawani-ka-josh-timing-was-a-mistake-2734016-2025-06-01",
      "headline": "Aamir Khan calls marriage to Reena Dutta jawani ka josh: Timing was a mistakeActor Aamir Khan reflected upon 16 years of marriage to Reena Dutta. The actor shared that he doesn't regret marrying Reena, because in her, he found a friend for life, but the timing of the marriage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-kicks-off-2025-festa-with-laughter-legacy-and-bangtan-vibes-2734014-2025-06-01",
      "headline": "BTS kicks off 2025 FESTA with laughter, legacy, and Bangtan vibesBTS has launched the '2025 BTS FESTA' to celebrate their 12th debut anniversary, marking a heartfelt and playful reunion stage for the group post military service. The event sets the tone for an eagerly awaited full-group comeback later this year or early next year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sreeleela-sits-in-basket-shares-intimate-family-moments-before-birthday-see-pics-2733979-2025-06-01",
      "headline": "Actor Sreeleela sits in basket, shares family celebration before birthday. PicsActor Sreeleela shared a nostalgic pre-birthday post on social media with her family. In the pictures, she is seen dressed traditionally, sitting in a basket as her family members shower her with blessings and love. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/time-exposes-says-director-raj-nidimoru-wife-amid-rumours-of-him-dating-samantha-2733986-2025-06-01",
      "headline": "Time exposes, says director Raj Nidimoru's wife amid rumours of him dating SamanthaAs the rumours of Samantha dating director Raj Nidimoru spread on social media, his wife, Shyyamali De, shared a cryptic note on Instagram, mentioning 'karma' and 'time'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-says-mahabharat-could-be-his-last-spectacle-hope-i-die-with-my-shoes-on-2733949-2025-06-01",
      "headline": "Hope I die with my shoes on: Aamir Khan says Mahabharat could be his last spectacleAamir Khan recently spoke about the possibility of his ambitious project based on the epic Mahabharat. He also hinted at it being the final film project of his career after 'Sitaare Zameen Par'. The actor reflected on the reason why he felt so."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-5-to-have-3-parts-plot-cast-release-date-all-you-need-to-know-2733910-2025-06-01",
      "headline": "Stranger Things 5 to have 3 parts: Plot, cast, release date - all you need to know'Stranger Things Season 5' finale will release on New Year's Eve. Netflix has split the last season into three parts. Here's all you need to know about one of the most celebrated fantasy thrillers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/indian-tv-was-better-in-the-90s-not-just-nostalgia-2732359-2025-06-01",
      "headline": "Indian TV was better in the 90s - and it's not just nostalgiaWhen television was a reflection of life, not a cacophony of drama and excess, the golden era of Indian TV in the 90s brought stories that resonated with the soul and characters that felt like family."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/5-takeaways-from-ukraines-operation-spiders-web-2734253-2025-06-02",
      "headline": "Russia's Pearl Harbour: Five takeaways from Ukraine's surprise attackUkrainian special forces executed one of the largest and most complex drone-based special operations in modern warfare, destroying 41 Russian aircraft across multiple airbases using over 100 drones launched from disguised shipping containers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/anna-university-sex-assault-accused-gnanasekaran-gets-30-years-in-jail-tamil-nadu-biryani-seller-2734265-2025-06-02",
      "headline": "Anna University sex assault accused gets 30 years in jail, fined Rs 90,000A special court in Chennai sentenced the accused in the Anna University sexual abuse case, Gnanasekaran, to 30 years of imprisonment and imposed a fine of Rs 90,000 after finding him guilty on all eleven charges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/multiple-wounded-in-colorado-attack-fbi-calls-it-targeted-terror-glbs-2734181-2025-06-02",
      "headline": "People set on fire in Colorado attack; FBI calls it targeted terrorIn the video of the incident that went viral on social media, the suspect, Mohamed Sabry Soliman, can be seen shouting at pro-Israeli protesters, asking, 'How many children have you killed?' while holding a flamethrower in one hand and a Molotov cocktail in the other."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indias-covid-case-tally-delhi-kerala-mumbai-bengaluru-highest-jump-daily-active-cases-deaths-2734270-2025-06-02",
      "headline": "India's Covid tally nears 4,000; Delhi sees highest one-day jumpIndia reported 3,961 active Covid-19 cases on Monday, with Delhi recording the highest single-day rise of 47 cases and one more death, while Kerala remained the worst-hit state with 1,435 active infections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-balochistan-agitation-after-men-children-baloch-women-enforced-disappearance-forced-arrest-trend-mahrang-2733597-2025-06-02",
      "headline": "Baloch women now face brutality of Pakistani establishmentThe enforced disappearance of 24-year-old Mahjabeen Baloch last week marks an escalation. Baloch women are now being targeted by the Pakistani establishment in the same brutal way as Baloch men, children, and the elderly. There's a disturbing rise in enforced disappearances of women activists in Balochistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/left-waiting-for-ambulance-minor-rape-victim-dalit-girl-dies-patna-hospital-rahul-gandhi-slams-nitish-nda-government-2734251-2025-06-02",
      "headline": "Left waiting in ambulance for hours, minor rape victim dies at Patna hospitalThe incident has sparked a major political row in poll-bound Bihar, with Leader of the Opposition in the Lok Sabha, Rahul Gandhi, stating that 'minor Dalit girl in Muzaffarpur' died due to systemic apathy and medical negligence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rajeev-shukla-set-to-become-bcci-president-as-roger-binny-nears-age-limit-2734246-2025-06-02",
      "headline": "Rajeev Shukla set to become BCCI President as Roger Binny nears age limit: SourcesRajeev Shukla is set to take over as the BCCI (Board of Control for Cricket in India) President as Roger Binny is nearing the age limit for holding the position as per the board's constitution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-zelenskyy-vladimir-putin-drone-attack-air-strike-peace-talk-2734206-2025-06-02",
      "headline": "117 drones, 18-month planning: Zelenskyy details 'brilliant op' deep into RussiaA day before the scheduled peace talks, Ukrainian forces launched one of their most daring and successful attacks on Russian soil, striking dozens of strategic bombers at airbases located thousands of kilometres behind the front lines."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/video-moments-after-boulder-attack-suspect-throws-alleged-cocktails-on-pro-israel-group-glbs-2734182-2025-06-02",
      "headline": "Video: Colorado 'terror' suspect faces furious locals after firebombingA man was arrested after allegedly throwing Molotov cocktail-like liquid at a pro-Israel group in Boulder, injuring several. FBI Director Kash Patel called it a \"targeted terror attack,\" though police say it's too early to confirm the motive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-pakistan-fired-pl-15e-missiles-debris-in-india-is-chinas-worry-2733900-2025-06-01",
      "headline": "Why Pakistan-fired PL-15E missile's debris in India is China's worryThe remnants, while proving China's role in the India-Pakistan conflict, open up reverse-engineering potential for New Delhi to bolster its own missile programmes"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-magnus-carlsen-loses-to-d-gukesh-punches-table-in-frustration-2734165-2025-06-02",
      "headline": "Video: Magnus Carlsen punches table after crushing defeat against D GukeshNorway Open: Magnus Carlsen stormed off after punching the table in frustration as world champion D Gukesh registered his first-ever over-the-board classical win against the Norwegian stalwart on Sunday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/colorado-boulder-attack-firebomb-targeted-terror-jewish-israel-gaza-shashi-tharoor-indian-delegation-2734229-2025-06-02",
      "headline": "Terror has no place in our countries: Op Sindoor delegation on Colorado attackMembers of the Indian all-party delegation in the US condemned the terror attack on a Jewish gathering in Colorado, with leader Shashi Tharoor affirming that \"terror has no place in our countries\".\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-india-ipl-2025-feature-2733477-2025-05-31",
      "headline": "Stupidity and the C word: Shreyas Iyer and the philosophy of Langda TyagiIPL 2025: Shreyas Iyer's cricketing journey has been marked by brilliance, resilience, and underappreciation, much like the tragic figure Langda Tyagi from Omkara. Despite injuries and setbacks, his talent and leadership continue to shine as he amply demonstrated with a scintillating 87 in last night's semi-final against the Mumbai Indians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/virat-kohlis-one-8-commune-in-bengaluru-booked-for-not-having-smoking-zone-2734237-2025-06-02",
      "headline": "Case against Virat Kohli's pub in Bengaluru for lacking designated smoking zoneBengaluru's Cubbon Park Police has registered a suo-motu case against the restaurant for violating provisions of the Cigarettes and Other Tobacco Products Act (COTPA)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/operation-jalrahat-2-army-assam-rifles-rescue-500-civilians-in-flood-marooned-imphal-2734141-2025-06-01",
      "headline": "Over 500 civilians rescued by Army, Assam Rifles in flood-struck ManipurThe personnel rescued civilians from severely inundated areas such as Wangkhei, Heingang, Lamlong, Khurai, JNIMS and Ahallup, officials said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/harvard-graduate-speaks-on-unity-as-men-fight-behind-her-in-viral-video-2734282-2025-06-02",
      "headline": "Harvard graduate speaks on unity as men fight behind her in viral videoIn a striking twist of irony, Yurong \"Luanna\" Jiang was speaking about empathy during her interview with The Associated Press when a scuffle broke out in the background."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/katie-miller-elon-musk-and-stephen-whats-behind-the-buzz-glbs-2734173-2025-06-02",
      "headline": "Katie Miller, Elon Musk, and Stephen: What's behind the buzz?Rumours claim Katie Miller left husband Stephen Miller for Elon Musk after Musk appeared with a black eye and Katie joined his team. But no official reports support the affair theory, and both Millers seem to remain united despite online buzz.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-qualifier-2-shreyas-iyer-final-rcb-2734168-2025-06-02",
      "headline": "Sensational Shreyas Iyer floors MI, fires Punjab into IPL final after 11 yearsIPL 2025 Qualifier 1: Shreyas Iyer smashed 87 off 41 balls in one of his greatest knocks as Punjab Kings chased 204 successfully against Mumbai Indians. PBKS will face Royal Challengers Bengaluru on Tuesday, June 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/jee-advanced-2025-result-out-rajit-gupta-tops-with-332-marks-full-list-here-2734252-2025-06-02",
      "headline": "JEE Advanced 2025 result out: Rajit Gupta tops with 332 marks, full list hereThe Indian Institute of Technology (IIT) Kanpur has released the JEE Advanced 2025 results today, with Rajit Gupta from the IIT Delhi zone clinching the top spot. Candidates can now access their results at jeeadv.ac.in.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-shares-clip-accusing-gunmen-of-shooting-at-gaza-aid-site-blames-hamas-2734151-2025-06-01",
      "headline": "Israel shares clip accusing gunmen of shooting at Gaza aid site, blames HamasThe Israel Defence Forces (IDF) released drone footage purportedly showing Hamas gunmen firing at the crowds, asserting that the incident was a deliberate effort to sabotage humanitarian efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/alia-bhatt-anne-hathaway-eye-patches-benefits-2734162-2025-06-02",
      "headline": "Eye patches look cool, scream self-care. But do they work?Alia Bhatt to Anne Hathaway, celebrities love flaunting eye patches. But are they a must-have in your glow-up essentials kit?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/assams-9-year-old-binita-chetry-bags-third-place-on-britains-got-talent-2734107-2025-06-01",
      "headline": "Assam's 9-year-old Binita Chetry bags third place on Britain's Got TalentAssam's Binita Chetry secured third position on 'Britain's Got Talent' 2025 final. Chief Minister Himanta Biswa Sarma congratulated the nine-year-old on her achievement on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-road-accident-4-on-bike-killed-in-deadly-suv-crash-on-gorakhpur-varanasi-national-highway-2734238-2025-06-02",
      "headline": "Video: 4 on bike killed in deadly SUV crash on UP highway, riders flung into airIn the CCTV footage accessed by India Today TV, the four friends seated on an Apache motorcycle are seen overtaking a tractor before an SUV coming from the Gorakhpur side collides with them. At the point of impact, two were flung a few meters into the air before landing on the road."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aadhaar-fraud-in-madhya-pradesh-police-constable-exam-candidates-hire-impersonators-to-appear-2734183-2025-06-02",
      "headline": "Aadhaar fraud in police constable exam: Munna Bhai-style scam in Madhya PradeshThe cheating was uncovered during document verification prior to joining, when the photograph on the exam records did not match the current Aadhaar photo."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-maxwell-announces-retirement-from-odi-cricket-to-shift-focus-on-t20is-2734292-2025-06-02",
      "headline": "Glenn Maxwell announces retirement from ODI cricket to shift focus on T20IsStar Australia all rounder Glenn Maxwell has announced his retirement from ODI cricket to shift his focus on T20Is, with the World Cup scheduled to be held in 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-batting-mumbai-indians-vs-punjab-kings-ipl-2025-2734289-2025-06-02",
      "headline": "What is Shreyas Iyer's biggest strength? ABD reacts to knock of IPL 2025Shreyas Iyer's played perhaps the knock of the Indian Premier League 2025 to storm his team into the final of the tournament. Sanjay Bangar and AB de Villiers were left awed by the batter's innings and spoke about his greatest strengths."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/french-open-day-9-novak-djokovic-jannik-sinner-and-coco-gauff-eye-quarter-finals-berth-2734283-2025-06-02",
      "headline": "French Open Day 9: Djokovic, Sinner and Gauff eye quarter-finals berthThe Day 9 of the Roland Garros 2025 will feature several big stars in action as Novak Djokovic, Jannik Sinner, Alexander Zverev and Coco Gauff, amongst others, will grace the court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-pbks-shreyas-iyer-final-vs-rcb-2734280-2025-06-02",
      "headline": "IPL 2025: Forged by fire, Shreyas Iyer blazes through the battle for recognitionIPL 2025 Qualifier 2: In a high-stakes chase against Mumbai Indians, Punjab Kings captain Shreyas Iyer showed he's hungrier than ever. After months of doubt, snubs, and whispers about his game, he let his bat do the talking - reminding everyone he'd only been waiting for the right moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rajeev-shukla-set-to-become-bcci-president-as-roger-binny-nears-age-limit-2734246-2025-06-02",
      "headline": "Rajeev Shukla set to become BCCI President as Roger Binny nears age limit: SourcesRajeev Shukla is set to take over as the BCCI (Board of Control for Cricket in India) President as Roger Binny is nearing the age limit for holding the position as per the board's constitution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-reaction-magnus-carlsen-table-slam-norway-chess-2734236-2025-06-02",
      "headline": "Gukesh reacts to epic win against Carlsen: 99 out of 100 times, I would loseD Gukesh and Magnus Carlsen showed contrasting reactions to their latest match in the Norway Chess. While Carlsen slammed the table amid stormed off, Gukesh remained humble in perhaps the greatest win of his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-vs-mi-mahela-jayawardene-rues-dropped-chances-after-losing-qualifier-2-2734213-2025-06-02",
      "headline": "PBKS vs MI: Mahela Jayawardene rues dropped chances after losing Qualifier 2Mumbai Indians (MI) head coach Mahela Jayawardene was left ruing dropped chances following his team's five-wicket loss against Punjab Kings (PBKS) in Qualifier 2 of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shreyas-iyer-first-captain-3-finals-punjab-kings-beat-mumbai-indians-qualifier-2-stats-2734171-2025-06-02",
      "headline": "Shreyas Iyer's triple treat, MI's 200 fortress breached: IPL Qualifier 2 in statsShreyas Iyer made IPL history by becoming the first captain to lead three different teams—Delhi Capitals (2020), Kolkata Knight Riders (2024), and Punjab Kings (2025)—to the final. Meanwhile, Punjab Kings shattered Mumbai Indians' longstanding fortress by successfully chasing a record 204 runs in Qualifier 2, setting the highest-ever chase in IPL knockout history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-shreyas-iyer-angry-at-shashank-singh-2734197-2025-06-02",
      "headline": "Watch: Shreyas Iyer's angry outburst at Shashank after match-winning knock vs MIPunjab Kings (PBKS) captain Shreyas Iyer was seen fuming at teammate Shashank Singh following his match-winning innings against Mumbai Indians (MI) in the Qualifier 2 of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/told-virat-kohli-to-ease-emotions-in-ipl-he-didnt-follow-advice-ab-de-villiers-2734189-2025-06-02",
      "headline": "Told Virat Kohli to ease emotions in IPL, he didn't follow advice: AB de VilliersAB de Villiers revealed that he told Virat Kohli to try and play a season in the IPL while toning down on his emotions on the field. De Villiers said that Kohli heard the advice and decided not to use it. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ab-de-villiers-on-shreyas-iyers-unbelievable-shot-vs-jasprit-bumrah-2734188-2025-06-02",
      "headline": "Shot of the IPL! AB de Villiers raves as Shreyas Iyer diffuses Bumrah yorkerLegendary South Africa cricketer AB de Villiers reserved his highest praise for Shreyas Iyer after his match-winning innings of 87* (41) against Mumbai Indians (MI) in Qualifier 2 of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-vs-mi-mahela-jayawardene-rues-dropped-chances-after-losing-qualifier-2-2734213-2025-06-02",
      "headline": "PBKS vs MI: Mahela Jayawardene rues dropped chances after losing Qualifier 2Mumbai Indians (MI) head coach Mahela Jayawardene was left ruing dropped chances following his team's five-wicket loss against Punjab Kings (PBKS) in Qualifier 2 of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shreyas-iyer-first-captain-3-finals-punjab-kings-beat-mumbai-indians-qualifier-2-stats-2734171-2025-06-02",
      "headline": "Shreyas Iyer's triple treat, MI's 200 fortress breached: IPL Qualifier 2 in statsShreyas Iyer made IPL history by becoming the first captain to lead three different teams—Delhi Capitals (2020), Kolkata Knight Riders (2024), and Punjab Kings (2025)—to the final. Meanwhile, Punjab Kings shattered Mumbai Indians' longstanding fortress by successfully chasing a record 204 runs in Qualifier 2, setting the highest-ever chase in IPL knockout history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-shreyas-iyer-angry-at-shashank-singh-2734197-2025-06-02",
      "headline": "Watch: Shreyas Iyer's angry outburst at Shashank after match-winning knock vs MIPunjab Kings (PBKS) captain Shreyas Iyer was seen fuming at teammate Shashank Singh following his match-winning innings against Mumbai Indians (MI) in the Qualifier 2 of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/told-virat-kohli-to-ease-emotions-in-ipl-he-didnt-follow-advice-ab-de-villiers-2734189-2025-06-02",
      "headline": "Told Virat Kohli to ease emotions in IPL, he didn't follow advice: AB de VilliersAB de Villiers revealed that he told Virat Kohli to try and play a season in the IPL while toning down on his emotions on the field. De Villiers said that Kohli heard the advice and decided not to use it. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ab-de-villiers-on-shreyas-iyers-unbelievable-shot-vs-jasprit-bumrah-2734188-2025-06-02",
      "headline": "Shot of the IPL! AB de Villiers raves as Shreyas Iyer diffuses Bumrah yorkerLegendary South Africa cricketer AB de Villiers reserved his highest praise for Shreyas Iyer after his match-winning innings of 87* (41) against Mumbai Indians (MI) in Qualifier 2 of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-2-pbks-vs-mi-shreyas-iyer-rcb-loss-ahmedabad-2734170-2025-06-02",
      "headline": "Throw it in the bin: How Shreyas Iyer, PBKS overcame RCB qualifier 1 lossPBKS skipper Shreyas Iyer explained how his side were able to overcome their big loss to RCB in the Qualifier 1 to come back and beat MI to reach the final of IPL 2025. Shreyas was the star of the show as Punjab reached the final for the first time in 11 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-2-pbks-vs-mi-preity-zinta-shreyas-iyer-ricky-ponting-2734174-2025-06-02",
      "headline": "Emotional Preity Zinta celebrates with Shreyas Iyer after PBKS reach IPL 2025 finalAn emotional Preity Zinta celebrated with PBKS skipper Shreyas Iyer as Punjab reached the final of IPL 2025 with a five-wicket win over Mumbai Indians on Sunday, June 1. Punjab will face RCB in the final on June 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-reaction-mumbai-indians-out-punjab-kings-reach-ipl-2025-final-2734169-2025-06-02",
      "headline": "Hardik Pandya sinks to ground, takes the blame after Mumbai lose Qualifier 2Mumbai Indians captain Hardik Pandya sank into his haunches after Shreyas Iyer struck the winning runs, helping Punjab Kings knock Mumbai Indians out of IPL 2025 and set up the title clash against Royal Challengers Bangalore in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-qualifier-2-shreyas-iyer-final-rcb-2734168-2025-06-02",
      "headline": "Sensational Shreyas Iyer floors MI, fires Punjab into IPL final after 11 yearsIPL 2025 Qualifier 1: Shreyas Iyer smashed 87 off 41 balls in one of his greatest knocks as Punjab Kings chased 204 successfully against Mumbai Indians. PBKS will face Royal Challengers Bengaluru on Tuesday, June 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-magnus-carlsen-loses-to-d-gukesh-punches-table-in-frustration-2734165-2025-06-02",
      "headline": "Video: Magnus Carlsen punches table after crushing defeat against D GukeshNorway Open: Magnus Carlsen stormed off after punching the table in frustration as world champion D Gukesh registered his first-ever over-the-board classical win against the Norwegian stalwart on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-carlos-alcaraz-reach-quarterfinal-beat-shelton-2nd-fastest-100-wins-clay-2734161-2025-06-02",
      "headline": "Carlos Alcaraz outlasts Ben Shelton, becomes 2nd fastest to 100 wins on clayDefending champion Carlos Alcaraz secured his 100th tour-level victory on clay by defeating American Ben Shelton in a thrilling fourth-round battle to reach the quarter-finals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-england-lions-first-unofficial-test-day-3-mukesh-kumar-canterbury-2734160-2025-06-02",
      "headline": "India A bowlers made to toil as England Lions reach 527 for 7 at end of Day 3The India A bowlers were made to toil on Day 3 of the first unofficial Test as England Lions batters made merry on a flat deck in Canterbury on Sunday, June 1. Mukesh Kumar was the only Indian bowler who got some success on Day 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-wi-2nd-odi-report-joe-root-166-england-2-0-series-lead-west-indies-2734150-2025-06-01",
      "headline": "Root unbeaten 166 helps England script 3-wicket win, take 2-0 series lead vs WIEngland vs West Indies, 2nd ODI: Joe Root played a sensational unbeaten 166-run knock to help England chase down the 309-run target in the second ODI and take a 2-0 lead against West Indies at Sophia Gardens on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-magnus-carlsen-loses-to-d-gukesh-punches-table-in-frustration-2734165-2025-06-02",
      "headline": "Video: Magnus Carlsen punches table after crushing defeat against D GukeshNorway Open: Magnus Carlsen stormed off after punching the table in frustration as world champion D Gukesh registered his first-ever over-the-board classical win against the Norwegian stalwart on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-carlos-alcaraz-reach-quarterfinal-beat-shelton-2nd-fastest-100-wins-clay-2734161-2025-06-02",
      "headline": "Carlos Alcaraz outlasts Ben Shelton, becomes 2nd fastest to 100 wins on clayDefending champion Carlos Alcaraz secured his 100th tour-level victory on clay by defeating American Ben Shelton in a thrilling fourth-round battle to reach the quarter-finals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-england-lions-first-unofficial-test-day-3-mukesh-kumar-canterbury-2734160-2025-06-02",
      "headline": "India A bowlers made to toil as England Lions reach 527 for 7 at end of Day 3The India A bowlers were made to toil on Day 3 of the first unofficial Test as England Lions batters made merry on a flat deck in Canterbury on Sunday, June 1. Mukesh Kumar was the only Indian bowler who got some success on Day 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-wi-2nd-odi-report-joe-root-166-england-2-0-series-lead-west-indies-2734150-2025-06-01",
      "headline": "Root unbeaten 166 helps England script 3-wicket win, take 2-0 series lead vs WIEngland vs West Indies, 2nd ODI: Joe Root played a sensational unbeaten 166-run knock to help England chase down the 309-run target in the second ODI and take a 2-0 lead against West Indies at Sophia Gardens on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-2-suryakumar-yadav-700-ab-de-villiers-record-2734146-2025-06-01",
      "headline": "Suiryakumar Yadav breaks AB de Villiers's IPL record with 700 runs in 2025IPL 2025: Suryakumar Yadav became the first non-opening batter to score over 700 runs in an IPL season. He hit a quickfire 44 against Punjab Kings in Qualifier 2 in Ahmedabad on Sunday, June 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-anderson-t20-comeback-three-wickets-lancashire-vitality-blast-2734133-2025-06-01",
      "headline": "James Anderson impresses with 3-wicket haul in comeback T20 after 11 yearsJames Anderson marked his return to T20 cricket in style, taking three wickets in a sharp four-over spell for Lancashire in their Vitality T20 Blast clash against Durham at Chester-le-Street on Sunday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-day-8-results-aryna-sabalenka-amanda-anisimova-roland-garros-2734137-2025-06-01",
      "headline": "Aryna Sabalenka reaches 3rd straight French Open quarterfinal, to face Qinwen ZhengAryna Sabalenka overcame a stiff test from Amanda Aminisova to make it to the French Open quarter-finals for the third consecutive time. Sabalenka will face Olympic champion Qinwen Zheng in the next round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-dismissed-early-stoinis-strikes-ipl-2025-qualifier-2-2734125-2025-06-01",
      "headline": "Marcus Stoinis roars after Rohit Sharma's wicket as Iyer's gamble worksRohit Sharma's luck ran out in IPL 2025 Qualifier 2 as Marcus Stoinis took his wicket early. The tactical bowling change by Punjab Kings captain Shreyas Iyer proved decisive in the rain-delayed match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-coach-pratima-barwa-mentor-to-many-international-players-dies-in-ranchi-2734123-2025-06-01",
      "headline": "Hockey coach Pratima Barwa, mentor to many international players, dies in RanchiPratima Barwa, the distinguished hockey coach from Jharkhand, died in Ranchi after suffering a paralytic stroke. She had been admitted to the ICU of a private hospital and was on ventilator support, but despite intensive medical efforts, she could not be revived."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-2-mumbai-indians-punjab-kings-delay-rain-ahmedabad-fan-reaction-2734098-2025-06-01",
      "headline": "Fans question BCCI after rain delays start of Qualifier 2 in AhmedabadIPL 2025, PBKS vs MI, Ahmedabad weather: Fans questioned the BCCI's decision to shift Qualifier 2 from Kolkata to Ahmedabad after rain disrupted proceedings at the Narendra Modi Stadium. The start of the crucial clash between Mumbai Indians and Punjab Kings was delayed despite the toss having already taken place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-fans-bengaluru-nepal-virat-kohli-ahmedabad-2734100-2025-06-01",
      "headline": "From Bengaluru to Nepal: RCB fans gear up for historic IPL 2025 finalRCB are all set to play their fourth IPL final on June 3 and the fans are hyped up and ready for the clash in Ahmedabad. From free auto rides in Bengaulru to fans making their way from Nepal to Ahmedabad for the final, RCB fans are getting ready in their own unique way. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-iga-swiatek-comeback-elena-rybakina-25-wins-roland-garros-2734097-2025-06-01",
      "headline": "Iga Swiatek beats 'Sinner-like' Elena Rybakina in epic comeback to reach quartersFrench Open 2025: Defending champion Iga Swiatek produced a comeback for the ages, bouncing back from a set and break down to beat Elena Rybakina. The Polish star equalled Monica Seles's record for most successive wins in women's singles at Roland Garros. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-keshav-maharaj-confident-south-africa-australia-2734092-2025-06-01",
      "headline": "South Africa's never-say-die attitude stands out: Keshav ready for WTC FinalSouth Africa spinner Keshav Maharaj said the Proteas' never-say-die attitude has been central to their journey and will be key as they look to challenge Australia in the World Test Championship (WTC) Final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-2-pbks-vs-mi-playing-xis-yuzvendra-chahal-reece-topley-2734080-2025-06-01",
      "headline": "Qualifier 2: Yuzvendra Chahal returns for PBKS, Reece Topley debuts for MIYuzvendra Chahal has made a return to the PBKS lineup for the Qualifier 2 against MI after shaking off a wrist injury. MI have brought in Reece Topley for the crucial game in Ahmedabad on Sunday, June 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-matheus-cunha-signing-wolves-2734079-2025-06-01",
      "headline": "Manchester United announce Matheus Cunha as 1st signing of summer transfer windowManchester United have announced Matheus Cunha as their first signing of the summer from Wolverhampton Wanderers on Sunday, June 1. Cunha was a star for Wolves last season as they escaped relegation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mukesh-kumar-virat-kohli-no-18-jersey-vs-england-lions-outrage-2734062-2025-06-01",
      "headline": "Mukesh Kumar dons Virat Kohli's iconic No. 18 jersey vs England Lions, sparks outrageMukesh Kumar wore the iconic number 18 jersey, famously linked to former captain Virat Kohli, during India 'A's first unofficial Test against the England Lions on Sunday. This sparked backlash on social media, with many fans expressing their displeasure on X (formerly Twitter)."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}