{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-capital-ipo-stock-market-listing-share-price-hold-sell-book-profit-expert-view-2605538-2024-09-24",
      "headline": "Northern Arc Capital shares list at 33% premium over IPO price. Hold or sell?Northern Arc Capital IPO listing: The stock opened at Rs 351 on the Bombay Stock Exchange, up 33.5% from its issue price of Rs 263. Similarly, it listed at Rs 350 on the National Stock Exchange."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arkade-developers-share-price-stock-market-listing-book-profit-or-hold-expert-view-2605526-2024-09-24",
      "headline": "Arkade Developers shares gain 37% on listing: Should you book profit or hold?Arkade Developers stock opened at Rs 175 on the Bombay Stock Exchange, a 36.72% jump from its issue price of Rs 128. On the National Stock Exchange, the shares listed at Rs 175.90, reflecting a similar premium of 37.42%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-emkay-global-upgrades-rating-add-target-price-doubled-rs-750-2605500-2024-09-24",
      "headline": "Paytm shares jump over 3% after Emkay's rating upgrade. More upside ahead?Paytm share price: The rally comes after Emkay Global Financial Services upgraded its rating on One97 Communications from 'Reduce' to 'Add' while doubling its target price to Rs 750 per share from the previous Rs 375."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/byjus-faces-setback-us-court-delaware-upholds-usd-12-billion-loan-default-ruling-glas-trust-llc-2605485-2024-09-24",
      "headline": "Byju's faces setback as US court upholds $1.2 billion loan default rulingThe court's decision supports an earlier ruling made by the Delaware Court of Chancery, which allowed the company's lenders, represented by Glas Trust LLC, to seize control of Byju's Alpha Inc"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jsw-group-rs-40000-crore-electric-vehicle-battery-project-from-odisha-to-maharashtra-2605480-2024-09-24",
      "headline": "JSW Group to shift Rs 40,000 crore EV project from Odisha to Maharashtra: ReportJSW Group, led by Sajjan Jindal, is now eyeing Maharashtra, with Aurangabad and Nagpur emerging as the top contenders for the large-scale EV and battery project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manaba-finance-ipo-day-2-check-latest-subscription-expected-listing-gains-gmp-2605468-2024-09-24",
      "headline": "Manaba Finance IPO Day 2: Check latest subscription, expected listing gains The IPO of Manba Finnace is a fresh issue of 1.26 crore shares and closes for subscription on September 25, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-share-price-falls-icici-securities-target-agr-dues-supreme-court-2605444-2024-09-24",
      "headline": "Vodafone Idea shares fall 2% as ICICI Securities cuts target price ICICI Securities has reduced Vodafone Idea's EV/EBITDA multiple to 13 times FY27 from 14 times and lowered its target price to Rs 11 from Rs 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-can-it-supercharge-ntpc-stock-growth-2605436-2024-09-24",
      "headline": "NTPC Green Energy IPO: Can It supercharge NTPC's stock growth?NTPC's performance in the last two years has largely been driven by its growing renewable energy (RE) business, which is expected to go public in the first half of FY2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-september-24-2024-precious-metals-record-hike-on-mcx-2605414-2024-09-24",
      "headline": "Gold, silver price today, September 24, 2024: Precious metals record hike on MCXGold Price Today September 24, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Tuesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arkade-developers-shares-make-strong-market-debut-list-at-37-percent-premium-rs-175-bse-nse-2605405-2024-09-24",
      "headline": "Arkade Developers shares make strong D-Street debut, lists at 37% premiumArkade Developers listing: Shares of the real estate company listed at Rs 175 on the Bombay Exchange (BSE) at a premium of 36.72% over its issue price of Rs 128."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/western-carriers-stock-market-listing-1-percent-discount-over-ipo-price-2605402-2024-09-24",
      "headline": "Western Carriers makes weak D-Street debut, lists at 1% discountWestern Carriers market listing: Despite the weak listing, the IPO received strong investor interest, being oversubscribed nearly 31 times, primarily driven by non-institutional investors.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-capital-shares-listing-33-percent-premium-misses-gmp-nse-bse-rs-351-2605395-2024-09-24",
      "headline": "Northern Arc Capital shares list at 33% premium, misses GMP Northern Arc Capital listing: The shares opened at Rs 351, with a premium of 33.5% over the IPO price of Rs 263 per share on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-record-high-markets-2605385-2024-09-24",
      "headline": "Sensex crosses 85,000 for 1st time, Nifty hits record highAs of 10:05 AM, the S&P BSE Sensex had risen 80.74 points to 85,009.35, while the NSE Nifty50 was up 29.15 points to 25,968.20.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-near-record-highs-profit-booking-2605374-2024-09-24",
      "headline": "Sensex, Nifty slip from record highs amid rising Middle East tensionsThe S&P BSE Sensex was down 107.07 points to 84,821.54 at around 9:16 am, while the NSE Nifty50 fell 23.50 points to trade at 25,915.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anmol-ambani-fine-rs-1-crore-sebi-reliance-home-finance-krishnan-gopalakrishnan-2605129-2024-09-23",
      "headline": "Sebi fines Anmol Ambani Rs 1 crore for lapses in Reliance Home Finance case Sebi also fined Krishnan Gopalakrishnan, the Chief Risk Officer of Reliance Housing Finance, Rs 15 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-study-fo-traders-7-percent-made-profit-in-last-3-years-93-percent-loss-2605111-2024-09-23",
      "headline": "Only 7% of F&O traders made profit in last 3 years, says Sebi studyAccording to the Sebi study, 1.13 crore retail traders in F&O markets collectively lost Rs 1.81 lakh crore during this period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-key-takeaways-from-drhp-ntpc-share-price-target-icici-securities-2605071-2024-09-23",
      "headline": "NTPC Green Energy IPO: Key takeaways from DRHP, NTPC share price targetNTPC Green Energy aims to raise Rs 10,000 crore through this public issue, which will consist solely of a fresh issue without any offer-for-sale component."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-positive-investor-sentiment-foreign-inflows-us-economy-federal-reserve-2604983-2024-09-23",
      "headline": "Sensex ends nearly 400 points higher, Nifty above 25,900The S&P BSE Sensex was down 384.30 points at the closing bell, while the NSE Nifty50 gained 148.10 points to settle at 25,939.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dotpe-security-lapse-api-hack-puts-sensitive-data-of-popular-restaurants-social-at-risk-2604964-2024-09-23",
      "headline": "X user highlights API flaw in DotPe, removes post after legal noticeAccording to tweets shared by social media users, DotPe's entire API was left public, meaning anyone could access sensitive information without any authentication."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-ceo-jensen-huang-ai-india-moment-pm-modi-us-visit-meet-tech-leaders-2604894-2024-09-23",
      "headline": "'This is India's moment': Nvidia's Jensen Huang after meeting PM Modi in USNvidia CEO Jensen Huang was one of 15 tech leaders who met with PM Modi during his visit to the United States."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/high-courts/story/karnataka-high-court-dismisses-chief-minister-siddaramaiah-plea-challenging-legality-governor-probe-order-muda-land-scam-2605466-2024-09-24",
      "headline": "Blow to Siddaramaiah, court upholds Governor's nod to probe him for land 'scam'The Karnataka High Court dismissed Chief Minister Siddaramaiah's plea, challenging the legality of the Governor's approval to probe him in the MUDA land scam case. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/badlapur-rape-accused-encounter-police-maharashtra-blame-game-2605429-2024-09-24",
      "headline": "Badlapur encounter sparks blame game: 'How handcuffed accused opened fire?'The custodial death of the Badlapur sexual assault accused has set the political temperatures soaring in Maharashtra ahead of crucial Assembly elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/odisha-army-officer-fiancee-custodial-assault-army-veterans-police-spat-2605517-2024-09-24",
      "headline": "Odisha custodial assault case sparks Army vs police social media spatThe woman has alleged that she was sexually assaulted at an Odisha police station, while her fiancée, an Army officer, was illegally locked up in a cell by the police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/yogeshwar-dutt-vinesh-phogat-apologise-olympic-disqualification-haryana-2605428-2024-09-24",
      "headline": "Vinesh Phogat should have apologised, not cried conspiracy: Yogeshwer DuttSpeaking to India Today's sister channel, AajTak, Olympic medalist Yogeshwar Dutt lashed out at Vinesh Phogat for creating false narratives about her Olympic disqualification. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/atishi-empty-chair-loaded-question-aap-arvind-kejriwal-delhi-cm-government-election-bjp-2605505-2024-09-24",
      "headline": "Atishi, an empty chair, and a loaded questionAtishi took charge as the chief minister of Delhi and sat next to an empty chair meant for Arvind Kejriwal. It is distinct from the Bharat-Ram pious act, and a clear show of sycophancy. But the bigger question -- as the CM, is Atishi supposed to be working for the people of Delhi or just one individual?      "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/siddaramaiah-karnataka-muda-land-scam-case-high-court-bjp-resignation-chief-minister-2605512-2024-09-24",
      "headline": "MUDA land scam: BJP demands Siddaramaiah's resignation, Congress says conspiracyThe Karnataka High Court dismissed his petition, challenging the legality of the Governor's decision to prosecute him over alleged irregularities in the Mysuru Urban Development Authority (MUDA) scheme."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/railway-employees-arrested-gujarat-surat-train-track-tampering-case-police-felicitation-2605403-2024-09-24",
      "headline": "3 rail staffers arrested in Surat over 'sabotage' plot to get felicitatedThree railway trackmen were arrested in Gujarat's Surat district for alleged tampering with tracks and then alerting authorities over a \"sabotage attempt\" in order to get themselves felicitated."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-news-yogi-adityanath-government-eateries-to-install-cctv-cameras-display-owners-name-fresh-guidelines-2605541-2024-09-24",
      "headline": "UP mandates chefs, waiters to wear masks and gloves; CCTVs at all eateriesThe initiative includes an extensive inspection campaign, where police verification of every staff member — whether at a small roadside dhaba or a high-end restaurant — will become mandatory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-olympiad-susan-polgar-praggnanandhaa-vaishali-mother-viral-photo-2605415-2024-09-24",
      "headline": "Amazing Chess Mom: Chess legend's shoutout after India's Olympiad double delightAt the 2024 Chess Olympiad in Hungary, chess legend Susan Polgar had the opportunity to meet and greet Nagalakshmi, the mother of Indian chess stars Praggnanandhaa and Vaishali. Polgar expressed her excitement at meeting the 'amazing chess mom' and posed for a memorable photograph with the family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hezbollah-rocket-attacks-israeli-strikes-lebanon-middle-east-tensions-gaza-war-2605318-2024-09-24",
      "headline": "Israeli strikes kill 492 in Lebanon, Hezbollah fires 200 rockets in retaliationLebanon attacks Israel: The ongoing Israel-Hezbollah conflict has triggered fears of an all-out war in the region since the Gaza conflict erupted on October 7 last year as several countries called for restraint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/chandrayaan-3/story/chandrayaan-3s-pragyan-rover-discovered-more-than-an-ancient-crater-on-the-moon-2605446-2024-09-24",
      "headline": "Pragyan rover discovered more than an ancient crater on the MoonThe rover, tasked with exploring the lunar surface, reported an ancient crater close to its landing site, but that was not all that the images revealed. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-pipaliya-dohad-district-school-principal-kills-girl-sexual-assault-arrested-2605448-2024-09-24",
      "headline": "Gujarat school principal kills girl for resisting rape, dumps body; arrestedThe principal said that when he tried to rape the girl, she started screaming. He put his hands on her mouth tightly to stop her screaming. However, the girl died, following which he hid her in the back of the car. He took her body and left it inside the school compound in the evening, after the classes were over."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-paris-fashion-week-debut-greets-fans-with-flying-kiss-aishwarya-rai-bachchan-eva-longoria-2605361-2024-09-24",
      "headline": "Watch: Alia Bhatt owns the runway on Paris Fashion Week debutAlai Bhatt made a stunning debut at the Paris Fashion Week on September 23. The actor looked beautiful in a black jumpsuit with metallic silver bustier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-record-high-markets-2605385-2024-09-24",
      "headline": "Sensex crosses 85,000 for 1st time, Nifty hits record highAs of 10:05 AM, the S&P BSE Sensex had risen 80.74 points to 85,009.35, while the NSE Nifty50 was up 29.15 points to 25,968.20.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/badlapur-sex-abuse-accused-akshay-shinde-police-encounter-dead-thane-kindergarten-girls-timeline-2605464-2024-09-24",
      "headline": "Badlapur sex abuse accused killed in police encounter: A timeline of eventsAkshay Shinde, who sexually abused two kindergarten girls at a school in Badlapur, was shot dead in a police encounter after he snatched a gun from a policeman and opened fire. Here's a timeline of the events from the Badlapur incident to the encounter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tirupati-laddoos-row-telangana-devotee-tobacco-tirumala-temple-animal-fat-2605321-2024-09-24",
      "headline": "Devotee claims tobacco in Tirupati laddu, temple authority says allegation fakeThe woman, a resident of Andhra Pradesh, claimed she found tobacco wrapped in paper inside a laddu that was given to her as prasadam at Sri Venkateswara temple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-auto-driver-installs-office-chair-on-his-seat-for-extra-comfort-2605478-2024-09-24",
      "headline": "Bengaluru auto driver installs office chair on his seat for 'extra comfort'A Bengaluru auto driver has won the internet by installing an office chair on his seat in the vehicle just for some extra comfort. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-murder-case-husband-of-woman-mahalakshmi-suspects-lover-role-in-murder-2605289-2024-09-24",
      "headline": "Husband of Bengaluru woman found inside fridge suspects lover's role in murderThe estranged husband of the woman, Mahalakshmi, said that she had an illicit relationship with a man, identified as Ashraf, and that he may have been involved in the gruesome murder."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/byjus-faces-setback-us-court-delaware-upholds-usd-12-billion-loan-default-ruling-glas-trust-llc-2605485-2024-09-24",
      "headline": "Byju's faces setback as US court upholds $1.2 billion loan default rulingThe court's decision supports an earlier ruling made by the Delaware Court of Chancery, which allowed the company's lenders, represented by Glas Trust LLC, to seize control of Byju's Alpha Inc"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ey-employee-death-probe-maharashtra-labour-commission-officials-inspect-ernst-young-pune-office-anna-perayil-death-2605412-2024-09-24",
      "headline": "Maharashtra officials inspect EY's Pune office after employee's death EY faces scrutiny over the death of a 26-year-old charter accountant, which has triggered a social media storm and pushed the government to initiate a probe into allegations of a \"backbreaking\" workload. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/earths-crust-dripping-beneath-turkiye-being-reshaped-2605520-2024-09-24",
      "headline": "Earth's crust 'dripping' beneath Turkiye, being reshapedTurkiye lies at the convergence of multiple tectonic plates, making it a seismically active region. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-rescue-mission-crew-9-launch-nasa-spacex-space-station-2605425-2024-09-24",
      "headline": "Sunita Williams rescue mission launch faces Tropical Cyclone NineThe mission is being launched with two astronauts and two spare seats for stranded astronauts Sunita Williams and Butch Willmore to return in February 025. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/thane-dombivali-fruit-seller-video-urinates-arrested-shop-market-maharashtra-2605372-2024-09-24",
      "headline": "Video: Thane fruit seller urinates in bag, resumes selling without washing handsThe fruit-seller, Ali Khan, continued to sell fruits without washing his hands after urinating inside the plastic bag, a video of which went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-india-olympiad-win-garry-kasparov-viswanathan-anand-d-gukesh-2605380-2024-09-24",
      "headline": "Vishy's children are all grown up: Garry Kasparov praises India's Olympiad winFormer world champion Garry Kasparov heaped praise on the Indian contingent after the double gold at the Chess Olympiad. Kasparov claimed that Viswanathan Anand's 'children' had all grown up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-congratulates-indian-chess-team-after-historic-olympiad-victory-2605523-2024-09-24",
      "headline": "Amitabh Bachchan congratulates Indian chess team after historic Olympiad victoryBollywood actor Amitabh Bachchan celebrated the Indian chess team's groundbreaking win at the 45th Chess Olympiad by congratulating them on social media. The team secured its first gold medal in the open category, marking a historic achievement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tirupati-laddu-controversy-karthi-pawan-kalyan-clash-2605499-2024-09-24",
      "headline": "Actor Karthi apologises after Pawan Kalyan blasts him for comment on Tirupati ladduThe Tirupati laddu controversy has escalated, drawing in notable figures from both the film industry and politics. Actor Karthi's remarks on this sensitive issue have sparked a strong reaction from Pawan Kalyan, prompting the Paruthiveeran actor to apologise to the Andhra Pradesh Deputy Chief Minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anupam-kher-shares-cv-linkedin-calls-himself-struggling-actor-2605527-2024-09-24",
      "headline": "Anupam Kher shares his CV on LinkedIn, calls himself a struggling actorVeteran actor Anupam Kher updated his resume on LinkedIn. The CV offered a glimpse of the actor's professional journey and personal challenges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-on-actors-demanding-rs-40-crore-for-kill-film-budget-was-rs-40-crore-2605522-2024-09-24",
      "headline": "Karan Johar on stars demanding Rs 40 crore for Kill: Film's budget was Rs 40 croreKaran Johar revealed actors demanded Rs 40 crore for Kill, the film's entire budget. He said he has stopped meeting hefty fee demands, citing the need for fair pay in the industry."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-likely-to-be-released-from-indias-test-squad-for-irani-cup-2605542-2024-09-24",
      "headline": "Sarfaraz Khan likely to be released from India's Test squad for Irani Cup Ajinkya Rahane is all set to lead Ranji Trophy champions Mumbai in the upcoming Irani Cup game against Rest of India in Lucknow. Sarfaraz Khan is likely to be released from India's Test team to participate in Irani Cup for Mumbai/ "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-3rd-odi-live-streaming-when-and-where-to-watch-live-2605530-2024-09-24",
      "headline": "England vs Australia 3rd ODI Live Streaming: When and where to watch liveEngland and Australia will face each other for the 3rd ODI match on Tuesday. Australia lead the 5-match ODI series 2-0 against the hosts England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-apex-council-meeting-jay-shah-new-secretary-agenda-sponsor-nca-2605519-2024-09-24",
      "headline": "New BCCI secretary appointment not on September 25 apex council meeting agendaIn Wednesday's apex council meeting, the BCCI office-bearers are unlikely to discuss the appointment of a new secretary. Jay Shah, who was unanimously elected as the International Cricket Council chief, will vacate the position in December. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/all-female-panel-of-match-officials-announced-for-womens-t20-world-cup-2024-2605501-2024-09-24",
      "headline": "All-female panel of match officials announced for Women's T20 World Cup 2024An all-female panel of match officials has been announced by the ICC for the Womem's T20 World Cup. The tournament will kick off from October 3 till 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-pitch-black-soild-spinners-2605486-2024-09-24",
      "headline": "Axar Patel vs Kuldeep Yadav on Kanpur pitch with black soilIndia vs Bangladesh: The second Test is set to be played on a black-soil pitch at Green Park. India will be tempted to play three spinners. The home team opted for three pacers and two spinners in the first Test on a red-soil pitch in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/germany-boss-julian-nagelsmann-left-shocked-by-marc-ter-stegen-injury-2605469-2024-09-24",
      "headline": "Germany boss Julian Nagelsmann left 'shocked' by Marc Ter Stegen injuryGermany boss Julian Nagelsmann has claimed that he was left shocked by the injury sustained by Marc-Andre Ter Stegen. The German goalkeeper sustained the injury during Barca's 5-1 win over Villareal in LaLiga. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/yogeshwar-dutt-vinesh-phogat-apologise-olympic-disqualification-haryana-2605428-2024-09-24",
      "headline": "Vinesh Phogat should have apologised, not cried conspiracy: Yogeshwer DuttSpeaking to India Today's sister channel, AajTak, Olympic medalist Yogeshwar Dutt lashed out at Vinesh Phogat for creating false narratives about her Olympic disqualification. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-captain-heather-knight-handed-suspended-fine-over-2012-racist-photo-2605426-2024-09-24",
      "headline": "England captain Heather Knight handed suspended fine over 2012 racist photoEngland women's cricket team captain Heather Knight has been handed a suspended fine for her racist blackface photo from 2012. Knight received a reprimand along with her fine of 1000 pounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-olympiad-susan-polgar-praggnanandhaa-vaishali-mother-viral-photo-2605415-2024-09-24",
      "headline": "Amazing Chess Mom: Chess legend's shoutout after India's Olympiad double delightAt the 2024 Chess Olympiad in Hungary, chess legend Susan Polgar had the opportunity to meet and greet Nagalakshmi, the mother of Indian chess stars Praggnanandhaa and Vaishali. Polgar expressed her excitement at meeting the 'amazing chess mom' and posed for a memorable photograph with the family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-citys-rodri-set-to-miss-rest-of-season-with-acl-tear-reports-2605398-2024-09-24",
      "headline": "Manchester City's Rodri set to miss rest of season with ACL tear: ReportsManchester City have suffered a huge blow to their bid to retain the Premier League crown as midfielder Rodri is set to miss the rest of the season due to an anterior cruciate ligament tear. The Spaniard suffered the injury during the draw against Arsenal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-jasprit-bumrah-fittest-cricketer-virat-kohli-social-media-2605388-2024-09-24",
      "headline": "R Ashwin responds to Bumrah's 'fittest' remark after after social media stormR Ashwin, speaking in his YouTube show, said it's not fair to compare a fast bowler with a batter as he addressed the furore over Jasprit Bumrah's 'fittest cricketer 'remark. Ashwin said Bumrah is the çrown jewel' of Indian cricket and that the pacer has the right to express his views. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/yogeshwar-dutt-vinesh-phogat-apologise-olympic-disqualification-haryana-2605428-2024-09-24",
      "headline": "Vinesh Phogat should have apologised, not cried conspiracy: Yogeshwer DuttSpeaking to India Today's sister channel, AajTak, Olympic medalist Yogeshwar Dutt lashed out at Vinesh Phogat for creating false narratives about her Olympic disqualification. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-captain-heather-knight-handed-suspended-fine-over-2012-racist-photo-2605426-2024-09-24",
      "headline": "England captain Heather Knight handed suspended fine over 2012 racist photoEngland women's cricket team captain Heather Knight has been handed a suspended fine for her racist blackface photo from 2012. Knight received a reprimand along with her fine of 1000 pounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-olympiad-susan-polgar-praggnanandhaa-vaishali-mother-viral-photo-2605415-2024-09-24",
      "headline": "Amazing Chess Mom: Chess legend's shoutout after India's Olympiad double delightAt the 2024 Chess Olympiad in Hungary, chess legend Susan Polgar had the opportunity to meet and greet Nagalakshmi, the mother of Indian chess stars Praggnanandhaa and Vaishali. Polgar expressed her excitement at meeting the 'amazing chess mom' and posed for a memorable photograph with the family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-citys-rodri-set-to-miss-rest-of-season-with-acl-tear-reports-2605398-2024-09-24",
      "headline": "Manchester City's Rodri set to miss rest of season with ACL tear: ReportsManchester City have suffered a huge blow to their bid to retain the Premier League crown as midfielder Rodri is set to miss the rest of the season due to an anterior cruciate ligament tear. The Spaniard suffered the injury during the draw against Arsenal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-jasprit-bumrah-fittest-cricketer-virat-kohli-social-media-2605388-2024-09-24",
      "headline": "R Ashwin responds to Bumrah's 'fittest' remark after after social media stormR Ashwin, speaking in his YouTube show, said it's not fair to compare a fast bowler with a batter as he addressed the furore over Jasprit Bumrah's 'fittest cricketer 'remark. Ashwin said Bumrah is the çrown jewel' of Indian cricket and that the pacer has the right to express his views. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-india-olympiad-win-garry-kasparov-viswanathan-anand-d-gukesh-2605380-2024-09-24",
      "headline": "Vishy's children are all grown up: Garry Kasparov praises India's Olympiad winFormer world champion Garry Kasparov heaped praise on the Indian contingent after the double gold at the Chess Olympiad. Kasparov claimed that Viswanathan Anand's 'children' had all grown up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2007-final-india-vs-pakistan-ms-dhoni-gautam-gambhir-johannesburg-2605369-2024-09-24",
      "headline": "On This Day: India become inaugural T20 World Cup champions by beating PakistanOn this day in 2007, India defeated arch-rivals Pakistan in a thrilling final to become the inaugural T20 World Cup champions at the Wanderers stadium in Johannesburg. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/davis-cup-2024-rafael-nadal-carlos-alcaraz-doubles-spain-squad-david-ferrer-2605358-2024-09-24",
      "headline": "'Nadalcaraz' reunion in Davis Cup quarters? Spain captain David Ferrer reactsSpain captain David Ferrer has reacted to the possibility of seeing Rafael Nadal and Carlos Alcaraz teaming up during the Davis Cup quarterfinals. Nadal was included in the Spain squad for the quarters on Monday, September 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-2024-25-late-goals-surprises-northeast-united-punjab-fc-mohammedan-sc-2605333-2024-09-24",
      "headline": "Late goals and surprises: Is ISL 2024 the season for the underdogs?The 2024-2025 Indian Super League has kicked off with thrilling last-minute goals, unpredictable match outcomes, and rising competitiveness. New teams like Punjab FC and NorthEast United have shaken up the league, making this season one of the most exciting yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/davis-cup-finals-rafael-nadal-returns-spain-squad-carlos-alcaraz-2605325-2024-09-24",
      "headline": "Rafael Nadal in Spain squad for Davis Cup quarterfinals alongside Carlos AlcarazRafael Nadal will be part of the Spain squad for the Davis Cup finals alongside Carlos Alcaraz, the Royal Spanish Tennis  Federation announced on Monday, September 23. Nadal last competed in the Paris Olympics 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-mohunbagan-super-giants-northeast-united-durand-cup-revenge-kolkata-2605269-2024-09-23",
      "headline": "Mohun Bagan complete Durand revenge after tense 3-2 win over NorthEast UnitedMohun Bagan Super Giants completed a dramatic 3-2 comeback against NorthEast United in an ISL thriller at Salt Lake Stadium, with Jason Cummings' late strike sealing the win after a controversial equalizer by skipper Shubhashish Bose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-olympiad-viswanathan-anand-d-gukesh-bumps-into-airport-humorous-tweet-2605228-2024-09-23",
      "headline": "Vishy Anand bumps into Gukesh after Chess OlympiadChess legend Viswanathan Anand shared a humorous moment with young grandmaster D Gukesh at Budapest airport after Gukesh's second Olympiad gold win. Anand, full of praise, sees Gukesh as a future World Championship contender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-pat-cummins-gamechanger-rishabh-pant-quiet-2605223-2024-09-23",
      "headline": "Pat Cummins focusing on keeping 'gamechanger' Rishabh Pant quietAustralia Test captain Pat Cummins said that he was focused on Rishabh Pant ahead of the Border Gavaskar Trophy. Pant made a sensational Test comeback against Bangladesh and is expected to be crucial in India's success Down Under.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/davis-cup-finals-rafael-nadal-returns-spain-squad-carlos-alcaraz-2605325-2024-09-24",
      "headline": "Rafael Nadal in Spain squad for Davis Cup quarterfinals alongside Carlos AlcarazRafael Nadal will be part of the Spain squad for the Davis Cup finals alongside Carlos Alcaraz, the Royal Spanish Tennis  Federation announced on Monday, September 23. Nadal last competed in the Paris Olympics 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-mohunbagan-super-giants-northeast-united-durand-cup-revenge-kolkata-2605269-2024-09-23",
      "headline": "Mohun Bagan complete Durand revenge after tense 3-2 win over NorthEast UnitedMohun Bagan Super Giants completed a dramatic 3-2 comeback against NorthEast United in an ISL thriller at Salt Lake Stadium, with Jason Cummings' late strike sealing the win after a controversial equalizer by skipper Shubhashish Bose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-olympiad-viswanathan-anand-d-gukesh-bumps-into-airport-humorous-tweet-2605228-2024-09-23",
      "headline": "Vishy Anand bumps into Gukesh after Chess OlympiadChess legend Viswanathan Anand shared a humorous moment with young grandmaster D Gukesh at Budapest airport after Gukesh's second Olympiad gold win. Anand, full of praise, sees Gukesh as a future World Championship contender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-pat-cummins-gamechanger-rishabh-pant-quiet-2605223-2024-09-23",
      "headline": "Pat Cummins focusing on keeping 'gamechanger' Rishabh Pant quietAustralia Test captain Pat Cummins said that he was focused on Rishabh Pant ahead of the Border Gavaskar Trophy. Pant made a sensational Test comeback against Bangladesh and is expected to be crucial in India's success Down Under.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rishabh-pant-vs-ms-dhoni-ravichandran-ashwin-ravindra-jadeja-home-dominance-sledging-room-2605218-2024-09-23",
      "headline": "Rishabh Pant vs MS Dhoni, Ashwin-Jadeja role in home dominance Wicketkeeper-batter Rishabh Pant's stunning Test century against Bangladesh reignited debates about his standing among India's greatest keeper-batters. In the Sledging Room Podcast, experts discussed whether Pant could surpass MS Dhoni as India's top Test wicketkeeper-batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/emotional-daniel-ricciardo-teary-eyed-in-potential-goodbye-from-formula-1-2605215-2024-09-23",
      "headline": "Emotional Daniel Ricciardo 'teary-eyed' in potential goodbye from Formula 1Former Red Bull driver Daniel Ricciardo was emotional after the Singapore GP. The driver was teary-eyed knowing well that the race could have been his final one in Formula One career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/from-nanha-to-star-how-pro-kabaddi-league-transformed-narenders-life-2605189-2024-09-23",
      "headline": "From 'Nanha' to star: How Pro Kabaddi League transformed Narender's lifeIn a small village in Haryana, a young boy nicknamed 'Nanha' spent his days watching older kids practice kabaddi. Little did anyone know that this curious child would one day become one of the sport's rising stars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pcb-connection-camp-gary-kirsten-pride-back-in-cricket-2605188-2024-09-23",
      "headline": "Bring pride back to Pakistan cricket: Gary Kirsten demands 3 vital changesPakistan head coach Gary Kirsten has demanded three major changes in Pakistan cricket after Day 1 of the Connection Camp arranged by the PCB. In the camp, the management and select players sat down together to discuss the roadmap for cricket in Pakistan.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}