{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ford-pauses-shipments-of-suvs-sports-cars-and-other-models-to-china-glbs-2711296-2025-04-19",
      "headline": "Ford pauses shipments of SUVs, sports cars and other models to ChinaFord has halted exports of key US-built vehicles to China amid rising tariffs and trade tensions, impacting a once-profitable segment of its business, WSJ reports. Engine shipments, however, continue. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-gst-on-upi-transactions-over-rs-2000-government-calls-claims-false-baseless-2711204-2025-04-18",
      "headline": "No GST on UPI transactions over Rs 2,000, government clarifiesUPI payments, especially those made to merchants, currently don't attract any extra charges like GST."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-bank-cuts-fd-and-savings-rates-check-what-is-new-2711065-2025-04-18",
      "headline": "ICICI Bank cuts FD and savings rates. Check what's newIf you have a savings account with ICICI Bank, you'll now earn slightly less. For balances below Rs 50 lakh, the new interest rate is 2.75% per annum, down from 3%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-layoff-lets-go-of-240-new-recruits-offers-free-upskilling-report-2711006-2025-04-18",
      "headline": "Infosys lets go of 240 new recruits, offers free upskilling: ReportThe impacted employees joined the company in October 2024 as part of a training batch. The freshers were hired for two roles; System Engineers (SE) and Digital Specialist Engineers (DSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-tariff-war-nvidia-ceo-jensen-huang-keep-serving-chinese-firms-massive-ai-chip-export-loss-2710980-2025-04-18",
      "headline": "Nvidia to keep serving Chinese firms despite massive AI chip export lossHuang's statement comes at a time when the United States has tightened rules around exporting advanced chips to China. The restrictions, announced under the Donald Trump administration, are part of an ongoing trade war between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-change-your-tax-regime-while-filing-itr-heres-what-you-should-know-2710978-2025-04-18",
      "headline": "Want to change your tax regime while filing ITR? Here's what you should knowLet's say you had earlier chosen the old tax regime, but now the new regime appears more beneficial after reviewing your finances. Can you change it when filing your ITR? Let's find out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-denies-job-bias-against-us-employees-calls-allegations-misleading-report-2710927-2025-04-18",
      "headline": "TCS denies job bias against US employees, calls allegations 'misleading': ReportThe complaints have mostly come from workers in the US who are over 40 and not of non-South Asian ethnic backgrounds. They believe TCS chose them for layoffs during the tech industry slowdown, while keeping younger Indian workers on H-1B visas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-fraud-blusmart-shuts-down-why-reasons-anmol-puneet-singh-jaggi-sebi-expose-2710898-2025-04-18",
      "headline": "How Jaggi brothers squandered borrowed money, killed BluSmartSebi's interim order exposed how the Jaggi brothers may have taken investors for a ride, not in an EV, but in a web of financial mismanagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-you-open-two-ppf-accounts-check-details-2710891-2025-04-18",
      "headline": "Can you open two PPF accounts? Check detailsThe combined yearly deposit in both your PPF account and that of your child's account cannot go beyond Rs 1.5 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-strategy-backfiring-weaker-us-dollar-explained-2710868-2025-04-18",
      "headline": "Trump started the tariff war. Now a weak dollar has him on the back footAs Trump's tariff strategy faces mounting challenges, a weakening dollar and rising inflation threaten to undermine his economic goals, forcing the US into a precarious position as global trade tensions escalate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-backs-india-stance-on-tariffs-presses-us-china-on-fair-trade-2710848-2025-04-18",
      "headline": "IMF backs India's stance on tariffs, presses US-China on fair tradeAmid rising global tensions, the IMF sees India's moves on tariffs as a rare bright spot, urging the world's largest economies to rebuild trust and strengthen a fair trade system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/life-insurance-claim-rejection-what-to-do-easy-steps-expert-view-2710841-2025-04-18",
      "headline": "Life insurance claim rejected? Here's how to get it correctGetting an insurance claim approved has become a nightmare nowadays. Nithin Kamath, in a post, also said that many avoid life insurance because policies as they are confusing and getting harder to understand."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-box-office-collection-day-1-detailed-report-akshay-kumar-film-off-to-decent-start-amid-positive-response-2711339-2025-04-19",
      "headline": "Kesari 2 box office Day 1: Akshay's film off to decent start amid positive responseAkshay Kumar and R Madhavan's 'Kesari Chapter 2' is expecting a weekend push amid a positive response from the audience after opening on a decent note at the box office.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/martha-stewart-shades-katy-perrys-space-ride-with-throwback-zero-gravity-video-glbs-2711307-2025-04-19",
      "headline": "Martha Stewart shades Katy Perry's space ride with throwback zero-gravity videoMartha Stewart subtly mocked Katy Perry's brief spaceflight by posting her own zero-gravity experience from 2006. The post reignited debate over celebrity space tourism and whether it merits the title \"astronaut.\"\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jordan-peeles-him-turns-nfl-glory-into-nightmare-in-new-horror-thriller-glbs-2711298-2025-04-19",
      "headline": "Jordan Peele's 'Him' turns NFL glory into nightmare in new horror thrillerJordan Peele's upcoming horror film Him follows a young footballer's twisted comeback under a mysterious NFL star's guidance, blending sports, fame, and psychological horror. It hits theaters on September 19.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sean-diddy-combs-sex-trafficking-trial-to-begin-may-5-judge-denies-delay-glbs-2711289-2025-04-19",
      "headline": "Sean 'Diddy' Combs' trial to begin May 5 despite push for postponementA judge denied Sean \"Diddy\" Combs' request to delay his sex trafficking trial, set for May 5. He faces serious charges spanning two decades, which he denies as consensual encounters.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-kashyap-issues-apology-after-controversial-remark-on-brahmins-amid-phule-row-2711264-2025-04-18",
      "headline": "No action worth your daughter: Anurag Kashyap apologises for Brahmin remarkFilmmaker Anurag Kashyap has issued a public apology following a controversial remark about Brahmins in the wake of the ongoing 'Phule' controversy. Late Friday night, Kashyap shared a lengthy note on social media, revealing that his family had been receiving rape and death threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-performs-daring-helicopter-stunt-in-new-mission-impossible-clip-2711227-2025-04-18",
      "headline": "Watch: Tom Cruise performs daring helicopter stunt in new Mission Impossible clipTom Cruise takes on one of his most challenging stunts yet in 'Mission: Impossible – The Final Reckoning'. With no stunt double, Cruise navigates a helicopter through rugged terrain, showcasing his dedication to authentic action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyaps-ill-urinate-on-brahmins-comment-sparks-outrage-amid-phule-row-2711226-2025-04-18",
      "headline": "Anurag Kashyap's controversial remark on Brahmins sparks outrage amid Phule rowAmidst the ongoing debates about the upcoming film 'Phule', Anurag Kashyap's provocative comment has sparked outrage. The film, depicting the Phule couple's fight against caste and gender inequality, is now delayed for further dialogue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-enjoys-month-long-vacation-in-italy-set-to-resume-shooting-in-june-2711187-2025-04-18",
      "headline": "Prabhas enjoys month-long vacation in Italy, set to resume shooting in JunePan-India star Prabhas is on a month-long holiday in Italy to recharge after a hectic filming schedule, and will return in June to resume work on his upcoming projects including The Raja Saab and Fauji."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/makers-of-sunny-deol-jaat-controversial-church-scene-christians-demand-ban-on-film-2711188-2025-04-18",
      "headline": "Sunny Deol's 'Jaat' drops controversial scene after Christians demand ban on filmThe makers of Sunny Deol's 'Jaat' have removed a controversial scene depicting Randeep Hooda standing inside a church. This comes after the Christian community said that the scene hurt their religious sentiments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/revisiting-hospital-playlist-why-the-show-still-manages-to-strike-a-chord-2711171-2025-04-18",
      "headline": "Revisiting Hospital Playlist: Why the show still manages to strike a chord'Hospital Playlist' debuted quietly in 2020 but quickly became a beloved series for its authentic portrayal of friendship among five doctors. Created by Shin Won-ho and Lee Woo-jung, it offered a rare glimpse into the emotional resilience of healthcare professionals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/retro-trailer-suriya-goes-on-rampage-in-this-80s-styled-karthik-subbaraj-thriller-2711184-2025-04-18",
      "headline": "Retro trailer: Suriya goes on rampage in this 80s-styled Karthik Subbaraj thrillerThe 'Retro' trailer showcases Suriya in a gritty role, blending action and drama. Directed by Kartik Subbaraj, the film explores themes of love, loyalty, and violence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/penn-badgley-on-hollywoods-unrealistic-sex-scenes-theyre-stylised-shallow-2711101-2025-04-18",
      "headline": "Penn Badgley on Hollywood's unrealistic sex scenes: They're stylised, shallowActor Penn Badgley, widely known for his role as Joe Goldberg in 'You', critiqued the media industry for its portrayal of intimacy on screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raghav-chadha-vibes-to-wife-parineeti-chopras-viral-reel-trend-actor-reacts-2711170-2025-04-18",
      "headline": "Raghav Chadha vibes to wife Parineeti Chopra's viral reel trend, actor reactsAAP MP Raghav Chadha recently vibed on wife Parineeti Chopra's viral reel. The actor's comment on the video caught the attention of all. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/veera-dheera-sooran-part-2-ott-release-chiyaan-vikram-film-when-and-where-to-watch-2711140-2025-04-18",
      "headline": "Veera Dheera Sooran Part 2 OTT release: When and where to watch Chiyaan Vikram film'Veera Dheera Sooran: Part 2'  is set to release on Prime Video. The OTT platform announced the release of Chiyaan Vikram's tamil action thriller, which is set to begin streaming from April 24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-temple-remark-angers-badrinath-priests-2711102-2025-04-18",
      "headline": "Urvashi Rautela's 'temple in my name' remark angers Badrinath priests, localsA video of actor Urvashi Rautela referring to a temple in Uttarakhand as being made in \"her\" name has gone viral. This has angered local priests, religious officials and residents of the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-you-should-watch-court-state-vs-a-nobody-priyadarshi-pulikonda-nani-2711037-2025-04-18",
      "headline": "Why Telugu courtroom drama 'Court' deserves your undivided attention'Court - State vs. A Nobody' on Netflix is a gripping Telugu film that delves deep into the harsh realities of love and societal biases. It powerfully portrays the misuse of the POCSO Act while highlighting class divides, making it a thought-provoking watch that lingers long after the credits roll."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/crushology-101-review-roh-jeong-eui-k-drama-is-no-stress-high-flirt-2711096-2025-04-18",
      "headline": "Crushology 101 review: Roh Jeong-eui's K-drama is all flirt, no stressReleased-Mon Apr 14, 2025Crushology 101 review: 'Crushology 101' brings back the classic K-drama rom-com vibe with its light-hearted plot and charming characters, making it a perfect escape from intense drama, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/my-hero-academia-youre-next-ott-release-when-where-to-watch-upcoming-film-2711064-2025-04-18",
      "headline": "My Hero Academia You're Next OTT release: When, where to watch upcoming film'My Hero Academia: You're Next' hits Netflix India on April 20, 2025. The anime film follows Izuku Midoriya post-UA Traitor arc as he faces a new villain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-gauri-spratt-enjoy-evening-shikhar-dhawan-and-his-rumoured-girlfriend-2711078-2025-04-18",
      "headline": "Aamir Khan-Gauri enjoy evening with Shikhar Dhawan and his rumoured girlfriendAamir Khan and Gauri Sgirlfind pratt enjoyed an evening with cricketer Shikhar Dhawan and his rumoured girlfriend Sophie Shine. A picture from their outing has gone viral. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/several-dead-dozens-feared-trapped-as-4-storey-building-collapses-mustafabad-delhi-2711315-2025-04-19",
      "headline": "4 dead, dozens feared trapped as 4-storey building collapses in DelhiAccording to the police, at least 14 people have been rescued so far. Rescue teams from the NDRF, firefighters, and Delhi Police have rushed to the spot. The police further said that they are probing the cause behind the building's collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-kashyap-issues-apology-after-controversial-remark-on-brahmins-amid-phule-row-2711264-2025-04-18",
      "headline": "No action worth your daughter: Anurag Kashyap apologises for Brahmin remarkFilmmaker Anurag Kashyap has issued a public apology following a controversial remark about Brahmins in the wake of the ongoing 'Phule' controversy. Late Friday night, Kashyap shared a lengthy note on social media, revealing that his family had been receiving rape and death threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/half-of-us-student-visa-cancellations-involve-indians-says-legal-association-2711231-2025-04-18",
      "headline": "Half of US student visa cancellations involve Indians, says legal associationAn increasing number of Indian students in the US have their visas revoked abruptly, causing alarm among family members and education stakeholders. Indian students, as reported by American Immigration Lawyers Association (AILA) policy brief, make up almost half of the total reported student visa revocations.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/hindu-community-leader-bhabesh-chandra-roy-kidnapped-from-home-beaten-to-death-in-bangladesh-2711334-2025-04-19",
      "headline": "Hindu community leader kidnapped from home, beaten to death in BangladeshBhabesh Chandra Roy was unconscious when he was sent back home and family members rushed him to a hospital in Dinajpur. However, he was declared dead upon arrival."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/white-house-fixes-maryland-deportee-kilmar-garcia-headline-us-senator-chris-van-hollen-el-salvador-visit-2711261-2025-04-18",
      "headline": "White House 'fixes' NYT headline on wrongly deported manThe White House slammed Democrat Senator Chris Van Hollen for meeting alleged MS-13 member Kilmar Abrego Garcia in El Salvador. The White House also rebranded a New York Times headline with fiery edits of its own."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indian-army-probe-soldiers-manhandle-civilians-jammu-kashmir-search-operation-2711062-2025-04-18",
      "headline": "Army probes 'manhandling' of civilians by jawans, PDP claims professor assaultedThe incident allegedly happened when an Army team was conducting search operations after receiving input on the likely movement of terrorists in a vehicle in Rajouri."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/if-i-die-gaza-photojournalist-fatima-hassouna-killed-in-airstrike-her-final-wish-glbs-2711303-2025-04-19",
      "headline": "Gaza journalist's last wish before being killed in airstrike: Want a loud deathFatima Hassouna, 25, a Palestinian photojournalist, was killed in an Israeli airstrike along with 10 family members, including her pregnant sister. Days before her wedding, her life was cut short - one of countless lives lost in the ongoing conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/jee-mains-result-2025-session-2-out-check-direct-link-to-scorecard-toppers-2710695-2025-04-19",
      "headline": "JEE Mains Result 2025 Session 2 out: Check direct link to scorecard, toppersThe JEE Main result 2025 for session 2 has been declared by NTA today. Candidates can now check scores, ranks, and download scorecards from the official site jeemain.nta.nic.in, or check the direct links here. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-fund-cuts-us-harvard-university-striking-very-idea-international-students-american-education-2711045-2025-04-18",
      "headline": "Trump is striking at the very idea of Harvard, its international studentsPresident Donald Trump is out with a sledgehammer and striking at the very core of Harvard University, an institution older than the USA. Harvard has been synonymous with American education, politics and society. The reason why Harvard is world-class is that it attracts the world's best brains. That's what Trump is seeking to pull the plug on.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-fly-international-space-station-axiom-mission-may-science-minister-jitendra-singh-remark-2711232-2025-04-18",
      "headline": "More than a flight: Science Minister on Shubhanshu Shukla's journey to space in MayShubhanshu Shukla will serve as the pilot aboard the SpaceX Dragon spacecraft, becoming the first Indian to live and work at the International Space Station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-cinnnaswamy-woes-home-form-cost-title-2711323-2025-04-19",
      "headline": "Kings on road, paupers at home: RCB's Chinnaswamy woes could cost them titleRCB continues to make the same mistakes at home as they suffered a third loss at the Chinnaswamy stadium on April 18 against PBKS. With their eyes on an elusive first title, Bengaluru need to make the Chinnaswamy a fortress quickly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-badaun-woman-elopes-with-daughter-father-in-law-2711271-2025-04-18",
      "headline": "Mother of four elopes with daughter's father-in-law in UPIn Uttar Pradesh's Badaun, a 43-year-old woman eloped with her daughter's 46-year-old father-in-law. Her husband, a truck driver, used to come home only once or twice a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-box-office-collection-day-1-detailed-report-akshay-kumar-film-off-to-decent-start-amid-positive-response-2711339-2025-04-19",
      "headline": "Kesari 2 box office Day 1: Akshay's film off to decent start amid positive responseAkshay Kumar and R Madhavan's 'Kesari Chapter 2' is expecting a weekend push amid a positive response from the audience after opening on a decent note at the box office.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/gurugram/story/gurugram-hospital-technician-arrested-air-hostess-sex-assault-case-2711285-2025-04-19",
      "headline": "Gurugram hospital technician arrested for sex assault on air hostessThe air hostess had alleged that she was sexually assaulted while she was admitted to a private hospital in Gurugram. A technician, who has been working at the hospital for five months, has been arrested."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/who-is-dr-nikku-madhusudhan-indian-origin-scientist-behind-possible-alien-life-discovery-2711291-2025-04-19",
      "headline": "Who is Dr Nikku Madhusudhan? Indian-origin scientist behind possible alien life discoveryA team led by Dr Nikku Madhusudhan, a Cambridge University astrophysicist of Indian origin, has identified intriguing chemical signatures in the planet's atmosphere, most notably dimethyl sulphide (DMS)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/harpreet-singh-happy-passia-fbi-arrest-suspected-links-pakistan-isi-khalistani-terror-group-babbar-khalsa-international-2711148-2025-04-18",
      "headline": "FBI flags terrorist Happy Passia's links to Pak spy agency, Khalistani groupThe Punjab Police called Happy Passia's arrest by the FBI a \"major milestone in the sustained crackdown on ISI-backed terror networks\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-reaction-stand-name-wankhede-stadium-ipl-2025-2711338-2025-04-19",
      "headline": "Unreal feeling: Rohit Sharma honoured to have stand named after himDuring the inauguration of the Mumbai T20 League, Rohit Sharma said he was honoured after getting a stand named after him at the iconic Wankhede Stadium in Mumbai.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-474-18-04-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-may-recognise-crimea-as-russian-in-peace-deal-with-ukraine-report-glbs-2711312-2025-04-19",
      "headline": "US may recognise Crimea as Russian in peace deal with Ukraine: ReportThe US may recognise Crimea as Russian in a proposed Ukraine peace deal. Trump is pushing for a ceasefire but warns the US could walk away. Kyiv refuses to give up territory, and allies remain cautious as talks continue behind the scenes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/makers-of-sunny-deol-jaat-controversial-church-scene-christians-demand-ban-on-film-2711188-2025-04-18",
      "headline": "Sunny Deol's 'Jaat' drops controversial scene after Christians demand ban on filmThe makers of Sunny Deol's 'Jaat' have removed a controversial scene depicting Randeep Hooda standing inside a church. This comes after the Christian community said that the scene hurt their religious sentiments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-dc-match-preview-predicted-xi-pitch-report-weather-conditions-2711327-2025-04-19",
      "headline": "High-flyers Gujarat, Delhi face off in battle of contenders in AhmedabadIPL 2025, GT vs DC Match Preview: The high-flying GT and DC will square off at the Narendra Modi stadium in a battle of title contenders in IPL 2025. With both teams having superstars in their ranks, expect a thrilling contest in Ahmedabad on Saturday, April 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-weather-forecast-national-capital-sees-heavy-spell-of-rain-more-showers-may-keep-city-cooler-over-weekend-2711333-2025-04-19",
      "headline": "Delhi sees heavy spell of rain, more showers may keep capital cooler over weekendLooking ahead to the weekend, the IMD has forecast partly cloudy skies on Saturday, with the possibility of light rain or drizzle, as well as thunderstorms, lightning, and dust storms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/terrorist-happy-passia-interpol-blue-notice-on-nia-request-2711278-2025-04-18",
      "headline": "Happy Passia had Interpol's Blue Notice against him on NIA's request: ReportGangster-turned-terrorist Harpreet Singh, who was recently arrested in the US, had Interpol's Blue Notice issued against him on the request of the National Investigation Agency (NIA)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/seelampur-murder-delhi-teenager-lady-don-zikra-under-probe-2711222-2025-04-18",
      "headline": "Seelampur murder: Who is 'Lady Don' Zikra, prime suspect in 17-year-old's killing?Zikra, the prime suspect in the murder case of a 17-year-old in Delhi's Seelampur, previously worked as a bouncer for jailed gangster Hashim Baba's wife."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-top-order-batters-play-20-overs-josh-hazlewood-2711340-2025-04-19",
      "headline": "RCB's top 5-6 batters must bat for 20 overs: Josh Hazlewood on fixing home woesIPL 2025: Josh Hazlewood believes that RCB's fortunes at home can change if the top five to six batters play out the full 20 overs, controlling the innings and setting up a stronger platform for success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-reaction-stand-name-wankhede-stadium-ipl-2025-2711338-2025-04-19",
      "headline": "Unreal feeling: Rohit Sharma honoured to have stand named after himDuring the inauguration of the Mumbai T20 League, Rohit Sharma said he was honoured after getting a stand named after him at the iconic Wankhede Stadium in Mumbai.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-dc-delhi-capitals-hemang-badani-on-jake-fraser-mcgurk-2711336-2025-04-19",
      "headline": "DC's fine start to IPL 2025 gives us cushion to back Fraser-McGurk: BadaniDC coach Hemang Badani feels that the team's fine start to IPL 2025 has given them the cushion to continue backing Jake Fraser-McGurk despite his poor form. Fraser-McGurk has struggled to get going this season after his impressive IPL 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-dc-match-preview-predicted-xi-pitch-report-weather-conditions-2711327-2025-04-19",
      "headline": "High-flyers Gujarat, Delhi face off in battle of contenders in AhmedabadIPL 2025, GT vs DC Match Preview: The high-flying GT and DC will square off at the Narendra Modi stadium in a battle of title contenders in IPL 2025. With both teams having superstars in their ranks, expect a thrilling contest in Ahmedabad on Saturday, April 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-cinnnaswamy-woes-home-form-cost-title-2711323-2025-04-19",
      "headline": "Kings on road, paupers at home: RCB's Chinnaswamy woes could cost them titleRCB continues to make the same mistakes at home as they suffered a third loss at the Chinnaswamy stadium on April 18 against PBKS. With their eyes on an elusive first title, Bengaluru need to make the Chinnaswamy a fortress quickly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/alexander-zverev-munich-open-heckler-2711302-2025-04-19",
      "headline": "Alexander Zverev asks umpire to throw out heckler at Munich OpenGerman star Alexander Zverev complained to umpire Fergus Murphy after a fan heckled him during his Munich Open quarterfinal match on Friday against Tallon Griekspoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-tim-david-rcb-vs-pbks-bengaluru-2711295-2025-04-19",
      "headline": "Tim David rewarded with POTM award despite RCB's defeat to PBKSIPL 2025, RCB vs PBKS: Despite Bengaluru losing by 5 wickets, Tim David was rewarded with the Player of the Match award for scoring an unbeaten 50 and taking two catches against Punjab Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-yuzvendra-chahal-shreyas-iyer-bengaluru-2711292-2025-04-19",
      "headline": "Chahal's IPL 2025 turnaround: Shreyas Iyer reveals chat with PBKS spinnerPBKS skipper Shreyas Iyer revealed the chat he had with Yuzvendra Chahal as the leg-spinner continues his comeback in the IPL 2025 season. Chahal picked up two wickets against RCB on Friday, April 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-rajat-patidar-tim-david-bengaluru-highlights-2711288-2025-04-19",
      "headline": "RCB's disastrous home run continues as PBKS triumph in rain-marred gameIPL 2025, RCB vs PBKS: Royal Challengers Bengaluru (RCB) lost their third match in a row at home as Punjab Kings (PBKS) won by five wickets in the rain-marred contest on Friday at the M Chinnaswamy Stadium in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-memes-virat-kohli-tim-david-bengaluru-2711277-2025-04-18",
      "headline": "Vintage RCB is back: Memes galore as PBKS run through hosts in BengaluruFans on social media trolled RCB after they crumbled against PBKS at the Chinnaswamy stadium on Friday, April 18. The likes of Virat Kohli, Rajat Patidar and others failed on the night as RCB scored 95 in the 14-over game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-arshdeep-singh-virat-kohli-history-2711259-2025-04-18",
      "headline": "Arshdeep Singh gets Virat Kohli after scripting history for Punjab KingsIPL 2025, RCB vs PBKS: Arshdeep Singh took the wicket of Phil Salt to become the all-time top wicket-taker for the Punjab Kings, after which he also accounted for the wicket of Virat Kohli. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-tim-david-rcb-vs-pbks-bengaluru-2711295-2025-04-19",
      "headline": "Tim David rewarded with POTM award despite RCB's defeat to PBKSIPL 2025, RCB vs PBKS: Despite Bengaluru losing by 5 wickets, Tim David was rewarded with the Player of the Match award for scoring an unbeaten 50 and taking two catches against Punjab Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-yuzvendra-chahal-shreyas-iyer-bengaluru-2711292-2025-04-19",
      "headline": "Chahal's IPL 2025 turnaround: Shreyas Iyer reveals chat with PBKS spinnerPBKS skipper Shreyas Iyer revealed the chat he had with Yuzvendra Chahal as the leg-spinner continues his comeback in the IPL 2025 season. Chahal picked up two wickets against RCB on Friday, April 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-rajat-patidar-tim-david-bengaluru-highlights-2711288-2025-04-19",
      "headline": "RCB's disastrous home run continues as PBKS triumph in rain-marred gameIPL 2025, RCB vs PBKS: Royal Challengers Bengaluru (RCB) lost their third match in a row at home as Punjab Kings (PBKS) won by five wickets in the rain-marred contest on Friday at the M Chinnaswamy Stadium in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-memes-virat-kohli-tim-david-bengaluru-2711277-2025-04-18",
      "headline": "Vintage RCB is back: Memes galore as PBKS run through hosts in BengaluruFans on social media trolled RCB after they crumbled against PBKS at the Chinnaswamy stadium on Friday, April 18. The likes of Virat Kohli, Rajat Patidar and others failed on the night as RCB scored 95 in the 14-over game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-arshdeep-singh-virat-kohli-history-2711259-2025-04-18",
      "headline": "Arshdeep Singh gets Virat Kohli after scripting history for Punjab KingsIPL 2025, RCB vs PBKS: Arshdeep Singh took the wicket of Phil Salt to become the all-time top wicket-taker for the Punjab Kings, after which he also accounted for the wicket of Virat Kohli. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}