{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-proposes-retaliatory-duties-at-world-trade-body-against-us-tariffs-on-autos-2750911-2025-07-04",
      "headline": "India proposes retaliatory duties at world trade body against US tariffs on autosIndia has proposed to impose an equivalent amount of duty collected from products originating in the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/real-estate-vs-mutual-funds-where-should-you-invest-explains-stock-market-expert-2750826-2025-07-04",
      "headline": "Real Estate vs Mutual Funds: Where should you invest, explains stock market expertOwning a house was once every family's dream, but times have changed. With high prices and new ways to invest, is real estate still smart, or are mutual funds better? A stock market expert explains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/video/ankur-mehra-book-pixels-to-profits-creators-must-think-like-startups-not-influencers-2750822-2025-07-04",
      "headline": "Ankur Mehra says creators must think like startups, not influencersAnkur Mehra, in his new book Pixels to Profits, urges creators to stop chasing follower counts and instead build sustainable, multi-platform businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/success-isnt-about-number-of-followers-in-creator-economy-ankur-mehra-2750781-2025-07-04",
      "headline": "Success isn't about number of followers in creator economy: Ankur MehraIn a conversation with Business Today's Sakshi Batra, Ankur Mehra, author of Pixels to Profits, explains what it really takes to succeed in the creator economy, and why chasing viral fame or follower counts may be the wrong metric altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-192-points-higher-nifty-below-25500-infosys-gains-1-percent-2750774-2025-07-04",
      "headline": "Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/prada-kolhapuri-chappal-gi-tag-law-protection-indian-articrafts-artisans-reform-global-policy-fashion-2750757-2025-07-04",
      "headline": "India tags it, West sells it. Can Prada's Kolhapuri row lead to real reform?The luxury brand's new \"toe-ring sandal\" has ignited not just cultural outrage but also legal action in India, with a Public Interest Litigation filed in the Bombay High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-itr-2-and-itr-3-forms-why-they-are-missing-and-what-to-do-income-tax-filing-2750711-2025-07-04",
      "headline": "Where are ITR-2 and ITR-3 forms? Why they're missing and what to doIt's ITR season but many taxpayers can't find the ITR-2 and ITR-3 forms on the Income Tax portal yet. If you have capital gains, foreign income or business income, this delay might worry you. The good news is there's an extended deadline this year. Here's why these forms are missing and what you should do next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sbi-credit-card-rules-changing-from-july-15-here-is-what-cardholders-must-know-2750616-2025-07-04",
      "headline": "SBI credit card rules changing from July 15: Here's what cardholders must knowAt present, many cardholders pay only a small part of their bill to avoid late charges. But now, the way the minimum amount due (MAD) is calculated will change starting July 15, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/exclusive-world-bank-poverty-in-india-measurement-metrics-one-in-four-below-minimum-standard-of-living-2750607-2025-07-04",
      "headline": "One in 4 Indians still below minimum standard of living: World BankDespite a sharp drop in extreme poverty, about one in four Indians still falls below the level needed to meet essential needs and maintain a minimum standard of living."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-ban-jane-street-stock-manipulation-bank-nifty-options-futures-shorting-reason-interim-order-2750597-2025-07-04",
      "headline": "Sebi bans Jane Street for stock market manipulation. Here's what went wrongUS Trading Firm Jane Street: Securities and Exchange Board of India (Sebi) said the trades executed by the group were \"prima facie fraudulent and manipulative\" and violated the country's capital market regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-rs-36-lakh-in-5-years-know-who-can-avail-this-government-scheme-national-savings-certificate-nsc-2750564-2025-07-04",
      "headline": "Want Rs 36 lakh in 5 years? Know who can avail this government schemeThis government scheme offers guaranteed returns, so you don't have to worry about market ups and downs. For the current quarter, the interest rate is fixed at 7.7% per year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/soham-parekh-us-startups-multiple-jobs-moonlighting-why-reasons-latest-update-2750540-2025-07-04",
      "headline": "Why did Soham Parekh work multiple jobs? Indian techie shares his reasonsHe confirmed that he worked at several companies simultaneously and misrepresented his location and employment status in the process."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/battle-of-galwan-reaction-fans-celebrate-salman-khan-in-uniform-welcome-bhaijaans-comeback-2750907-2025-07-04",
      "headline": "Battle of Galwan reaction: Fans celebrate Salman Khan in uniform, welcome Bhaijaan's comebackFans celebrated Salman Khan's comeback on Friday as the Bollywood superstar shared the first motion poster of his upcoming film 'Battle Of Galwan.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/battle-of-galwan-motion-poster-salman-khan-looks-fierce-first-look-uniform-2750896-2025-07-04",
      "headline": "Battle of Galwan first look: Salman Khan is intense, fierce in uniformSalman Khan shared the motion poster of his upcoming film 'Battle of Galwan'. The story is based on one of India's most brutal battles fought without a single bullet being fired."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/girls-day-bang-minah-to-marry-on-ju-wan-kdrama-actor-2750848-2025-07-04",
      "headline": "Girl's Day's Bang Minah, actor On Ju-wan set to get marriedK-pop band Girl's Day member Bang Minah and South Korean actor On Ju-wan's agencies have announced their plans to get married. The two worked together in a popular Kdrama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-to-begin-shooting-for-cocktail-2-in-august-2750841-2025-07-04",
      "headline": "Exclusive: Kriti Sanon to begin shooting for Cocktail 2 in AugustKriti Sanon has wrapped up shooting for 'Tere Ishk Mein' and is set to begin filming 'Cocktail 2' in August. After an intense schedule, the actor is currently taking a short break before diving into her next project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/amal-clooney-praises-supportive-husband-george-clooney-amid-split-rumours-2750830-2025-07-04",
      "headline": "Amal Clooney praises supportive husband George Clooney amid split rumoursAmal Clooney opened up about her family life with husband George Clooney, highlighting their strong bond and mutual support amid rumours of a rift. She shared that they continue to prioritise privacy for their children. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/who-is-nikita-luther-winner-of-the-traitors-alongside-uorfi-javed-2750713-2025-07-04",
      "headline": "Who is Nikita Luther, winner of The Traitors alongside Uorfi Javed?Poker player Nikita Luther is now the winner of the reality TV show 'The Traitors'. She won the show alongside social media influencer Uorfi Javed. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/ed-questions-telugu-producer-allu-aravind-for-3-hours-in-rs-101-crore-ramakrishna-electronics-bank-fraud-2750823-2025-07-04",
      "headline": "ED questions Telugu film producer Allu Aravind for 3 hours in bank fraud caseTelugu film producer Allu Aravind was questioned by the ED for three hours in a Rs 101.4 crore bank fraud case involving Ramakrishna Electronics and RTPL. The ED seized properties, froze accounts, and uncovered evidence of fund diversion.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/jitendra-kumar-to-neena-gupta-panchayat-stars-rock-vintage-sportswear-2750806-2025-07-04",
      "headline": "Jitendra Kumar to Neena Gupta, Panchayat stars rock vintage sportswear. PicsAfter winning everyone's hearts with its simple story and light-hearted humour, Panchayat Season 4 is ready to impress again! This time, new photos from a fun Pickleball-themed photoshoot are going viral on social media. The pictures feature Jitendra Kumar, Neena Gupta, Sanvikaa, Chandan Roy, Faisal Malik, Durgesh Kumar, and Ashok Pathak in a sporty and stylish tennis court setting. Dressed in vintage-style sports outfits with sweatbands, visors, and rackets, the cast looks both playful and fashionable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/scarlett-johansson-would-do-jurassic-part-rebirth-even-if-i-am-dying-in-next-five-minutes-2750816-2025-07-04",
      "headline": "Scarlett Johansson would've done Jurassic World even if she died in first 5 minutesScarlett Johansson has fulfilled her long-held wish to be part of the Jurassic franchise with a lead role in 'Jurassic World: Rebirth'. The BAFTA-winning actor explained how she got to play the lead in the latest film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-anxiously-waiting-for-anshula-kapoor-return-post-engagement-2750709-2025-07-04",
      "headline": "Boney Kapoor anxiously waiting for Anshula's return from New York after engagementInfluencer Anshula Kapoor, recently announced her engagement to partner Rohan Thakkar. Her father and film producer Boney Kapoor reacted to the news along with other family members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thammudu-review-nithiin-action-drama-wild-ambitions-tame-execution-venu-sriram-wasted-opportunity-2750779-2025-07-04",
      "headline": "Thammudu review: Wild ambitions but tamed execution in Nithiin's survival thrillerRelease Date:Fri Jul 04, 2025'Thammudu' movie review: Despite an intriguing premise and a visually rich setting, 'Thammudu' struggles with coherence, emotional depth, and narrative impact. What could have been a gripping one-night survival thriller turns into a long, meandering ride with fleeting moments of brilliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-concert-in-india-are-we-ready-to-create-history-with-a-bts-concert-army-speaks-2750543-2025-07-04",
      "headline": "Is India ready to create history with a BTS concert? ARMY weighs inIndia's love for BTS is loud, loyal, and impossible to ignore. With HYBE now entering the Indian market, the dream of a BTS concert feels closer than ever. In this week's K-fix, we discuss whether India is ready to host a show of that scale right now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-fangirls-over-brad-pitt-f1-javier-bardem-2750782-2025-07-04",
      "headline": "Kareena Kapoor fangirls over Brad Pitt in F1: Who wants to be 20…Bollywood actor Kareena Kapoor has expressed her admiration for Brad Pitt after watching 'F1', joining fellow star Deepika Padukone in praising the Hollywood icon. The movie, centred around Formula One racing, has garnered positive reviews and strong box office success since its release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amaal-mallik-says-bollywood-doing-to-kartik-aryan-what-it-did-to-sushant-singh-rajput-2750738-2025-07-04",
      "headline": "Bollywood doing to Kartik Aryan what it did to Sushant Singh Rajput: Amaal MallikAmaal Mallik alleged that Bollywood is trying to sideline Kartik Aaryan just like it did with Sushant Singh Rajput. He claimed powerful producers and actors are targeting Kartik, despite his success and strong family support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-basu-metro-in-dino-hilarious-mirzapur-crossover-kaleen-bhaiya-guddu-bhaiya-scene-pankaj-tripathi-ali-fazal-2750743-2025-07-04",
      "headline": "Metro In Dino has a hilarious Mirzapur crossover you didn't see comingAnurag Basu has made 'Metro... In Dino' a nuanced narrative. But, the most hilarious scene in the film has nothing to do with its story or character, but with 'Mirzapur' and its iconic Guddu Bhaiya and Kaleen Bhaiya. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javed-on-being-slut-shamed-after-winning-the-traitors-hate-never-stopped-me-2750640-2025-07-04",
      "headline": "Uorfi Javed on being slut-shamed after winning The Traitors: Hate never stopped meA day after winning 'The Traitors', Influencer Uorfi Javed on Friday shared that she is being slut-shamed on social media. She expressed that hate never stopped her and never will. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/dua-lipa-romantic-italian-holiday-with-fiance-callum-turner-2750568-2025-07-04",
      "headline": "Dua Lipa's romantic Italian holiday with fiance Callum TurnerPop star Dua Lipa and her fiance Callum Turner went on a romantic getaway in Italy. Dua shared pictures of the couple on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sarzameen-trailer-prithviraj-sukumaran-ibrahim-ali-khan-tied-between-duty-family-karan-johar-kajol-dharma-productions-2750750-2025-07-04",
      "headline": "Sarzameen trailer: Ibrahim Ali Khan goes rogue against duty-bound father PrithvirajThe trailer of 'Sarzameen' starring Kajol, Prithviraj Sukumaran, and Ibrahim Ali Khan was released on Friday. The film will premiere on JioHotstar on July 25. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-kanwaljit-singh-mocks-air-india-prepares-a-will-before-flying-2750725-2025-07-04",
      "headline": "Actor Kanwaljit Singh mocks Air India, prepares a will before flyingActor Kanwaljit Singh shared a video mocking Air India, saying he had prepared his will before flying with the airline, days after its tragic crash. His remark comes amid a wave of public concern, with other celebrities like Raveena Tandon and Vir Das expressing support for the airline."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-does-not-speak-on-matters-of-religion-india-steers-clear-of-dalai-lama-succession-row-2750886-2025-07-04",
      "headline": "Government does not speak on matters of religion: India on Dalai Lama succession rowThe Indian government said that it does not take any position on matters of religious belief or practices. The statement comes amid a row over Tibetan spiritual leader Dalai Lama's succession plan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-express-forged-records-on-airbus-engine-fixes-report-2750798-2025-07-04",
      "headline": "Air India Express delayed Airbus engine fix, forged records: ReportAir India Express, in a statement, said that it had acknowledged the lapse to the Indian regulator and implemented \"remedial action and preventive measures.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/high-court-saif-ali-khan-plea-madhya-pradesh-ancestral-assets-enemy-property-2750865-2025-07-04",
      "headline": "Court rejects Saif's plea against move to label ancestral assets 'enemy property'The Madhya Pradesh High Court has set aside a trial court order that declared the Pataudi family, including actor Saif Ali Khan, as heirs to Rs 15,000-crore properties in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-3-updates-edgbaston-2750751-2025-07-04",
      "headline": "2nd Test, Day 3 Live: Smith and Brook take partnership towards 250England (ENG) vs India (IND), 2nd Test Day Live Updates: Harry Brook joins the party with a sensational Test hundred and helps England go past the 300-run mark in the second session of Day 3. Jamie Smith had already hit an 80-ball hundred and shared a 230-plus stand for the sixth wicket with Brook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/how-dalai-lama-successor-tibetan-buddhism-news-1959-secret-escape-china-assam-rifles-welcome-2750578-2025-07-04",
      "headline": "Dalai, dance and disguise: How Tibetan leader hoodwinked China, fled to IndiaIt was a Great Escape in 1959 from Lhasa's Norbulingka Palace, the summer seat of the Dalai Lama, the head of Tibetan Buddhism. Then just 23, the Dalai Lama had no option but to flee Tibet after it became clear that an invitation to a dance event was communist China's bid to imprison him. Disguised as a soldier, he hoodwinked Chinese soldiers and entered India after a gruelling two-week trek."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/soham-parekh-controversy-us-startups-fraud-verification-process-loopholes-2750853-2025-07-04",
      "headline": "Why Soham Parekh, the startup scammer, isn't the only one to blameSoham Parekh fraud case: Techie Soham Parekh is at the centre of a storm after he was found to be working for multiple US-based startups while staying in India. It has led to questions about the verification process and how it may be more than meets the eye."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-china-pakistan-updates-important-vectors-india-dgmo-talks-deputy-chief-of-army-staff-rahul-singh-2750708-2025-07-04",
      "headline": "China gave Pak live inputs on our vectors during Op Sindoor: Top Army generalTop Army general Rahul Singh said that during Operation Sindoor, India tackled a double whammy at the border, as Pakistan received real-time inputs of New Delhi's important vectors from China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/they-appreciate-english-act-against-hindi-devendra-fadnavis-slams-raj-thackerays-mns-over-marathi-violence-2750829-2025-07-04",
      "headline": "They appreciate English, act against Hindi: Devendra Fadnavis on Marathi violenceThey appreciate English, act against Hindi: Devendra Fadnavis slams Raj Thackeray's MNS over Marathi violence"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/battle-of-galwan-motion-poster-salman-khan-looks-fierce-first-look-uniform-2750896-2025-07-04",
      "headline": "Battle of Galwan first look: Salman Khan is intense, fierce in uniformSalman Khan shared the motion poster of his upcoming film 'Battle of Galwan'. The story is based on one of India's most brutal battles fought without a single bullet being fired."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-live-score-day-5-results-carlos-alcaraz-sabalenka-raducanu-2750747-2025-07-04",
      "headline": "Day 5 Live: Naomi Osaka crashes out, Alcaraz in focusWimbledon 2025 Day 5 Live Score and Updates: Anastasia Pavlyuchenkova came from a set down to defeat Naomi Osaka 3-6, 6-4, 6-4 on No.2 Court in a gripping battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dalai-lama-succession-plan-china-warns-india-against-interference-through-actions-words-2750789-2025-07-04",
      "headline": "China urges India to 'act cautiously' amid row over Dalai Lama's successor planChinese Foreign Ministry spokesperson Mao Ning said that India should exercise caution in its words and actions, stop interfering in China's internal affairs with Xizang-related issues and avoid impact on the improvement and development of the China-India relationship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/allahabad-high-court-rejects-hindu-sides-plea-to-declare-shahi-idgah-a-disputed-structure-2750740-2025-07-04",
      "headline": "Court rejects Hindu side's plea to declare Mathura Shahi Idgah disputed structureThe Allahabad High Court has dismissed a petition filed by the Hindu side seeking to declare the Shahi Masjid as a disputed structure. The petition was a part of the Shri Krishna Janmabhoomi case in Mathura."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/the-liver-doc-vidit-gujrathi-x-debate-who-is-a-doctor-in-india-anyway-2750849-2025-07-04",
      "headline": "Who's a doctor anyway? Vidit Gujrathi, The Liver Doc slug it outA Doctor's Day post by chess grandmaster Vidit Gujrathi has snowballed into a fiery debate about who is actually a \"doctor\" in India after The Liver Doc slammed him for celebrating his \"family of doctors\". Many even questioned if the post should have sparked the debate at all. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zohran-mamdani-socialist-image-may-face-scrutiny-over-mother-mira-nair-2-million-dollar-house-in-new-york-city-chelsea-2750847-2025-07-04",
      "headline": "Socialist Mamdani faces backlash over mother Mira Nair's $2-million houseZohran Mamdani, New York City's socialist mayoral candidate, may face public scrutiny over his family's wealth. The socialist candidate's mother, Mira Nair, owns a $2-million house in the city. Critics say Mamdani, who owns a four-acre plot in Uganda, is too privileged to be speaking of socialism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dk-shivakumar-neither-confirms-nor-denies-ambition-to-become-karnataka-cm-says-wills-follow-high-command-decision-2750799-2025-07-04",
      "headline": "Kabhi haan, kabhi naa: DK Shivakumar plays coy on chief ministerial ambitionAs Karnataka simmers with speculation over leadership change, Deputy Chief Minister DK Shivakumar walks a careful line, publicly pledging loyalty while neither confirming nor ruling out his ambition to take on the Chief Minister's chair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rahul-gandhi-photo-sanitary-pad-boxes-distributed-women-bihar-elections-congress-2750727-2025-07-04",
      "headline": "Congress's 'Padman' strategy with Rahul Gandhi's photo stirs row in BiharThe initiative is part of the Congress's broader women-centric outreach ahead of the Bihar Assembly election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/amal-clooney-praises-supportive-husband-george-clooney-amid-split-rumours-2750830-2025-07-04",
      "headline": "Amal Clooney praises supportive husband George Clooney amid split rumoursAmal Clooney opened up about her family life with husband George Clooney, highlighting their strong bond and mutual support amid rumours of a rift. She shared that they continue to prioritise privacy for their children. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/success-isnt-about-number-of-followers-in-creator-economy-ankur-mehra-2750781-2025-07-04",
      "headline": "Success isn't about number of followers in creator economy: Ankur MehraIn a conversation with Business Today's Sakshi Batra, Ankur Mehra, author of Pixels to Profits, explains what it really takes to succeed in the creator economy, and why chasing viral fame or follower counts may be the wrong metric altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/who-calls-for-50-percent-price-increase-on-sugary-drinks-alcohol-and-tobacco-by-2035-2750842-2025-07-04",
      "headline": "Increase prices of sugary drinks, alcohol, tobacco by 50%: WHOThe World Health Organisation is urging countries to increase taxes on sugary drinks, alcohol, and tobacco by 50% within the next decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/defence-proposals-army-navy-air-force-one-lakh-crore-cleared-operation-sindoor-2750752-2025-07-04",
      "headline": "In big boost after Op Sindoor, defence proposals worth Rs 1 lakh crore get nodThe Defence Acquisition Council (DAC), in its first meeting after India's Operation Sindoor, cleared 10 proposals to acquire military hardware worth Rs 1.05 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/90s-indian-candies-childhood-memories-phantom-poppins-mango-bite-2750852-2025-07-04",
      "headline": "Before skittles and snickers: These 90s candies were everything90s Indian candies were more than just sweets, they shaped childhood friendships and playground culture. These nostalgic treats evoke fond memories and highlight a simpler time in India's snack history."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/school-boy-critically-injured-after-bmtc-bus-hits-him-in-anekal-bengaluru-2750770-2025-07-04",
      "headline": "BMTC bus hits school boy trying to cross road, leaves him critically injuredA boy was critically injured in Bengaluru Urban district after being struck by a BMTC bus while crossing the road to board his school bus. Locals blame drivers of both buses for negligence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/plea-against-prada-for-copying-kolhapuri-chappals-design-in-latest-summer-collection-bombay-high-court-2750754-2025-07-04",
      "headline": "Say sorry, pay money: Plea against Prada for copying Kolhapuri chappal designThe plea seeks court to issue direction to Prada Group and Prada India Fashion Private Limited to issue a public apology, acknowledging the unauthorised use of the \"Kolhapuri Chappal\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-dmk-minister-mimics-sanskrit-chanting-criticises-rs-2500-crore-centres-grant-for-sanksrit-2750647-2025-07-04",
      "headline": "Tamil Nadu Minister mocks Sanskrit ritual chants: Who the hell understands itTamil Nadu DMK Minister EV Velu sparked debate by mocking Sanskrit chants during rituals and questioned the understanding of the language. He also criticised the Union government's Rs 2,500 crore allocation for Sanskrit development while Tamil received just Rs 167 crore."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-allows-pakistan-athletes-asia-cup-world-sports-events-protect-olympics-bid-2750914-2025-07-04",
      "headline": "Why India can't deny Pakistan entry to multilateral sporting events on its soilWith India's ambitious Olympic bid on the line, the government couldn't afford to block Pakistan from participating in multilateral sporting events on home soil-despite public outrage-fearing it could jeopardise the country's chances of hosting major global tournaments in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-vaibhav-suryavanshi-on-shubman-gills-double-century-2750909-2025-07-04",
      "headline": "Shubman Gill's double century ignites Vaibhav Suryavanshi's Test cricket dreamsIndia's teen batting sensation Vaibhav Suryavanshi revealed how Shubman Gill's double century against England during the 2nd Test has inspired him to play Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-arsenal-thomas-partey-rape-cases-metropolitan-police-services-2750904-2025-07-04",
      "headline": "Former Arsenal midfielder Thomas Partey charged with multiple rape casesBritish police on Friday charged former Arsenal footballer Thomas Partey with five counts of rape and one count of sexual assault, according to an official statement."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-diogo-jota-death-mohamed-salah-death-liverpool-2750897-2025-07-04",
      "headline": "Difficult to accept Diogo Jota won't be there: Mohamed Salah's tribute to forwardMohamed Salah paid a heartfelt tribute to Diogo Jota after the Liverpool forward's death in a car accident on Thursday, July 3. Jota and his brother passed away after their car crashed while the forward was heading back to England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-classic-friendship-dreams-bengaluru-2750889-2025-07-04",
      "headline": "Neeraj Chopra Classic: Fueled by dreams, friendships and hope for a better futureThe Neeraj Chopra Classic marks India's first international javelin tournament, blending Chopra's personal dream with a collective vision for the future of Indian athletics. Fueled by global camaraderie and a deep-rooted passion for the sport, it signals a bold new chapter for javelin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-second-test-harry-brook-hundred-edgbaston-2750883-2025-07-04",
      "headline": "Headingley redemption at Edgbaston: Harry Brook scores 9th Test hundredAfter being dismissed for 99 at Headingley, Harry Brook got to his ninth Test hundred during the Edgbaston Test on Friday, July 4. Brook got to his maiden hundred against India off 137 balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-launches-search-new-india-senior-mens-football-coach-2750864-2025-07-04",
      "headline": "AIFF opens applications for new India senior men's football coachThe All India Football Federation (AIFF) has officially opened applications for the position of head coach of the senior men's national football team, following the sudden departure of Spaniard Manolo Marquez. Aspiring candidates have until July 13 to apply, with the federation listing a comprehensive set of eligibility requirements and expectations for the role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jamie-smith-hits-joint-3rd-fastest-test-hundred-english-batter-2750854-2025-07-04",
      "headline": "Jamie Smith hits joint 3rd fastest Test hundred by an English batterEngland vs India: Jamie Smith hit the joint fourth-fastest Test hundred by an England batter, matching Harry Brook's effort against Pakistan in Rawalpindi in 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-second-test-prasidh-krishna-trolled-jamie-smith-edgbaston-2750851-2025-07-04",
      "headline": "Clueless, liability: Prasidh Krishna slammed after horrendous Edgbaston spellFans slammed Prasidh Krishna for his forgettable spell against England in the Edgbaston Test on Friday, July 4. The Indian pacer was taken apart by Jamie Smith on Day 3 of the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-classic-2025-live-streaming-details-timings-all-you-need-to-know-2750836-2025-07-04",
      "headline": "Neeraj Chopra Classic 2025: Live streaming and all you need to knowThe Neeraj Chopra Classic is all set to create history on Friday, July 5. Here's a look at all you need to know about the tournament set to take place in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-launches-search-new-india-senior-mens-football-coach-2750864-2025-07-04",
      "headline": "AIFF opens applications for new India senior men's football coachThe All India Football Federation (AIFF) has officially opened applications for the position of head coach of the senior men's national football team, following the sudden departure of Spaniard Manolo Marquez. Aspiring candidates have until July 13 to apply, with the federation listing a comprehensive set of eligibility requirements and expectations for the role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jamie-smith-hits-joint-3rd-fastest-test-hundred-english-batter-2750854-2025-07-04",
      "headline": "Jamie Smith hits joint 3rd fastest Test hundred by an English batterEngland vs India: Jamie Smith hit the joint fourth-fastest Test hundred by an England batter, matching Harry Brook's effort against Pakistan in Rawalpindi in 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-second-test-prasidh-krishna-trolled-jamie-smith-edgbaston-2750851-2025-07-04",
      "headline": "Clueless, liability: Prasidh Krishna slammed after horrendous Edgbaston spellFans slammed Prasidh Krishna for his forgettable spell against England in the Edgbaston Test on Friday, July 4. The Indian pacer was taken apart by Jamie Smith on Day 3 of the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-classic-2025-live-streaming-details-timings-all-you-need-to-know-2750836-2025-07-04",
      "headline": "Neeraj Chopra Classic 2025: Live streaming and all you need to knowThe Neeraj Chopra Classic is all set to create history on Friday, July 5. Here's a look at all you need to know about the tournament set to take place in Bengaluru."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}