{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gen-z-investment-trends-tips-stocks-mutual-funds-returns-building-wealth-risk-safety-2592928-2024-09-03",
      "headline": "Risk-takers or safety seekers: Deep dive into Gen Z investment trendsAccording to a report by a Chartered Financial Analyst (CFA), 55% of cryptocurrency investors are Gen Zs. Additionally, 41% of investments in stocks and 25% of investments in NFTs are made by Gen Zs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/intel-chipmaker-may-lose-position-bluechip-dow-jones-industrial-average-index-share-price-2592883-2024-09-03",
      "headline": "Intel at risk of losing spot in blue-chip Dow Jones index as shares plungeThe Dow Jones index, known for its price-weighted methodology, is heavily influenced by stock prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-flat-heavyweight-financials-gain-sbi-life-it-shares-falls-2592834-2024-09-03",
      "headline": "Sensex, Nifty end flat as investors remain cautious; financials gainThe S&P BSE Sensex closed 4.40 points lower to end at 82,555.44, while the NSE Nifty50 gained 1.15 points to close at 25,279.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ipo-investors-sebi-study-key-insights-selling-geographical-locations-2592832-2024-09-03",
      "headline": "Are IPO investors selling their stakes too soon? Sebi study reveals key insightsThe study also provided insights into the geographical distribution of IPO investors. It found that about 70% of IPO investors were from the top four states: Gujarat, Maharashtra, Rajasthan, and Uttar Pradesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-share-price-nifty-bonus-issue-target-price-moving-average-2592813-2024-09-03",
      "headline": "Can Reliance shares outperform Nifty with upcoming bonus issue?Despite RIL's 8% underperformance relative to the Nifty so far this quarter, and being underweight among mutual funds compared to its NSE200 weight, there are signs of resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/goldman-sachs-bullish-on-gold-investments-top-choice-china-us-rate-cut-2592789-2024-09-03",
      "headline": "Explained: Why Goldman Sachs sees gold as top investment choiceGoldman Sachs has adjusted its gold price target to $2,700, expecting it to reach this level by early 2025 instead of the end of 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/matrimony-share-price-surge-today-buyback-proposal-explained-2592772-2024-09-03",
      "headline": "Explained: Why Matrimony.com shares hit 52-week high in early tradeMatrimony.com shares were up 11.26% to Rs 828.95 on the Bombay Stock Exchange at 1:44 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gmp-power-and-urban-infra-share-price-5-percent-upper-circuit-2592750-2024-09-03",
      "headline": "Explained: Why GMR Power shares jumped 5% todayGMP Power share price: Year-to-date, the midcap stock has soared by 140%, and on August 30, it hit a 52-week high of Rs 140 per share. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/aadhaar-housing-finance-shares-jump-6-what-should-investors-do-2592738-2024-09-03",
      "headline": "Aadhaar Housing Finance shares jump over 8%. What should investors do? Aadhaar Housing Finance shares have gained sharply, rising more than 6% in intraday trade. Read on to know the factors driving the surge and what it means for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-details-price-band-issue-size-date-gmp-2592731-2024-09-03",
      "headline": "Bajaj Housing Finance IPO: Check price band, issue size, dates and GMPThe price band for Bajaj Housing Finance IPO is set between Rs 66 and Rs 70 per share. Retail investors must apply for a minimum of 214 shares, requiring a minimum investment of Rs 14,980."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-bank-india-gdp-growth-forecast-fy25-7-percent-positive-2592717-2024-09-03",
      "headline": "World Bank upgrades India's FY25 GDP forecast to 7%Looking ahead, the World Bank expects India's medium-term outlook to remain positive, with strong growth projected for FY26 and FY27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/premier-energies-shares-market-listing-multibagger-debut-retail-investors-target-price-stop-loss-2592709-2024-09-03",
      "headline": "Premier Energies shares turn multibagger on debut. What investors need to knowPremier Energies made a blockbuster debut, doubling IPO investors' wealth. Here's what you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hal-share-price-cabinet-clears-rs-26000-crore-order-brokerage-view-target-price-2592696-2024-09-03",
      "headline": "HAL shares soar as Cabinet clears Rs 26,000 crore order. Check target priceThe order is expected to boost HAL's order backlog from Rs 94,000 crore to Rs 1.2 lakh crore, providing strong revenue visibility, according to a report by Antique Stock Broking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/raymond-group-plans-2-ipo-listings-for-2-units-by-2025-report-2592680-2024-09-03",
      "headline": "Raymond Group plans IPO listings for apparel, real estate units by 2025: ReportRaymond Group IPOs: Chairman Gautam Singhania recently explained that the restructuring is intended to address what he described as \"subdued valuations\" due to the varied nature of Raymond's portfolio."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/gst-panel-recommends-tax-relief-for-foreign-airlines-2592674-2024-09-03",
      "headline": "GST panel recommends tax relief for foreign airlinesThis proposal follows extensive deliberations by the fitment committee and could offer substantial relief to foreign airlines currently facing tax demands from the Directorate General of GST Intelligence (DGGI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/premier-energies-share-price-list-at-120-percent-premium-book-profit-hold-sell-expert-view-2592672-2024-09-03",
      "headline": "Premier Energies shares turn multibagger on market debut: Hold or sell?Premier Energies listing: The shares opened at Rs 990 on the NSE, marking a premium of 120% over its issue price of Rs 450. The shares opened at a premium of 120.22% on BSE, listing at Rs 991."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/15-stocks-gains-200-percent-5-months-lcc-infotech-v-marc-india-enser-communications-2592670-2024-09-03",
      "headline": "These 15 stocks have gained over 200% in just 5 monthsAmong the top gainers, LCC Infotech has emerged as a standout, seeing its shares skyrocket by 362% from Rs 1.90 on March 28, 2024, to Rs 8.77 on August 30, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-reko-diq-gold-end-pakistan-economic-crisis-saudi-arabia-makes-bid-stake-2592664-2024-09-03",
      "headline": "Can Reko Diq's gold mine end Pakistan's economic crisis? Reko Diq is one of the world's largest undeveloped copper and gold reserves, with the potential to produce 200,000 tons of copper and 250,000 ounces of gold annually for over half a century."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/premier-energies-shares-make-bumper-d-street-debut-multibagger-lists-at-120-percent-premium-rs-991-2592643-2024-09-03",
      "headline": "Premier Energies doubles investors' wealth as shares list at 120% premiumPremier Energies listing: The shares opened at a premium of 120% on BSE, listing at Rs 991."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-after-record-highs-infosys-down-1-percent-2592637-2024-09-03",
      "headline": "Sensex, Nifty open flat after record highs; Infosys down 1% The S&P BSE Sensex lost 43.82 points to 82,516.02, while the NSE Nifty50 was down 7.95 points to 25,270.75. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/congress-aap-seat-sharing-haryana-assembly-polls-2592979-2024-09-03",
      "headline": "Congress, AAP reach in-principle understanding on Haryana alliance: SourcesThe Congress and AAP, who are part of the opposition INDIA bloc at the national level, had contested the Lok Sabha polls together in Haryana, Gujarat, Goa, Delhi and Chandigarh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nivin-pauly-charged-for-sexual-assault-2592995-2024-09-03",
      "headline": " Malayalam actor Nivin Pauly charged with sexual assaultProminent Malayalam actor Nivin Pauly has been accused of sexual assault by a woman from Neryamangalam. The case involves six accused, indicating a broader conspiracy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/netflix-opening-disclaimer-changed-ic-814-row-hijackers-names-2592857-2024-09-03",
      "headline": "'IC 814' row: Netflix adds real names of hijackers to opening disclaimerThe updated opening credits of Netflix series 'IC 814: The Kandahar Hijack' will now include the real names of all hijackers, including two terrorists whose 'Hindu' codenames had drawn criticism for the makers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/west-bengal-aparajita-woman-and-child-bill-anti-rape-pocso-act-difference-2592938-2024-09-03",
      "headline": "Explained: How Bengal's anti-rape bill differs from POCSO ActThe Aparajita Woman and Child Bill (West Bengal Criminal Laws and Amendment) 2024 includes provisions for the death penalty for those convicted of rape and murder. Here's how it differs from the POCSO Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/sultan-of-brunei-hassanal-bolkiah-luxury-cars-palace-pm-modi-visit-photos-2592841-2024-09-03",
      "headline": "The super rich Sultan of Brunei who hosts PM Modi in largest palace todayBrunei, strategically located on the island of Borneo, is smaller than Indian states like Sikkim and Tripura, but its Sultan's immense wealth and lavish lifestyle has repeatedly grabbed attention."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-student-killed-cow-vigilantes-aryan-mishra-cattle-smuggler-cctv-footage-2592866-2024-09-03",
      "headline": "CCTV shows cow vigilantes chasing Haryana teen's car. They killed him soon afterA Class 12 student, Aryan Mishra, was shot dead by five cow vigilantes in Faridabad after they mistook him for a cattle smuggler. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/centre-moves-supreme-court-mamata-banerjee-cisf-personnel-rg-kar-hospital-kolkata-doctor-rape-murder-2592942-2024-09-03",
      "headline": "Centre moves Supreme Court over 'poor arrangement' for CISF personnel at RG KarThe central government said that there are 92 CISF personnel stationed at RG Kar Hospital, including 54 female personnel, who are facing accommodation issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/new-presvu-eye-drops-to-eliminate-need-for-reading-glasses-approved-2592846-2024-09-03",
      "headline": "Eye drops that could eliminate the need for reading glasses approvedIndia's drug regulatory agency has approved new eye drops that can help remove reading glasses in people who have presbyopia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/porsche-nazi-germany-volkswagen-beetle-hitler-2592882-2024-09-03",
      "headline": "When Porsche supported Nazi Germany and designed Volkswagen Beetle for HitlerOfficially, history began for Porsche in 1950. But the company existed before that as a supplier for Hitler's war machine and Ferdinand Porsche was well known for his terms with Fuehrer Adolf Hitler. A lot of research is now inclined to the fact that the company has benefited much more from its Nazi ties than it has admitted to."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/video/sathyabama-welcomes-the-yorker-champion-jasprit-bumrah-2590772-2024-08-30",
      "headline": "Sathyabama welcomes the Yorker Champion Jasprit BumrahIn a memorable event, Sathyabama University had the honour of hosting one of India's most celebrated cricket icons, Mr. Jasprit Bumrah. The university's President, Dr. Marie Johnson, and Chancellor, Dr. Mariazeena Johnson, warmly welcomed the champion fast bowler, renowned for his impeccable yorkers, to the campus.\r\n\r\nThe atmosphere was electric as students gathered in large numbers, eager to catch a glimpse of the cricket sensation. Their excitement and enthusiasm were palpable, reflecting the immense respect and admiration they hold for Bumrah. His visit not only inspired the students but also created an unforgettable experience, further strengthening the bond between sports and academia at Sathyabama University."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/salil-kapoor-ex-president-atlas-cycles-shoots-self-lutyens-delhi-suicide-note-2592948-2024-09-03",
      "headline": "Ex-president of Atlas Cycles shoots self in Delhi, suicide note foundFormer Atlas Cycles president, Salil Kapoor (70), died allegedly by suicide at his Lutyen's Delhi home in APJ Abdul Kalam Marg on Tuesday afternoon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sebi-chief-madhabi-puri-buch-retirement-benefits-exceed-salary-icici-bank-congress-2592838-2024-09-03",
      "headline": "How can retirement benefits exceed salary? Congress's fresh charge at Sebi chiefCongress leader Pawan Khera claimed that Madhabi Buch's average annual salary at ICICI was Rs 1.30 crore. However, he questioned how her average pension and other retiral benefits turned out to be Rs 2.77 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/why-indians-of-all-ages-are-logging-out-of-the-rat-race-to-take-up-slow-living-2592349-2024-09-03",
      "headline": "Why Indians of all ages are logging out of the rat race to take up slow livingThe subtle art of doing nothing is gaining more attention, even in India, as people try to escape their fast-paced lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/free-aadhaar-card-update-deadline-deadline-september-14-2592941-2024-09-03",
      "headline": "Don't miss the free Aadhaar card update deadline. Apply by Sept 14The Unique Identification Authority of India (UIDAI) has extended the deadline for Aadhaar updates until September 14, 2024, allowing free online updates for Proof of Identity and Proof of Address documents. After this date, a fee will be charged for updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russian-missile-strike-poltava-dead-injured-ukraine-volodymyr-zelenskyy-2592898-2024-09-03",
      "headline": "41 killed, 180 injured in central Ukraine after Russia fires 2 ballistic missilesAt least 41 people were killed and over 180 suffered severe injuries after two Russian ballistic missiles struck an educational facility and a nearby hospital in Ukraine's Poltava region, President Volodymyr Zelenskyy claimed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/ic-814-survivors-first-hand-account-netflix-series-row-hijackers-name-2592920-2024-09-03",
      "headline": "Bhola, Shankar hijackers' code names: IC 814 survivors amid Netflix series rowNetflix series 'IC 814: The Kandahar Hijack' has found itself in trouble over the 'Hindu' codenames of the hijackers. However, first-hand accounts of the incident by two survivors revealed that the hijackers had indeed used assumed names.\r\n\r\nSpeaking to India Today TV, Rakesh, a survivor of the plane hijack, said, \"I have not seen the (Netflix) series. But I have heard about the controversies. The hijackers were Muslims but they used Hindu names as call names. It is not that Netflix used Hindu names, they are just showing what happened.\" \r\n\r\nPooja Kataria, another survivor, also corroborated the version. She said, \"Everything (shown in web series) is true, from the first day to last day. They used code names \"Chief, Doctor, Burger, Bhola, and Shankar\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/emergency-trailer-shows-how-kangana-ranaut-film-suffers-from-lack-of-focus-opinion-2593003-2024-09-03",
      "headline": "'Emergency' trailer shows how Kangana Ranaut's film suffers from lack of focus Kangana Ranaut, now a Member of Parliament, has remained in the spotlight more for her controversial statements than for her recent films. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-anti-rape-bill-assembly-mamata-banerjee-suvendu-adhikari-governor-president-2592786-2024-09-03",
      "headline": "Anti-rape bill: Trinamool, BJP put ball in each other's court for President nodSince criminal law comes under the Concurrent List, the legislation will require assent from the Bengal Governor and then the President."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/west-bengal-anti-rape-bill-mamata-banerjee-rg-kar-rape-murder-protest-opinion-justice-2592804-2024-09-03",
      "headline": "Why Mamata Banerjee shouldn't try to be the Chief Minister of IndiaMamata Banerjee needs to understand that she is the Chief Minister of West Bengal, and not of all of India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/iit-delhis-abu-dhabi-campus-inaugurated-with-52-students-2592885-2024-09-03",
      "headline": "IIT Delhi's Abu Dhabi campus inaugurated with 52 studentsIIT Delhi has opened its first international campus in Abu Dhabi, welcoming 52 students and launching partnerships with leading universities to boost academic collaboration and research."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/japanese-entrepreneur-daisuke-hori-claims-he-slept-for-30-minutes-a-day-for-12-years-to-boost-productivity-2592881-2024-09-03",
      "headline": "Japanese entrepreneur slept for 30 minutes a day for 12 years to boost productivityA Japanese entrepreneur has claimed that he slept for 30 minutes a day for 12 years to boost productivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/ic-814-archival-authenticity-meets-cinematic-drama-in-anubhav-sinha-netflix-show-2592870-2024-09-03",
      "headline": "Archival history meets cinematic exposure in Anubhav Sinha's 'IC 814'The choice of archival footage in Anubhav Sinha's 'IC 814: The Kandahar Hijack' is particularly effective. The shots of panic-stricken families, lamenting the lack of information from airport officials about their loved ones, are deeply felt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bangladesh-vs-pnajmul-hossain-shanto-shan-masood-rawalpindi-litton-das-mehidy-hasan-miraz-2592812-2024-09-03",
      "headline": "Bangladesh script history, complete 2-0 Test series sweep in PakistanBangladesh beat Pakistan by 6 wickets in the second Test at Rawalpindi Cricket Stadium in Rawalpindi to script a historic maiden Test series win over the Asian rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mumbai-entrepreneur-kritarth-mittal-hospitalised-after-embracing-a-hustle-culture-read-full-story-2592675-2024-09-03",
      "headline": "Mumbai entrepreneur, 25, hospitalised after adopting 'hustle culture'. Full storyA Mumbai-based entrepreneur, Kritarth Mittal, was hospitalised after he adopted a relentless work schedule and a poor lifestyle.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/director-anubhav-sinha-slams-journalist-when-asked-about-ic814-the-kandahar-hijack-controversy-2593021-2024-09-03",
      "headline": "Director Anubhav Sinha slams journalist after he asks about IC 814 controversyFilmmaker Anubhav Sinha, at a press meet for 'IC814', lashed out at a journalist when asked about the controversy surrounding the series. The show is currently streaming on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nivin-pauly-charged-for-sexual-assault-2592995-2024-09-03",
      "headline": " Malayalam actor Nivin Pauly charged with sexual assaultProminent Malayalam actor Nivin Pauly has been accused of sexual assault by a woman from Neryamangalam. The case involves six accused, indicating a broader conspiracy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/stree-2-director-amar-kaushik-says-bond-remains-unaffected-amid-credit-war-2592988-2024-09-03",
      "headline": "'Stree 2' director Amar Kaushik says bond remains 'unaffected' amid credit war'Stree 2' director Amar Kaushik speaks to IndiaToday.in about the cast's bond amid the reported credit war. The film was released on August 15 to massive commercial success. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-goat-beats-kamal-haasan-indian-2-in-advance-booking-sets-new-record-for-tamil-cinema-2592982-2024-09-03",
      "headline": "Thalapathy Vijay's 'GOAT' beats 'Indian 2' in advance booking, sets new recordThalapathy Vijay's 'Greatest of All Time' is releasing on Thursday, September 5, and it has already started creating records with advance bookings. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-we-shall-over-come-dressing-room-2593032-2024-09-03",
      "headline": "Watch: Bangladesh sing 'we shall overcome' after historic seriesBangladesh cricket team sang the popular song 'We Shall Overcome' after their historic series win against Pakistan. The team burst out in celebrations after securing a 2-0 win at Rawalpindi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajay-ratra-bcci-selector-salil-ankola-cac-2593001-2024-09-03",
      "headline": "Ajay Ratra replaces Salil Ankola as member of selection committeeThe BCCI announced Ajay Ratra as the new member of the men's team selection committee on Tuesday, 3 September. Ratra, who was a part of the coaching staff in India's ODI tour of South Africa will replace Salil Ankola."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendon-mccullum-new-england-white-ball-coach-ecb-reveals-2592985-2024-09-03",
      "headline": "England Test coach Brendon McCullum handed white-ball role as wellEngland and Wales cricket board has announced that Brendon McCullum will be taking over as the new white-ball coach of the England team, starting from January 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-jason-gillespie-2592972-2024-09-03",
      "headline": "Gillespie defends dropping Naseem, Shaheen after historic series lossPAK vs BAN: Pakistan head coach Jason Gillespie defended dropping Naseem Shah and Shaheen Afridi after their loss in the 2nd Test against Bangladesh. Gillespie said that the selection looked perfectly fine when Bangladesh were 26/6 in the 1st innings.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-points-table-pakistan-record-lowest-of-lows-bangladesh-make-rapid-rise-2592967-2024-09-03",
      "headline": "WTC Points Table: Pakistan record lowest of lows, Bangladesh make rapid riseThe recent 0-2 loss series loss against Bangladesh have pushed Pakistan down to the eighth spot in the WTC points table while Bangladesh have risen to the fourth spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-delhi-premier-league-north-delhi-strikers-women-beat-central-delhi-queens-2592968-2024-09-03",
      "headline": "Women's Delhi Premier League: North Delhi Strikers Women beat Central Delhi QueensUpasana Yadav was the star of the show as North Delhi Strikers Women defeated the Central Delhi Queens by 53 runs in their opening match of the women's Delhi Premier League on September 3, Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabbadi-league-season-11-to-start-from-october-18-with-3-city-caravan-format-2592937-2024-09-03",
      "headline": "Pro Kabbadi League Season 11 to start from October 18 with 3-city caravan formatThe Pro Kabaddi League season 11 is set to start from October 18 with a 3-city caravan format, the organisers announced on Tuesday, September 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ban-najmul-hossain-shanto-mehidy-hasan-miraz-2592919-2024-09-03",
      "headline": "After Pakistan triumph, Najmul Shanto sets sights on scripting history in IndiaBangladesh captain Najmul Hossain Shanto is eyeing to continue their winning momentum from Pakistan to further stun India in the forthcoming series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-2nd-test-mehidy-hasan-player-of-the-series-t20-world-cup-snub-2592917-2024-09-03",
      "headline": "PAK vs BAN: How T20 World Cup snub helped Mehidy Hasan rattle PakistanMehidy Hasan revealed how he used the T20 World Cup snub to rattle Pakistan during the Test series. Mehidy was adjudged as the Player Of The Series after Bangladesh beat Pakistan with a scoreline of  2-0. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bumrah-channels-inner-punjabi-posts-training-video-ft-karan-aujla-hit-tracks-2592906-2024-09-03",
      "headline": "Bumrah channels inner Punjabi, posts training video ft. Karan Aujla hit tracksJasprit Bumrah channelled his inner Punjabi as he posted his training video featuring Karan Aujla's songs. Bumrah will return to cricketing action during India's home Test season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-announces-wtc-final-2025-dates-lords-to-host-epic-clash-for-first-time-2592844-2024-09-03",
      "headline": "ICC announces WTC final 2025 dates, Lord's to host epic clash for first timeThe International Cricket Council (ICC) announced the dates for the World Test Championship (WTC) final 2025. The epic clash is set to be hosted at Lord's from June 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabbadi-league-season-11-to-start-from-october-18-with-3-city-caravan-format-2592937-2024-09-03",
      "headline": "Pro Kabbadi League Season 11 to start from October 18 with 3-city caravan formatThe Pro Kabaddi League season 11 is set to start from October 18 with a 3-city caravan format, the organisers announced on Tuesday, September 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ban-najmul-hossain-shanto-mehidy-hasan-miraz-2592919-2024-09-03",
      "headline": "After Pakistan triumph, Najmul Shanto sets sights on scripting history in IndiaBangladesh captain Najmul Hossain Shanto is eyeing to continue their winning momentum from Pakistan to further stun India in the forthcoming series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-2nd-test-mehidy-hasan-player-of-the-series-t20-world-cup-snub-2592917-2024-09-03",
      "headline": "PAK vs BAN: How T20 World Cup snub helped Mehidy Hasan rattle PakistanMehidy Hasan revealed how he used the T20 World Cup snub to rattle Pakistan during the Test series. Mehidy was adjudged as the Player Of The Series after Bangladesh beat Pakistan with a scoreline of  2-0. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bumrah-channels-inner-punjabi-posts-training-video-ft-karan-aujla-hit-tracks-2592906-2024-09-03",
      "headline": "Bumrah channels inner Punjabi, posts training video ft. Karan Aujla hit tracksJasprit Bumrah channelled his inner Punjabi as he posted his training video featuring Karan Aujla's songs. Bumrah will return to cricketing action during India's home Test season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-announces-wtc-final-2025-dates-lords-to-host-epic-clash-for-first-time-2592844-2024-09-03",
      "headline": "ICC announces WTC final 2025 dates, Lord's to host epic clash for first timeThe International Cricket Council (ICC) announced the dates for the World Test Championship (WTC) final 2025. The epic clash is set to be hosted at Lord's from June 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ban-shan-masood-disappointed-with-repeat-mistakes-after-series-loss-vs-ban-2592848-2024-09-03",
      "headline": "PAK vs BAN: Shan Masood disappointed with repeat mistakes after series lossShan Masood was disappointed with Pakistan's performance and said that the team had not learnt from their past mistakes. Bangladesh registered a 2-0 clean-sweep over Pakistan in the Test series.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nathan-smith-josh-clarkson-new-zealand-central-contract-devon-conway-finn-allen-2592822-2024-09-03",
      "headline": "Smith, Clarkson handed New Zealand contracts to replace Conway and AllenNew Zealand middle-order batter Josh Clarkson and Nathan Smith have been handed their maiden central contracts from the side after batters Devon Conway and Finn Allen opted out in order to play T20 leagues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bangladesh-vs-pnajmul-hossain-shanto-shan-masood-rawalpindi-litton-das-mehidy-hasan-miraz-2592812-2024-09-03",
      "headline": "Bangladesh script history, complete 2-0 Test series sweep in PakistanBangladesh beat Pakistan by 6 wickets in the second Test at Rawalpindi Cricket Stadium in Rawalpindi to script a historic maiden Test series win over the Asian rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-sabalenka-zheng-medvedev-sinner-to-set-up-australian-open-finals-rematch-2592744-2024-09-03",
      "headline": "US Open: Sabalenka-Zheng, Medvedev-Sinner to set up Australian Open finals rematchThe US Open 2024 will see a re-match of the Australian Open women's and men's singles finals in the quarter-finals, a first occurrence in the Ope Era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/yusuk-dikec-paris-olympics-viral-shooting-stance-trademark-coach-2592745-2024-09-03",
      "headline": "Yusuf Dikec eyeing to trademark viral Paris Olympics shooting stanceTurkish shooter Yusuf Dikec is trademarking his iconic Paris Olympics stance, which became a viral sensation for its simplicity and cool composure. According to his coach, this move protects his unique style after multiple unauthorised trademark attempts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-schedule-day-9-order-of-play-bopanna-sabalenka-and-zverev-in-action-2592723-2024-09-03",
      "headline": "US Open Schedule, Day 9 Order of Play: Bopanna, Sabalenka and Zverev in action An exciting day at the US Open 2024 is set to unfold as Flushing Meadows will witness enthralling quarter-final clashes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-day-six-live-updates-avani-lekhara-mona-agarwal-bhagyashree-paris-2592711-2024-09-03",
      "headline": "Paralympics, Day 6 Live: Avani in action in 50m Rifle 3 Positions SH1 finalParalympics 2024, Day 6, Live Updates: India's ace shooter Avani Lekhara's outing in the final of the women's 50m rifle 3 positions SH1 event has gotten underway. She finished in 7th position in the qualification round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/formula-four-fia-indian-championship-hugh-barter-aqil-alibhai-chennai-2592671-2024-09-03",
      "headline": "Barter, Alibhai light up Formula 4 Indian Championship in ChennaiAustralian Hugh Barter and South African Aqil Alibhai showcased their racing prowess in the FIA-Formula 4 Indian Championship, each claiming victory in a thrilling day of races marked by dramatic comebacks and tight competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/yusuk-dikec-paris-olympics-viral-shooting-stance-trademark-coach-2592745-2024-09-03",
      "headline": "Yusuf Dikec eyeing to trademark viral Paris Olympics shooting stanceTurkish shooter Yusuf Dikec is trademarking his iconic Paris Olympics stance, which became a viral sensation for its simplicity and cool composure. According to his coach, this move protects his unique style after multiple unauthorised trademark attempts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-schedule-day-9-order-of-play-bopanna-sabalenka-and-zverev-in-action-2592723-2024-09-03",
      "headline": "US Open Schedule, Day 9 Order of Play: Bopanna, Sabalenka and Zverev in action An exciting day at the US Open 2024 is set to unfold as Flushing Meadows will witness enthralling quarter-final clashes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-day-six-live-updates-avani-lekhara-mona-agarwal-bhagyashree-paris-2592711-2024-09-03",
      "headline": "Paralympics, Day 6 Live: Avani in action in 50m Rifle 3 Positions SH1 finalParalympics 2024, Day 6, Live Updates: India's ace shooter Avani Lekhara's outing in the final of the women's 50m rifle 3 positions SH1 event has gotten underway. She finished in 7th position in the qualification round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/formula-four-fia-indian-championship-hugh-barter-aqil-alibhai-chennai-2592671-2024-09-03",
      "headline": "Barter, Alibhai light up Formula 4 Indian Championship in ChennaiAustralian Hugh Barter and South African Aqil Alibhai showcased their racing prowess in the FIA-Formula 4 Indian Championship, each claiming victory in a thrilling day of races marked by dramatic comebacks and tight competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jannik-sinner-tommy-paul-round-of-sixteen-beatriz-maia-brazilian-2592648-2024-09-03",
      "headline": "Sinner bests Tommy Paul to seal quarterfinal, Beatriz scripts historyJannik Sinner advanced to the US Open quarterfinals, defeating Tommy Paul and becoming the only player to reach the quarters in all four Grand Slams this year. On the same day, Beatriz Haddad Maia also made history as the first Brazilian woman to do the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sixer-king-priyansh-arya-calls-virat-kohli-his-favourite-wishes-to-play-for-rcb-2592644-2024-09-03",
      "headline": "'Sixer King' Priyansh Arya calls Virat Kohli his favourite, wishes to play for RCBPriyansh Arya expressed his admiration towards Virat Kohli and called him his idol. He wished to play alongside him for RCB in IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/victor-osimhen-galatasaray-loan-deal-napoli-fallout-turkish-super-league-2592635-2024-09-03",
      "headline": "Victor Osimhen joins Galatasaray on 1-year loan deal after Napoli fallout Victor Osimhen's surprise loan to Galatasaray follows a fallout with Napoli and failed Chelsea transfer, signaling a likely permanent separation despite a lowered release clause and contract extension option until 2027."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}