{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/can-budget-2026-deliver-scale-skills-and-digital-growth-for-manufacturing-2854216-2026-01-19",
      "headline": "Can Budget 2026 deliver scale, skills and digital growth for manufacturing?Budget 2026 is expected to play a key role in shaping the future of India's manufacturing sector. From expanding scale to building skilled manpower and driving digital adoption, the industry has clear expectations from the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/taxes-jobs-credit-policies-what-consumers-can-expect-from-budget-2026-2854197-2026-01-19",
      "headline": "Taxes, jobs, credit policies: What consumers can expect from Budget 2026Budget 2026 is expected to touch everyday finances, from how much tax people pay to how easily they can access credit. Consumers are hoping for measures that ease costs and support stable income growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/rera-real-estate-delays-homebuyers-uttar-pradesh-township-policy-stalled-projects-2854161-2026-01-19",
      "headline": "From ruin to reform: My 12-year real estate nightmare and why RERA is a lifelineA decade-long struggle through stalled projects reveals why strong regulation matters. RERA restored accountability in a sector where delays were normal and buyers carried all the risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/shadowfax-technologies-ipo-opens-tomorrow-check-price-gmp-and-other-details-2854168-2026-01-19",
      "headline": "Shadowfax Technologies IPO opens tomorrow: Check price, GMP and other detailsShadowfax Technologies is set to enter the primary market tomorrow with its much-watched IPO. The issue comes at a time when online shopping and same-day delivery services are seeing steady growth across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-crosses-rs-3-lakh-per-kg-first-time-gold-price-today-india-2854140-2026-01-19",
      "headline": "Silver crosses Rs 3 lakh per kg for first time: What's driving the rally?Silve price today: The rate for 10 grams of silver stood at Rs 3,180 in Chennai, Hyderabad and Kerala. In Mumbai, Delhi, Kolkata, Bengaluru, Pune, Vadodara and Ahmedabad, silver was priced at Rs 3,050 per 10 grams"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bharat-coking-coal-shares-bccl-stock-open-at-97-percent-premium-hold-or-sell-2854111-2026-01-19",
      "headline": "Bharat Coking Coal opens at 97% premium: Should you hold or sell BCCL shares?BCCL share price: The stock listed at around a 97% gain over the issue price of Rs 23, reflecting the very high demand seen during the IPO phase. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/trumps-greenland-tariff-threat-rattles-global-markets-sends-dollar-lower-2854101-2026-01-19",
      "headline": "Trump's Greenland tariff threat rattles global markets, sends dollar lowerGlobal equities softened as investors moved out of risk-heavy assets. Asian and European markets opened lower, while US futures signalled a cautious start."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-down-sensex-falls-over-600-points-key-reasons-why-2854096-2026-01-19",
      "headline": "Sensex tanks over 600 points: 4 reasons why the stock market is down todayA mix of global tension, weak heavyweights, and sustained foreign selling hit investor sentiment right at the open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bharat-coking-coal-share-price-listing-at-97-percent-premium-bccl-debut-profit-2854095-2026-01-19",
      "headline": "Bharat Coking Coal shares make bumper debut. BCCL stock lists at 97% premiumBCCL share price: On the National Stock Exchange, Bharat Coking Coal shares settled at Rs 45, compared with the IPO price of Rs 23. This translates into a gain of about 97% for investors who were allotted shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-hit-record-highs-safe-haven-demand-us-tariff-tensions-greenland-eu-india-rates-2854073-2026-01-19",
      "headline": "Bullion at a new peak: Why gold and silver prices may continue to riseSilver prices climbed to Rs 299,390 per kg, rising by Rs 11,100 or 3.850%. During the day, silver touched close to the Rs 3 lakh per kg mark, highlighting the strong momentum in the metal. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-340-points-lower-nifty-below-25600-ril-down-2-2854068-2026-01-19",
      "headline": "Sensex opens 340 points lower, Nifty below 25,600; RIL down 2%The S&P BSE Sensex was down by 442.24 points to 83,128.11, while the NSE Nifty50 lost 138.00 points to 25,556.35 as of 9:40 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bccl-ipo-listing-today-gmp-expected-profit-share-price-market-debut-2854055-2026-01-19",
      "headline": "BCCL listing today: Will stock make strong debut on BSE, NSE? Check GMPBy the end of bidding, the Bharat Coking Coal IPO was subscribed 143.85 times overall, reflecting very strong investor interest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-different-types-taxation-explained-2853704-2026-01-18",
      "headline": "Jewellery, coins, SGBs, ETFs: Why gold taxes differ so muchJewellery, coins, Sovereign Gold Bonds, gold ETFs, gold mutual funds, and digital gold may all mirror the same metal, yet each one produces a very different tax outcome. Read on to understand how gold taxation really works."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ltcg-tax-confusion-property-gold-investors-capital-gains-tax-after-indexation-removal-budget-2026-2853404-2026-01-17",
      "headline": "Capital gains tax was meant to be simpler. Here's why it feels harder nowSelling a long-held asset used to be a fairly predictable exercise. Inflation was factored in through indexation, the tax rate was known, and the final bill rarely came as a shock. That sense of certainty has faded. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/what-education-sector-wants-from-budget-2026-skills-quality-and-jobs-2853181-2026-01-16",
      "headline": "What education sector wants from Budget 2026: Skills, quality and jobsWith India's youth population at the centre of its growth story, the education sector sees Budget 2026 as a chance to invest in better teachers, relevant skills and stronger pathways to jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-technologies-q3-profit-plunges-96-on-one-time-labour-code-charge-2853126-2026-01-16",
      "headline": "Tata Technologies' Q3 profit plunges 96% on one-time labour code chargeThe new labour rules, which came into effect in November, require employee wages to make up at least 50% of the total cost to company. Benefits such as provident fund and gratuity must now be calculated based on wages, raising costs for employers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-and-silver-etfs-at-record-highs-should-you-sell-now-or-buy-more-2853089-2026-01-16",
      "headline": "Gold and silver ETFs at record highs: Should you sell now or buy more?Gold and silver prices have climbed to record highs, pulling their ETFs up sharply as well. With returns looking attractive, investors are now facing a key question, i.e., is this the right time to book profits or stay invested? Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/will-gold-prices-stay-near-record-highs-despite-easing-safe-haven-demand-2853057-2026-01-16",
      "headline": "Will gold prices stay near record highs despite easing safe-haven demand?Gold prices are hovering near record highs even as some safe-haven demand fades, raising questions about whether support from interest rate cut expectations and global uncertainty will be enough to keep prices elevated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-sensex-ends-188-points-higher-nifty-above-25700-infosys-gains-6-percent-2853036-2026-01-16",
      "headline": "Sensex, Nifty end higher driven by IT stocks; Infosys gains 6%The S&P BSE Sensex added 187.74 points to settle at 83,570.35, while the NSE Nifty50 was up 28.75 points to close at 25,694.35​​​​​​​. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-what-indias-middle-class-is-really-asking-for-2852977-2026-01-16",
      "headline": "Budget 2026: What India's middle class is really asking forWith Budget 2026 around the corner, India's middle class is hoping for relief that actually touches daily life, from jobs and inflation to housing and healthcare, so what is it really asking the government to deliver?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/neha-kakkar-announces-break-from-responsibilities-and-work-requests-privacy-2854228-2026-01-19",
      "headline": "Neha Kakkar announces break, requests privacy Singer Neha Kakkar has posted a series of messages on social media indicating she is taking a step back from professional and personal engagements, and has asked fans and media for privacy during this period in new deleted posts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-on-living-at-sri-sri-ravi-shankar-ashram-i-got-closer-to-myself-2854211-2026-01-19",
      "headline": "I got closer to myself: Vikrant Massey on living at Sri Sri Ravi Shankar's ashram Actor Vikrant Massey discussed the personal and professional transformation he experienced while preparing for his role as Sri Sri Ravi Shankar in the upcoming film White."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/marvel-mcu-films-series-watch-avengers-doomsday-2026-2854201-2026-01-19",
      "headline": "Avengers: Doomsday countdown. Check out the 6 MCU projects Disney+ has lined up Disney+ has highlighted six Marvel Cinematic Universe films and series as essential viewing ahead of the release of Avengers: Doomsday, scheduled for December 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanober-shaikh-denies-threats-demands-legal-clarity-o-romeo-film-2854191-2026-01-19",
      "headline": "O Romeo row: Hussain Ustara's family breaks silence, denies threatening makers Hussain Ustara's daughter Sanober Shaikh denies threats to O Romeo team and stresses legal action. The family is upset over distorted portrayal and demands pre-release screening."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-daughters-khatija-and-raheema-support-father-amid-backlash-over-bollywood-communal-remarks-2854194-2026-01-19",
      "headline": "Disagree, don't disgrace: AR Rahman's daughters defend him amid row Khatija and Raheema, daughters of AR Rahman, have expressed solidarity with their father after a social media post defended his recent comments on communalism in Bollywood, following widespread criticism and Rahman's subsequent clarification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/do-deewane-seher-mein-teaser-siddhant-chaturvedi-mrunal-thakur-blend-nostalgia-with-modern-love-2854192-2026-01-19",
      "headline": "Do Deewane Seher Mein teaser: Siddhant, Mrunal blend nostalgia with modern love The teaser for Do Deewane Seher Mein offers a glimpse of a contemporary love story with shades of nostalgia. Starring Siddhant Chaturvedi and Mrunal Thakur, the film is set for theatrical release on February 20, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-japan-box-office-report-slow-start-for-allu-arjun-film-despite-major-promotion-2854190-2026-01-19",
      "headline": "Pushpa 2 Japan box office: Slow start for Allu Arjun's film despite major promotion Pushpa 2: The Rule, starring Allu Arjun, has experienced a weaker-than-expected opening in Japan. It recorded 886 admissions on its first day despite an extensive promotional campaign and growing interest in Indian cinema among Japanese audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/no-tail-to-tell-kdrama-gumiho-morality-wish-granting-netflix-2854176-2026-01-19",
      "headline": "No Tail to Tell review: Kim Hye-yoon, Lomon's show isn't quite gripping. Not yetRelease Date:Sat Jan 17, 2026 No Tail to Tell follows a cynical gumiho who grants wishes under strict rules. The series challenges traditional immortality stories with complex moral consequences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rani-mukerji-on-parenting-gen-alpha-daughter-adira-i-am-very-scared-of-her-2854167-2026-01-19",
      "headline": "Rani Mukerji on parenting Gen Alpha daughter Adira: I am very scared of her Rani Mukerji discussed her relationship with her 10-year-old daughter, Adira Chopra, in a recent interview. She highlighted generational differences in parenting and admitted to being scared of her daughter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-advance-booking-report-sunny-deol-film-sees-strong-early-sales-beats-sikandar-2854170-2026-01-19",
      "headline": "Border 2 advance booking: Sunny Deol film sees strong early sales, beats Sikandar Sunny Deol's Border 2 shows strong momentum at the box office. Early limited advance bookings have surpassed contemporaries and have set high expectations for its full release. The full advance booking for the film opens today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/meesaya-murukku-2-sequel-announced-hiphop-adhi-harshath-khan-joining-cast-2854159-2026-01-19",
      "headline": "Hiphop Adhi announces Meesaya Murukku 2, YouTuber Harshath Khan joins sequel Hiphop Adhi has announced the sequel to his 2017 musical drama Meesaya Murukku, with popular YouTuber Harshath Khan set to play a key role. The announcement was made at Adhi's concert in Malaysia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/agatha-christie-seven-dials-review-classic-mystery-with-modern-flair-2854072-2026-01-19",
      "headline": "Agatha Christie's Seven Dials review, a classic mystery with modern flairRelease Date:Thu Jan 15, 2026 Agatha Christie's Seven Dials on Netflix modernises a classic whodunit with a standout lead, sharp twists and British charm, even if the visuals fall short."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kabir-bahia-kriti-sanon-dating-rumours-nupur-sanon-wedding-udaipur-2854147-2026-01-19",
      "headline": "Kriti Sanon poses with rumoured boyfriend Kabir Bahia at sister's wedding Kriti Sanon's presence alongside rumoured boyfriend Kabir Bahia at her sister Nupur Sanon's wedding to singer Stebin Ben in Udaipur sparked online reactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jiiva-film-thalaivar-thambi-thalaimayil-the-karur-stampede-connection-and-his-public-apology-2854105-2026-01-19",
      "headline": "Explained: Jiiva's new film, the Karur stampede connection and his public apology Actor Jiiva has publicly apologised for the inclusion of the phrase 'Conditions follow pannungada' in the film Thalaivar Thambi Thalaimaiyil, following criticism linked to the phrase's association with the Karur stampede that claimed 41 lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-rahman-communal-bias-controversy-divisive-film-chhaava-bollywood-2854124-2026-01-19",
      "headline": "He was forced to apologise: Varun Grover supports AR Rahman amid criticism Lyricist Varun Grover defended A R Rahman following the criticism for calling 'Chhaava' a 'divisive' film and alluding to subtle communal bias in the industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-claims-black-magic-led-to-his-wife-shefali-jariwala-death-2854135-2026-01-19",
      "headline": "Parag Tyagi claims black magic led to his wife Shefali Jariwala's death Parag Tyagi has claimed he believes black magic was carried out on his late wife, actor Shefali Jariwala, before her unexpected death in June 2025. Speaking in a podcast, Tyagi cited personal experiences and feelings of unease in the months leading up to her death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rashmika-mandanna-reacts-to-sikandar-failure-says-script-was-different-initially-2854139-2026-01-19",
      "headline": "Rashmika Mandanna reacts to Sikandar failure, says script was different initially Rashmika Mandanna reacted to the failure of Sikandar, her Bollywood film with Salman Khan. The actor says the script changed significantly from what she initially heard during narration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jay-mehta-birthday-celebration-juhi-chawla-shares-rare-family-moments-2854126-2026-01-19",
      "headline": "Juhi Chawla shares rare family pics in sweet birthday post for husband Jay Mehta Actor Juhi Chawla marked husband Jay Mehta's birthday by sharing personal photos and a heartfelt message on social media, drawing enthusiastic responses from fans who appreciated the rare glimpse into their private life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sutapa-sikdar-remembers-2016-with-late-husband-irrfan-viral-2026-trend-2854099-2026-01-19",
      "headline": "2016 you were there, Irrfan: Sutapa Sikdar reflects on memories with late actor Sutapa Sikdar reflected on cherished 2016 moments with late husband Irrfan. Her post resonated deeply as the viral '2026 is the new 2016' trend captures widespread nostalgia."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/noida-rescue-operation-fails-to-save-yuvraj-mehta-emergency-teams-delay-action-dense-fog-2854156-2026-01-19",
      "headline": "90-minute Noida horror and death: How officials just watched as techie drownedThe tragic incident has raised serious questions about official negligence, with the Noida Authority having received multiple prior complaints about the danger at the site but failing to secure the area or repair damaged barriers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-letter-norway-pm-nobel-peace-prize-snub-greenland-threat-us-denmark-2854239-2026-01-19",
      "headline": "No obligation to think of peace: Trump's letter links Greenland push to Nobel snubIn his letter, Donald Trump told Norway Prime Minister Jonas Gahr Store that denial of the Nobel Peace Prize freed him to pursue US interests, using it to justify rejecting Denmark's sovereignty and pressing for American control of Greenland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-news-pak-can-now-acheive-purpose-why-it-was-created-says-pakistan-army-cheif-asim-munir-thanks-allah-2854225-2026-01-19",
      "headline": "Pak can now achieve purpose of its creation, says Munir. What is he hinting at?Pakistan's Chief of Defence Staff, Asim Munir, said the country was at a juncture where it could achieve the purpose of its creation. He said Pakistan was created in the name of Islam and now enjoyed a special status among Islamic countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-gaza-peace-board-india-invitation-challenges-states-united-nations-multilateralism-palestine-pakistan-2854142-2026-01-19",
      "headline": "Why a seat on Trump's Gaza Peace Board could be a landmine for IndiaFor New Delhi, US President Donald Trump's invitation to its much-hyped Gaza Peace Board could be less of an easy opportunity and more of a diplomatic tight-rope walk. Here we tell you why the membership could force India to balance the pull of a Trump-led platform against its long-standing principles and commitments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/rahman-bakait-did-the-maestro-fall-for-bias-and-bait-2854223-2026-01-19",
      "headline": "Rahman Bakait: The maestro fell for bias and baitAR Rahman might just have been baited to say what he did in his latest interview that has sparked off a national controversy. Or, was he led by some sort of bias that crept into him over the years?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-high-court-rejects-kuldeep-sengar-plea-suspend-sentence-custodial-death-unnao-survivor-father-2854252-2026-01-19",
      "headline": "Court rejects Kuldeep Sengar's bid to pause sentence in custodial death caseKuldeep Sengar's plea sought suspension of the sentence pending appeal against his 2019 trial court conviction. He cited prolonged incarceration and deteriorating health, including diabetes, cataracts, and retinal detachment, as grounds, requesting medical treatment at AIIMS outside Tihar Jail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/greenland-news-europe-vows-to-defend-itself-from-donald-trump-united-kingdom-sends-one-soldier-finland-two-norway-two-2853632-2026-01-19",
      "headline": "Europe shows intent in defending Greenland: UK sends 1 soldier, Finland 2, Norway 2US President Donald Trump's constant threats of annexing Greenland have finally moved Europe to send a military team to the island. Though termed a reconnaissance mission, the commitment of just 37 personnel amid Trump threats might reveal Europe's military seriousness.  Is Europe capable of resisting armed aggression without help from the US? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/noida/story/noida-techie-whose-car-plunged-into-water-filled-pit-died-of-heart-failure-asphyxiation-autopsy-2854205-2026-01-19",
      "headline": "What autopsy of Noida techie, whose car plunged into water-filled pit, revealedNoida-based software engineer Yuvraj Mehta died on Saturday after his car fell into a water-filled pit. His autopsy report stated that the engineer died due to asphyxiation and heart failure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/ireland-education-ireland-visa-sponsorship-indian-students-study-abroad-us-uk-australia-education-courses-career-options-2853641-2026-01-18",
      "headline": "Thinking of studying in Ireland? Indian students share brutal realityHandcrafted ByOur Editors As the American dream stumbles under visa uncertainty and the UK fades as a post-study option, Ireland has emerged as a top choice for Indian students. But for many who arrived in the European country carrying dreams and debt, Ireland's promise has curdled into anxiety, rejection and fear."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/japanese-youtuber-ikechan-under-fire-for-packed-with-indians-air-india-flight-vlog-racist-2854185-2026-01-19",
      "headline": "Japanese YouTuber under fire for 'packed with Indians' Air India flight vlogThe controversy began after Japanese YouTuber Ikechan shared her Air India flight vlog on YouTube and X with the caption, \"Taking the notoriously bad Air India for my first-ever trip to India!! The plane is packed with Indians.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-icc-ultimatum-bangladesh-january-21-bcci-2854114-2026-01-19",
      "headline": "ICC tells Bangladesh to play T20 World Cup in India or be replaced: SourcesT20 World Cup 2026: The International Cricket Council has asked the Bangladesh Cricket Board to make a swift decision, making it clear that Bangladesh's request to shift its matches out of India will not be considered. The tournament begins on February 7 in India and Sri Lanka."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/indore/story/mangilal-indore-crorepati-beggar-moneylender-2854078-2026-01-19",
      "headline": "3 homes, cars, part-time moneylending: Meet Indore's crorepati beggarMangilal is also a beneficiary of a one-BHK house as part of a combined initiative by the state government and the Red Cross."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/nawaz-sharif-granddaughter-in-law-shanzay-ali-rohail-turns-to-indian-designers-sabyasachi-mukherjee-tarun-tahiliani-for-her-wedding-2854164-2026-01-19",
      "headline": "Nawaz Sharif's granddaughter-in-law turns to Sabyasachi, Tarun Tahiliani for her weddingShanzay Ali Rohail's picks for her wedding are making headlines, as Nawaz Sharif's granddaughter-in-law chose outfits from two Indian designers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nobel-peace-prize-controversy-maria-corina-machado-hands-medal-to-donald-trump-2854063-2026-01-19",
      "headline": "Machado's gesture puts Nobel Foundation in a bind. Can it cancel the award?Venezuelan opposition leader Maria Corina Machado's decision to give her Nobel Peace Prize medal to US President Donald Trump has provoked extensive criticism and raised questions for the Nobel Foundation regarding the potential revocation or transfer of an awarded prize."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-daughters-khatija-and-raheema-support-father-amid-backlash-over-bollywood-communal-remarks-2854194-2026-01-19",
      "headline": "Disagree, don't disgrace: AR Rahman's daughters defend him amid rowKhatija and Raheema, daughters of AR Rahman, have expressed solidarity with their father after a social media post defended his recent comments on communalism in Bollywood, following widespread criticism and Rahman's subsequent clarification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-jf-17-jet-dominates-online-narratives-not-airspace-2854134-2026-01-19",
      "headline": "Pakistan's JF-17 jet dominates online narratives, not airspaceAt the heart of this narrative warfare is news agency Reuters, and in particular its Pakistan-based journalist Saad Sayeed. In fact, the reporting around JF-17 fighter is so farcical that Pakistanis themselves are calling out the shallow claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pullela-gopichand-coaching-methods-shape-indian-badminton-champions-2854217-2026-01-19",
      "headline": "Can't eat biryani and win World Champs: Taskmaster Gopichand explains his methodsLegendary shuttler Pullela Gopichand explained why he opts for tough training regimes for his wards, acknowledging that some of his methods have been labelled extreme. The former All England Open champion played a key role in shaping Saina Nehwal and PV Sindhu into world beaters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/yuvraj-mehta-death-greater-noida-emergency-rescue-failure-cold-water-hazards-2854100-2026-01-19",
      "headline": "Water too cold: Noida techie's father says officials refused to enter pit, rescue sonYuvraj Mehra, a 27-year-old software engineer, died after his car plunged into a water-filled pit in Greater Noida, with his father blaming emergency response teams for not entering the water due to its low temperature. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-ravindra-jadeja-odi-future-career-killers-new-zealand-strike-again-2854049-2026-01-19",
      "headline": "Rohit-Kohli in Tests, Jadeja in ODIs: Career-killers New Zealand strike againIND vs NZ: New Zealand have once again humbled India in a bilateral series. Last time, they triggered the exit of Virat Kohli and Rohit Sharma from the Test team. Will this series loss fast-track another set of changes in the Indian team?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/beyond-hunger-obesity-is-becoming-indias-fastest-growing-epidemic-2854152-2026-01-19",
      "headline": "Beyond Hunger: Obesity is becoming India's fastest-growing epidemicAs India races to fill empty plates, it is quietly filling hospital beds, proof that the nation's next public health battle is not about scarcity, but excess, lifestyle, and the cost of growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/north-india-cold-winters-fog-rain-snow-punjab-haryana-himachal-jammu-kashmir-delhi-ncr-coldwaves-2854207-2026-01-19",
      "headline": "Will rain hit North India? Why weather experts are on edgeMeteorologists predict weather patterns to push minimum temperatures even lower than in recent days, while daytime highs will struggle to rise above seasonal averages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/eu-deploy-trade-bazooka-response-us-tariffs-greenland-supporters-2854029-2026-01-19",
      "headline": "In a first, EU loads 'trade bazooka' to counter Trump's Greenland tariff threatThe European Union is preparing to deploy its Anti-Coercion Instrument for the first time in response to President Donald Trump's planned tariffs on goods from countries supporting Greenland, escalating transatlantic trade tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/h1b-news-indians-in-us-illegal-immigrants-non-immigrant-work-visa-holders-taking-over-texas-marjorie-taylor-greene-2853042-2026-01-19",
      "headline": "H-1B holders taking over Texas, says anti-visa crusader Marjorie Taylor GreeneNoted H-1B critic and MAGA leader Marjorie Taylor Greene fired yet another broadside at the visa programme, alleging the existence of a scam where an Indian-origin lawyer allegedly got approvals for over a million visa applicants since 2024. She also alleged that H-1B holders were taking over Texas."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/united-airlines-flight-avoid-crash-in-landing-in-orlando-2854133-2026-01-19",
      "headline": "Narrow escape for United flight, video shows plane losing front wheel during landingThe reason behind the mechanical glitch is unknown yet. However, many speculate that the windy weather could be a reason."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/nikhil-naz-on-icc-ultimatum-to-bangladesh-over-india-hosted-t20-world-cup-ytvd-2854242-2026-01-19",
      "headline": "Nikhil Naz On ICC Ultimatum To Bangladesh Over India-Hosted T20 World Cup On this Special Report, sports editor Nikhil Naz discusses the escalating tension between the International Cricket Council (ICC) and the Bangladesh Cricket Board (BCB). The ICC has issued a firm ultimatum to Bangladesh, demanding confirmation by Wednesday, January 21, regarding their participation in the T20 World Cup hosted by India. Nikhil Naz notes, 'If you do not confirm your participation, then we will be forced to replace you with another team based on rankings.' The standoff follows the BCB's refusal to travel to India citing security concerns, a situation triggered after the BCCI reportedly requested an IPL franchise to drop Mustafizur Ahmed. While Bangladesh has proposed moving their matches to Sri Lanka or adopting a hybrid model, the ICC has rejected these alternatives. If Bangladesh fails to comply by the deadline, they risk being replaced by Scotland, marking an unprecedented logjam in international cricket history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-3rd-odi-daryl-mitchell-explains-plan-to-attack-kuldeep-yadav-2854221-2026-01-19",
      "headline": "Targeting Kuldeep Yadav was part of New Zealand's plan, reveals Daryl Mitchell New Zealand's Indore ODI hero Daryl Mitchell revealed that going after \"world-class\" spinner Kuldeep Yadav from ball one was a planned move, aimed at preventing the wrist-spinner from settling into a match-controlling rhythm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pullela-gopichand-coaching-methods-shape-indian-badminton-champions-2854217-2026-01-19",
      "headline": "Can't eat biryani and win World Champs: Taskmaster Gopichand explains his methods Legendary shuttler Pullela Gopichand explained why he opts for tough training regimes for his wards, acknowledging that some of his methods have been labelled extreme. The former All England Open champion played a key role in shaping Saina Nehwal and PV Sindhu into world beaters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-super-league-auction-system-psl-draft-system-removed-2854204-2026-01-19",
      "headline": "Pakistan Super League to switch to IPL-style auction, scrap draft system The Pakistan Cricket Board has confirmed sweeping structural reforms to the Pakistan Super League (PSL), with the league set to move from a draft system to a player auction model."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-rohit-sharma-odi-poor-form-new-zealand-future-questioned-2854189-2026-01-19",
      "headline": "Rohit's hunger questioned after poor show vs New Zealand: 2027 too far away Rohit Sharma's recent poor performance in the ODI series against New Zealand has raised questions about his hunger and future in the Indian team. Former cricketer Simon Doull doubts whether Rohit remains motivated for the 2027 World Cup amid limited upcoming ODI opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-virat-kohli-mentality-sunil-gavaskar-lesson-2854182-2026-01-19",
      "headline": "What sets Virat Kohli apart in ODIs? Gavaskar shares a lesson for youngsters India vs New Zealand: Former India captain Sunil Gavaskar has explained what sets Virat Kohli apart in ODIs and urged young batters to take a leaf out of his book to master the art of pacing an innings while chasing stiff targets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-harshit-rana-praise-batting-indore-kris-srikkanth-2854162-2026-01-19",
      "headline": "Harshit Rana's biggest critic turns his fan: New Zealand were scared by his hitting India vs New Zealand: Former India opener Kris Srikkanth praised Harshit Rana's batting, saying the young all-rounder entertained with his six-hitting in India's defeat to New Zealand in Indore on Sunday, January 18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/royal-challengers-bengaluru-women-gujarat-giants-wpl-2026-preview-2853937-2026-01-19",
      "headline": "After Navi Mumbai, Royal Challengers Bengaluru aim to continue dream run in Vadodara WPL 2026, RCB vs GGW: Royal Challengers Bengaluru have won all four of their matches thus far and are placed at the top of the table while Gujarat Giants will look to bounce back after back-to-back losses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/icc-issues-ultimatum-to-bangladesh-over-t20-world-cup-matches-in-india-ytvd-2854153-2026-01-19",
      "headline": "ICC Issues Ultimatum To Bangladesh Over T20 World Cup Matches In India On this report, the focus is on the International Cricket Council's (ICC) stern ultimatum to the Bangladesh Cricket Board regarding their participation in the upcoming T20 World Cup matches scheduled in India. Following internal government pressure and security concerns cited by Bangladesh, the ICC has clarified there are no legitimate security threats in India. The global cricket body has reportedly told Bangladesh to 'Play in India or get replaced' in the tournament. A deadline of Wednesday, 21st January, has been set for a final response. The programme discusses the tension between the two boards and the ICC's refusal to move matches, emphasizing that if Bangladesh refuses to travel, they will forfeit their points and be replaced by another team based on current ICC rankings. The report highlights the intersection of sports and politics as the deadline approaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-rests-cummins-hazlewood-tim-david-for-pakistan-t20is-2854128-2026-01-19",
      "headline": "No Cummins or Hazlewood as Australia name squad for Pakistan T20I series Australia has rested key fast bowlers Pat Cummins, Josh Hazlewood and Tim David for the upcoming Pakistan T20I series. The trio is nursing injuries and are in a race against time to regain fitness ahead of the T20 World Cup 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-icc-ultimatum-bangladesh-january-21-bcci-2854114-2026-01-19",
      "headline": "ICC tells Bangladesh to play T20 World Cup in India or be replaced: Sources T20 World Cup 2026: The International Cricket Council has asked the Bangladesh Cricket Board to make a swift decision, making it clear that Bangladesh's request to shift its matches out of India will not be considered. The tournament begins on February 7 in India and Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/renee-noronha-india-youngest-ironman-world-record-2854079-2026-01-19",
      "headline": "Ironwoman in a man's world: India's Renee Noronha aims to rewrite historyIn an exclusive chat with India Today, India's youngest female Ironman athlete, Renee Noronha, opens up about her world record aspirations and making a positive change for women in endurance sports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usain-bolt-cricket-comeback-los-angeles-2028-olympics-2854084-2026-01-19",
      "headline": "Usain Bolt hints at return from retirement to play cricket at LA 2028 OlympicsUsain Bolt has expressed his desire to compete in cricket at the Los Angeles 2028 Olympics. The sport returns to the Games after 128 years, with Bolt eager to represent Jamaica in this historic comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-ravindra-jadeja-odi-future-career-killers-new-zealand-strike-again-2854049-2026-01-19",
      "headline": "Rohit-Kohli in Tests, Jadeja in ODIs: Career-killers New Zealand strike againIND vs NZ: New Zealand have once again humbled India in a bilateral series. Last time, they triggered the exit of Virat Kohli and Rohit Sharma from the Test team. Will this series loss fast-track another set of changes in the Indian team?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-badminton-an-se-young-korea-rafael-nadal-analsysis-2854043-2026-01-19",
      "headline": "Like Nadal on clay: Meet An Se Young, the badminton star impossible to beatWith a win rate touching 95 per cent and a trophy cabinet that has barely shut in 14 months, 23-year-old South Korean An Se-young is breaking her rivals' spirits. After her ruthless defence of the India Open title, the question confronting the sport is simple: how do you stop a player who shows no weaknesses?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/afcon-final-chaos-senegal-walkout-morocco-extra-time-win-2854035-2026-01-19",
      "headline": "Walkout, 94th-minute winner: Senegal snatch AFCON title from MoroccoIn one of the most dramatic finals in recent memory, Senegal staged a walkout and then returned to the field to bear Morocco with a 94th-minute winner to "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-poor-form-shubman-gill-defends-india-odi-series-new-zealand-2854033-2026-01-19",
      "headline": "Shubman Gill defends Rohit's low returns vs NZ: You won't always convert startsIND vs NZ: India captain Shubman Gill defended Rohit Sharma's poor form in the New Zealand ODI series, as India lost by 1-2. Rohit scored 61 runs from three innings and failed to convert his starts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-harshit-rana-no-7-india-odi-loss-new-zealand-analysis-2854014-2026-01-19",
      "headline": "Already Gambhir's favourite, is it time for India to trust Harshit Rana at No.7?Harshit Rana shone with the bat once again, scoring his maiden fifty against New Zealand during the 3rd ODI in Indore on Sunday, January 18. Can India finally groom Harshit to be their No.7 batter with the ODI World Cup on the horizon?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-day-2-live-updates-coco-gauff-novak-djokovic-iga-swiatek-2854013-2026-01-18",
      "headline": "Day 2 Live Updates: Iga Swiatek and Andreeva in action in afternoon sessionAustralian Open Day 2 live updates: Iga Swiatek and Mirra Andreeva begin their campaign in Melbourne. Iga Swiatek is up against Yue Yuan of China. Earlier in the day, Daniil Medvedev reached the second round of a Grand Slam tournament for the first time since January last year. Stan Wawrinka, playing his final Australian Open, stormed into the second round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-spinners-adil-rashid-rehan-ahmed-receive-indian-visas-t20-world-cup-2026-2854009-2026-01-18",
      "headline": "Relief for England as Adil Rashid, Rehan Ahmed get India visas for T20 World CupEngland received a boost ahead of the ICC Men's T20 World Cup 2026 as spinners Adil Rashid and Rehan Ahmed secured Indian visas, ending uncertainty over their participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-backs-jadeja-kuldeep-after-new-zealand-odi-series-loss-2854004-2026-01-18",
      "headline": "IND vs NZ: Shubman Gill backs Kuldeep, Jadeja despite reality check against New ZealandIndia captain Shubman Gill jumped to the defence of Ravindra Jadeja and Kuldeep Yadav after their below-par performance during the series loss to New Zealand. Jadeja and Kuldeep failed with the ball and the former's batting form came under the scanner during the three matches against the Blackcaps. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-odi-series-gautam-gambhir-twitter-2854002-2026-01-18",
      "headline": "Gambhir brutally trolled after India lose historic series against New ZealandIndia vs New Zealand: India head coach Gautam Gambhir was heavily criticised on social media after India lost their first ever home ODI series against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-reviews-t20-world-cup-2026-participation-bangladesh-security-concerns-2854001-2026-01-18",
      "headline": "T20 World Cup fresh twist: Pakistan to review participation amid Bangladesh issuePakistan are set to review their participation in the Men's T20 World Cup 2026 as Bangladesh's security concerns escalate, with BCB seeking ICC intervention to move its matches out of India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vidarbha-win-maiden-vijay-hazare-trophy-2026-atharva-taide-century-2853981-2026-01-18",
      "headline": "Vidarbha exorcise 2025 final demons to clinch maiden Vijay Hazare Trophy titleVidarbha rose from last year's final heartbreak by defeating Saurashtra by 38 runs to win their maiden Vijay Hazare Trophy. Atharva Taide's century and a disciplined bowling effort sealed a historic title triumph in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-3rd-odi-match-report-indore-historic-series-loss-2853975-2026-01-18",
      "headline": "Virat Kohli 124 in vain as India hit new low, lose ODI series to second-string NZVirat Kohli's 54th ODI hundred went in vain as New Zealand scripted a historic series win in Indore on Sunday, January 18. Daryl Mitchell and Glenn Phillips' hundreds and a disciplined bowling effort helped the visitors to secure the win and give India a new low. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-most-odi-centuries-against-new-zealand-record-indore-2853970-2026-01-18",
      "headline": "Unstoppable Virat Kohli storms past Ricky Ponting with gutsy Indore centuryIND vs NZ, 3rd ODI: Virat Kohli scored his 54th ODI century in India's third ODI against New Zealand on Sunday in Indore. With the knock, he also surpassed Ricky Ponting and Virender Sehwag in the list of batters with the most ODI hundreds against the Kiwis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-technique-analysis-ashwin-critiques-batting-flaw-nz-series-indore-2853945-2026-01-18",
      "headline": "What went wrong? R Ashwin analyses Shubman Gill's technical flaw after Indore failureIND vs NZ: Shubman Gill's early exit in the Indore decider put the spotlight on his technique, with Ravichandran Ashwin explaining how a brief loss of alignment between bat and pad proved costly against Kyle Jamieson."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/turkiye-zeynep-sonmez-aids-ball-girl-advances-australian-open-second-round-2853926-2026-01-18",
      "headline": "Australian Open: Turkish player's quick response to fainting ball girl wins heartsTurkish qualifier Zeynep Sonmez paused her opening-round match at the Australian Open to help a fainting ball girl, before securing a three-set win on Sunday, January 18. Sonmez created history with her win, but it was her selfless act that won hearts of the fans. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2026-day-2-djokovic-swiatek-gauff-medvedev-schedule-2853924-2026-01-18",
      "headline": "Day 2 Schedule: Novak Djokovic, Coco Gauff, Iga Swiatek begin campaignDay 2 of the 2026 Australian Open features top stars like Novak Djokovic, Iga Swiatek, and Coco Gauff beginning their campaigns, with rising challengers ready to make an impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-struggles-new-zealand-odi-series-2853930-2026-01-18",
      "headline": "Has Rohit Sharma played his last for India? Fans upset after Indore ODI failureIndia vs New Zealand: Star Indian opener Rohit Sharma struggled throughout the ODI series against New Zealand, failing to score a half-century. Rohit was dismissed for 11 in the series decider in Indore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-slapped-curfew-t20-world-cup-2026-sri-lanka-tour-ashes-alcohol-incident-noosa-trip-2853929-2026-01-18",
      "headline": "England face curfews for T20 World Cup, Sri Lanka tour after Ashes incident: ReportEngland have imposed a midnight curfew on players after the Ashes and New Zealand tour controversies, tightening discipline ahead of the Sri Lanka series and T20 World Cup following several alcohol-related incidents."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}