{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quick-commerce-zepto-delivering-cars-now-skoda-kylaq-new-teaser-sparks-buzz-february-8-2675195-2025-02-05",
      "headline": "Zepto delivering cars now? Skoda's new teaser sparks buzzQuick commerce platforms like Blinkit, BigBasket and Zepto started delivering iPhone 16 in a few minutes, challenging traditional e-commerce giants Amazon and Flipkart, last year in September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arbitrator-may-decide-who-controls-ratan-tatas-fortune-report-2675159-2025-02-05",
      "headline": "Arbitrator may decide who controls Ratan Tata's fortune: ReportRatan Tata had set up two entities in 2022 to manage his personal wealth for charitable purposes—the RTEF under Section 8 of the Companies Act 2013 and the Ratan Tata Endowment Trust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/services-sector-growth-slows-to-more-than-2-year-low-in-january-2675132-2025-02-05",
      "headline": "Services sector growth slows to more than 2-year low in JanuaryDemand for services rose at the slowest pace in 14 months but remained sturdy. It was supported by international demand that was the strongest in five months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-us-tarifff-trade-war-actions-impact-all-factors-explained-2675093-2025-02-05",
      "headline": "Explained: Is China playing it safe in latest trade war with US? US-China trade war: China's countermeasures appear more restrained compared to its approach during the previous trade war. This has raised a key question: Is China playing it safe in the latest trade standoff with the US?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reasons-behind-itc-hotels-delisting-from-sensex-and-bse-what-you-need-to-know-2675060-2025-02-05",
      "headline": "ITC Hotels to be dropped from Sensex, BSE indices today. Here's why ITC Hotels shares opened at Rs 188 per share on the BSE and Rs 180 per share on the NSE at a discount of over 30% compared to the discovered price of Rs 260 on the NSE and Rs 270 on the BSE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-flat-as-rbi-policy-meet-kicks-off-fmcg-stocks-fall-2675037-2025-02-05",
      "headline": "Sensex, Nifty open flat as RBI policy meet kicks off; FMCG stocks fallShare Market Today: The S&P BSE Sensex was down by 14.87 points to 78,568.94, while the NSE Nifty50 added 30.40 points to 23,769.65 as of 9:28 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-starts-today-will-new-governor-sanjay-malhotra-cut-rates-decision-february-7-2675029-2025-02-05",
      "headline": "RBI MPC meeting starts today: Will new Governor Sanjay Malhotra cut rates?RBI MPC Meeting 2025: The repo rate has been unchanged at 6.5% since February 2023, and the last rate cut was announced during the Covid-19 pandemic in May 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-expectations-bull-run-on-dalal-street-will-the-stock-market-rally-last-2675023-2025-02-05",
      "headline": "Bull run on Dalal Street: Will the stock market rally last? Share market today: The stock market saw a bull run in the last session with the benchmark indices, Sensex and Nifty, both closing over 1.5% higher, driven by gains in banking and financial stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tatas-milennial-friend-shantanu-naidu-gets-top-role-at-tata-motors-2675017-2025-02-05",
      "headline": "Ratan Tata's millennial friend Shantanu Naidu gets top role at Tata MotorsIn 2018, Shantanu Naidu began working as Ratan Tata's assistant, a role that brought him public attention, especially after a viral video of his birthday surprise for the industrialist.\r\n "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/p-chidambaram-on-budget-2025-gst-cut-would-have-benefited-everybody-2674953-2025-02-04",
      "headline": "P Chidambaram on Budget 2025: 'GST cut would have benefited everybody'Former Finance Minister P Chidambaram analysed Nirmala Sitharaman's Budget 2025, criticising its focus on tax cuts for a small segment of the population."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/finance-minister-nirmala-sitharaman-says-gst-council-to-decide-on-fewer-lower-tax-rates-soon-2674903-2025-02-04",
      "headline": "GST Council to decide on fewer, lower tax rates soon: Nirmala SitharamanFinance Minister Nirmala Sitharaman stated on Tuesday that the GST Council is close to finalising a decision on tax rate rationalisation, with the review process nearly complete. At present, the Goods and Services Tax (GST) is structured into four slabs: 5 per cent, 12 per cent, 18 per cent, and 28 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-to-get-a-student-credit-card-check-eligibility-and-documents-required-2674860-2025-02-04",
      "headline": "How to get a student credit card? Check eligibility and documents requiredWhile the credit card can be a valuable financial tool, students must be aware of its potential misuse and pitfalls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/i-will-think-about-india-nirmala-sitharaman-as-trump-2-0-goes-big-on-crypto-2674644-2025-02-04",
      "headline": "I will think about India: Nirmala Sitharaman as Trump 2.0 goes big on cryptoFinance Minister Nirmala Sitharaman said that the government during its G20 presidency pushed for a global understanding of crypto regulations and how to tackle trading in cryptocurrencies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-stock-market-rally-sensex-jumps-1397-points-nifty-nears-23750-as-bulls-take-charge-2674640-2025-02-04",
      "headline": "Market rally: Sensex jumps 1,397 points, Nifty nears 23,750 as bulls take chargeStock Market: The S&P BSE Sensex surged by 1397.07 points to close at 78,583.81, while the NSE Nifty50 added 378.20 points to end at 23,739.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/exclusive-nirmala-sitharaman-on-budget-2025-tax-relief-for-citizens-2674621-2025-02-04",
      "headline": "Exclusive: Nirmala Sitharaman on Budget 2025 tax relief for citizensFinance Minister Nirmala Sitharaman stated that the tax relief introduced in Budget 2025 reflects Prime Minister Narendra Modi's commitment to honouring taxpayers for their contribution to nation-building."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-hindenburg-went-after-adani-group-founder-nathan-anderson-breaks-silence-2674623-2025-02-04",
      "headline": "Why did Hindenburg go after Adani Group? Nathan Anderson breaks silenceHindenburg Research founder Nathan Anderson maintained that all the firm's reports, including the one on Adani Group, were accurate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-dismisses-tax-relief-link-with-delhi-election-2674604-2025-02-04",
      "headline": "Nirmala Sitharaman dismisses tax relief link with Delhi electionFinance Minister Nirmala Sitharaman dismissed speculation that the government increased the tax relief to Rs 12 lakh due to the upcoming Delhi elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-plans-to-shut-it-down-nirmala-sitharaman-on-old-tax-regime-2674587-2025-02-04",
      "headline": "No plans to shut it down: Nirmala Sitharaman on old tax regimeFinance Minister Nirmala Sitharaman table the Union Budget 2025 on February 1, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/part-of-pms-effort-to-respect-service-the-taxpayers-are-doing-for-nation-nirmala-sitharaman-on-tax-relief-2674570-2025-02-04",
      "headline": "Respecting service of taxpayers: Nirmala Sitharaman on Budget income tax breaks Finance Minister Nirmala Sitharman said that the tax relief given in Budget 2025 was Prime Minister Narendar Modi's effort to respect the service the taxpayers are doing for nation building. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-key-tax-reforms-for-middle-class-introduced-in-budget-2025-no-tax-till-rs-12-lakh-revised-tax-slabs-extension-in-updated-tax-filing-2674538-2025-02-04",
      "headline": "5 key tax reforms for middle class introduced in Budget 2025 Union Budget 2025: The new tax structure announced in the Union Budget 2025 aims to ease the financial burden of the middle class, enhancing their disposable income and giving a boost to their consumption levels."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/blackpink-lisa-shares-release-date-of-white-lotus-season-3-2675179-2025-02-05",
      "headline": "Blackpink's Lisa shares release date of White Lotus Season 3. WatchThe release date of the highly-anticipated White Lotus Season 3 is here. The HBO show will begin streaming from this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mufasa-the-lion-king-to-stream-ott-february-on-rent-disney-plus-hotstar-2675172-2025-02-05",
      "headline": "Mufasa: The Lion King to stream on OTT from February, but here's the catchMufasa: The Lion King is set to stream on Disney+ Hotstar from February 18. The musical film will be available to stream on Video-on-demand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/vincenzo-actor-ok-taec-yeon-proposes-to-girlfriend-in-front-eiffel-tower-paris-2675097-2025-02-05",
      "headline": "Pics: Vincenzo actor Ok Taec-yeon proposes to girlfriend in dreamy settingSouth Korean actor and idol, Ok Taec-yeon, proposed to his girlfriend in a picturesque setting. The engagement has delighted fans, though wedding details remain under wraps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/medical-dreams-ott-sharman-joshi-tvf-show-on-neet-aspirants-2675078-2025-02-05",
      "headline": "Medical Dreams on OTT: When, where to watch Sharman Joshi's show on NEET aspirantsMedical Dreams, a new TVF show headlined by Sharman Joshi, premiered on February 4. Revolving around the lives of NEET aspirants, the series is streaming on YouTube. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/arjun-kapoor-bhumi-pednekar-and-rakul-preet-singh-mere-husband-ki-biwi-ott-release-stmp-2675053-2025-02-05",
      "headline": "Mere Husband Ki Biwi on OTT: When and where to watch Arjun, Rakul, Bhumi's filmArjun Kapoor, Bhumi Pednekar, and Rakul Preet Singh's upcoming romantic comedy Mere Husband Ki Biwi will hit theatres on February 21. The film is touted to stream on Disney+ Hotstar after its theatrical release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-defends-bianca-censori-grammys-nude-outfit-most-googled-person-2675056-2025-02-05",
      "headline": "My wife is most Googled: Kanye West defends wife amid row over Grammys outfitRapper Kanye West shared his first statement after his unexpected appearance with wife Bianca Censori at the 67th Grammys. Bianca's sheer dress, almost giving the illusion of nudity on the red carpet, drew criticism from all across. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ive-empathy-review-a-sonic-and-musical-evolution-of-the-k-pop-group-2675032-2025-02-05",
      "headline": "IVE Empathy review: A sonic and musical evolution of the K-pop groupIVE embarks on a new journey with their 3rd EP 'IVE EMPATHY', expanding their musical themes to embrace empathy. The album highlights the group's evolving artistry and global appeal, marking another milestone in their impressive career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-removes-karla-sofia-gascon-emilia-perez-oscar-campaign-controversial-posts-zoe-saldana-2675013-2025-02-05",
      "headline": "Netflix removes Karla Sofia Gascon from Oscar campaign after controversial postsEmilia Perez actor Karla Sofia Gascon has been removed from Netflix's Oscar campaign for the film. This comes following backlash over her controversial posts in the past. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-gets-a-head-massage-in-chennai-video-2674929-2025-02-04",
      "headline": "Ed Sheeran gets a head massage in Chennai, jokes 'it's abuse'. WatchSinger Ed Sheeran is currently in India. On Tuesday, the British singing sensation shared a fun video of himself getting a head massage in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-mantis-to-genie-make-a-wish-netflix-k-drama-slate-2025-2674899-2025-02-04",
      "headline": "Squid Game 3, Mantis to Genie Make a Wish: Netflix unveils 2025 K-drama slateNetflix unveiled the 2025 slate of its upcoming K-dramas and films. From Squid Game 3, Mantis to Genie Make a Wish, here's what all you can watch on the OTT site."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/nadaaniyan-introducing-the-parents-of-khushi-kapoor-and-ibrahim-ali-khan-2674908-2025-02-04",
      "headline": "Nadaaniyan: Introducing the parents of Khushi Kapoor and Ibrahim Ali KhanThe official social media handle of Karan Johar's Dharmatic Entertainment has shared photos of the core Nadaaniyan team. It stars Khushi Kapoor and Ibrahim Ali Khan in the lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vivekanandan-viralanu-shine-tom-chacko-swasika-stmp-2674672-2025-02-04",
      "headline": "Vivekanandan Viralanu: Here's where you can watch the Tom Chacko releaseMalayalam actors Shine Tom Chacko and Swasika's Vivekanandan Viralanu will soon be available to stream on an OTT platform. The announcement was shared by makers on social media recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/boman-irani-on-the-mehta-boys-vs-animal-debate-2674619-2025-02-04",
      "headline": "Boman Irani on The Mehta Boys vs Animal debate: Not every father-son film is sameActor Boman Irani, who is all set to make his directorial debut with The Mehta Boys, reacts to Animal comparisons, stating not all father-son films are alike. Avinash Tiwary jokes that theirs offers the real family drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sarah-michelle-gellar-to-star-in-buffy-the-vampire-slayer-sequel-2674579-2025-02-04",
      "headline": "Sarah Michelle Gellar to star in Buffy the Vampire Slayer sequel: ReportActor Sarah Michelle Gellar will reportedly be reprising her role as Buffy Summers for Buffy the Vampire Slayer's sequel on Hulu. Chloe Zhao is in talks to direct the show. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/game-changer-ott-release-ram-charan-kiara-advani-film-prime-video-feb-7-stmp-2674519-2025-02-04",
      "headline": "Game Changer OTT release: When and where to watch Ram Charan-Kiara Advani filmRam Charan's Game Changer OTT release date: Shankar's telugu directorial, Game Changer, is all set to stream on OTT soon. Read details about when and where you can watch the Ram Charan and Kiara Advani-starrer on OTT."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karisma-kapoor-recreates-hum-saath-saath-hain-scene-badshah-sooraj-barjatya-indian-idol-15-2674503-2025-02-04",
      "headline": "Karisma Kapoor recreates Hum Saath Saath Hain scene with Badshah on Indian Idol 15Actors Karisma Kapoor, Mohnish Behl and filmmaker Sooraj Barjatya were among the special guests on Indian Idol 15. During their appearance, Karisma recreated one of her iconic scenes from Hum Saath Saath Hain with Badshah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dining-with-the-kapoors-kareena-kapoor-ranbir-kapoor-karisma-kapoor-saif-ali-khan-food-film-family-bonds-2674465-2025-02-04",
      "headline": "Dining With The Kapoors: Kareena, Ranbir, and family bond over food and filmsThe entire Kapoor Khandaan including Kareena Kapoor, Ranbir Kapoor, Karisma Kapoor, and others have united for a Netflix special film, Dining With the Kapoors. The project was announced as a part of the Netflix 2025 slate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/samay-raina-rekha-joke-amitabh-bachchan-kbc-16-video-2674445-2025-02-04",
      "headline": "Did Samay Raina joke about Rekha on Amitabh Bachchan's KBC 16? Here's the truthA viral video shows Samay Raina joking about Rekha with Amitabh Bachchan on KBC 16, but it appears to be doctored."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sonu-nigam-rashtrapati-bhavan-performance-back-spasm-2674444-2025-02-04",
      "headline": "Pics: Sonu Nigam performs at Rashtrapati Bhavan after suffering back painSonu Nigam performed at Rashtrapati Bhavan despite suffering from a severe back spasm just a day back. The singer performed on the occasion of Rashtrapati Bhavan Diwas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ap-apologises-to-babyface-for-cutting-short-grammy-interview-2674420-2025-02-04",
      "headline": "Associated Press apologises to Babyface for cutting short Grammy interviewAP apologised to 12-time Grammy-winning composer Babyface after cutting his interview short on the Grammys red carpet. Stars like Khloé Kardashian criticised the journalists for disrespecting the music legend."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/us-military-plane-illegal-indian-immigrants-lands-amritsar-texas-donald-trump-border-crackdown-2675167-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US military plane carrying 104 illegal Indian immigrants lands in AmritsarPolice and civil administration officials were at the airport to receive the 104 illegal immigrants comprising 79 men and 25 women.  An official from the US Embassy was also present. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-assembly-election-2025-voting-polling-aap-arvind-kejriwal-congress-bjp-narendra-modi-rahul-gandhi-2674994-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "As Delhi votes, AAP alleges cash distribution, BJP claims fraud voting  Live UpdatesWill AAP hold its stronghold, the BJP end its losing streak, or the Congress stage a surprise comeback? Delhi decides today as 1.56 crore voters cast their ballots across all 70 constituencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-prayagraj-holy-dip-maha-kumbh-prayagraj-2675073-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi takes holy dip in Sangam at Maha Kumbh, perfoms aartiMaha Kumbh 2025: PM Modi performed the ritual bath, offered prayers and is likely to address a gathering and talk about nation-building."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/road-to-us-visa-h1b-l1-work-visa-temples-hanuman-ganesha-ahmedabad-chilkur-hyderabad-delhi-punjab-telangana-2674645-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Visa Hanuman is so sought after these days Across India, \"visa temples\" attract people aspiring to work and live abroad. From Gujarat's Visa Hanuman to Punjab's Hawaijahaj (Aeroplane) Gurdwara, places of worship are seeing a rush of devotees amid the uncertainty over the H-1B visa programme and hiring uncertainties in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-maha-kumbh-holy-dip-outfits-trackpants-topi-lookbook-2675110-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi in athleisure for holy dip at Kumbh, puffer jacket-pahari topi for aartiPM Modi grabbed attention for his sartorial choices at Maha Kumbh Mela. He donned three distinct outfits during his visit -- from a jersey and track pants for the holy dip, then switching to a 'pahari topi' and puffer jacket later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-says-us-will-take-over-gaza-strip-we-will-develop-we-will-own-it-2675004-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US will take over Gaza: Trump's shock announcement with Netanyahu by his sideUS President Donald Trump said that the US will take over and develop Gaza, asserting long-term ownership, while Israeli Prime Minister Benjamin Netanyahu called it a historic idea that could reshape Gaza's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shatrughan-sinha-wants-ban-non-vegetarian-food-praises-uniform-civil-code-in-uttarakhand-2675035-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shatrughan Sinha wants ban on non-veg food, praises civil code in UttarakhandCiting a ban on non-vegetarian food across the country, the actor-politician said that while he backed such a move, it would be difficult to impose it in certain parts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-might-revoke-extended-auto-renewal-for-h-1b-l-1-visas-john-kennedy-rick-scott-republican-senators-2675127-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump might revoke extension of H-1B, L-1 visa auto-renewalThe extension period of work visas increased by the Biden government might soon come to an end with Donald Trump back in the White House. Two Republican Senators introduced a resolution seeking to overturn the rule which extended the auto-renewal of work visas and called it \"dangerous\" for immigration enforcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/after-calling-india-ai-efforts-hopeless-sam-altman-now-says-india-should-be-a-leader-in-ai-2675130-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "OpenAI CEO Sam Altman says India should be a leader in AIOpenAI CEO Sam Altman, who previously dismissed India's ability to develop large-scale AI models, has now said the country should play a leading role in artificial intelligence. Here is the full story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/a-celebration-of-rohit-bals-legacy-at-blenders-pride-fashion-tour-2025-2673256-2025-02-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "A Celebration of Rohit Bal's Legacy at Blenders Pride Fashion Tour 2025A grand celebration of Rohit Bal's iconic work at Blenders Pride Fashion Tour brought together his closest friends, industry icons, and admirers in an unforgettable evening honouring his legacy and artistic brilliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-defends-bianca-censori-grammys-nude-outfit-most-googled-person-2675056-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "My wife is most Googled: Kanye West defends wife amid row over Grammys outfitRapper Kanye West shared his first statement after his unexpected appearance with wife Bianca Censori at the 67th Grammys. Bianca's sheer dress, almost giving the illusion of nudity on the red carpet, drew criticism from all across. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pat-cummins-sledges-virat-kohli-in-advertisement-icc-champions-trophy-2025-2675051-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kohli, I've never seen you bat this slowly, Pat Cummins sledges in new viral adAustralia captain Pat Cummins was seen sledging star India batter Virat Kohli in a new advertisement for the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/photo/delhi-assembly-election-polls-pics-arvind-kejriwal-with-family-s-jaishankar-rahul-gandhi-sonia-gandhi-priyanka-gandhi-vote-in-delhi-2675153-2025-02-05?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Pics: Arvind Kejriwal with family, S Jaishankar, Rahul Gandhi vote in DelhiDelhi election 2025 Voting: Polling for all the 70 seats began at 7 am and will end at 6pm, followed by the release of exit poll results. The election is a fierce contest between the ruling Aam Aadmi Party (AAP), which is seeking a third consecutive term, the BJP, aiming to unseat the incumbent government, and the Congress, hoping for a political resurgence in the national capital. A total of 699 candidates are contesting for 70 constituencies. The election results will be announced on February 8. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-donald-trump-instructs-advisers-to-obliterate-iran-if-it-assassinates-him-2675019-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nothing will be left: Trump's warning if Iran tries to assassinate himIf Donald Trump were assassinated, Vice President JD Vance would become president and would not necessarily be bound by any instructions left by his predecessor. Federal authorities have been tracking Iranian threats against Trump and other administration officials for years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/milkipur-by-election-uttar-pradesh-bjp-avenge-ayodhya-faizabad-defeat-prestige-battle-samajwadi-party-2674682-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "To avenge Ayodhya defeat, BJP turns Milkipur by-poll into prestige battleMilkipur ByPoll 2025: People are voting in the bypoll in Milkipur in Uttar Pradesh today. BJP leaders, including CM Yogi Adityanath, turned the Milkipur Assembly by-election into a prestige battle. Months after losing the Faizabad Lok Sabha seat that houses the Ayodhya Ram Mandir, the BJP has called on voters in Milkipur to \"avenge the defeat\". This is why Milkipur, one of the five Assembly segments of Faizabad, is a prestige battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/zomato-ceo-deepinder-goyal-hires-2-people-chief-of-staff-role-talks-about-handsome-compensation-2675090-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Zomato CEO hires 2 people for Chief of Staff role, talks about 'handsome compensation'The Chief of Staff job role, based at Zomato's Gurugram headquarters, sparked backlash on social media last year due to its unusual terms - no salary for the first year and a hefty Rs 20 lakh fee required from candidates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rahul-dravid-argument-with-bengaluru-auto-driver-viral-video-2675028-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Rahul Dravid loses his cool after auto driver hits his car in BengaluruFormer India cricketer Rahul Dravid got involved in a heated argument with a Bengaluru auto driver after  a minor collision on the road with his car."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-a-nativist-goa-partys-tirade-against-outsiders-is-getting-shriller-2674573-2025-02-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why a nativist Goa party's tirade against 'outsiders' is getting shrillerThe Revolutionary Goans Party blames land buyers from North India for the state's demographic alteration and environmental degradation and is planning an 'awareness' campaign\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/india-love-affair-with-dry-days-a-lip-service-to-gandhian-values-that-must-end-opinion-2675054-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India's love affair with dry days: A lip service to Gandhian values that must endTo understand the roots of India's dry-day obsession, we need to rewind to November 1948, when the Constituent Assembly was drafting the country's Constitution."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/video/manish-sisodia-claims-money-being-distributed-in-delhis-jangpura-constituency-2675131-2025-02-05?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Manish Sisodia claims money being distributed in Delhi's Jangpura constituencyA ruckus occurred at Delhi's Jangpura constituency, as AAP leader Manish Sisodia claimed that money was being disributed. Workers of BJP and AAP confronted each other in a heated exchange."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-new-restaurant-in-himalayas-2675083-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kangana Ranaut turns restaurateur, shares glimpse of her 'little cafe' in HimalayasKangana Ranaut opens The Mountain Story, a Himachali cuisine restaurant in the Himalayas. Launching on February 14, the eatery blends tradition with a modern touch and offers scenic outdoor seating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tatas-milennial-friend-shantanu-naidu-gets-top-role-at-tata-motors-2675017-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ratan Tata's millennial friend Shantanu Naidu gets top role at Tata MotorsIn 2018, Shantanu Naidu began working as Ratan Tata's assistant, a role that brought him public attention, especially after a viral video of his birthday surprise for the industrialist.\r\n "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/health/story/age-reversing-ceo-bryan-johnson-jabs-india-again-for-poor-aqi-this-time-he-cites-a-study-2675022-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Age-reversing' CEO jabs India again for poor AQI, this time he cites a studyBryan Johnson, 47, made headlines this week after he walked out of Zerodha co-founder Nikhil Kamath's podcast midway due to poor air quality, saying that he felt a burning sensation in his throat and eyes, with rashes on his skin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/noida-police-freeze-300-fiitjee-accounts-seize-rs-60-lakh-in-probe-2675102-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Noida Police freeze 300+ FIITJEE accounts, seize Rs 60 lakh in probeFIITJEE News: Noida Police have frozen over 300 FIITJEE-linked bank accounts and seized Rs60 lakh in cash amid a financial misconduct probe. FIITJEE owner Dinesh Goyal and eight others face allegations of criminal breach of trust and conspiracy.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/video/video-priyanka-chopra-shines-bright-in-yellow-as-she-heads-for-brothers-haldi-2675198-2025-02-05",
      "headline": "Video: Priyanka Chopra shines in yellow as she heads for brother's haldi Priyanka Chopra is currently in Mumbai for her brother Siddharth Chopra's wedding. The actor was clicked as she for leaving for the haldi ceremony with her mother-in-law, Denise Miller-Jonas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/blackpink-lisa-shares-release-date-of-white-lotus-season-3-2675179-2025-02-05",
      "headline": "Blackpink's Lisa shares release date of White Lotus Season 3. WatchThe release date of the highly-anticipated White Lotus Season 3 is here. The HBO show will begin streaming from this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabu-on-exes-moving-on-naga-chaitanya-second-marriage-no-space-for-envy-2675161-2025-02-05",
      "headline": "Samantha opens up about exes moving on: No space for envy, it's root of all evilSamantha Ruth Prabhu shared her perspective on her exes moving on, emphasising that she has no room for envy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-unseen-birth-picture-abhishek-bachchan-birthday-2675154-2025-02-05",
      "headline": "Amitabh Bachchan shares unseen picture from the day son Abhishek was bornAmitabh Bachchan shared a rare hospital photo of newborn Abhishek on his 49th birthday, reflecting on how time has passed rapidly since his birth.\r\n\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ravindra-jadejas-selection-for-champions-trophy-left-me-surprised-s-badrinath-2675180-2025-02-05",
      "headline": "Ravindra Jadeja's selection for Champions Trophy left me surprised: S BadrinathFormer India cricketer Subramaniam Badrinath revealed that Ravindra Jadeja's selection in the Indian team for the England ODI series and the Champions Trophy left him surprised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-varun-chakravarthy-number-two-icc-t20i-bowling-rankings-latest-2675166-2025-02-05",
      "headline": "Varun Chakravarthy closes in on No. 1 spot, three Indians in top 10 ICC T20I Rankings: Spinner Varun Chakravarthy closed in on the top spot of the bowling rankings in men's T20Is. He won the Player of the Series award for taking 14 wickets in five matches against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-t20-rankings-abhishek-sharma-second-spot-batters-england-series-2675163-2025-02-05",
      "headline": "Abhishek Sharma jumps to second spot after England heroicsAbhishek Sharma's record-breaking century against England in the Mumbai T20I earned him a rise to second place in the latest ICC T20I rankings for batters.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-zaheer-khan-on-mayank-yadav-fitness-for-ipl-2025-lucknow-super-giants-lsg-2675148-2025-02-05",
      "headline": "LSG want Mayank Yadav 150 per cent fit, not just 100 per cent: Zaheer KhanFormer India fast bowler and Lucknow Super Giants mentor Zaheer Khan has stressed the importance of having Mayank Yadav at his 150% fitness before fielding him in the upcoming IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-may-introduce-semi-automated-var-offside-before-2024-25-season-ends-2675145-2025-02-05",
      "headline": "Premier League may introduce semi-automated VAR offside before season endsPremier League Chief Football Officer Tony Scholes has said that semi-automated offside technology could be introduced before the end of the 2024-25 season, following \"significant\" progress in testing.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mumbai-vs-haryana-ranji-trophy-quarterfinals-lahli-kolkata-eden-gardens-2675133-2025-02-05",
      "headline": "Mumbai's Ranji Trophy quarter-finals moved from Haryana to KolkataRanji Trophy: Mumbai and Haryana were scheduled to play their quarter-final in Lahli, Haryana. However, the match has been shifted to Eden Gardens, Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-ashleigh-gardner-replaces-beth-mooney-captain-gujarat-giants-2675111-2025-02-05",
      "headline": "Ashleigh Gardner replaces Beth Mooney as captain of Gujarat Giants Gujarat Giants have appointed Australian all-rounder Ashleigh Gardner as the team captain for the upcoming season of the Women's Premier League (WPL). Gardner, a key figure in Australian cricket, made her debut in 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-odi-cuttack-security-tightened-barabati-stadium-2675105-2025-02-05",
      "headline": "Security tightened in Cuttack as ODI cricket returns to city after 6 years India vs England: The Barabati Stadium in Cuttack will host an ODI match for the first time since December 2019. After the series opener in Nagpur, the two teams will head to Cuttack fro the 2nd ODI on Sunday, February 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-40th-birthday-i-am-the-greatest-in-football-2675098-2025-02-05",
      "headline": "Cristiano Ronaldo celebrates his 40th birthday: 'I am the greatest in football'Cristiano Ronaldo turned 40 on Wednesday and seems certain that he deserves the title of the greatest football player of all time. Ronaldo has scored 923 total career goals in 1,254 games.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ravi-shastri-on-jasprit-bumrah-fitness-for-icc-champions-trophy-2025-2675087-2025-02-05",
      "headline": "Bumrah's absence will hurt India's chances in Champions Trophy: Ravi ShastriICC Champions Trophy 2025: Former India cricketer and head coach Ravi Shastri feels that India's chances of winning the Champions Trophy will go down by 30% if Jasprit Bumrah remains unfit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-odi-series-brendon-mccullum-hostile-overs-strategy-joe-root-2675063-2025-02-05",
      "headline": "Brendon McCullum backs England to win ODIs vs India with 'hostile overs' strategyIND vs ENG: England head coach Brendon McCullum has backed his team to win the ODI series vs India as he expressed excitement about their 'hostile overs' strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-ashleigh-gardner-replaces-beth-mooney-captain-gujarat-giants-2675111-2025-02-05",
      "headline": "Ashleigh Gardner replaces Beth Mooney as captain of Gujarat Giants Gujarat Giants have appointed Australian all-rounder Ashleigh Gardner as the team captain for the upcoming season of the Women's Premier League (WPL). Gardner, a key figure in Australian cricket, made her debut in 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-odi-cuttack-security-tightened-barabati-stadium-2675105-2025-02-05",
      "headline": "Security tightened in Cuttack as ODI cricket returns to city after 6 years India vs England: The Barabati Stadium in Cuttack will host an ODI match for the first time since December 2019. After the series opener in Nagpur, the two teams will head to Cuttack fro the 2nd ODI on Sunday, February 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-40th-birthday-i-am-the-greatest-in-football-2675098-2025-02-05",
      "headline": "Cristiano Ronaldo celebrates his 40th birthday: 'I am the greatest in football'Cristiano Ronaldo turned 40 on Wednesday and seems certain that he deserves the title of the greatest football player of all time. Ronaldo has scored 923 total career goals in 1,254 games.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ravi-shastri-on-jasprit-bumrah-fitness-for-icc-champions-trophy-2025-2675087-2025-02-05",
      "headline": "Bumrah's absence will hurt India's chances in Champions Trophy: Ravi ShastriICC Champions Trophy 2025: Former India cricketer and head coach Ravi Shastri feels that India's chances of winning the Champions Trophy will go down by 30% if Jasprit Bumrah remains unfit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-odi-series-brendon-mccullum-hostile-overs-strategy-joe-root-2675063-2025-02-05",
      "headline": "Brendon McCullum backs England to win ODIs vs India with 'hostile overs' strategyIND vs ENG: England head coach Brendon McCullum has backed his team to win the ODI series vs India as he expressed excitement about their 'hostile overs' strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-england-hope-jamie-smith-fit-champions-trophy-2675055-2025-02-05",
      "headline": "England hopeful Jamie Smith will recover in time for Champions TrophyEngland are confident Jamie Smith will be fit for the Champions Trophy later this month, despite missing the first two of three one-day internationals against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pat-cummins-sledges-virat-kohli-in-advertisement-icc-champions-trophy-2025-2675051-2025-02-05",
      "headline": "Kohli, I've never seen you bat this slowly, Pat Cummins sledges in new viral adAustralia captain Pat Cummins was seen sledging star India batter Virat Kohli in a new advertisement for the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rashid-khan-becomes-highest-wicket-taker-in-t20-history-2675036-2025-02-05",
      "headline": "Rashid Khan becomes highest wicket-taker in T20 historyHighest T20 wicket-taker: Afghanistan legspinner Rashid Khan became the highest wicket-taker in the history of T20 cricket. Rashid took his wicket tally to 633 in T20s – better than West Indies legend Dwayne Bravo.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pat-cummins-likely-miss-champions-trophy-smith-head-captaincy-australia-2675033-2025-02-05",
      "headline": "Pat Cummins likely to miss Champions Trophy, Smith or Head to lead AustraliaICC Champions Trophy 2025: Australia captain Pat Cummins is highly unlikely to feature in the Champions Trophy due to his ongoing ankle issue, with Steve Smith and Travis Head emerging as the leading candidates to take over the captaincy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rahul-dravid-argument-with-bengaluru-auto-driver-viral-video-2675028-2025-02-05",
      "headline": "Watch: Rahul Dravid loses his cool after auto driver hits his car in BengaluruFormer India cricketer Rahul Dravid got involved in a heated argument with a Bengaluru auto driver after  a minor collision on the road with his car."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-joe-root-india-vs-england-odi-series-2674987-2025-02-05",
      "headline": "Joe Root returns to give England much needed-boost before ODI series IND vs ENG: Joe Root hasn't played an ODI since November 2023, but is expected to play a crucial role in England's upcoming series against India, starting February 6 at the VCA Stadium in Nagpur. Root bagged a golden duck when he last played an ODI against India in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/alphonse-davies-sings-rap-song-to-announce-contract-extension-with-bayern-munich-2675026-2025-02-05",
      "headline": "Alphonse Davies sings rap song to announce contract extension with Bayern MunichCanadian international Alphonso Davies (24) celebrated his contract extension at Bayern in an unconventional way, by releasing a rap song titled Munich My Throne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-parunika-sisodia-interview-mithali-raj-vvs-laxman-u19-womens-t20-world-cup-2674940-2025-02-05",
      "headline": "Parunika absorbs Laxman pep-talk, Mithali Raj advice to live World Cup dreamIn an exclusive interview with India Today Digital, left-arm spinner Parunika Sisodia opened up on India's campaign in the U19 Women's T20 World Cup. Parunika was India's most economical bowler, having taken 10 wickets. The 19-year-old also won the Player of the Match award in the semi-final against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rahul-dravid-argument-with-bengaluru-auto-driver-viral-video-2675028-2025-02-05",
      "headline": "Watch: Rahul Dravid loses his cool after auto driver hits his car in BengaluruFormer India cricketer Rahul Dravid got involved in a heated argument with a Bengaluru auto driver after  a minor collision on the road with his car."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-joe-root-india-vs-england-odi-series-2674987-2025-02-05",
      "headline": "Joe Root returns to give England much needed-boost before ODI series IND vs ENG: Joe Root hasn't played an ODI since November 2023, but is expected to play a crucial role in England's upcoming series against India, starting February 6 at the VCA Stadium in Nagpur. Root bagged a golden duck when he last played an ODI against India in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/alphonse-davies-sings-rap-song-to-announce-contract-extension-with-bayern-munich-2675026-2025-02-05",
      "headline": "Alphonse Davies sings rap song to announce contract extension with Bayern MunichCanadian international Alphonso Davies (24) celebrated his contract extension at Bayern in an unconventional way, by releasing a rap song titled Munich My Throne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-parunika-sisodia-interview-mithali-raj-vvs-laxman-u19-womens-t20-world-cup-2674940-2025-02-05",
      "headline": "Parunika absorbs Laxman pep-talk, Mithali Raj advice to live World Cup dreamIn an exclusive interview with India Today Digital, left-arm spinner Parunika Sisodia opened up on India's campaign in the U19 Women's T20 World Cup. Parunika was India's most economical bowler, having taken 10 wickets. The 19-year-old also won the Player of the Match award in the semi-final against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kevin-pietersen-praises-abhishek-sharmas-stroke-play-in-mumbai-2675018-2025-02-05",
      "headline": "Pietersen in awe of Abhishek Sharma's stroke play: There were no funky shotsFormer England batter Kevin Pietersen praised India youngster Abhishek Sharma's stroke play after his sensational hundred against England during the fifth T20I in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-shubman-gill-praises-rohit-sharmas-odi-batting-2675009-2025-02-05",
      "headline": "Rohit's ODI batting has been game-changing, helped team a lot: GillShubman Gill feels that Rohit Sharma's ODI batting has been a game changer for the Indian team in recent times. Rohit started using the attacking template during the ODI World Cup 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/simona-halep-retirement-tennis-transylvania-open-2674995-2025-02-05",
      "headline": "Simona Halep announces retirement after Transylvania Open exit Simona Halep announced her retirement from professional tennis after losing to Lucia Bronzetti in the first round of the Transylvania Open. The now 33-year-old became the World No.1 in 2017 and also went on to win two Grand Slams and 24 WTA titles in her illustrious career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-virat-kohli-rohit-sharma-kevin-pietersen-2674964-2025-02-04",
      "headline": "Virat Kohli, Rohit Sharma aren't 'robots,' deserve more respect: Kevin PietersenKevin Pietersen has called for the fans to be more sympathetic towards Virat Kohli and Rohit Sharma and said that both stars deserve more respect. Kohli and Rohit struggled during the Border-Gavaskar Trophy in Australia. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}