{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-ipo-gmp-date-review-details-2798256-2025-10-06",
      "headline": "Tata Capital IPO opens: Check GMP, key details, and should you apply or skip?The price band has been set at Rs 310 to Rs 326 per share, with a lot size of 46 shares. This means retail investors need a minimum of Rs 14,260 to participate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/hospital-stocks-rise-after-cghs-rate-revision-should-you-buy-2798235-2025-10-06",
      "headline": "Hospital stocks rise after CGHS rate revision. Should you buy?Hospital stocks are in focus today after the government announced the biggest revision in Central Government Health Scheme package rates in 15 years. The new rates, covering nearly 2,000 medical procedures, will come into effect from October 13, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-news-sensex-nifty-opening-hospital-shares-2798227-2025-10-06",
      "headline": "Sensex, Nifty see muted start; Tata Capital IPO in focusThe S&P BSE Sensex was up 44.18 points to 81,251.35 around 9:23 am, while the NSE Nifty50 was trading 18.45 points higher at 24,923."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sip-vs-rd-recurring-deposit-where-should-your-monthly-savings-go-sip-or-rd-which-is-better-2797919-2025-10-05",
      "headline": "SIP vs RD: Where should your monthly savings go?Would you rather sleep peacefully or grow wealthy quietly? That's essentially what the SIP vs RD debate boils down to. Both allow disciplined monthly investing, but one protects capital while the other builds it. So which one deserves your money?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-probes-dark-pattern-after-man-exposes-extra-fees-on-cash-on-delivery-2797655-2025-10-04",
      "headline": "Man flags extra charge on cash-on-delivery payments, Centre launches probeThe Department of Consumer Affairs has launched an investigation into e-commerce sites charging additional fees on cash-on-delivery payments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/agent-body-protest-gst-reform-zero-insurance-distribution-input-tax-credit-prashant-mhatre-2797322-2025-10-03",
      "headline": "Agents' body questions GST cut, says move undermines insurance distributionPrashant Mhatre, All India President of the General Insurance Agents Federation Integrated (GIAFI), has sounded an alarm, saying the decision risks weakening the role of agents, brokers, and advisors who are central to India's insurance reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-a-personal-loan-do-not-make-these-5-errors-2795807-2025-10-03",
      "headline": "Planning a personal loan? Don't make these 5 errorsWhile personal loans can be a handy financial tool, they come with risks if mismanaged. Avoid these five common errors to keep your finances safe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chennai-firm-wintrack-customs-official-bribery-corruption-charge-import-export-sector-cripple-2797228-2025-10-03",
      "headline": "Wintrack vs Chennai Customs is a sorry tale of grease of doing business in IndiaChennai-based logistics company Wintrack has ceased Indian operations, alleging repeated bribery demands and harassment by Chennai Customs, exposing the ugly truth that at Indian Customs integrity is the real contraband.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-government-may-revise-circle-rates-public-feedback-invited-2797279-2025-10-03",
      "headline": "Delhi government may revise circle rates, public feedback invitedThe Delhi government is considering a revision of circle rates across the city and has called on the public to share their views before any changes are finalised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-trap-to-watch-2025-room-rent-caps-deductibles-co-pays-save-money-2797278-2025-10-03",
      "headline": "Health insurance in 2025: Key traps that could drain your pocketClauses such as room rent caps, deductibles, and co-pay options are often buried deep in policy documents but can have a massive influence on the claim process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-higher-metal-stocks-gain-tata-steel-2797261-2025-10-03",
      "headline": "Sensex, Nifty recover losses to end higher fuelled by gains in metal stocksThe S&P BSE Sensex added 223.86 points to close at 81,207.17, while the NSE Nifty50 gained 57.95 points to end at 24,894.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/63-of-households-aware-yet-only-95-invest-in-markets-sebi-survey-shows-2797218-2025-10-03",
      "headline": "63% of households aware, yet only 9.5% invest in markets, Sebi survey showsDespite growing awareness about investing in the markets, the latest Sebi survey shows that only a small fraction of households, i.e., just 9.5%, are actively investing."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raghav-juyal-recalls-first-visit-to-shah-rukh-khan-mannat-aryan-khan-gets-a-whole-floor-2798232-2025-10-06",
      "headline": "Raghav Juyal recalls first visit to SRK's Mannat: Aryan Khan gets a whole floor Actor Raghav Juyal recalled being amazed by Shah Rukh Khan's luxurious Mannat and its strict security during his first visit to meet Aryan Khan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-visits-sri-sathya-sai-baba-ashram-amid-rashmika-mandanna-engagement-rumours-2798218-2025-10-06",
      "headline": "Vijay Deverakonda visits Sai Baba ashram with family, fans spot engagement ring Vijay Deverakonda visited Sri Sathya Sai Baba's ashram with family amid engagement rumour buzz. Fans spotted a ring on his finger, fuelling speculation about his wedding plans with Rashmika Mandanna."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-celebrates-sister-in-law-neelams-birthday-with-special-video-2798216-2025-10-06",
      "headline": "Priyanka Chopra celebrates sister-in-law Neelam's birthday with special video Priyanka Chopra shared a heartfelt birthday wish for her sister-in-law, Neelam Upadhyaya, posting a carousel of family moments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-aneet-padda-opens-up-on-scam-auditions-cold-emailing-70-producers-2798198-2025-10-06",
      "headline": "Saiyaara's Aneet Padda opens up on scam auditions, cold emailing 70 producers Actor Aneet Padda opened up about her early struggles before fame, sharing how she once sent audition tapes and cold emails to dozens of production houses in search of work."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-box-office-collection-nears-rs-300-crore-rishab-shetty-2798175-2025-10-06",
      "headline": "Kantara Chapter 1 box office Day 4: Rs 300 crore in sight, biggest Kannada opener Rishab Shetty's 'Kantara: Chapter 1' is set to cross Rs 300 crore at the box office after a strong four-day run. The film has become the third highest grossing Kannada movie, challenging previous records."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/abhishek-bajaj-cheating-allegations-response-bigg-boss-19-akansha-jindal-controversy-2798090-2025-10-05",
      "headline": "Bigg Boss 19's Abhishek Bajaj breaks silence on Akansha Jindal's cheating claims 'Bigg Boss 19' contestant Abhishek Bajaj responds to his ex-wife Akansha Jindal's claims of infidelity during their marriage. Bajaj calls the allegations \"heartbreaking and deeply unfair\" while urging the media not to promote negative narratives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-barefoot-walk-bombay-fashion-week-fashion-comeback-2798004-2025-10-05",
      "headline": "Smriti Irani makes runway comeback after 26 years with symbolic walk. Watch Smriti Irani made a return to the fashion runway after 26 years. She walked barefoot, which many saw as a statement of authenticity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-fan-dressed-daiva-dindigul-screening-2798030-2025-10-05",
      "headline": "Kantara Chapter 1 fan dressed as Daiva stuns audience at Dindigul screening 'Kantara: Chapter 1' earned more than Rs 150 crore at box office in three days. A fan dressed as Panjurli deity drew attention at the Dindigul screening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-spiritual-journey-himalayas-simple-lifestyle-2798016-2025-10-05",
      "headline": "Rajinikanth enjoys spiritual break in Rishikesh, relishes meal roadside Veteran actor Rajinikanth took a break from his professional commitments and embarked on a spiritual journey to the Himalayas. Pictures of him leading a simple life away from stardom have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/elon-musk-angry-netflix-dead-end-paranormal-park-2797999-2025-10-05",
      "headline": "Why Elon Musk is angry 3 years after Netflix cancelled 'Dead End: Paranormal Park' 'Dead End: Paranormal Park', the show that drew Elon Musk's ire, was cancelled after two seasons, but the series is still available on Netflix"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-opalite-lyrics-travis-kelce-kayla-nicole-reaction-2797953-2025-10-05",
      "headline": "Travis Kelce's ex Kayla Nicole breaks silence on Taylor Swift's Opalite Taylor Swift releases her twelfth studio album, 'The Life of a Showgirl', sparking speculation over the track 'Opalite'. Kayla Nicole, Travis Kelce's former partner, shares posts interpreted by many as responses to the song."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arbaaz-khan-wife-sshura-khan-welcome-their-first-child-2797763-2025-10-05",
      "headline": "Arbaaz Khan, wife Sshura welcome first child: Sources Actor Arbaaz Khan and Sshura Khan welcome their first child. Sshura was admitted to PD Hinduja Hospital hours before the birth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-dadasaheb-phalke-award-kerala-felicitation-malayalam-cinema-2797959-2025-10-05",
      "headline": "Kerala government honours Mohanlal after Dadasaheb Phalke win Kerala government honoured veteran actor Mohanlal for receiving the Dadasaheb Phalke Award. The ceremony, held in Thiruvananthapuram, was attended by Chief Minister Pinarayi Vijayan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/samay-rana-sugar-daddy-post-debate-yuzvendra-chahal-dhanashree-verma-split-divorce-2797950-2025-10-05",
      "headline": "Dhanashree Verma shares cryptic post after Samay Raina, Yuzvendra Chahal's banter Stand-up comic Samay Rana's post referencing Yuzvendra Chahal sparked debate online. Soon after his video, Dhanshree Verma shared a cryptic post which is believed to be a dig at Raina. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-elvish-yadav-hosts-new-task-eight-nominees-eviction-weekend-ka-vaar-2797944-2025-10-05",
      "headline": "Bigg Boss 19 ep 42: Salman Khan jokes with Elvish Yadav as he appears on show Internet personality Elvish Yadav appeared on 'Bigg Boss 19' for a Weekend Ka Vaar episode. Salman Khan greeted Elvish with his catchphrase and introduced a task for contestants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-shares-slide-elon-musk-boycott-call-dead-end-paranormal-park-2797937-2025-10-05",
      "headline": "Netflix cap drops around $15 billion after Elon Musk's boycott call Elon Musk's boycott Netflix call sends shares tumbling, sparking a new culture clash. His posts on X came after he cancelled his own subscription to the streaming platform while taking a dig at it. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-orange-door-campaign-ai-videos-12-cities-fan-puzzle-2797927-2025-10-05",
      "headline": "Taylor Swift's The Life of a Showgirl sparks global orange door hunt Taylor Swift launched an international promotional puzzle for her new album. Orange doors with QR codes have appeared in cities such as London and Berlin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-breast-cancer-mental-strength-family-support-work-resilience-2797918-2025-10-05",
      "headline": "Hina Khan opens up on taboo around cancer in the entertainment industry Actor Hina Khan discusses the stigma surrounding cancer among artists and advocates for continued work. The actor shares her experience after being diagnosed with stage three breast cancer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anshula-kapoor-honours-late-mother-mona-shourie-engagement-outfit-maheep-kapoor-performs-duties-2797899-2025-10-05",
      "headline": "Anshula Kapoor honours late mother with engagement outfit, Maheep performs duties Maheep Kapoor performed mother duties at Anshula Kapoor and Rohan Thakkar's Gor Dhana ceremony. Attended by family members, several pictures from the event have emerged online. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/election-commission-likely-to-announce-bihar-assembly-election-dates-at-4-pm-today-2798233-2025-10-06",
      "headline": "Bihar election dates likely to be announced at 4 pmAhead of the polls, the EC has implemented 17 new election reforms, including webcasting at polling stations and voter list 'purification' through a Special Intensive Revision (SIR) exercise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/rajasthan/story/jaipur-sawai-man-singh-hospital-fire-patients-killed-staff-negligence-2798170-2025-10-06",
      "headline": "7 patients dead in Jaipur hospital fire, families allege staff fled after blazeFamilies of the victims have alleged that the staff fled soon after the blaze, suspected to have been caused by a short circuit, erupted on the second floor of the state-run Sawai Man Singh Hospital in Jaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistani-minister-warns-india-after-army-chief-warning-terrorism-cross-border-strikes-2798192-2025-10-06",
      "headline": "Will bury India under debris of its own warplanes, says Pak Defence MinisterPakistani Defence Minister Khawaja Asif warned India of severe consequences, following comments from Indian Army chief Gen Upendra Dwivedi about erasing Pakistan from the world map if it failed to stop terrorism on its soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/reported-sale-of-jf-17-jet-engines-to-pakistan-will-benefit-india-russian-experts-glbs-2798166-2025-10-06",
      "headline": "Reported sale of JF-17 jet engines to Pakistan will benefit India: Russian expertsRussian defence experts said the reported sale of RD-93 engines to Pakistan could benefit India in two ways, dismissing opposition criticism in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/india-record-22-medals-world-para-athletics-championships-navdeep-singh-silver-2798205-2025-10-06",
      "headline": "Navdeep Singh roars as India finish with record medal haul in World Para ChampsOne of India's favourite javelin throwers - Navdeep roared again at the JLN Stadium on Sunday, as the clinched the silver medal in F41 category. With 4 medals on the final day of the competition, India finished with their best ever medal tally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cough-syrup-deaths-case-dr-praveen-soni-defended-prescribing-coldrif-before-his-arrest-in-madhya-pradesh-2798246-2025-10-06",
      "headline": "Prescribing Coldrif for 10 years: Doctor arrested in cough syrup deaths caseMadhya Pradesh Police arrested Dr Soni on Saturday after 16 children in Chhindwara and Betul districts died following consumption of Coldrif syrup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-cm-proposes-basava-metro-renaming-namma-metro-bengaluru-2798042-2025-10-05",
      "headline": "Namma Metro gone? Karnataka proposes to rename Bengaluru metro as 'Basava Metro'Basavanna, revered as Vishwaguru Basavanna, was a 12th-century saint and statesman who founded the Anubhava Mantapa, the first democratic spiritual assembly, and championed equality and social reform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gaza-negotiations-advancing-rapidly-first-phase-finished-this-week-trump-glbs-2798165-2025-10-06",
      "headline": "Move fast or there'll be massive bloodshed, Trump warns amid Gaza peace talksTrump's remarks come just hours after his warning that Hamas will face \"complete obliteration\" if it does not cede power and control in Gaza as per his peace plan. The deadline for Hamas ended at 6 pm Washington time (EDT) on Sunday -- 3:30 am IST on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/hikaru-nakamura-throws-gukesh-king-checkmate-controversy-2798119-2025-10-05",
      "headline": "Watch: Hikaru Nakamura throws D Gukesh's king into the crowd after Checkmate winWorld No.2 Hikaru Nakamura courted controversy during the Checkmate tournament as he threw D Gukesh's king after beating him in the match on Saturday, October 4. India were soundly beaten by the USA on the day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/story/jaipur-sawai-man-singh-hospital-blaze-families-witnesses-recount-horror-no-fire-extinguishers-patients-carried-out-to-streets-2798208-2025-10-06",
      "headline": "No fire extinguishers, carried patients out: Witnesses expose Jaipur hospital lapsesSeven people were killed after the blaze, suspected to have been caused by a short circuit, erupted on the second floor of Jaipur's Sawai Man Singh Hospital, the largest state-run hospital in Jaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/sridhar-vembu-says-arattai-looks-simple-but-hides-20-years-of-deep-homegrown-tech-2798222-2025-10-06",
      "headline": "Sridhar Vembu says Arattai looks simple but hides 20 years of deep homegrown tech​​​​​​​Zoho co-founder and Chief Scientist Sridhar Vembu has said that the company's messaging app, Arattai, may look simple from the outside but is actually built on two decades of in-house engineering and research."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/tempo-traveller-overturns-dakshina-kannada-avoiding-woman-road-injuries-driver-passengers-2798217-2025-10-06",
      "headline": "Video: Minibus hits divider, overturns while trying to avoid woman crossing roadA minibus hit a divider and overturned in Karnataka's Dakshina Kannada district after attempting to avoid a woman crossing the road. The woman was unharmed, while the driver and passengers sustained injuries in the incident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/indian-manager-denies-sick-leave-to-employee-with-headache-whatsapp-chat-viral-2798020-2025-10-05",
      "headline": "Indian manager denies sick leave to employee with headache, WhatsApp chat goes viralAn Indian manager's response to an employee asking for sick leave due to a headache has sparked online debate after their WhatsApp chat went viral."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/loss-of-lives-due-to-fire-tragedy-deeply-saddening-pm-modi-condoles-deaths-jaipur-sms-hospital-fire-2798228-2025-10-06",
      "headline": "Loss of lives deeply saddening: PM condoles deaths in Jaipur hospital firePrime Minister Narendra Modi expressed his condolences over the deaths of seven people in a fire at a state-run hospital in Jaipur late on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/zubeen-garg-death-negligence-accusations-murder-charges-investigation-update-2798132-2025-10-05",
      "headline": "Didn't allow him to sleep: Zubeen Garg's bandmate blames manager, fellow musicianPartha Pratim Goswami claimed that Siddharth Sharma (Garg's manager) and Shekhar Jyoti Goswami (fellow bandmate) kept Zubeen Garg from resting and took him to the sea for their own amusement, which was a reckless mistake. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nobel-prize-2025-announcements-to-begin-today-with-medicine-award-2798110-2025-10-06",
      "headline": "Nobel Prize 2025 announcements to begin today with Medicine awardThe first award, for medicine, will be announced by the Nobel Assembly at Sweden's Karolinska Institute on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-iim-ahmedabad-defies-placement-trends-2797834-2025-10-05",
      "headline": "How IIM Ahmedabad defies placement trendsWith Rs 35 lakh average salary for the business management and Rs 20 lakh for agribusiness graduates, IIMA's placement holds steady amid global headwinds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tension-in-cuttack-after-violent-clashes-during-durga-puja-immersion-vhp-calls-bandh-2798099-2025-10-05",
      "headline": "Internet shut in Cuttack after violence over Durga Puja clashes; VHP calls for bandhCuttack authorities deployed 60 police platoons and eight paramilitary companies, imposed a curfew under Section 163 BNSS, and said only essential services would remain open for the day. The Vishwa Hindu Parishad has announced a 12-hour bandh on Monday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-origin-motel-owner-shot-dead-in-pittsburgh-us-glbs-2798164-2025-10-06",
      "headline": "Indian-origin motel owner shot dead in US after asking gunman, 'Are you alright?'The victim, Rakesh Ehagaban, was killed by Stanley Eugene West, who also shot a woman and a detective before being arrested. Investigators said the attack appeared deliberate and unprovoked."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/muneeba-ali-controversial-run-out-india-pakistan-womens-world-cup-2798108-2025-10-05",
      "headline": "Muneeba Ali controversial run out in India vs Pakistan clash: MCC law explainedMuneeba Ali was controversially run out against India in the Women's World Cup at the R Premadasa Stadium, leaving Pakistan frustrated over the umpire's decision.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-rss-chief-likens-pok-to-room-in-our-home-says-it-must-be-reclaimed-mohan-bhagwat-on-partition-pakistan-2798179-2025-10-06",
      "headline": "Video: RSS chief likens POK to 'room in our home', says it must be reclaimedMohan Bhagwat's remarks came days after Defence Minister Rajnath Singh said India would regain POK \"without aggression.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-aneet-padda-opens-up-on-scam-auditions-cold-emailing-70-producers-2798198-2025-10-06",
      "headline": "Saiyaara's Aneet Padda opens up on scam auditions, cold emailing 70 producersActor Aneet Padda opened up about her early struggles before fame, sharing how she once sent audition tapes and cold emails to dozens of production houses in search of work."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/suspected-arson-attack-on-mosque-in-peacehaven-near-brighton-amid-rising-hate-crimes-uk-2798142-2025-10-05",
      "headline": "Masked men torch UK mosque with worshippers inside, cops suspect hate crimeTwo individuals wearing balaclavas tried to force their way into the mosque on Saturday night, and when they failed, they poured gasoline on the steps and set them on fire."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-odi-captaincy-monty-panesar-reaction-2798237-2025-10-06",
      "headline": "Wouldn't be surprised if Shubman Gill becomes India's T20I captain too: Panesar Former England spinner Monty Panesar praised Shubman Gill's appointment as India's next ODI captain and added that he wouldn't be surprised if the star opener were also handed the T20I captaincy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/women-world-cup-pakistan-diana-baig-reaction-muneeba-ali-controversial-run-out-vs-india-2798214-2025-10-06",
      "headline": "Pakistan break silence on Muneeba Ali's controversial run-out vs India Pakistan pacer Diana Baig refrained from adding more fuel to the fire over opening batter Muneeba Ali's controversial run-out against India in the sixth match of the Women's World Cup 2025 at the R. Premadasa Stadium in Colombo on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/india-record-22-medals-world-para-athletics-championships-navdeep-singh-silver-2798205-2025-10-06",
      "headline": "Navdeep Singh roars as India finish with record medal haul in World Para Champs One of India's favourite javelin throwers - Navdeep roared again at the JLN Stadium on Sunday, as the clinched the silver medal in F41 category. With 4 medals on the final day of the competition, India finished with their best ever medal tally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20i-series-sweep-vs-afghanistan-saif-hassan-sharjah-2798196-2025-10-06",
      "headline": "3rd T20I: Saif Hassan helps Bangladesh complete series sweep over Afghanistan Bangladesh completed a commanding 3-0 clean sweep over Afghanistan in the T20I series in Sharjah, successfully executing their chase in all three matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/women-world-cup-kranti-gaud-india-vs-pakistan-controversy-success-mantra-2798188-2025-10-06",
      "headline": "Focus on bowling, not on India-Pakistan talk: Kranti reveals her success mantra India's newest pace sensation Kranti Gaud revealed that she remains unfazed by the hype surrounding the India-Pakistan rivalry, saying her focus is solely on her bowling. The young pacer starred with a match-winning spell as India defeated Pakistan by 88 runs in their ICC Women's World Cup clash in Colombo."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-cramps-video-shanghai-masters-2798185-2025-10-06",
      "headline": "Unable to even walk due to cramps, Jannik Sinner retires from Shanghai Masters World No.2 Jannik Sinner limped off the court in the third round of the Shanghai Masters. Sinner, facing intense cramps, had to be carried out by his physio."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-world-cup-pakistan-sri-lanka-wins-fielding-errors-drs-mistakes-2798178-2025-10-06",
      "headline": "Women's World Cup: Dodgy India need to tighten up despite dream start India are sitting atop the Women's World Cup table, but poor DRS decisions, sloppy catching, and inconsistent batting highlight cracks that could cost them against stronger teams like Australia and England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-nz-w-vs-sa-w-sinalo-jafta-press-conference-2798151-2025-10-05",
      "headline": "Can't dwell on one performance, it's a long tournament: Sinalo Jafta South Africa wicketkeeper batter Sinalo Jafta said that their team will not dwell too much on the opening match horror against England as they have a long tournament ahead. The Proteas women will next take on New Zealand in their second fixture in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-clinch-series-win-over-australia-a-with-thrilling-two-wicket-chase-2798145-2025-10-05",
      "headline": "IND-A vs AUS-A: Prabhsimran hundred helps India A win 3rd ODI and claim series Prabhsimran Singh's blazing hundred and fifties from Shreyas Iyer and Riyan Parag helped India close out a thrilling win against Australia A to win the 3rd ODI and claim the series 2-1 on Sunday, October 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/want-to-win-world-cup-for-pioneers-of-indian-womens-cricket-jemimah-rodrigues-2798150-2025-10-05",
      "headline": "Want to win World Cup for pioneers of Indian women's cricket: Jemimah Rodrigues India women's cricket team continues their unbeaten streak with a dominant win over Pakistan. The squad aims to honour past pioneers by winning the 2025 Women's World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-kranti-goud-world-cup-heroics-family-led-screen-2798148-2025-10-05",
      "headline": "World Cup: Village watches on giant LED screen as Kranti Goud shines against Pakistan Kranti Goud was thrilled with her performance against Pakistan and said that her family had installed a big LED screen to watch the game on Sunday, October 5. Goud picked up three wickets to help India beat Pakistan comprehensively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-world-cup-pakistan-sri-lanka-wins-fielding-errors-drs-mistakes-2798178-2025-10-06",
      "headline": "Women's World Cup: Dodgy India need to tighten up despite dream start India are sitting atop the Women's World Cup table, but poor DRS decisions, sloppy catching, and inconsistent batting highlight cracks that could cost them against stronger teams like Australia and England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-nz-w-vs-sa-w-sinalo-jafta-press-conference-2798151-2025-10-05",
      "headline": "Can't dwell on one performance, it's a long tournament: Sinalo Jafta South Africa wicketkeeper batter Sinalo Jafta said that their team will not dwell too much on the opening match horror against England as they have a long tournament ahead. The Proteas women will next take on New Zealand in their second fixture in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-clinch-series-win-over-australia-a-with-thrilling-two-wicket-chase-2798145-2025-10-05",
      "headline": "IND-A vs AUS-A: Prabhsimran hundred helps India A win 3rd ODI and claim series Prabhsimran Singh's blazing hundred and fifties from Shreyas Iyer and Riyan Parag helped India close out a thrilling win against Australia A to win the 3rd ODI and claim the series 2-1 on Sunday, October 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/want-to-win-world-cup-for-pioneers-of-indian-womens-cricket-jemimah-rodrigues-2798150-2025-10-05",
      "headline": "Want to win World Cup for pioneers of Indian women's cricket: Jemimah Rodrigues India women's cricket team continues their unbeaten streak with a dominant win over Pakistan. The squad aims to honour past pioneers by winning the 2025 Women's World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-kranti-goud-world-cup-heroics-family-led-screen-2798148-2025-10-05",
      "headline": "World Cup: Village watches on giant LED screen as Kranti Goud shines against Pakistan Kranti Goud was thrilled with her performance against Pakistan and said that her family had installed a big LED screen to watch the game on Sunday, October 5. Goud picked up three wickets to help India beat Pakistan comprehensively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fatima-sana-pakistan-bowling-fly-swarm-delays-india-match-womens-world-cup-2025-2798141-2025-10-05",
      "headline": "Pakistan captain Fatima Sana sprays pest control in IND vs PAK clash, video goes viralWomen's World Cup: Fatima Sana sprayed pest control to tackle a fly infestation during the clash against India. She also starred with the ball after taking two wickets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-beat-pakistan-88-runs-womens-world-cup-unbeaten-record-2798143-2025-10-05",
      "headline": "12-0: India dismantle Pakistan in Colombo to extend dominance, top tableWomen's World Cup 2025, INDW vs PAKW: Harmanpreet Kaur's India extended their dominance over Pakistan with a thumping 88-run win over their arch-rivals on Sunday, October 5 at the R Premadasa Stadium in Colombo. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-confident-bounce-back-new-zealand-womens-world-cup-2025-indore-2798135-2025-10-05",
      "headline": "After England horror, South Africa confident of bouncing back vs New ZealandSouth Africa aim to recover after a heavy defeat in their Women's World Cup 2025 opener against England. The Proteas women got all out for 69 and suffered a ten-wicket defeat in their first fixture."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-new-zealand-vs-south-africa-sophie-devine-suzie-bates-2798138-2025-10-05",
      "headline": "No replacing Sophie Devine, every opposition fears the way she plays: Suzie BatesSuzie Bates has said that no one can replace Sophie Devine in the New Zealand team and claimed that every team fears the all-rounder for the way she plays the game. Devine is set to retire from ODIs after the completion of the World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-23-man-squad-khalid-jamil-afc-asian-cup-qualifiers-sandhu-suhail-2798121-2025-10-05",
      "headline": "AIFF name India's 23-man squad for AFC Asian Cup qualifiers in SingaporeIndia has finalised a 23-member squad for the AFC Asian Cup 2027 qualifiers against Singapore. The Blue Tigers face a must-win challenge to keep qualification hopes alive in Group C."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/hikaru-nakamura-throws-gukesh-king-checkmate-controversy-2798119-2025-10-05",
      "headline": "Watch: Hikaru Nakamura throws D Gukesh's king into the crowd after Checkmate winWorld No.2 Hikaru Nakamura courted controversy during the Checkmate tournament as he threw D Gukesh's king after beating him in the match on Saturday, October 4. India were soundly beaten by the USA on the day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/george-russell-wins-singapore-gp-mclaren-clinches-constructors-title-2024-2798112-2025-10-05",
      "headline": "Singapore GP: Mercedes' George Russell takes win, McLaren take constructors' titleGeorge Russell claims victory at the Singapore Grand Prix while McLaren clinches the Formula 1 constructors' title, and despite the tensions after Norris and Piastri made contact in a challenging, heat-affected race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-23-man-squad-khalid-jamil-afc-asian-cup-qualifiers-sandhu-suhail-2798121-2025-10-05",
      "headline": "AIFF name India's 23-man squad for AFC Asian Cup qualifiers in SingaporeIndia has finalised a 23-member squad for the AFC Asian Cup 2027 qualifiers against Singapore. The Blue Tigers face a must-win challenge to keep qualification hopes alive in Group C."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/hikaru-nakamura-throws-gukesh-king-checkmate-controversy-2798119-2025-10-05",
      "headline": "Watch: Hikaru Nakamura throws D Gukesh's king into the crowd after Checkmate winWorld No.2 Hikaru Nakamura courted controversy during the Checkmate tournament as he threw D Gukesh's king after beating him in the match on Saturday, October 4. India were soundly beaten by the USA on the day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/george-russell-wins-singapore-gp-mclaren-clinches-constructors-title-2024-2798112-2025-10-05",
      "headline": "Singapore GP: Mercedes' George Russell takes win, McLaren take constructors' titleGeorge Russell claims victory at the Singapore Grand Prix while McLaren clinches the Formula 1 constructors' title, and despite the tensions after Norris and Piastri made contact in a challenging, heat-affected race."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/muneeba-ali-controversial-run-out-india-pakistan-womens-world-cup-2798108-2025-10-05",
      "headline": "Muneeba Ali controversial run out in India vs Pakistan clash: MCC law explainedMuneeba Ali was controversially run out against India in the Women's World Cup at the R Premadasa Stadium, leaving Pakistan frustrated over the umpire's decision.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/muneeba-ali-run-out-controversy-india-vs-pakistan-womens-world-cup-2025-2798107-2025-10-05",
      "headline": "Run-out drama: Muneeba dismissed in controversial fashion during IND vs PAK tieDrama erupted during the India vs Pakistan clash as Muneeba Ali was run-out in controversial fashion in Colombo on Sunday, October 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suzie-bates-new-zealand-vs-south-africa-womens-world-cup-2025-2798101-2025-10-05",
      "headline": "Can't read too much into South Africa's collapse against England: Suzie BatesNew Zealand veteran Suzie Bates has said that they will expect South Africa to bounce back from their embarrassing loss to England in the opening match of the Women's World Cup 2025. South Africa were bowled out for just 69 in the opening game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-exclusion-india-odi-squad-for-australia-kris-srikkanth-2798067-2025-10-05",
      "headline": "Samson scored a 100 in his last ODI, how Dhruv Jurel came in?: Former SelectorFormer India cricketer and chief selector Kris Srikkanth has slammed the Indian team management for not picking Sanju Samson in the ODI squad for the Australia tour. In his place, the selectors showed faith in Dhruv Jurel, who's yet to make his ODI debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/alex-pereira-wins-ufc-light-heavyweight-title-first-round-tko-magomed-ankalaev-2798073-2025-10-05",
      "headline": "Alex Pereira reclaims his throne with 1st round knockout win vs Magomed AnkalaevAlex Pereira captured the UFC light heavyweight championship with a dominant first-round stoppage over Magomed Ankalaev at UFC 320, ending Ankalaev's 14-fight unbeaten run. Pereira avenged his March loss, while Merab Dvalishvili set a new takedown record in the co-main event and other fighters delivered statement wins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-smriti-mandhana-trolled-failure-womens-world-cup-2025-2798072-2025-10-05",
      "headline": "Bilaterals hero, ICC events zero: Smriti Mandhana trolled after PAK failureFans trolled Smriti Mandhana after she once again failed to deliver with the bat in the Women's World Cup 2025 during the India vs Pakistan clash in Colombo on Sunday, October 5. Mandhana hasn't had the best start in the tournament.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-womens-world-cup-bug-outbreak-colombo-pest-control-2798066-2025-10-05",
      "headline": "Bug outbreak disrupts IND vs PAK clash, groundsmen rush in with pest control measuresIND vs PAK, Women's World Cup 2025: The India-Pakistan women's World Cup match was halted due to a sudden bug infestation on the field. This rare stoppage caused a 15-minute delay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/estevaos-stoppage-time-goal-chelsea-beats-liverpool-third-straight-defeat-2798045-2025-10-05",
      "headline": "Liverpool boss Arne Slot says no need to panic after painful loss to ChelseaLiverpool boss Arne Slot said that there is no reason to panic after their loss to Chelsea on Saturday, October 4. This was the second consecutive loss for Liverpool in stoppage time as they lost grip of the top spot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-odi-captaincy-aaron-finch-backs-india-white-ball-leadership-australia-tour-2798037-2025-10-05",
      "headline": "Having Rohit, Kohli will calm things down as Gill takes over ODI captaincy: FinchAaron Finch has expressed strong confidence in Shubman Gill as he takes over India's ODI captaincy. Finch believes Gill's leadership and support from senior players will ensure a smooth transition and success against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-womens-world-cup-2025-toss-controversy-referee-error-2798025-2025-10-05",
      "headline": "Toss fixing? Pakistan captain gets to decide despite making wrong call vs IndiaThe India-Pakistan Women's World Cup 2025 match has been marred by a toss controversy due to the match referee's mistake. Pakistan captain Fatima Sana was allowed to choose despite making the wrong call at the toss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irani-cup-2025-yash-thakur-yash-dhull-clash-vidarbha-win-2798024-2025-10-05",
      "headline": "Watch: Yash Dhull, Yash Thakur almost trade blows during intense Irani Cup final dayYash Dhull and Yash Thakur almost came to blows on the final day of the Irani Cup 2025. Thakur's celebration didn't sit well with Dhull, who charged towards the pacer and both men had to be separated by players and officials. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-11-0-ind-vs-pak-rivalrly-womens-world-cup-colombo-2798013-2025-10-05",
      "headline": "11-0 not a rivalry: Suryakumar trolls Pakistan ahead of Women's World Cup clashIndia men's T20I captain Suryakumar Yadav confidently predicts a 12-0 winning streak for India women against Pakistan. His remarks highlight the one-sided nature of the India-Pakistan cricket rivalry and the strong form of the Indian women's team."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}