{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-308-points-lower-nifty-below-24700-titan-up-2-2766579-2025-08-05",
      "headline": "Sensex ends over 308 points lower, Nifty below 24,700; Titan up 2%The S&P BSE Sensex ended the session 308.47 points lower at 80,710.25, while the NSE Nifty50 fell 73.20 points to settle at 24,649.55. All the broader market indices ended the trading session in negative territory after Trump said he would impose more tariffs on India over Russian oil imports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/a-property-seller-nearly-paid-rs-187-lakh-more-in-tax-due-to-a-common-capital-gains-error-2766498-2025-08-05",
      "headline": "How one tax mistake could have cost a real estate seller Rs 1.87 lakhReal estate sellers often ignore deductions that can help reduce capital gains tax."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ethanol-blended-petrol-india-government-push-reason-explained-2766519-2025-08-05",
      "headline": "Why the government wants to blend more ethanol with petrolBy March 2025, the government hit its E20 blending target—20% ethanol in petrol—five years ahead of schedule. Average blending levels stood at 17.98% in February 2025, up from 14.6% the year before, according to official data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-for-the-first-time-do-this-before-anything-else-2766485-2025-08-05",
      "headline": "Filing ITR for the first time? Do this before anything elseThe last date to file your ITR for the financial year 2024–25 is September 15, 2025, so it's best to begin early and avoid the last-minute rush."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pan-20-to-go-live-in-18-months-what-it-means-and-how-it-affects-you-2766433-2025-08-05",
      "headline": "PAN 2.0 to go live in 18 months: What it means and how it affects youThe Rs 1,435 crore project will focus on simplifying taxpayer registration services and improving the overall experience through a new, unified online platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-india-tariff-threat-russian-oil-imports-real-reason-explained-2766445-2025-08-05",
      "headline": "Why is Trump threatening India over Russian oil? Here's the real reasonIs Donald Trump really upset about India buying Russian oil, or is this just a calculated move to boost US energy exports, appease oil lobbyists, and reshape global trade flows?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-p-b-balaji-jaguar-land-rover-new-ceo-2766412-2025-08-05",
      "headline": "Who is P B Balaji, Jaguar Land Rover's new CEO?The decision was confirmed in a stock exchange filing on August 4, 2025. Balaji's appointment marks a major shift, as he moves from a financial leadership role to the driver's seat of one of the world's most recognised car brands."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-investors-worried-trump-tariff-threat-sensex-nifty-fall-today-2766386-2025-08-05",
      "headline": "Sensex tumbles 400 points: Why is the stock market falling today?The S&P BSE Sensex was down 394.03 points to 80,614.50 at around 9:59 am, while the NSE Nifty50 fell 121.90 points to 24,600.85. Broader markets also mirrored the nervousness on Dalal Street, with mid- and small-cap indices under pressure.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/insurance-regulator-irdai-fines-policybazaar-multiple-violations-key-details-2766375-2025-08-05",
      "headline": "Why insurance regulator fined Policybazaar Rs 5 crore? All you need to knowThe IRDAI noted that various insurance products were promoted as \"top\" or \"best\" in a manner that appeared biased and lacked substantiation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-100-points-nifty-below-24700-indusind-bank-gains-2-2766359-2025-08-05",
      "headline": "Sensex, Nifty fall after Trump's fresh tariff threat over Russian oil importsThe S&P BSE Sensex fell 156.96 points to 80,861.76 around 9:23 am, while the NSE Nifty50 fell 30.80 points to trade at 24,691.95. Most of the broader market indices also mirror the weak sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-ethanol-blended-petrol-clarification-safe-for-old-new-vehicles-2766355-2025-08-05",
      "headline": "Government's big remark as ethanol-blended petrol has car owners fumingIn a post on X (formerly Twitter), the ministry responded to recent media reports questioning whether E20 fuel could damage older vehicles or degrade the driving experience. Citing multiple studies and expert assessments, it stated that E20 is both safe and beneficial."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-summons-delhi-loan-fraud-case-reliance-group-pmla-2766344-2025-08-05",
      "headline": "Anil Ambani at ED office for questioning in multiple fraud casesThe summons against Anil Ambani followed a massive crackdown by the ED last month, during which the agency searched 35 premises linked to some top executives of the Reliance Group. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-parasuram-has-begun-says-hombale-films-as-they-discuss-narsimhas-success-2766572-2025-08-05",
      "headline": "Mahavatar Parasuram has begun, says Hombale films as they discuss Narsimha's success'Mahavatar Narsimha' has surpassed Rs 100 crore globally in just 10 days. Hombale Films, who presented the film, exclusively spoke to India Today Digital, reflecting on the film's massive success and upcoming movies in the franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/is-vivian-dsena-returning-to-tv-ekta-kapoor-hints-at-new-collaboration-naagin-7-2766549-2025-08-05",
      "headline": "Is Vivian Dsena returning to TV? Ekta Kapoor hints at new collaborationVivian Dsena and Ektaa Kapoor have sparked excitement with a playful Instagram exchange hinting at a possible comeback of the cult supernatural series 'Pyaar Kii Ye Ek Kahaani'. Fans are eagerly hopeful as Vivian expresses his desire for a meaningful return to TV or OTT. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-mother-pinkie-70-nails-war-2-aavan-jaavan-song-hooksteps-kiara-advani-sussanne-khan-shower-praise-2766420-2025-08-05",
      "headline": "Hrithik's mother, 70, nails Aavan Jaavan hooksteps. Kiara, Sussanne shower praiseActor Hrithik Roshan recently shared a video of his mother dancing to the song 'Aavan Jaavan'. At 70, Pinkie's energetic performance to the song from his upcoming film 'War 2' has captivated not only her son but also several celebrities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vir-das-air-india-gratitude-note-humour-brings-joy-onboard-standup-comedy-fool-volume-netflix-2766477-2025-08-05",
      "headline": "Vir Das receives gratitude note from Air India crew: Your humour brings joyActor Vir Das received a heartfelt gratitude note from the Air India crew onboard. The crew praised his humour and presence, highlighting the joy he brought during the journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priyanka-chopra-resumes-ssmb-29-shoot-mahesh-babu-rajamouli-hyderabad-south-african-schedule-2766544-2025-08-05",
      "headline": "Priyanka Chopra resumes SSMB 29 shoot in Hyderabad ahead of South Africa schedulePriyanka Chopra and Mahesh Babu have resumed the shooting of director SS Rajamouli's 'SSMB 29' in Hyderabad. After the brief Hyderabad schedule, the team will move on to a longer schedule in South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/120-bahadur-teaser-farhan-akhtar-major-shaitan-singh-biopic-1962-rezang-la-war-2766533-2025-08-05",
      "headline": "120 Bahadur teaser: Farhan Akhtar leads epic retelling of 1962 Rezang La warThe teaser of 120 Badhadur was released on August 5. Actor Farhan Akhtar portrays Major Shaitan Singh Bhati, PVC in the film based on 1962 Rezang La war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-mrunal-thakur-dating-viral-video-sparks-buzz-2766494-2025-08-05",
      "headline": "Dhanush and Mrunal Thakur's viral video from a party fuels dating rumoursActors Dhanush and Mrunal Thakur have sparked dating rumours after the duo was seen at the Sita Ramam actor's star-studded birthday bash on August 1. A video from the celebration quickly went viral, adding fuel to the speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jung-woo-sung-reportedly-marries-a-moment-to-remeber-2766531-2025-08-05",
      "headline": "South Korean actor Jung Woo-sung marries longtime partner, agency respods: ReportsSouth Korean actor Jung Woo Sung is making headlines once again, this time over reports of a quietly registered marriage and developments in his personal life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-reboot-episode-7-august-4-update-tulsi-meets-vrinda-pari-gets-dumped-2766527-2025-08-05",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi reboot Ep 7: Tulsi meets Vrinda, Pari gets dumpedIn the new episode of 'Kyunki Saas Bhi Kabhi Bahu Thi' reboot, Angad continues to be in jail and Pari gets dumped by her boyfriend. Meanwhile, Tulsi finally manages to meet Vrinda, the new character who's been positioned as the Tulsi of the new generation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/surveen-chawla-emerges-surprise-hero-of-mandala-murders-vaani-kapoor-vaibhav-gupta-2766465-2025-08-05",
      "headline": "Surveen Chawla emerges as the surprise hero of Mandala MurdersIn Mandala Murders, while the plot mainly revolves around Vaani Kapoor and Vaibhav Raj Gupta's characters, it's Surveen Chawla who quietly steals the show. Surveen delivers a powerful performance that grows stronger with each episode. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hidden-love-zhao-lusi-agency-controversy-c-drama-2766451-2025-08-05",
      "headline": "Hidden Love star Zhao Lusi accuses agency of financial abuse, blacklisting threatsChinese actor-singer Zhao Lusi claimed that Galaxy Cool Entertainment failed to support her. Known for her role in Hidden Role, the actor also accused them of wage theft and breach of contract. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-50-years-anniversary-amitabh-bachchan-dharmendra-salim-javed-amjad-khan-2766503-2025-08-05",
      "headline": "Sholay@50: The film that died at birth to live foreverOn August 15, 1975, Sholay lit up Indian theatres, igniting a cultural fire that burns bright even today. To celebrate its golden jubilee, we revisit the legacy of the masterpiece, exploring the stories, struggles, and serendipity behind its creation. In part one, we revisit the chaos around its release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/suniel-shetty-kareena-kapoor-celebrities-india-beats-england-2766481-2025-08-05",
      "headline": "Suniel Shetty erupts in joy as India beats England at The Oval, celebs congratulateSuniel Shetty and his family, Kareena Kapoor and many Bollywood stars applauded Team India's stunning win over England at The Oval. The victory drew widespread praise for the team's spirit and strategy from fans and celebrities alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-18-detailed-report-ahaan-panday-rs-300-crore-love-story-sets-new-record-2766474-2025-08-05",
      "headline": "Saiyaara box office Day 18: Ahaan Panday's Rs 300 crore love story sets new record'Saiyaara' hasn't stopped performing even despite the entire 'Mahavatar Narsimha' hype. The film has seen a drop in collections, but has entered the Rs 300 crore club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ella-mccay-trailer-politician-emma-mackey-juggles-between-work-and-life-2766398-2025-08-05",
      "headline": "Ella McCay trailer: Politician Emma Mackey juggles between work and lifeThe trailer and poster for 'Ella McCay' featuring Hollywood actor Emma Mackey released on Tuesday. The film is directed by James L Brooks and will be released in theatres on December 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-shanawas-dies-at-71-after-prolonged-illness-2766406-2025-08-05",
      "headline": "Malayalam actor Shanawas, son of Prem Nazir, dies at 71Veteran actor Shanawas, son of Prem Nazir, died at the age of 71. He starred in over 50 films, including 'Mazhanilavu' and 'China Town' among others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavtar-narsimha-box-office-collection-day-11-detailed-report-india-top-animated-film-smashes-rs-100-crore-2766413-2025-08-05",
      "headline": "Mahavatar Narsimha box office Day 11: India's top animated film smashes Rs 100 crore'Mahavatar Narsimha' has emerged as the first choice for the Indian audience at the box office. The film has already entered the Rs 100 crore club, becoming India's biggest animated film, as the second week looks promising. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-celebrates-33-years-in-tamil-cinema-shalini-ajith-2766380-2025-08-05",
      "headline": "Shalini is a proud wife as Ajith Kumar celebrates 33 years in cinema. See picFormer actor Shalini shared a special photo with her actor-husband Ajith Kumar expressing joy at his achievements. Recently, he completed 33 years in cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/john-abraham-learns-farsi-hebrew-for-tehran-film-cultural-roots-2766378-2025-08-05",
      "headline": "Exclusive: John Abraham learnt Farsi and Hebrew for Tehran, shares emotional linkJohn Abraham embraced his Iranian heritage by learning Farsi and Hebrew for his film 'Tehran'. The movie highlights cross-cultural unity and streams on ZEE5 from August 14."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-weather-update-cloudburst-in-uttarkashi-triggers-massive-landslide-video-2766547-2025-08-05",
      "headline": "4 dead, over 50 missing as cloudburst triggers monster landslide in UttarakhandUttarkashi Dharali Village Cloudburst News: A cloudburst near Gangotri Dham triggered a powerful landslide in Uttarkashi's Tharali village, causing a drain to overflow. Tourists captured dramatic visuals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-army-us-arms-pakistan-1971-trump-russian-oil-tariff-threats-2766510-2025-08-05",
      "headline": "With 1971 war ammo, Indian Army fires back at US over Russian oil hypocrisyThe Indian Army highlighted historic US arms supplies to Pakistan during the 1971 war amid tensions over Trump's warning on Indian imports of Russian oil. This move underscores growing diplomatic friction as India pushes back against perceived double standards in US trade policies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/latest-auto-news/story/ethanol-blended-fuel-for-your-vehicle-pros-and-cons-good-bad-ugly-2766453-2025-08-05",
      "headline": "No side effects of E20 fuel, government suggests. How true is that?As India adopts E20 blended fuel, it promises cleaner air and economic gains, but for older vehicles, the shift could mean performance dips, higher maintenance, and increased long-term running costs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-tariff-india-us-trade-deal-new-delhi-mea-response-europe-eu-russian-crude-oil-import-2766461-2025-08-05",
      "headline": "India looks Trump in the eye, says take a walkIn its strongest reaction yet, India has told the US it will hold its right to an independent foreign policy and put national interest first. It has countered the US and the EU with facts on their Russia trade, and questioned the morality of penalising India on the Russia-Ukraine war. In short, New Delhi has asked Trump to take a walk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/sholay-50-years-film-that-died-at-birth-to-live-forever-gabbar-singh-jai-veeru-amitabh-bachchan-dharmendra-283-05-08-2025",
      "headline": "Sholay@50: The film that died at birth to live foreverOn August 15, 1975, Sholay lit up Indian theatres, igniting a cultural fire that burns bright even today. To celebrate its golden jubilee, we revisit the legacy of the masterpiece, exploring the stories, struggles, and serendipity behind its creation. In part one, we revisit the chaos around its release."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/former-jk-governor-satyapal-malik-dies-at-79-after-prolonged-illness-2766508-2025-08-05",
      "headline": "Former J&K Governor Satyapal Malik dies at 79 after prolonged illnessFormer Jammu and Kashmir Governor Satyapal Malik, whose tenure saw the abrogation of Article 370 during his tenure, died at the age of 79 on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-india-tariff-threat-russian-oil-imports-real-reason-explained-2766445-2025-08-05",
      "headline": "Why is Trump threatening India over Russian oil? Here's the real reasonIs Donald Trump really upset about India buying Russian oil, or is this just a calculated move to boost US energy exports, appease oil lobbyists, and reshape global trade flows?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/uttarkashi-cloudburst-how-clouds-dump-over-a-billion-litres-of-rain-in-a-minute-2766576-2025-08-05",
      "headline": "Uttarkashi: How clouds burst with a billion litres of rain in a minuteThe cloudburst took place in the catchment area of the Kheer Ganga river, leading to the devastating floods, locals said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trump-tariffs-penalty-threat-russian-oil-purchase-pakistan-ceasefire-op-sindoor-strong-response-hypocrisy-2766403-2025-08-05",
      "headline": "Enough: India hits back at US after Russian oil threats, truce liesIf Donald Trump expected India to roll over, the message from South Block is loud and clear: India decides its interests, not Washington."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-modis-swadeshi-call-gives-indias-economic-nationalism-a-new-voice-2765880-2025-08-04",
      "headline": "How Modi's 'swadeshi' call gives India's economic nationalism a new voiceThe Varanasi pitch looks timed to Donald Trump's new tariff threat. Yet, to become policy, Modi's 'swadeshi' must avoid the trappings of India's 'conservative' industrialism"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/embassy-of-the-republic-of-khalistan-surrey-gurdwara-hardeep-singh-nijjar-support-india-canada-diplomatic-thaw-2766575-2025-08-05",
      "headline": "Khalistan 'embassy' at Nijjar's old stomping ground threatens India-Canada resetAn 'Embassy of the Republic of Khalistan' has been established in Surrey, Canada. Located on the premises of Guru Nanak Sikh Gurdwara, it openly supports Hardeep Singh Nijjar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/surveen-chawla-emerges-surprise-hero-of-mandala-murders-vaani-kapoor-vaibhav-gupta-2766465-2025-08-05",
      "headline": "Surveen Chawla emerges as the surprise hero of Mandala MurdersIn Mandala Murders, while the plot mainly revolves around Vaani Kapoor and Vaibhav Raj Gupta's characters, it's Surveen Chawla who quietly steals the show. Surveen delivers a powerful performance that grows stronger with each episode. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/what-is-ethanol-blended-petrol-and-should-you-be-worried-about-it-2766452-2025-08-05",
      "headline": "What is ethanol-blended petrol and should you be worried about it?The government is targeting 30% ethanol blending with petrol by 2030 to further reduce dependence on imported oil, while addressing environmental concerns."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-police-deny-inaction-after-crpf-officer-weeps-over-wedding-jewellery-money-silk-sarees-theft-2766427-2025-08-05",
      "headline": "House robbed, cops refuse to act: Woman CRPF officer cries inconsolably on cameraA CRPF woman officer accused Tamil Nadu police of inaction in a wedding jewellery theft case. Police denied the allegation, saying an FIR was filed and investigation is underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/elephant-rehab-or-religious-rift-kolhapur-revolts-after-mahadevis-move-to-vantara-2765659-2025-08-03",
      "headline": "Elephant Rehab Or Religious Rift? Kolhapur Revolts After Mahadevi's Move To Vantara"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/private-school-fee-hikes-india-salary-growth-parent-protests-2766488-2025-08-05",
      "headline": "When paying for class 3 feels like MBA tuitionPrivate school fees in Indian metros are rising sharply, far exceeding salary increases. This trend is causing financial stress for parents and sparking protests amid weak regulatory enforcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/vivek-ramaswamy-hosts-cincinnati-townhall-public-safety-crime-cincinnati-beating-sarah-heringer-justice-system-holly-2766493-2025-08-05",
      "headline": "In Mamdani battle, Vivek Ramaswamy invites crime-hit to Ohio townhallRepublican gubernatorial candidate Vivek Ramaswamy held a townhall in Cincinnati to address rising public safety concerns. The event followed a Times Square billboard urging New Yorkers to escape Zohran Mamdani's \"socialist tyranny\" and relocate to Ohio. The campaign drew mixed reactions, with supporters backing his tough-on-crime stance and protesters accusing him of politicising a complex issue."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/most-erroneous-order-top-court-on-allahabad-high-court-allowing-civil-offence-to-be-treated-as-criminal-case-2766548-2025-08-05",
      "headline": "Most erroneous order: Top court slams High Court for criminalising civil disputeThe Supreme Court came down heavily on the Allahabad High Court for allowing a civil dispute to be treated as a criminal case, merely on the ground that civil recovery could take time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-win-gautam-gambhir-red-ball-coach-record-2766351-2025-08-05",
      "headline": "Spirited India level England series, but Gambhir's Test reign must end nowIndia's Oval win was a testament to their grit and tenacity — but it came in spite of their head coach, not because of him. Individual brilliance papered over deep tactical flaws and inconsistent selections throughout the series. With just 3 wins in their last 13 Tests, Gautam Gambhir's tenure as Test coach should end sooner rather than later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/rimzim-dadu-gujarat-india-couture-week-2025-2766027-2025-08-05",
      "headline": "Patola, but make it steel: Rimzim Dadu just did that and howDesigner Rimzim Dadu's show at India Couture Week 2025 stood out for several reasons. One of them is how she reimagined Patola weave using her signature metal textile. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/disruption-our-democratic-right-mallikarjun-kharge-vs-rajya-sabha-chair-over-cisf-personnel-in-house-claim-2766436-2025-08-05",
      "headline": "Who's running the House? You or Amit Shah? Mallikarjun Kharge's barb at Chairman Live UpdatesMallikarjun Kharge questioned whether the Rajya Sabha was being run by Deputy Chairman Harivansh or Amit Shah, triggering uproar from the treasury benches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/us-hiring-slowdown-shakes-american-dream-for-indian-students-what-now-2766541-2025-08-05",
      "headline": "US hiring slowdown shakes American dream for Indian students. What now?The US hiring slowdown and unemployment climbing to 4.2% has left Indian students and job hopefuls on edge: fewer openings, tighter visas, and shrinking immigrant workforce. The path forward in this changing labour market looks more competitive than ever. What should they expect, and how smart can they adapt?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/west-bengal-suvendu-adhikar-convoy-attacked-in-coochbehar-bjp-blames-trinamool-2766525-2025-08-05",
      "headline": "Suvendu Adhikari's convoy attacked in Bengal's Cooch Behar, BJP blames TrinamoolBJP leader Suvendu Adhikari's convoy was allegedly attacked in West Bengal's Coochbehar as several Trinamool Congress workers staged black flag protests during his visit to the Superintendent of Police office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-parasuram-has-begun-says-hombale-films-as-they-discuss-narsimhas-success-2766572-2025-08-05",
      "headline": "Mahavatar Parasuram has begun, says Hombale films as they discuss Narsimha's success'Mahavatar Narsimha' has surpassed Rs 100 crore globally in just 10 days. Hombale Films, who presented the film, exclusively spoke to India Today Digital, reflecting on the film's massive success and upcoming movies in the franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-mother-pinkie-70-nails-war-2-aavan-jaavan-song-hooksteps-kiara-advani-sussanne-khan-shower-praise-2766420-2025-08-05",
      "headline": "Hrithik's mother, 70, nails Aavan Jaavan hooksteps. Kiara, Sussanne shower praiseActor Hrithik Roshan recently shared a video of his mother dancing to the song 'Aavan Jaavan'. At 70, Pinkie's energetic performance to the song from his upcoming film 'War 2' has captivated not only her son but also several celebrities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vir-das-air-india-gratitude-note-humour-brings-joy-onboard-standup-comedy-fool-volume-netflix-2766477-2025-08-05",
      "headline": "Vir Das receives gratitude note from Air India crew: Your humour brings joyActor Vir Das received a heartfelt gratitude note from the Air India crew onboard. The crew praised his humour and presence, highlighting the joy he brought during the journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priyanka-chopra-resumes-ssmb-29-shoot-mahesh-babu-rajamouli-hyderabad-south-african-schedule-2766544-2025-08-05",
      "headline": "Priyanka Chopra resumes SSMB 29 shoot in Hyderabad ahead of South Africa schedulePriyanka Chopra and Mahesh Babu have resumed the shooting of director SS Rajamouli's 'SSMB 29' in Hyderabad. After the brief Hyderabad schedule, the team will move on to a longer schedule in South Africa."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-kl-rahul-batting-virat-kohli-rohit-sharma-2766555-2025-08-05",
      "headline": "KL Rahul steps up big: Senior batter shines in Kohli and Rohit's absenceIndia vs England: KL Rahul was praised for his calm and smart batting in tough English conditions. With senior players retired, he stepped up as a leader, scoring important runs and guiding a young team as India fought hard to draw the five-match series 2-2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-r-ashwin-on-mohammed-siraj-oval-test-performance-2766550-2025-08-05",
      "headline": "We failed to recognise Siraj, he should be rested for inconsequential games: AshwinFormer India all-rounder Ravichandran Ashwin has urged the team management to manage Mohammed Siraj's workload and rest him for inconsequential games going forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-nca-return-training-sports-hernia-surgery-2766524-2025-08-05",
      "headline": "Suryakumar Yadav back at NCA for first nets session after sports hernia surgerySuryakumar Yadav has resumed training at the NCA following his sports hernia surgery, eyeing a return ahead of the Asia Cup 2025. The star batter's recovery is being closely managed in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-presence-panic-michael-vaughan-oval-test-2766487-2025-08-05",
      "headline": "If Ben Stokes was there, England would have won Oval Test: VaughanMichael Vaughan felt England's Oval Test defeat could've been avoided had Ben Stokes played, pointing out how the team panicked on Day 5 without his calming influence and leadership during their failed run-chase against India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-series-major-stats-shubman-gill-mohammed-siraj-2766466-2025-08-05",
      "headline": "Statpack: India's resilient performance on England tour told through numbersIndia drew the five-match series against England 2-2 after a thrilling six-run victory at the Oval. Here's a look at major stats from Shubman Gill's men's phenomenal show on English soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-shubman-gill-captaincy-ajay-jadeja-2766462-2025-08-05",
      "headline": "Defensive but consistent: Shubman Gill's captaincy analysed by Ajay JadejaENG vs IND: Former Indian cricketer Ajay Jadeja feels that Shubman Gill has a defensive approach as a skipper but is open to making changes when required. Jadeja advised Gill to find a style and stick with it after drawing the series against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sunil-gavaskar-dance-oval-test-win-watch-video-2766442-2025-08-05",
      "headline": "Watch: Sunil Gavaksar hits special dance after India's trilling Oval Test winSunil Gavaskar celebrated India's dramatic Oval Test win in style, dancing and singing \"Meri Desh Ki Dharti\" alongside Cheteshwar Pujara and others, after India pulled off a thrilling six-run victory to level the series 2-2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-oval-test-ashes-australia-2766425-2025-08-05",
      "headline": "After India series draw, Ben Stokes eager to get to Australia for AshesAfter the intense and closely-fought series against India, England captain Ben Stokes said that he is eager to head to Australia for the Ashes series. Stokes' England were held to a 2-2 draw by India after the visitors won the Oval Test. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-mohammed-sirajs-brother-reveals-secret-behind-long-spells-2766418-2025-08-05",
      "headline": "No junk food, only discipline: Siraj's brother reveals secret behind long spellsIndia fast bowler Mohammed Siraj's brother, Mohammed Ismail, revealed the secret behind his ability to bowl long spells tirelessly in Test cricket after his match-winning performance against England at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-respect-shubman-gill-oval-test-2766390-2025-08-05",
      "headline": "Respect for Siraj would not have changed if India lost Oval Test: Shubman GillShubman Gill hailed Mohammed Siraj's match-winning impact at The Oval, emphasising that his respect within the team would have remained unchanged, regardless of the result, thanks to his consistent efforts and leadership with the ball over years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-jasprit-bumrah-oval-test-win-2766389-2025-08-05",
      "headline": "I believe in Jassi Bhai and myself: Siraj says he missed Bumrah during Oval winMohammed Siraj said that he missed the presence of Jasprit Bumrah during the Oval Test win. Siraj stepped up in Bumrah's absence and picked up nine wickets during the match to help India secure a memorable win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sunil-gavaskar-dance-oval-test-win-watch-video-2766442-2025-08-05",
      "headline": "Watch: Sunil Gavaksar hits special dance after India's trilling Oval Test winSunil Gavaskar celebrated India's dramatic Oval Test win in style, dancing and singing \"Meri Desh Ki Dharti\" alongside Cheteshwar Pujara and others, after India pulled off a thrilling six-run victory to level the series 2-2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-oval-test-ashes-australia-2766425-2025-08-05",
      "headline": "After India series draw, Ben Stokes eager to get to Australia for AshesAfter the intense and closely-fought series against India, England captain Ben Stokes said that he is eager to head to Australia for the Ashes series. Stokes' England were held to a 2-2 draw by India after the visitors won the Oval Test. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-mohammed-sirajs-brother-reveals-secret-behind-long-spells-2766418-2025-08-05",
      "headline": "No junk food, only discipline: Siraj's brother reveals secret behind long spellsIndia fast bowler Mohammed Siraj's brother, Mohammed Ismail, revealed the secret behind his ability to bowl long spells tirelessly in Test cricket after his match-winning performance against England at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-respect-shubman-gill-oval-test-2766390-2025-08-05",
      "headline": "Respect for Siraj would not have changed if India lost Oval Test: Shubman GillShubman Gill hailed Mohammed Siraj's match-winning impact at The Oval, emphasising that his respect within the team would have remained unchanged, regardless of the result, thanks to his consistent efforts and leadership with the ball over years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-jasprit-bumrah-oval-test-win-2766389-2025-08-05",
      "headline": "I believe in Jassi Bhai and myself: Siraj says he missed Bumrah during Oval winMohammed Siraj said that he missed the presence of Jasprit Bumrah during the Oval Test win. Siraj stepped up in Bumrah's absence and picked up nine wickets during the match to help India secure a memorable win. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}