{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-orders-indigo-to-end-agreement-with-turkish-airlines-amid-diplomatic-tensions-2733472-2025-05-31",
      "headline": "India orders IndiGo to end agreement with Turkish Airlines amid diplomatic tensionsThe Indian government has ordered IndiGo Airlines to terminate its damp lease agreement with Turkish Airlines by August 31. This decision comes in response to Turkey's continued support for Pakistan against India. The aviation regulator DGCA has granted a final three-month extension to the current lease, which was set to expire on May 31. IndiGo is currently operating two Boeing aircraft on damp lease from Turkish Airlines. The move is part of India's broader response to Turkey's actions, including supplying arms to Pakistan and condemning India's Operation Sindhu."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-reduces-import-tax-crude-edible-oils-to-10-bring-down-food-prices-2733414-2025-05-30",
      "headline": "India reduces import tax on crude edible oils by 10% to bring down food pricesThe reduction in import tax will effectively bring down the total import duty on the three oils to 16.5 per cent from an earlier 27.5 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-to-end-turkish-airlines-leasing-deal-by-august-31-2733344-2025-05-30",
      "headline": "IndiGo to cut ties with Turkish Airlines amid row over Ankara's support to PakThe Directorate General of Civil Aviation said IndiGo gave an undertaking that it will terminate the lease with Turkish Airlines by August 31 and will not seek a further extension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-1-and-itr-4-excel-utilities-out-check-who-can-file-and-what-new-this-year-itr-filing-2025-2733229-2025-05-30",
      "headline": "ITR-1 and ITR-4 Excel utilities out: Check who can file and what's new this yearExcel utilities for ITR-1 and ITR-4 are now available for AY 2025–26. Taxpayers can visit the income tax e-filing site to download and use them for filing returns for FY 2024–25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-misses-may-payment-for-loan-on-blusmart-cabs-report-2733215-2025-05-30",
      "headline": "Gensol misses May payment for loan on BluSmart cabs: ReportGensol Engineering reportedly missed a payment of about Rs 4 crore to its pass-through certificate (PTC) holders in May. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-economic-growth-hits-4-year-low-of-65-in-fy25-2733165-2025-05-30",
      "headline": "India's economic growth hits 4-year low of 6.5% in FY25The real GDP growth for the March quarter (Q4) stood at 7.4%, which is the fastest among all four quarters of the year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-182-points-lower-nifty-below-24800-it-stocks-drag-markets-infosys-hcltech-2733139-2025-05-30",
      "headline": "Sensex closes 182 points lower, Nifty below 24,800; IT stocks drag marketsThe S&P BSE Sensex was down by 182 points to end at 81,451.01, while the NSE Nifty50 lost 82.90 points to close at 24,750.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-instant-pf-withdrawals-via-upi-and-atms-to-online-corrections-5-expected-features-of-epfo-3o-2733090-2025-05-30",
      "headline": "From UPI withdrawals to online corrections: 5 expected features of EPFO 3.0EPFO's upcoming system aims to enhance financial flexibility for employees with features like instant UPI and ATM withdrawals, auto-claim settlements, and expanded withdrawal reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-leena-gandhi-tewari-the-suv-chairperson-who-bought-india-costliest-flats-2733045-2025-05-30",
      "headline": "Meet Leena Tewari, the USV chairperson who bought India's costliest flatsLeena is the chairperson of USV, a Mumbai-based pharmaceutical company, which was started by her late father, Vithal Gandhi, in partnership with Revlon in 1961. Forbes estimates Leena's net worth at $3.9 billion, as of May 30, 2025, making her one of India's richest women."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/arshad-warsi-maria-goretti-sebi-ban-1-year-why-reasons-shares-sadhna-broadcast-limited-sbl-2733005-2025-05-30",
      "headline": "Explained: Why Arshad Warsi, wife Maria Goretti were banned by Sebi for 1 yearArshad Warsi and Maria Goretti bought shares of Sadhna Broadcast Limited (now known as Crystal Business System Ltd) from other individuals who were also named in the Sebi order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donaldtrump-tariff-tsunami-impact-on-global-economy-explained-2733001-2025-05-30",
      "headline": "How Trump's tariff tsunami is reshaping global economyIn just over four months, Trump's flurry of trade actions, alternating between shock-and-awe tariffs and strategic pauses, has upended conventional expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/waiting-for-form-16-here-is-when-will-you-get-it-and-what-to-check-itr-filing-2025-2732994-2025-05-30",
      "headline": "Waiting for Form 16? Here's when will you get it and what to checkEmployers are required to issue Form 16 to employees if they've deducted TDS from their salary. It consists of two parts and shows how much salary was paid and how much tax was deducted during the year."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/the-academy-revisits-iconic-aamir-khan-song-radha-kaise-na-jale-from-lagaan-fans-call-it-legendary-2733575-2025-05-31",
      "headline": "The Academy revisits iconic Aamir Khan song from Lagaan, fans call it legendaryThe Academy revisited a clip of the popular song 'Radha Kaise Na Jale' from 'Lagaan' featuring Aamir Khan and Gracy Singh. Indian fans got nostalgic about the iconic track and the groundbreaking visuals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pratik-shah-homebound-cinematographer-sexual-harassment-over-20-women-complaint-2733616-2025-05-31",
      "headline": "Homebound cinematographer accused of sexual harassment. Dharma Productions reacts'Homebound' cinematographer Pratik Shah has been accused of sexually inappropriate behaviour. He deleted his Instagram profile after allegations from over 20 women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/priyanka-chopra-lara-dutta-casting-choice-director-suneel-darshan-in-andaaz-2733601-2025-05-31",
      "headline": "Nobody had faith in Priyanka Chopra: Director Suneel Darshan on Andaaz castingFilmmaker Suneel Darshan shared exclusive insights on the casting choices behind the 2003 hit 'Andaaz' that introduced Lara Dutta and Priyanka Chopra to Bollywood. The film's fresh pairing and Akshay Kumar's support played key roles in their breakthrough."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-on-admiring-keanu-reeves-in-the-matrix-john-wick-i-dig-those-movies-2733552-2025-05-31",
      "headline": "Tom Cruise on admiring Keanu Reeves in The Matrix, John Wick: I dig those moviesActor Tom Cruise recently opened up about his admiration for 'Speed,' 'The Matrix' and 'John Wick' franchise featuring Keanu Reeves. The 'Mission Impossible: 8' actor praised Reeves for his charisma in his films."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-nadu-movie-ticket-price-reduce-thug-life-release-local-body-tax-2733572-2025-05-31",
      "headline": "Movie ticket prices to reduce in Tamil Nadu ahead of Thug Life release. Here's howTamil Nadu movie ticket prices will reduce after the government slashed the local body tax by half. Kamal Haasan had earlier appealed to the government to cut down the local body tax. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-kannappa-akshay-kumar-cameo-2733558-2025-05-31",
      "headline": "Wasn't easy to reach Akshay Kumar: Vishnu Manchu on star-studded Kannappa castingActor Vishnu Manchu discussed the emotional and creative process behind casting for 'Kannappa', a personal passion project for his father Mohan Babu. He highlighted the importance of personal relationships and support from industry veterans in bringing the project to life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-bollywood-silence-operation-sindoor-hypocrisy-2733490-2025-05-31",
      "headline": "Javed Akhtar weighs in on Bollywood's silence on Operation SindoorJaved Akhtar addressed criticism of Bollywood's silence on Operation Sindoor, stressing that not everyone is obliged to speak. He also challenged the notion of expecting artistes to respond to all issues when there are risks involved."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-accuse-brother-manoj-manchu-theft-kannappa-hard-disk-2733481-2025-05-31",
      "headline": "Actor Vishnu Manchu accuses brother Manoj over alleged theft of Kannappa hard diskTelugu actor Vishnu Manchu accused his brother Manoj Manchu over the alleged theft of Kannappa's hard disk. Over the past few months, the brothers have been involved in a family feud, which resulted in Manoj being ousted from their father Mohan Babu's house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/blending-style-with-substance-evolving-language-of-espionage-in-storytelling-2732594-2025-05-31",
      "headline": "Blending style with substance: Evolving language of espionage in storytellingThe spy genre is the current flavour of the season. Where are espionage stories heading with the emergence of shows like 'The Freelancer,' 'Special Ops' and 'The Family Man'? On Cinematic Saturday, we speak to artistes from the Hindi cinema to understand the changing landscape of the Indian spy genre.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/how-can-you-watch-the-tony-awards-this-year-streaming-details-inside-glbs-2733445-2025-05-31",
      "headline": "How can you watch the Tony Awards this year? Streaming details insideThe 2025 Tony Awards will be live on June 8 with top nominees, historic firsts, and a Hamilton cast reunion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/emmy-winning-actress-and-mash-star-loretta-swit-dies-at-87-glbs-2733439-2025-05-31",
      "headline": "Emmy-winning actress and MASH star Loretta Swit dies at 87Loretta Swit, renowned for her role as Major Houlihan in MASH, has died at 87. The Emmy-winning actress redefined female roles on TV and was also a passionate animal rights advocate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ariana-grande-to-star-in-meet-the-parents-4-alongside-stiller-and-de-niro-glbs-2733429-2025-05-31",
      "headline": "Ariana Grande to star in 'Meet the parents 4' alongside Stiller and De NiroAriana Grande joins Robert De Niro and Ben Stiller in a new Meet the Parents comedy, playing a bold fiancée. The film marks her return to acting after Wicked, with a 2026 release date set."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-buys-back-masters-first-six-albums-shamrock-capital-deal-2733368-2025-05-30",
      "headline": "You belong with me: Taylor Swift buys back rights to her first 6 albumsTaylor Swift has repurchased the master recordings of her first six albums. This move restores her ownership and highlights artists' rights in the music industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-reacts-to-bushra-ansari-comment-shabana-azmi-and-i-sleeping-on-streets-2733310-2025-05-30",
      "headline": "Partition trauma lives in Sindhi hearts: Javed Akhtar slams Pak actor on rent rowJaved Akhtar countered Pakistani actor Bushra Ansari's statement on Muslims being denied homes in Mumbai, sharing his own experiences of prejudice. He urged people to reflect on the historical causes behind current social tensions, highlighting the trauma of Sindhis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/radhika-apte-sister-midnight-film-release-uncut-india-2733296-2025-05-30",
      "headline": "Radhika Apte hopes Sister Midnight releases uncut in IndiaActor Radhika Apte discusses her daring new film Sister Midnight and its journey to an Indian release, hoping it will be shown uncut despite censorship concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-shares-his-success-mantra-saying-no-to-work-yes-to-family-2733276-2025-05-30",
      "headline": "Saif Ali Khan shares his success mantra: Saying no to work, yes to familySaif Ali Khan shared that true success, for him, means choosing family time over work commitments. He said small moments with loved one's matter more than professional achievements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-to-make-hollywood-debut-with-kevin-spacey-holiguards-2733287-2025-05-30",
      "headline": "Disha Patani to make Hollywood debut with Kevin Spacey's HoliguardsActor Disha Patani is set to make her Hollywood debut with Kevin Spacey's upcoming film 'Holiguards'. The film is extensively shot in Mexico."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-controversy-south-indian-artistes-association-support-karnataka-backlash-unity-2733257-2025-05-30",
      "headline": "South Indian Artistes Association backs Kamal Haasan amid language rowThe South Indian Artistes Association has strongly supported Kamal Haasan amid the recent backlash in Karnataka. The statement warns that misrepresenting Kamal could harm cinema's cultural unity and public discourse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-and-vishwaroopam-tale-of-two-bans-and-kamal-haasans-defiance-2733233-2025-05-30",
      "headline": "Thug Life and Vishwaroopam: Tale of two bans and Kamal Haasan's defianceKamal Haasan's upcoming film, 'Thug Life', directed by Mani Ratnam, has been banned in Karnataka. Twelve years ago, another film of the actor, 'Vishwaroopam', was also banned. Both times, Haasan remained unfazed. \r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-madhya-pradesh-operation-sindoor-indias-nari-shakti-brought-their-end-2733574-2025-05-31",
      "headline": "Sindoor biggest, most successful anti-terror operation in India's history: PMPM Modi said terror camps were destroyed by penetrating hundreds of kilometres into Pakistan, calling 'Sindoor'  the biggest and most successful operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/covid-tracker-coronavirus-cases-india-cross-2700-death-toll-state-wise-infections-2733502-2025-05-31",
      "headline": "Covid cases cross 2,700, 7 deaths reported. Kerala, Maharashtra worst hitCoronavius cases have been rising in India after months of lull, with infections seeing a five-fold jump and crossing the 1,000-mark in the week ending May 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-jairam-ramesh-pm-modi-silence-donald-trump-india-pakistan-ceasefire-nuclear-war-2733634-2025-05-31",
      "headline": "9th time in 20 days: Jairam Ramesh asks PM to clarify 'Donaldbhai's' Pak claimThe fresh attack by Congress's Jairam Ramesh came as Trump reiterated his claim that he avoided a potential nuclear disaster by mediating the ceasefire between India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-colombia-statement-condemning-pakistan-deaths-in-operation-sindoor-2733470-2025-05-31",
      "headline": "Confident that…: Colombia's U-turn on Pak deaths after Shashi Tharoor's disapprovalColombia has withdrawn its statement condemning the deaths in Pakistan during India's Operation Sindoor following Congress MP Shashi Tharoor's rebuttal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-eliminator-mi-vs-gt-jasprit-bumrah-yorker-genius-2733462-2025-05-31",
      "headline": "Unplayable yorker, inevitable genius: How Jasprit Bumrah sank the Gujarat TitansJasprit Bumrah delivered yet another masterclass in the IPL 2025 Eliminator, turning the tide with an unplayable yorker that shattered Gujarat Titans' hopes. HIs spell was a reminder that with Bumrah, brilliance isn't occasional, but inevitable.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chief-of-defence-staff-india-pakistan-conflict-strategy-indian-ocean-region-china-2733532-2025-05-31",
      "headline": "If we get hostility in return...: Chief of Defence Staff spells out Pak strategySpeaking at the Shangri-La Dialogue, General Anil Chauhan said India's current policy against Pakistan was of strategic disengagement."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-pakistan-india-trade-talks-representatives-visit-washington-next-week-close-to-deal-operation-sindoor-2733602-2025-05-31",
      "headline": "Pak rushes to US for trade talks as Trump says close to sealing deal with IndiaUS President Donald Trump said that Pakistani representatives will be coming to America next week for trade talks, even as he highlighted that his administration is \"very close to making a deal with India\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/chinese-embassy-india-nepal-border-advisory-travel-citizens-illegal-crossings-2733621-2025-05-31",
      "headline": "Chinese embassy in Nepal issues advisory against travelling to India borderThe Chinese Embassy in Nepal has issued a renewed advisory to its citizens against travelling to the border with India as New Delhi cracked down on illegal crossings over the past few weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-reacts-to-bushra-ansari-comment-shabana-azmi-and-i-sleeping-on-streets-2733310-2025-05-30",
      "headline": "Partition trauma lives in Sindhi hearts: Javed Akhtar slams Pak actor on rent rowJaved Akhtar countered Pakistani actor Bushra Ansari's statement on Muslims being denied homes in Mumbai, sharing his own experiences of prejudice. He urged people to reflect on the historical causes behind current social tensions, highlighting the trauma of Sindhis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pune-law-student-arrested-gurugram-for-offensive-operation-sindoor-linked-remarks-2733510-2025-05-31",
      "headline": "Pune law student arrested in Gurugram for offensive Op Sindoor-linked remarksSharmistha Panoli, a Pune law student, was arrested by Kolkata Police from Gurugram on Thursday night over \"disrespectful and derogatory remarks\" targeting a particular religion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pratik-shah-homebound-cinematographer-sexual-harassment-over-20-women-complaint-2733616-2025-05-31",
      "headline": "Homebound cinematographer accused of sexual harassment. Dharma Productions reacts'Homebound' cinematographer Pratik Shah has been accused of sexually inappropriate behaviour. He deleted his Instagram profile after allegations from over 20 women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/back-to-90s-classrooms-white-shoes-rasna-bottles-and-that-annoying-class-monitor-2732500-2025-05-31",
      "headline": "Back to 90s classrooms: White shoes, rasna bottles and that annoying class monitorBefore smartboards and school apps, there was chalk on shoes, ink on fingers, and one ever-alert monitor reminding the teacher — \"Ma'am, we had a test today!\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/jac-12th-result-2025-declared-science-commerce-pass-percentage-toppers-2733559-2025-05-31",
      "headline": "Jharkhand board Class 12 result 2025 declared for science, commerce: Active linkThe JAC 12th result 2025 for Science and Commerce streams has been declared today, and students can now check their marks on jacresults.com using their roll numbers. Check the direct link here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mit-bans-indian-origin-student-megha-vemuri-graduation-ceremony-pro-palestine-speech-2733628-2025-05-31",
      "headline": "MIT bans Indian-origin student from graduation event over pro-Palestine speechThe Class of 2025 president, Megha Vemuri of Massachusetts Institute of Technology (MIT), earlier delivered a pro-Palestine speech following which she was barred from attending the official graduation commencement ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/valmik-thapar-tiger-conservationist-and-authordies-2733517-2025-05-31",
      "headline": "Valmik Thapar, India's 'tiger man', dies at 73 after battling cancerValmik Thapar, India's iconic tiger conservationist and author, passed away at 73 after battling cancer. Thapar was known for his decades-long work in Ranthambore.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/blending-style-with-substance-evolving-language-of-espionage-in-storytelling-2732594-2025-05-31",
      "headline": "Blending style with substance: Evolving language of espionage in storytellingThe spy genre is the current flavour of the season. Where are espionage stories heading with the emergence of shows like 'The Freelancer,' 'Special Ops' and 'The Family Man'? On Cinematic Saturday, we speak to artistes from the Hindi cinema to understand the changing landscape of the Indian spy genre.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-492-30-05-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/harvard-president-alan-garber-jab-donald-trump-speech-2025-batch-standing-ovation-2733586-2025-05-31",
      "headline": "Harvard president's dig at Trump with 'around the world' remark gets standing ovationHarvard University President Alan Garber's opening lines drew loud applause at the historic Tercentenary Theatre in Harvard Yard. This comes as the Donald Trump administration has been targeting the enrolment of international students at the institution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-appears-in-oval-office-with-black-eye-blames-playful-punch-from-son-2733437-2025-05-31",
      "headline": "Elon Musk appears with bruised, black eye at White House farewell eventX owner and SpaceX CEO Elon Musk stirred up buzz after he appeared with a bruised, black right eye at his farewell event at the White House, which was hosted by US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/is-protein-bar-a-healthy-breakfast-option-2733279-2025-05-31",
      "headline": "Is protein bar a good (and healthy) breakfast option?Breakfast on the go is no longer surprising. We are all chasing deadlines. Protein bars, meanwhile, have become a convenient option, but does that mean we could be inviting trouble?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-high-court-lalu-yadav-plea-pause-trial-court-proceedings-in-land-for-jobs-scam-cbi-case-2733618-2025-05-31",
      "headline": "High Court rejects Lalu Yadav's plea to halt trial in land-for-jobs scamRJD supremo Lalu Prasad Yadav's plea seeking a stay on the trial court proceedings in a CBI case related to the land-for-jobs scam has been rejected by the Delhi High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-reacts-to-emmanuel-macron-wife-slap-video-says-couple-was-just-joking-2733433-2025-05-31",
      "headline": "Make sure door remains closed: Trump's advice to Emmanuel Macron after slap videoTrump said he had spoken to Macron and assured reporters that the couple was fine. He added that they are two good people he knows very well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-nuclear-blackmail-mumbai-attack-26-11-warranted-response-times-changed-pakistan-operation-sindoor-2733555-2025-05-31",
      "headline": "26/11 warranted a response, times have changed now: S Jaishankar on Op SindoorExternal Affairs Minister S Jaishankar said on Friday that the 26/11 Mumbai 2008 attacks warranted a strong response. He added that India's resolve is much stronger now and those who \"nurture and utilise\" terrorism will have to pay a price."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/luis-enrique-psg-champions-league-final-2024-inter-milan-dembele-2733651-2025-05-31",
      "headline": "PSG's Enrique confident of repeating decade old Champions League gloryLuis Enrique targets a second Champions League title as PSG face Inter Milan in the final. His experienced team aims to control the game and make history in European football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/asian-athletics-championships-parul-chaudhary-vithya-ramraj-medals-2733652-2025-05-31",
      "headline": "Parul Chaudhary claims silver in women's 5000m, Vithya bags bronzeAsian Athletics Championship 2025: Parul Chaudhary won her second medal in the form of silver when she clocked 15:15.33 in the women's 5000m final on Saturday. Vithya Ramraj also added to India's medal's tally. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/arshad-nadeem-javelin-final-asian-athletics-2025-sachin-yadav-2733645-2025-05-31",
      "headline": "Asian Athletics: Arshad Nadeem wins gold, Sachin Yadav bags silver medalArshad Nadeem claimed gold with a massive 86.40m throw at the Asian Athletics Championship 2025. India's Sachin Yadav achieved his personal best and secured the silver medal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/asian-athletics-animesh-kujur-shatters-national-record-to-win-200m-bronze-2733630-2025-05-31",
      "headline": "Asian Athletics: Animesh Kujur shatters national record to win 200m bronzeIndia's Animesh Kujur won bronze medal in the men's 200m at the Asian Athletics Championship 2025. Kujur shattered national record as he finished third, completing the race in 20.32 seconds behind Japan's Towa Uzawa (1st) and Saudi Arabia's Abdulaziz Abdu Atafi (2nd)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-today-match-scores-badosa-sinner-djokovic-andreeva-gauff-2733626-2025-05-31",
      "headline": "Day 7 Live Updates: Paula Badosa, Mirra Andreeva in actionFrench Open 2025 Live Updates: Paula Badosa and Daria Kasatkina will start off the play's play on Court Simonne-Mathieu. 18-year-old Mirra Andreeva is also taking part in his second round match. Alexander Zverev and Jannik Sinner will be in action later in the day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-is-perfect-choice-for-test-captaincy-hes-matured-a-lot-sikhar-dhawan-2733610-2025-05-31",
      "headline": "Shubman Gill is perfect choice for Test captaincy, he's matured a lot: Sikhar DhawanFormer India cricketer Shikhar Dhawan has backed Shubman Gill to excel as Test captain on the upcoming tour of England. India will take on England in a five-match Test series beginning from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-final-psg-vs-inter-milan-luis-enrique-simone-inzaghi-battle-europe-dream-2733578-2025-05-31",
      "headline": "Luis Enrique and Simone Inzaghi chase one European dream in MunichAs Paris Saint-Germain and Inter Milan prepare to lock horns in the UEFA Champions League final this Saturday in Munich, the spotlight extends beyond the glittering roster of star players. The true battle will also be waged in the dugouts, where Luis Enrique and Simone Inzaghi—the tactical architects behind their teams' remarkable journeys—will play their chess match on Europe's grandest stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-is-a-cheat-code-in-t20-cricket-says-r-ashwin-2733582-2025-05-31",
      "headline": "Bumrah is a cheat code in T20 cricket, he elevates captain's stature: R AshwinFormer India off-spinner Ravichandran Ashwin has called Jasprit Bumrah a cheat code in T20 cricket, comparing him with the famous video game Road Rash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-wheelchair-cricket-mumbai-fans-video-2733567-2025-05-31",
      "headline": "Watch: AB de Villiers wows fans by playing wheelchair cricketFormer South African cricketer AB de Villiers joined the Mumbai wheelchair team at the Islam Gymkhana in Marine Lines. Fans captured the moments with pictures and videos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-assures-mahela-jayawardene-of-comeback-minutes-before-dismissing-sundar-2733534-2025-05-31",
      "headline": "Watch: Jasprit Bumrah assures coach of comeback minutes before dismissing SundarIndia and Mumbai Indians (MI) fast bowler Jasprit Bumrah was seen calming the nerves of head coach Mahela Jayawardene minutes before dismissing Washington Sundar in the Eliminator fixture of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-sai-sudharsan-press-conference-gujarat-titans-2733516-2025-05-31",
      "headline": "County stint has helped me: Sai Sudharsan set for England Tests after stellar IPLIPL 2025: Sai Sudharsan said that the playing county cricket in England has helped his batting. After a stellar run in the IPL where he scored 759 runs in 15 games, the left-hander will head to England for a five-match Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-final-psg-vs-inter-milan-luis-enrique-simone-inzaghi-battle-europe-dream-2733578-2025-05-31",
      "headline": "Luis Enrique and Simone Inzaghi chase one European dream in MunichAs Paris Saint-Germain and Inter Milan prepare to lock horns in the UEFA Champions League final this Saturday in Munich, the spotlight extends beyond the glittering roster of star players. The true battle will also be waged in the dugouts, where Luis Enrique and Simone Inzaghi—the tactical architects behind their teams' remarkable journeys—will play their chess match on Europe's grandest stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-is-a-cheat-code-in-t20-cricket-says-r-ashwin-2733582-2025-05-31",
      "headline": "Bumrah is a cheat code in T20 cricket, he elevates captain's stature: R AshwinFormer India off-spinner Ravichandran Ashwin has called Jasprit Bumrah a cheat code in T20 cricket, comparing him with the famous video game Road Rash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-wheelchair-cricket-mumbai-fans-video-2733567-2025-05-31",
      "headline": "Watch: AB de Villiers wows fans by playing wheelchair cricketFormer South African cricketer AB de Villiers joined the Mumbai wheelchair team at the Islam Gymkhana in Marine Lines. Fans captured the moments with pictures and videos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-assures-mahela-jayawardene-of-comeback-minutes-before-dismissing-sundar-2733534-2025-05-31",
      "headline": "Watch: Jasprit Bumrah assures coach of comeback minutes before dismissing SundarIndia and Mumbai Indians (MI) fast bowler Jasprit Bumrah was seen calming the nerves of head coach Mahela Jayawardene minutes before dismissing Washington Sundar in the Eliminator fixture of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-sai-sudharsan-press-conference-gujarat-titans-2733516-2025-05-31",
      "headline": "County stint has helped me: Sai Sudharsan set for England Tests after stellar IPLIPL 2025: Sai Sudharsan said that the playing county cricket in England has helped his batting. After a stellar run in the IPL where he scored 759 runs in 15 games, the left-hander will head to England for a five-match Test series. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}