{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/influencer-salary-insta-reels-economy-trending-online-vlogging-career-youtube-2761297-2025-07-25",
      "headline": "Everyone wants to be an influencer. But can it pay the bills?The creator economy in India is booming, but the economics remain shaky. What started as a hobby or side hustle for many is now a full-time hustle, and an increasingly competitive one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-721-points-lower-nifty-below-24900-bajaj-finance-falls-5-2761243-2025-07-25",
      "headline": "Sensex ends 721 points lower, Nifty below 24,900; Bajaj Finance falls 5%The S&P BSE Sensex was down 721.08 points to 81,463.09 at the closing bell, while the NSE Nifty50 declined 225.10 points to trade at 24,837. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rani-kapur-urges-agm-delay-at-sona-blw-after-son-sunjay-kapurs-death-2761168-2025-07-25",
      "headline": "Sunjay Kapur's mother seeks delay in AGM, alleges coercion after son's deathRani Kapur has publicly objected to what she calls an \"inappropriate and premature\" AGM, held during a period of deep mourning, and raised serious concerns over how decisions are being made in the aftermath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-fta-trade-deal-what-is-dcc-how-helps-indian-workers-more-jobs-2761167-2025-07-25",
      "headline": "India-UK trade deal: How DCC agreement could open doors for Indian workersOne of the key parts of the India-UK trade deal is the introduction of the Double Contribution Convention (DCC), which is expected to help Indian professionals working in the UK by reducing their social security burden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-under-old-regime-claim-these-5-home-loan-tax-benefits-new-tax-regime-2761154-2025-07-25",
      "headline": "Filing ITR under old regime? Claim these 5 home loan tax benefits If you are sticking to the old tax regime this year, make sure you don't miss out on the big tax savings your home loan can offer. Here are five home loan benefits you must know for your ITR. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/who-has-to-file-itr-by-when-all-2025-deadlines-explained-income-tax-filing-2761076-2025-07-25",
      "headline": "Who has to file ITR by when? All 2025 deadlines explainedFiling your ITR on time can save you from paying extra penalties. But not everyone has the same deadline this year. Here's a quick look at who must file by when for the 2025 cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-400-points-why-stock-markets-are-in-the-red-today-2761014-2025-07-25",
      "headline": "Sensex tumbles over 700 points: Why stock markets are in the red today The benchmark S&P BSE Sensex fell 624.64 points to 81,559.53 by 10:41 am, while the NSE Nifty50 slipped 215.85 points to 24,846.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/iex-share-price-gain-11-percent-why-reason-q1-results-indian-energy-exchange-stock-up-2761005-2025-07-25",
      "headline": "Explained: Why IEX share price gained 11% todayIEX stock opened at Rs 137.00 today, higher than the previous close of Rs 132.45. It climbed further to touch a high of Rs 149.45 in morning trade. As of 9:37 am, the share was trading at Rs 146.80, up 10.84%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-bajaj-finance-shares-tumbled-up-to-6-percent-despite-strong-q1-results-2761000-2025-07-25",
      "headline": "Explained: Why Bajaj Finance shares tumbled 6% despite strong Q1 resultsThe Bajaj Finance stock was down 5.42% at Rs 907 on the BSE at around 9:28 am, while Bajaj Finserv also fell nearly 5%. Bajaj Finance touched an intraday low of Rs 898.10, marking a 6.3% decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nsdl-ipo-check-price-band-gmp-key-dates-issue-size-and-more-2760994-2025-07-25",
      "headline": "NSDL IPO: Check price band, GMP, key dates, issue size and moreThe IPO, a pure offer for sale, aims to raise Rs 4,011 crore. It will open for subscription on July 30 and close on August 1, with anchor bids starting a day earlier on July 29."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-falls-300-points-at-opening-nifty-below-25000-bajaj-finance-tanks-5-percent-2760986-2025-07-25",
      "headline": "Sensex falls 300 points at opening, Nifty below 25,000; Bajaj Finance tanks 5%The S&P BSE Sensex was down by 389.42 points to 81,794.75, while the NSE Nifty50 lost 133.70 points to 24,928.40 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/iex-share-price-q1-results-indian-energy-exchange-stock-in-focus-why-cerc-market-coupling-2760976-2025-07-25",
      "headline": "IEX stock: Indian Energy Exchange shares to be in focus today. Here's whyIEX shares fell sharply on Thursday, July 24. The stock dropped as much as 28% and touched a 52-week low of Rs 135.26 on the BSE. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/intel-layoffs-25000-job-cut-ceo-lip-bu-tan-chipmaker-cost-cutting-tech-roles-us-report-restructuring-2760964-2025-07-25",
      "headline": "Intel layoffs: 25,000 roles at risk as company braces for big reset, says reportIn a letter to employees, Intel's new CEO Lip-Bu Tan acknowledged the difficult period the company is going through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-microsoft-tech-hiring-in-us-donald-trump-warning-indians-ai-race-america-first-policy-2760959-2025-07-25",
      "headline": "Why Donald Trump doesn't want Google, Microsoft to hire IndiansSpeaking at an AI Summit in Washington on Wednesday, Donald Trump said American companies must now put national interest first, especially in the fast-growing field of artificial intelligence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/kristin-cabot-resigns-from-astronomer-after-viral-coldplay-kiss-cam-scandal-glbs-2760932-2025-07-25",
      "headline": "Kristin Cabot, Astronomer HR head, resigns after viral Coldplay kiss-cam scandalAstronomer's HR chief Kristin Cabot resigned days after being caught on a Coldplay kiss-cam with CEO Andy Byron, who also stepped down earlier amid the viral scandal and public backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sunder-pichai-net-worth-hits-usd-1-billion-alphabet-shares-rise-quarterly-results-google-ceo-money-salary-2760915-2025-07-25",
      "headline": "Billionaire behind your browser: Sundar Pichai's net worth crosses $1 billionAlphabet stock has returned around 120% to investors since 2023 and is now trading close to its all-time high. This has benefited top executives, including Sundar Pichai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-uk-free-trade-deal-how-the-deal-could-boost-bilateral-trade-2760706-2025-07-24",
      "headline": "India-UK free trade deal: How the deal could boost bilateral tradeThe deal is expected to provide greater market access for Indian products and services, while UK companies, particularly in sectors like automobiles and medical equipment, will also benefit from reduced tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-some-purchases-are-priceless-startup-founder-shyam-achuthan-on-spending-and-living-well-2760739-2025-07-24",
      "headline": "Why some purchases are priceless: Startup founder on spending and living wellWe often treat money decisions like maths problems, but this startup founder says some buys, like a family car or your own home, bring wealth you can't count."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pm-modi-in-uk-for-fta-cheaper-scotch-and-cars-on-cards-2760695-2025-07-24",
      "headline": "PM Modi in UK for FTA: Cheaper scotch and cars on cardsPrime Minister Narendra Modi is in the UK for a meeting with the UK Prime Minister and is also expected to meet King Charles III, with the India-UK Free Trade Agreement (FTA) being the main focus. This agreement is set to provide significant market access to Indian sectors like fisheries, textiles, gems, jewellery, and leather, with a potential market size of $5.2 billion in the UK for the fisheries sector alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/money-matters-but-joy-matters-more-edelweiss-mutual-fund-radhika-gupta-mantra-for-life-2760708-2025-07-24",
      "headline": "Money matters, but joy matters more: Edelweiss' Radhika Gupta's mantra for lifeMany young earners feel constant pressure to save every rupee for the future. It's common to hear advice about building a fat retirement fund or aiming for the highest returns. But Radhika Gupta wants people to know that money is only useful if it also makes your present better."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/textile-exports-leather-goods-engineering-software-indias-economy-benefit-uk-trade-deal-pm-modi-2760679-2025-07-24",
      "headline": "Whisky, chocolates, cars: What gets cheaper for Indians after UK trade dealThe trade agreement was signed by India's Commerce Minister Piyush Goyal and the UK's Secretary of State for Business and Trade, Jonathan Reynolds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-542-points-lower-nifty-below-25100-as-volatility-weighs-heavy-2760677-2025-07-24",
      "headline": "Sensex ends 542 points lower, Nifty below 25,100 as volatility weighs heavyThe S&P BSE Sensex ended 542.47 points lower at 82,184.17, while the NSE Nifty50 declined 157.80 points to close at 25,062.10. Selling pressure was visible across sectors, with FMCG, IT, and financial stocks dragging the indices down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/small-shopkeepers-are-turning-away-from-upi-payments-2760642-2025-07-24",
      "headline": "Small shopkeepers are turning away from UPI paymentsAccording to the National Payments Corporation of India (NPCI), UPI saw over 14.04 billion transactions in June 2024. Yet, for many at the grassroots, the system seems too complex and risky to fully embrace. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/anil-ambani-ed-raid-today-reliance-power-infra-shares-down-5-percent-loan-fraud-2760636-2025-07-24",
      "headline": "ED raids hit Anil Ambani stocks: Reliance Power, Infra sink 5%Reliance Infrastructure has lost 9.37% in the past five trading sessions, Reliance Power has fallen by 7.41% during the same period. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filed-the-wrong-itr-form-heres-how-to-fix-it-to-avoid-penalty-2760613-2025-07-24",
      "headline": "Filed the wrong ITR form? Here's how to fix it to avoid penaltyMany taxpayers only spot mistakes after hitting 'Submit'. Filing the wrong form can snowball into bigger headaches later, from refund delays to unexpected penalties. But tax experts say you do have ways to set things right, provided you act quickly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-over-500-points-why-stock-market-is-down-today-2760574-2025-07-24",
      "headline": "Sensex plunges 600 points. Why is the stock market down today?The S&P BSE Sensex dropped 592.85 points to 82,133.79 by 1:04 pm, while the NSE Nifty50 fell 169.25 points to 25,050.65. All broader market indices were in the red as market sentiment weakened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-now-on-digilocker-see-how-it-helps-you-pension-account-pf-balance-2760554-2025-07-24",
      "headline": "EPFO now on DigiLocker: See how it helps youThe government has been making several digital changes for EPFO members in the last few months. This new feature on DigiLocker is another step to make your provident fund details more accessible. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-raid-today-why-reason-loan-bribery-rs-3000-crore-fraud-sbi-sebi-2760549-2025-07-24",
      "headline": "Loan, lies and bribery? Why Anil Ambani is facing ED heatMultiple agencies, including the National Housing Bank, the Securities and Exchange Board of India (Sebi), the National Financial Reporting Authority (NFRA), and Bank of Baroda shared findings and inputs that contributed to the investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-whats-on-the-table-in-the-landmark-usd-34-billion-deal-2760546-2025-07-24",
      "headline": "India-UK FTA: What's on the table in landmark $34 billion deal?For Indian businesses, the FTA opens up wider access to British markets by slashing tariffs and easing compliance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-penalty-for-missed-income-tax-deadlines-panel-suggests-in-new-income-tax-bill-2025-2760516-2025-07-24",
      "headline": "No penalty for missed income tax deadlines? Panel suggests in New Tax BillThe suggestions come from the Select Committee, which has studied the new Income Tax Bill, 2025. This new Bill is meant to replace the old Income Tax Act of 1961."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ed-conducts-raids-on-properties-linked-to-anil-ambani-in-mumbai-2760503-2025-07-24",
      "headline": "ED conducts raids on properties linked to Anil Ambani in MumbaiThe Enforcement Directorate (ED) on Thursday carried out searches at multiple locations in Mumbai connected to industrialist Anil Ambani's companies, days after the State Bank of India (SBI) classified Reliance Communications and Ambani himself as 'fraud'. While his personal residence wasn't searched, ED teams from Delhi and Mumbai targeted premises tied to Reliance Anil Ambani Group (RAAGA) companies in connection with an ongoing money laundering investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/iex-share-price-plunges-20-today-whats-behind-the-fall-2760496-2025-07-24",
      "headline": "IEX share price crashes 23% to hit 52-week low. What's behind the fall?IEX shares nosedived after CERC announced phased implementation of market coupling. The move aims to centralise price discovery, challenging IEX's dominance. Investors await clarity from the company's Q1FY26 results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enforcement-directorate-raids-anil-ambani-linked-premises-in-mumbai-days-after-sbi-declared-him-fraud-2760489-2025-07-24",
      "headline": "ED raids Anil Ambani-linked premises in Mumbai days after SBI's 'fraud' tagWhile Anil Ambani's personal residence was not part of the search operation, the ED teams from Delhi and Mumbai visited premises tied to some of his group companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-ipo-check-key-dates-issue-size-and-other-key-details-2760481-2025-07-24",
      "headline": "NSDL IPO: Check key dates, issue size and other key detailsThe NSDL IPO will open on July 30 and close on August 1, offering 5.01 crore shares through an offer for sale by existing institutional shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-share-price-down-q1-results-buy-sell-hold-review-expert-outlook-price-target-2760467-2025-07-24",
      "headline": "Infosys shares down 1% despite good Q1 results. Should you buy, hold, or sell?Infosys posted a consolidated net profit of Rs 6,921 crore for the June quarter, up 8.7% compared to the same period last year. The revenue grew by 7.5% year-on-year to Rs 42,279 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/investment-advisor-on-whatsapp-telegram-stock-tip-groups-scam-2760465-2025-07-24",
      "headline": "Investment advisor explains how 'free' stock tip groups scam peopleThe investment advisor explains how so-called \"free\" stock tip groups on WhatsApp and Telegram are duping thousands of unsuspecting retail investors, all under the guise of financial advice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-44-points-lower-nifty-below-25300-tata-motors-up-1-percent-2760439-2025-07-24",
      "headline": "Sensex opens 44 points lower, Nifty below 25,300; Tata Motors up 1%The S&P BSE Sensex was down by 122.46 points to 82,604.18, while the NSE Nifty50 lost 14.95 points to 25,204.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-donald-trump-pm-modi-tariff-export-duties-2760432-2025-07-24",
      "headline": "India-US trade deal still pending: Is Trump asking for too much?In the last few weeks, the US has signed several trade agreements with countries such as Vietnam, Indonesia, the Philippines and Japan. But a deal with India remains out of reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-uk-visit-trade-deal-tariff-import-tax-keir-starmer-eu-piyush-goyal-trump-us-2760419-2025-07-24",
      "headline": "PM Modi UK visit: All you need to know about India-UK trade deal on the cardsThe free trade agreement will be India's first major bilateral trade deal with a developed country in over 10 years. It is also the most important trade deal the UK has signed since leaving the European Union."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-house-bank-loan-emi-burden-expert-explains-drawabacks-2760148-2025-07-23",
      "headline": "Explained: Why buying flats on hefty EMIs may not be wiseAs returns from residential real estate continue to underwhelm, financial advisors are urging Indians to rethink the emotional appeal of homeownership and consider smarter, more flexible investment avenues for long-term wealth creation."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/matt-shakman-vanessa-kirby-pedro-pascal-on-rebooting-fantastic-four-2761300-2025-07-25",
      "headline": "Matt Shakman, Vanessa Kirby, Pedro Pascal on rebooting Fantastic FourMarvel Studios introduces The Fantastic Four: First Steps, a fresh take on the iconic superhero family set in an alternate 1960s universe. The film combines cosmic adventure with heartfelt themes of parenthood and vulnerability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-trailer-review-style-swag-and-jarring-bikini-moment-in-hrithik-roshan-jr-ntr-kiara-advani-film-2761277-2025-07-25",
      "headline": "War 2 trailer review: Style, swag and jarring bikini moment in Hrithik-Jr NTR's film'War 2' looks unbelievably stylish, and packed with swag. But is that all? Are we getting another spy film that glorifies that one saviour of the country? And more importantly, what is an Indian Air Force officer doing in a bikini? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/udaipur-files-release-date-august-8-2025-supreme-court-clearance-2761285-2025-07-25",
      "headline": "Udaipur Files to release on August 8 after Supreme Court clearanceThe film 'Udaipur Files' is set for release on August 8, 2025 post Supreme Court direction. The decision comes after censor and legal challenges caused a delay to its original release date. Starring Vijay Raaz, it aims to reach a global audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-trailer-x-reaction-fans-praise-hrithik-roshan-jr-ntr-kiara-advani-2761186-2025-07-25",
      "headline": "War 2 trailer X reaction: Fans praise Hrithik Roshan, Jr NTR, Kiara's action festThe 'War 2' trailer starring Hrithik Roshan, Jr NTR, and Kiara Advani has earned praise online. Fans are excited for the Hrithik-Jr NTR showdown and Kiara's action-packed role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hulk-hogan-wrestling-legend-dies-aged-71-celebrities-pay-tribute-varun-dhawan-arjun-kapoor-the-rock-brooke-shields-2761127-2025-07-25",
      "headline": "Varun Dhawan to Arjun Kapoor, celebs mourn WWE icon Hulk Hogan's deathWWE star Hulk Hogan died aged 71 after suffering a cardiac arrest at his home in Florida. Actors Varun Dhawan, Arjun Kapoor and others paid tribute to the wrestling icon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-prime-video-this-weekend-2761227-2025-07-25",
      "headline": "Top films and shows to watch on Prime Video this weekendStill thinking about what to watch this weekend? Here's a list of new films and series you can watch on Prime Video this weekend. This includes 'Rangeen', 'Kannappa', episode 3 of 'The Summer I Turned Pretty season 2', and more.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/thalaivan-thalaivii-review-vijay-sethupathi-pandiraaj-nithya-menen-loud-regressive-film-anti-divorce-stance-2761199-2025-07-25",
      "headline": "Thalaivan Thalaivii review: Loud, regressive film with anti-divorce stanceRelease Date:Fri Jul 25, 2025Thalaivan Thalaivii movie review: Director Pandiraaj's 'Thalaivan Thalaivii', starring Vijay Sethupathi and Nithya Menen, is a noisy family drama that promotes and glorifies regressive ideas. The film ridicules divorce and people who opt for it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mandala-murders-review-vaani-kapoor-ambitious-thriller-dares-to-dig-deep-but-loses-its-way-2761160-2025-07-25",
      "headline": "Mandala Murders Review: An ambitious thriller that dares to dig deep, but loses its wayRelease Date:Fri Jul 25, 2025Mandala Murders series review: 'Mandala Murders', Netflix's latest Hindi thriller, weaves Indian mythology and crime in a gripping yet uneven narrative set in Uttar Pradesh. While rich in atmosphere and performances, the series struggles with pacing and clarity, making it a one-time watch for thriller enthusiasts in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-7-detailed-report-what-a-fascinating-1st-week-for-ahaan-panday-aneet-padda-love-story-2761173-2025-07-25",
      "headline": "Saiyaara box office Day 7: What a fascinating 1st week for Ahaan-Aneet's love story!YRF's 'Saiyaara' has made the audience rush to theatres. The Ahaan Panday and Aneet Padda starrer finished its glorious first week at the box office, and performed so well that every day seemed like a celebration in cinema halls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-sreeleela-bobby-deol-team-new-film-title-to-be-out-soon-2761146-2025-07-25",
      "headline": "Ranveer Singh, Sreeleela, Bobby Deol team up for new film, title to be out soonRanveer Singh, Sreeleela and Bobby Deol are set to team up for a new film. The title and first look of the upcoming project will be out next week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-box-office-collection-day-1-detailed-report-pawan-kalyan-film-beats-vakeel-saab-for-biggest-opening-of-career-2761140-2025-07-25",
      "headline": "Hari Hara Veera Mallu box office Day 1: Pawan Kalyan's film beats Vakeel SaabPawan Kalyan's film 'Hari Hara Veera Mallu' breaks records with Rs 44 crore opening day collection, surpassing the opening record of his previous hit, 'Vakeel Saab'. Here's how the film fared on its first day at the box office in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fantastic-four-first-steps-x-review-marvel-new-film-masterpiece-vanessa-kirby-pedro-pascal-2761023-2025-07-25",
      "headline": "Fantastic Four First Steps X review: Fans praise MCU's strongest masterpiece yetMarvel's 'The Fantastic Four: First Steps' released in theatres today with mixed reviews. Fans praised the stellar performances of the actors Vanessa Kirby and Pedro Pascal, who stand out in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/travis-kelce-taylor-swift-romance-instagram-lock-screen-official-2761092-2025-07-25",
      "headline": "Travis Kelce makes his romance with Taylor Instagram and lock screen officialTravis Kelce posted some adorable couple photos with Taylor Swift on Instagram, revealing that his phone lock screen is a black-and-white picture of the two of them together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-launches-kindness-curriculum-so-positive-teach-children-empathy-art-2761087-2025-07-25",
      "headline": "Ananya Panday launches kindness curriculum to teach children empathy through artActor Ananya Panday is taking her mission of spreading kindness to the next level with the launch of a Kindness Curriculum under her So Positive platform, in collaboration with NGO Slam Out Loud. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-fans-disrupt-uk-screening-with-confetti-theatre-staff-respond-2761048-2025-07-25",
      "headline": "Chaos breaks out at Pawan Kalyan's Hari Hara Veera Mallu UK screening, video viralFans of the film 'Hari Hara Veera Mallu' caused a disruption at a UK theatre by throwing confetti during the screening, leading to widespread criticism and the screening being halted. The film, starring Pawan Kalyan, has received mixed reviews in India for its ambitious storyline but flawed execution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/johny-lever-daughter-jamie-lever-recalls-being-asked-to-strip-in-scam-audition-2760989-2025-07-25",
      "headline": "Johny Lever's daughter Jamie recalls being asked to strip in scam auditionJamie Lever, actor-comedian and daughter of Johny Lever, recently recalled a disturbing audition experience where she was asked to strip. She shared that while she had been informed the role was 'bold', the audition quickly took an uncomfortable and inappropriate turn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-trailer-ayan-mukerji-hrithik-roshan-jr-ntr-kiara-advani-2761016-2025-07-25",
      "headline": "War 2 trailer: It's Hrithik Roshan vs Jr NTR in a never-seen-before action sagaThe much-anticipated trailer for 'War 2', starring the never-seen-before actor-duo Hrithik Roshan and Jr NTR is out. The film, a sequel to the 2019 film 'War', is scheduled for an Independence Day release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-fantastic-four-first-steps-review-marvel-first-family-gets-a-well-deserved-reboot-pedro-pascal-2761008-2025-07-25",
      "headline": "Fantastic Four First Steps review: Marvel's first family gets a well-deserved reboot Release Date:Fri Jul 25, 2025Marvel's 'The Fantastic Four: First Steps' refreshes the classic superhero team with a nostalgic yet modern twist, set in a vibrant 1960s retro-futuristic universe. The film shines through its heartfelt character moments and stylish visuals, making it a promising new beginning for the franchise despite some familiar villain shortcomings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fahadh-faasil-wants-to-drive-an-uber-in-barcelona-after-his-retirement-2760993-2025-07-25",
      "headline": "Fahadh Faasil wants to drive an Uber in Barcelona after his retirementMalayalam actor Fahadh Faasil has shared his heartfelt retirement dream of driving an Uber in Barcelona, highlighting his love for simple joys beyond cinema. The actor is currently promoting his latesy film 'Mareesan'. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/narendra-modi-not-a-big-problem-rahul-gandhi-says-pm-is-all-optics-no-substance-2761247-2025-07-25",
      "headline": "Narendra Modi not a big problem: Rahul Gandhi says PM is all show, no substanceRahul Gandhi claimed that after meeting PM Modi two to three times and \"sitting with him in the same room,\" he had figured that the Prime Minister was never a \"big problem.\" He then went on to say, \"Dum nahin hai\" (he doesn't hold that much power)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/muizzu-by-his-side-pm-gets-21-gun-salute-at-maldives-independence-day-event-2761241-2025-07-25",
      "headline": "Muizzu by his side, PM gets 21-gun salute at Maldives Independence Day eventPrime Minister Narendra Modi, who landed in Male, Maldives on Friday to attend the 60th Independence Day celebrations of the country, was welcomed with a 21-gun salute at the event. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rani-kapur-urges-agm-delay-at-sona-blw-after-son-sunjay-kapurs-death-2761168-2025-07-25",
      "headline": "Sunjay Kapur's mother seeks delay in AGM, alleges coercion after son's deathRani Kapur has publicly objected to what she calls an \"inappropriate and premature\" AGM, held during a period of deep mourning, and raised serious concerns over how decisions are being made in the aftermath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-live-score-4th-test-day-3-updates-manchester-bumrah-stokes-2761203-2025-07-25",
      "headline": "4th Test Day 3 Live: India turn to Jadeja after pacers fail on Friday morningIndia (IND) vs England (ENG), 4th Test, Day 3 Live Score and Updates: India have been wicketless in the first 75 minutes of the day's play. Jasprit Bumrah, Mohammed Siraj and Anshul Kamboj failed to break this third wicket partnership between Joe Root and Ollie Pope. Ravindra Jadeja has been brought into the attack. Can India find a breakthrough in the first session?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/india-nuke-scare-cia-nanda-devi-nuclear-device-itbp-himalayas-1965-mission-uttarakhand-china-test-guru-rinpoche-2761183-2025-07-25",
      "headline": "How an India-US spy mission lost a nuclear device in the HimalayasAfter China's first atomic test, the US and India, as part of a covert operation, tried to place a nuclear-powered listening device at 25,000 feet in the Himalayas near the Nanda Devi peak. A blizzard forced the CIA-IB team to leave the device on the route. A recovery mission, and several search operations, failed to locate the device."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ullu-altt-desiflix-and-other-ott-platforms-banned-for-showing-soft-porn-content-2761128-2025-07-25",
      "headline": "Ullu, ALTT, Desiflix among 25 OTT platforms banned for showing soft pornThe government has cracked down on multiple streaming platforms like Ullu, ALTT and Desiflix for hosting soft porn, blocking apps, websites and social media handles."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/why-a-53-year-old-rape-convict-man-will-be-sentenced-as-a-juvenile-explained-2761245-2025-07-25",
      "headline": "Explained: Why a 53-year-old rape convict will be sentenced as a juvenileA 53-year-old man convicted of raping a minor in 1988 will be sentenced as a juvenile, the Supreme Court of India ruled. This explainer delves into why this ruling was made, highlighting the application of India's Juvenile Justice laws. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-cag-is-alarmed-by-maharashtras-off-budget-borrowings-2760687-2025-07-24",
      "headline": "Why CAG is alarmed by Maharashtra's off-Budget borrowingsThe statutory auditor, in its report, cautioned that continuing with the trend could worsen the debt/GSDP ratio, reducing the government's fiscal flexibility"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-congress-should-serve-jagdeep-dhankhar-some-dhokla-bjp-indira-gandhi-resignation-vice-president-election-2760947-2025-07-25",
      "headline": "Why Congress should serve Dhankhar some dhoklaWill Jagdeep Dhankhar return in a non-BJP avatar? It shouldn't be difficult for a protégé of Chaudhary Charan Singh, known for his flexibility, but will Opposition parties, especially the Congress, make the most of a disgruntled BJP leader? The Opposition would do well to serve Dhankhar some dhokla."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/ankiva-fall-12th-floor-vasai-east-child-safety-high-rise-thane-2761192-2025-07-25",
      "headline": "Placed atop shoe rack near window ledge, girl, 4, falls to death from 12th floorA four-year-old girl in Thane died after falling from the 12th floor while sitting on a window ledge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mandala-murders-review-vaani-kapoor-ambitious-thriller-dares-to-dig-deep-but-loses-its-way-2761160-2025-07-25",
      "headline": "Mandala Murders Review: An ambitious thriller that dares to dig deep, but loses its wayRelease Date:Fri Jul 25, 2025Mandala Murders series review: 'Mandala Murders', Netflix's latest Hindi thriller, weaves Indian mythology and crime in a gripping yet uneven narrative set in Uttar Pradesh. While rich in atmosphere and performances, the series struggles with pacing and clarity, making it a one-time watch for thriller enthusiasts in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-fta-trade-deal-what-is-dcc-how-helps-indian-workers-more-jobs-2761167-2025-07-25",
      "headline": "India-UK trade deal: How DCC agreement could open doors for Indian workersOne of the key parts of the India-UK trade deal is the introduction of the Double Contribution Convention (DCC), which is expected to help Indian professionals working in the UK by reducing their social security burden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/parenting-doesnt-need-to-feel-chaotic-rhythmic-parenting-offers-a-gentler-path-2761279-2025-07-25",
      "headline": "Parenting doesn't need to feel chaotic. 'Rhythmic Parenting' offers a gentler pathModern parenting feels rushed and reactive. In their book Rhythmic Parenting, Saloni Azuchi and Aparajita Sadhu explore how reconnecting with natural rhythms — breath, sleep, and movement — can restore balance. On this episode of Booked, they speak with Sneha Mordani."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lok-sabha-consensus-government-opposition-bihar-sir-operation-sindoor-2761189-2025-07-25",
      "headline": "Parliament sees 'dustbin' protest, smooth functioning likely from MondayThe government and the opposition, which has been protesting over several issues, ironed out their differences at an all-party meeting chaired by Lok Sabha Speaker Om Birla."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/menopause-before-30-is-rising-what-it-means-for-fertility-and-how-ivf-helps-2761067-2025-07-25",
      "headline": "Menopause before 30 is rising: What it means for fertility and how IVF helpsWhat exactly is early menopause? Why is it happening to younger Indian women? And why are so few people talking about it? Doctors answer on World IVF Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-london-visit-chai-pe-charcha-viral-video-akhil-patel-tea-seller-2761139-2025-07-25",
      "headline": "From one chaiwala to another: Indian tea seller's viral moment with PM in UKThe incident happened when PM Modi and his British counterpart Keir Starmer marked the signing of the landmark free trade agreement (FTA) by sharing a cup of tea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/latest-auto-news/story/uk-india-trade-deal-know-how-it-will-benefit-luxury-car-buyers-2761217-2025-07-25",
      "headline": "UK-India trade deal: Know how it will benefit luxury car buyersIndia and the UK have signed a landmark trade deal that will significantly reduce import duties on British luxury and electric vehicles, making UK-made cars more affordable for Indian buyers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/the-looming-google-earth-lens-how-indias-strategic-assets-lie-exposed-vulnerable-to-harm-2760192-2025-07-23",
      "headline": "How India's strategic assets lie exposed, vulnerable to harmWith detailed imagery of military bases, nuclear plants, border posts and more easily accessible to Open Source Intelligence, how dangerous is this for national security?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dharmasthala-whistleblower-karnataka-rape-murder-mass-burial-sowjanya-sit-probe-five-big-questions-2760717-2025-07-25",
      "headline": "Dharmasthala mass-burial case: 5 big questions that raise a stinkA probe by an SIT has been ordered by the Karnataka government into allegations that mass burials of raped and murdered women were carried out over the years in Dharmasthala, a popular temple town. Despite the claims by a whistleblower, there are several unanswered questions that make the case curious."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-bound-air-india-flight-returns-to-base-18-minutes-after-take-off-from-jaipur-due-to-technical-fault-2761216-2025-07-25",
      "headline": "Air India flight to Mumbai returns to base minutes after take-off from JaipurAn Air India flight to Mumbai made an emergency return to Jaipur 18 minutes after takeoff due to a technical glitch."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/thalaivan-thalaivii-review-vijay-sethupathi-pandiraaj-nithya-menen-loud-regressive-film-anti-divorce-stance-2761199-2025-07-25",
      "headline": "Thalaivan Thalaivii review: Loud, regressive film with anti-divorce stanceRelease Date:Fri Jul 25, 2025Thalaivan Thalaivii movie review: Director Pandiraaj's 'Thalaivan Thalaivii', starring Vijay Sethupathi and Nithya Menen, is a noisy family drama that promotes and glorifies regressive ideas. The film ridicules divorce and people who opt for it. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/roof-of-school-building-collapses-in-rajasthans-jhalawar-many-feared-dead-2760997-2025-07-25",
      "headline": "7 students dead, over 15 injured as school roof collapses in Rajasthan's JhalawarThe roof of a primary school collapsed in Rajasthan's Jhalawar on Friday morning, leaving six  students dead and at over 15 injured. Several others are feared trapped under the debris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/when-vp-jagdeep-dhankar-saved-salman-khan-blackbuck-case-jail-poaching-bailsaif-ali-khan-sonali-bendre-2761144-2025-07-25",
      "headline": "When Dhankhar got Salman Khan bail in blackbuck caseJagdeep Dhankhar resigned from the Vice-President's post, citing his health. Before becoming the Veep, Dhankhar was a seasoned lawyer who also represented actor Salman Khan in the 1998 blackbuck poaching case and helped him and other accused secure bail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/justice-yashwant-varmas-impeachment-speaker-to-seek-br-gavais-opinion-for-inquiry-panel-2761224-2025-07-25",
      "headline": "Justice Varma's impeachment: Speaker to seek BR Gavai's opinion for inquiry panelJustice Yashwant Varma has moved the Supreme Court challenging an earlier in-house probe report that found him culpable after bundles of cash were recovered from his official residence during a fire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/matt-shakman-vanessa-kirby-pedro-pascal-on-rebooting-fantastic-four-2761300-2025-07-25",
      "headline": "Matt Shakman, Vanessa Kirby, Pedro Pascal on rebooting Fantastic FourMarvel Studios introduces The Fantastic Four: First Steps, a fresh take on the iconic superhero family set in an alternate 1960s universe. The film combines cosmic adventure with heartfelt themes of parenthood and vulnerability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-trailer-review-style-swag-and-jarring-bikini-moment-in-hrithik-roshan-jr-ntr-kiara-advani-film-2761277-2025-07-25",
      "headline": "War 2 trailer review: Style, swag and jarring bikini moment in Hrithik-Jr NTR's film'War 2' looks unbelievably stylish, and packed with swag. But is that all? Are we getting another spy film that glorifies that one saviour of the country? And more importantly, what is an Indian Air Force officer doing in a bikini? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/udaipur-files-release-date-august-8-2025-supreme-court-clearance-2761285-2025-07-25",
      "headline": "Udaipur Files to release on August 8 after Supreme Court clearanceThe film 'Udaipur Files' is set for release on August 8, 2025 post Supreme Court direction. The decision comes after censor and legal challenges caused a delay to its original release date. Starring Vijay Raaz, it aims to reach a global audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-trailer-x-reaction-fans-praise-hrithik-roshan-jr-ntr-kiara-advani-2761186-2025-07-25",
      "headline": "War 2 trailer X reaction: Fans praise Hrithik Roshan, Jr NTR, Kiara's action festThe 'War 2' trailer starring Hrithik Roshan, Jr NTR, and Kiara Advani has earned praise online. Fans are excited for the Hrithik-Jr NTR showdown and Kiara's action-packed role."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-nayar-appointed-up-warriorz-head-coach-wpl-2025-2761290-2025-07-25",
      "headline": "Abhishek Nayar named UP Warriorz head coach for WPL season 4Abhishek Nayar has been named head coach of UP Warriorz ahead of the WPL season 4. His appointment aims to strengthen the team and nurture domestic talent for a title challenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-viktor-gyokeres-agreement-no-14-shirt-transfer-news-2761306-2025-07-25",
      "headline": "Arsenal reach full agreement for Viktor Gyokeres, set to take iconic No.14: ReportArsenal have reportedly had a final agreement with Sporting CP regarding the transfer of Viktor Gyokeres. He is set to switch to the London-based club and even don the iconic No.14 shirt as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-joe-root-test-runs-third-all-time-list-dravid-kallis-2761299-2025-07-25",
      "headline": "Joe Root surpasses Rahul Dravid to become third-highest run-scorer in Test cricketJoe Root surpassed Rahul Dravid and Jacques Kallis to become the third highest run-scorer in Test cricket. This milestone highlights Root's place among cricketing greats and raises expectations for his future performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-bhuvneshwar-kumar-dukes-ball-debate-cricket-change-manchester-test-2761270-2025-07-25",
      "headline": "Cricket has changed quite a bit: Bhuvneshwar weighs in on Dukes ball debateBhuvneshwar Kumar suggested that multiple factors could be in play for the Dukes ball to not provide the expected levels of movement in the ongoing Test series between England and India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-hemang-badani-england-vs-india-manchester-2761256-2025-07-25",
      "headline": "Rishabh Pant is someone who can lead India in the future: Hemang BadaniENG vs IND: Hemang Badani said that Rishabh Pant has excellent leadership qualities and can be India's captain in the future. Pant conjured cheers from the cricket fraternity for batting with a broken toe on the second day at Old Trafford. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-manchester-test-england-trying-to-win-bazball-evolution-steve-smith-2761218-2025-07-25",
      "headline": "England trying to win, not be entertainers: Steve Smith sees evolution in BazballSteve Smith reckons that England may have evolved from trying to entertain the crowd to winning games as seen in the ongoing Test series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-live-score-4th-test-day-3-updates-manchester-bumrah-stokes-2761203-2025-07-25",
      "headline": "4th Test Day 3 Live: England race past 250 as India pacers struggleIndia (IND) vs England (ENG), 4th Test, Day 3 Live Score and Updates: Jasprit Bumrah has been brought into the attack early in the day's play. Mohammed Siraj is operating from the other end. There's no hint of movement off the surface as the sun is shining bright at Old Trafford. Joe Root and Ollie Pope have a great opportunity to go big."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-anshul-kamboj-r-ashwin-england-vs-india-4th-test-2761191-2025-07-25",
      "headline": "Shubman's decision to give Kamboj new ball highly debatable: AshwinENG vs IND: Ravichandran Ashwin has backed Indian skipper Shubman Gill's decision to hand the new ball to Anshul Kamboj, citing the debutant's skillset and expressing hope that the youngster will take wickets on Day 3 of the Manchester Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/dc-open-emma-raducanu-naomi-osaka-venus-williams-round-of-16-results-2761182-2025-07-25",
      "headline": "DC Open: Raducanu dominates Osaka, Venus Williams defeated in pre-quartersEmma Raducanu cruised past Naomi Osaka 6-4, 6-2 to reach the Washington Open quarter-finals and reclaim the British No. 1 spot. Venus Williams' comeback ended with a straight-sets loss to Magdalena Frech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-aakash-chopra-england-vs-india-manchester-test-2761149-2025-07-25",
      "headline": "Pant wasn't even able to walk: Chopra hails batter's unbreakable spiritENG vs IND, 4th Test: Rishabh Pant showed incredible courage by batting with a fractured toe during the fourth Test against England. Former cricketer Aakash Chopra praised his spirit, calling it inspiring and unforgettable. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-manchester-test-england-trying-to-win-bazball-evolution-steve-smith-2761218-2025-07-25",
      "headline": "England trying to win, not be entertainers: Steve Smith sees evolution in BazballSteve Smith reckons that England may have evolved from trying to entertain the crowd to winning games as seen in the ongoing Test series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-live-score-4th-test-day-3-updates-manchester-bumrah-stokes-2761203-2025-07-25",
      "headline": "4th Test Day 3 Live: England race past 250 as India pacers struggleIndia (IND) vs England (ENG), 4th Test, Day 3 Live Score and Updates: Jasprit Bumrah has been brought into the attack early in the day's play. Mohammed Siraj is operating from the other end. There's no hint of movement off the surface as the sun is shining bright at Old Trafford. Joe Root and Ollie Pope have a great opportunity to go big."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-anshul-kamboj-r-ashwin-england-vs-india-4th-test-2761191-2025-07-25",
      "headline": "Shubman's decision to give Kamboj new ball highly debatable: AshwinENG vs IND: Ravichandran Ashwin has backed Indian skipper Shubman Gill's decision to hand the new ball to Anshul Kamboj, citing the debutant's skillset and expressing hope that the youngster will take wickets on Day 3 of the Manchester Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/dc-open-emma-raducanu-naomi-osaka-venus-williams-round-of-16-results-2761182-2025-07-25",
      "headline": "DC Open: Raducanu dominates Osaka, Venus Williams defeated in pre-quartersEmma Raducanu cruised past Naomi Osaka 6-4, 6-2 to reach the Washington Open quarter-finals and reclaim the British No. 1 spot. Venus Williams' comeback ended with a straight-sets loss to Magdalena Frech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-aakash-chopra-england-vs-india-manchester-test-2761149-2025-07-25",
      "headline": "Pant wasn't even able to walk: Chopra hails batter's unbreakable spiritENG vs IND, 4th Test: Rishabh Pant showed incredible courage by batting with a fractured toe during the fourth Test against England. Former cricketer Aakash Chopra praised his spirit, calling it inspiring and unforgettable. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}