{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/these-5-banks-revise-fd-rates-karnataka-bank-yes-bank-canara-bank-as-rbis-mpc-meeting-kicks-off-2644683-2024-12-04",
      "headline": "These 5 banks revise FD rates ahead of RBI's rate decisionSeveral banks, including Karnataka Bank, Canara Bank, and YES Bank, have revised their FD rates ahead of the Reserve Bank of India's rate decision on December 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-higher-as-banking-stocks-rally-on-rbi-mpc-rate-cut-hopes-2644795-2024-12-04",
      "headline": "Sensex, Nifty end higher as banking stocks rally on RBI rate cut hopesThe S&P BSE Sensex gained 110.58 points to close at 80,956.33, while the NSE Nifty50 added 10.30 points to end at 24,467.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bharti-airtel-signs-mega-4g-5g-equipment-deal-with-ericsson-2644746-2024-12-04",
      "headline": "Bharti Airtel signs 'multi-billion' dollar 4G, 5G equipment deal with EricssonDemand from India's 5G market started to skyrocket in 2023, as Bharti Airtel and Jio, the telecom unit of Reliance Industries, started to scale up 5G services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meet-governor-shaktikanta-das-december-2024-gdp-growth-needs-boost-inflation-hold-back-rate-cut-2644732-2024-12-04",
      "headline": "RBI MPC meet: Growth needs a boost, but will inflation hold back rate cut?RBI MPC: The repo rate, which determines borrowing costs across the economy, has been held steady at 6.5% for nine consecutive meetings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/heg-share-price-six-year-high-30-percent-jump-in-2-sessions-stock-rally-explained-2644710-2024-12-04",
      "headline": "Explained: Why HEG share price surged 30% in 2 sessions to hit 6-year highAt 1:16 pm, shares of HEG were trading 13.04% higher at Rs 563.90. The stock's peer, Graphite India, also advanced, gaining another 6% in Wednesday's trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-declining-against-dollar-usd-impact-on-economy-stock-markets-consumers-2644694-2024-12-04",
      "headline": "Rupee's slide: What it means for economy, markets, and youAlthough the rupee has recovered slightly today due to gains in the Chinese yuan, the recent drop reflects a confluence of global and domestic factors, creating ripple effects that extend beyond currency markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-gradually-increase-delivery-charge-instamart-orders-q2-results-analyst-call-2644641-2024-12-04",
      "headline": "Swiggy likely to increase delivery charge on Instamart orders: ReportCurrently, Swiggy subsidises delivery fees through its loyalty program, Swiggy One, and discounts for new users. While delivery is free for Swiggy One members, other customers pay a dynamic fee. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-share-price-jumps-after-q2-results-brokerage-views-what-should-investors-do-2644629-2024-12-04",
      "headline": "Swiggy share price jumps 7% after Q2 results. Should you buy or avoid?Swiggy Share Price: The new-listed company reported a revenue increase of 11.77% quarter-on-quarter (QoQ) to Rs 3,601.45 crore and a year-on-year (YoY) growth of 30.33%. However, the company posted a consolidated net loss of Rs 625.53 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-power-share-price-upper-circuit-today-withdrawal-of-seci-debarment-notice-2644623-2024-12-04",
      "headline": "Explained: Why Reliance Power share price hit upper circuit todayReliance Power share price has gained nearly 72% year-to-date, outperforming the Nifty 50's 13% rise, although it faced declines of over 12% in October and 9% in November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-stock-climb-44-percent-post-listing-reason-rally-2644601-2024-12-04",
      "headline": "NTPC Green Energy shares climb 44% post-listing. What's driving the rally?NTPC Green Energy share price: The company launched a Rs 10,000 crore IPO last month, which was open for subscription between November 19 and November 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-higher-driven-by-it-stocks-wipro-gains-nearly-2-percent-2644578-2024-12-04",
      "headline": "Sensex, Nifty open higher driven by IT stocks; Wipro gains nearly 2%The S&P BSE Sensex was up 289.13 points to 81,134.88, while the NSE Nifty50 gained 81 points to 24,538.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-deadlines-december-2024-your-essential-guide-for-itr-compliance-2644319-2024-12-04",
      "headline": "December tax deadlines: Your essential guide for ITR complianceDecember 2024 holds critical tax deadlines for advance payments, returns, and deductions. Stay on track with key dates to avoid penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-governor-shaktikanta-das-rate-cut-expert-view-inflation-gdp-nirmala-sitharaman-2644571-2024-12-04",
      "headline": "RBI MPC to start today: Will there be a rate cut? 3 things to know RBI MPC meeting: In the RBI MPC meet in October, the repo rate was unchanged at 6.5%, shifting the stance to 'neutral,' and holding other key rates steady."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suraksha-diagnostic-ipo-allotment-status-online-guide-step-by-step-latest-gmp-expected-listing-gain-2644549-2024-12-04",
      "headline": "Suraksha Diagnostic IPO allotment: Step-by-step guide to check statusSuraksha Diagnostic IPO allotment: Investors who have bid for Suraksha Diagnostic IPO can check their allotment status online. They can log in to either the BSE website or the website of Kfin Technologies Limited, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-adani-swiggy-rvnl-ola-electric-honasa-mamaearth-wipro-2644538-2024-12-04",
      "headline": "Stocks to watch today: Swiggy, RVNL, Ola Electric, Honasa, Wipro In today's trading, shares of Ola Electric, PB Fintech, Swiggy, Honasa Consumer, Reliance Power, Wipro, and others are expected to be in focus due to important news and developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/4-banks-revise-credit-card-fees-and-rewards-yes-bank-axis-bank-sbi-bank-au-small-finance-bank-2644079-2024-12-03",
      "headline": "Credit card changes in December: 4 banks revise fees and rewardsBanks like SBI, Axis, Yes Bank, and AU Small Finance Bank are updating credit card fees, rewards, and policies in December 2024, impacting transactions, redemptions, and reward categories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-explained-benefits-investments-withdrawal-rules-key-highlights-2644177-2024-12-03",
      "headline": "NPS Vatsalya: Key benefits, investments, and withdrawal rules explained NPS Vatsalya, launched in September, enables guardians to secure a child's financial future with regulated investments, early savings benefits, and partial withdrawal options until age 18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-q2-results-net-loss-narrows-to-rs-625-crore-in-1st-earnings-after-ipo-2644217-2024-12-03",
      "headline": "Swiggy Q2 results: Net loss narrows to Rs 625.5 crore in 1st earnings after IPOSwiggy's revenue from operations rose by 30% year-on-year (YoY) to Rs 3,601 crore, up from Rs 2,763 crore in Q2FY24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-higher-as-banking-stocks-rally-sbi-gains-2-percent-2644190-2024-12-03",
      "headline": "Sensex, Nifty end higher as banking stocks rally; SBI gains 2%The S&P BSE Sensex was up 597.67 points to close at 80,845.75, while the NSE Nifty50 gained 181.10 points to end at 24,457.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-salary-usd-56-billion-tesla-pay-rejected-by-us-court-delaware-again-appeal-2644165-2024-12-03",
      "headline": "Elon Musk's $56 billion Tesla pay rejected by US court againThe court upheld its earlier ruling from January, which called the compensation plan excessive and rescinded it, despite Tesla shareholders voting in June to reinstate it."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-mahayuti-maharashtra-chief-minister-oath-eknath-shinde-ajit-pawar-name-cleared-bjp-core-committee-meeting-2644654-2024-12-04",
      "headline": "Mahayuti government tomorrow, Devendra Fadnavis urges Eknath Shinde to joinMaharashtra CM Devendra Fadnavis: The BJP leadership finalised Devendra Fadnavis as its choice for the Maharashtra Chief Minister post at a key meeting on Wednesday, ending suspense 11 days after the Mahayuti alliance stormed to power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sukhbir-singh-badal-shiromani-akali-dal-golden-temple-amritsar-man-opens-fire-caught-people-on-spot-2644577-2024-12-04",
      "headline": "Sukhbir Badal escapes assassination bid at Golden Temple, Pak angle being probedSukhbir Badal attacked: The incident happened when Sukhbir Badal was serving as a guard at the Golden Temple entrance as part of a religious punishment. The shooter has been identified as Narain Chaura, a former Babbar Khalsa International (BKI) terrorist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-beef-ban-restaurants-hotels-public-places-himanta-biswa-sarma-bjp-2644984-2024-12-04",
      "headline": "Assam imposes complete ban on beef consumption in hotels, public placesAssam Chief Minister Himanta Biswa Sarma has announced a ban on serving and consuming beef in hotels, restaurants, and public places, extending restrictions under the Assam Cattle Preservation Act, 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hyderabad-mutah-marriages-sheikhs-gulf-countries-minor-girls-investigation-2644868-2024-12-04",
      "headline": "Hyderabad's dark underbelly: Shady 'Sheikh marriages'A shadowy business where young girls, under the guise of marriage, are sold to wealthy sheikhs from Gulf countries is rampant in Hyderabad. The practice, which originated centuries ago in Arab nations, has evolved into an organised trade in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-sobhita-dhulipala-are-married-2645047-2024-12-04",
      "headline": "Naga Chaitanya, Sobhita Dhulipala are married, first pics outActors Naga Chaitanya and Sobhita Dhulipala are married. First photos of the couple from their wedding ceremony is out on the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-pauses-termination-of-women-judges-in-madhya-pradesh-wish-men-menstruate-2644939-2024-12-04",
      "headline": "'Wish men menstruate': Supreme Court questions criteria for woman judge's sackingThe termination order against judge Aditi Kumar Sharma was passed in June 2023. However, the Supreme Court said that the judge's assessment ignored the mental and physical trauma endured by her due to the miscarriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/eknath-shinde-ribs-ajit-pawar-oath-taking-maharashtra-mahayuti-government-2644865-2024-12-04",
      "headline": "Eknath Shinde ribs Ajit Pawar: Dada experienced in both morning, evening oathA press conference by Mahayuti leaders featured a light-hearted moment when Ajit Pawar's banter about oath-taking prompted a witty retort from Eknath Shinde."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/south-india-news-telangana-mulugu-earthquake-second-largest-andhra-pradesh-tremors-rare-causes-2644844-2024-12-04",
      "headline": "Telangana hit with second-biggest earthquake in 55 years: Why tremors are rare hereA magnitude 5.3 earthquake struck Mulugu, Telangana, today, marking the region's second-largest quake in 55 years. Here's an explanation of why earthquakes are so uncommon in the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/others-cater-to-taxis-hondas-veiled-dig-at-maruti-suzuki-dzire-at-amaze-launch-2644954-2024-12-04",
      "headline": "Others cater to taxis: Honda's veiled dig at Maruti Dzire at Amaze launchPriced between Rs 8 lakh and Rs 10.90 lakh (ex-showroom, introductory), the new Honda Amaze is the most affordable car in India to offer ADAS."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-leader-in-global-business-education-2643394-2024-12-02",
      "headline": "University of Bath School of Management: A Leader in Global Business EducationCombining top-ranked MSc programmes with practical knowledge for future corporate leaders.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-man-returns-home-morning-walk-parents-wedding-anniversary-sister-dead-stab-wounds-2644645-2024-12-04",
      "headline": "Delhi man goes for morning walk, returns to find parents, sister dead at homeThe couple's son, who had wished them on their wedding anniversary before going for a morning walk, returned to find his parents and sister dead with stab wounds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/hockey-india-league-up-rudras-full-squad-tanguy-cosyns-exclusive-2644851-2024-12-04",
      "headline": "Hockey India League helps improve the attractiveness of our sport: Tanguy CosynsIn an exclusive with Indiatoday.in, UP Rudras forward Tanguy Cosyns feels that the Hockey India League will help enhance the attractiveness of the sport. After a 7-year hiatus, Hockey India League will be making a return in December 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-student-leaders-on-two-india-propose-cell-counter-propaganda-world-media-nahid-islam-2644784-2024-12-04",
      "headline": "Bangladesh leaders speak of two Indias, plan cell to counter global mediaStudent leaders of the anti-quota agitation and part of the caretaker government met Chief Advisor Muhammad Yunus and proposed a dedicated cell to counter global media's \"anti-Bangladesh narrative\". One of the student advisers referred to two Indias, one which backed their stir and the other that was attacking them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/sati-practice-rise-spread-abolition-india-2644905-2024-12-04",
      "headline": "From royal rituals to grim reality: The rise of Sati practice in IndiaSati was one of the most horrifying practices in India's history. Here is a brief look at the early signs of the Sati practice and the spread of this ritual, which drew links from the 'jauhar' practice in Rajasthan, and how the British adopted laws for its abolition.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-d-gukesh-vs-ding-liren-game-8-draw-singapore-2644960-2024-12-04",
      "headline": "World Chess Championship, Game 8: Gukesh, Liren play out 5th consecutive drawGame 8 of the World Chess Championship between D Gukesh and Ding Liren has ended in a draw on Wednesday, December 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sambhal-rahul-gandhi-priyanka-gandhi-visit-congress-mosque-survey-violence-uttar-pradesh-2644573-2024-12-04",
      "headline": "'Leader of Opposition's rights denied': Rahul Gandhi stopped on way to SambhalRahul and Priyanka Gandhi's convoy left for Sambhal at around 10.15 am and reached the Delhi-UP border by 11.00 am. They were stopped by the police, leading to hours of chaos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-ai-is-upping-the-game-in-wedding-photography-2644842-2024-12-04",
      "headline": "How AI is upping the game in wedding photographyFrom picture-perfect images to ease in photo and video editing, artificial intelligence is increasingly being used to capture the moments in their truest form\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/eknath-shinde-devendra-fadnavis-maharashtra-chief-minister-government-mahayuti-ajit-pawar-2644807-2024-12-04",
      "headline": "Among us, no one is big or small: Eknath Shinde on Devendra Fadnavis-led MahayutiEknath Shinde on Wednesday emphasised that no one is big or small in the Mahayuti alliance led by him, Devendra Fadnavis, and Ajit Pawar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/internet-celebrates-notre-dame-rebirth-ahead-of-grand-reopening-2644786-2024-12-04",
      "headline": "Internet celebrates Notre Dame's 'rebirth' ahead of grand reopeningSocial media is flooded with awe as users shared photos and reflections on the stunning restoration of Notre Dame Cathedral, just days before its grand reopening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-mamata-is-reminding-trinamool-whos-the-boss-2644778-2024-12-04",
      "headline": "How Mamata is reminding Trinamool who's the bossNephew Abhishek Banerjee's move to rejig the party and the Bengal administration apparently prompted Didi to reassert her authority\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/bbc-100-most-inspiring-2024-three-indian-women-pooja-sharma-vinesh-phogat-aruna-roy-sunita-williams-2644754-2024-12-04",
      "headline": "Three Indians on BBC's 100 most inspiring women list: All about themVinesh Phogat, Pooja Sharma and Aruna Roy have been named in BBC's 100 most inspiring women globally for 2024. Read on to know more about them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-postpones-pslv-xl-launch-to-thursday-due-to-anomaly-with-proba-3-2644787-2024-12-04",
      "headline": "Why did Isro postpone the PSLV-XL Proba-3 launch?The Indian space agency did not clarify the anomaly that was detected with proba-3 as they prepared to launch the spacecraft. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-man-drives-with-dogs-on-car-roof-video-goes-viral-2644956-2024-12-04",
      "headline": "Bengaluru man drives with dogs on car roof. Video goes viralA video of a man driving with several dogs placed on top of a moving car on a highway in Bengaluru has gone viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/explained-the-ending-of-allu-arjuns-pushpa-1-and-what-to-expect-from-pushpa-2-2644713-2024-12-04",
      "headline": "Explained: The ending of Allu Arjun's Pushpa 1 and what to expect from Pushpa 2With Pushpa Raj all set to grace the screens once more, let's decode the ending of Allu Arjun's Pushpa: The Rise and explore what the audience can expect from Pushpa 2: The Rule. Let us delve deep into the potential angles that could be explored in the highly anticipated sequel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-sobhita-dhulipala-are-married-2645047-2024-12-04",
      "headline": "Naga Chaitanya, Sobhita Dhulipala are married, first pics outActors Naga Chaitanya and Sobhita Dhulipala are married. First photos of the couple from their wedding ceremony is out on the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/spotify-wrapped-2024-taylor-swift-most-streamed-artist-again-2645020-2024-12-04",
      "headline": "Spotify Wrapped 2024: Taylor Swift is platform's most-streamed artist again!Spotify Wrapped 2024 reveals Taylor Swift as the most-streamed artist globally for the second consecutive year. The platform's annual report highlights the top artists, songs, and albums, with Swift leading both global and US charts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/identity-teaser-trisha-krishnan-tovino-thomas-in-search-for-pentagon-faced-mystery-man-2645018-2024-12-04",
      "headline": "Identity teaser: Trisha, Tovino Thomas in search for 'pentagon-faced' mystery manTrisha Krishnan and Tovino Thomas's Identity will release in January. Ahead of that, on Wednesday, the makers released the teaser of the crime thriller. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-rashmika-mandanna-fahadh-faasil-werent-sukumars-first-choices-for-pushpa-report-2644955-2024-12-04",
      "headline": "Allu Arjun, Rashmika, Fahadh weren't Sukumar's first choices for Pushpa: Report Allu Arjun, Rashmika Mandanna, and Fahadh Faasil were reportedly not the original choices for their roles in Pushpa. Director Sukumar had other actors in mind before the current cast was finalised."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-ben-stokes-over-rate-circulations-icc-2645048-2024-12-04",
      "headline": "Ben Stokes waiting for conversations with ICC about over-rate circulationsEngland captain Ben Stokes has said that he wants to have conversations with the ICC about the over-rate circulations after they and England were docked World Test Championship points after the first Test. Both teams had 3 WTC points cut for maintaining a slow over-rate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rashid-khan-concerned-with-medical-education-ban-for-girls-in-afghanistan-2645046-2024-12-04",
      "headline": "Rashid Khan expresses concern on medical education ban for girls in AfghanistanStar Afghanistan all rounder Rashid Khan has expressed his concern over the ban on medical education for girls in Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jayden-seales-kevin-sinclair-fined-icc-code-of-conduct-west-indies-vs-bangladesh-wi-vs-ban-2645007-2024-12-04",
      "headline": "Jayden Seales, Kevin Sinclair face heavy fines for breaching ICC Code of Conduct West Indies players Jayden Seales and Kevin Sinclair were fined by the ICC (International Cricket Council) after being guilty of breaching the code of conduct for players in the second Test vs Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-reacts-jose-mourinho-comparisons-anfield-gestures-six-gingers-premier-league-2644990-2024-12-04",
      "headline": "Guardiola reacts to Mourinho links after Anfield gesture: He won 3 titlesPep Guardiola subtly responded to Jose Mourinho comparisons after Manchester City's 2-0 loss to Liverpool, defending his legacy amidst mounting pressure following City's struggles, with fans questioning whether his gesture at Anfield mirrored Mourinho's infamous three-finger salute in 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-would-be-dying-to-play-in-pakistan-shoaib-akhtar-champions-trophy-2025-ind-vs-pak-2644959-2024-12-04",
      "headline": "Virat Kohli would be dying to play in Pakistan: Shoaib AkhtarFormer Pakistan fast bowler Shoaib Akhtar has made a bizarre claim that star India batter Virat Kohli would be dying to play in Pakistan amid the ongoing Champions Trophy hosting controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-d-gukesh-vs-ding-liren-game-8-draw-singapore-2644960-2024-12-04",
      "headline": "World Chess Championship, Game 8: Gukesh, Liren play out 5th consecutive drawGame 8 of the World Chess Championship between D Gukesh and Ding Liren has ended in a draw on Wednesday, December 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ban-w-vs-ire-w-captains-unveil-trophy-in-historic-garden-with-a-unique-touch-2644946-2024-12-04",
      "headline": "Captains unveil trophy in historic tea garden with a unique touchThe Bangladesh vs Ireland women's T20I series started with a special ceremony at the Malnichhara Tea Estate, Sylhet. Captains Nigar Sultana Joty and Gaby Lewis wore traditional tea worker outfits during the trophy unveiling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/hockey-india-league-up-rudras-full-squad-tanguy-cosyns-exclusive-2644851-2024-12-04",
      "headline": "Hockey India League helps improve the attractiveness of our sport: Tanguy CosynsIn an exclusive with Indiatoday.in, UP Rudras forward Tanguy Cosyns feels that the Hockey India League will help enhance the attractiveness of the sport. After a 7-year hiatus, Hockey India League will be making a return in December 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-women-vs-india-women-odi-series-where-to-watch-live-streaming-details-2644920-2024-12-04",
      "headline": "Australia women vs India women ODI series: When and where to watch?Australia women and India women are all set to lock horns in a three-match ODI series beginning from December 5 in Brisbane. Here are the live broadcast and the streaming details for the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-mitchell-marsh-bowling-nathan-lyon-adelaide-test-2644892-2024-12-04",
      "headline": "AUS vs IND: Will Mitchell Marsh bowl in pink-ball Test? Nathan Lyon reactsNathan Lyon feels confident about Mitchell Marsh's fitness and claimed that the all-rounder could bowl during the pink-ball Test in Adelaide, starting from December 6. Marsh's fitness has been a concern heading into the match, "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/heinrich-klaasen-to-captain-south-africa-for-t20i-series-vs-pakistan-2644888-2024-12-04",
      "headline": "Heinrich Klaasen to captain South Africa for T20I series vs PakistanHeinrich Klaasen is all set to lead South Africa for the 3-match T20I series vs Pakistan. Aiden Markram was not available for T20I series due to ongoing Test series vs Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ban-w-vs-ire-w-captains-unveil-trophy-in-historic-garden-with-a-unique-touch-2644946-2024-12-04",
      "headline": "Captains unveil trophy in historic tea garden with a unique touchThe Bangladesh vs Ireland women's T20I series started with a special ceremony at the Malnichhara Tea Estate, Sylhet. Captains Nigar Sultana Joty and Gaby Lewis wore traditional tea worker outfits during the trophy unveiling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/hockey-india-league-up-rudras-full-squad-tanguy-cosyns-exclusive-2644851-2024-12-04",
      "headline": "Hockey India League helps improve the attractiveness of our sport: Tanguy CosynsIn an exclusive with Indiatoday.in, UP Rudras forward Tanguy Cosyns feels that the Hockey India League will help enhance the attractiveness of the sport. After a 7-year hiatus, Hockey India League will be making a return in December 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-women-vs-india-women-odi-series-where-to-watch-live-streaming-details-2644920-2024-12-04",
      "headline": "Australia women vs India women ODI series: When and where to watch?Australia women and India women are all set to lock horns in a three-match ODI series beginning from December 5 in Brisbane. Here are the live broadcast and the streaming details for the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-mitchell-marsh-bowling-nathan-lyon-adelaide-test-2644892-2024-12-04",
      "headline": "AUS vs IND: Will Mitchell Marsh bowl in pink-ball Test? Nathan Lyon reactsNathan Lyon feels confident about Mitchell Marsh's fitness and claimed that the all-rounder could bowl during the pink-ball Test in Adelaide, starting from December 6. Marsh's fitness has been a concern heading into the match, "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/heinrich-klaasen-to-captain-south-africa-for-t20i-series-vs-pakistan-2644888-2024-12-04",
      "headline": "Heinrich Klaasen to captain South Africa for T20I series vs PakistanHeinrich Klaasen is all set to lead South Africa for the 3-match T20I series vs Pakistan. Aiden Markram was not available for T20I series due to ongoing Test series vs Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-scott-boland-australia-vs-india-border-gavaskar-trophy-2024-25-pink-ball-test-adelaide-2644874-2024-12-04",
      "headline": "Scott Boland recalls his best performance against India ahead of pink ball TestAustralian seamer Scott Boland recalled his best performance against India ahead of the pink ball Test in Adelaide. Boland is likely to replace Josh Hazlewood for the second Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lamine-yamal-inspired-fc-barcelona-vs-mallorca-comeback-laliga-hansi-flick-2644872-2024-12-04",
      "headline": "Lamine Yamal inspired FC Barcelona's LaLiga comeback vs Mallorca: FlickFC Barcelona youngster Lamine Yamal helped his team turn around their form in the LaLiga. Barcelona broke their 3-match winless run and slammed 5 goals against Mallorca."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-vs-manchester-united-ruben-amorim-test-mikel-arteta-tv-channel-livestreaming-2644855-2024-12-04",
      "headline": "Amorim at test as Manchester United take on Arsenal: All you need to knowRuben Amorim is set for his first major test as Manchester United manager against Arsenal, a match that will mark the Portuguese tactician's early efforts to revitalise United and bridge the gap between them and the top 6 spot in the Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mustafizur-rahman-blessed-with-baby-boy-after-bangladeshs-glory-day-vs-wi-2644853-2024-12-04",
      "headline": "Mustafizur Rahman blessed with baby boy after Bangladesh's glory day vs WIMustafizur Rahman and his wife were blessed with a baby boy. The Bangladesh speedster will miss the ODI series vs West Indies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rahul-dravid-rishabh-pant-border-gavaskar-trophy-2024-25-australia-vs-india-2644849-2024-12-04",
      "headline": "Rishabh Pant has taken to Test cricket like a duck to water: Rahul DravidFormer India cricketer and head coach Rahul Dravid praised wicketkeeper batter Rishabh Pant's adaptability to Test cricket. Pant recently made a remarkable comeback to Test cricket after a long hiatus due to his accident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-jasprit-bumrah-australia-vs-india-border-gavaskar-trophy-2024-25-2644816-2024-12-04",
      "headline": "Watch: Rohit Sharma faces fiery Jasprit Bumrah in Adelaide practice sessionIndia captain Rohit Sharma was seen facing a fiery spell from fast bowler Jasprit Bumrah during India's practice session in Adelaide ahead of the second Test vs Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/watch-indias-harvansh-singh-replicates-ms-dhoni-style-run-out-in-u19-asia-cup-2644803-2024-12-04",
      "headline": "Watch: India's Harvansh Singh replicates MS Dhoni-style run-out in U19 Asia CupHarvansh Singh sent the fans into nostalgia with an MS Dhoni-style run-out attempt. India U19 beat UAE U19 by 10 wickets in Asia Cup match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-w-vs-india-w-shafali-verma-return-harmanpreet-kaur-press-conference-2644802-2024-12-04",
      "headline": "Harmanpreet Kaur wants to see Shafali Verma back 'in zone' before World CupIndia captain Harmanpreet Kaur expressed confidence in Shafali Verma's potential comeback. Despite recent struggles, the India captain stressed that Shafali remains a key player for the side heading into the upcoming Women's World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rahul-dravid-rishabh-pant-border-gavaskar-trophy-2024-25-australia-vs-india-2644849-2024-12-04",
      "headline": "Rishabh Pant has taken to Test cricket like a duck to water: Rahul DravidFormer India cricketer and head coach Rahul Dravid praised wicketkeeper batter Rishabh Pant's adaptability to Test cricket. Pant recently made a remarkable comeback to Test cricket after a long hiatus due to his accident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-jasprit-bumrah-australia-vs-india-border-gavaskar-trophy-2024-25-2644816-2024-12-04",
      "headline": "Watch: Rohit Sharma faces fiery Jasprit Bumrah in Adelaide practice sessionIndia captain Rohit Sharma was seen facing a fiery spell from fast bowler Jasprit Bumrah during India's practice session in Adelaide ahead of the second Test vs Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/watch-indias-harvansh-singh-replicates-ms-dhoni-style-run-out-in-u19-asia-cup-2644803-2024-12-04",
      "headline": "Watch: India's Harvansh Singh replicates MS Dhoni-style run-out in U19 Asia CupHarvansh Singh sent the fans into nostalgia with an MS Dhoni-style run-out attempt. India U19 beat UAE U19 by 10 wickets in Asia Cup match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-w-vs-india-w-shafali-verma-return-harmanpreet-kaur-press-conference-2644802-2024-12-04",
      "headline": "Harmanpreet Kaur wants to see Shafali Verma back 'in zone' before World CupIndia captain Harmanpreet Kaur expressed confidence in Shafali Verma's potential comeback. Despite recent struggles, the India captain stressed that Shafali remains a key player for the side heading into the upcoming Women's World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-comeback-shane-watson-kevin-pietersen-ipl-mega-auction-unsold-precocious-talent-2644798-2024-12-04",
      "headline": "Shane Watson wants Prithvi Shaw to make a comeback: A precocious talentShane Watson and Kevin Pietersen hailed Prithvi Shaw's comeback, praising his immense talent despite setbacks, including going unsold in IPL 2025. They urged the young batter to overcome challenges and reclaim his place in Indian cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-vaibhav-suryavanshi-india-u19-vs-uae-u19-under-19-asia-cup-2024-ipl-2025-mega-auction-rajasthan-royals-2644793-2024-12-04",
      "headline": "Vaibhav Suryavanshi's blistering 76 guides India U19 to 10-wicket win over UAEIndia's batting prodigy scored a blistering 46-ball 76 against UAE Under 19 to help his team win by ten wickets in the Under 19 Asia Cup 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bgt-ind-vs-aus-sam-konstas-austraia-squad-adelaide-test-playing-xi-2644766-2024-12-04",
      "headline": "Sam Konstas raring to play Tests for Australia: Really want a chanceCenturion from Australia's pink ball warm-up match against India - Sam Konstas - is raring to have a go in Test cricket. Konstas believes that he is ready and wants to get a chance soon.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sachin-tendulkar-recalls-achrekars-teachings-taught-us-to-value-things-2644762-2024-12-04",
      "headline": "Sachin Tendulkar recalls Achrekar's teachings: Taught us to value thingsSachin Tendulkar recalled his former coach's teachings on Tuesday, 3 December. Speaking at the unveiling of Ramakanth Achrekar's memorial, Sachin said that the latter taught him the value of things."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}