{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-stock-price-tumbles-6-today-what-triggered-the-slide-2680054-2025-02-14",
      "headline": "Explained: Why Vodafone Idea share price tumbled nearly 6%VI shares were down 5.09% to Rs 8.22 at around 3:15 pm. Earlier during the trading session, shares of the telecom operator fell as much as 6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ambanis-top-asias-rich-list-here-are-other-indians-who-made-it-mistry-birla-bajaj-hinduja-2680007-2025-02-14",
      "headline": "Ambani family richest in Asia. Check which Indian families made the top 20The Ambani family tops Bloomberg's list of Asia's 20 richest families. The family's flagship company, Reliance Industries, is presently headed by Mukesh Ambani, son of late industrialist Dhirubhai Ambani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-curbs-on-new-india-co-operative-bank-how-does-it-impact-customers-what-to-do-2680031-2025-02-14",
      "headline": "RBI curbs on New India Co-operative Bank: How does it impact customers?New India Co-operative Bank has been struggling with financial losses in recent years. According to its annual report, the bank recorded a loss of Rs 22.78 crore in the financial year ending March 2024, following a loss of Rs 30.75 crore in the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/new-india-co-operative-banks-financial-operations-halted-after-notice-from-rbi-2680025-2025-02-14",
      "headline": "New India Co-operative Bank's financial operations halted after notice from RBIThe Reserve Bank of India (RBI) has restricted Mumbai-based New India Co-operative Bank from issuing loans, accepting deposits, or permitting withdrawals for six months. The move comes amid concerns over the bank's financial health and liquidity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-trump-tariffs-but-this-is-whats-making-stock-market-investors-anxious-fii-selling-stock-market-fall-2680000-2025-02-14",
      "headline": "Not Trump's tariffs, but this is what's making stock market investors anxiousThe stock market jitters have occurred despite government measures, including tax relief and the Reserve Bank of India's (RBI) decision to reduce the repo rate by 25 basis points."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-issues-notice-to-halt-all-financial-operations-of-new-india-co-operative-bank-2679968-2025-02-14",
      "headline": "RBI issues notice to halt all financial operations of New India Co-operative BankRBI's move comes after what it called 'recent material developments' at the bank. Although the central bank did not provide specific details, it stated that these directions were issued to protect depositors' interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-all-your-questions-answered-2679917-2025-02-14",
      "headline": "New income tax bill: All you questions answeredThe new income tax bill, compared to the Income Tax Act, 1961, is nearly half the size, containing 259,676 words, 23 chapters, 536 sections, 57 tables and 46 formulae."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-500-points-nifty-falls-3-things-you-need-to-know-2679965-2025-02-14",
      "headline": "Sensex tanks over 600 points: Why is the stock market down today?The Sensex and Nifty fell sharply after rising in early trade. Here are three things you need to know about today's stock market weakness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-senco-gold-share-price-crashed-20-percent-after-q3-results-2679889-2025-02-14",
      "headline": "Explained: Why Senco Gold shares crashed 20% after Q3 results Senco Gold share price: In the third quarter, Senco Gold reported a nearly 70% drop in consolidated net profit to Rs 33 crore, compared to Rs 109 crore in the same period last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jiocinema-disney-hotstar-merge-to-launch-jiohotstar-what-it-means-for-you-subscription-plans-ott-2679869-2025-02-14",
      "headline": "JioCinema, Disney+ Hotstar merge to launch JioHotstar: What it means for youReliance Industries and Walt Disney's India business finalised their merger in November 2024, creating a joint venture with Viacom18 Media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-nifty-gain-as-us-india-trade-talks-show-positive-signs-2679851-2025-02-14",
      "headline": "Sensex, Nifty gain as US-India trade talks show positive signsThe S&P BSE Sensex was up 86.75 points to 76,225.72, while the NSE Nifty50 added 12.50 points to 23,043.90 as of 9:46 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-nasdaq-rises-1-percent-on-inflation-relief-tesla-soars-6-nvidia-up-4-2679839-2025-02-14",
      "headline": "Nasdaq rises over 1% on inflation relief; Tesla soars 6%, Nvidia up 4%The Nasdaq Composite jumped 1.5%, the S&P 500 gained 1.04%, and the Dow Jones Industrial Average rose 0.77%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-explained-tabled-parliament-what-is-changing-and-what-is-not-2679826-2025-02-14",
      "headline": "New Income Tax bill explained: What's changing and what's notNew Income Tax bill: It aims to simplify the existing Income Tax Act, 1961, by making it more structured and easier to understand. If passed, the new law will come into effect from April 1, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-likely-to-maintain-825-percent-interest-rate-on-pf-depsoits-2679563-2025-02-13",
      "headline": "EPFO likely to maintain 8.25% interest rate on PF deposits EPFO interest rate: In 2024-25, EPFO processed over 50.8 million claims worth Rs 2.05 lakh crore when compared to 44.5 million claims amounting to Rs 1.82 lakh crore settled in the previous year, as per the official data."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-energy-exits-sri-lanka-wind-power-deal-stock-down-1-percent-2679469-2025-02-13",
      "headline": "Adani Green Energy exits Sri Lanka wind power deal; stock down 1%Adani Green Energy shares: As per the agreement with Sri Lanka, Adani Green was to construct two wind power projects in Mannar town and Pooneryn village, both located in the northern province of the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-erase-gains-to-end-lower-as-it-stocks-weigh-in-adani-enterprises-down-5-percent-2679429-2025-02-13",
      "headline": "Sensex, Nifty erase gains to end lower as IT stocks weigh in on stock marketsThe S&P BSE Sensex was down by 32.11 points to close at 76,138.97, while the NSE Nifty50 lost 13.85 points to end at 23,031.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/finance-minister-nirmala-sitharaman-introduces-new-income-tax-bill-in-lok-sabha-2679394-2025-02-13",
      "headline": "Finance Minister Nirmala SItharaman introduces new Income Tax Bill in Lok SabhaFinance Minister Nirmala Sitharaman tabled the new Income Tax bill in Lok Sabha amid the huge uproar by the opposition MPs. The bill will now be referred to the Select Committee of Lok Sabha for further review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/finance-minister-nirmala-sitharaman-introduces-new-income-tax-bill-in-lok-sabha-overhaul-2679363-2025-02-13",
      "headline": "New Income Tax Bill tabled in Lok Sabha, faces select panel reviewThe government, in a bid to simplify the present Income Tax Act, 1961, has introduced a new income tax bill in Parliament today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-are-large-cap-mutual-funds-back-in-demand-stock-market-volatility-2679356-2025-02-13",
      "headline": "Explained: Why are large-cap mutual funds back in demandWith small-cap and mid-cap stocks experiencing corrections, investors are moving towards large-cap funds, which are considered safer and more stable in volatile times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quality-power-ipo-10-things-investors-must-know-before-subscribing-2679309-2025-02-13",
      "headline": "Quality Power IPO: 10 things investors must know before subscribing Quality Power Electrical Equipments Limited offers high-voltage electrical equipment and solutions for grid connectivity and energy transition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-how-will-it-make-taxpayers-lives-simpler-2679254-2025-02-13",
      "headline": "New Income Tax Bill: How will it make taxpayers' lives simpler?The new income tax bill would be almost half of the current law, as the existing Income Tax Act,1961 contained 880 pages when it came into existence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-450-points-3-reasons-why-stock-market-is-rising-today-inflation-data-pm-modi-us-visit-2679218-2025-02-13",
      "headline": "Sensex gains 500 points: 3 reasons why stock market is rising todayAs of 10:48 AM, the S&P BSE Sensex was up 47.85 points at 76,644.93, while the NSE Nifty50 gained 137.75 points to 23,183.00."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opening-bell-sensex-nifty-up-as-cooling-inflation-boosts-market-sentiment-share-market-today-2679189-2025-02-13",
      "headline": "Sensex, Nifty open higher as cooling inflation boosts market sentimentShare Market Today: The S&P BSE Sensex was up 163.21 points to 76,334.39, while the NSE Nifty50 gained 46.25 points to 23,091.50 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ajax-engineering-ipo-check-allotment-status-online-guide-listing-date-latest-gmp-2679171-2025-02-13",
      "headline": "Ajax Engineering IPO: Check allotment status, listing date and latest GMPAjax Engineering IPO allotment status: The IPO price band was set at Rs 599 to Rs 629 per share. The minimum lot size for the application was 23 shares. For retail investors, the minimum investment required was Rs 13,777."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-2025-to-be-tabled-today-parliament-heres-what-you-can-expect-2679153-2025-02-13",
      "headline": "New Income Tax Bill to be tabled today: Here's what you can expectNew Income Tax Bill is expected to come into effect on April 1, 2026. The bill aims to simplify tax laws, remove outdated provisions, and make compliance easier for taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-a-married-couple-save-more-taxes-using-both-old-and-new-tax-regime-2678890-2025-02-13",
      "headline": "Can a married couple save more taxes using both old and new tax regime?Married couples need to determine which tax regime offers lower tax liability for each spouse considering their income structure and deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-retail-inflation-dips-to-431-percent-in-january-2678907-2025-02-12",
      "headline": "India's retail inflation dips to 4.31% in January, hits a five-month lowThe country's retail inflation witnessed a drop in January majorly due to declining food prices, according to data released by the National Statistics Office on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-dalal-street-2678823-2025-02-12",
      "headline": "Sensex, Nifty recover sharply but end in red; M&M falls 3%The S&P BSE Sensex settled 122.52 points lower at 76,171.08. Earlier in the day, the 30-share index had plunged 850 points. Nifty, too, recovered strongly to end 26.55 points lower at 23,045.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-inflows-see-slight-dip-in-january-heres-why-2678801-2025-02-12",
      "headline": "Mutual fund inflows see slight dip in January. Here's whyThe flows declined 3.6% month-on-month to 396.88 billion rupees ($4.57 billion) from 411.56 billion rupees in December 2024, according to data by the Association of Mutual Funds in India (AMFI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-to-be-simpler-and-clearer-likely-to-be-presented-tomorrow-2678762-2025-02-12",
      "headline": "New Income Tax Bill to introduce simpler 'tax year' concept: All you need to knowWhen the Income Tax Act of 1961 came into being it had 880 pages. Over the years, the act contained several amendments introduced in the various budgets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-trading-strategy-what-should-investors-do-key-things-to-know-2678731-2025-02-12",
      "headline": "Stock market bloodbath: Should buy the dip, exit or stay invested? The stock market correction has particularly hit retail investors, many of whom are contemplating selling their holdings at a loss. But is that the right move? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/after-90-hour-workweek-remark-l-and-t-chief-stirs-wfh-debate-2678704-2025-02-12",
      "headline": "After 90-hour workweek remark, L&T chief stirs work-from-home debateThis is not the first time that the L&T Chairman's remarks have sparked a debate.  Earlier, he advocated a 90-hour workweek, which drew huge criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-retail-inflation-cool-down-further-in-january-here-is-all-you-need-to-know-2678656-2025-02-12",
      "headline": "Will retail inflation cool down further in January? Here's all you need to know The RBI mentioned continued reduction in rice prices and sharp corrections in the prices of vegetables, especially in the prices of onions, potatoes and tomatoes, in its January 2025 Bulletin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/larsen-and-toubro-cmd-sn-subrahmanyan-raises-alarm-over-labour-shortage-blames-welfare-schemes-2678648-2025-02-12",
      "headline": "L&T chief stirs fresh row with remark on labour crisis: Workers unwilling to moveSpeaking at CII's Mystic South Global Linkages Summit 2025 in Chennai, Subrahmanyan spoke about the difficulties faced by the construction industry in hiring and mobilising workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-down-over-700-points-nifty-falls-4-factors-behind-stock-market-crash-2678623-2025-02-12",
      "headline": "Sensex falls 700 points: 4 reasons why stock market is falling todayStock market crash: The S&P BSE Sensex plunged over 850 points before trimming some losses, trading 748.13 points lower at 75,545.47 by 10:23 am. The NSE Nifty50 also slipped nearly 1%, reflecting weakness across broader markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-bloodbath-on-dalal-street-us-trade-tariffs-weak-q3-earnings-2678603-2025-02-12",
      "headline": "Sensex tumbles over 850 points as US tariff fears spook Dalal StreetThe S&P BSE Sensex nosedived 834.39 points to 75,459.21 at 10 am, while the NSE Nifty50 fell 251.95  points to trade at 22,819.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/madhya-pradesh-chief-minister-mohan-yadav-rs-1553-crore-for-ladli-behna-yojana-released-check-eligibility-2678366-2025-02-11",
      "headline": "Madhya Pradesh: Rs 1,553 crore for Ladli Behna Yojana released. Check eligibilityLadli Behna Yojana aims to improve women's well-being, health, nutrition and economic independence. Presently, Rs 1,250 per month is given to all the eligible women under this scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-will-its-implementation-face-delays-time-salary-hike-for-central-government-employee-2678368-2025-02-11",
      "headline": "8th Pay Commission: Will its implementation face delays?Despite several measures announced for taxpayers in the Union Budget 2025, there was no mention of the financial impact of implementing the 8th Pay Commission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/are-you-eligible-for-fixed-medical-allowance-under-nps-check-details-2678298-2025-02-11",
      "headline": "Are you eligible for fixed medical allowance under NPS? Check details Retired central government civilian employees who are covered under the National Pension System will now be eligible for fixed medical allowance, announced the Department of Pension & Pensioners' Welfare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reason-behind-stock-market-crash-sensex-ends-1000-points-lower-tariff-threat-weak-rupee-fii-selling-2678293-2025-02-11",
      "headline": "Sensex ends 1,000 points lower: 5 factors behind today's stock market crashInvestors lost nearly Rs 10 lakh crore as selling pressure intensified across sectors due to various factors that dampened investor sentiment. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhoom-dhaam-review-yami-gautam-pratik-gandhi-2679912-2025-02-14",
      "headline": "Dhoom Dhaam review: Romance meets thrill in this Yami Gautam-Pratik Gandhi filmReleased-Fri Feb 14, 2025Dhoom Dhaam movie review: Dhoom Dhaam blends romance with action and comedy, offering a refreshing alternative to traditional Valentine's Day films. Starring Yami Gautam and Pratik Gandhi, the movie delivers a thrilling and entertaining experience perfect for a cosy night in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-benny-blanco-song-scared-of-loving-you-released-new-album-i-said-i-love-you-first-2679975-2025-02-14",
      "headline": "Scared of Loving You: Selena Gomez's new song for her Valentine Benny Blanco out Lovebirds Selena Gomez and Benny Blanco have now collaborated for a new album titled I Said I Love You First. On the occasion of Valentine's Day 2025, Selena released the first single from the album, Scared of Loving You.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/music-composer-ilayaraja-madras-high-court-dispute-with-music-master-over-his-compositions-2679766-2025-02-14",
      "headline": "Ilaiyaraaja appears in Court in dispute with music company over his compositionsIn 2010, Music Master filed a lawsuit seeking a ban on the use of these songs on YouTube and social media platforms, calling it \"unauthorised\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/are-k-drama-men-written-by-women-too-good-to-be-true-valentine-day-special-2679923-2025-02-14",
      "headline": "Are K-Drama men written by women too good to be true? | Valentine Special K-drama male leads have captivated audiences with their idealised traits, offering a romantic fantasy of the perfect partner. These characters, crafted by female screenwriters, challenge traditional portrayals. This Valentine's Day we analyse if they are too good to be true. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-videos-rings-of-power-renewed-for-third-season-2679924-2025-02-14",
      "headline": "Prime Video's Rings of Power renewed for third seasonPrime Video's Rings of Power has been renewed for the third installment, the makers announced recently. Its second season was released last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-director-arati-kadav-on-backlash-over-missing-credits-great-indian-kitchen-2679432-2025-02-14",
      "headline": "Mrs director Arati Kadav on backlash over missing credits: Glad it was called outDirector Arati Kadav addresses the backlash over Mrs not crediting The Great Indian Kitchen in the trailer, stressing the need for proper recognition. Mrs, starring Sanya Malhotra, is streaming on Zee5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kanan-gill-asking-same-question-as-ranveer-allahbadia-video-2679865-2025-02-14",
      "headline": "Viral video: Kanan Gill made same remark as Ranveer Allahbadia years agoAs Ranveer Allahbadia faces backlash for his India's Got Latent remark, an old video of Kanan Gill asking the same question resurfaces on the internet. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-bianca-censori-heading-for-divorce-team-clarifies-2679842-2025-02-14",
      "headline": "Kanye West, Bianca Censori heading for divorce? Team clarifiesIt was previously reported that singer-rapper Kanye West and his wife, Bianca Censori, had split and were headed for divorce. However, a recent development has refuted these claims, labelling them as \"tabloid rumours.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sanya-malhotras-mrs-makes-questions-on-marital-rape-mechanical-sex-personal-2679613-2025-02-14",
      "headline": "Sanya Malhotra's Mrs. makes questions on marital rape, mechanical sex personalImagine a woman bleeding for five days in a month, and those five days being the most peaceful in her life because she can finally refuse sex to her husband. He can't assert his power over her. That's how Sanya Malhotra's 'Mrs.' unsettles you and makes you think. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/vishal-dadlani-meets-with-accident-undergoing-treatment-2679715-2025-02-13",
      "headline": "Singer-composer Vishal Dadlani meets with an accident, undergoes treatmentVishal Dadlani of the Vishal-Sheykhar duo is undergoing treatment after an accident, leading to the postponement of their upcoming concert scheduled for March 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-unfiltered-india-tour-shows-across-nation-cancelled-indias-got-latent-controversy-2679669-2025-02-13",
      "headline": "Not just Gujarat, all Samay Raina shows cancelled amid India's Got Latent rowSamay Raina's shows in India have been cancelled following controversy around India's Got Latent, with Gujarat shows being the first to be affected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-jonita-gandhi-to-perform-at-lollapalooza-india-will-open-for-shawn-mendes-2679497-2025-02-13",
      "headline": "Singer Jonita Gandhi to perform at Lollapalooza India, will open for Shawn MendesJonita Gandhi will perform at Lollapalooza India on March 8, opening for Shawn Mendes. Her latest single Channa has also been nominated for a Juno Award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/twilight-star-taylor-lautner-to-return-as-werewolf-in-self-aware-werewolf-series-2679572-2025-02-13",
      "headline": "Twilight star Taylor Lautner to return as werewolf in self-aware werewolf seriesTwilight star Taylor Lautner is returning to portray a werewolf in the self-aware Amazon series. Details of the show are yet to be revealed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/anupamaa-actor-rupali-ganguly-seeks-blessings-at-maha-kumbh-2679484-2025-02-13",
      "headline": "Anupamaa actor Rupali Ganguly seeks blessings at Maha KumbhActor Rupali Ganguly visited Maha Kumbh in Prayagraj with her family. She shared moments from her spiritual visit, including performing aarti, attending a hawan, and meeting a saint. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nawazuddin-siddiqui-begins-raat-akeli-hai-2-shooting-in-lucknow-2679426-2025-02-13",
      "headline": "Nawazuddin Siddiqui begins Raat Akeli Hai 2 shooting in LucknowActor Nawazuddin Siddiqui has begun Raat Akeli Hai 2 shooting in Lucknow. The actor will be seen sharing screen space with Chitragandha Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/olivia-swann-on-ncis-sydney-her-characters-growth-challenges-2679301-2025-02-13",
      "headline": "Olivia Swann on NCIS: Sydney, her character's growth & challenges In this exclusive interview with India Today's Bhavna Agarwal, Olivia Swann dives deep into her role in NCIS: Sydney, sharing insights into her character's journey, development, and challenges throughout the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rozlyn-khan-sues-ankita-lokhande-for-defamation-over-cheap-remark-2679295-2025-02-13",
      "headline": "Rozlyn Khan sues Ankita Lokhande for defamation over 'cheap' remark TV actor Rozlyn Khan took legal action against Ankita Lokhande's recent comments. Ankita had called her 'cheap', for her claims about Hina Khan's cancer battle. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/jackson-wang-makes-a-powerful-comeback-with-high-alone-from-magic-man-2-2679273-2025-02-13",
      "headline": "Jackson Wang makes a powerful comeback with High Alone from Magic Man 2Jackson Wang drops a new single, High Alone, that marks the beginning of his new album, MAGIC MAN 2. The album promises a deep dive into themes of identity and personal transformation, set against a backdrop of atmospheric production and introspective lyrics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/john-lithgow-approached-to-play-albus-dumbledore-in-harry-potter-series-2679264-2025-02-13",
      "headline": "Actor John Lithgow approached to play Albus Dumbledore in Harry Potter seriesAward-winning American actor John Lithgow has reportedly been approached to play the iconic character of Hogwarts principal Albus Dumbledore in HBO's Harry Potter series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-stepdaughter-esha-verma-calls-her-evil-step-lady-issues-clarification-2679232-2025-02-13",
      "headline": "Rupali Ganguly's stepdaughter calls her 'evil step lady', issues clarificationRupali Ganguly's stepdaughter, Esha Verma, clarified her viral social media post against the actor. Esha requested privacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ranveer-allahbadia-cries-loss-of-work-indias-got-latent-controversy-viral-video-truth-2679217-2025-02-13",
      "headline": "Truth behind viral video of Ranveer Allahbadia crying over 'loss of work'Amid backlash over India's Got Latent, an old video of Ranveer Allahbadia crying resurfaces. In the video, the podcaster is seen breaking down over 'loss of work'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jonas-brother-hint-at-big-change-for-2025-shocked-fans-ask-another-breakup-2679190-2025-02-13",
      "headline": "Jonas Brothers hint at big change for 2025, shocked fans ask, 'another breakup?'The Jonas Brothers shared a letter on social media that briefly sent fans into a panic. In it, they hinted at their 2025 lineup and expressed gratitude to their fans for supporting them throughout their musical journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kapil-sharma-ma-baap-ki-kabaddi-joke-viral-ranveer-allahbadia-remark-2679097-2025-02-12",
      "headline": "Kapil Sharma's 'Maa Baap ki Kabaddi' joke goes viral amid Ranveer Allahbadia rowAmid the controversy over Ranveer Allahbadia's comment on Samay Raina's show India's Got Latent, an old clip of Kapil Sharma joking about kids watching \"maa baap ki kabaddi\" is going viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/did-ar-rahman-refer-to-ranveer-allahbadia-row-at-chhaava-music-launch-vicky-kaushal-2679084-2025-02-12",
      "headline": "Watch: Did AR Rahman refer to Ranveer Allahbadia row at Chhaava music launch?AR Rahman made a humorous remark at the Chhaava music launch that has led to speculation about its connection to the recent controversy involving Ranveer Allahbadia and Samay Raina. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/ed-sheeran-india-dump-football-with-john-abraham-2679075-2025-02-12",
      "headline": "Ed Sheeran's India dump features photo from football match with John AbrahamSinger Ed Sheeran shared his India dump, which also featured a glimpse of his football match with Bollywood actor John Abraham. Sheeran is in India for his Mathematics Tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/aly-goni-feels-samay-raina-was-forced-to-delete-indias-got-latent-episodes-2679069-2025-02-12",
      "headline": "Aly Goni feels Samay Raina was 'forced' to delete India's Got Latent episodesActor Aly Goni has commented on YouTuber-comedian Samay Raina's decision to remove episodes of India's Got Latent. Fans have also reacted to Samay's decision on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/odisha-rapper-abhinav-singh-dies-by-suicide-in-bengaluru-2679059-2025-02-12",
      "headline": "Odia rapper Abhinav Singh, 32, dies by suicide in BengaluruA rapper from Odisha, Abhinav Singh, died in Bengaluru where he was working for a private company. He was 32."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kendrick-lamar-super-bowl-halftime-show-is-the-most-watched-2678978-2025-02-12",
      "headline": "Kendrick Lamar's Super Bowl Halftime show is the most-watchedRapper Kendrick Lamar's Super Bowl Halftime show has become the most-watched Super Bowl show of all time, garnering an impressive 133.5 million views. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-indias-got-latent-controversy-ranveer-allahbadia-2678979-2025-02-12",
      "headline": "Too much to handle: Samay Raina deletes all videos from his show amid jokes rowComedian Samay Raina finally broke his silence on the controversy over Ranveer Allahbadia's remark on his show, India's Got Latent. He has confirmed deleting all the videos of the show, and also added that whatever is happening right now is too much for him to handle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/amy-adams-javier-bardem-to-lead-cape-fear-show-apple-tv-2678846-2025-02-12",
      "headline": "Amy Adams joins Javier Bardem in Cape Fear TV adaptationAfter Javier Bardem, actor Amy Adams is on board for the much-awaited Cape Fear TV adaptation. The release date for the show has not been announced yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-dropped-by-talent-agency-amid-antisemitic-controversial-actions-2678955-2025-02-12",
      "headline": "Kanye West dropped by talent agency amid antisemitic, controversial actionsKanye West's controversial actions have led to his talent agency, 33&West, dropping him. The decision follows a series of antisemitic remarks and troubling social media posts by the rapper that have sparked widespread condemnation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-gujarat-show-march-april-cancelled-after-indias-got-latent-controversy-2678896-2025-02-12",
      "headline": "Samay Raina's show in Gujarat cancelled amid India's Got Latent controversyComedian Samay Raina's Gujarat shows have been cancelled following a controversy sparked by the latest episode of his show, India's Got Latent. The decision comes amid backlash after a distasteful comment by YouTuber Ranveer Allahbadia on the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sakamoto-days-taro-sakamoto-assassin-x-potential-match-heightened-action-and-drama-2678501-2025-02-12",
      "headline": "Sakamoto Days: With ex-assassin's potential match, the anime is raising stakesSakamoto Days follows the story of a legendary assassin who transforms into a family man. Now, with the introduction of an equally formidable enemy, the anime might finally pick up pace and raise the stake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aashram-3-part-2-teaser-bobby-deol-comeback-baba-nirala-promises-twists-prakash-jha-aditi-pohankar-2678807-2025-02-12",
      "headline": "Aashram 3 Part 2 teaser: Bobby Deol's comeback as Baba Nirala promises more twistsAashram 3 Part 2 teaser is out. The upcoming riveting crime drama marks the return of Bobby Deol as Bala Nirala. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gaurav-khanna-opens-up-on-being-colour-blind-on-celebrity-masterchef-2678744-2025-02-12",
      "headline": "Anupamaa actor Gaurav Khanna opens up on being colour-blind on Celebrity MasterchefTV actor Gaurav Khanna appeared on Celebrity MasterChef where he opened up about being colour-blind. He participated on the show along with Ayesha Jhulka. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-v-named-world-most-handsome-man-hrithik-roshan-brad-pitt-tom-cruise-2678685-2025-02-12",
      "headline": "BTS' V named world's most handsome man. Hrithik Roshan, Brad Pitt also on listBTS singer V aka Kim Taehyung has been named as the world's most handsome man. The list also features Indian actor Hrithik Roshan, Hollywood stars Brad Pitt, Tom Cruise, Bradley Cooper, among others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/picture-this-trailer-simone-ashley-hero-fiennes-to-headline-new-romantic-comedy-2678670-2025-02-12",
      "headline": "Picture This trailer: Simone Ashley, Hero Fiennes to headline new romantic comedyThe trailer for Simone Ashley and Hero Fiennes Tiffin's film, Picture This, has been unveiled. It will release on Prime Video on March 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/jackson-wang-announces-magic-man-2-a-raw-and-vulnerable-chapter-2678617-2025-02-12",
      "headline": "Jackson Wang announces MAGIC MAN 2 – A raw and vulnerable chapterJackson Wang is set to release MAGIC MAN 2, an album that delves into the stages of grief and personal growth. After a year of introspection, he presents a raw and authentic portrayal of his journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/pop-girl-group-xg-take-their-the-first-howl-world-tour-to-latin-america-pop-girl-group-xg-take-their-the-first-howl-world-tour-to-latin-america-2678589-2025-02-12",
      "headline": "Pop girl group XG take their 'The first HOWL' World Tour to Latin-America  XG, a dynamic hip-hop/R&B-inspired girl group, is set to captivate audiences in Latin America with their inaugural concerts in Brazil and Mexico. As they continue their world tour, XG unveils a groundbreaking project, 'XDM Unidentified Waves,' that redefines their music and solidifies their global appeal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/one-direction-liam-payne-sexuality-struggle-made-girlfriend-maya-abort-child-2678510-2025-02-11",
      "headline": "Singer Liam Payne was struggling with sexuality, coerced ex to abort: ReportA new report reveals late One Direction star Liam Payne struggled with his sexuality and allegedly pressured ex-fiancée Maya Henry to terminate a pregnancy."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/f-35-fighter-jets-stryker-vehicles-engine-deal-defence-ties-pm-modi-donald-trump-meet-2679966-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "F-35 jets, Stryker vehicles, engine deal: Defence ties take off at PM-Trump meetThe meeting between PM Modi and US President Donald Trump saw the two sides agreeing to ramp up defence ties for more efficient arms transfer and procurement, and laying the framework for a stronger, technology-driven partnership."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-us-visit-trump-bilateral-meeting-bangladesh-crisis-hindus-attack-yunus-2679915-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will leave Bangladesh to PM Modi: Trump junks 'deep state' meddling rumoursModi-Trump meet: The unrest in Bangladesh and the subsequent attacks on minority Hindus were among the topics discussed by Prime Minister Narendra Modi during his bilateral with Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trump-to-send-back-more-fugitives-wanted-by-india-tahawwur-rana-extradition-who-are-on-list-2679976-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who all might lose sleep after Tahawwur Rana's extraditionUS President Donald Trump confirmed the immediate extradition of the 2008 Mumbai terror attacks accused Tahawwur Rana to India and said more would follow. The question is who is next in line. Before PM Modi's US visit, India handed over a list of 10 fugitives, including gangsters Goldy Brar and Anmol Bishnoi, to Washington DC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-pm-modi-trump-meet-encouraging-concerns-addressed-illegal-indian-immigrants-mistreatment-tariffs-f35-2680032-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shashi Tharoor's praise for PM after Trump meet: Encouraging, concerns addressedOn illegal immigration, Congress leader Shashi Tharoor backed PM Modi's stance but asserted that the treatment of undocumented Indian migrants deported from the US should have been addressed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/elon-musks-gift-to-pm-modi-starships-heatshield-tile-that-flew-to-space-2679921-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk's gift to PM Modi: Starship's heatshield tile that flew to spaceStarship's heatshield tiles are hexagonal ceramic tiles designed to protect SpaceX's Starship during atmospheric re-entry, when the spacecraft faces extreme temperatures as it returns to Earth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-us-visit-donald-trump-meeting-bonhomie-hug-handshake-optics-tariffs-for-india-2679853-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Modi gets lot of tareef, India gets loads of tariffs from Trump on key US visitModi-Trump meet: A warm hug was followed by a firm handshake as PM Modi entered the White House, but the chill was palpable following the US President's announcement of sweeping reciprocal tariffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-reaction-pm-modi-trump-statement-terrorism-tahawwur-rana-extradition-2680008-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistan rankled by India-US statement on terrorism, calls it 'one-sided'Modi-Trump meet: PM Modi and Donald Trump, in their joint statement, called on Pakistan to ensure that its territory is not used to carry out cross-border terrorist attacks.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-curbs-on-new-india-co-operative-bank-how-does-it-impact-customers-what-to-do-2680031-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RBI curbs on New India Co-operative Bank: How does it impact customers?New India Co-operative Bank has been struggling with financial losses in recent years. According to its annual report, the bank recorded a loss of Rs 22.78 crore in the financial year ending March 2024, following a loss of Rs 30.75 crore in the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/chhaava-movie-review-vicky-kaushal-rashmika-mandanna-laxman-utekar-2679812-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chhaava review: Vicky Kaushal's film growls, but doesn't roarReleased-Fri Feb 14, 2025Chhaava movie review: Director Laxman Utekar's Chhaava, starring Vicky Kaushal and Rashmika Mandanna, is based on the life of Maratha King Chhatrapati Sambhaji Maharaj. Brilliant Vicky Kaushal uplifts this strenuous film, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/drone-crashes-over-chernobyl-nuclear-reactor-roof-why-we-all-should-be-worried-2680003-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Drone crashes over Chernobyl reactor roof: Why we all should be worriedIAEA reported that there is no indication of a breach in the NSC's inner containment, and radiation levels inside and outside the site remain normal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-foreign-media-reported-pm-modi-meeting-trump-tariff-trade-defence-immigration-2679857-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Flattery and friction: How foreign media reported PM Modi's meeting with TrumpPrime Minister Narendra Modi's meeting with US President Donald Trump garnered significant attention from global media, with many outlets making note of the friction between the two sides over trade and tariffs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-gautam-adani-bribery-case-us-press-briefing-rahul-gandhi-reacts-2679872-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM steers clear of Adani question, Rahul Gandhi takes 'personal matter' jabModi-Trump meet: Prime Minister Narendra Modi, when asked about the US indictment of Gautam Adani, said such 'personal matters' were not discussed during his meeting with Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhoom-dhaam-review-yami-gautam-pratik-gandhi-2679912-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dhoom Dhaam review: Romance meets thrill in this Yami Gautam-Pratik Gandhi filmReleased-Fri Feb 14, 2025Dhoom Dhaam movie review: Dhoom Dhaam blends romance with action and comedy, offering a refreshing alternative to traditional Valentine's Day films. Starring Yami Gautam and Pratik Gandhi, the movie delivers a thrilling and entertaining experience perfect for a cosy night in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/calcutta-high-court-rss-rally-burdwan-bengal-government-denies-2680006-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RSS gets High Court nod for rally after Bengal government denies: Keep sound lowThe West Bengal government had denied permission for RSS rally in Burdwan, following which the organisation moved the Calcutta High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/impact-of-us-immigration-raids-on-indians-what-visa-applicants-need-to-know-2679998-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Impact of US immigration raids on Indians: What visa applicants need to knowMany Indians planning to relocate to the United States have been left anxious after Donald Trump's crackdown on illegals. As deportation of undocumented immigrants continues, here's how people applying for work visas can avoid complications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/this-valentines-day-how-to-bring-love-indoors-2679328-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "This Valentine's Day, how to bring love indoorsLove isn't just in the air, it pervades home décor. Experts share savvy tips to get your abode ready for the occasion and beyond\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/humpback-whale-swallows-kayaker-before-letting-him-go-terrifying-video-2679908-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Terrifying moment Humpback whale swallows kayaker before letting him goAdrian Simancas was kayaking with his father, Dell, in Bahia El Aguila, near the Strait of Magellan, when the massive whale surfaced beneath him, swallowing both him and his bright yellow kayak for a few brief seconds.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-got-latent-row-samay-raina-shines-as-ranveer-allahbadia-faces-heat-2679639-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India's Got Latent row impact: Samay Raina's stocks grow, Ranveer Allahbadia hitA controversy erupted after Ranveer Allahbadia, during an episode of 'India's Got Latent', asked a question to a participant that included \"parents\" and \"sex\" among other obscene references. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-us-visit-donald-trump-meeting-tariffs-trade-deal-f35-jets-immigration-2679813-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "26/11 plotter extradition, F-35 jets, trade deal: Takeaways from Modi-Trump meetModi-Trump meet: The key takeaways from the Modi-Trump meeting were the extradition of 26/11 Mumbai terror attack accused Tahawwur Rana to India and the F-35 jet deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/nasa-near-shoemaker-asteroid-landing-history-orbiter-minor-planet-space-solar-system-2679897-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "When Nasa spacecraft miraculously landed on an asteroid without any plan Twenty-four years ago, a spacecraft with no landing mechanism touched down on a chunk of rock in space. Defying all odds, the Nasa spacecraft became the first in history to not just orbit a minor planet, but touch it. It miraculously survived for two weeks and transmitted crucial data back to the Earth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/jiohotstar-is-now-live-in-india-merges-content-from-jiocinema-and-disney-hotstar-2679863-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "JioHotstar is now live in India, merges content from Jiocinema and Disney HotstarJioHotstar has recently launched in India. Users can now watch content from both Jiocinema and Disney+ Hotstar in one app. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kanan-gill-asking-same-question-as-ranveer-allahbadia-video-2679865-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Viral video: Kanan Gill made same remark as Ranveer Allahbadia years agoAs Ranveer Allahbadia faces backlash for his India's Got Latent remark, an old video of Kanan Gill asking the same question resurfaces on the internet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-chief-minister-oath-ceremony-bjp-cabinet-february-19-or-20-mlas-shortlisted-narendra-modi-returns-from-us-trip-2679969-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi Chief Minister's oath likely on February 19 or 20, 15 MLAs shortlistedThe Delhi Chief Minister's oath-taking ceremony is likely to be held on February 19 or 20, according to government sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-ranveer-allahbadia-samay-raina-controversy-indias-got-latent-2680009-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pankaj Tripathi reacts to India's Got Latent row: No pride in uttering nonsensePankaj Tripathi reacted to Ranveer Allahbadia and Samay Raina's ongoing controversy over the YouTuber's remarks on India's Got Latent. The actor said no one should take pride in uttering nonsense. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanam-teri-kasam-box-office-day-7-harshvardhan-rane-film-earns-rs-30-crore-in-a-week-2680060-2025-02-14",
      "headline": "Sanam Teri Kasam box office Day 7: Harshvardhan's film earns Rs 30 crore in a weekHarshvardhan Rane's Sanam Teri Kasam is having its dream run at the domestic box office. The film re-released in theatres on February 7. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-forays-into-business-with-his-new-lifestyle-brand-arks-2680024-2025-02-14",
      "headline": "Ranbir Kapoor forays into business with his new lifestyle brand ArksActor Ranbir Kapoor is now stepping into the fashion world with the launch of his lifestyle brand, ARKS, in Bandra. The brand, inspired by Mumbai's lively spirit, will offer high-end footwear and wardrobe essentials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/munawar-faruqui-jokes-about-ranveer-allahbadia-arrest-amid-india-got-latent-2680046-2025-02-14",
      "headline": "Munawar Faruqui jokes about Ranveer Allahbadia's arrest amid India's Got Latent rowStand-up comedian Munawar Faruqui on Friday shared a video of himself, presumably taken abroad, where he could be heard making light of YouTuber Ranveer Allahbadia's 'arrest'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-ranveer-allahbadia-samay-raina-controversy-indias-got-latent-2680009-2025-02-14",
      "headline": "Pankaj Tripathi reacts to India's Got Latent row: No pride in uttering nonsensePankaj Tripathi reacted to Ranveer Allahbadia and Samay Raina's ongoing controversy over the YouTuber's remarks on India's Got Latent. The actor said no one should take pride in uttering nonsense. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-babar-azam-fastest-6000-odi-runs-virat-kohli-pakistan-vs-new-zealand-tri-series-final-2680057-2025-02-14",
      "headline": "Pakistan star Babar Azam faster than Virat Kohli to complete 6000 runs in ODIsFormer Pakistan captain Babar Azam completed 6,000 runs in his 123rd innings, which came in the ODI tri-series final against New Zealand in Karachi on Friday, February 14. He got to the landmark 13 innings faster than Virat Kohli. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-vs-japan-badminton-asia-team-championships-quarterfinal-score-hs-prannoy-2680045-2025-02-14",
      "headline": "India crash out of Badminton Asia Mixed Team Championships after losing to Japan India returned empty-handed from China after losing their quarterfinals to Japan 0-3. HS Prannoy lost a decisive match as India finished without a single win in their last-eight tie on Friday, February 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-karun-nair-ranji-trophy-ajit-agarkar-team-selection-2679994-2025-02-14",
      "headline": "Good to see clear statement from Agarkar: Karun Nair after Champions Tropyh snubVidarbha batter Karun Nair responded to national selector Ajit Agarkar statement about why he was not selected for the ICC Champions Trophy despite his sensational form in domestic cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-international-masters-league-how-to-book-tickets-sachin-tendulkar-brain-lara-2679985-2025-02-14",
      "headline": "How to book tickets for International Masters League ft Tendulkar, LaraAs cricket legends are set to take the field again in the International Masters League, starting from February 22, fans can now get their hands on tickets for the matches on BookMyShow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-prize-money-icc-tournament-2679927-2025-02-14",
      "headline": "Champions Trophy winners to get USD 2.2 million as ICC increases prize poolThe ICC has increased the prize pool for the Champions Trophy which returns after a hiatus of nearly 8 years. The tournament is set to start from February 19 and has guaranteed a participation fee of $125,000.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-kylian-mbappe-returns-france-squad-uefa-nations-league-didier-deschamps-2679888-2025-02-14",
      "headline": "Mbappe returns to France squad for Nations League quarter-final: DeschampsDidier Deschamps confirmed Kylian Mbappe's return to the France squad for the Nations League quarterfinal against Croatia after the Real Madrid star rediscovered his form following a slow start to life in Spain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-australia-vs-sri-lanka-glenn-maxwell-travis-head-playing-xi-2679876-2025-02-14",
      "headline": "Maxwell, Head return as Australia makes major changes in final ODI vs Sri LankaSL vs AUS: Australia made a total of 5 changes for the final ODI match vs Sri Lanka. Australia brought in the heavy hitters before the Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-teams-hundred-pakistan-players-involvement-2679871-2025-02-14",
      "headline": "IPL teams' involvement will not affect Pakistan players in Hundred: GouldIndian Premier League's involvement in the Hundred would not affect the participation of Pakistani players in the tournament, said ECB chief executive Richard Gould. 4 IPL teams recently bought stakes in the competition.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ufc-calvin-kattar-unfinished-business-featherweight-division-exclusive-2679868-2025-02-14",
      "headline": "Calvin Kattar aiming to finish 'unfinished business' in UFC featherweightAfter a few years of struggle, Calvin Kattar is ready to get back to the top of the featherweight division in the UFC. In an exclusive interaction with Indiatoday.in, the Boston Finisher opens up about his aims for 2025, his unfinished business at featherweight and what he expects to do in the fight against Youssef Zalal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-prize-money-icc-tournament-2679927-2025-02-14",
      "headline": "Champions Trophy winners to get USD 2.2 million as ICC increases prize poolThe ICC has increased the prize pool for the Champions Trophy which returns after a hiatus of nearly 8 years. The tournament is set to start from February 19 and has guaranteed a participation fee of $125,000.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-kylian-mbappe-returns-france-squad-uefa-nations-league-didier-deschamps-2679888-2025-02-14",
      "headline": "Mbappe returns to France squad for Nations League quarter-final: DeschampsDidier Deschamps confirmed Kylian Mbappe's return to the France squad for the Nations League quarterfinal against Croatia after the Real Madrid star rediscovered his form following a slow start to life in Spain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-australia-vs-sri-lanka-glenn-maxwell-travis-head-playing-xi-2679876-2025-02-14",
      "headline": "Maxwell, Head return as Australia makes major changes in final ODI vs Sri LankaSL vs AUS: Australia made a total of 5 changes for the final ODI match vs Sri Lanka. Australia brought in the heavy hitters before the Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-teams-hundred-pakistan-players-involvement-2679871-2025-02-14",
      "headline": "IPL teams' involvement will not affect Pakistan players in Hundred: GouldIndian Premier League's involvement in the Hundred would not affect the participation of Pakistani players in the tournament, said ECB chief executive Richard Gould. 4 IPL teams recently bought stakes in the competition.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ufc-calvin-kattar-unfinished-business-featherweight-division-exclusive-2679868-2025-02-14",
      "headline": "Calvin Kattar aiming to finish 'unfinished business' in UFC featherweightAfter a few years of struggle, Calvin Kattar is ready to get back to the top of the featherweight division in the UFC. In an exclusive interaction with Indiatoday.in, the Boston Finisher opens up about his aims for 2025, his unfinished business at featherweight and what he expects to do in the fight against Youssef Zalal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-new-zealand-final-preview-odi-tri-series-karachi-live-streaming-2679847-2025-02-14",
      "headline": "PAK vs NZ, final: Pakistan eye tri-series title in Champions Trophy tune-upODI tri-series final: Pakistan aim to test themselves against a well-drilled New Zealand side in Friday's final in Karachi. The two teams will face off at the same venue in their Champions Trophy opener next week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-diego-schwartzman-fights-tears-home-crowd-chants-name-retirement-argentina-open-2679844-2025-02-14",
      "headline": "Watch: Schwartzman fights tears as home crowd bids emotional farewellDiego Schwartzman received an emotional farewell in Buenos Aires as fans chanted his name before his final career point, marking the end of an inspiring journey in professional tennis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rachin-ravindra-injury-update-new-zealand-head-coach-gary-stead-few-more-steps-away-2679833-2025-02-14",
      "headline": "Rachin Ravindra few more steps away from being fit: New Zealand coach SteadNew Zealand head coach Gary Stead confirmed that Rachin Ravindra is still recovering from his facial injury, raising concerns over his availability for the Champions Trophy opener against Pakistan on February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-squad-analysis-predicted-xi-team-news-steve-smith-jake-fraser-mcgurk-2679827-2025-02-14",
      "headline": "Champions Trophy 2025: Can Steve Smith guide depleted Australia to title glory?Australia are always considered favourites heading into ICC events, but things seem to be a little different this time. The Aussies will look for inspiration from Steve Smith and a bit of magic from their remaining ODI World Cup heroes to win the Champions Trophy for the first time since 2009. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-gifts-kevin-pietersen-son-signed-jersey-india-vs-england-2679817-2025-02-14",
      "headline": "Kohli gifts signed India jersey to Pietersen's son: Fits like a gloveVirat Kohli gifted a signed India jersey to Kevin Pietersen's son, Dylan, prompting a heartfelt Instagram post from the former England captain, who expressed gratitude for the special gesture.\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-d-gukesh-fights-draw-alireza-firouzja-freestyle-grand-slam-final-round-2679805-2025-02-14",
      "headline": "Gukesh fights back to hold Firouzja in Freestyle Chess Grand SlamD Gukesh staged a remarkable comeback to secure a crucial draw against Alireza Firouzja, while Magnus Carlsen and Hikaru Nakamura dominated with black pieces in the Freestyle Chess Grand Slam Tour's final round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-live-streaming-squads-schedule-rcb-mi-dc-2678915-2025-02-14",
      "headline": "WPL 2025: Squads, schedule and all you need to know WPL 2025: Royal Challengers Bengaluru (RCB) will look to defend their title when they begin their campaign on February 14 against Gujarat Giants at the Kotambi Stadium in Vadodara. The final will take place on March 15 at the Brabourne Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-squad-analysis-predicted-xi-team-news-steve-smith-jake-fraser-mcgurk-2679827-2025-02-14",
      "headline": "Champions Trophy 2025: Can Steve Smith guide depleted Australia to title glory?Australia are always considered favourites heading into ICC events, but things seem to be a little different this time. The Aussies will look for inspiration from Steve Smith and a bit of magic from their remaining ODI World Cup heroes to win the Champions Trophy for the first time since 2009. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-gifts-kevin-pietersen-son-signed-jersey-india-vs-england-2679817-2025-02-14",
      "headline": "Kohli gifts signed India jersey to Pietersen's son: Fits like a gloveVirat Kohli gifted a signed India jersey to Kevin Pietersen's son, Dylan, prompting a heartfelt Instagram post from the former England captain, who expressed gratitude for the special gesture.\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-d-gukesh-fights-draw-alireza-firouzja-freestyle-grand-slam-final-round-2679805-2025-02-14",
      "headline": "Gukesh fights back to hold Firouzja in Freestyle Chess Grand SlamD Gukesh staged a remarkable comeback to secure a crucial draw against Alireza Firouzja, while Magnus Carlsen and Hikaru Nakamura dominated with black pieces in the Freestyle Chess Grand Slam Tour's final round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-live-streaming-squads-schedule-rcb-mi-dc-2678915-2025-02-14",
      "headline": "WPL 2025: Squads, schedule and all you need to know WPL 2025: Royal Challengers Bengaluru (RCB) will look to defend their title when they begin their campaign on February 14 against Gujarat Giants at the Kotambi Stadium in Vadodara. The final will take place on March 15 at the Brabourne Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-jp-duminy-backs-rohit-sharma-to-put-up-big-performances-2679705-2025-02-13",
      "headline": "JP Duminy backs Rohit Sharma to put up big performances in Champions TrophyFormer South Africa cricketer JP Duminy has backed India captain Rohit Sharma to put up big performances in the upcoming ICC Champions Trophy 2025. Rohit recently bounced back to form in the 2nd ODI vs England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-hopeful-of-hosting-more-icc-events-after-champions-trophy-2025-2679675-2025-02-13",
      "headline": "Pakistan hopeful of hosting more ICC events after Champions Trophy 2025Pakistan Cricket Board (PCB) Chairman Mohsin Naqvi is hopeful that the upcoming ICC Champions Trophy 2025 will open opportunities to host more ICC events in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-babar-azam-mohammad-rizwan-press-pakistan-vs-new-zealand-odi-tri-series-final-2679668-2025-02-13",
      "headline": "Babar Azam not in form? Pakistan captain backs star batter with interesting takeODI tri-series final: Speaking on the eve of the final, Pakistan captain Mohammad Rizwan defended Babar Azam, saying the star batter is facing additional pressure because of 'extreme expectations'. Babar failed in the first two matches of the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-brendon-mccullum-hits-back-at-factually-incorrect-criticism-over-englands-practice-sessions-2679632-2025-02-13",
      "headline": "McCullum hits back at 'factually incorrect' criticism over England's practiceEngland head coach Brendon McCullum has hit back at the criticism over England holding fewer practice sessions during their recent white-ball series against India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-champions-trophy-shreyas-iyers-admission-reveals-indias-think-tank-problem-2679623-2025-02-13",
      "headline": "Champions Trophy: Shreyas Iyer's admission reveals India's think-tank problemWhy fix something that isn't broken? India seem to be overcomplicating their combination in the ODI series against England, which is a worrying sign ahead of the Champions Trophy. There appears to be a real problem of plenty for coach Gautam Gambhir and captain Rohit Sharma. Why on earth did they leave out Shreyas Iyer for the series opener in Nagpur? An injury to Virat Kohli meant Shreyas got an opportunity after a late phone call from the skipper. The star batter revealed he was not in the XI as late as the eve of the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-yashasvi-jaiswal-ranji-trophy-mumbai-vs-vidarbha-semifinal-champions-trophy-snub-2679619-2025-02-13",
      "headline": "After Champions Trophy snub, Yashasvi Jaiswal to play Ranji Trophy semifinalAfter missing out on a place in India's final 15-man squad for the Champions Trophy, Yashasvi Jaiswal was drafted into Mumbai's Ranji Trophy squad for their semi-final against Vidarbha in Nagpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-when-and-where-to-watch-pakistan-vs-new-zealand-tri-series-final-live-streaming-details-2679604-2025-02-13",
      "headline": "PAK vs NZ, tri-series final Live Streaming: When and where to watch?Tri-Series in Pakistan 2025: Pakistan and New Zealand are all set to clash in the final of the tri-series on February 14 in Karachi. Here are the complete details of where to watch the match live on TV and on the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-virat-kohli-rcb-captaincy-rajat-patidar-explained-andy-flower-mo-babat-2679600-2025-02-13",
      "headline": "IPL: Did Virat Kohli say no to returning as RCB captain for 2025 season?IPL 2025: After retiring from T20Is last year, Virat Kohli was widely expected to return as RCB captain. However, on February 13, the franchise appointed Rajat Patidar as their skipper for the upcoming season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-premier-league-parunika-sisodia-mumbai-rcb-pooja-vastrakar-2679590-2025-02-13",
      "headline": "Unsold in auction, teenager gets Mumbai Indians call-up after World Cup heroicsWomen's Premier League 2025: Mumbai Indians roped in U19 World Cup star Parunika Sisodia as a replacement for injured Pooja Vastrakar. Defending champions RCB will miss the services of Asha Sobhana as the leg-spinner has been ruled out due to injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-bangladesh-appoint-mehidy-hasan-miraz-as-vice-captain-2679584-2025-02-13",
      "headline": "Bangladesh appoint Mehidy Hasan Miraz as vice captain for Champions TrophyBangladesh Cricket Board (BCB) announced Mehidy Hasan Miraz as their vice-captain for the upcoming ICC Champions Trophy 2025. Bangladesh will start their campaign against India on February 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-crcket-team-families-not-to-travel-dubai-bcci-rules-2679535-2025-02-13",
      "headline": "Families not to travel with Indian players for Champions Trophy to Dubai: Report Champions Trophy 2025: The Indian team is set to leave for Dubai on February 15. However, families won't accompany the players for the three-week-long tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-babar-azam-urges-fans-and-media-to-stop-calling-him-king-2679522-2025-02-13",
      "headline": "Stop calling me king, I am not there yet, Babar Azam tells fans and mediaStar Pakistan batter Babar Azam has urged his fans and the media to stop calling him king. Babar hasn't had a memorable run in the first two matches of the tri series."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}