{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-20-new-us-president-impact-indian-stock-markets-rupee-sensex-nifty-expert-view-2666867-2025-01-19",
      "headline": "Trump 2.0: What the new US President means for Indian stock marketsBack in November, news of Donald Trump's return to the White House sent the Sensex soaring by over 900 points, sparking optimism across Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-launches-trump-meme-coin-crypto-traders-2666804-2025-01-18",
      "headline": "Donald Trump launches $TRUMP meme coin, crypto traders make millions in minutesDonald Trump, days before his presidential inauguration, shook the crypto market with the launch of $TRUMP meme coin, which surged 220 per cent in value and hit USD 4.25 billion in hours."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/indias-growth-forecast-remains-at-65-imf-ytvd-2666600-2025-01-18",
      "headline": "IMF forecasts India's growth at 6.5% for fiscal year 2025-2026IMF maintains India's growth at 7% for 2024-2025 and 6.5% for 2025-2026, driven by investment and consumption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-how-were-the-salary-hikes-in-7th-and-6th-pay-commissions-2666333-2025-01-18",
      "headline": "8th Pay Commission: What were the big changes in 7th and 6th Pay Commissions?The Government has approved the formation of the 8th Pay Commission for central government employees and pensioners. Here is a look at the salary hikes under the 7th and 6th Pay Commissions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-simple-tips-to-get-personal-loans-at-lowest-interest-rates-2666375-2025-01-17",
      "headline": "5 simple tips to get personal loans at lowest interest ratesThis article guides you through five effective strategies to secure personal loans at the most competitive interest rates, ensuring you make informed financial decisions and reduce your overall borrowing costs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-salary-hike-central-government-tax-relief-in-budget-demands-private-sector-fitment-factor-2666336-2025-01-17",
      "headline": "Why 8th Pay Commission is spurring calls for income tax relief in BudgetWith government employees set to benefit from a pay hike from the 8th Pay Commission, private sector employees are demanding income tax relief to boost their disposable income. Experts argue that easing the tax burden on individuals is key to spurring consumption, the backbone of India's economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-ends-over-400-points-lower-nifty-falls-as-it-stocks-tumble-2666288-2025-01-17",
      "headline": "Sensex ends over 400 points lower, Nifty falls as IT stocks tumbleThe S&P BSE Sensex ended 423.49 points lower at the closing bell, whil the NSE Nifty50 settled 108.60 points lower at 23,203.20."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-time-when-will-it-start-timeline-benefits-central-government-employees-salary-hike-2666276-2025-01-17",
      "headline": "How long before 8th Pay Commission benefits reach central government employees?The 7th Pay Commission took around 22 months from its formation to the implementation of its recommendations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-artificial-intelligence-the-new-wolf-of-wall-street-2666190-2025-01-17",
      "headline": "Is artificial intelligence the new wolf of Wall Street?A recent Bloomberg Intelligence report stated that major Wall Street banks, including Citigroup, JPMorgan, and Goldman Sachs, may slash up to 200,000 jobs in the coming 3-5 years."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bad-credit-here-is-how-you-can-still-secure-emergency-funds-2666242-2025-01-17",
      "headline": "Bad credit? Here's how you can still secure emergency fundsThough bad credit limits borrowing options and raises interest rates, some lenders still offer loans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-epf-to-nps-transfer-possible-check-the-details-here-2666218-2025-01-17",
      "headline": "Is EPF to NPS transfer possible? Check the details hereThe decision to transfer EPF to NPS must align with your financial goals, liquidity needs, and risk appetite. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-salary-hike-how-much-salary-increase-can-government-employees-expect-fitment-factor-2666199-2025-01-17",
      "headline": "8th Pay Commission: How much salary increase can government employees expect?Union Minister Ashwini Vaishnaw confirmed the decision and said that the commission would be formed soon to revise the pay structure for central government employees and pensioners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-bank-on-india-gdp-growth-strong-momentum-or-slowdown-in-fy26-2666164-2025-01-17",
      "headline": "Will India's growth story gain momentum or slow down in FY26?India's GDP, which clocked a stellar 9.7% in FY22 before settling at 7% in FY23 and 8.2% in FY24, has been on a roller-coaster ride."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/axis-bank-shares-price-fall-6-percent-to-hit-52-week-low-why-q3-results-should-you-buy-2666114-2025-01-17",
      "headline": "Axis Bank shares drop 6% to hit 52-week low. Should you buy? Axis Bank share price: The stock closed at Rs 1,040.20 in the previous session, opened at Rs 1,006.95 on Friday and slid further to Rs 974.45 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-what-is-fitment-factor-that-determines-salary-hike-2666112-2025-01-17",
      "headline": "8th Pay Commission: What is fitment factor that determines salary hikeThe salary and pension hikes under the 8th Pay Commission will be calculated by applying the fitment factor to the existing basic pay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-share-price-rises-over-2-after-q3-results-good-time-to-buy-2666104-2025-01-17",
      "headline": "Reliance share price rises over 2% after Q3 results. Should you buy now? Reliance's share price was up 1.44% to Rs 1,287 at 10:51 am on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-share-price-down-today-overnight-adrs-q3-results-key-reasons-future-outlook-2666088-2025-01-17",
      "headline": "Explained: Why Infosys share price tumbled over 5% after strong Q3 resultsInfosys stock was down 5.40% at Rs 1,822.10 on the BSE at 10:15 a.m. The company's shares had hit a day's low of Rs 1,815.85. \r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/why-is-stock-market-falling-today-check-key-details-sensex-nifty-q3-results-infosys-axis-bank-2666080-2025-01-17",
      "headline": "Sensex drops 750 points. Why did stock market fall in early trade?Stock market down today: The fall in IT stocks was a result of Infosys' shares falling over 5.3% after the company reported its Q3 results yesterday. The drop, however, came as a surprise as the company raised its revenue forecast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-drops-400-points-markets-tank-as-it-stocks-fall-infosys-falls-4-percent-q3-results-2666065-2025-01-17",
      "headline": "Sensex drops 400 points: Markets tank as IT stocks fall; Infosys down 5%Stock market today: The S&P BSE Sensex was down 430.02 points to 76,612.80, while the NSE Nifty50 tumbled 121.05 points to 23,190.75 as of 9:22 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-plans-to-make-cryptocurrency-national-priority-bitcoin-price-cryptocurrency-report-2666053-2025-01-17",
      "headline": "Donald Trump plans to make cryptocurrency a national priority: ReportThe order will designate cryptocurrency as a national imperative, encouraging government agencies to collaborate with the industry."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/massive-fire-maha-kumbh-prayagraj-tenders-rushed-2666970-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Massive fire breaks out at Maha Kumbh in Prayagraj, several tenders rushedMassive fire breaks out at Maha Kumbh in Prayagraj, several tenders rushed"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-releases-names-of-first-3-hostages-after-israel-delays-gaza-ceasefire-amid-list-impasses-2666934-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gaza ceasefire begins after Hamas shares 1st list of hostages to be freedIsrael had earlier said that it would continue fighting in Gaza until it received the list of 33 hostages to be released by Hamas, delaying the ceasefire by over two hours."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/suspicion-of-international-conspiracy-cant-be-ruled-out-court-on-saif-ali-khans-attacker-2666936-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cops get Saif attacker's custody, court cites international conspiracy suspicionsaif ali khan attack: The suspicion of an international conspiracy cannot be ruled out, as the attacker is from Bangladesh, a Mumbai court said while granting five-day police custody to the accused who stabbed actor Saif Ali Khan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-techie-loses-rs-11-crore-to-scammers-posing-as-customs-ed-officers-2666944-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru techie loses Rs 11 crore to scammers posing as customs, ED officersA man working in the tech industry lost Rs 11 crore to cyber fraudsters who swindled him by posing as customs and ED officials. The accused have been arrested by Bengaluru's Cyber Police and a further probe is still going on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/gen-z-takes-spiritual-plunge-maha-kumbh-2025-prayagraj-reels-instagram-iit-baba-harsha-richhariya-videos-2666761-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What's drawing the Gen Z to Maha Kumbh 2025A large number of youngsters are participating in Maha Kumbh 2025, effortlessly blending social media with spirituality. This is what is attracting the Gen Z to the Kumbh Mela, a religious gathering that is believed to draw the spiritually-inclined and the elderly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ravindra-jadeja-ranji-trophy-saurashtra-vs-delhi-rohit-sharma-bcci-rule-2666940-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After Rohit Sharma, Ravindra Jadeja confirms availability for Ranji Trophy fixtureAfter captain Rohit Sharma confirmed his availability to play Mumbai's Ranji Trophy match against Jammu and Kashmir, Ravindra Jadeja has given the green light to play for Saurashtra against Delhi in the next round of the domestic tournament, which gets underway on January 23. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-attack-cctv-clip-from-7-days-before-actor-stabbing-helped-cops-catch-attacker-from-thane-2666957-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "A CCTV clip from 7 days before Saif Ali Khan's stabbing helped cops catch attackerThe CCTV footage, dated January 9, showed the man accused of stabbing Saif Ali Khan roaming the Dadar and Prabhadevi areas, providing key leads that ultimately led to his arrest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-assembly-polls-arvind-kejriwal-writes-to-pm-seeks-support-for-homes-for-sanitation-workers-on-emi-2666918-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Arvind Kejriwal writes to PM seeking land to build homes for sanitation workersIn his letter to PM Modi, Arvind Kejriwal sought the Centre's support for his scheme to provide homes to sanitation workers in Delhi at easly monthly instalments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-sons-taimur-jeh-visit-him-at-hospital-with-kareena-kapoor-watch-video-2666947-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Taimur, Jeh visit father Saif Ali Khan at hospital with Kareena KapoorSaif Ali Khan's sons, Taimur and Jeh, visited him at the hospital on Sunday. A video of them from the hospital surfaced on the internet. Saif was stabbed on January 16 at his Bandra home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shooting-olympic-medallist-manu-bhakers-maternal-grandmother-and-uncle-die-in-road-accident-2666912-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Olympic medallist Manu Bhaker's grandmother and uncle die in road accidentParis Olympics 2024 medallist Manu Bhaker's maternal grandmother and uncle died in a road accident on Sunday, January 19. The accident happened in Charkhi Dadri, Haryana on Sunday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-attack-facial-recognition-bike-number-led-to-arrest-by-mumbai-police-2666931-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Facial recognition, bike number: What led to arrest of Saif Ali Khan's attackerThe police have arrested Mohammad Shariful Islam Shehzad, a Bangladeshi national, for the attack that took place at the Bollywood star's house in Bandra on Thursday, January 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australian-open-2025-carlos-alcaraz-reaches-quarterfinals-jack-draper-retires-2666920-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Australian Open: Carlos Alcaraz through to quarters after Jack Draper retiresCarlos Alcaraz has reached the quarterfinals of the Australian Open 2025 as his opponent, Jack Draper, had to retire with injury after just 2 sets. Draper suffered a hip injury during the contest. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/is-morocco-killing-3-million-dogs-for-fifa-world-cup-2666932-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Brutal street clean-up': Is Morocco killing 3 million dogs for FIFA World Cup?Morocco, which gained international attention after being selected to co-host the 2030 FIFA World Cup, now faces global outrage for brutally killing stray dogs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-the-indian-economy-can-be-kept-on-fast-track-2666655-2025-01-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How the Indian economy can be kept on fast trackAccelerating the country's growth potential in 2025 will require reforms, resilience and readiness for global headwinds and uncertainties\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/nirmala-sitharaman-on-japanese-ramayana-re-release-2666909-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nirmala Sitharaman 'fondly remembers' watching Japanese Ramayana as it re-releasesFinance Minister Nirmala Sitharaman has fond memories of watching the acclaimed Japanese Ramayana. The politician on Saturday shared a small note about it as the film is set for a re-release. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-attacker-mohammad-shariful-islam-shehzad-vijay-das-2666907-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not Indian, changed name to Vijay Das: Who is Mohammad Shehzad, Saif's attacker?Saif Ali Khan Attack: Mohammad Shariful Islam Shehzad, the man arrested for attacking actor Saif Ali Khan, does not have any Indian documents and he changed his name to Vijay Das."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tiktok-banned-in-america-why-india-blocked-chinese-apps-five-years-back-2666888-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Good morning, America: Why India banned TikTok 5 years backAmerica's TikTok ban came five years after India blocked the app, citing security reasons. India had said that TikTok, along with 58 other Chinese apps, posed a threat to sovereignty and security of the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-entertainment-sports-business-443-18-01-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/uk-woman-says-husband-pays-her-woman-tax-for-motherhood-struggles-in-viral-video-2666935-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UK woman says husband pays her 'woman tax' for motherhood struggles in viral videoIn a now-viral video, a UK-based woman explained that her husband pays her \"woman tax\" compensating her for the physical and emotional challenges of motherhood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-20-new-us-president-impact-indian-stock-markets-rupee-sensex-nifty-expert-view-2666867-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump 2.0: What the new US President means for Indian stock marketsBack in November, news of Donald Trump's return to the White House sent the Sensex soaring by over 900 points, sparking optimism across Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-winners-fans-felt-were-undeserving-mc-stan-elvish-yadav-2666911-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "From Elvish Yadav to MC Stan: The 'undeserving' Bigg Boss winnersAhead of Bigg Boss 18 finale today, we look at all the previous winners of the TV reality show who fans felt were undeserving."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-day-8-live-updates-aryna-sabalenka-novak-djokovic-carlos-alcaraz-2666813-2025-01-18?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Day 8 Live Updates: Djokovic beats Lehecka, Zverev into quartersAustralian Open 2025, Day 8 Live Updates: Novak Djokovic has beaten Jiri Lehecka in the 4th round clash. The winner of this match will face Carlos Alcaraz in the next round. Alcaraz secured the win in the 4th round as Jack Draper was forced to retire after 2 sets. The British star struggled with the knock for the entirety of the second set and decided not to continue for the third one. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/tiktok-offline-us-before-new-law-banning-popular-video-sharing-app-comes-into-effect-report-2666856-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "TikTok ban comes into effect in US, users can no longer access appSeveral screenshots of the app shared on social media showed a message on the short-video platform stating that a law banning TikTok had been enacted, with the message, \"Sorry, TikTok isn't available right now\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-inauguration-us-president-washington-oath-taking-2666846-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump lands in Washington ahead of inauguration, fireworks kickstart celebrationsDonald Trump will host a reception for about 500 guests and a fireworks display on Saturday night, ahead of the inauguration of his second term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-says-she-is-at-peace-with-karan-johar-diljit-dosanjh-2666979-2025-01-19",
      "headline": "Kangana Ranaut says she's at peace with KJo, Diljit Dosanjh: Nothing against themKangana Ranaut said she is at peace with Karan Johar and Diljit Dosanjh. She created a stir in Bollywood in 2017 as she called Karan the 'flagbearer of nepotism'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-grand-finale-live-written-update-salman-khan-winner-prize-money-trophy-2666965-2025-01-19",
      "headline": "Bigg Boss 18 Grand Finale Live Updates: Who will win Salman Khan-hosted show?Bigg Boss 18 finale: The grand finale of the 18th season of the controversial reality show, Bigg Boss, will be held tonight. Among the six finalists, one will take home the winner's trophy, along with Rs 50 lakh prize money. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-sons-taimur-jeh-visit-him-at-hospital-with-kareena-kapoor-watch-video-2666947-2025-01-19",
      "headline": "Watch: Taimur, Jeh visit father Saif Ali Khan at hospital with Kareena KapoorSaif Ali Khan's sons, Taimur and Jeh, visited him at the hospital on Sunday. A video of them from the hospital surfaced on the internet. Saif was stabbed on January 16 at his Bandra home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-finale-akshay-kumar-to-promote-sky-force-aamir-khan-to-join-too-2666939-2025-01-19",
      "headline": "Bigg Boss 18 finale: Akshay Kumar to promote Sky Force, Aamir Khan to join tooBigg Boss 18 grand finale will feature Bollywood actors Akshay Kumar, Khushi Kapoor, Junaid Khan, and others. The Salman Khan-hosted show will air on the Colors channel at 9:30 pm on Sunday. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-novak-djokovic-sets-up-quarters-carlos-alcaraz-jiri-lehecka-2666972-2025-01-19",
      "headline": "Australian Open: Ruthless Djokovic sets up blockbuster quarter-final vs AlcarazAustralian Open 2025: Novak Djokovic defeated Jiri Lehecka in straight sets to progress to the quarter-final for the 15th time in his career in Melbourne. The 10-time champion will take on Carlos Alcaraz in what promises to be a blockbuster quarterfinals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-captain-steve-smith-suffers-elbow-injury-ahead-of-sri-lanka-test-tour-2666958-2025-01-19",
      "headline": "Former India opener questions Mohammed Siraj's absence from Champions Trophy squadFormer India cricketer Aakash Chopra has questioned the team management about Mohammed Siraj's absence from India's squad for the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-vs-west-indies-multan-test-sajid-khan-2666950-2025-01-19",
      "headline": "Spin-trio help Pakistan hammer clueless West Indies in 1st Test PAK vs WI: Sajid Khan picked up nine wickets, including a five-wicket haul in the second innings, as Pakistan beat West Indies by 127 runs to take a 1-0 lead in the two-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-cricket-shubman-gill-vice-captaincy-suresh-raina-suryakumar-2666948-2025-01-19",
      "headline": "Shubman Gill a young leader like Virat Kohli was: Raina backs vice-captaincy callChampions Trophy 2025: Former cricketer Suresh Raina backed the selectors' decision to hand Shubman Gill the vice-captaincy of the ODI team. Gill will be Rohit Sharma's deputy in the presttigious 8-team tournament, starting February 19. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-captain-steve-smith-suffers-elbow-injury-ahead-of-sri-lanka-test-tour-2666943-2025-01-19",
      "headline": "Captain Steve Smith suffers elbow injury ahead of Sri Lanka Test tourAustralia's stand-in skipper for the Sri Lanka Test tour, Steve Smith, has suffered an elbow injury ahead of the two-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ravindra-jadeja-ranji-trophy-saurashtra-vs-delhi-rohit-sharma-bcci-rule-2666940-2025-01-19",
      "headline": "After Rohit Sharma, Ravindra Jadeja confirms availability for Ranji Trophy fixtureAfter captain Rohit Sharma confirmed his availability to play Mumbai's Ranji Trophy match against Jammu and Kashmir, Ravindra Jadeja has given the green light to play for Saurashtra against Delhi in the next round of the domestic tournament, which gets underway on January 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-could-repeat-his-2019-world-cup-heroics-in-champions-trophy-suresh-raina-2666927-2025-01-19",
      "headline": "Rohit can repeat his 2019 World Cup heroics in Champions Trophy: Suresh RainaFormer India cricketer Suresh Raina has backed India captain Rohit Sharma to repeat his 2019 ODI World Cup heroics in the upcoming ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australian-open-2025-carlos-alcaraz-reaches-quarterfinals-jack-draper-retires-2666920-2025-01-19",
      "headline": "Australian Open: Carlos Alcaraz through to quarters after Jack Draper retiresCarlos Alcaraz has reached the quarterfinals of the Australian Open 2025 as his opponent, Jack Draper, had to retire with injury after just 2 sets. Draper suffered a hip injury during the contest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shooting-olympic-medallist-manu-bhakers-maternal-grandmother-and-uncle-die-in-road-accident-2666912-2025-01-19",
      "headline": "Olympic medallist Manu Bhaker's grandmother and uncle die in road accidentParis Olympics 2024 medallist Manu Bhaker's maternal grandmother and uncle died in a road accident on Sunday, January 19. The accident happened in Charkhi Dadri, Haryana on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-champions-trophy-india-squad-snub-sanju-samson-kca-president-jayesh-george-2666899-2025-01-19",
      "headline": "Sanju Samson slammed by KCA president: Can't turn up only when you feel likeThe Kerala Cricket Association President Jayesh George has slammed Sanju Samson after it was believed that the wicketkeeper missed out on making it to the India squad for Champions Trophy since he was omitted from the state team's Vijay Hazare Trophy side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-coco-gauff-storms-into-quarterfinals-after-defeating-belinda-bencic-2666890-2025-01-19",
      "headline": "Australian Open: Coco Gauff downs Belinda Bencic to storm into quarterfinals Coco Gauff registered a stunning come-from-behind victory against Switzerland's Belinda Bencic and qualified to the quarter-finals of the Australian Open 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-could-repeat-his-2019-world-cup-heroics-in-champions-trophy-suresh-raina-2666927-2025-01-19",
      "headline": "Rohit can repeat his 2019 World Cup heroics in Champions Trophy: Suresh RainaFormer India cricketer Suresh Raina has backed India captain Rohit Sharma to repeat his 2019 ODI World Cup heroics in the upcoming ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australian-open-2025-carlos-alcaraz-reaches-quarterfinals-jack-draper-retires-2666920-2025-01-19",
      "headline": "Australian Open: Carlos Alcaraz through to quarters after Jack Draper retiresCarlos Alcaraz has reached the quarterfinals of the Australian Open 2025 as his opponent, Jack Draper, had to retire with injury after just 2 sets. Draper suffered a hip injury during the contest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shooting-olympic-medallist-manu-bhakers-maternal-grandmother-and-uncle-die-in-road-accident-2666912-2025-01-19",
      "headline": "Olympic medallist Manu Bhaker's grandmother and uncle die in road accidentParis Olympics 2024 medallist Manu Bhaker's maternal grandmother and uncle died in a road accident on Sunday, January 19. The accident happened in Charkhi Dadri, Haryana on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-champions-trophy-india-squad-snub-sanju-samson-kca-president-jayesh-george-2666899-2025-01-19",
      "headline": "Sanju Samson slammed by KCA president: Can't turn up only when you feel likeThe Kerala Cricket Association President Jayesh George has slammed Sanju Samson after it was believed that the wicketkeeper missed out on making it to the India squad for Champions Trophy since he was omitted from the state team's Vijay Hazare Trophy side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-coco-gauff-storms-into-quarterfinals-after-defeating-belinda-bencic-2666890-2025-01-19",
      "headline": "Australian Open: Coco Gauff downs Belinda Bencic to storm into quarterfinals Coco Gauff registered a stunning come-from-behind victory against Switzerland's Belinda Bencic and qualified to the quarter-finals of the Australian Open 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-d-gukesh-tata-steel-masters-opening-match-anish-giri-hikaru-nakamura-reaction-2666886-2025-01-19",
      "headline": "Gukesh defended resiliently: Nakamura praises World Champion after Giri winHikaru Nakamura praised world champion D Gukesh for overcoming adversity to win his opening match of the Tata Steel Masters against Anish Giri in the Netherlands on Sunday, January 19. Gukesh was able to win the match at the last moment as he quickly changed gears. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-harbhajan-singh-questions-significance-of-domestic-cricket-after-karun-nair-snub-2666879-2025-01-19",
      "headline": "Harbhajan questions significance of domestic cricket after Karun Nair's snubFormer India cricketer Harbhajan Singh has questioned the significance of domestic cricket after Karun Nair failed to find a place in India's Champions Trophy 2025 squad despite remarkable form in Vijay Hazare Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-on-this-day-rishabh-pant-shubman-gill-brisbane-test-gabba-2666860-2025-01-19",
      "headline": "On This Day: India breached Gabba fortress to win Border-Gavaskar TrophyRishabh Pant was the star of the run chase as India breached the Gabba fortress to secure a historic and memorable win against Australia in Brisbane on January 19, 2021. This helped India win the Border-Gavaskar Trophy 2-1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-shashi-tharoor-blames-kca-for-sanju-samsons-absence-from-champions-trophy-squad-2666857-2025-01-19",
      "headline": "Shashi Tharoor blames KCA for Sanju Samson's absence from Champions Trophy squadCongress MP Shashi Tharoor has blamed Kerala Cricket Association (KCA) for Sanju Samson's snub from the Champions Trophy 2025 squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/football-premier-league-liverpool-extend-lead-with-late-win-over-brentford-arsenal-held-2666851-2025-01-19",
      "headline": "Premier League: Liverpool extend lead with late win over Brentford, Arsenal heldLiverpool extended their lead at the top of the Premier League table with a 2-0 win over Brentford, while Arsenal were held to a 2-2 draw by Aston Villa at home on Saturday, January 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammad-rizwan-sledges-kevin-sinclair-during-pak-vs-wi-1st-test-2666849-2025-01-19",
      "headline": "Mohammad Rizwan sledges Kevin Sinclair during Multan Test: Come to the graveyardPakistan wicketkeeper batter Mohammad Rizwan was seen sledging West Indies batter Kevin Sinclair during day 2 of the first Test between the two teams in Multan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-aryna-sabalenka-reaches-quarterfinals-mirra-andreeva-2666845-2025-01-19",
      "headline": "Australian Open: Aryna Sabalenka reaches quarters by dominating Mirra AndreevaAryna Sabalenka swept aside the challenge from Mirra Andreeva with ease as she progressed to the quarterfinals of the Australian Open 2025 with a straight sets win on Sunday, January 19. Sabalenka defeated the Russian teenager in just 1 hour and 2 minutes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-shashi-tharoor-blames-kca-for-sanju-samsons-absence-from-champions-trophy-squad-2666857-2025-01-19",
      "headline": "Shashi Tharoor blames KCA for Sanju Samson's absence from Champions Trophy squadCongress MP Shashi Tharoor has blamed Kerala Cricket Association (KCA) for Sanju Samson's snub from the Champions Trophy 2025 squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/football-premier-league-liverpool-extend-lead-with-late-win-over-brentford-arsenal-held-2666851-2025-01-19",
      "headline": "Premier League: Liverpool extend lead with late win over Brentford, Arsenal heldLiverpool extended their lead at the top of the Premier League table with a 2-0 win over Brentford, while Arsenal were held to a 2-2 draw by Aston Villa at home on Saturday, January 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammad-rizwan-sledges-kevin-sinclair-during-pak-vs-wi-1st-test-2666849-2025-01-19",
      "headline": "Mohammad Rizwan sledges Kevin Sinclair during Multan Test: Come to the graveyardPakistan wicketkeeper batter Mohammad Rizwan was seen sledging West Indies batter Kevin Sinclair during day 2 of the first Test between the two teams in Multan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-aryna-sabalenka-reaches-quarterfinals-mirra-andreeva-2666845-2025-01-19",
      "headline": "Australian Open: Aryna Sabalenka reaches quarters by dominating Mirra AndreevaAryna Sabalenka swept aside the challenge from Mirra Andreeva with ease as she progressed to the quarterfinals of the Australian Open 2025 with a straight sets win on Sunday, January 19. Sabalenka defeated the Russian teenager in just 1 hour and 2 minutes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-coldplays-chris-martin-mentions-jasprit-bumrah-during-mumbai-concert-video-2666841-2025-01-19",
      "headline": "Watch: Coldplay's Chris Martin mentions Jasprit Bumrah during Mumbai concertColdplay's Chris Martin excited the fans with a special shoutout to India pacer Jasprit Bumrah during the concert in Mumbai on  Saturday, January 18. Martin joked that Bumrah wanted to play cricket with him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-day-8-live-updates-aryna-sabalenka-novak-djokovic-carlos-alcaraz-2666813-2025-01-18",
      "headline": "Day 8 Live Updates: Djokovic beats Lehecka, Zverev into quartersAustralian Open 2025, Day 8 Live Updates: Novak Djokovic has beaten Jiri Lehecka in the 4th round clash. The winner of this match will face Carlos Alcaraz in the next round. Alcaraz secured the win in the 4th round as Jack Draper was forced to retire after 2 sets. The British star struggled with the knock for the entirety of the second set and decided not to continue for the third one. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-novak-djokovic-coco-gauff-aryna-sabalenka-carlos-alcaraz-2666806-2025-01-18",
      "headline": "Australian Open 2025, Day 8: Djokovic, Sabalenka, Alcaraz in actionAustralian Open 2025: Aryna Sabalenka, Novak Djokovic, Coco Gauff and Carlos Alcaraz are the top seeds in action at Melbourne Park on Sunday. Rohan Bopanna will also partner China's Shuai Zhang in their second round match of mixed doubles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-t20-world-cup-2025-india-vs-west-indies-live-streaming-2666798-2025-01-18",
      "headline": "U19 Women's T20 World Cup, India vs West Indies: When and where to watchU19 Women's T20 World Cup 2025: Niki Prasad's India will begin their campaign on Sunday, January 19 against Samara Ramnath's West Indies at the Bayuemas Oval in Kuala Lumpur."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}