{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oxford-india-forum-2025-business-leaders-policymakers-entrepreneurs-kalli-purie-isro-ai-2751203-2025-07-05",
      "headline": "Oxford India Forum 2025 celebrates India's rising influence, youthful ambitionThe Oxford India Forum 2025 brought together a dynamic mix of business leaders, policymakers, entrepreneurs, academics and students to reflect on India's evolving global role and the path forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/the-great-indian-salary-crisis-middle-class-unemployment-job-loss-268-04-07-2025",
      "headline": "The Great Indian Salary CrisisWhite-collar employees in India are caught in a salary spiral where costs keep climbing, pay moves slowly, and financial stability slips further away. On paper, the economy is booming, but the pay cheques of working middle-class Indians tell a very different story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-proposes-retaliatory-duties-at-world-trade-body-against-us-tariffs-on-autos-2750911-2025-07-04",
      "headline": "India proposes retaliatory duties at world trade body against US tariffs on autosIndia has proposed to impose an equivalent amount of duty collected from products originating in the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/real-estate-vs-mutual-funds-where-should-you-invest-explains-stock-market-expert-2750826-2025-07-04",
      "headline": "Real Estate vs Mutual Funds: Where should you invest, explains stock market expertOwning a house was once every family's dream, but times have changed. With high prices and new ways to invest, is real estate still smart, or are mutual funds better? A stock market expert explains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/video/ankur-mehra-book-pixels-to-profits-creators-must-think-like-startups-not-influencers-2750822-2025-07-04",
      "headline": "Ankur Mehra says creators must think like startups, not influencersAnkur Mehra, in his new book Pixels to Profits, urges creators to stop chasing follower counts and instead build sustainable, multi-platform businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/success-isnt-about-number-of-followers-in-creator-economy-ankur-mehra-2750781-2025-07-04",
      "headline": "Success isn't about number of followers in creator economy: Ankur MehraIn a conversation with Business Today's Sakshi Batra, Ankur Mehra, author of Pixels to Profits, explains what it really takes to succeed in the creator economy, and why chasing viral fame or follower counts may be the wrong metric altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-192-points-higher-nifty-below-25500-infosys-gains-1-percent-2750774-2025-07-04",
      "headline": "Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/prada-kolhapuri-chappal-gi-tag-law-protection-indian-articrafts-artisans-reform-global-policy-fashion-2750757-2025-07-04",
      "headline": "India tags it, West sells it. Can Prada's Kolhapuri row lead to real reform?The luxury brand's new \"toe-ring sandal\" has ignited not just cultural outrage but also legal action in India, with a Public Interest Litigation filed in the Bombay High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-itr-2-and-itr-3-forms-why-they-are-missing-and-what-to-do-income-tax-filing-2750711-2025-07-04",
      "headline": "Where are ITR-2 and ITR-3 forms? Why they're missing and what to doIt's ITR season but many taxpayers can't find the ITR-2 and ITR-3 forms on the Income Tax portal yet. If you have capital gains, foreign income or business income, this delay might worry you. The good news is there's an extended deadline this year. Here's why these forms are missing and what you should do next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sbi-credit-card-rules-changing-from-july-15-here-is-what-cardholders-must-know-2750616-2025-07-04",
      "headline": "SBI credit card rules changing from July 15: Here's what cardholders must knowAt present, many cardholders pay only a small part of their bill to avoid late charges. But now, the way the minimum amount due (MAD) is calculated will change starting July 15, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/exclusive-world-bank-poverty-in-india-measurement-metrics-one-in-four-below-minimum-standard-of-living-2750607-2025-07-04",
      "headline": "One in 4 Indians still below minimum standard of living: World BankDespite a sharp drop in extreme poverty, about one in four Indians still falls below the level needed to meet essential needs and maintain a minimum standard of living."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-ban-jane-street-stock-manipulation-bank-nifty-options-futures-shorting-reason-interim-order-2750597-2025-07-04",
      "headline": "Sebi bans Jane Street for stock market manipulation. Here's what went wrongUS Trading Firm Jane Street: Securities and Exchange Board of India (Sebi) said the trades executed by the group were \"prima facie fraudulent and manipulative\" and violated the country's capital market regulations."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suresh-raina-tamil-cinema-debut-production-no-1-chennai-spirit-2751357-2025-07-05",
      "headline": "Suresh Raina to debut with Tamil film Production No 1: Chennai's spirit with meFormer international cricketer Suresh Raina is all set to make his acting debut with 'Production No 1'. The announcement about Raina's Tamil film was made at a grand event in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-ajay-devgn-clash-with-yrf-son-of-sardaar-felt-helpless-2751336-2025-07-05",
      "headline": "Kajol on Ajay Devgn's clash with YRF over Son of Sardaar: I felt helplessActor Kajol recently recalled how Ajay Devgn's clash with Yash Raj Films over 'Son of Sardaar' (2012) release impacted her. She opened up on how she dealt with it as someone connected to both Ajay and Aditya Chopra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-wipes-instagram-feed-clean-before-40-birthday-dhurandhar-update-aditya-dhar-2751292-2025-07-05",
      "headline": "Ranveer Singh wipes his Instagram feed clean a day before birthday, builds intrigueIn a surprising move, actor Ranveer Singh has cleared his Instagram feed a day before his 40th birthday. This sudden move has left fans speculating the reason behind the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ghaati-release-anushka-shetty-postponed-action-thriller-vikram-prabhu-2751282-2025-07-05",
      "headline": "Anushka Shetty's Ghaati release gets postponed again, producers issue statementThe release date of actor Anushka Shetty's action-drama 'Ghaati' has been postponed yet again. The producers confirmed the same in an official statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-on-paparazzi-culture-nysa-yug-too-young-when-paps-began-chasing-her-2751285-2025-07-05",
      "headline": "Kajol on paparazzi culture: Nysa was too young when paps began chasing herKajol, in a recent interview, opened up about the constant glare of paparazzi and how she's guided her children, Nysa and Yug, to cope with it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-sethupathi-apologises-son-surya-viral-video-controversy-phonenix-release-2751231-2025-07-05",
      "headline": "Vijay Sethupathi apologises over son Surya's viral video: May be unintentionalVijay Sethupathi addressed a recent controversy involving his son Surya at the 'Phoenix' premiere. He offered his clarification on the matter and also apologised to people who were hurt in case of misunderstandings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/freida-pinto-backs-deepika-padukone-hollywood-walk-of-fame-2751204-2025-07-05",
      "headline": "Freida Pinto backs Deepika's spot on Hollywood Walk of Fame: No need for debateActor Freida Pinto recently reacted to Deepika Padukone being named as one of the honouries on the Hollywood Walk of Fame. She slammed the criticism over the same and asked people to take pride in celebrating the South Asian community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/naseeruddin-shah-clarifies-post-backing-diljit-dosanjh-sardaar-ji-3-row-was-taken-down-by-facebook-2751257-2025-07-05",
      "headline": "Naseeruddin Shah says post backing Diljit Dosanjh was taken down by FacebookVeteran actor Naseeruddin Shah recently revealed that his post supporting Diljit Dosanjh amid the 'Sardaar Ji 3' controversy was taken down by Facebook. Shah had earlier shared a strong statement backing the Punjabi actor-singer for proceeding with the release of his film despite the backlash.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sona-mohapatra-on-kaanta-laga-row-questions-paid-pr-and-milking-shefalis-death-2751220-2025-07-05",
      "headline": "Sona Mohapatra on Kaanta Laga row, questions paid PR and milking Shefali's deathSinger Sona Mohapatra reacted to the backlash after her post calling out 'Kaanta Laga' makers. She had slammed the creators of the track for passing off the song as theirs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-kisses-priyanka-chopra-enjoys-fireworks-celebrate-4th-of-july-in-new-york-2751160-2025-07-05",
      "headline": "Nick kisses Priyanka, enjoys fireworks as they celebrate 4th of July in New YorkNick Jonas and Priyanka Chopra had a great time celebrating the Fourth of July in New York. The two witnessed fireworks as they took part in the grand celebrations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-basu-kartik-aaryan-sreeleela-film-shooting-update-title-announcement-2751165-2025-07-05",
      "headline": "Anurag Basu shares update on Kartik Aaryan-Sreeleela film, title announcement soonDirector Anurag Basu recently shared an update on the shooting schedule of his upcoming film with Kartik Aaryan and Sreeleela. He also discussed the film's title announcement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/move-over-ott-how-big-screen-exclusives-could-spark-cinema-grand-comeback-aamir-khan-sitaare-zameen-par-thug-life-2750767-2025-07-05",
      "headline": "Why Bollywood's OTT detox might just get audience back to theatresThe exclusive screening of films in theatres has sparked industry-wide discussion about the future of cinema. While exhibitors and multiplex owners praised the move for reviving the lost glory of the big screen, some producers and trade experts remain cautious, citing the importance of OTT and satellite revenue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shoaib-ibrahim-says-dipika-kakar-cancer-stage-2-liver-can-recur-treatment-may-take-2-years-2751137-2025-07-05",
      "headline": "Shoaib Ibrahim says Dipika Kakar's cancer can recur, treatment may take 2 yearsActor Shoaib Ibrahim recently revealed that his wife Dipika Kakar's cancer can recur after surgery. He even updated fans about her medication and further treatment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-box-office-day-1-anurag-basu-aditya-roy-kapur-sara-ali-khan-film-off-to-a-decent-start-2751125-2025-07-05",
      "headline": "Metro In Dino box office Day 1: Anurag Basu's film is off to a decent startFilmmaker Anurag Basu's 'Metro In Dino' boasting a star-studded cast, hit theatres on July 4. The film, which opened to rave reviews, collected Rs 3.35 crore on its opening day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-offers-rs-50-lakh-aid-for-fish-venkats-kidney-transplant-2751110-2025-07-05",
      "headline": "Prabhas offers Rs 50 lakh aid for actor Fish Venkat's kidney transplantActor Prabhas has promised financial assistance to veteran comedian Fish Venkat, who is currently battling for his life in the ICU and urgently needs a kidney transplant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-julian-mcmahon-dies-at-56-after-long-battle-with-cancer-glbs-2751075-2025-07-05",
      "headline": "Actor Julian McMahon dies at 56 after long battle with cancerJulian McMahon, known for Nip/Tuck, Charmed, and Fantastic Four, has died at 56 after battling cancer. The actor was celebrated for his versatility, charisma, and beloved roles in TV and film.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-becomes-most-followed-on-spotify-beats-taylor-swift-and-ed-sheeran-2750928-2025-07-04",
      "headline": "Arijit Singh becomes most followed on Spotify, beats Taylor Swift and Ed SheeranArijit Singh has become the most followed artist on Spotify with 151 million followers, surpassing global stars like Taylor Swift and Ed Sheeran. Despite having fewer monthly listeners, his follower count reflects a strong and dedicated global fan base."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sandeep-reddy-vanga-spirit-begin-in-september-prabhas-to-join-later-2750925-2025-07-04",
      "headline": "Spirit: Sandeep Reddy Vanga to begin shooting in September, Prabhas to join laterFilming of 'Spirit' begins in September 2025, with Prabhas to join the set in November. The actor will star alongside Triptii Dimri in the upcoming film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/munawar-faruqui-on-secret-wedding-with-mehzabeen-coatwala-2750921-2025-07-04",
      "headline": "Munawar Faruqui on secret wedding with Mehzabeen Coatwala: It was for my sonMunawar Faruqui shared that his decision to marry Mehzabeen Coatwala was driven by his desire to live with his son, Mikael. The wedding, kept private, happened just a month after the decision and within five months of knowing Mehzabeen."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/raj-thackeray-uddhav-thackeray-victory-rally-mumbai-unity-alliance-local-polls-2751366-2025-07-05",
      "headline": "Thackeray brothers reunite after 2 decades: Show of unity or prelude to alliance?The Mumbai rally, though described as apolitical, was steeped in the rhetoric of Marathi identity and pride, a cornerstone of the political legacies of the families of Raj Thackeray and Uddhav Thackeray."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-akash-deep-edgbaston-rishabh-pant-2751410-2025-07-05",
      "headline": "Shubman Gill, Akash Deep dismantle England as India smell victory at EdgbastonIndia completely dominated proceedings on Day 4 of the second Test against England as captain Shubman Gill led from the front with his marvellous innings of 161. Later, Akash Deep dismantled the England's top order before stumps with a menacing new-ball spell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neeraj-chopra-classic-results-standing-rumesh-pathirage-2751383-2025-07-05",
      "headline": "In windy Bengaluru, Neeraj Chopra wins NC Classic, Sri Lanka's Rumesh shinesNeeraj Chopra fought off the swirling winds and a spirited Rumesh Tharanga Pathirage to win the inaugural Neeraj Chopra Classic on Saturday, July 5. Neeraj dominated the competition from Round 3, taking home the win at the Sree Kanteerava Stadium in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/take-it-or-leave-it-trump-tariff-letters-to-12-countries-ready-for-send-off-2751367-2025-07-05",
      "headline": "Take it or leave it: Trump's tariff letters to 12 countries ready for send-offUS President Donald Trump has signed letters to 12 countries outlining the tariff levels they would face on goods exported to the United States. The letters are scheduled to be sent out on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/from-hired-to-fired-tech-founder-reveals-how-soham-parekh-operated-and-hints-at-how-he-fooled-companies-2751290-2025-07-05",
      "headline": "Tech founder reveals how Soham Parekh operated and how he fooled companiesYet another story from Soham Parekh's controversy is out. Dhruv Amin, co-founder of AI startup Create, reveals Parekh came to work only once and frequently missed meetings, and delayed deliverables. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-chief-minister-mk-stalin-lauds-thackerays-rally-says-fight-against-hindi-imposition-continues-2751403-2025-07-05",
      "headline": "MK Stalin, battling 'Hindi imposition' in Tamil Nadu, finds allies in ThackeraysThe Tamil Nadu Chief Minister spoke about the victory rally held in Mumbai under Uddhav Thackeray's leadership and said the war waged by the DMK against \"Hindi imposition\" has now transcended state boundaries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-man-hides-drugs-behind-gods-portraits-performs-puja-to-avoid-suspicion-arrested-2751308-2025-07-05",
      "headline": "Man hides drugs behind god's portraits, performs puja to avoid suspicion, arrestedThe accused was caught hiding cannabis behind the photo frames of Hindu gods. He even used to perform pooja to avoid getting caught. Police found 10 kgs of cannabis concealed in newspaper rolls behind the portraits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-6-live-score-results-jannik-sinner-novak-djokovic-2751250-2025-07-05",
      "headline": "Wimbledon Day 6 Highlights: Djokovic into Round 4, Barbora Krejcikova eliminatedWimbledon Highlights, Day 6: Jannik Sinner advanced to the fourth round after beating Pedro Martinez in straight sets. 18-year-old Mirra Andreeva is through to the fourth round at SW19 after beating Hailey Baptiste of the United States in straight sets. Defending champion Barbora Krejcikova knocked out after losing to Emma Navarro. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/melania-trump-donald-trump-signature-ymca-dance-white-house-balcony-2751396-2025-07-05",
      "headline": "Melania mimics Trump's iconic YMCA dance during 4th of July celebrationsUS First Lady Melania Trump waved her palms up and bounced on her feet on the balcony of the White House as President Donald Trump adoringly watched on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dalai-lama-90th-birth-anniversary-says-wants-to-live-more-thirty-forty-years-2751361-2025-07-05",
      "headline": "Hope to live for 30-40 years more: Dalai Lama on eve of 90th birthdaySpeaking at the long-life prayer ceremony ahead of his 90th birth anniversary on Sunday at Tsuglagkhang, the main Dalai Lama temple in McLeodganj, Tenzin Gyatso said that he has \"clear signs and indications\" that the blessings of the Avalokiteshvara are with him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-first-batter-to-score-200-and-150-in-the-same-test-2751401-2025-07-05",
      "headline": "Shubman Gill becomes first batter to score 200 and 150 in the same TestIndia captain Shubman Gill etched his name in the record books as he became the first batter in the history of the game to score a double hundred and 150 in the same Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-rudali-speech-jibe-uddhav-thackeray-mumbai-rally-raj-thackeray-maharashtra-marathi-2751329-2025-07-05",
      "headline": "Devendra Fadnavis's 'Thank You' jab after Raj Thackeray credits him for reunionMaharashtra Chief Minister Devendra Fadnavis sarcastically thanked Raj Thackeray for crediting him with reuniting the Thackeray cousins. He mocked their rally, calling it a \"rudali\" speech instead of a victory celebration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-classic-attendance-bengaluru-thomas-rohler-kanteerva-2751414-2025-07-05",
      "headline": "Neeraj Chopra Classic: Never seen 15,000 people for javelin, says Thomas RohlerIn an exclusive interaction with India Today, Thomas Rohler said he was thrilled to see the fans turn up for the inaugural Neeraj Chopra Classic on Saturday, July 5. Neeraj secured the top spot in the first-of-its-kind event that turned out to be a big success. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/move-over-ott-how-big-screen-exclusives-could-spark-cinema-grand-comeback-aamir-khan-sitaare-zameen-par-thug-life-2750767-2025-07-05",
      "headline": "Why Bollywood's OTT detox might just get audience back to theatresThe exclusive screening of films in theatres has sparked industry-wide discussion about the future of cinema. While exhibitors and multiplex owners praised the move for reviving the lost glory of the big screen, some producers and trade experts remain cautious, citing the importance of OTT and satellite revenue. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/last-message-of-upsc-aspirant-kumar-dhirendra-pratap-who-died-in-vishal-mega-mart-fire-2751349-2025-07-05",
      "headline": "Bhaiya, do something: Last message of UPSC aspirant who died in Delhi mall fireKumar Dhirender Pratap, a 25-year-old UPSC aspirant from Uttar Pradesh's Sonbhadra who had been living in Delhi for five years, died in the fire that broke out at Vishal Mega Mart in Karol Bagh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/thai-lion-airs-boeing-737-flight-grounded-at-kolkata-airport-after-tech-snag-2751374-2025-07-05",
      "headline": "Thai Lion Air's Boeing 737 flight grounded at Kolkata airport after tech snagThe Boeing 737-800 aircraft landed at Kolkata airport around 1.23 am with 151 passengers on board and was supposed to take off at 2.35 am for Bangkok's Don Mueang International Airport (DMK)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-wipes-instagram-feed-clean-before-40-birthday-dhurandhar-update-aditya-dhar-2751292-2025-07-05",
      "headline": "Ranveer Singh wipes his Instagram feed clean a day before birthday, builds intrigueIn a surprising move, actor Ranveer Singh has cleared his Instagram feed a day before his 40th birthday. This sudden move has left fans speculating the reason behind the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-502-04-07-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/digital-misinformation-how-mamata-banerjees-call-to-action-puts-ball-in-amit-shahs-court-2750948-2025-07-04",
      "headline": "Digital misinformation: How Mamata's call to action puts ball in Amit Shah's courtWhether the Centre responds with the urgency the Bengal CM demands remains to be seen. What is undeniable is the social, legal and political costs of inaction"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nihal-modi-brother-of-fugitive-economic-offender-nirav-modi-arrested-in-us-in-bank-fraud-case-2751253-2025-07-05",
      "headline": "Nehal Modi, brother of fugitive Nirav Modi, arrested in US in bank fraud caseNehal Modi, a Belgian national, was taken into custody following an extradition request by India, the US Justice Department said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/the-great-indian-salary-crisis-middle-class-unemployment-job-loss-268-04-07-2025",
      "headline": "The Great Indian Salary CrisisWhite-collar employees in India are caught in a salary spiral where costs keep climbing, pay moves slowly, and financial stability slips further away. On paper, the economy is booming, but the pay cheques of working middle-class Indians tell a very different story."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/f-35-fighter-jet-british-royal-navy-engineers-team-thiruvananthapuram-airport-kerala-2751278-2025-07-05",
      "headline": "Repair or repatriate? UK technicians to examine stranded F-35 in Kerala tomorrowA team of around 25 technicians from the UK is expected to arrive in Thiruvananthapuram on Sunday to assess the stranded F-35 fighter jet of the Royal Navy. The jet has been stranded for three weeks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tamil-nadu-custodial-death-ajith-kumar-karti-chidambaram-exclusive-interview-2751319-2025-07-05",
      "headline": "Training of cops needed: Karti Chidambaram on Tamil Nadu custodial deathReacting to the autopsy report of a Tamil Nadu temple security guard who died allegedly in police custody last month, Congress MP Karti Chidambaram said it was gravely distressing and called for sensitisation of police forces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/nitin-gadkaris-app-cab-reform-drivers-to-get-care-customer-is-the-king-2750893-2025-07-04",
      "headline": "Nitin Gadkari's app-cab reform: Drivers to get care, customer is the kingThe Motor Vehicles Aggregator Guidelines 2025 promise to be the difference between whether a cab ride ends with a grin or the familiar groan, but will states play ball?"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/video/neeraj-chopra-on-roles-of-organiser-participant-in-nc-classic-pressure-was-different-2751418-2025-07-05",
      "headline": "Double delight: Neeraj Chopra on success as host and athlete at NC ClassicIn an exclusive chat with India Today Digital, double Olympic medallist Neeraj Chopra opened up on the pressure of organising and taking part in the Neeraj Chopra Classic. On Saturday, July 5, Neeraj won the inaugural edition of the championship with a throw of 86.18m at the Sree Kanteerava Stadium in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-stat-pack-birmingham-records-2751416-2025-07-05",
      "headline": "Shubman Gill breaks 54-year-old record with 161 in Birmingham: Stat PackENG vs IND: Shubman Gill scored 430 runs as India set England a huge target of 608 to chase down in the fourth innings of the second Test at the Edgbaston in Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-akash-deep-edgbaston-rishabh-pant-2751410-2025-07-05",
      "headline": "Shubman Gill, Akash Deep dismantle England as India smell victory at EdgbastonIndia completely dominated proceedings on Day 4 of the second Test against England as captain Shubman Gill led from the front with his marvellous innings of 161. Later, Akash Deep dismantled the England's top order before stumps with a menacing new-ball spell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-classic-attendance-bengaluru-thomas-rohler-kanteerva-2751414-2025-07-05",
      "headline": "Neeraj Chopra Classic: Never seen 15,000 people for javelin, says Thomas RohlerIn an exclusive interaction with India Today, Thomas Rohler said he was thrilled to see the fans turn up for the inaugural Neeraj Chopra Classic on Saturday, July 5. Neeraj secured the top spot in the first-of-its-kind event that turned out to be a big success. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-virat-kohli-shubman-gill-birmingham-2751409-2025-07-05",
      "headline": "Well played star boy: Kohli in awe of Shubman on record-breaking 2nd TestENG vs IND: Virat Kohli, who retired from Test cricket back in May, heaped praise on Shubman Gill, who became only the third Indian captain to score back-to-back hundreds in the same Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-first-batter-to-score-200-and-150-in-the-same-test-2751401-2025-07-05",
      "headline": "Shubman Gill becomes first batter to score 200 and 150 in the same TestIndia captain Shubman Gill etched his name in the record books as he became the first batter in the history of the game to score a double hundred and 150 in the same Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-chasing-records-jamie-smith-birmingham-test-video-2751398-2025-07-05",
      "headline": "Rishabh Pant responds to England's on-field antics: Not greedy for recordsRishabh Pant showcased his commitment to team by clarifying toi Jamie Smith that he does not chase records, if it happens, it happens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neeraj-chopra-classic-results-standing-rumesh-pathirage-2751383-2025-07-05",
      "headline": "In windy Bengaluru, Neeraj Chopra wins NC Classic, Sri Lanka's Rumesh shinesNeeraj Chopra fought off the swirling winds and a spirited Rumesh Tharanga Pathirage to win the inaugural Neeraj Chopra Classic on Saturday, July 5. Neeraj dominated the competition from Round 3, taking home the win at the Sree Kanteerava Stadium in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-jannik-sinner-pedro-martinez-mirra-andreeva-2751378-2025-07-05",
      "headline": "Jannik Sinner crushes Pedro Martinez, Mirra Andreeva into Round 4Wimbledon 2025: Jannik Sinner and Mirra Andreeva booked their berths in the Round of 16 at SW19. India's N Sriram Balaji failed to qualify for the third round of the men's doubles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-scores-most-runs-by-indian-batter-in-a-test-match-2751368-2025-07-05",
      "headline": "Gill scores most runs by Indian batter in a Test after twin 100s at EdgbastonIndia Test captain Shubman Gill etched his name in history books with twin centuries during the second Test against England at Edgbaston, Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-first-batter-to-score-200-and-150-in-the-same-test-2751401-2025-07-05",
      "headline": "Shubman Gill becomes first batter to score 200 and 150 in the same TestIndia captain Shubman Gill etched his name in the record books as he became the first batter in the history of the game to score a double hundred and 150 in the same Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-chasing-records-jamie-smith-birmingham-test-video-2751398-2025-07-05",
      "headline": "Rishabh Pant responds to England's on-field antics: Not greedy for recordsRishabh Pant showcased his commitment to team by clarifying toi Jamie Smith that he does not chase records, if it happens, it happens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neeraj-chopra-classic-results-standing-rumesh-pathirage-2751383-2025-07-05",
      "headline": "In windy Bengaluru, Neeraj Chopra wins NC Classic, Sri Lanka's Rumesh shinesNeeraj Chopra fought off the swirling winds and a spirited Rumesh Tharanga Pathirage to win the inaugural Neeraj Chopra Classic on Saturday, July 5. Neeraj dominated the competition from Round 3, taking home the win at the Sree Kanteerava Stadium in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-jannik-sinner-pedro-martinez-mirra-andreeva-2751378-2025-07-05",
      "headline": "Jannik Sinner crushes Pedro Martinez, Mirra Andreeva into Round 4Wimbledon 2025: Jannik Sinner and Mirra Andreeva booked their berths in the Round of 16 at SW19. India's N Sriram Balaji failed to qualify for the third round of the men's doubles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-scores-most-runs-by-indian-batter-in-a-test-match-2751368-2025-07-05",
      "headline": "Gill scores most runs by Indian batter in a Test after twin 100s at EdgbastonIndia Test captain Shubman Gill etched his name in history books with twin centuries during the second Test against England at Edgbaston, Birmingham."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}