{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/should-you-be-paying-house-rent-with-credit-card-2762579-2025-07-28",
      "headline": "Should you be paying rent with credit card?More and more people are using credit cards to pay rent. But does the benefit of extra days to pay and cashback outweigh the fees and credit score impact? Let's break it down."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-572-points-lower-nifty-below-24700-kotak-bank-down-7-percent-2762509-2025-07-28",
      "headline": "Sensex ends 572 points lower, Nifty below 24,700; Kotak Bank down 7%The S&P BSE Sensex lost 572.07 points to end at 80,891.02, while the NSE Nifty50 was down by 156.10 points to close at 24,680.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/5-upcoming-ipos-nsdl-mb-engineering-sri-lotus-aditya-infotech-laxmi-india-finance-rs-7000-crore-details-2762504-2025-07-28",
      "headline": "5 IPOs worth Rs 7,000 crore to open for bidding this week. Check detailsThis week, five mainboard IPOs are opening for bidding: NSDL (National Securities Depository), M&B Engineering, Sri Lotus Developers & Realty, Aditya Infotech, and Laxmi India Finance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-regime-vs-new-which-can-help-you-save-money-in-fy25-2762473-2025-07-28",
      "headline": "Can opting for old regime help you save tax in FY25?Many believe that under the new tax regime, there is no tax on income up to Rs 12 lakh. However, this change will only take effect from April 1, 2025, and will apply to returns filed for the FY26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/edelweiss-radhika-gupta-slams-dior-for-ignoring-indian-artisans-behind-200k-coat-2762481-2025-07-28",
      "headline": "Edelweiss' Radhika Gupta slams Dior for ignoring Indian artisans behind $200K coatThe luxury brand Dior showcased a $200K coat adorned with traditional Lucknowi 'mukaish' embroidery. While 12 Indian artisans spent 34 days crafting it, their names, and India's contribution, went unacknowledged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-layoffs-ai-automation-or-not-ceo-k-krithivasan-statement-skill-mismatch-2762417-2025-07-28",
      "headline": "Is TCS cutting jobs because of AI? Here's what CEO K Krithivasan saysTCS CEO K Krithivasan said that the company is still looking for highly skilled professionals, especially those who can support TCS's plans to expand into new technologies and markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-homeowners-need-to-know-about-house-property-tax-rules-explains-tax-advisor-2762379-2025-07-28",
      "headline": "What homeowners need to know about house property tax rules, explains tax advisorBuying a home comes with more than just EMIs and maintenance; it brings tax implications too. Sujit Bangar, Founder of TaaxBuddy.com, breaks down the key rules every homeowner should be aware of to avoid surprises during filing season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-income-tax-bill-2025-3-key-changes-that-could-make-itr-filing-easier-2762342-2025-07-28",
      "headline": "New Income Tax Bill 2025: 3 key changes that could make ITR filing easierThe committee submitted its report to Parliament on 21 July. It's over 4,500 pages long and includes 285 suggestions to improve the draft New Income Tax Bill, 2025, which is meant to replace the old 1961 Act. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/blusmart-wallet-refund-90-day-period-lapse-app-not-working-fraud-sebi-jaggi-brothers-2762313-2025-07-28",
      "headline": "Have you got your BluSmart refund yet? It's been 90 daysBluSmart wallet refund: As July comes to an end, users say they have not received their money back and are struggling to even access the app."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/kotak-mahindra-bank-share-price-decline-reason-q1-results-analyst-views-2762288-2025-07-28",
      "headline": "Explained: Why Kotak Mahindra Bank share price fell over 6% todayThe decline came after the private lender posted a weaker-than-expected set of results for the April–June quarter. The stock decline comes in the wake of a 7% year-on-year drop in standalone net profit to Rs 3,282 crore, even though the bank reported steady growth in core lending activity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-over-300-points-lower-nifty-below-24800-kotak-bank-down-4-percent-2762275-2025-07-28",
      "headline": "Sensex opens over 300 points lower, Nifty below 24,800; Kotak Bank down 4%The S&P BSE Sensex was down by 225.28 points to 81,237.81, while the NSE Nifty50 lost 43.60 points to 24,793.40 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-chip-deal-tesla-usd-165-billion-deal-share-price-jump-ai-2762270-2025-07-28",
      "headline": "Samsung to power Tesla's future with $16.5 billion chip deal: ReportThis long-term contract comes at a crucial time for Samsung. While the company is one of the world's biggest makers of memory chips, its foundry business, which produces chips for other companies, has struggled to keep up with demand and competition."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/saiyaara-singer-faheem-abdullah-partners-with-bhushan-kumar-t-series-new-music-projects-2762682-2025-07-28",
      "headline": "Saiyaara singer Faheem Abdullah collaborates with T-Series for new music projects'Saiyaara' singer Faheem Abdullah is all set for new beginnings in his music career. The singer-songwriter-composer has partnered with Bhushan Kumar's T-Series for his future music projects.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashmah-makers-begged-disha-vakani-to-return-says-co-star-jennifer-mistry-2762680-2025-07-28",
      "headline": "Taarak Mehta makers begged Disha Vakani to return, co-star Jennifer Mistry opens upActor Jennifer Mistry Bansiwal, best known as Roshan from 'Taarak Mehta Ka Ooltah', shed light on Disha Vakani's exit from the show. She also revealed the behind-the-scenes efforts to bring her back."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zee5-bakaiti-middle-class-family-drama-sheeba-chaddha-rajesh-tailang-2762657-2025-07-28",
      "headline": "Bakaiti trailer: Rajesh Tailang, Sheeba Chaddha navigate middle-class strugglesThe upcoming show 'Bakaiti' on ZEE5, is a slice-of-life story about a middle-class family in Ghaziabad. The series highlights everyday struggles and unspoken love in a household while dealing with chaos and generational tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-private-instagram-grabs-attention-amid-saiyaara-craze-2762655-2025-07-28",
      "headline": "Ahaan Panday's private Instagram grabs attention amid Saiyaara craze'Saiyaara' actor Ahaan Panday's potential private Instagram account has come to light. The account is followed by popular celebrities like Ananya Panday and Khushi Kapoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-swades-behind-the-scenes-pics-surface-after-20-years-2762635-2025-07-28",
      "headline": "20 years later, Shah Rukh Khan's Swades BTS pics go viral, fans get nostalgicThrowback BTS photos from Shah Rukh Khan's film 'Swades' have gone viral, bringing back memories for fans. People praised the film for showing Indian culture and said it should be released in theatres again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tanishk-bagchi-denies-saiyaara-copying-one-direction-jubin-nautiyal-global-hit-2762639-2025-07-28",
      "headline": "Tanishk Bagchi denies Saiyaara track being copiedTanishk Bagchi denies allegations of copying tunes for 'Saiyaara' from One Direction and Jubin Nautiyal. The original Hindi track's global chart success challenges his image as just a recreation composer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-shares-playful-video-with-mother-in-law-shaadi-ke-side-effects-2762617-2025-07-28",
      "headline": "Hina Khan shares funny video with mother-in-law on shaadi ke side effectsActor Hina Khan shared a light-hearted video showcasing her relationship with her mother-in-law on Instagram. She playfully mentioned in the caption that the video is about the side effects of marriage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mahesh-bhatt-calls-alia-bhatt-self-made-actor-says-ranbir-kapoor-is-laid-back-2762586-2025-07-28",
      "headline": "Mahesh Bhatt says Alia is self-made, calls Ranbir laid-back: She is a go-getterVeteran producer-director Mahesh Bhatt recently called his daughter Alia Bhatt a self-made actor. Apart from Alia, he also shared his views on why son-in-law Ranbir Kapoor is a laid-back actor. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parmeet-sethi-recalls-marital-struggles-with-archana-puran-singh-it-was-very-tense-2762626-2025-07-28",
      "headline": "Parmeet Sethi recalls marital struggles with Archana Puran Singh: It was very tenseActor Parmeet Sethi opened up about his personal and marital struggles. He credited the Art of Living course for helping him find emotional peace during tough times with his wife Archana Puran Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/john-abraham-hugs-allu-arjun-fan-who-imitated-pushpa-raj-from-film-pushpa-2762580-2025-07-28",
      "headline": "John Abraham hugs fan imitating Allu Arjun's Pushpa Raj, video goes viralJohn Abraham recently met a fan dressed as Pushpa Raj from Allu Arjun's film 'Pushpa'. The actor was so impressed by his act that he hugged him, and the video quickly went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-re-release-trimmed-scenes-improved-vfx-pawan-kalyan-telugu-film-2762527-2025-07-28",
      "headline": "Hari Hara Veera Mallu poor VFX edited: Fans wonder why wasn't it done earlierActor Pawan Kalyan's epic-action-drama 'Hari Hara Veera Mallu: Part 1—Sword vs Spirit' was re-released in theatres with trimmed scenes and enhanced VFX. The changes caught the attention of movie-goers who questioned why it wasn't done earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mallika-sherawat-sets-record-straight-says-not-doing-bigg-boss-19-and-never-will-2762572-2025-07-28",
      "headline": "Mallika Sherawat sets record straight, says not doing Bigg Boss 19 and never willActor Mallika Sherawat confirmed on Monday that she will not be joining 'Bigg Boss 19'. She addressed rumours on her Instagram story, stating that she will never be seen on the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-seeks-blessings-from-lord-shiva-at-mahakaleshwar-temple-shares-pics-2762593-2025-07-28",
      "headline": "Rupali Ganguly seeks blessings from Lord Shiva at Mahakaleshwar temple, shares pics Rupali Ganguly visited the Mahakaleshwar temple in Ujjain with her husband to seek Lord Shiva's blessings on Sawan Somvar. The 'Anupamaa' star shared pictures from the spiritual visit, which are now going viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kaantha-teaser-dulquer-salmaan-revives-golden-age-cinema-in-tense-period-drama-2762569-2025-07-28",
      "headline": "Kaantha teaser: Dulquer Salmaan revives golden age cinema in tense period dramaThe teaser of 'Kaantha', starring Dulquer Salmaan and released on his birthday, offers a glimpse into a gripping 1950s Madras tale of artistic rivalry and ego clashes. The film will release in September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-hits-global-top-50-on-spotify-krish-dreamt-it-the-world-played-it-ahaan-panday-aneet-padda-mohit-suri-2762540-2025-07-28",
      "headline": "Saiyaara hits global top 50 on Spotify - Krish dreamt it, the world played itSpoiler ahead! Krish Kapoor (played by Ahaan Panday) vows to make the 'Saiyaara' song so big that it reaches his love, Vaani Batra (Aneet Padda). It seems like fiction has become reality as the song has shot to the No. 1 spot on Spotify's Top 50 India and climbed to No. 4 on the Global Top 50 list. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/beyonce-ends-cowboy-carter-tour-vegas-watch-2762418-2025-07-28",
      "headline": "Beyonce ends Cowboy Carter tour on historic note in Vegas. WatchSinger Beyonce brought the curtain down on her historic Cowboy Carter tour with a final performance in Las Vegas, featuring unexpected moments and special guest appearances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/cha-eun-woo-becomes-jinu-arden-cho-free-song-cover-k-pop-demon-hunters-2762547-2025-07-28",
      "headline": "Island actor Cha Eun-woo becomes real-life Jinu with Arden Cho in Free tributeK-pop stars Cha Eun-woo and Arden Cho embody Jinu and Rumi in an emotional 'KPop Demon Hunters' cover of 'Free'. The 'True Beauty' actor has enlisted himself for 2025 military service. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-introduced-domestic-nepotism-with-cook-dilip-says-influencer-director-responds-2762327-2025-07-28",
      "headline": "Farah introduced domestic nepotism with cook Dilip, says influencer. Director reactsInfluencer Freddy Birdy applauded filmmaker Farah Khan for her vlog series featuring her cook Dilip. He stated that Khan is promoting a new kind of \"domestic nepotism\". She responded to the praise in the comment section of the post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anirudh-ravichander-chennai-concert-new-venue-kuvathur-august-23-2762548-2025-07-28",
      "headline": "Anirudh Ravichander's Chennai concert postponed to August 23 at a new venueComposer Anirudh Ravichander's concert was scheduled to take place on July 26 in Chennai, but was postponed one week before its scheduled date. The new concert date and venue have been listed on District app, although an official announcement is awaited."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/death-sentence-of-kerala-nurse-cancelled-in-yemen-grand-muftis-office-confirms-glbs-2762760-2025-07-29",
      "headline": "Nimisha Priya's death sentence cancelled in Yemen: Grand Mufti's officeIndian nurse Nimisha Priya's death sentence has been overturned in Yemen, the Grand Mufti's office confirmed. Convicted in 2018, her case has gained global attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/what-is-operation-mahadev-anti-terror-operation-three-terrorists-jk-pahalgam-attack-2762458-2025-07-28",
      "headline": "Pahalgam attack mastermind was caught napping - Inside details of Op MahadevOperation Mahadev was the result of a 14-day-long pursuit and involved coordinated action by the Army, CRPF, and J&K Police, with efforts still ongoing to identify the terrorists and track down their remaining associates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-call-between-pm-trump-from-april-22-to-june-17-s-jaishankar-rejects-us-presidents-mediation-claims-2762643-2025-07-28",
      "headline": "No PM-Trump call between April 22–June 17: S Jaishankar rejects mediation claimsAs the Opposition began protesting S Jaishankar's statement that trade was not part of the talks between India and the US during Operation Sindoor, Union Home Minister Amit Shah intervened, saying that the Opposition was quick to dismiss their own foreign minister, \"but they have faith in some other country.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-tariff-policies-trade-deal-india-letters-white-house-us-talks-2762735-2025-07-28",
      "headline": "Trump puts world on notice: 15-20% tariffs for those without US trade dealsAs the August 1 tariff deadline looms, President Donald Trump said he could impose tariffs between 15 per cent to 20 per cent on imports to the US from countries negotiating trade deals with Washington."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/how-upa-ended-up-hyphenating-india-pakistan-with-its-balochistan-blunder-manmohan-singh-yusuf-raza-gilani-2762671-2025-07-28",
      "headline": "What is UPA's 2009 Balochistan blunder of Sharm El-SheikhResponding to the Opposition during the debate on Operation Sindoor, Foreign Minister S Jaishankar accused the UPA-2 government of inaction after the 2008 Mumbai attacks and referred to the 2009 Sharm El-Sheikh joint statement by then PM Manmohan Singh with his Pakistani counterpart Yusuf Raza Gilani. What is the Sharm El-Sheikh statement and its reference to Balochistan that is considered a blunder by the Singh-led UPA government?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-snaps-as-opposition-lok-sabha-boos-jaishankar-operation-sindoor-india-pakistan-trump-2762677-2025-07-28",
      "headline": "Video: Amit Shah loses cool as Opposition boos Jaishankar during Op Sindoor debateAmit Shah lashed out at the Opposition in Parliament after they repeatedly interrupted External Affairs Minister S Jaishankar during his statement on Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/whistleblower-in-dharmasthala-mass-burial-case-identifies-15-suspected-sites-2762633-2025-07-28",
      "headline": "Dharmasthala mass burial: Whistleblower identifies 15 sites, probe team on spotThe whistleblower in the Dharmasthala mass burial case has identified 15 locations allegedly used to bury or cremate bodies. The ANF has been deployed at all sites. SIT questioned the complainant over two days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/siddaramaiahs-survival-trick-2762592-2025-07-28",
      "headline": "Siddaramaiah's survival trickA favourable Supreme Court verdict caps a good run for the beleaguered Karnataka chief minister\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mahadev-hill-peak-kashmir-srinagar-sacred-to-hindus-shiva-pilgrimage-pahalgam-attack-terror-encounter-2762470-2025-07-28",
      "headline": "Sacred Mahadev Hill, Sawan Monday and killing of Pahalgam attackersSecurity forces killed three terrorists involved in the April 22 Pahalgam terror attack, near Kashmir's Mahadev Hill. They were killed in Operation Mahadev. The peak is a sacred site which finds mentions in ancient scriptures and Kashmiri folklore. This is the story of Mahadev Peak, whose ice was once sold in Srinagar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-says-gaza-children-look-very-hungry-challenges-netanyahus-claim-of-no-starvation-glbs-2762757-2025-07-29",
      "headline": "Trump says Gaza children 'look very hungry,' pushes back on Netanyahu's claimTrump's comments put him at odds with Netanyahu, who has been claiming that Israel is not responsible for starvation in Gaza. The Israeli leader said that military operations against Hamas would continue even if humanitarian efforts are already underway."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-navnirman-sena-workers-thrash-mumbai-upsc-coach-allege-fraud-2762731-2025-07-28",
      "headline": "Video: Raj Thackeray's party workers thrash Mumbai UPSC coach, allege fraudThe accused returned money to some of the students but soon ran out of cash, following which he was handed over to police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-trf-terror-tag-s-jaishankar-op-sindoor-debate-lok-sabha-monsoon-session-parliament-2762662-2025-07-28",
      "headline": "Where's your diplomacy? Jaishankar says Tahawwur Rana, TRF terror tag is answerExternal Affairs Minister S Jaishankar slammed the Opposition, saying those who believed that inaction was the best response after the 26/11 terror attacks were questioning why Operation Sindoor was stopped."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/who-is-divya-deshmukh-chess-womens-world-cup-winner-2025-2762705-2025-07-28",
      "headline": "MS Dhoni of the Chessboard: Meet Divya Deshmukh, new Women's World Cup winnerDivya Deshmukh showcased her remarkable ability to thrive under pressure by clinching the FIDE Women's World Cup 2025 title, a performance that drew comparisons to Indian cricket legend MS Dhoni for her calm temperament and finishing prowess on the biggest stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/heart-attack-hyderabad-25-year-old-man-from-khammam-dies-of-heart-attack-while-playing-shuttle-at-nagole-stadium-2762530-2025-07-28",
      "headline": "Caught on CCTV: Hyderabad man, 25, dies after he collapsed while playing badmintonA 25-year-old man from Hyderabad's Khammam collapsed while playing shuttle. He was rushed to the hospital but declared dead on arrival. He worked for a private company in the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-to-keir-starmer-in-uk-i-stopped-six-wars-including-india-pakistan-2762632-2025-07-28",
      "headline": "Trump at it again, says he prevented India-Pak, 5 other warsTrump's statement comes at a time when Thailand and Cambodia have announced a ceasefire, and back home in India, the Opposition is trying to corner the Narendra Modi government over the US President's repeated claims of using trade to get both sides to stop."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-says-putin-has-10-or-12-days-to-agree-to-ukraine-peace-deal-or-face-sanctions-2762644-2025-07-28",
      "headline": "Trump says Putin has 10 or 12 days to agree to Ukraine peace deal or face sanctionsMaking his frustration with Putin for prolonging the Ukraine war known, Trump said that there was no point waiting so long as he knew what was going to happen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/7-children-dead-in-rajasthan-india-government-school-infrastructure-problems-2762570-2025-07-28",
      "headline": "Crumbling classrooms: India's public schools have become death traps for childrenSeven students died in Rajasthan's school roof collapse on Friday, exposing India's chronic underfunding of school infrastructure where accidents like this aren't surprising but tragically predictable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/indian-consumer-redressal-system-structural-functional-shortcomings-2762647-2025-07-28",
      "headline": "Why winning a consumer case in India still feels like losingIndia's economy is booming, with over a billion consumers engaging in transactions daily—from grocery purchases to digital banking and e-commerce. But the very system meant to provide relief to the Indian consumer is groaning under the weight of inefficiency, poor infrastructure, and massive underutilisation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/gadgets-foldable-unforgettable-2762574-2025-07-28",
      "headline": "Gadgets: Foldable, unforgettableA new smartphone that survives fall, the sun, rough handling, and looks great while doing it\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/crochet-forever-flowers-are-in-and-theyre-handmade-with-love-2762454-2025-07-28",
      "headline": "Crochet 'forever' flowers are in and they're handmade with loveYou don't have to worry about that flower from your special someone wilting any more, as crochet 'forever' flowers are blooming everywhere, and they're here to stay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-swades-behind-the-scenes-pics-surface-after-20-years-2762635-2025-07-28",
      "headline": "20 years later, Shah Rukh Khan's Swades BTS pics go viral, fans get nostalgicThrowback BTS photos from Shah Rukh Khan's film 'Swades' have gone viral, bringing back memories for fans. People praised the film for showing Indian culture and said it should be released in theatres again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/6-2-magnitude-earthquake-jolts-andaman-and-nicobar-islands-2762758-2025-07-29",
      "headline": "6.2-magnitude earthquake jolts Andaman and Nicobar Islands: News agency ReutersAn earthquake of magnitude 6.2 jolted the Andaman and Nicobar Islands early Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-live-lok-sabha-op-sindoor-debate-opposition-pahalgam-centre-2762255-2025-07-28",
      "headline": "Highlights: Why play cricket with Pak when it foments terror, says Asaduddin OwaisiParliament Session 2025 Highlights: Defence Minister Rajnath Singh initiated the discussion on Operation Sindoor in the Lok Sabha, saying India's military operation was not stopped under any pressure, dismissing repeated claims by US President Donald Trump that he brokered a ceasefire between the nuclear-armed neighbours. He underlined that armed forces halted their strikes on Pakistan as the objectives had been fully achieved. Congress MP Gaurav Gogoi led the Opposition's charge, questioning Singh did not detail how the terrorists entered Baisaran Valley in Jammu and Kashmir's Pahalgam and killed 26 people. External Affairs Minister S Jaishankar hit back at the Opposition, saying its MPs were \"hyphenating themselves\" and ensured TRF, the group behind Pahalgam attack, was declared a terror group by the US. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-nurse-nimisha-priya-daughter-mishel-seeks-mercy-for-mother-on-death-row-in-yemen-2762520-2025-07-28",
      "headline": "I miss you, mummy: Nimisha Priya's daughter seeks mercy in Yemen death row caseKerala nurse Nimisha Priya's thirteen-year-old Mishel travelled to Yemen with her father and a peace envoy to plead authorities for her mother's release. In the video, she can be seen telling, 'I love you, mummy, I miss you.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/saiyaara-singer-faheem-abdullah-partners-with-bhushan-kumar-t-series-new-music-projects-2762682-2025-07-28",
      "headline": "Saiyaara singer Faheem Abdullah collaborates with T-Series for new music projects'Saiyaara' singer Faheem Abdullah is all set for new beginnings in his music career. The singer-songwriter-composer has partnered with Bhushan Kumar's T-Series for his future music projects.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zee5-bakaiti-middle-class-family-drama-sheeba-chaddha-rajesh-tailang-2762657-2025-07-28",
      "headline": "Bakaiti trailer: Rajesh Tailang, Sheeba Chaddha navigate middle-class strugglesThe upcoming show 'Bakaiti' on ZEE5, is a slice-of-life story about a middle-class family in Ghaziabad. The series highlights everyday struggles and unspoken love in a household while dealing with chaos and generational tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-private-instagram-grabs-attention-amid-saiyaara-craze-2762655-2025-07-28",
      "headline": "Ahaan Panday's private Instagram grabs attention amid Saiyaara craze'Saiyaara' actor Ahaan Panday's potential private Instagram account has come to light. The account is followed by popular celebrities like Ananya Panday and Khushi Kapoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-swades-behind-the-scenes-pics-surface-after-20-years-2762635-2025-07-28",
      "headline": "20 years later, Shah Rukh Khan's Swades BTS pics go viral, fans get nostalgicThrowback BTS photos from Shah Rukh Khan's film 'Swades' have gone viral, bringing back memories for fans. People praised the film for showing Indian culture and said it should be released in theatres again."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/khaleel-ahmed-cuts-short-essex-stint-personal-reasons-2762751-2025-07-28",
      "headline": "Khaleel Ahmed ends Essex stint early due to personal reasonsIndia left-arm pacer Khaleel Ahmed has withdrawn from his County Championship stint with Essex after featuring in just two first-class matches, citing personal reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-geoffrey-boycott-slams-ben-stokes-manchester-day-5-drama-2762737-2025-07-28",
      "headline": "Why should India be nice to England? Boycott slams Ben StokesFormer England opener Geoffrey Boycott has slammed the Ben Stokes-led England team for their tactics and behaviour on Day 5 of the Manchester Test, questioning the drama that unfolded when Indian batters refused to settle for a draw."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-ravindra-jadeja-india-vs-england-aakash-chopra-manchester-test-2762713-2025-07-28",
      "headline": "KL Rahul like a monk, Jadeja the real deal: Aakash Chopra praises Indian duoKL Rahul's composed knock and Ravindra Jadeja's match-saving century helped India secure a draw in the fourth Test against England. Aakash Chopra lauded both players for their resilience, highlighting Rahul's disciplined approach and Jadeja's all-round brilliance as pivotal in keeping India's hopes alive in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/supreme-court-quashes-fir-against-shuttler-lakshya-sen-in-age-fraud-case-2762707-2025-07-28",
      "headline": "Supreme Court quashes FIR against Lakshya Sen in birth certificate forgery caseThe Supreme Court on Monday (July 28) quashed an FIR against national badminton star Lakshya Sen, along with his family members and coach, in a case related to alleged birth certificate forgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/who-is-divya-deshmukh-chess-womens-world-cup-winner-2025-2762705-2025-07-28",
      "headline": "MS Dhoni of the Chessboard: Meet Divya Deshmukh, new Women's World Cup winnerDivya Deshmukh showcased her remarkable ability to thrive under pressure by clinching the FIDE Women's World Cup 2025 title, a performance that drew comparisons to Indian cricket legend MS Dhoni for her calm temperament and finishing prowess on the biggest stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-virat-kohli-rcb-captain-2019-parthiv-patel-moeen-ali-2762690-2025-07-28",
      "headline": "Virat Kohli was set to be sacked as RCB captain in 2019, reveals ex IPL-teammateMoeen Ali revealed that Parthiv Patel was almost appointed RCB captain in 2019 during Gary Kirsten's coaching tenure. Virat Kohli, however, continued leading the side until 2021 when he decided to step down due to workload concerns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-retirement-plans-manchester-city-sabbatical-2762683-2025-07-28",
      "headline": "Guardiola reveals plans after Manchester City stint, hints at decade-long breakPep Guardiola has reiterated his plan to step away from football management after his tenure at Manchester City, revealing that his sabbatical could last as long as 15 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/washington-sundar-father-criticises-selectors-gujarat-titans-inconsistent-chances-2762669-2025-07-28",
      "headline": "Washington Sundar's father slams selection policy: My son doesn't get regular chancesWashington Sundar's father, Mr Mani Sundar, has questioned the inconsistent selection policy of the Indian selectors, stating that while other cricketers are given regular opportunities, his son is dropped even after a single failure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-stuart-broad-urges-rest-for-jofra-archer-final-test-oval-2762623-2025-07-28",
      "headline": "Archer should not play Oval Test, Gus Atkinson can replace him: Stuart BroadEngland vs India: Stuart Broad has called for caution over Jofra Archer's workload, urging England not to risk the injury-prone pacer in the fifth and final Test against India at the Kia Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-best-knock-manchester-test-2762587-2025-07-28",
      "headline": "Shubman Gill picks best knock from historic England series: Most pleasing to meShubman Gill rates his Manchester Test hundred as his best knock in the England series. His innings helped India secure a crucial draw and matched a historic Bradman record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/divya-deshmukh-wins-womens-world-cup-2025-koneru-humpy-tie-break-2762576-2025-07-28",
      "headline": "Watch: Divya Deshmukh in tears, hugs mother after Chess World Cup winDivya Deshmukh, 19, won the Women's World Cup 2025 title by defeating veteran Koneru Humpy in a dramatic tie-break. Divya also achieved the Grandmaster title after becoming the first Indian to win the crown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-retirement-plans-manchester-city-sabbatical-2762683-2025-07-28",
      "headline": "Guardiola reveals plans after Manchester City stint, hints at decade-long breakPep Guardiola has reiterated his plan to step away from football management after his tenure at Manchester City, revealing that his sabbatical could last as long as 15 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/washington-sundar-father-criticises-selectors-gujarat-titans-inconsistent-chances-2762669-2025-07-28",
      "headline": "Washington Sundar's father slams selection policy: My son doesn't get regular chancesWashington Sundar's father, Mr Mani Sundar, has questioned the inconsistent selection policy of the Indian selectors, stating that while other cricketers are given regular opportunities, his son is dropped even after a single failure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-stuart-broad-urges-rest-for-jofra-archer-final-test-oval-2762623-2025-07-28",
      "headline": "Archer should not play Oval Test, Gus Atkinson can replace him: Stuart BroadEngland vs India: Stuart Broad has called for caution over Jofra Archer's workload, urging England not to risk the injury-prone pacer in the fifth and final Test against India at the Kia Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-best-knock-manchester-test-2762587-2025-07-28",
      "headline": "Shubman Gill picks best knock from historic England series: Most pleasing to meShubman Gill rates his Manchester Test hundred as his best knock in the England series. His innings helped India secure a crucial draw and matched a historic Bradman record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/divya-deshmukh-wins-womens-world-cup-2025-koneru-humpy-tie-break-2762576-2025-07-28",
      "headline": "Watch: Divya Deshmukh in tears, hugs mother after Chess World Cup winDivya Deshmukh, 19, won the Women's World Cup 2025 title by defeating veteran Koneru Humpy in a dramatic tie-break. Divya also achieved the Grandmaster title after becoming the first Indian to win the crown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/khalid-jamil-favourite-indian-men-football-head-coach-aiff-financial-2762575-2025-07-28",
      "headline": "Indian football team to get new head coach on August 1, Jamil front-runnerThe AIFF executive committee will announce the new Indian men's football head coach on August 1. Khalid Jamil emerges as the frontrunner amid financial challenges and competition from experienced candidates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-foot-injury-ruled-out-final-test-jurel-replacement-2762567-2025-07-28",
      "headline": "Rishabh Pant provides update on foot injury, to begin rehab soonIndia vice-captain Rishabh Pant has thanked fans for their support and confirmed that he will begin rehabilitation once the fracture in his right foot heals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-divya-deshmukh-womens-world-cup-2025-koneru-humpy-2762521-2025-07-28",
      "headline": "Divya Deshmukh creates history, beats Koneru Humpy to win Women's World Cup 2025Divya Deshmukh created history as she defeated Koneru Humpy to win the Women's World Cup 2025 crown on Monday, July 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-should-jasprit-bumrah-play-5th-test-2762501-2025-07-28",
      "headline": "Should India push Jasprit Bumrah to play 5th Test vs England?India vs England: Jasprit Bumrah has already played his promised 3 Tests in England. Should he push for one more with the series on the line?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-draw-shubman-gill-sachin-tendulkar-yuvraj-singh-2762494-2025-07-28",
      "headline": "Indian Legends applaud resilient India fightback in Manchester Test drawIndia's remarkable fightback at Old Trafford has kept the five-match Test series alive. With standout performances from KL Rahul, Shubman Gill, Ravindra Jadeja, and Washington Sundar, the team displayed exceptional resilience, drawing praise from cricketing legends ahead of the series decider."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-squad-jamie-overton-addition-oval-test-2762465-2025-07-28",
      "headline": "ENG vs IND: England add all-rounder to squad for Oval Test against IndiaEngland announced their squad for the Oval Test and decided to add Jamie Overton to the side for the upcoming clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-anshul-kamboj-debut-kapil-dev-2762443-2025-07-28",
      "headline": "You expect him to take 10 wickets? Kapil Dev defends Anshul Kamboj after debutKapil Dev has jumped to the defence of young pacer Anshul Kamboj after his lacklustre debut in the Manchester Test for India. Kamboj failed to make a mark in his first match in India colours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-draw-fiasco-ben-stokes-r-ashwin-2762387-2025-07-28",
      "headline": "Want a hundred against Brook? Of course! Ashwin slams Stokes for 4th Test fiascoR Ashwin slammed Ben Stokes and England for the fiasco they created by trying to end the Manchester Test early and deny Ravindra Jadeja and Washington Sundar hundreds on Sunday, July 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-draw-shubman-gill-sachin-tendulkar-yuvraj-singh-2762494-2025-07-28",
      "headline": "Indian Legends applaud resilient India fightback in Manchester Test drawIndia's remarkable fightback at Old Trafford has kept the five-match Test series alive. With standout performances from KL Rahul, Shubman Gill, Ravindra Jadeja, and Washington Sundar, the team displayed exceptional resilience, drawing praise from cricketing legends ahead of the series decider."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-squad-jamie-overton-addition-oval-test-2762465-2025-07-28",
      "headline": "ENG vs IND: England add all-rounder to squad for Oval Test against IndiaEngland announced their squad for the Oval Test and decided to add Jamie Overton to the side for the upcoming clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-anshul-kamboj-debut-kapil-dev-2762443-2025-07-28",
      "headline": "You expect him to take 10 wickets? Kapil Dev defends Anshul Kamboj after debutKapil Dev has jumped to the defence of young pacer Anshul Kamboj after his lacklustre debut in the Manchester Test for India. Kamboj failed to make a mark in his first match in India colours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-draw-fiasco-ben-stokes-r-ashwin-2762387-2025-07-28",
      "headline": "Want a hundred against Brook? Of course! Ashwin slams Stokes for 4th Test fiascoR Ashwin slammed Ben Stokes and England for the fiasco they created by trying to end the Manchester Test early and deny Ravindra Jadeja and Washington Sundar hundreds on Sunday, July 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/oscar-piatsri-formula-one-win-overtake-lando-norris-belgian-gp-2762333-2025-07-28",
      "headline": "Watch Piastri's audacious overtake on Norris that won him Belgian GPOscar Piastri won the rain-delayed Belgian Grand Prix with a bold move on teammate Lando Norris. This victory extends his championship lead and adds to McLaren's dominance this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-washington-sundar-mantra-century-2762337-2025-07-28",
      "headline": "Fight for entire day: Sundar on mantra after brave hundred in 4th Test drawWashington Sundar revealed his mantra while batting on Day 5 when he scored a brave hundred in the Manchester Test. Sundar played a valiant role in securing the draw in the 4th Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/injury-replacement-ben-stokes-gautam-gambhir-injury-replacement-2762316-2025-07-28",
      "headline": "Gambhir bats for injury replacements, Ben Stokes slams ridiculous ideaEngland captain Ben Stokes has voiced strong opposition to injury replacements in Test cricket. The debate follows Rishabh Pant's injury and contrasting views from India's coach Gautam Gambhir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-rishabh-pant-injury-parting-message-2762300-2025-07-28",
      "headline": "Injured Pant sends parting message to Team India after heroic Manchester drawRishabh Pant sent a parting message to the Indian team after their heroic draw in the Manchester Test. Pant showed grit and fought through pain to score a valiant fifty in the first innings of the fourth Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-draw-shubman-gill-ben-stokes-2762284-2025-07-28",
      "headline": "Manchester Test: A draw that felt like a winFrom 0 for 2 to 425 for 4 in the second innings, India turned what looked a defeat into a stirring draw in Manchester. A performance built on grit and defiance, it felt like a win and a momentum shift before the Oval finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-workload-manchester-gambhir-2762220-2025-07-28",
      "headline": "Workload management can pause, India need Jasprit Bumrah in Oval Test deciderHaving secured a draw in the fourth Test against England at Old Trafford in Manchester, should India push Jasprit Bumrah to play in the fifth Test at the Oval with a chance of levelling the series still alive? With the series on the line, workload management can take a backseat, especially with no major tournaments lined up for the next four months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ben-stokes-on-asking-for-early-draw-in-manchester-2762213-2025-07-28",
      "headline": "Ben Stokes on asking for early draw: Didn't want to risk front-line bowlersEngland captain Ben Stokes revealed that he didn't want to risk his front-line bowlers and hence asked for an early draw in the fourth Test against India at OId Trafford in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/tejaswin-shankar-decathlon-national-record-2762257-2025-07-28",
      "headline": "Tejaswin Shankar breaks national record, betters his previous markIndia's Tejaswin Shankar broke his own national decathlon record with 7826 points in Poland. This achievement marks a new milestone for Indian athletics and raises hopes for future international success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sanjay-manjrekar-on-gautam-gambhir-2762229-2025-07-28",
      "headline": "Gambhir should tone it down, India succeeding despite his blunders: ManjrekarFormer India cricketer-turned commentator Sanjay Manjrekar has urged Gautam Gambhir to tone down during his press conference while answering tough questions and also highlighted his tactical blunders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-manchester-test-ben-stokes-vs-ravindra-jadeja-fight-2762241-2025-07-28",
      "headline": "India refuse early draw in Manchester, Stokes explodes. Who was right?India vs England: Shubman Gill's India pulled off a heroic draw in the Manchester Test match. Ravindra Jadeja got into a verbal tussle with Ben Stokes in the late hours of the final day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/bruised-but-battle-ready-ben-stokes-says-he-wont-miss-oval-test-decider-2762215-2025-07-28",
      "headline": "Bruised, but battle-ready: Ben Stokes says he won't miss Oval Test deciderEngland captain Ben Stokes opened up on his availability for the last Test of the five-match series against India at the Oval. Stokes was adjudged Player of the Match in the fourth Test for scoring a century and taking a five-wicket haul after India secured a hard-fought draw on Day 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-gautam-gambhir-blasts-critics-in-fiery-press-conference-after-manchester-test-draw-2762214-2025-07-28",
      "headline": "Watch: Coach Gambhir blasts critics in fiery press conference after Manchester Test drawEngland vs India: Gautam Gambhir was at his typically combative best after India eked out a heroic draw in the Manchester Test. From tearing into critics of Shubman Gill to emphasising that India would head into the fifth Test in London with confidence, Gambhir was characteristically straightforward and fiery on Sunday, 27 July."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}