{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-or-new-tax-regime-here-how-to-pick-the-right-one-before-filing-itr-2710023-2025-04-16",
      "headline": "Old or New Tax Regime: Here's how to pick the right one before filing ITRUnder the old tax regime, taxpayers can claim various deductions and exemptions, while the new tax regime does not offer much deductions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-how-is-tax-refund-calculated-and-when-will-you-get-it-2709945-2025-04-16",
      "headline": "ITR filing: How is tax refund calculated, and when will you get it?When you file your return, you declare your income, claim deductions, and report taxes already paid. The tax system compares your actual tax due with what you've already paid. If you've paid more, the extra amount is returned to you as a refund."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wipro-q4-results-net-profit-rises-26-percent-to-rs-3570-crore-revenue-beats-estimates-2709903-2025-04-16",
      "headline": "Wipro Q4 results: Net profit rises 26% to Rs 3,570 croreRevenue from operations saw a modest 1% year-on-year increase, reaching Rs 22,504 crore, compared to Rs 22,208 crore in Q4FY24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-rebounds-to-close-300-points-higher-nifty-above-23400-banking-stocks-gain-2709897-2025-04-16",
      "headline": "Sensex closes 300 points higher, Nifty above 23,400; banking stocks gainThe S&P BSE Sensex added 309.40 points to close at 77,044.29, while the NSE Nifty50 gained 108.65 points to end at 23,437.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/inside-gensol-loan-fraud-fake-documents-used-to-hide-debt-ireda-pfc-anmol-puneet-singh-jaggi-2709860-2025-04-16",
      "headline": "Inside Gensol's loan fraud: The fake documents used to hide debtSebi found that when the credit rating agencies asked Gensol to share term loan statements from all its lenders, the company shared documents for most lenders, except for IREDA and PFC."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/china-united-states-tariffs-donald-trump-trade-beijing-war-white-house-xi-jinping-escalate-2709818-2025-04-16",
      "headline": "White House fact sheet sparks confusion about 245% tariff on ChinaWhile a White House fact sheet mentions that China now faces up to 245% tariffs, the usual brouhaha by Donald Trump while making such announcements was missing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/who-are-gensol-promoters-anmol-singh-jaggi-and-puneet-singh-jaggi-2709801-2025-04-16",
      "headline": "Who are Gensol's promoters Anmol and Puneet Singh Jaggi?According to Sebi's findings, both Anmol and Puneet are accused of misusing company funds. The market regulator claims that the promoters treated the company like their personal business. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-shares-continue-rally-jump-6-today-heres-why-2709791-2025-04-16",
      "headline": "Explained: Why IndusInd Bank shares jumped 6% todayShares of IndusInd Bank were trading 5.51% higher at Rs 776.40 on the Bombay Stock Exchange (BSE) around 12:34 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-iphone-sale-data-q1-2025-best-quarter-new-milestone-india-2709788-2025-04-16",
      "headline": "Over 3 million iPhones sold: Apple likely to post best-ever quarter in IndiaThe Q1 2025 number is a big jump from the 2.21 million iPhones sold in the same period last year. It shows how fast Apple is growing in India, a market that is becoming more important for the company every year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/investment-advisor-warns-against-inflation-by-2030-you-will-own-less-pay-more-2709747-2025-04-16",
      "headline": "Investment advisor warns against inflation: 'By 2030, you'll own less, pay more'Abhijit Chokshi stated in his post that most people think inflation means things getting expensive. But he explains that inflation has two faces. One is visible inflation and the other is invisible inflation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pwc-shuts-down-operations-in-more-than-a-dozen-countries-report-2709745-2025-04-16",
      "headline": "PwC shuts down operations in more than a dozen countries: ReportThe decision was taken due to mounting differences with local partners. Local leaders at the firm said they lost over a third of their business in recent years after pressure from PwC's global executives to drop risky clients."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dlf-camellias-anmol-singh-jaggi-how-did-gensol-promoter-use-company-funds-to-buy-ultra-luxury-home-2709702-2025-04-16",
      "headline": "How Gensol promoter used company funds to buy ultra-luxury DLF Camellias flatDLF Camellias is a luxury housing project located in Sector 42, Gurgaon. It comprises 4 BHK, 5 BHK, and 6 BHK luxury apartments. Prices for these upscale homes begin at Rs 70 crore."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-on-jr-ntr-komuram-bheemudo-song-shoot-in-rrr-tarak-was-possessed-2710029-2025-04-16",
      "headline": "SS Rajamouli recalls Jr NTR's Komuram Bheemudo shoot in RRR: Tarak was possessed'RRR' director SS Rajamouli, who was in Japan to promote his Netflix documentary 'RRR: Behind and Beyond', praised Jr NTR's performance in the song 'Komuram Bheemudo', while interacting with the media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rohit-shetty-john-abraham-join-hands-for-2611-police-commissioner-rakesh-marias-biopic-2710039-2025-04-16",
      "headline": "Rohit Shetty, John Abraham join hands for Rakesh Maria's biopicJohn Abraham and Rohit Shetty are joining hands for a new film inspired by Rakesh Maria's life. The project will explore Maria's illustrious career in the Mumbai Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/radhika-apte-to-join-tabu-and-vijay-sethupathi-in-puri-jagannadhs-next-report-2710026-2025-04-16",
      "headline": "Radhika Apte to join Tabu and Vijay Sethupathi in Puri Jagannadh's next: ReportAfter years away from Telugu cinema, Radhika Apte is reportedly reuniting with filmmaker Puri Jagannadh for an intense pan-India project, also starring Vijay Sethupathi and Tabu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/eddington-teaser-joaquin-phoenix-pedro-pascal-clash-in-ari-asters-black-comedy-2709940-2025-04-16",
      "headline": "Eddington teaser: Joaquin Phoenix, Pedro Pascal clash in Ari Aster's black comedyThe teaser of Ari Aster's latest film, 'Eddington', released on April 15. A black comedy, Eddington is set to premiere at the 2025 Cannes Film Festival. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nidhhi-agerwal-role-pawan-kalyan-hari-hara-veera-mallu-the-raja-saab-2709979-2025-04-16",
      "headline": "How Nidhhi Agerwal transformed into a princess for Hari Hara Veera MalluTelugu-Tamil star Nidhhi Agerwal gears up for two major releases with Pawan Kalyan and Prabhas. In an exclusive interview with India Today Digital, she spoke about 'Hari Hara Veera Mallu', working with the two stars and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannada-superstar-upendra-explains-how-coolie-co-star-rajinikanth-inspired-him-2709959-2025-04-16",
      "headline": "Kannada superstar Upendra explains how Coolie co-star Rajinikanth inspired himKannada actor-director Upendra, while interacting with the media at a press meet held in Hyderabad to promote his upcoming Kannada film '45', spoke about how he considered himself blessed to have had the opportunity to work with him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamannaah-on-milk-beauty-tag-i-dont-want-to-play-the-victim-2709951-2025-04-16",
      "headline": "Tamannaah on 'milky beauty' tag: I don't want to play the victimTamannaah Bhatia, during the promotion of her upcoming supernatural thriller, 'Odela 2', remarked that she does not want to \"be in a victim-mode\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-keeps-returning-to-nationalist-roles-with-kesari-chapter-2-2709889-2025-04-16",
      "headline": "The Patriotism pattern: Why Akshay Kumar keeps returning to nationalist rolesAkshay Kumar returns to his patriotic roots with 'Kesari Chapter 2', portraying the role of C Sankaran Nair in a courtroom drama set against the backdrop of the Jallianwala Bagh massacre. Known for his consistent portrayal of nationalistic themes, Akshay remains Bollywood's go-to figure for films that resonate with Indian pride."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gene-hackmans-wife-googled-flu-symptoms-days-before-death-report-glbs-2709998-2025-04-16",
      "headline": "Gene Hackman's wife Googled flu symptoms days before death: ReportAuthorities have revealed that Gene Hackman, 95, and his wife Betsy Arakawa, 65, died in their Santa Fe home from natural causes—Arakawa from rare hantavirus and Hackman from heart disease worsened by Alzheimer's. New details shed light on Arakawa's health concerns before her death and confirm no foul play was involved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/did-you-know-jaideep-ahlawat-was-offered-vibhishan-in-ranbir-kapoors-ramayana-2709960-2025-04-16",
      "headline": "Jaideep Ahlawat offered Vibhishan's role in Ranbir's Ramayana? Here's the truthRanbir Kapoor's 'Ramayana' is one of the most anticipated projects in Bollywood. It was reported that actor Jaideep Ahlawat was offered the role of Vibhishan in the Nitesh Tiwari directorial. However, India Today Digital's source dismissed the report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/babil-khan-trolling-for-humility-hurt-when-baba-irrfan-was-involved-exclusive-2709927-2025-04-16",
      "headline": "Babil on trolling for humility: It hurt when they got Baba involved | ExclusiveBabil Khan, son of the late actor Irrfan, often faces online trolling, with the video of him apologising to an actor for photobombing during a red carpet going viral. In an exclusive interview, he shared that lit hurt him one time when his father was also brought into the meme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jesse-eisenberg-starry-musical-film-with-julianne-moore-paul-giamatti-begins-production-2709877-2025-04-16",
      "headline": "Jesse Eisenberg's starry musical film begins productionJesse Eisenberg's musical film, featuring Julianne Moore and Paul Giamatti, is now in production. Halle Bailey, Bernadette Peters, and Havana Rose Liu have also recently joined the cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kichcha-sudeeps-brb-first-blood-shoot-starts-calls-it-unparalleled-excitement-2709872-2025-04-16",
      "headline": "Kichcha Sudeep's BRB: First Blood shoot starts, calls it unparalleled excitementKannada actor Kichcha Sudeep shared the news on X, about his highly anticipated upcoming film, \r\nBilla Ranga Basha: First Blood', directed by Anup Bhandari. The film is going on floors on April 16. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/simbu-powerful-song-pawan-kalyan-og-composer-thaman-2709857-2025-04-16",
      "headline": "Actor Simbu sings powerful song in Pawan Kalyan's OG, confirms composerComposer Thaman revealed that Tamil star Simbu has already recorded the first single titled 'Firestorm' for the much-awaited action film 'They Call Him OG' starring Pawan Kalyan. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sharvari-star-opposite-ranveer-singh-in-don-3-after-kiara-advani-exit-2709861-2025-04-16",
      "headline": "Sharvari to star opposite Ranveer Singh in Don 3 after Kiara Advani's exit: ReportActor Sharvari Wagh is reportedly set to join Ranveer Singh in Don 3. Kiara Advani stepped away from the project due to her pregnancy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/katy-perry-orlando-blooms-relationship-timeline-from-breakup-to-engagement-glbs-2709850-2025-04-16",
      "headline": "Katy Perry, Orlando Bloom's relationship timeline: From breakup to engagementKaty Perry and Orlando Bloom's relationship has spanned nearly a decade, filled with romantic milestones, a brief split, and the birth of their daughter, Daisy. Engaged since 2019, the couple remains together in 2025, continuing to build their bond through love, therapy, and shared parenthood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shiva-rajkumar-all-set-to-reprise-his-role-in-rajinikanths-jailer-2-confirmed-2709832-2025-04-16",
      "headline": "Confirmed! Shiva Rajkumar all set to reprise his role in Rajinikanth's Jailer 2Kannada actor Shiva Rajkumar, while interacting with the media at a press meet held in Hyderabad to promote his upcoming Kannada film 45, confirmed that he would be reprising his role from the first part in Rajinikanth's 'Jailer 2'. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-stands-up-for-salman-khan-amid-sikandar-failure-tiger-zinda-hai-2709817-2025-04-16",
      "headline": "Tiger zinda hai: Akshay Kumar defends Salman Khan amid Sikandar failureActor Akshay Kumar tried to reaffirm the audience's faith in Salman Khan's screen presence despite Sikandar's failure at the box office. The 'Kesari 2' actor called his friend a 'tiger' and an 'immortal' star. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/neha-kakkar-shares-pics-with-rohanpreet-singh-tony-kakkar-amid-ongoing-rift-with-sister-sonu-kakkar-2709799-2025-04-16",
      "headline": "Neha Kakkar shares pics with 'favourite people' amid ongoing rift with sister SonuNeha Kakkar stirred curiosity by posting cheerful photos with her husband Rohanpreet Singh and brother Tony Kakkar, amid an ongoing rift with sister Sonu. Fans questioned the absence of Sonu after she announced severing ties with her siblings due to emotional distress."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-waqf-act-hearing-cji-sanjiv-khanna-registration-properties-sale-2709899-2025-04-16",
      "headline": "Undoing 'waqf by user' will have huge consequences: Top court's big remarksThe Supreme Court, hearing 73 petitions challenging the Waqf Amendment Act, said that denotifying the properties of the 'waqf by user', would have huge consequences, but stopped short of passing interim orders."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-student-chinmay-deore-us-visa-revoked-sues-donald-trump-deportation-threat-2709999-2025-04-16",
      "headline": "Visa revoked, Indian student sues Trump administration over deportation threatThe development comes at a time when the Trump administration has started revoking visas of hundreds of international students over alleged campus activism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-company-lays-off-200-indian-americans-telugu-employees-in-donation-scam-fannie-mae-apple-2709852-2025-04-16",
      "headline": "US giant fires 200, mostly Telugus, over salary fraudUS mortgage giant, Fannie Mae, has laid off 200 employees, mostly Telugus, over salary fraud, according to a report. The employees allegedly misused the company's matching gift programme by collaborating with Telugu associations. An Indian-American Congressman has sought the company's response on the mass lay-offs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jd-vance-india-visit-pm-modi-meet-family-trip-agra-jaipur-us-delhi-trade-deal-2710071-2025-04-16",
      "headline": "JD Vance's India visit: Meeting with PM, trip to Jaipur, Agra on the cardsDuring the India visit, JD Vance will meet Prime Minister Narendra Modi and will also make trips to key cultural sites such as Jaipur and Agra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mark-zuckerberg-antitrust-case-trial-instagram-whatsapp-deal-settlement-negotiation-failed-2710012-2025-04-16",
      "headline": "Zuckerberg tried to avoid antitrust case trial with $450 million settlement: ReportMark Zuckerberg's Meta is facing an antitrust case over its high-profile acquisitions of Instagram and WhatsApp. Days before the case went to trial, Zuckerberg tried to settle the case for USD 450 million, as per a report."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-origin-malaysian-man-smuggle-dogs-puppy-kitten-into-singapore-jailed-fined-2709970-2025-04-16",
      "headline": "Mr Dog makes Indian-origin man smuggle puppy into Singapore, lands him in jailAn Indian-origin Malaysian, Mahentharan Ganesan, has been sentenced to jail and fined by a Singapore court. Driven by debt, Ganesan had accepted the offer of an animal-smuggling kingpin called Mr Dog. Ganesan smuggled cats and dogs into Singapore in laundry bags, until a Labrador pup exposed him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-test-2025-rohit-sharma-selection-podcast-michael-clarke-2709997-2025-04-16",
      "headline": "Rohit Sharma to captain in England Tests? India star drops hint in latest podcastIndia tour of England 2025: Captain Rohit Sharma said India are hopeful of a strong showing in the Old Blighty. While speculation around his Test future continues, the skipper appears to be already planning for the five-Test series starting June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/vitamin-d-low-deficiency-erectile-dysfunction-erection-penis-new-study-sex-life-impact-2709969-2025-04-16",
      "headline": "Low vitamin D affecting your sex life? New study links it to erectile dysfunctionVitamin D deficiency may cause erectile dysfunction by impairing blood flow and reducing drug effectiveness, a new study revealed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-tejashwi-gave-rahul-kharge-a-bihar-poll-reality-check-2709936-2025-04-16",
      "headline": "How Tejashwi gave Rahul, Kharge a Bihar poll reality checkIn 2020, the Congress contested a disproportionate number of seats, winning under a third of them and denying the RJD-led alliance a shot at power. Will 2025 be different?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-questions-waqf-board-composition-non-muslim-members-inclusion-2709934-2025-04-16",
      "headline": "Will you allow Muslims on Hindu boards? Supreme Court questions Waqf compositionThe Chief Justice pointed out that as per the Act, eight members of the board are Muslims, and possibly only two are not. \"Why not have Muslims also on the advisory board of Hindu endowments then?\" he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jails-functioning-200-occupancy-rate-inmates-undertrials-india-justice-report-police-prison-reforms-2709715-2025-04-16",
      "headline": "Why jails in India are asking to be freedOver half of India's prisons are overcrowded, with 176 of them housing four times the number of inmates they were sanctioned to hold. Two prisons in Delhi's Tihar Jail have 400% occupancy. India's jails are bursting at the seams even as the proportion of undertrial inmates rises to 76% of all prisoners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/chronically-tired-a-misunderstood-illness-affecting-more-women-than-men-2709765-2025-04-16",
      "headline": "Chronically tired: A misunderstood illness affecting more women than menChronic fatigue syndrome is a complex, under-recognised illness that disproportionately affects women, yet often goes undiagnosed or misdiagnosed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/justice-br-gavai-likely-next-52nd-chief-justice-of-india-succeed-sanjiv-khanna-proposal-to-law-ministry-tenure-ends-may-2709871-2025-04-16",
      "headline": "Justice BR Gavai likely to succeed Sanjiv Khanna as next Chief Justice of IndiaJustice BR Gavai, if appointed, will become the 52nd Chief Justice of India. He is likely to take the oath of the top judicial chair on May 14."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-harvard-university-row-federal-funding-freeze-controversy-2709938-2025-04-16",
      "headline": "Trump calls Harvard a joke, says it has been hiring all woke teaching staffUS President Donald Trump ramped up his attacks on Harvard, claiming that the university \"lost its way\" and was no longer considered a \"decent place\" for learning."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/pune/story/minor-stripped-and-filmed-by-mother-her-boyfriend-over-revealing-their-affair-2709948-2025-04-16",
      "headline": "Minor stripped, filmed by mother, her partner over disclosing their affairA minor girl was allegedly stripped and filmed by her mother and her mother's boyfriend because she disclosed their extramarital affair to the landlord."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/woman-drowns-in-ganga-at-uttarkashis-manikarnika-ghat-while-recording-video-2709955-2025-04-16",
      "headline": "Woman drowns in Ganga at Uttarkashi's Manikarnika Ghat while recording videoA horrifying video of a woman being swept away in the strong currents of the Ganga river at Uttarkashi's Manikarnika Ghat has gone viral on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/china-united-states-tariffs-donald-trump-trade-beijing-war-white-house-xi-jinping-escalate-2709818-2025-04-16",
      "headline": "White House fact sheet sparks confusion about 245% tariff on ChinaWhile a White House fact sheet mentions that China now faces up to 245% tariffs, the usual brouhaha by Donald Trump while making such announcements was missing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/plane-with-12-indians-on-board-makes-emergency-landing-in-kathmandu-2709992-2025-04-16",
      "headline": "Plane with 12 Indians on board makes emergency landing in KathmanduAn aircraft operated by private airline Sita Air, carrying 12 Indian passengers, made an emergency landing at Kathmandu's Tribhuvan International Airport on Wednesday after experiencing a hydraulic system failure mid-flight."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-meeting-imams-muslim-clerics-kolkata-bengal-waqf-act-protest-violence-pm-narendra-modi-amit-shah-bsf-2709785-2025-04-16",
      "headline": "PM should rein in Amit Shah: Mamata Banerjee claims violence was plannedMamata Banerjee, in a meeting with imams over the Waqf law, suggested a conspiracy by Amit Shah and the BSF to allow the entry of Bangladeshi miscreants to fuel unrest in Bengal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-prolonged-loud-use-of-earbuds-damages-hearing-2710028-2025-04-16",
      "headline": "Why prolonged, loud use of earbuds damages hearingEarbuds are high on style and convenience, but how to ensure they don't cause hearing loss?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/bangla-dicey-situation-breathing-down-chickens-neck-siliguri-corridor-india-bangladesh-demography-2709797-2025-04-16",
      "headline": "A Bangla-dicey situation breathing down Chicken's NeckWest Bengal's borders have been a revolving door, spinning tales of migration, identity, and demographic shift."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/atm-facility-in-train-indias-first-onboard-atm-installed-on-panchavati-express-2709878-2025-04-16",
      "headline": "India's first ATM on train launched on Mumbai's Panchavati ExpressPassengers of Panchavati and Janshatabdi Express can soon withdraw cash during their train journey. Indian Railways successfully tested the country's first ATM inside a train coach."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/news/story/punes-rutuja-warhade-bags-rank-3-in-national-defence-academy-tops-girls-list-2709881-2025-04-16",
      "headline": "Pune's Rutuja Warhade bags Rank 3 in National Defence Academy, tops girls' listPune girl Rutuja Warhade has topped the NDA exam amongst female candidates and secured an overall All India Rank of 3.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-test-2025-rohit-sharma-selection-podcast-michael-clarke-2709997-2025-04-16",
      "headline": "Rohit Sharma to captain in England Tests? India star drops hint in latest podcastIndia tour of England 2025: Captain Rohit Sharma said India are hopeful of a strong showing in the Old Blighty. While speculation around his Test future continues, the skipper appears to be already planning for the five-Test series starting June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-reveals-how-pbks-plotted-sunil-narines-dismissal-vs-kkr-2710011-2025-04-16",
      "headline": "Ricky Ponting reveals how PBKS plotted Sunil Narine's dismissal vs KKRPunjab Kings' (PBKS) head coach Ricky Ponting revealed how they plotted Sunil Narine's dismissal against Kolkata Knight Riders (KKR) in Match 31 of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-play-in-tournament-preview-mavericks-vs-kings-heat-vs-bulls-schedule-how-to-watch-more-glbs-2709975-2025-04-16",
      "headline": "NBA Play-in tournament preview: Mavericks vs Kings, Heat vs Bulls, schedule, how to watch & moreThe 2025 NBA Play-in tournament has begun. Two important matchups are set for Wednesday night, April 16. In the Western Conference, the Dallas Mavericks will face off against the Sacramento Kings in a win-or-go-home battle. While, the Chicago Bulls take on the Miami Heat in the Eastern Conference. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jitesh-sharma-enjoying-finishers-role-at-rcb-2709958-2025-04-16",
      "headline": "Jitesh Sharma enjoying finisher's role at RCB: Scores of 20,30 are my fiftiesJitesh Sharma revealed that he's enjoying finisher's role at the Royal Challengers Bengaluru (RCB) in the ongoing Indian Premier League 2025 (IPL 2025) and the scores of 20 and 30 are his new milestones. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-playoffs-los-angeles-lakers-roster-decided-full-schedule-and-key-matchup-preview-glbs-2709950-2025-04-16",
      "headline": "NBA Playoffs: Los Angeles Lakers roster decided, full schedule and key matchup previewThe Los Angeles Lakers have officially finalized their roster heading into the 2025 NBA Playoffs. The Lakers finished the regular season with a strong 50-32 record and earned the No. 3 seed in the Western Conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/thats-a-batman-jimmy-butler-hails-stephen-curry-as-warriors-clinch-playoff-spot-glbs-2709943-2025-04-16",
      "headline": "That's a Batman, Jimmy Butler hails Stephen Curry as Warriors clinch Playoff spotIn a Western Conference NBA Play-in tournament matchup at Chase Centre on Tuesday, April 15, the Golden State Warriors survived a second-half comeback from the Memphis Grizzlies to claim a 121-116 victory and lock in the No. 7 seed for the NBA postseason."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-arsenal-champions-league-quarter-final-india-tv-channel-livestreaming-2709915-2025-04-16",
      "headline": "Real Madrid vs Arsenal, UCL quarter-final 2nd leg: When and where to watchReal Madrid are known for historic Champions League turnarounds, and their clash against Arsenal at the Bernabeu is set up perfectly for another. But the Gunners, fresh off a first-leg thrashing, will look to spoil the party with composure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-odi-cricket-future-sustainability-different-challenge-michael-clarke-2709908-2025-04-16",
      "headline": "Rohit Sharma backs ODI cricket's future: It has a different challengeRohit Sharma opened up about his enduring love for ODI cricket, underlining its unique challenge and long-standing importance, even amid the T20 frenzy. The India captain's Champions Trophy heroics only cemented his legacy in the 50-over format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-sydney-test-michael-clarke-podcast-gautam-gambhir-reaction-2709883-2025-04-16",
      "headline": "How coach Gambhir reacted when Rohit Sharma dropped himself from Sydney TestSpeaking to Michael Clarke on a recent podcast, Rohit Sharma recalled his decision to sit out of the fifth and final Test of the Border-Gavaskar Trophy in Sydney. The India captain discussed a conversation with coach Gautam Gambhir before making the big call.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vs-psl-sam-billings-press-conference-lahore-qalandars-2709854-2025-04-16",
      "headline": "Want me to say something silly? England star gives his take on IPL vs PSL debateEngland batter Sam Billings said the Indian Premier League is well ahead of the rest of the T20 leagues in the world. Billings has been playing for Lahore Qalandars in the 10th edition of the Pakistan Super League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/thats-a-batman-jimmy-butler-hails-stephen-curry-as-warriors-clinch-playoff-spot-glbs-2709943-2025-04-16",
      "headline": "That's a Batman, Jimmy Butler hails Stephen Curry as Warriors clinch Playoff spotIn a Western Conference NBA Play-in tournament matchup at Chase Centre on Tuesday, April 15, the Golden State Warriors survived a second-half comeback from the Memphis Grizzlies to claim a 121-116 victory and lock in the No. 7 seed for the NBA postseason."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-arsenal-champions-league-quarter-final-india-tv-channel-livestreaming-2709915-2025-04-16",
      "headline": "Real Madrid vs Arsenal, UCL quarter-final 2nd leg: When and where to watchReal Madrid are known for historic Champions League turnarounds, and their clash against Arsenal at the Bernabeu is set up perfectly for another. But the Gunners, fresh off a first-leg thrashing, will look to spoil the party with composure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-odi-cricket-future-sustainability-different-challenge-michael-clarke-2709908-2025-04-16",
      "headline": "Rohit Sharma backs ODI cricket's future: It has a different challengeRohit Sharma opened up about his enduring love for ODI cricket, underlining its unique challenge and long-standing importance, even amid the T20 frenzy. The India captain's Champions Trophy heroics only cemented his legacy in the 50-over format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-sydney-test-michael-clarke-podcast-gautam-gambhir-reaction-2709883-2025-04-16",
      "headline": "How coach Gambhir reacted when Rohit Sharma dropped himself from Sydney TestSpeaking to Michael Clarke on a recent podcast, Rohit Sharma recalled his decision to sit out of the fifth and final Test of the Border-Gavaskar Trophy in Sydney. The India captain discussed a conversation with coach Gautam Gambhir before making the big call.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vs-psl-sam-billings-press-conference-lahore-qalandars-2709854-2025-04-16",
      "headline": "Want me to say something silly? England star gives his take on IPL vs PSL debateEngland batter Sam Billings said the Indian Premier League is well ahead of the rest of the T20 leagues in the world. Billings has been playing for Lahore Qalandars in the 10th edition of the Pakistan Super League. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}