{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-why-sensex-nifty-fell-sharply-before-today-market-closing-explained-2721626-2025-05-08",
      "headline": "Explained: Why Sensex, Nifty fell sharply moments before market closingBy market close, the BSE Sensex had dropped 411.97 points to 80,334.81, while the Nifty 50 fell 140.60 points to 24,273.80. The India VIX, often seen as the market's fear gauge, spiked over 10 per cent to cross the 21 mark—its highest since early April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-withdraws-operation-sindoor-trademark-says-it-was-filed-inadvertently-2721608-2025-05-08",
      "headline": "Reliance withdraws 'Operation Sindoor' trademark, says it was filed inadvertentlyOn May 7, four different applications were made to trademark the phrase 'Operation Sindoor' under Class 41 of the Nice Classification. This category includes services like films, shows, online content, education, cultural events and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/kamikaze-suicide-drone-makers-stock-jumps-after-operation-sindoor-details-here-2721607-2025-05-08",
      "headline": "Kamikaze 'suicide' drone maker's stock jumps after 'Operation Sindoor'. Details hereListed on the NASDAQ under the ticker ESLT, Elbit's stock rose 3.62% over two sessions, jumping from $400.00 on May 6 to $414.47 by May 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-falls-412-points-nifty-below-24300-as-indo-pak-tensions-hit-dalal-street-2721578-2025-05-08",
      "headline": "Sensex, Nifty end in red as panic grows over India-Pak tensionsThe S&P BSE Sensex had fallen over 700 points just a few minutes before closing. However, it bounced back to end 412 points lower at 80,334.81, while the NSE Nifty50 lost 140.60 points to close at 24,273.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-stock-exchange-trading-halted-after-7-per-cent-crash-post-operation-sindoor-2721546-2025-05-08",
      "headline": "Pakistan's Karachi Stock Exchange crashes 7%, trading haltedAccording to the official notification from the exchange, trading was paused after the benchmark index plunged 6.3% in a short period. The sharp fall triggered automatic circuit breakers to stop further decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-what-is-itr-form-3-check-eligibility-documents-and-deadlines-all-details-explained-2721527-2025-05-08",
      "headline": "ITR Filing 2025: What is ITR Form 3, check eliigibility, documents and deadlinesYou should file ITR-3 if you run a business or work as a self-employed professional, regardless of whether a tax audit is needed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/avic-chengdu-aircraft-co-ltd-share-price-india-pak-tensions-chinese-jet-maker-j-17-stock-by-36-percent-in-2-days-2721520-2025-05-08",
      "headline": "India-Pak tensions lift Chinese jet maker's stock by 36% in 2 daysAs of Thursday, the company's share price rose by 16.37% to reach 80.68 yuan. This was after a 17% jump on Wednesday. In total, the stock has gained 36.21% in two days and has gone up 44% in the past one month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retirement-age-is-moving-from-60-to-45-an-investment-banker-sarthak-ahuja-explains-why-2721482-2025-05-08",
      "headline": "'Retirement age is moving from 60 to 45': An investment banker explains whyUnlike lawyers or doctors, where experience adds value, senior professionals in corporate roles like sales, marketing, operations, product, and tech, are seen as costly and sometimes out of touch, said the investment banker."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-india-pakistan-tension-should-investors-on-dalal-street-panic-2721478-2025-05-08",
      "headline": "Why stock market investors shouldn't panic amid rising Indo-Pak tensionsWhile 'Operation Sindoor' led to worries about increased market volatility and losses, the main indices on Dalal Street actually managed to end in green in the previous session. Even today, the stock markets are trading in positive territory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-economy-going-down-forex-reserve-overflight-fees-airspace-ban-india-border-tension-2721445-2025-05-08",
      "headline": "Pakistan's forex is slipping fast. More trouble ahead for already debt-ridden economy?A bailout by the International Monetary Fund (IMF), including a loan of $2 billion in March this year, gave Pakistan some breathing room. But the current situation could undo much of that progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/you-can-now-automate-strategies-zerodha-founder-and-ceo-nithin-kamath-on-nse-new-algo-rules-2721437-2025-05-08",
      "headline": "'You can now automate strategies': Zerodha's Nithin Kamath on NSE's new algo rulesZerodha's founder and CEO, Nithin Kamath, hailed NSE's new rules to ease algo trading for retail users and explained the main update in simple terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-pakistan-rising-tension-war-impact-on-economy-foreign-investments-2721404-2025-05-08",
      "headline": "Will rising Indo-Pak tensions dent foreign investment inflows to India?India's economy, which recently crossed the $4 trillion mark, has minimal direct trade with Pakistan. As a result, cross-border missile strikes carried out by India had limited immediate impact on domestic equities, currencies, or bonds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-layoffs-cuts-200-jobs-in-latest-round-of-restructuring-2721392-2025-05-08",
      "headline": "Google cuts 200 jobs in latest round of restructuring: ReportGoogle described the changes as \"small\" adjustments meant to foster \"greater collaboration\" and improve how quickly teams can serve customers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-opens-80-points-higher-nifty-above-24400-tata-motors-up-2-percent-india-pakistan-tension-war-2721383-2025-05-08",
      "headline": "Sensex, Nifty erase early gains as market reacts to India-Pakistan tensionThe S&P BSE Sensex was trading down by 56.88 points to 80,689.90, while the NSE Nifty50 lost 32.25 points to 24,382.15 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-opening-dalal-street-to-go-down-amid-india-pakistan-tension-sindoor-2721374-2025-05-08",
      "headline": "Sensex, Nifty opening: Stock market to go down amid India-Pakistan tension?At 8:40 am, Gift Nifty futures were trading at 24,451. This suggests that the Nifty50 index may open marginally higher or close to Wednesday's closing level of 24,414.4 as investors are expected to be cautious. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-may-8-shares-in-focus-titan-dabur-lt-asian-paints-pnb-2721366-2025-05-08",
      "headline": "Stocks to watch on May 8: Titan, Dabur, L&T, Asian Paints, PNBStocks to watch on Thursday, May 8, include several well-known companies such as Titan, Dabur, L&T, Asian Paints and PNB. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-letter-of-intent-elon-musks-satellite-internet-venture-starlink-2721230-2025-05-07",
      "headline": "Government issues Letter of Intent to Musk's satellite internet venture StarlinkPrior to this, the government had issued licences to Eutelsat OneWeb and Jio Satellite Communications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ulips-mutual-funds-or-stocks-what-is-the-best-for-long-term-wealth-creation-2721078-2025-05-07",
      "headline": "ULIPs, mutual funds or stocks: What's the best for long-term wealth creation?Mutual funds, ULIPs, and stocks offer different paths to wealth. While ULIPs mix insurance with investment, mutual funds offer flexibility and professional management. Stocks offer high returns but carry more risk and demand expertise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-nps-rules-how-to-close-your-account-after-renouncing-indian-citizenship-2721011-2025-05-07",
      "headline": "New NPS rules: How to close your account after renouncing Indian citizenshipAny Indian citizen aged between 18 and 70 years can open an NPS account. Additionally, Non-Resident Indians (NRIs) and Overseas Citizens of India (OCIs) can also open an NPS account, as long as they meet the necessary requirements set by the PFRDA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-106-points-higher-nifty-above-24400-tata-motors-jumps-5-2720999-2025-05-07",
      "headline": "Sensex ends 106 points higher, Nifty above 24,400; Tata Motors jumps 5%The BSE Sensex was up 105.71 points higher to 80,746.78 at the closing bell, while the NSE Nifty50 rose 34.80 points to settle at 24,414.40. Most of the broader market indices also recovered after falling in early trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hdfc-bank-trims-these-lending-rates-mclr-from-may-7-will-your-emis-go-down-2720970-2025-05-07",
      "headline": "HDFC Bank trims these lending rates from May 7. Will your EMIs go down?This move comes shortly after the Reserve Bank of India (RBI) cut the repo rate by 25 bps in April, taking the total cut to 50 bps since February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/operation-sindoor-how-will-stock-markets-react-to-rising-indo-pak-tensions-2720948-2025-05-07",
      "headline": "Operation Sindoor: Should Dalal Street investors worry about what's next?There was no sell-off, no bloodbath, just a bit of volatility. For many retail investors, the calm felt unusual — shouldn't a military flare-up between nuclear neighbours spook the markets? But past data suggests otherwise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/taking-a-personal-loan-for-wedding-here-are-6-key-tips-to-keep-in-mind-2720932-2025-05-07",
      "headline": "Taking a personal loan for a wedding? Here are 6 key tips to keep in mindWeddings can tempt us to go overboard, but it's best to plan a realistic budget. See where you can cut costs or use your savings first. Borrow just the amount you really need, don't take a bigger loan just because you're eligible for it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-heres-how-to-choose-the-right-tax-regime-old-tax-regime-new-tax-regime-standard-deduction-2720891-2025-05-07",
      "headline": "Filing ITR? Here's how to choose the right tax regimeWhile the new regime offers reduced tax slabs, it doesn't let you claim the usual deductions available under the old regime. It's lower rates, but with fewer tax-saving options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-benefits-impact-goods-cheaper-costlier-decoded-2720888-2025-05-07",
      "headline": "Whisky, cars, and jobs: Inside India's game-changing UK free trade pactThe India-UK trade deal holds significance in a world drifting back toward trade barriers and tariff wars. With Trump-era protectionism rearing its head again, the timing of this pact couldn't be better."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pwc-to-lay-off-2-percent-of-us-workforce-report-2720852-2025-05-07",
      "headline": "PwC to cut 1,500 jobs in the US: ReportLast year, PwC was in the news for possibly cutting half of its auditing staff in China's financial services sector. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pakistan-karachi-stock-exchange-crashes-nearly-6-percent-operation-sindoor-military-strike-impact-2720824-2025-05-07",
      "headline": "Pakistan's Karachi Stock Exchange crashes nearly 6% after 'Operation Sindoor'The Karachi Stock Exchange 100 index (KSE-100) plunged 6,272 points in early trade, sliding to 107,296.64 — a sharp drop from Tuesday's close of 113,568.51."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/info-edge-share-price-down-80-percent-bse-trading-apps-reason-explained-2720820-2025-05-07",
      "headline": "Explained: Why Info Edge shares look like they've crashed 80% todayInfo Edge shares traded ex-split today after the company carried out a 1:5 stock split, its first since its 2006 listing. As a result, each share with a face value of Rs 10 has been subdivided into five shares of Rs 2 each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-foreign-portfolio-investors-are-buying-indian-financial-stocks-explained-2720810-2025-05-07",
      "headline": "Explained: Why foreign portfolio investors are buying Indian financial stocksData from the National Securities Depository shows FPIs bought Rs 18,409 crore ($2.18 billion) worth of shares in the sector last month, propelling the Nifty Financial Services index to a 4.1% gain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/scotch-whisky-prices-set-to-drop-after-india-uk-trade-deal-details-here-2720803-2025-05-07",
      "headline": "Scotch whisky prices set to drop after India-UK trade deal. Details hereThe reduction is expected to bring premium and mid-range Scotch whiskies within reach of a larger section of Indian consumers. A bottle that typically costs Rs 5,000 could soon be priced between Rs 3,500 and Rs 4,000 following the initial tariff cut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-why-didnt-markets-crash-after-operation-sindoor-2720786-2025-05-07",
      "headline": "Sensex, Nifty today: Why stock market didn't crash after 'Operation Sindoor'While markets remain extremely volatile, swinging between green and red, there was no major crash. Here are three reasons why Dalal Street remained calm after 'Operation Sindoor'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-lower-as-dalal-street-investors-react-to-operation-sindoor-2720768-2025-05-07",
      "headline": "Sensex, Nifty rebound as markets stay calm after 'Operation Sindoor'The Sensex fell sharply in pre-opening, but recovered as soon as the markets opened at 9:15 am. At around 9:30 am, Sensex was trading 143.08 points higher at 80,784.15, while the NSE Nifty50 rose 56.60 points to trade at 24,432."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-nears-full-profitability-revenue-grows-to-rs-1911-crore-2720453-2025-05-06",
      "headline": "Paytm nears full profitability; revenue grows to Rs 1,911 crorePaytm's revenue increased by 5% quarter-on-quarter, reaching Rs 1,911 crore, reflecting the company's steady performance and continued momentum in its core businesses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/need-a-personal-loan-unlock-rs-5-lakh-instantly-using-just-your-pan-card-2720405-2025-05-06",
      "headline": "Need a personal loan? Unlock Rs 5 lakh instantly using just your PAN cardTo apply online, you simply visit the bank or lender's website and fill out the application form. You'll need to provide your name, date of birth, mobile number, and PAN number."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-156-points-lower-nifty-below-24400-adani-enterprises-falls-4-2720369-2025-05-06",
      "headline": "Sensex ends 156 points lower, Nifty below 24,400; Adani Enterprises falls 4%The BSE Sensex ended 155.77 points lower at 80,641.07, while the NSE Nifty50 fell 81.55 points to settle at 24,379.60. Most of the broader market indices also declined during the trading session due to high selling pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-denies-reports-of-stake-sale-to-japans-smbc-calls-it-speculative-2720360-2025-05-06",
      "headline": "Yes Bank denies reports of stake sale to Japan's SMBC, calls it 'speculative'The private sector lender clarified that while it regularly explores business opportunities, there is nothing material to disclose under current regulatory norms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saying-yes-to-a-joint-loan-here-is-how-it-can-affect-your-credit-score-2720344-2025-05-06",
      "headline": "Saying yes to a joint loan? Here's how it can affect your credit scoreEvery time an EMI is paid on time, it reflects positively on both borrowers' credit profiles. Over time, this builds your credit score. If you were added as a co-applicant to help someone get a loan because your own score was low, this is your chance to improve it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-5-common-mistakes-you-must-avoid-while-filing-your-tax-returns-2720287-2025-05-06",
      "headline": "ITR filing 2025: 5 common mistakes you must avoid while filing your tax returnsUsing the wrong ITR form can delay your tax processing or, worse, your return may get rejected. Also, filing your ITR is not the final step, you must also verify it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/is-the-global-economy-breathing-easier-as-trump-eases-up-on-tariffs-2720249-2025-05-06",
      "headline": "Is the worst over for global economy as Trump eases stance on tariffs?Even as Trump suggests deals are near with countries like India, Japan, and South Korea, and China reviews a fresh proposal from Washington, the global economy isn't breathing easy yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/opted-for-new-tax-regime-here-is-a-look-at-key-benefits-what-you-can-claim-itr-filing-2720230-2025-05-06",
      "headline": "Opted for new tax regime? Here's a look at key benefits, what you can claimThe government brought in the new tax regime to make things simpler for taxpayers. It gives you more tax slabs with lower rates, which means you may end up paying less tax."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pawandeep-rajan-indian-idol-12-winner-out-of-icu-friend-shares-pic-from-hospital-2721611-2025-05-08",
      "headline": "Singer Pawandeep Rajan out of ICU, friend shares pic from hospitalIndian Idol 12 winner Pawandeep Rajan recently met with a serious car accident near Moradabad, has been shifted from the ICU to a private room. His friend Govind Digari shared the update. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-donates-rs-10-crore-from-retro-profits-to-agaram-foundation-2721542-2025-05-08",
      "headline": "Suriya donates Rs 10 crore from Retro profits to Agaram FoundationActor Suriya, along with Retro director Karthik Subbaraj, donated Rs 10 crore to the Agaram Foundation, funding education for underprivileged children. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-begins-kantara-2-last-schedule-after-junior-artiste-death-2721486-2025-05-08",
      "headline": "Rishab Shetty begins last schedule of Kantara 2 after death of junior artisteRishab Shetty's 'Kantara: Chapter 1', a prequel to the 2022 blockbuster film, is among the most highly-anticipated Indian films of the year. Despite several setbacks during production, the makers have now entered the final schedule of shoots for the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/munawar-faruqui-shehnaaz-gill-kubbra-sait-celebs-attend-acting-workshop-saurabh-sachdeva-2721573-2025-05-08",
      "headline": "Munawar Faruqui, Shehnaaz Gill, and celebs take acting class from Saurabh SachdevaShehnaaz Gill, Karan Veer Mehra, Munawar Faruqui, Kubbra Sait, and others participated in a workshop conducted by veteran actor Saurabh Sachdeva. Take a look at the pictures here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/reborn-rich-season-2-production-confirmed-without-song-joong-ki-2721540-2025-05-08",
      "headline": "Reborn Rich Season 2 production confirmed without Song Joong-kiThe popular 2022 K-drama 'Reborn Rich' has been officially renewed for its eagerly-awaited second season, promising a gripping tale of ambition, love, and power within a global corporation. Fans can look forward to a large-scale production that aims to connect emotionally with international audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/piku-and-its-healing-powers-how-a-film-becomes-so-much-more-2721544-2025-05-08",
      "headline": "Piku and its healing powers: How a film becomes so much more...'Piku', starring Amitabh Bachchan, Deepika Padukone, and the late legendary actor, Irrfan, completes 10 years today. While on the surface, it remains a film about a father-daughter relationship and the art of subtle romance, it is so much more than that. It, in fact, is life itself. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/filmmakers-rush-to-secure-operation-sindoor-title-15-studios-seek-registration-2721518-2025-05-08",
      "headline": "Filmmakers rush to secure Operation Sindoor title, 15 studios seek registrationFollowing India's precision strikes on terror camps, numerous Bollywood studios are rushing to register the title 'Operation Sindoor' for potential war films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-says-taimur-has-stage-fear-doesnt-want-to-perform-publicly-2721512-2025-05-08",
      "headline": "Saif Ali Khan says Taimur has stage fear, doesn't want to perform publiclyTaimur Ali Khan, son of actors Saif Ali Khan and Kareena Kapoor Khan, is not interested in acting, said his father. Saif shared that his son feels shy on stage and doesn't like performing in front of people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-opens-up-about-directors-comment-on-her-motherhood-priorities-amid-busy-schedule-2721475-2025-05-08",
      "headline": "When director told Deepika she's 'taking motherhood seriously': Is it compliment?In a recent interview, Deepika Padukone shared an incident where a director commented on her commitment to motherhood. Deepika welcomed her daughter, Dua, in September last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prateik-babbar-smita-patil-recalls-being-a-drug-addict-was-thrown-out-of-film-institute-2721517-2025-05-08",
      "headline": "Prateik Smita Patil recalls being a drug addict: Was thrown out of film instituteActor Prateik Smita Patil opened up on battling substance abuse. The 'HIT 3' and 'Sikandar' actor revealed that he regrets being in that reckless phase of life. Patil also narrated how he was 'thrown out' of a film institute due to addiction.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mandana-mandana-karimi-reacts-after-outrage-over-instagram-post-mentioning-operation-sindoor-2721510-2025-05-08",
      "headline": "Proud of India, have deep respect for government: Mandana Karimi after backlashIranian actor Mandana Karimi faced backlash after her Instagram post mentioning Operation Sindoor. Now, she had reacted to it, clarifying that she is proud of India and has deep respect for the Indian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saif-ali-khan-rani-mukerjis-hum-tum-to-re-release-on-may-16-kunal-kohli-2721505-2025-05-08",
      "headline": "Nostalgia alert! Saif Ali Khan, Rani Mukerji's Hum Tum to re-release on May 16Actors Saif Ali Khan and Rani Mukerji's 'Hum Tum' is set to re-release in theatres on May 16. The film is directed by Kunal Kohli. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-recalls-his-kambakht-one-sided-love-says-it-still-hurts-2721472-2025-05-08",
      "headline": "Karan Johar recalls his 'kambakht' one-sided love, says it still hurtsKaran Johar talked about experiencing one-sided love, and becoming the 'worst version' of himself, until he used those difficult feelings to 'empower' himself. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dept-q-trailer-the-queens-gambit-maker-scott-frank-team-up-with-matthew-goode-2721471-2025-05-08",
      "headline": "Dept. Q trailer: The Queen's Gambit maker promises hooking investigative thrillerThe new Netflix series 'Dept. Q', created by Scott Frank of 'The Queen's Gambit' fame, features Matthew Goode as an eccentric detective dealing with past trauma while solving cold cases in Scotland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/aimee-lou-wood-clarifies-rumours-about-snl-skit-and-her-viral-crying-pics-2721470-2025-05-08",
      "headline": "Aimee Lou Wood on SNL skit and her viral crying pics: People are quite boredActor Aimee Lou Wood, best known for 'Sex Education', has spoken up about the viral photos of her crying in public, days after the controversial SNL skit. She clarified that the pictures were unrelated and also urged people to stop over analysing everything. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoor-deletes-india-doesnt-provoke-post-on-operation-sindoor-disables-comments-2721459-2025-05-08",
      "headline": "Shahid Kapoor deletes 'India doesn't provoke' post on Op Sindoor, disables commentsActor Shahid Kapoor deleted his initial post about India's Operation Sindoor and disabled the comments. The actor's unexplained move has left the fans confused. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raghav-juyals-funny-note-to-shah-rukh-khan-for-ending-his-met-gala-confusion-2721450-2025-05-08",
      "headline": "Actor Raghav Juyal's funny note to SRK for ending his Met Gala confusionActor Raghav Juyal shared a quirky note and thanked SRK for clearing his doubts regarding the Met Gala 2025. This came after SRK's grand debut at the fashion event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-funny-review-to-fancy-breakfast-served-after-met-gala-2025-2721447-2025-05-08",
      "headline": "Diljit Dosanjh gives desi-style review to fancy breakfast served after Met GalaDiljit Dosanjh's funny review of a fancy Louis Vuitton breakfast after the Met Gala 2025 has gone viral, winning over fans with his desi humour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/producer-bhushan-kumar-on-whats-stalling-bollywood-films-dont-fail-budgets-do-2721441-2025-05-08",
      "headline": "Producer Bhushan Kumar on what's stalling Bollywood: Films don't fail, budgets doBhushan Kumar, head of T-Series, is happy as Ajay Devgn's 'Raid 2' is nearing Rs 100 crore in India. In an interview with India Today, he shared insights on Bollywood's challenges and the path to recovery."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/anyone-attempting-to-harm-indias-sovereignty-must-be-prepared-for-op-sindoor-like-action-warns-rajnath-singh-2721619-2025-05-08",
      "headline": "Test our patience, and be ready for a quality response: Rajnath Singh warns PakAnyone attempting to harm India's sovereignty must be prepared for Op Sindoor-like action, warns Rajnath Singh"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-live-updates-indian-armed-forces-carried-out-precision-strike-at-terrorist-camps-2720648-2025-05-07",
      "headline": "Live: Meet at Pak PM's office as India hits Lahore air defence, sirens in IslamabadOperation Sindoor Live Updates: India carried out precision strikes on terror camps in Pakistan and Pakistan-occupied Kashmir in response to the April 22 Pahalgam terror attack which killed 26 people. The government said its actions have been \"focused, measured and non-escalatory in nature\" and that \"no Pakistani military facilities have been targeted\". Prime Minister Narendra Modi told his colleagues in the Cabinet meeting that it was a proud moment for everyone following the operation. The government held an all-party meeting today and briefed the Opposition following Operation Sindoor.  Follow Indiatoday.in for the latest updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-lahore-blasts-multiple-series-of-explosions-sirens-people-panic-smoke-clouds-india-operation-sindoor-strikes-2721373-2025-05-08",
      "headline": "India foils Pak drone-missile attack, 'neutralises' Lahore air defence as counterThe government said Pakistan's drones and missiles were neutralised by the Integrated Counter UAS Grid and the Russia-made S-400 Triumf air defence systems. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/rawalpindi-cricket-stadium-damaged-after-being-hit-by-drones-2721584-2025-05-08",
      "headline": "Drone hits Rawalpindi stadium hours before Pakistan Super League match: SourcesA match between Peshawar Zalmi and Karachi Kings was scheduled for 8 pm today, but a drone strike has damaged parts of the stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-air-force-sudarshan-chakra-s-400-air-defence-missile-systems-foil-pakistan-drone-attacks-targets-neutralised-2721562-2025-05-08",
      "headline": "Russia-made 'Sudarshan Chakra' thwarted Pak's midnight drone-missile attackPakistan attempted to strike multiple military targets across northern and western India using drones and missiles. The aerial assault was neutralised by the S-400 air defence systems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-leaves-lahore-defenceless-hits-china-made-hq-9-missile-shield-hq-9p-air-defence-system-pakistan-2721592-2025-05-08",
      "headline": "India leaves Lahore defenceless hitting China-made missile shield. What's HQ-9PIndia countered an aerial attack by Pakistan on the night of May 7 and hit its air defence system. India's strike destroyed the HQ-9P missile defence system, built by China and customised for Pakistan. China uses the HQ-9 system, with a longer range of surface-to-air missiles, for its defence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-withdraws-operation-sindoor-trademark-says-it-was-filed-inadvertently-2721608-2025-05-08",
      "headline": "Reliance withdraws 'Operation Sindoor' trademark, says it was filed inadvertentlyOn May 7, four different applications were made to trademark the phrase 'Operation Sindoor' under Class 41 of the Nice Classification. This category includes services like films, shows, online content, education, cultural events and more."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/masood-azhar-jaish-e-mohammed-brother-critically-injured-bahawalpur-strikes-india-pakistan-subhan-allah-mosque-operation-sindoor-2721533-2025-05-08",
      "headline": "Jaish chief's brother critically injured in strikes under Op Sindoor: SourcesAbdul Rauf Asghar, Masood Azhar's brother and Jaish's second-in-command, is reportedly undergoing treatment at a Pakistani military hospital after sustaining serious injuries in the Indian strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-6/",
      "headline": "How Pakistan's terror policy evolved in KashmirIn part 6 of our series on the history of terrorism in Kashmir, we revisit Pakistan's cyclical strategy of direct, overt and covert war in Kashmir, and how it evolved over the years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-tensions-what-might-have-gone-into-making-operation-sindoor-planning-grand-success-2721418-2025-05-08",
      "headline": "What might have gone into making Operation Sindoor a successOperation Sindoor's success can be attributed to the culmination of the seamless integration of satellite, drone, and human intelligence with precise strikes by the IAF's fighter jets, executed under tight inter-service coordination. This is what might have happened in the days leading up to Operation Sindoor, and how it was executed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-an-ongoing-operation-rajnath-singh-briefed-all-parties-minister-kiren-rijiju-2721504-2025-05-08",
      "headline": "Op Sindoor is ongoing; 100 terrorists killed, all parties told, say sourcesOperation Sindoor: At the all-party meeting, Defence Minister Rajnath Singh said 100 terrorists were killed in 'precise' attacks on nine terrorist hideouts in Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-stock-exchange-trading-halted-after-7-per-cent-crash-post-operation-sindoor-2721546-2025-05-08",
      "headline": "Pakistan's Karachi Stock Exchange crashes 7%, trading haltedAccording to the official notification from the exchange, trading was paused after the benchmark index plunged 6.3% in a short period. The sharp fall triggered automatic circuit breakers to stop further decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/operation-sindoor-iafs-s-400-sudarshan-chakra-missile-shield-that-foiled-paks-escalatory-bid-2721572-2025-05-08",
      "headline": "IAF's S-400 Sudarshan Chakra: Indian iron dome roars after Op SindoorThe S-400, known as \"Sudarshan\" in Indian service, named after the mythological Sudarshan Chakra, is among the world's most advanced long-range air defence missile systems. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/video-explainer-lahore-left-without-air-defence-system-indian-counterstrike-2721602-2025-05-08",
      "headline": "Video explainer: Lahore left without Air Defence System in Indian counterstrikeIndian armed forces struck air defence radars and destroyed air defence systems in Lahore after Islamabad attempted to strike 15 military targets in India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-cross-border-shelling-along-loc-jk-kupwara-2721288-2025-05-08",
      "headline": "15 civilians, jawan killed in Pak firing along LoC; UN team, villagers evacuatedThe latest round of shelling came hours after India launched Operation Sindoor, a high-precision military offensive that struck nine terror camps in Pakistan and Pakistan-Occupied Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-advisory-personnel-citizens-in-lahore-after-drone-explosions-leave-or-shelter-in-place-2721576-2025-05-08",
      "headline": "Leave safely: US advisory for personnel, citizens in Lahore after drone explosionsUS citizens who find themselves in an \"area of active conflict\" have been advised to leave if they can do so safely. \"If it is not safe to leave, they should shelter-in-place,\" the US asked its citizens in Lahore and Pakistan's Punjab Province."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/bridal-gold-worth-22-lakh-mysteriously-returned-after-theft-on-wedding-night-kannur-2721604-2025-05-08",
      "headline": "Kerala bride's gold worth Rs 22 lakh stolen on wedding night reappears days laterA newlywed's bridal gold worth Rs 22 lakh vanished mysteriously on her wedding night in Kannur, only to be found days later in a white cloth bag near her husband's home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/missile-debris-found-in-amritsar-village-amid-india-pak-tensions-army-on-spot-2721525-2025-05-08",
      "headline": "Missile debris found in Amritsar village after locals heard explosionsMissile debris has been found in the border area in Amritsar after locals said they heard multiple explosions past midnight. Army personnel are on the spot to assess the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/operation-sindoor-chinese-jets-pakistan-fighter-aircraft-jf17-thunder-pok-2721551-2025-05-08",
      "headline": "Were Chinese jets used by Pak to respond to Op Sindoor? What Beijing saidOperation Sindoor, launched at 1.05 am on Wednesday, involved a 25-minute series of precision strikes by Indian air, naval, and ground forces on nine terror camps in Pakistan POK."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/black-smoke-pope-conclave-vetican-city-sistine-chapel-2721580-2025-05-08",
      "headline": "No pope elected on second day, black smoke emerges from Sistine ChapelCardinals burn the ballot papers and mix them with chemicals to show how proceedings are going -- black signalling no pope and white announcing a new pontiff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengaluru-kamikaze-suicide-drones-loitering-munitions-operation-sindoor-pakistan-2721479-2025-05-08",
      "headline": "Desi 'suicide drones', expert in shoot-to-kill ops, make debut with SindoorOperation Sindoor: The SkyStriker 'suicide drones', developed in Bengaluru, made their operational debut during Operation Sindoor, where nine terror camps in Pakistan were destroyed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sajid-mir-who-terrorist-killed-brought-back-to-life-by-pakistan-india-pahalgam-attack-2025-war-operation-sindoor-2720961-2025-05-08",
      "headline": "Who is Sajid Mir, terrorist killed and brought back to life by PakistanDuring a press briefing on Operation Sindoor, Foreign Secretary Vikram Misri spoke about Sajid Mir, a terrorist declared dead by Pakistan in its attempt to shield him. Under international pressure, Pakistan was forced to admit that Mir was alive. He was one of the key plotters of the 26/11 terror attacks and the chief handler of the terrorists involved in the attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/kamikaze-suicide-drone-makers-stock-jumps-after-operation-sindoor-details-here-2721607-2025-05-08",
      "headline": "Kamikaze 'suicide' drone maker's stock jumps after 'Operation Sindoor'. Details hereListed on the NASDAQ under the ticker ESLT, Elbit's stock rose 3.62% over two sessions, jumping from $400.00 on May 6 to $414.47 by May 8. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rajasthan-royals-ipl-2025-marco-jansen-sandeep-sharma-2721623-2025-05-08",
      "headline": "Rajasthan rope in South Africa pacer to replace injured Sandeep SharmaIPL 2025: Rajasthan Royals (RR) have picked Nandre Burger as a replacement for Sandeep Sharma, who has been ruled out of the tournament due to a finger injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-recalls-rohit-sharmas-test-debut-in-tribute-to-retiring-captain-2721585-2025-05-08",
      "headline": "Sachin Tendulkar recalls Rohit Sharma's Test debut in tribute to retiring captainLegendary India cricketer Sachin Tendulkar recalled Rohit Sharma's Test debut against West Indies at Eden Gardens, Kolkata in 2013 following his retirement from the longest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-shifted-dharamshala-ahmedabad-operation-sindoor-2721566-2025-05-08",
      "headline": "PBKS vs MI: IPL match likely to be shifted from Dharamshala to AhmedabadIPL 2025, PBKS vs MI: The Gujarat Cricket Association confirmed that the BCCI requested the board to host Sunday's match between Punjab Kings and Mumbai Indians. Dharamshala was scheduled to host the big-ticket game, but the closure of the airport after Operation Sindoor has led to "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bcci-to-honour-indian-armed-forces-with-b-praak-performance-in-dharamshala-2721541-2025-05-08",
      "headline": "BCCI to honour Indian armed forces with B Praak performance in DharamshalaThe BCCI will honour the Indian armed forces with a special tribute ahead of the IPL 2025 clash between Punjab Kings and Delhi Capitals in Dharamshala on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-pbks-dharamshala-weather-forecast-rain-updates-2721536-2025-05-08",
      "headline": "PBKS vs DC Dharamshala weather forecast today: Will rain affect crunch IPL 2025 game?IPL 2025: Delhi Capitals take on Punjab Kings in a crucial clash at the HPCA Stadium in Dharamshala. Both teams would not want rain interruption as the result of the big-ticket game could be decisive to their playoffs hopes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-should-lead-indias-test-side-on-england-tour-anil-kumble-2721516-2025-05-08",
      "headline": "Jasprit Bumrah should lead India's Test side on England tour: Anil KumbleFormer India skipper Anil Kumble said he would like to see pace spearhead Jasprit Bumrah lead India in their five-match Test tour of England in June-July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakaravarthy-fined-25-per-cent-of-his-match-fees-for-code-of-conduct-breach-2721483-2025-05-08",
      "headline": "BCCI punishes Varun Chakravarthy for IPL code of conduct breach vs CSKKolkata Knight Riders (KKR) spinner Varun Chakravarthy was fined 25 percent of his match fee and handed one demerit point for breaching the IPL Code of Conduct against Chennai Super Kings (CSK) at Eden Gardens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-indian-commentary-standard-criticism-explosive-interview-2721464-2025-05-08",
      "headline": "Rohit Sharma slams Indian commentary standards, says criticism is agenda-drivenRohit Sharma accused Indian commentators of focusing on a single star player and repeatedly discussing his personal life, rather than appreciating and analysing the game itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-vs-dc-ipl-2025-preview-predicted-xi-team-news-dharamshala-pitch-conditions-2721444-2025-05-08",
      "headline": "DC in must-win territory against PBKS in Dharamsala as playoff race heats upPBKS vs DC, IPL 2025 Preview: Delhi Capitals will be desperate to halt their downward slide and keep their playoff hopes alive when they face an in-form Punjab Kings in a high-stakes IPL 2025 clash in Dharamsala on Thursday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retirement-childhood-coach-dineesh-lad-explains-2721428-2025-05-08",
      "headline": "Rohit Sharma did not announce Test retirement in a hurry: Childhood coachRohit Sharma's childhood coach Dinesh Lad said his ward did not take the decision to retire from Test cricket in haste. Rohit announced retirement weeks ahead of the selection for the Test team for the tour of England, starting June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-mikel-arteta-arsenal-better-team-loss-psg-2721419-2025-05-08",
      "headline": "Arteta claims Arsenal are best team in Champions League despite semi-final exitMikel Arteta claimed that Arsenal were the best team in the Champions League and insisted they were \"better\" than PSG, despite their semi-final defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakaravarthy-fined-25-per-cent-of-his-match-fees-for-code-of-conduct-breach-2721483-2025-05-08",
      "headline": "BCCI punishes Varun Chakravarthy for IPL code of conduct breach vs CSKKolkata Knight Riders (KKR) spinner Varun Chakravarthy was fined 25 percent of his match fee and handed one demerit point for breaching the IPL Code of Conduct against Chennai Super Kings (CSK) at Eden Gardens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-indian-commentary-standard-criticism-explosive-interview-2721464-2025-05-08",
      "headline": "Rohit Sharma slams Indian commentary standards, says criticism is agenda-drivenRohit Sharma accused Indian commentators of focusing on a single star player and repeatedly discussing his personal life, rather than appreciating and analysing the game itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-vs-dc-ipl-2025-preview-predicted-xi-team-news-dharamshala-pitch-conditions-2721444-2025-05-08",
      "headline": "DC in must-win territory against PBKS in Dharamsala as playoff race heats upPBKS vs DC, IPL 2025 Preview: Delhi Capitals will be desperate to halt their downward slide and keep their playoff hopes alive when they face an in-form Punjab Kings in a high-stakes IPL 2025 clash in Dharamsala on Thursday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retirement-childhood-coach-dineesh-lad-explains-2721428-2025-05-08",
      "headline": "Rohit Sharma did not announce Test retirement in a hurry: Childhood coachRohit Sharma's childhood coach Dinesh Lad said his ward did not take the decision to retire from Test cricket in haste. Rohit announced retirement weeks ahead of the selection for the Test team for the tour of England, starting June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-mikel-arteta-arsenal-better-team-loss-psg-2721419-2025-05-08",
      "headline": "Arteta claims Arsenal are best team in Champions League despite semi-final exitMikel Arteta claimed that Arsenal were the best team in the Champions League and insisted they were \"better\" than PSG, despite their semi-final defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-dc-sunil-joshi-press-conference-yuzi-chahal-dharamsala-2721407-2025-05-08",
      "headline": "Chess champion Yuzi Chahal has always proved naysayers wrong: PBKS coach JoshiIPL 2025: Speaking to the press on the eve of their game against Delhi Capitals in Dharamsala, Punjab Kings' spin-bowling coach Sunil Joshi heaped praise on Yuzvendra Chahal's consistency in the IPL and his ability to bounce back from setbacks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rajasthan-royals-lhuandre-pretorius-replacement-nitish-rana-2721403-2025-05-08",
      "headline": "Replacement spree continues as RR sign 19-year-old South Africa starRajasthan Royals have signed Lhuan-dre Pretorius to replace the injured Nitish Rana. This move comes amid a broader trend of mid-season player replacements in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-deserved-a-farewell-test-manoj-tiwari-2721401-2025-05-08",
      "headline": "Rohit Sharma deserved a farewell Test: Manoj TiwaryFormer India batter and Bengal captain Manoj Tiwari feels Rohit Sharma deserved a proper farewell on the field rather than an announcement via social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-kkr-vs-csk-chennai-super-kings-batting-coach-mike-hussey-press-conference-2721378-2025-05-08",
      "headline": "IPL 2025: Win over KKR brings immense satisfaction, says CSK's batting coachChennai Super Kings batting coach Michael Hussey said the hard-fought win over KKR would bring immense satisfaction to the players, support staff, and fans alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-ajinkya-rahane-press-conference-csk-beat-kkr-playoff-chances-2721372-2025-05-08",
      "headline": "Ajinkya Rahane believes KKR can still qualify for playoffs despite CSK lossKolkata Knight Riders captain Ajinkya Rahane remains hopeful of playoff qualification following a heartbreaking loss to Chennai Super Kings at Eden Gardens on Wednesday. He believes KKR can still make it if they win their remaining two league matches, both of which are away fixtures.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-dc-delhi-capitals-coach-hemang-badani-pre-match-press-conference-2721367-2025-05-08",
      "headline": "DC head coach praises 'Operation Sindoor' as India strikes Pakistan terror campsDelhi Capitals (DC) head coach Hemang Badani expressed his heartfelt support for the Indian Army during a pre-match press conference ahead of DC's IPL 2025 encounter against Punjab Kings (PBKS) on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-test-retirement-ajinkya-rahane-reaction-2721357-2025-05-08",
      "headline": "Rohit Sharma's Test retirement surprises Ajinkya Rahane: I will call himRohit Sharma's sudden Test retirement came as a shock to Ajinkya Rahane, his longtime teammate and friend. Speaking moments after KKR's loss to CSK on Wednesday, a visibly surprised Rahane learned of the news during the post-match press conference.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-jasprit-bumrah-captain-shubman-gill-deputy-msk-prasad-2721353-2025-05-08",
      "headline": "Jasprit Bumrah should captain in England Tests, Shubman Gill his deputy: MSK PrasadIndia tour of England: Speaking to IndiaToday.in, former chairman of selectors MSK Prasad dismissed concerns over Jasprit Bumrah's fitness and urged the selection committee to appoint him captain for the England Tests. India are on the lookout for Rohit Sharma's successor after the 38-year-old retired from Test cricket on Wednesday, May 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-ajinkya-rahane-press-conference-csk-beat-kkr-playoff-chances-2721372-2025-05-08",
      "headline": "Ajinkya Rahane believes KKR can still qualify for playoffs despite CSK lossKolkata Knight Riders captain Ajinkya Rahane remains hopeful of playoff qualification following a heartbreaking loss to Chennai Super Kings at Eden Gardens on Wednesday. He believes KKR can still make it if they win their remaining two league matches, both of which are away fixtures.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-dc-delhi-capitals-coach-hemang-badani-pre-match-press-conference-2721367-2025-05-08",
      "headline": "DC head coach praises 'Operation Sindoor' as India strikes Pakistan terror campsDelhi Capitals (DC) head coach Hemang Badani expressed his heartfelt support for the Indian Army during a pre-match press conference ahead of DC's IPL 2025 encounter against Punjab Kings (PBKS) on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-test-retirement-ajinkya-rahane-reaction-2721357-2025-05-08",
      "headline": "Rohit Sharma's Test retirement surprises Ajinkya Rahane: I will call himRohit Sharma's sudden Test retirement came as a shock to Ajinkya Rahane, his longtime teammate and friend. Speaking moments after KKR's loss to CSK on Wednesday, a visibly surprised Rahane learned of the news during the post-match press conference.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-jasprit-bumrah-captain-shubman-gill-deputy-msk-prasad-2721353-2025-05-08",
      "headline": "Jasprit Bumrah should captain in England Tests, Shubman Gill his deputy: MSK PrasadIndia tour of England: Speaking to IndiaToday.in, former chairman of selectors MSK Prasad dismissed concerns over Jasprit Bumrah's fitness and urged the selection committee to appoint him captain for the England Tests. India are on the lookout for Rohit Sharma's successor after the 38-year-old retired from Test cricket on Wednesday, May 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virender-sehwag-on-rohit-sharma-test-retirement-2721347-2025-05-08",
      "headline": "Who will not miss Rohit Sharma? Virender Sehwag on star batter's Test retirement Virender Sehwag heaped praise on Rohit Sharma and said that everyone will miss having the star batter in the squad after he announced his Test retirement on Wednesday, May 7. Sehwag feels that Rohit will have no regrets about making the call. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-playoff-qualification-scenario-explained-2721342-2025-05-08",
      "headline": "IPL 2025: Can KKR make it to the playoffs despite heartbreaking CSK loss?KKR's title defence took a massive hit after their heartbreaking loss to CSK at the Eden Gardens on Wednesday, May 7. However, the three-time champions can still make it to the playoffs, but will need help from others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-head-coach-hemang-badani-comments-on-uncertainty-around-pbks-game-2721271-2025-05-08",
      "headline": "DC head coach on uncertainty around Delhi vs Punjab game: Have full faith in BCCIDelhi Capitals (DC) head coach Hemang Badani opened up on the uncertainty around their upcoming game against Punjab Kings in Dharamsala and put his faith in BCCI to take the right call. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-reach-champions-league-final-after-defeating-arsenal-2721336-2025-05-08",
      "headline": "PSG beat Arsenal to set up title clash with Inter MilanParis Saint-Germain secured their place in the UEFA Champions League final with a 2-1 victory over Arsenal. The French champions will face Inter Milan in a historic showdown, marking the first European clash between the two clubs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharmas-topsy-turvy-test-career-which-found-its-groove-in-2nd-innings-2721278-2025-05-08",
      "headline": "Rohit Sharma: A topsy-turvy Test career which found its groove in 2nd inningsRohit Sharma announced his retirement from Test cricket after a 12-year-long career, which could well have begun three years earlier if not for a freak injury. After failing to live up to the expectations, the Hitman came back to rule the format in his rebirth as a Test opener and guided India to several memorable victories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-retirement-kkr-vs-csk-eden-gardens-kolkata-2721270-2025-05-08",
      "headline": "Dhoni breaks silence on potential retirement: Nothing for me to decide as of nowMS Dhoni commented on his potential retirement and claimed that there is nothing for him to decide at the moment. Dhoni said he will look at the six to eight months after the IPL and make a call. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharmas-wife-ritika-sajdeh-reacts-to-his-test-retirement-2721265-2025-05-07",
      "headline": "Rohit Sharma's wife Ritika reacts to his Test retirement in emotional Instagram storyIndia captain Rohit Sharma's wife, Ritika Sajdeh, has given an emotional reaction to his Test retirement on her Instagram story. Rohit hung up his boots from the longest format after playing 67 matches and scoring 4301 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-csk-dewald-brevis-noor-ahmad-urvil-patel-varun-chakravarthy-2721237-2025-05-07",
      "headline": "Dewald Brevis, Noor help CSK snap losing streak, dent KKR playoffs hopesChennai Super Kings (CSK) ended their four-match losing streak with a two-wicket win over Kolkata Knight Riders (KKR) in Match 57 of the Indian Premier League 2025 (IPL 2025). Dewald Brevis (52 off 25) and Noor Ahmad (4/31) played a key role in CSK's win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-test-retirement-gautam-gambhir-rishabh-pant-indian-cricket-2721247-2025-05-07",
      "headline": "Rohit Sharma Test retirement: Gautam Gambhir, Rishabh Pant and cricketing world reactGautam Gambhir, Rishabh Pant and others paid tribute to Rohit Sharma after the 38-year-old announced his decision to retire from Test cricket. Rohit announced his decision on May 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retirement-msk-prasad-exclusive-odi-world-cup-2721217-2025-05-07",
      "headline": "Rohit Sharma's Test retirement before England tour a selfless call: MSK PrasadSpeaking to IndiaToday.in, former chairman of the selection committee MSK Prasad praised Rohit Sharma for announcing his retirement ahead of the upcoming England tour. Prasad also reflected on the decision to promote Rohit to open in Tests, a move that played a key role in reviving his career in red-ball cricket."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-devdutt-padikkal-injured-mayank-agarwal-harry-brook-dc-2721218-2025-05-07",
      "headline": "IPL 2025: RCB lose Devdutt Padikkal to injury, DC sign Harry Brook replacementRCB suffer a big blow as Devdutt Padikkal has been ruled out of the remainder of the season due to an injury. Bengaluru have signed Mayank Agarwal as Padikkal's replacement for the rest of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-honours-indian-armed-forces-operation-sindoor-during-kkr-vs-csk-game-2721213-2025-05-07",
      "headline": "IPL 2025: BCCI honours Indian armed forces' Operation Sindoor during KKR vs CSK gameThe Board of Control for Cricket in India (BCCI) honoured the Indian Armed Forces' Operation Sindoor, which targeted terrorist infrastructure in Pakistan and Pakistan-Occupied Kashmir (PoK) in the aftermath of the Pahalgam terrorist attack."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}