{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-delegation-set-to-visit-india-on-august-25-for-key-trade-discussions-2763066-2025-07-29",
      "headline": "US delegation set to visit India on August 25 for key trade discussionsIndia is asking the US to remove the proposed 26% extra tariff and reduce high duties on Indian steel and aluminium products, which currently face tariffs of up to 50%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itat-rules-property-transfer-between-spouses-is-valid-for-tax-exemption-2762977-2025-07-29",
      "headline": "Wife pays no income tax after selling two houses gifted by husbandA woman from Mumbai won a court case at the Income Tax Appellate Tribunal (ITAT), which said she did not have to pay income tax after selling two flats worth Rs 6 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-427-points-higher-nifty-above-24800-ril-up-2-percent-2763034-2025-07-29",
      "headline": "Sensex ends 427 points higher; Nifty above 24,800; RIL up 2%The S&P BSE Sensex added 446.93 points to close at 81,337.95, while the NSE Nifty50 gained 140.20 points to end at 24,821.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/save-tax-when-selling-property-house-section-54-ltcg-long-term-capital-gains-money-tips-personal-finance-2763025-2025-07-29",
      "headline": "Selling your house? Here's how you can save lakhs in taxesSection 54 of the Income Tax Act allows exemption on long-term capital gains earned from the sale of a residential house or plot of land if the profit is reinvested in buying or constructing a new residential property in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hdfc-icici-and-4-other-banks-offering-high-fd-rates-check-now-2763008-2025-07-29",
      "headline": "HDFC, ICICI and 4 other banks offering high FD rates. Check nowICICI Bank also offers 6.6% interest, but on a longer tenure, between 2 and 10 years. For senior citizens, the rate is 7.10%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-ipo-details-size-drhp-issue-size-promoters-peyush-bansal-neha-bansal-2762974-2025-07-29",
      "headline": "Lenskart takes first step towards IPO, files draft with SebiAccording to the draft papers, the IPO will include a fresh issue of shares worth up to Rs 2,150 crore and an offer for sale (OFS) of up to 13.23 crore shares by existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanction-hit-nayara-turns-to-rediff-after-microsoft-suspension-report-2762966-2025-07-29",
      "headline": "EU-sanctioned refiner Nayara turns to Rediff after Microsoft suspension: ReportThe shift comes in the wake of fresh European Union sanctions announced on July 18 that targeted Nayara for its links to Russia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/refiner-nayara-trims-crude-runs-in-wake-of-eu-sanctions-2762964-2025-07-29",
      "headline": "Russia-backed Indian Refiner Nayara trims crude runs in wake of EU sanctionsPrivately-held Nayara, which runs India's third-biggest refinery at the port of Vadinar in the western state of Gujarat, controls nearly 8% of the country's total refining capacity of about 5.2 million bpd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-tax-filing-deadline-getting-extended-again-these-key-itr-utilities-still-pending-2762945-2025-07-29",
      "headline": "Is tax filing deadline getting extended again? These key ITR utilities still pendingThis year, the ITR forms were notified only by the end of May, much later than usual. After that, the utilities were rolled out in phases, and key tools are still missing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-august-1-deadline-trump-tariff-jamieson-greer-piyush-goyal-2762921-2025-07-29",
      "headline": "Will India clinch a US trade deal before August 1? Here's what we knowSpeaking last week, Commerce Minister Piyush Goyal said that there were \"no sticking points\" in the India-US relationship and added that issues like immigration and H-1B visas had not come up in the current trade talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nasscom-expects-more-layoffs-as-it-industry-faces-major-transition-2762890-2025-07-29",
      "headline": "Nasscom expects more layoffs as IT industry faces major transitionThis comes just days after Tata Consultancy Services (TCS), the country's largest IT employer, announced it would cut 2% of its global staff. Around 12,000 mid- and senior-level employees will be let go as the company adjusts its team structure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-may-pause-hikes-senior-hiring-after-mass-layoffs-announcement-report-2762869-2025-07-29",
      "headline": "TCS may pause hikes, senior hiring after mass layoffs announcement: ReportTCS shares have dropped nearly 30% over the past year, ranking among the weakest in the Nifty IT index. Shares of the company are down 25% on  year-to-date basis and have fallen nearly 12% in a month.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/mazagon-dock-shipbuilders-share-price-drop-sharpy-q1-results-buy-sell-explained-2762857-2025-07-29",
      "headline": "Explained: Why Mazagon Dock share price tumbled 5% after Q1 resultsThe Mazagon Dock Shipbuilders stock was down 4.50% to Rs 2,664.25 on the Bombay Stock Exchange (BSE) at 10:34 am. In a month, the stock has tumbled 18%, still up almost 19% this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/laxmi-india-finance-ipo-open-for-bidding-review-price-band-dates-subscribe-skip-latest-gmp-2762818-2025-07-29",
      "headline": "Laxmi India Finance IPO open for bidding: Should you subscribe? Check detailsThe IPO includes a fresh issue of 1.05 crore shares worth Rs 165.17 crore and an offer for sale of 56 lakh shares worth Rs 89.09 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-200-points-lower-nifty-below-24700-infosys-down-1-percent-2762817-2025-07-29",
      "headline": "Sensex opens 200 points lower, Nifty below 24,700; Infosys down 1%The S&P BSE Sensex was down by 62.31 points to 80,828.71, while the NSE Nifty50 lost 7.20 points to 24,673.70 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-shailesh-jejurikar-pg-new-global-ceo-indian-born-leadership-change-consumer-good-company-2762814-2025-07-29",
      "headline": "Who is P&G's new Indian-born global CEO, Shailesh JejurikarShailesh Jejurikar's promotion was announced as part of a leadership change at P&G. The company's current CEO, Jon R. Moeller, will move into the role of executive chairman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/aditya-infotech-ipo-review-open-for-bidding-subscribe-skip-gmp-today-price-band-investment-2762807-2025-07-29",
      "headline": "Aditya Infotech IPO open for bidding: Should you subscribe? Check GMPThe bidding window will remain open till July 31, 2025. Aditya Infotech IPO consists of a fresh issue worth Rs 500 crore and an offer for sale (OFS) of shares worth Rs 800 crore by promoter group entities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/brigade-hotel-ventures-ipo-allotment-status-latest-gmp-listing-date-share-price-2762793-2025-07-29",
      "headline": "Brigade Hotel Ventures IPO allotment: Step-by-step guide to check statusThose who applied for shares can check their allotment status either on the Bombay Stock Exchange (BSE) website or through the portal of KFin Technologies Limited, the official registrar for this IPO."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/should-you-be-paying-house-rent-with-credit-card-2762579-2025-07-28",
      "headline": "Should you be paying rent with credit card?More and more people are using credit cards to pay rent. But does the benefit of extra days to pay and cashback outweigh the fees and credit score impact? Let's break it down."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-572-points-lower-nifty-below-24700-kotak-bank-down-7-percent-2762509-2025-07-28",
      "headline": "Sensex ends 572 points lower, Nifty below 24,700; Kotak Bank down 7%The S&P BSE Sensex lost 572.07 points to end at 80,891.02, while the NSE Nifty50 was down by 156.10 points to close at 24,680.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/5-upcoming-ipos-nsdl-mb-engineering-sri-lotus-aditya-infotech-laxmi-india-finance-rs-7000-crore-details-2762504-2025-07-28",
      "headline": "5 IPOs worth Rs 7,000 crore to open for bidding this week. Check detailsThis week, five mainboard IPOs are opening for bidding: NSDL (National Securities Depository), M&B Engineering, Sri Lotus Developers & Realty, Aditya Infotech, and Laxmi India Finance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-regime-vs-new-which-can-help-you-save-money-in-fy25-2762473-2025-07-28",
      "headline": "Can opting for old regime help you save tax in FY25?Many believe that under the new tax regime, there is no tax on income up to Rs 12 lakh. However, this change will only take effect from April 1, 2025, and will apply to returns filed for the FY26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/edelweiss-radhika-gupta-slams-dior-for-ignoring-indian-artisans-behind-200k-coat-2762481-2025-07-28",
      "headline": "Edelweiss' Radhika Gupta slams Dior for ignoring Indian artisans behind $200K coatThe luxury brand Dior showcased a $200K coat adorned with traditional Lucknowi 'mukaish' embroidery. While 12 Indian artisans spent 34 days crafting it, their names, and India's contribution, went unacknowledged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-layoffs-ai-automation-or-not-ceo-k-krithivasan-statement-skill-mismatch-2762417-2025-07-28",
      "headline": "Is TCS cutting jobs because of AI? Here's what CEO K Krithivasan saysTCS CEO K Krithivasan said that the company is still looking for highly skilled professionals, especially those who can support TCS's plans to expand into new technologies and markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-homeowners-need-to-know-about-house-property-tax-rules-explains-tax-advisor-2762379-2025-07-28",
      "headline": "What homeowners need to know about house property tax rules, explains tax advisorBuying a home comes with more than just EMIs and maintenance; it brings tax implications too. Sujit Bangar, Founder of TaaxBuddy.com, breaks down the key rules every homeowner should be aware of to avoid surprises during filing season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-income-tax-bill-2025-3-key-changes-that-could-make-itr-filing-easier-2762342-2025-07-28",
      "headline": "New Income Tax Bill 2025: 3 key changes that could make ITR filing easierThe committee submitted its report to Parliament on 21 July. It's over 4,500 pages long and includes 285 suggestions to improve the draft New Income Tax Bill, 2025, which is meant to replace the old 1961 Act. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/blusmart-wallet-refund-90-day-period-lapse-app-not-working-fraud-sebi-jaggi-brothers-2762313-2025-07-28",
      "headline": "Have you got your BluSmart refund yet? It's been 90 daysBluSmart wallet refund: As July comes to an end, users say they have not received their money back and are struggling to even access the app."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/kotak-mahindra-bank-share-price-decline-reason-q1-results-analyst-views-2762288-2025-07-28",
      "headline": "Explained: Why Kotak Mahindra Bank share price fell over 6% todayThe decline came after the private lender posted a weaker-than-expected set of results for the April–June quarter. The stock decline comes in the wake of a 7% year-on-year drop in standalone net profit to Rs 3,282 crore, even though the bank reported steady growth in core lending activity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-over-300-points-lower-nifty-below-24800-kotak-bank-down-4-percent-2762275-2025-07-28",
      "headline": "Sensex opens over 300 points lower, Nifty below 24,800; Kotak Bank down 4%The S&P BSE Sensex was down by 225.28 points to 81,237.81, while the NSE Nifty50 lost 43.60 points to 24,793.40 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-chip-deal-tesla-usd-165-billion-deal-share-price-jump-ai-2762270-2025-07-28",
      "headline": "Samsung to power Tesla's future with $16.5 billion chip deal: ReportThis long-term contract comes at a crucial time for Samsung. While the company is one of the world's biggest makers of memory chips, its foundry business, which produces chips for other companies, has struggled to keep up with demand and competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krutrim-layoffs-bhavish-aggarwal-ola-100-employees-second-round-job-cuts-report-2762254-2025-07-28",
      "headline": "Bhavish Aggarwal's Krutrim lays off over 100 employees in fresh job cuts: ReportThe layoffs at Krutrim affected a large part of the firm's linguistics team, which had only recently joined the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/gng-electronics-ipo-allotment-status-registrar-bishare-bse-website-gmp-today-listing-date-2762239-2025-07-28",
      "headline": "GNG Electronics IPO allotment out. Here's how to check status, what GMP signalsInvestors who applied for the IPO can check the allotment status through two official platforms: the BSE website and the website of the IPO registrar, Bigshare Services Pvt Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-layoff-job-cut-12000-what-it-company-offer-to-affected-employees-updated-hr-policy-ai-2762192-2025-07-27",
      "headline": "TCS layoff: What the company is offering to 12,000 affected employeesTCS job cut: The move is part of a broader plan to adapt to changing technology trends and streamline operations as the company aims to become a \"future-ready\" organisation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-boosts-exports-future-trade-deals-2762144-2025-07-27",
      "headline": "We negotiate confidently: Minister's signal to US after landmark UK trade pactIndia has signed a landmark free trade agreement with the UK, marking a new phase in bilateral economic ties. The government aims to use this momentum to secure future deals with the US and other key partners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sona-blw-comstar-board-agm-vs-sunjay-kapur-mother-rani-over-shareholding-director-appointment-2761991-2025-07-27",
      "headline": "A will, a letter, and a brewing dispute: Sunjay Kapur's mother vs Sona ComstarAs Sunjay Kapur's mother takes on Sona Comstar, the unfolding dispute could shape into a high-stakes clash of legacy, legality, and loss in one of India's storied business families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/joint-home-loan-or-personal-loan-what-smarter-for-young-couples-buying-property-tax-benefits-joint-home-loan-2761973-2025-07-27",
      "headline": "Joint home loan or personal loan? What's smarter for young couples buying propertyBuying your first home as a couple is exciting, but figuring out how to finance it? That's where things get tricky. Should you go for a joint home loan or take a personal loan? Let's break it down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-formula-1-racing-dream-taxation-roadblock-motorsport-entertainment-tax-2761667-2025-07-26",
      "headline": "How taxes drove Formula 1 out of IndiaFormula 1 didn't leave India because of a lack of fans or infrastructure. It left because of unclear policies, tax confusion, and a system that didn't treat it like a sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-hires-chatgpt-co-creator-as-chief-scientist-to-lead-new-ai-lab-glbs-2761556-2025-07-26",
      "headline": "Meta hires ChatGPT co-creator as chief scientist to lead new AI labMeta has appointed ChatGPT co-creator Shengjia Zhao as chief scientist of its new Superintelligence Lab, aiming to advance AGI and regain AI leadership after Llama 4's weak performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/explained-why-india-uk-free-trade-agreement-is-a-big-deal-for-both-nations-2761520-2025-07-25",
      "headline": "Explained: Why India-UK free trade agreement is a big deal for both nationsIndia and the United Kingdom have formally sealed a Comprehensive Economic and Trade Agreement, a deal described as the \"biggest, most economically significant trade deal that the UK has made since leaving the EU.\" "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/how-anupam-kher-knew-he-was-different-but-no-less-slept-on-platform-played-65-at-28-2763237-2025-07-29",
      "headline": "Slept on platform, played 65 at 28: How Anupam Kher knew he was different but no lessIn his book 'Different But No Less', Anupam Kher tells the story of an autistic girl defying odds in 'Tanvi: The Great', but also mirrors it with his own journey of resilience. From arriving in Mumbai with Rs 37 to challenging every stereotype thrown his way, Kher's book is a personal reflection on what it means to be seen as different. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/christopher-nolan-faces-backlash-films-the-odyssey-in-western-sahara-morocco-occupation-controversy-2763207-2025-07-29",
      "headline": "Christopher Nolan faces backlash for filming The Odyssey in disputed Western SaharaChristopher Nolan is filming parts of The Odyssey in the disputed Western Sahara region. The decision has drawn criticism over the ongoing Moroccan occupation and repression of the Sahrawi people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lindsay-lohan-private-life-dubai-paparazzi-culture-freakier-friday-release-2763167-2025-07-29",
      "headline": "Lindsay Lohan on life in Dubai far from Hollywood, paparazzi: The privacy is uniqueActor Lindsay Lohan recently opened up on her peaceful and private life in Dubai with her family. She drew parallels to Hollywood's intrusive paparazzi culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/anupama-rupali-ganguly-welcomes-tulsi-smriti-irani-kyunki-saas-bhi-kabhi-bahu-thi-premiere-star-plus-jiohotstar-2763116-2025-07-29",
      "headline": "Anupama Rupali Ganguly welcomes Smriti Irani's Tulsi Virani ahead of Kyunki premiereIn a unique crossover in Indian television, actor Rupali Ganguly as her titular character from 'Anupamaa' video called Tulsi Virani (Smriti Irani) from 'Kyunki Saas Bhi Kabhi Bahu Thi'. The show returns on Star Plus on July 29, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kussh-sinha-reacts-to-saiyaara-being-copied-from-k-film-nikita-roy-is-original-2763125-2025-07-29",
      "headline": "Kussh Sinha reacts to Saiyaara being copied from K-film: Nikita Roy is originalDirector Kussh Sinha seemingly addressed plagiarism allegations against 'Saiyaara'. He further emphasised that his film 'Nikita Roy' has an original storyline. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-tries-to-learn-instagram-shares-candid-video-2763197-2025-07-29",
      "headline": "Amitabh Bachchan tries to learn Instagram, shares candid videoMuch to the delight of his fans, Amitabh Bachchan shared a candid video on Instagram where he's seen trying to familiarise himself with the app. In the clip, the 82-year-old openly shares his thoughts on navigating its features and quirks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mrunal-thakur-backs-dhadak-2-ahead-of-clash-with-son-of-sardaar-2-tripti-dimri-responds-2763175-2025-07-29",
      "headline": "Mrunal Thakur cheers for Dhadak 2 ahead of clash with Son of Sardaar 2. Triptii reactsActor Mrunal Thakur cheered for 'Dhadak 2' before its clash with 'Son of Sardaar 2'. Both films are set for release on August 1. 'Dhadak 2' actor Triptii Dimri responded with best wishes for both the films. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditya-dhar-wishes-dhurandhar-sanjay-dutt-on-his-birthday-2763094-2025-07-29",
      "headline": "Aditya Dhar wishes Dhurandhar Sanjay Dutt on birthday: You're pure fireDirector Aditya Dhar shared an unseen photo with actor Sanjay Dutt from the sets of 'Dhurandhar' on Tuesday. He extended birthday wishes to the actor in a social media post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vikrant-massey-begins-shoot-in-colombo-for-sri-sri-ravi-shankar-biopic-white-2763161-2025-07-29",
      "headline": "Vikrant Massey begins shoot in Colombo for Sri Sri Ravi Shankar biopic White: Report Vikrant Massey has started shooting for 'White', a biopic on Sri Sri Ravi Shankar. According to sources, the actor is currently on a month-long schedule in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/never-watched-anime-series-naruto-2762989-2025-07-29",
      "headline": "So you've never watched this brilliant anime series called Naruto? Let's fix thatNaruto anime series explained: Discover why this iconic anime series is a true cult classic. We cover Naruto characters, Shonen story arcs, ninja world lore, and everything that made Naruto one of the most influential anime of all time.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kingdom-spy-thriller-vijay-deverakonda-us-premiere-before-india-release-2763128-2025-07-29",
      "headline": "Not India, Vijay Deverakonda's Kingdom to first release in the US'Kingdom', starring Vijay Deverakonda, is set for a staggered release with the US premiere on July 30 and India following on July 31. Directed by Gowtam Tinnanuri, it also stars Bhagyashri Borse. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/a-government-that-acts-anupam-kher-on-operation-mahadev-success-exclusive-2763144-2025-07-29",
      "headline": "A government that acts: Anupam Kher on Operation Mahadev success | ExclusiveIn an exclusive interview with IndiaToday.in, veteran actor Anupam Kher backed the government and Armed Forces after the top Lashkar commander behind the Pahalgam attack was eliminated in Operation Mahadev."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hiten-tejwani-gauri-pradhan-kyunki-saas-bhi-kabhi-bahu-thi-reboot-smriti-irani-2763096-2025-07-29",
      "headline": "Hiten Tejwani on returning to Kyunki and reuniting with Smriti IraniHiten Tejwani and Gauri Pradhan return to their iconic roles in the Kyunki Saas Bhi Kabhi Bahu Thi reboot. The show blends its classic legacy with new themes and a fresh generation of characters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-on-dharmendra-shabana-azmi-kiss-in-rocky-aur-rani-kii-prem-kahaani-2763011-2025-07-29",
      "headline": "Karan Johar on Dharmendra-Shabana kiss in Rocky aur Rani: I may turn it into a filmKaran Johar called 'Rocky Aur Rani Kii Prem Kahaani' one of his best films, ranking it alongside 'My Name Is Khan' and 'Kuch Kuch Hota Hai'. He also addressed the buzz around Dharmendra and Shabana Azmi's kiss, hinting at a possible film on their love story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ramayana-part-1-lord-rama-ranbir-kapoor-invests-in-dneg-most-expensive-film-4000-crore-nitesh-tiwari-2762846-2025-07-29",
      "headline": "Ranbir Kapoor is not just actor in Ramayana, but also an investor in its VFX firmActor Rabir Kapoor has made yet another visionary move in his cinematic career. He has invested in the global VFX giant DNEG, which has done the visual effects of 'Ramayana', according to reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ibrahim-ali-khan-kajol-sarzameen-reduces-indian-army-to-a-prop-and-that-is-its-biggest-failure-2762920-2025-07-29",
      "headline": "Sarzameen reduces Indian Army to a prop and that's its biggest failure'Sarzameen' claims to be an action thriller but turns out to be just a family story with no real focus on the Indian Army. It misses the action, emotion, and respect that people expect in an Army-based film.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/only-murders-in-the-building-season-five-crime-solving-trio-returns-steve-martin-selena-gomez-martin-short-jiohotstar-2763038-2025-07-29",
      "headline": "Only Murders in the Building 5: The crime solving trio returns for a new caseThe fifth season of 'Only Murders In The Building' returns exclusively on JioHotstar from September 9. The upcoming show explores a mysterious death and a dangerous web of secrets in New York."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/naseeruddin-shah-jrd-tata-made-in-india-a-titan-story-series-amazon-mx-player-2762997-2025-07-29",
      "headline": "Naseeruddin Shah brings JRD Tata to life in Made in India-A Titan StoryActor Naseeruddin Shah's look as JRD Tata Was recently unveiled on the legendary industrialist's 121st birth anniversary. Shah plays a pivotal role in the upcoming show - 'Made in India – A Titan Story'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khans-sitaare-zameen-par-to-release-on-youtube-at-rs-100-per-view-2763072-2025-07-29",
      "headline": "Aamir Khan's Sitaare Zameen Par to release on YouTube at Rs 100 per viewAamir Khan has officially announced that 'Sitaare Zameen Par' will stream on YouTube as a pay-per-view from August 1, priced at Rs 100. The film will be available on Khan's YouTube channel. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-speech-on-operation-sindoor-highlights-exposing-nuke-bluff-terror-hubs-modi-unveils-5-pronged-army-success-against-pak-2763273-2025-07-30",
      "headline": "Exposing nuke bluff, terror hubs: PM unveils 5-pronged Army success against PakPrime Minister Narendra Modi said that had it not been for the preparations India made in the defence sector over the past decade, the losses incurred in this era of technology could have been insurmountable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-says-us-india-trade-deal-not-finalised-yet-hints-at-20-25-tariff-glbs-2763283-2025-07-30",
      "headline": "Donald Trump says US-India trade deal not finalised yet, hints at 20-25% tariffThe US president has said the India-US trade deal is not yet finalised and hinted at imposing 20-25% tariffs on Indian exports ahead of the August 1 deadline. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/say-here-donald-trump-is-liar-rahul-gandhis-dare-over-india-pak-truce-claim-2763115-2025-07-29",
      "headline": "Show Indira's courage, call Trump liar: Rahul Gandhi dares PM on US's truce claimsDuring the Operation Sindoor debate in Parliament, Congress leader Rahul Gandhi launched a sharp attack on the Centre, questioning its handling of India-Pakistan tensions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/no-world-leader-asked-india-to-stop-operation-sindoor-pm-modi-in-parliament-2763195-2025-07-29",
      "headline": "No world leader asked India to stop Op Sindoor: PM fires back after Congress jabsPrime Minister Narendra Modi told the Lok Sabha on Tuesday that no world leader asked India to stop its counter-terror operation against Pakistan. PM's remarks came amid repeated jabs by Congress about US President Donald Trump's ceasefire mediation claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-gautam-gambhir-oval-pitch-curator-fight-controversy-london-2763097-2025-07-29",
      "headline": "Gambhir vs Oval pitch curator: Real reason why both men had heated argumentThe real reason behind Gautam Gambhir's spat with Oval pitch curator Lee Fortis has been revealed, with the latter giving his thoughts on the incident, which took place on Tuesday, July 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jd-vance-called-3-4-times-i-was-in-meeting-pm-modi-recounts-op-sindoor-call-with-us-v-p-2763201-2025-07-29",
      "headline": "Vance called 3-4 times, I was in meeting: PM recounts Op Sindoor call with US VeepNoticing around four missed calls, PM Modi said he returned the call to US Vice President JD Vance. He further said that Vance warned him that Pakistan was planning a massive attack on India, to which he responded, \"Our response will be even stronger.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bas-karo-bahut-maara-hai-pm-says-pak-pleaded-for-ceasefire-after-op-sindoor-2763158-2025-07-29",
      "headline": "Bas karo, bahut maara hai: PM says Pak pleaded for ceasefire after Op SindoorPrime Minister Narendra Modi mocked Pakistan in Parliament during the Operation Sindoor debate and said they pleaded for ceasefire after Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/pahalgam-massacre-indias-pain-pakistans-punishment-2763074-2025-07-29",
      "headline": "Pahalgam massacre: India's pain, Pakistan's punishmentWith the terrorist who led the Pahalgam attackers killed by security forces, we revisit the April 22 tragedy that prompted India to exercise hard options against Pakistan"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/rahul-gandhis-table-thump-invites-dont-break-house-property-remark-from-speaker-2763119-2025-07-29",
      "headline": "Rahul Gandhi's table thump invites 'don't break House property' remark from SpeakerCongress leader Rahul Gandhi, while speaking in Lok Sabha, thumped the table, slamming PM Modi, to which Speaker Om Birla said 'don't break this is House's property'.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/russia-to-face-new-sanctions-in-10-days-if-it-fails-to-act-on-ukraine-trump-glbs-2763274-2025-07-30",
      "headline": "Russia to face new sanctions in 10 days if it fails to act on Ukraine: TrumpUS President Donald Trump warned that tariffs and other measures will hit Russia in 10 days unless it acts on Ukraine, downplaying oil concerns and citing stalled progress from Moscow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/economist-meghnad-desai-dies-at-85-pm-recalls-his-role-in-boosting-india-uk-ties-glbs-2763286-2025-07-30",
      "headline": "Economist Meghnad Desai dies at 85, PM recalls his role in boosting India-UK tiesLord Meghnad Desai, eminent economist and House of Lords member, has died at 85. He was a former professor at the London School of Economics, author, and influential voice in India-UK relations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-bulandshahr-aiims-delhi-pregnancy-2762943-2025-07-29",
      "headline": "UP woman's rare liver pregnancy stuns doctors, only 18 known cases worldwideA 30-year-old woman from Bulandshahr, Uttar Pradesh, was found to be carrying a 12-week-old foetus in her liver, an extremely rare form of ectopic pregnancy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mathura-kulhad-war-video-viral-reminds-internet-baghpat-clash-lassi-shopkeepers-fight-barsana-2763080-2025-07-29",
      "headline": "'Kulhad war' near Mathura temple reminds Internet of Baghpat battle. Watch videoIn what's now being dubbed the \"Kulhad war,\" shopkeepers hurled bricks and beat each other with sticks in broad daylight over a customer dispute - all outside one of Braj's most sacred sites. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/dhankhar-dhamaka-the-inside-story-of-what-forced-the-vice-president-out-2763052-2025-07-29",
      "headline": "Dhankhar dhamaka: The inside story of what forced the vice-president outAmong the reasons: an impeachment motion against a judge, purported internal dissent and some power play"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-impact-feature/story/katy-perry-and-justin-trudeaus-dinner-date-in-montreal-sparks-romance-rumours-glbs-2763282-2025-07-30",
      "headline": "Katy Perry and Justin Trudeau's dinner date in Montreal sparks romance rumoursKaty Perry and Justin Trudeau dined privately at a Montreal bistro, fueling romance rumours. With both recently single, their cozy meeting sparked speculation and social media buzz despite no official comment.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-butchers-of-pahalgam-hunted-down-killed-explained-five-points-amit-shah-parliament-operation-sindoor-2762947-2025-07-29",
      "headline": "Signal tracking to IB intel, how butchers of Pahalgam hunted down | 5 pointsThe three terrorists killed on Monday in Kashmir were the ones who gunned down 26 people in Pahalgam on April 22, Union Home Minister Amit Shah confirmed in Parliament. This is how the three terrorists were tracked down through tech and human intel, and killed as part of Operation Mahadev."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/rohit-bals-poetry-in-thread-lives-on-through-arjun-rampal-this-couture-season-2763077-2025-07-29",
      "headline": "Rohit Bal's poetry in thread lives on through Arjun Rampal this couture seasonArjun Rampal, in a velvet sherwani closed the show for Rohit Bal at Hyundai India Couture Week 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/epstein-stole-women-from-mar-a-lago-spa-including-virginia-giuffre-donald-trump-glbs-2763294-2025-07-30",
      "headline": "Epstein 'stole' women from Mar-a-Lago spa, including Virginia Giuffre: TrumpUS President Donald Trump said Jeffrey Epstein repeatedly took employees from the Mar-a-Lago spa, including young women. Trump denied abuse allegations and said he cut ties with Epstein over staff poaching years ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/auspicious-time-needed-terrorists-pm-modi-slams-opposition-for-questioning-op-mahadev-timing-2763182-2025-07-29",
      "headline": "Do we need auspicious time, PM retorts as Oppositon questions Op Mahadev timingPrime Minister Narendra Modi lashed out at the Opposition for questioning the timing of Operation Mahadev, in which all three terrorists involved in the Pahalgam attack were killed, saying they became \"frustrated\" and \"hopeless\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/dmk-mla-t-udhayasuriyan-under-fire-for-saying-poda-to-man-questioning-road-conditions-2762823-2025-07-29",
      "headline": "DMK MLA under fire for saying 'poda' to resident questioning road conditionsDuring a state-wide campaign in Tamil Nadu's Kallakurichi, DMK MLA Udhayasuriyan was caught on camera dismissing a local resident with \"poda\" and threatening beatings when questioned about the lack of proper roads."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/baby-skin-health-risks-cosmetics-child-makeup-products-2763100-2025-07-29",
      "headline": "How makeup on babies can trigger allergies and disrupt hormonesWhat does science say when it comes to applying cosmetic products on babies? Find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bihar-sir-supreme-court-says-will-step-in-if-mass-exclusions-anyone-alive-deleted-as-deceased-2763200-2025-07-29",
      "headline": "Will step in if mass exclusions, or anyone alive is deleted: SC on Bihar SIRThere are about 12 writ petitions and several intervention applications before the Supreme Court, challenging the validity of the ongoing Special Intensive Revision (SIR) of the electoral rolls in Bihar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/uk-will-recognise-palestinian-state-unless-israel-agrees-to-immediate-ceasefire-in-gaza-glbs-2763271-2025-07-29",
      "headline": "UK will recognise Palestinian state unless Israel agrees to 'immediate ceasefire'Starmer's announcement came on Tuesday amid growing outrage over images of starving children in Gaza and mounting pressure within his own party. \"The Palestinian people have endured terrible suffering,\" he told reporters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/india-beats-china-as-top-smartphone-supplier-to-the-us-thanks-to-apples-big-iphone-shift-2763126-2025-07-29",
      "headline": "India beats China as top smartphone supplier to the USIndia has become the largest supplier of smartphones to the US for the first time, overtaking China, and it's Apple that has made this possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/how-anupam-kher-knew-he-was-different-but-no-less-slept-on-platform-played-65-at-28-2763237-2025-07-29",
      "headline": "Slept on platform, played 65 at 28: How Anupam Kher knew he was different but no lessIn his book 'Different But No Less', Anupam Kher tells the story of an autistic girl defying odds in 'Tanvi: The Great', but also mirrors it with his own journey of resilience. From arriving in Mumbai with Rs 37 to challenging every stereotype thrown his way, Kher's book is a personal reflection on what it means to be seen as different. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/christopher-nolan-faces-backlash-films-the-odyssey-in-western-sahara-morocco-occupation-controversy-2763207-2025-07-29",
      "headline": "Christopher Nolan faces backlash for filming The Odyssey in disputed Western SaharaChristopher Nolan is filming parts of The Odyssey in the disputed Western Sahara region. The decision has drawn criticism over the ongoing Moroccan occupation and repression of the Sahrawi people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lindsay-lohan-private-life-dubai-paparazzi-culture-freakier-friday-release-2763167-2025-07-29",
      "headline": "Lindsay Lohan on life in Dubai far from Hollywood, paparazzi: The privacy is uniqueActor Lindsay Lohan recently opened up on her peaceful and private life in Dubai with her family. She drew parallels to Hollywood's intrusive paparazzi culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/anupama-rupali-ganguly-welcomes-tulsi-smriti-irani-kyunki-saas-bhi-kabhi-bahu-thi-premiere-star-plus-jiohotstar-2763116-2025-07-29",
      "headline": "Anupama Rupali Ganguly welcomes Smriti Irani's Tulsi Virani ahead of Kyunki premiereIn a unique crossover in Indian television, actor Rupali Ganguly as her titular character from 'Anupamaa' video called Tulsi Virani (Smriti Irani) from 'Kyunki Saas Bhi Kabhi Bahu Thi'. The show returns on Star Plus on July 29, 2025."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/avinash-sable-world-athletics-championships-injury-setback-2763270-2025-07-29",
      "headline": "Sable suffers injury setback, World Championship hopes in doubtIndia's leading 3000m steeplechase athlete, Avinash Sable, has sustained a significant knee injury, potentially jeopardizing his participation in the World Athletics Championships set to take place in Tokyo this September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-oval-curator-viral-photo-pitch-brendon-mccullum-viral-double-standard-2763268-2025-07-29",
      "headline": "Same curator, two rules? Gambhir denied pitch access, McCullum stood on itHours after the altercation between India head coach Gautam Gambhir and Oval pitch curator Lee Fortis, an old photo of the curator standing on the pitch with England head coach Brendon McCullum went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/joao-felix-leaves-chelsea-joins-al-nassr-cristiano-ronaldo-2763264-2025-07-29",
      "headline": "Joao Felix leaves Chelsea, joins Portugal teammate Ronaldo at Al NassrJoao Felix has completed a permanent move from Chelsea to Al-Nassr in a deal that could rise to £43.7 million (€50 million). The agreement sees the Portugal international sign a two-year contract with the Saudi Pro League side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-mitchell-santner-tom-latham-1st-test-2763251-2025-07-29",
      "headline": "Mitchell Santner replaces injured Tom Latham as skipper for 1st TestZIM vs NZ: Mitchell Santner has replaced Tom Latham as New Zealand skipper for the first Test against Zimbabwe after Latham was ruled out due to a shoulder injury. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-all-rounder-preference-no-8-balanced-batting-bowling-oval-test-2763245-2025-07-29",
      "headline": "India coach explains decision to play an extra batting option at No.8India batting coach Sitanshu Kotak on Tuesday explained the team's rationale for selecting an all-rounder at number eight instead of a specialist bowler."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-5th-test-kuldeep-yadav-sitanshu-kotak-2763241-2025-07-29",
      "headline": "Kuldeep Yadav to play fifth Test? Sitanshu Kotak opens up on team combinationENG vs IND, 5th Test: Sitanshu Kotak, the Indian batting coach, opened up on India's possible combination for the ongoing Test at Old Trafford in Manchester. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-nathan-lyon-dig-ben-stokes-manchester-test-drama-2763230-2025-07-29",
      "headline": "Get them out: Australia's Lyon takes a dig at England over Manchester dramaAustralian spinner Nathan Lyon has offered his take on the controversy that followed the drawn fourth Test between England and India at Old Trafford, suggesting England's frustration was misdirected and avoidable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wankhede-stadium-ipl-jerseys-theft-2763208-2025-07-29",
      "headline": "Security manager of Wankhede stadium arrested for 'theft' of IPL jerseysA 43-year-old security manager at Wankhede Stadium was arrested on Tuesday for allegedly stealing 261 IPL jerseys valued at Rs 6.52 lakh from the BCCI's storage, according to police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-jasprit-bumrah-availability-fitness-5th-test-batting-coach-reaction-2763204-2025-07-29",
      "headline": "Bumrah fit, call on his workload soon: India coach on Oval Test availabilityIndia's batting coach Sitanshu Kotak has said that although Jasprit Bumrah is currently \"fit\", his availability for the fifth Test at The Oval will be subject to an assessment of his recent workload."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/taskin-ahmed-bangladesh-pacer-threats-assaults-2763191-2025-07-29",
      "headline": "Taskin Ahmed accused of assault and threats, Bangladesh pacer clarifiesTaskin Ahmed, Bangladesh's premier fast bowler, has been accused of assaulting and threatening his childhood friend. The speedster, meanwhile, released a statement where he denied the accusations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwiksairaj-rankireddy-chirag-shetty-macau-open-treesa-jolly-gayatri-gopichand-upset-2763184-2025-07-29",
      "headline": "Satwik-Chirag ease into second round, Treesa-Gayatri suffer shock exitTop Indian men's doubles duo Satwiksairaj Rankireddy and Chirag Shetty kicked off their Macau Open Super 300 campaign in style with a dominant straight-game win, even as top-seeded women's pair Treesa Jolly and Gayatri Gopichand suffered a shock first-round exit.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-nathan-lyon-dig-ben-stokes-manchester-test-drama-2763230-2025-07-29",
      "headline": "Get them out: Australia's Lyon takes a dig at England over Manchester dramaAustralian spinner Nathan Lyon has offered his take on the controversy that followed the drawn fourth Test between England and India at Old Trafford, suggesting England's frustration was misdirected and avoidable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wankhede-stadium-ipl-jerseys-theft-2763208-2025-07-29",
      "headline": "Security manager of Wankhede stadium arrested for 'theft' of IPL jerseysA 43-year-old security manager at Wankhede Stadium was arrested on Tuesday for allegedly stealing 261 IPL jerseys valued at Rs 6.52 lakh from the BCCI's storage, according to police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-jasprit-bumrah-availability-fitness-5th-test-batting-coach-reaction-2763204-2025-07-29",
      "headline": "Bumrah fit, call on his workload soon: India coach on Oval Test availabilityIndia's batting coach Sitanshu Kotak has said that although Jasprit Bumrah is currently \"fit\", his availability for the fifth Test at The Oval will be subject to an assessment of his recent workload."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/taskin-ahmed-bangladesh-pacer-threats-assaults-2763191-2025-07-29",
      "headline": "Taskin Ahmed accused of assault and threats, Bangladesh pacer clarifiesTaskin Ahmed, Bangladesh's premier fast bowler, has been accused of assaulting and threatening his childhood friend. The speedster, meanwhile, released a statement where he denied the accusations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwiksairaj-rankireddy-chirag-shetty-macau-open-treesa-jolly-gayatri-gopichand-upset-2763184-2025-07-29",
      "headline": "Satwik-Chirag ease into second round, Treesa-Gayatri suffer shock exitTop Indian men's doubles duo Satwiksairaj Rankireddy and Chirag Shetty kicked off their Macau Open Super 300 campaign in style with a dominant straight-game win, even as top-seeded women's pair Treesa Jolly and Gayatri Gopichand suffered a shock first-round exit.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-afc-womens-asian-cup-2026-group-draw-japan-chinese-taipei-vietnam-2763172-2025-07-29",
      "headline": "India women's football team clubbed with Japan, Vietnam in Group C of Asian CupIndia have been drawn in Group C with Japan, Chinese Taipei and Vietnam for the AFC Women's Asian Cup 2026. The group stage matches will decide qualification for the 2027 FIFA Women's World Cup in Brazil, heightening competition among the teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/holger-rune-veronika-kudermetova-chat-interaction-2763171-2025-07-29",
      "headline": "I have a husband: Holger Rune playfully shut down by Russian tennis starRussian tennis ace Veronika Kudermetova recently recounted a light-hearted and amusing interaction with Denmark's up-and-coming talent, Holger Rune.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kolkata-knight-riders-part-ways-with-ipl-winning-head-coach-chandrakant-pandit-2763142-2025-07-29",
      "headline": "KKR part ways with IPL-winning head coach Chandrakant PanditKolkata Knight Riders have announced the departure of head coach Chandrakant Pandit after the IPL 2025 season. The franchise aims to rebuild as it searches for a new coach following a disappointing campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-sitanshu-kotak-press-conference-oval-pitch-2763117-2025-07-29",
      "headline": "Gambhir vs Oval pitch curator: India batting coach clears the air on argumentENG vs IND: India's batting coach, Sitanshu Kotak, addressed the reported rift between Gautam Gambhir and pitch curator Lee Fortis ahead of the fifth Test, set to begin on July 31 at the Kennington Oval in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/divya-deshmukh-chess-world-cup-win-powered-by-mental-toughness-susan-polgar-2763111-2025-07-29",
      "headline": "Divya Deshmukh's Chess World Cup triumph fuelled by mental toughness: Susan PolgarLegendary Grandmaster Susan Polgar has credited Divya Deshmukh's stunning World Cup victory to her unwavering determination and mental toughness, after the teenager delivered yet another landmark moment for Indian chess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-chirag-top-10-bwf-rankings-lakshya-sen-unnati-hooda-2763101-2025-07-29",
      "headline": "Satwik-Chirag returns to top 10, Lakshya, Unnati climb up in singlesIn the latest BWF Rankings, India's badminton stars are on the rise again. Satwiksairaj Rankireddy and Chirag Shetty are back into the world's top 10 in men's doubles, while Lakshya Sen moves to No. 17 in men's singles category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-gautam-gambhir-oval-pitch-curator-fight-controversy-london-2763097-2025-07-29",
      "headline": "Gambhir vs Oval pitch curator: Real reason why both men had heated argumentThe real reason behind Gautam Gambhir's spat with Oval pitch curator Lee Fortis has been revealed, with the latter giving his thoughts on the incident, which took place on Tuesday, July 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sunil-gavaskar-loud-talk-manchester-2763095-2025-07-29",
      "headline": "Why didn't you declare earlier? Gavaskar shuts down England's loud talkENG vs IND: Sunil Gavaskar criticised England's tactics in the fourth Test at Old Trafford in Manchester, where India played out 143 overs in their second innings to save the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/divya-deshmukh-chess-world-cup-win-powered-by-mental-toughness-susan-polgar-2763111-2025-07-29",
      "headline": "Divya Deshmukh's Chess World Cup triumph fuelled by mental toughness: Susan PolgarLegendary Grandmaster Susan Polgar has credited Divya Deshmukh's stunning World Cup victory to her unwavering determination and mental toughness, after the teenager delivered yet another landmark moment for Indian chess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-chirag-top-10-bwf-rankings-lakshya-sen-unnati-hooda-2763101-2025-07-29",
      "headline": "Satwik-Chirag returns to top 10, Lakshya, Unnati climb up in singlesIn the latest BWF Rankings, India's badminton stars are on the rise again. Satwiksairaj Rankireddy and Chirag Shetty are back into the world's top 10 in men's doubles, while Lakshya Sen moves to No. 17 in men's singles category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-gautam-gambhir-oval-pitch-curator-fight-controversy-london-2763097-2025-07-29",
      "headline": "Gambhir vs Oval pitch curator: Real reason why both men had heated argumentThe real reason behind Gautam Gambhir's spat with Oval pitch curator Lee Fortis has been revealed, with the latter giving his thoughts on the incident, which took place on Tuesday, July 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sunil-gavaskar-loud-talk-manchester-2763095-2025-07-29",
      "headline": "Why didn't you declare earlier? Gavaskar shuts down England's loud talkENG vs IND: Sunil Gavaskar criticised England's tactics in the fourth Test at Old Trafford in Manchester, where India played out 143 overs in their second innings to save the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-nathan-lyon-jamaica-test-2763058-2025-07-29",
      "headline": "Was disappointed on a number of levels: Lyon on West Indies Test snubWI vs AUS: Nathan Lyon said that he was dejected after being left out of the third Test against the West Indies where the Aussies preferred an all-pace attack. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/divya-deshmukh-chess-world-cup-title-2763013-2025-07-29",
      "headline": "Divya Deshmukh's World Cup title: A testament to India's massive strengthDivya Deshmukh's World Cup win underlines the depth of Indian chess across all categories — open, junior, and now women's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-odi-rankings-smriti-mandhana-no1-batter-nat-sciver-brunt-2763031-2025-07-29",
      "headline": "Smriti Mandhana displaced as No.1 ODI batter after ENG vs IND seriesSmriti Mandhana's stint as the No.1 ODI batter in the ICC Rankings came to an end on Tuesday, July 29 as Nat Sciver-Brunt displaced her from the position. Mandhana scored 115 runs in three matches against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-gautam-gambhir-vs-oval-pitch-curator-lee-fortis-2763022-2025-07-29",
      "headline": "Video: Gautam Gambhir involved in fiery verbal spat with Oval pitch curatorIndia head coach Gautam Gambhir picked up a massive fight with The Oval pitch curator on India's first practice session ahead of the final Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-squad-jasprit-bumrah-mohammed-shami-aakash-chopra-2762987-2025-07-29",
      "headline": "Bumrah availability a doubt, No Shami: Aakash Chopra on India's Asia Cup squadAakash Chopra expresses doubts over Jasprit Bumrah's participation in the Asia Cup 2025. He also feels Mohammed Shami will not be included in the Indian squad due to fitness and selection concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jerseys-stolen-bcci-office-security-guard-arrested-2762962-2025-07-29",
      "headline": "IPL 2025 jerseys worth 6.5 lakh rupees stolen from BCCI office: ReportIPL 2025 jerseys worth 6.5 lakh rupees were stolen from BCCI's Mumbai office by a security guard. The theft was done to fund the guard's online gambling addiction, and the man has been apprehended for the crime. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-india-vs-england-manchester-draw-dale-steyn-2762937-2025-07-29",
      "headline": "Steyn plays Devil's advocate, but did India really stretch the draw too far?The cricketing fraternity continues to dissect the final hour of the Manchester Test, where India's decision to bat deep despite a certain draw has sparked debate. Was it grit or a stretch too far in pursuit of individual glory?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-cricket-crisis-shai-hope-2762907-2025-07-29",
      "headline": "Shai Hope admits Windies 'never gave themselves a chance' vs AustraliaWest Indies vs Australia: Captain Shai Hope was left distraught after losing the final T20I match of the series. West Indies were blanked 0-5 in the T20I leg, after being blanked 0-3 in the red ball format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-florian-wirtz-reaction-arne-slot-2762901-2025-07-29",
      "headline": "Joining Liverpool was an easy decision to make: Florian WirtzFlorian Wirtz said it was an easy decision for him to make the switch to Liverpool as he became the club's record transfer. Wirtz made the switch from Bayer Leverkusen for a reported 100 million pounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-india-vs-england-selection-playing-xi-2762879-2025-07-29",
      "headline": "Gambhir defiant despite trailing vs England: Quality of cricket made India proudIndia head coach Gautam Gambhir remains defiant despite India trailing 1-2 in the England Test series. Gambhir has said that the kind of cricket that both teams have played, would have made every cricket lover proud. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-ben-stokes-matthew-hoggard-warning-2762870-2025-07-29",
      "headline": "Stokes, England given warning by 2005 Ashes hero: Can't go to Oval for a draw2005 Ashes hero Matthew Hoggard sent a warning to Ben Stokes and England ahead of the Oval Test, saying that the team shouldn't go into the match against India thinking that they can get a draw and win the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-ajinkya-rahane-gautam-gambhir-2762835-2025-07-29",
      "headline": "Ajinkya Rahane flags major concern for India ahead of final Test matchFormer captain Ajinkya Rahane has flagged a major concern for the Indian Test team going into the final Test match of the series. Rahane believes that the Indian bowling unit has failed to turn up as a group."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}