{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-you-get-a-personal-loan-with-low-credit-score-follow-these-tips-check-details-2652396-2024-12-19",
      "headline": "Can you get a personal loan with low credit score? Check detailsWhile a low credit score may present challenges, using strategies like reduced DTI, and showing income stability, etc. can help secure a personal loan and improve your credit for the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-consumer-dismisses-reports-of-starbucks-exiting-india-2652370-2024-12-19",
      "headline": "Tata Consumer dismisses reports of Starbucks exiting India as baselessAn earlier report claimed that Starbucks was considering exiting the Indian market due to high costs and mounting losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-1000-points-lower-nifty-below-24000-us-federal-reserve-2652345-2024-12-19",
      "headline": "Sensex ends nearly 1,000 points lower, Nifty below 24,000The Sensex ended 964.15 points lower at 79,218.05, while the Nifty50 settled 247.15 points lower at 23,951.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-filing-missed-itr-deadline-here-is-your-guide-to-filing-belated-return-for-ay-2024-25-2652309-2024-12-19",
      "headline": "Missed ITR deadline? Here's your guide to filing belated return for AY 2024-25The last date to file a belated or revised ITR for FY 2023-24 is December 31, 2024—ensure all dues and penalties are paid to avoid additional charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zepto-co-founders-take-top-spot-in-hurun-self-made-entrepreneurs-list-kaivalya-vohra-aadit-palicha-2652329-2024-12-19",
      "headline": "Quick delivery, quicker success: Zepto founders top Hurun listZepto, established in 2021 by the duo of Kaivalya Vohra and Aadit Palicha, has revolutionised the quick-commerce sector with its 10-minute grocery delivery model."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-rate-cut-decision-impact-on-sensex-nifty-indian-stock-markets-2652262-2024-12-19",
      "headline": "US Fed rate cut decision: How will it impact Indian stock markets? The Sensex declined over 1,100 points and the Nifty fell below 24,000 after the US Federal Reserve's decision to cut interest rates by 0.25% to 4.5%, coupled with a hawkish outlook on future rate adjustments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mamata-machinery-ipo-latest-gmp-price-band-should-you-subscribe-stmp-2652244-2024-12-19",
      "headline": "Mamata Machinery IPO: Latest GMP sees sharp rise; should you subscribe?Mamata Machinery, a leading manufacturer of packaging machines, seeks to raise Rs 179.39 crore from its offer for sale, with promoters selling up to 73.82 lakh equity shares at a face value of Rs 10 each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-share-price-jumps-8-percent-settlement-with-aircraft-lessor-genesis-stmp-2652228-2024-12-19",
      "headline": "Explained: Why SpiceJet share price jumped nearly 8% todaySpicejet share price: The airline's share price was up 7.48% to Rs 60.49 on the Bombay Stock Exchange (BSE) at 12:40 pm."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pmay-u-20-who-can-apply-for-affordable-homes-under-pradhan-mantri-awas-yojana-check-eligibility-document-required-application-process-2652215-2024-12-19",
      "headline": "PMAY-U 2.0: Who can apply for affordable homes under Pradhan Mantri Awas YojanaPradhan Mantri Awas Yojana Urban 2.0 aims to provide affordable housing to one crore urban families, focusing on inclusive development through various housing schemes and subsidies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-key-factors-sensex-falls-1100-points-nifty-tumbles-what-next-on-dalal-street-2652208-2024-12-19",
      "headline": "Explained: Why Sensex fell over 1,000 points today and will bloodbath continue? Sensex and Nifty extended their losing streak as global markets plunged after the US Fed's cautious rate cut signal. Will the bears tighten their grip on Dalal Street, or is a reversal in sight?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanathan-textiles-ipo-opens-for-bidding-check-opening-date-closing-date-issue-size-price-band-latest-gmp-2652183-2024-12-19",
      "headline": "Sanathan Textiles IPO opens for bidding: Check issue size, price band, latest GMPSanathan Textiles' Rs 550 crore IPO offers investment opportunities in a leading yarn manufacturer, with proceeds directed towards debt repayment and growth initiatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/inventurus-knowledge-solutions-share-price-today-ipo-listing-43-percent-premium-stmp-2652146-2024-12-19",
      "headline": "Inventurus Knowledge Solutions IPO share listing: Stocks list at 43% premium Inventurus Knowledge Solutions IPO share price: On the NSE, the shares opened at Rs 1,900 per share, marking a premium of 42.96% over the issue price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-hits-all-time-low-rs-85-against-us-dollar-reason-us-fed-rate-cut-market-fall-2652136-2024-12-19",
      "headline": "Rupee plunges to all-time low, reaches Rs 85 against US dollar Rupee falls to all-time low: The rupee dropped to 85.0650 against the US dollar in early trade, compared to 84.9525 on Wednesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-crash-dalal-street-bloodbath-3-reasons-behind-today-fall-us-fed-rate-cut-weak-rupee-2652125-2024-12-19",
      "headline": "Dalal Street bloodbath: 3 reasons behind today's stock market crashStock market crash: Sensex dropped over 1,000 points while Nifty fell below 24,000, marking the fourth consecutive day of losses for the benchmark indices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opening-bell-market-crash-fall-sensex-nifty-wall-street-jitters-hit-india-us-fed-rate-cuts-25-bps-2652111-2024-12-19",
      "headline": "Wall Street jitters: Sensex crashes, Nifty tumbles over US Fed rate cutStock market today: The S&P BSE Sensex was down 925.21 points to 79,256.69, while the NSE Nifty50 lost 309.75 points to 23,889.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/transrail-lighting-ipo-opening-date-price-band-issue-size-gmp-details-before-subscribing-2652106-2024-12-19",
      "headline": "Transrail Lighting IPO: All you need to know. Check GMP before subscribing Transrail Lighting Limited, established in February 2008, is an engineering and construction company specialising in power transmission and distribution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-rate-cut-25-bps-jerome-powell-impact-stock-markets-sensex-nifty-outlook-what-to-expect-2652081-2024-12-19",
      "headline": "US Fed cuts key interest rates by 0.25%: 3 key takeaways for stock marketsThe Fed's decision, along with its forecast of fewer rate cuts in 2025, rattled investors across the globe, leading to widespread sell-offs in equities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icici-securities-says-bullish-2025-ahead-nifty-outlook-to-hit-28800-with-sectoral-leaders-in-focus-2651753-2024-12-18",
      "headline": "Will 2025 bring a bull run? Key trends for Nifty to watchICICI Securities projects a 20% rise in Nifty for 2025, driven by historical trends, sectoral strength, and strategic stock picks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rama-mohan-rao-amara-appointed-sbi-new-managing-director-report-2651798-2024-12-18",
      "headline": "Rama Mohan Rao Amara appointed as SBI's new managing director: ReportThe decision was made by the Appointments Committee of the Cabinet (ACC), which is headed by the Prime Minister."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/own-foreign-assets-or-income-disclose-in-itr-december-31-2024-to-avoid-rs-10-lakh-penalty-2651692-2024-12-18",
      "headline": "Own foreign assets or income? Disclose now to avoid Rs 10 lakh penaltyTaxpayers must disclose foreign income and assets by December 31, 2024, to avoid hefty penalties under the Income Tax and Black Money Acts."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/lok-sabha-speaker-bars-demonstrations-at-building-gates-of-parliament-protest-congress-bjp-2652619-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lok Sabha Speaker bars demonstrations at building gates of Parliament: SourcesLok Sabha Speaker Om Birla announced a ban on protests at the entry gates of the Parliament after NDA MPs clashed with Congress leaders during the latter's protest over Amit Shah's remarks on Dr BR Ambedkar. Two BJP MPs were injured in the commotion and were later hospitalised.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/parliament-assault-row-case-against-rahul-gandhi-bjp-congress-2652564-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "FIR against Rahul Gandhi for 'intimidating, grievously hurting' BJP MPs: SourcesThe complainant, a BJP MP, alleged that Rahul Gandhi \"forcefully barged toward the peaceful demonstrators\" by NDA, despite security instructions, which he said endangered the safety of the MPs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chief-of-defence-staff-cds-bipin-rawat-death-human-error-chopper-crash-tamil-nadu-coonoor-parliamentary-panel-report-2652660-2024-12-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Human error led to chopper crash that killed General Bipin Rawat: ReportThe Standing Committee on Defence shared the data on the number of Indian Air Force aircraft crashes that took place during the 13th Defence Plan period and said that the reason behind chopper crash that killed General Bipin Rawat was \"human error\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-pakistan-champions-trophy-nuetral-venues-explained-2652458-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Explained: What the new India-Pakistan ICC agreement means for world cricketThe International Cricket Council brokered an agreement between India and Pakistan that they will not have to play at each other's home venues in any ICC tournaments till 2028. While the decision worked out well for both countries, here's how it affects the rest of the cricketing world.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/luigi-mangione-unitedhealthcare-ceo-brian-thompson-federal-murder-charge-new-york-police-manhattan-2652661-2024-12-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UnitedHealthcare CEO's killing suspect Luigi Mangione faces federal murder chargeFederal prosecutors in Manhattan are charging Luigi Mangione, 26, with the federal crime of murder using a firearm, two charges of stalking and a charge of using an illegal gun silencer, according to a criminal complaint. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-president-vladimir-putin-says-alternatives-to-porn-needed-calls-for-more-interesting-content-2652565-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Putin says alternatives to porn needed, calls for 'more interesting content'In an interview with Russia Today, Putin acknowledged the widespread global popularity of adult content, emphasising that this is not just an issue in Russia but one that affects the entire world."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/syed-ali-shah-geelanis-aide-hired-terrorists-to-kill-lawyer-in-2020-police-2652542-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Syed Ali Shah Geelani's aide hired terrorists to kill lawyer in 2020: PoliceIn the chargesheet, accessed by India Today, the police alleged the direct involvement of Mian Abdul Qayoom, a close aide of Geelani, in the murder of an advocate in 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/samajwadi-party-zia-ur-rahman-barq-accused-of-power-theft-gets-rs-19-crore-electricity-bill-2652630-2024-12-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Samajwadi Party MP, accused of power theft, faces Rs 1.9 crore electricity billThe electricity department claimed that the evidence of tampering with two electricity meters was found during an inspection at Zia Ur Rahman Barq's residence on Thursday morning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/br-ambedkar-dalit-icon-bjp-amit-shah-statement-opposition-congress-rahul-gandhi-kharge-firefighting-mode-explained-2652479-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Ambedkar issue has got BJP scramblingUnion Home Minister Amit Shah's remark on BR Ambedkar was seized upon by the Opposition to attack the BJP. The BJP brass, without losing a moment, countered the allegations. Why did the BJP scramble to firefight, and what does that reveal about Dalit politics in India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-school-principal-steals-egg-midday-meal-scheme-vaishali-district-lalganj-caught-on-camera-2652663-2024-12-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bihar school principal caught on camera while stealing eggs meant for childrenAfter the video of the principal was widely shared on social media, the state education department sent a noice to the principal, Suresh Sahani, asking why an FIR shouldn't be registered against him for theft. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/congress-us-republicans-new-spending-package-avert-government-shutdown-donald-trump-gop-2652665-2024-12-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Republicans in US Congress reach new spending package to avert government shutdownRepublicans control the chamber by a 219-211 majority, meaning they could lose no more than three votes if Democrats unite against the bill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-priyanka-blue-tshirt-saree-amit-shah-ambedkar-history-significance-dalit-identity-2652405-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rahul Gandhi switched to blue T-shirt. How blue became colour of Dalit identityRahul Gandhi switched from his signature white T-shirt to a blue one while protesting against BJP leader Amit Shah's remarks on BR Ambedkar. Not just Rahul, most Opposition MPs wore blue on Thusday. How did blue become the colour of Dalit politics and identity?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-aishwarya-rai-dupatta-aaradhya-schhol-annual-day-amitabh-bachchan-2652516-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Abhishek holds Aishwarya Rai's dupatta at Aaradhya's school annual day eventAbhishek Bachchan and Aishwarya Rai, along with Amitabh Bachchan, attended the annual day event of their daughter, Aaradhya, at Dhirubhai Ambani School. Abhishek was seen holding Aishwarya Rai's dupatta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-you-will-be-chief-minister-one-day-devendra-fadnavis-tells-deputy-ajit-pawar-2652493-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "You will be Chief Minister one day, Devendra Fadnavis tells Ajit PawarAjit Pawar, who recently took oath as Deputy Chief Minister for the sixth time, joined the BJP-led Mahayuti government in 2023 after a dramatic split from the NCP, originally founded by his uncle Sharad Pawar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/opposition-no-trust-motion-against-jagdeep-dhankhar-rejected-rajya-sabha-2652344-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Drawn to mar reputation: Opposition's no-trust motion against V-P rejectedIn a detailed order, Deputy Chairman Harivansh called the motion \"flawed\", adding that it was drawn in \"haste\" to mar the reputation of the Chairman. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-smriti-mandhana-india-women-vs-west-indies-women-3rd-t20i-2652557-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mandhana shatters multiple records with hat-trick of T20I 50s: Stat PackIND-W vs WI-W: Smriti Mandhana blasted her way to scoring 77 runs off 47 balls with 13 fours and a six in the series decider against the West Indies on Thursday at the Dr DY Patil Sports Academy in Navi Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/understanding-indias-official-entry-process-to-oscars-after-2652546-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Laapataa Ladies exits Oscars race: Understanding India's 'official entry' processLaapataa Ladies, India's official Oscar entry for 2025, didn't make it to the shortlist, sparking debate over the selection process. Have a look at what goes behind the selection process of India's official entry to Oscars every year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-arvind-kejriwals-br-ambedkar-poser-for-chandrababu-naidu-nitish-kumar-hits-narendra-modi-govt-where-it-hurts-2652427-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Kejriwal's Ambedkar poser for Naidu-Nitish hits Modi govt where it hurtsThe AAP leader, who faces the BJP in Delhi elections, has asked the crucial NDA partners to 'deeply reflect' in light of Amit Shah's remarks on B.R. Ambedkar"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/ktr-top-official-face-charges-in-hyderabad-formula-e-race-controversy-brs-revanth-reddy-acb-2652462-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Case against KT Rama Rao over Rs 45 crore payment linked to 2023 Formula-E raceThe Anti-Corruption Bureau (ACB) has filed an FIR against BRS leader KT Rama Rao over alleged irregularities in hosting the Formula-E race in Hyderabad last year. Telangana Governor Jishnu Dev Varma granted permission to register the case, citing a Rs 45 crore payment and unauthorised agreement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-national-pleads-guilty-attempting-entice-13-year-old-girl-sexual-activity-undercover-agent-online-sting-operation-2652282-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US undercover agent poses as a 13-year-old, nabs Indian in online sex stingKirtan Patel, an Indian national, pleaded guilty to attempting to entice who he believed to be a 13-year-old girl into sexual activity. Patel, 24, could end up being imprisoned for life. The person, who he believed was a mino, turned out to be an undercover agent with the Homeland Security Investigations department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/outhouse-review-sharmila-tagore-mohan-aghase-2652381-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Outhouse review: Sharmila Tagore's film thrives on simplicity and innocenceReleased-Fri Dec 20, 2024Outhouse, directed by Sunil Sukthankar, is a poignant film exploring themes of companionship, featuring stellar performances by Sharmila Tagore and Mohan Agashe. The narrative follows a grandmother and her grandson on a transformative journey to find their lost dog, impacting an elderly neighbour's life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/give-your-home-that-christmas-look-2652444-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Give your home that Christmas lookLooking for inspiration this holiday season? Here are plenty of ideas to make it all come to life"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ravichandran-ashwin-retirement-father-humiliated-controversy-2652505-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Leave my dad alone: Ashwin after father's controversial retirement statementIndia spinner R Ashwin has reacted to his father's controversial statements about his retirement. Ashwin has asked the media and the fans to leave his father alone.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/gujarat-man-moves-high-court-after-pregnant-wife-elopes-with-girlfriend-2652475-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man claims pregnant wife eloped with her girlfriend, moves Gujarat High CourtThe husband stated that his wife left their home in October and had not returned, prompting him to approach the court after police efforts to locate her proved unsuccessful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-abhishek-bachchan-dance-dhirubhai-ambani-annual-school-2652654-2024-12-20",
      "headline": "Watch: SRK, Abhishek dance with children on school annual day. Don't miss AbRamThe annual day celebration at Dhirubhai Ambani school saw Bollywood stars like Shah Rukh Khan and Abhishek Bachchan dance with students, with performances by Aaradhya and AbRam capturing the audience's attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/ex-contestant-umar-riaz-accuses-bigg-boss-makers-bias-karanveer-mehra-vivian-dsena-2652628-2024-12-19",
      "headline": "Ex-Bigg Boss contestant Umar Riaz alleges bias in BB18: Was never the nepo childUmar Riaz, a former Bigg Boss contestant, criticised the makers of season 18 for favouritism, recalling his own experiences of perceived bias during his season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-on-malaikottai-vaalibans-performance-need-to-be-more-careful-with-scripts-2652503-2024-12-19",
      "headline": "Mohanlal on Malaikottai Vaaliban's performance: Need to be more careful with scriptsActor Mohanlal addressed the mixed reactions to Malaikottai Vaaliban during promotions for his upcoming directorial debut, Barroz: Guardian of Treasure. The veteran actor also opened up about the challenges of working with new directors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-box-office-day-14-rs-1500-crore-gross-fastest-film-2652599-2024-12-19",
      "headline": "Pushpa 2 box office: Allu Arjun film fastest to gross Rs 1500 crorePushpa 2: The Rule has become the fastest Indian film to gross over Rs 1500 crore worldwide in just 14 days, showcasing its unprecedented box office success. The film stars Allu Arjun, Rashmika Mandanna, and Fahadh Faasil in pivotal roles."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-west-indies-womens-t20i-series-smriti-mandhana-drought-2652634-2024-12-19",
      "headline": "How Smriti Mandhana inspired Team India to end 5-year drought at home IND-W vs WI-W: Smriti Mandhana, who led India in Harmanpreet Kaur's career, talked about the importance of winning a T20I series on home soil. On Thursday, India beat the West Indies in the deciding game to claim the series 2-1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/richa-ghosh-india-women-vs-west-indies-fastest-fifty-2652626-2024-12-19",
      "headline": "Richa Ghosh happy to follow footsteps of Smriti Mandhana after series win vs WIPlayer of the match in India's T20I series decider vs West Indies - Richa Ghosh - said that she was happy to follow in the footsteps of Smriti Mandhana. Richa credited Mandhana for setting the stage with aggressive batting.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-jasprit-bumrah-wasim-akram-justin-langer-2652622-2024-12-19",
      "headline": "Jasprit Bumrah is the right-handed Wasim Akram: Justin LangerFormer Australia head coach Justin Langer has compared Jasprit Bumrah to Wasim Akram. Langer said that he would have hated to face Bumrah in his playing days.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-west-indies-3rd-womens-t20i-smriti-mandhana-richa-ghosh-report-2652606-2024-12-19",
      "headline": "India Women thrash West Indies in series decider to end 5-year-long wait IND-W vs WI-W: India won their Women's T20I series against West Indies after winning the series decider by 100 runs on Thursday in Navi Mumbai. Smriti Mandhana and Richa Ghosh starred for India in the high-scoring encounter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-mohammed-shami-injury-bgt-vijay-hazare-2652609-2024-12-19",
      "headline": "Shami's BGT hopes take hit. Pacer gets left out of Bengal's Vijay Hazare openerIndia pacer Mohammed Shami's Border-Gavaskar Trophy hopes took a massive hit as the pacer was sidelined from Bengal's Vijay Hazare Trophy opener against Delhi. PTI reported that the pacer's knee injury had flared up once again and that's why he was sidelined.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/did-r-ashwin-time-his-retirement-right-bgt-spiced-up-ahead-of-boxing-day-sledging-room-s2-ep-68-2652563-2024-12-19",
      "headline": "Did R Ashwin time his retirement right? | Sledging Room S2 Ep 68Ravichandran Ashwin's decision to announce his retirement shocked the cricketing world. While many were taken aback by the announcement, it appears that Ashwin had carefully considered his decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/who-is-liam-lawson-f1-driver-who-joins-max-verstappen-at-red-bull-2652561-2024-12-19",
      "headline": "Who is Liam Lawson? F1 driver who joins Max Verstappen at Red BullRed Bull announced on December 19 that Liam Lawson will be replacing Sergio Perez in the 2025 season. Who is Liam Lawson, the 22-year-old youngster set to pair 4-time World Champion Max Verstappen?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-smriti-mandhana-india-women-vs-west-indies-women-3rd-t20i-2652557-2024-12-19",
      "headline": "Mandhana shatters multiple records with hat-trick of T20I 50s: Stat PackIND-W vs WI-W: Smriti Mandhana blasted her way to scoring 77 runs off 47 balls with 13 fours and a six in the series decider against the West Indies on Thursday at the Dr DY Patil Sports Academy in Navi Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-women-vs-west-indies-3rd-t20i-highest-total-richa-ghosh-fastest-fifty-2652556-2024-12-19",
      "headline": "Richa Ghosh hits joint-fastest WT20I fifty, India register record total vs WIINDW vs WIW: Richa Ghosh scored the joint fastest-fifty in women's T20Is taking India to their highest-ever total in the format. Richa slammed her fifty in just 18 balls, breaking Smriti Mandhana's record.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bcci-sees-huge-profit-earns-rs-4200-crore-more-after-astronomical-ipl-viewership-2652539-2024-12-19",
      "headline": "BCCI sees huge profit, earns Rs 4200 crore more in 2024The Indian cricket board's bank balance grew by Rs 4200 crore after a successful year of cricket that involved record viewership in the Indian Premier League and the ODI World Cup 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-zimbabwe-vs-afghanistan-2nd-odi-biggest-odi-win-sediqullah-atal-2652525-2024-12-19",
      "headline": "Afghanistan decimate Zimbabwe in Harare, record their biggest ODI win ZIM vs AFG, 2nd ODI: Afghanistan beat Zimbabwe by 232 runs on Thursday to take a crucial 1-0 lead in the three-match series. After Sediqullah Atal's maiden ODI century, the Afghan bowlers shot the home team out for 54 in 17.5 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/who-is-liam-lawson-f1-driver-who-joins-max-verstappen-at-red-bull-2652561-2024-12-19",
      "headline": "Who is Liam Lawson? F1 driver who joins Max Verstappen at Red BullRed Bull announced on December 19 that Liam Lawson will be replacing Sergio Perez in the 2025 season. Who is Liam Lawson, the 22-year-old youngster set to pair 4-time World Champion Max Verstappen?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-smriti-mandhana-india-women-vs-west-indies-women-3rd-t20i-2652557-2024-12-19",
      "headline": "Mandhana shatters multiple records with hat-trick of T20I 50s: Stat PackIND-W vs WI-W: Smriti Mandhana blasted her way to scoring 77 runs off 47 balls with 13 fours and a six in the series decider against the West Indies on Thursday at the Dr DY Patil Sports Academy in Navi Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-women-vs-west-indies-3rd-t20i-highest-total-richa-ghosh-fastest-fifty-2652556-2024-12-19",
      "headline": "Richa Ghosh hits joint-fastest WT20I fifty, India register record total vs WIINDW vs WIW: Richa Ghosh scored the joint fastest-fifty in women's T20Is taking India to their highest-ever total in the format. Richa slammed her fifty in just 18 balls, breaking Smriti Mandhana's record.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bcci-sees-huge-profit-earns-rs-4200-crore-more-after-astronomical-ipl-viewership-2652539-2024-12-19",
      "headline": "BCCI sees huge profit, earns Rs 4200 crore more in 2024The Indian cricket board's bank balance grew by Rs 4200 crore after a successful year of cricket that involved record viewership in the Indian Premier League and the ODI World Cup 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-zimbabwe-vs-afghanistan-2nd-odi-biggest-odi-win-sediqullah-atal-2652525-2024-12-19",
      "headline": "Afghanistan decimate Zimbabwe in Harare, record their biggest ODI win ZIM vs AFG, 2nd ODI: Afghanistan beat Zimbabwe by 232 runs on Thursday to take a crucial 1-0 lead in the three-match series. After Sediqullah Atal's maiden ODI century, the Afghan bowlers shot the home team out for 54 in 17.5 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sachin-tendulkar-posts-viral-video-featuring-zakir-hussain-2652524-2024-12-19",
      "headline": "Memories with maestro: Sachin posts viral video featuring Zakir HussainLegendary Sachin Tendulkar shared a viral throwback video of him and late Zakir Hussain on Thursday, December 19. The heartwarming video saw Sachin trying to learn playing musical instruments from Zakir Hussain.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/argentina-top-fifa-mens-football-rankings-for-second-straight-year-2652522-2024-12-19",
      "headline": "Argentina top FIFA men's football rankings for second straight yearFootball world champion Argentina finished 2024 as the top-placed men's team in the FIFA rankings for a second straight year. Lionel Scaloni's Argentina continue to lead the way ahead of second-placed France and Euro 2024 winners Spain in third.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ommunication-from-gautam-gambhir-gave-me-clarity-and-confidence-sanju-samson-2652502-2024-12-19",
      "headline": "Communication from Gautam Gambhir gave me clarity and confidence: Sanju SamsonWicketkeeper Sanju Samson credits India coach Gautam Gambhir's mentorship for shaping his game, excelling as India's T20 opener with three recent centuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ravichandran-ashwin-retirement-father-humiliated-controversy-2652505-2024-12-19",
      "headline": "Leave my dad alone: Ashwin after father's controversial retirement statementIndia spinner R Ashwin has reacted to his father's controversial statements about his retirement. Ashwin has asked the media and the fans to leave his father alone.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-pakistan-champions-trophy-nuetral-venues-explained-2652458-2024-12-19",
      "headline": "Explained: What the new India-Pakistan ICC agreement means for world cricketThe International Cricket Council brokered an agreement between India and Pakistan that they will not have to play at each other's home venues in any ICC tournaments till 2028. While the decision worked out well for both countries, here's how it affects the rest of the cricketing world.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-singo-apologies-donnarumma-psg-confirm-facial-injury-2652440-2024-12-19",
      "headline": "Monaco's Singo apologies to Donnarumma after PSG confirm gruesome facial injuryMonaco defender Wilfried Singo has apologised for his dangerous move that left PSG goalkeeper Gianluigi Donnarumma with multiple cuts and facial trauma during a French league game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ashwin-retires-unfair-treatment-former-csk-teammate-s-badrinath-2652433-2024-12-19",
      "headline": "Ashwin was not treated fairly, his sudden retirement a shock: Ex-CSK teammateOff-spinner R Ashwin shocked quite a few by announcing his international retirement midway through the crucial Border-Gavaskar Trophy. Ashwin left Australia and reached Chennai as early as Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-pakistan-champions-trophy-nuetral-venues-explained-2652458-2024-12-19",
      "headline": "Explained: What the new India-Pakistan ICC agreement means for world cricketThe International Cricket Council brokered an agreement between India and Pakistan that they will not have to play at each other's home venues in any ICC tournaments till 2028. While the decision worked out well for both countries, here's how it affects the rest of the cricketing world.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-singo-apologies-donnarumma-psg-confirm-facial-injury-2652440-2024-12-19",
      "headline": "Monaco's Singo apologies to Donnarumma after PSG confirm gruesome facial injuryMonaco defender Wilfried Singo has apologised for his dangerous move that left PSG goalkeeper Gianluigi Donnarumma with multiple cuts and facial trauma during a French league game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ashwin-retires-unfair-treatment-former-csk-teammate-s-badrinath-2652433-2024-12-19",
      "headline": "Ashwin was not treated fairly, his sudden retirement a shock: Ex-CSK teammateOff-spinner R Ashwin shocked quite a few by announcing his international retirement midway through the crucial Border-Gavaskar Trophy. Ashwin left Australia and reached Chennai as early as Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mca-wankhede-celebration-anniversary-2652436-2024-12-19",
      "headline": "MCA launches new logo for Wankhede's 50-year celebrationThe Mumbai Cricket Association (MCA) unveiled its plan for the 50th anniversary of the Wankhede Stadium with the event taking place on January 19. Fans can buy tickets online for a nominal fee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-playing-xi-josh-hazlewood-injury-scott-boland-2652431-2024-12-19",
      "headline": "Australia lucky to have Scott Boland as Hazlewood's replacement: Brett LeeAustralia are lucky to have Scott Boland to replace Josh Hazlewood, said Brett Lee. Hazlewood is unlikely to play any further part in the Border-Gavaskar Trophy due to a calf injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-zimbabwe-afghanistan-sediqullah-atal-odi-hundred-2652391-2024-12-19",
      "headline": "Unsold in IPL auction, Afghanistan's Sediqullah hits maiden ODI hundred ZIM vs AFG: Sediqullah Atal scored 104 runs off 128 balls against Zimbabwe in the second game of the three-match ODI series at the Harare Sports Club. Atal had gone unsold in the IPL 2025 auction in Jeddah. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}