{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/investment-advisor-warns-against-inflation-by-2030-you-will-own-less-pay-more-2709747-2025-04-16",
      "headline": "Investment advisor warns against inflation: 'By 2030, you'll own less, pay more'Abhijit Chokshi stated in his post that most people think inflation means things getting expensive. But he explains that inflation has two faces. One is visible inflation and the other is invisible inflation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pwc-shuts-down-operations-in-more-than-a-dozen-countries-report-2709745-2025-04-16",
      "headline": "PwC shuts down operations in more than a dozen countries: ReportThe decision was taken due to mounting differences with local partners. Local leaders at the firm said they lost over a third of their business in recent years after pressure from PwC's global executives to drop risky clients."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dlf-camellias-anmol-singh-jaggi-how-did-gensol-promoter-use-company-funds-to-buy-ultra-luxury-home-2709702-2025-04-16",
      "headline": "How Gensol promoter used company funds to buy ultra-luxury DLF Camellias flatDLF Camellias is a luxury housing project located in Sector 42, Gurgaon. It comprises 4 BHK, 5 BHK, and 6 BHK luxury apartments. Prices for these upscale homes begin at Rs 70 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ireda-stock-price-jumps-6-percent-after-strong-q4-results-all-you-need-to-know-2709701-2025-04-16",
      "headline": "IREDA share price jumps 6% after strong Q4 results. All you need to knowIREDA shares jumped sharply after strong Q4 earnings, though asset quality concerns could temper gains in the near term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-engineering-stock-crashes-5-percent-after-sebi-order-should-you-avoid-stock-2709698-2025-04-16",
      "headline": "Gensol Engineering share price crashes to all-time low. Should you buy or avoid?The stock has now crashed 84% since the start of 2025 and is down nearly 87% over the past year, making it one of the worst-performing listed firms in the clean energy space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-over-100-points-nifty-below-23300-gensol-engineering-shares-tumble-5-2709685-2025-04-16",
      "headline": "Sensex, Nifty trade flat after 2-day tariff relief rally; Gensol shares tumble 5%The S&P BSE Sensex was down 84.98 points to 76,649.91 at 9:23 am, while the NSE Nifty50 fell 26.25 points to trade at 23,302.30. However, broader market indices did not see any major dip, and it is likely to provide relief to retail investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-engineering-share-price-in-focus-today-sebi-action-promoters-jaggi-brothers-fund-diversion-2709678-2025-04-16",
      "headline": "Gensol Engineering shares in focus today as Sebi takes action against promotersGensol Engineering shares have plunged 83% this year, and the market regulator's interim order may deepen the sell-off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-interim-order-jaggi-brothers-anmol-punit-alleged-wrongdoings-gensol-engineering-2709665-2025-04-16",
      "headline": "Sebi vs Jaggi brothers: What's in the interim order over wrongdoings?During its probe, the market regulator found 'blatant violation of rules of corporate governance' and 'alleged wrongdoings'.  It said that the promoters were running Gensol like a private firm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-engineering-anmol-singh-jaggi-puneet-singh-jaggi-trouble-sebi-bars-promoters-markets-fund-diversion-2709647-2025-04-16",
      "headline": "Sebi bans Gensol's Jaggi brothers for diverting company funds for personal useSebi has passed an interim order barring promoters Anmol Singh Jaggi and Puneet Singh Jaggi from taking part in the securities market and from holding any position as directors or key managerial personnel in any listed company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-swiggy-partnership-jobs-gig-delivery-sector-national-career-service-portal-listing-2709539-2025-04-15",
      "headline": "Government, Swiggy join hands to boost jobs in gig, delivery sectorThe government said the partnership with Swiggy would help take the National Career Service portal deeper into the gig economy space. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-niu-gensheng-china-dairy-tycoon-rose-from-poverty-to-prosperity-2709398-2025-04-15",
      "headline": "How Niu Gensheng, China's dairy tycoon, rose from poverty to prosperityNiu Gensheng was born into a poor family in Inner Mongolia. His parents couldn't afford to raise him, so they sold him to a cattle farmer. The farmer adopted him, but life was still full of challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-eases-march-february-2709360-2025-04-15",
      "headline": "Retail inflation eases further to 3.34% in March, lowest since August 2019The March CPI inflation print came in below February's 3.61%, marking the second straight month that inflation has stayed under the Reserve Bank of India's 4% medium-term target."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hermes-overtakes-lvmh-in-market-value-years-after-takeover-drama-2709317-2025-04-15",
      "headline": "Hermes overtakes LVMH in market value years after takeover dramaWay back in 2010, LVMH's billionaire CEO Bernard Arnault shocked the corporate world by acquiring a huge stake in Hermes. It was seen as an effort to seize control of the company. But the Hermes family fought back. They came together to defend their brand and ultimately made Arnault sell his shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-gains-nearly-1600-points-nifty-above-23300-indusind-bank-gains-7-percent-2709343-2025-04-15",
      "headline": "Sensex gains nearly 1,600 points, Nifty above 23,300; IndusInd bank gains 7%The S&P BSE Sensex gained 1,577.63 points to close at 76,734.89, while the NSE Nifty50 added 500 points to end at 23,328.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-recovers-fully-from-trump-tariffs-as-sensex-nifty-rally-2709336-2025-04-15",
      "headline": "Dalal Street dusts off Trump's April 2 tariff shock, stages full comebackTrading resumed after a long weekend, but there was no slowdown in terms of momentum. The Nifty50 climbed as much as 2.4% intraday, comfortably reclaiming its pre-tariff territory, while the Sensex gained over 1,600 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ups-vs-nps-which-pension-scheme-should-you-opt-for-unified-pension-scheme-national-pension-scheme-which-is-better-2709287-2025-04-15",
      "headline": "UPS vs NPS: Which pension scheme should you opt forThe Unified Pension Scheme is the new retirement scheme effective from April 1, 2025. It is for central government employees. If you're currently under NPS, you'll have the option to shift to this new plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/multibagger-stock-venkys-india-limited-has-given-13000-percent-return-should-you-buy-expert-view-2709299-2025-04-15",
      "headline": "This multibagger stock has given 13,000% return. Should you buy?Since its stock market debut on July 28, 2003, the company has delivered a return of nearly 12,951.78%. It touched its 52-week high of Rs 2,559.95 on September 4, 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-green-q4-business-update-share-price-rising-today-check-key-details-2709262-2025-04-15",
      "headline": "Adani Green share price jumps 5% today after Q4 business update. Check detailsThe stock rose as much as 5.33% in early trade to hit Rs 941.40 on the Bombay Stock Exchange (BSE). At around 1:05 pm, the shares of the company were trading 4.17% higher at Rs 931."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/usd-vs-inr-ca-explains-which-one-actually-holds-more-value-2709245-2025-04-15",
      "headline": "USD vs INR: CA explains which one actually holds more valueCA Nitin Kaushik said that some people argue that salaries in India grow faster. Though he doesn't deny it, he questions whether that trend still holds true today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-dalal-street-rally-sensex-nifty-jump-more-gains-ahead-explained-2709226-2025-04-15",
      "headline": "Sensex, Nifty jump 6% in two sessions. Are Dalal Street bulls back on track?While the sharp rebound in equity markets has reignited investor enthusiasm, experts are urging caution amid ongoing global uncertainties, especially around the US trade policy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rich-dad-poor-dad-author-robert-kiyosaki-warns-of-giant-market-crash-bets-on-gold-and-bitcoin-2709197-2025-04-15",
      "headline": "'Rich Dad Poor Dad' author warns of giant market crash, bets on gold and BitcoinAccording to Robert Kiyosaki the rising gold, silver, and Bitcoin prices show that traditional ways of saving—like stocks, bonds, mutual funds, and ETFs—are no longer safe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/defence-stocks-should-you-buy-hal-bel-mazagon-dock-check-price-target-2709189-2025-04-15",
      "headline": "Should you buy HAL, BEL, Mazagon Dock, other defence stocks? Check price targetDefence companies are expected to do well for many positive reasons. These include higher government spending on defence, tensions between countries, a longer list of defence products being made in India, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-share-price-jumps-4-percent-check-why-is-it-rising-today-2709186-2025-04-15",
      "headline": "Explained: Why HDFC share price surged 4% today and what next?HDFC Bank's share price rose as the country's largest private lender, along with several other banks, cut its deposit interest rate by 25 basis points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-hdfc-bank-icici-bank-sbi-why-banking-stocks-are-rising-today-2709176-2025-04-15",
      "headline": "IndusInd Bank, HDFC Bank, ICICI Bank, SBI: Why banking stocks are rising todayShares of IndusInd Bank gained above 6% on the National Stock Exchange (NSE), while HDFC Bank was up 3.3%. Axis Bank shares rose nearly 3% and ICICI Bank was up 2.3%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/markets-in-green-amid-trumps-tariff-row-2709160-2025-04-15",
      "headline": "Markets in green amid Trump's tariff rowStock market benchmark indices surged on Tuesday as trading resumed following a long weekend, with auto sector stocks leading the gains. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quess-corp-share-price-demerger-showing-50-percent-fall-on-some-trading-apps-explained-2709151-2025-04-15",
      "headline": "Is Quess Corp share price down over 50%? Not quite, here's what happenedWhat investors are seeing now is the adjusted market value of Quess Corp after the spin-off. The value of the new entities will be discovered once they are listed on the stock exchanges in the coming weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-mahindra-and-mahindra-maruti-auto-stocks-gaining-stock-market-explained-2709145-2025-04-15",
      "headline": "Tata Motors, M&M, Maruti: Why are auto stocks gaining today?Tata Motors led the pack with a gain of over 5%, while Mahindra and Mahindra (M&M) climbed nearly 4%. Maruti Suzuki advanced close to 2%, and other prominent names such as Eicher Motors, Bajaj Auto, and Ashok Leyland rose over 1.5%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-rally-2-percent-early-trade-why-stock-market-gain-today-reasons-auto-shares-rise-2709144-2025-04-15",
      "headline": "Sensex, Nifty rally 2% in early trade. 5 things investors need to knowSensex, Nifty today: Tata Motors led the gains on the Sensex, jumping 5.03% in early trade. Other auto stocks such as Mahindra & Mahindra also performed well, rising 3.74%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-jumps-nearly-1500-points-nifty-above-23000-as-auto-stocks-surge-in-early-trade-2709135-2025-04-15",
      "headline": "Sensex soars 1,600 points as Trump hints at auto tariff pauseThe S&P BSE Sensex jumped 1,580.01 points to 76,737.27, while the NSE Nifty50 467.30 points to 23,295.85 as of 9:22 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-opening-today-april-stock-market-gain-amid-positive-global-cues-trump-tariff-2709122-2025-04-15",
      "headline": "Sensex, Nifty opening: Will stock market gain amid positive global cues?Stock market today: Trading on Dalal Street remained shut on Monday due to Ambedkar Jayanti. As trading resumes, investors are hopeful that the markets will continue their positive trend from Friday, when both Sensex and Nifty gained nearly 2%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-on-april-15-shares-in-focus-today-swiggy-hcltech-dr-reddy-tata-power-ireda-icici-lombard-2709116-2025-04-15",
      "headline": "Stocks to watch on April 15: Swiggy, HCLTech, Dr Reddy, Tata Power, IREDAKey stocks to watch on April 15 are shares of Swiggy, HCLTech, Dr Reddy, Tata Power, IREDA ICICI Lombard, ICICI Pru Life, among others, due to varied news developments and Q4 results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dr-reddy-asks-several-top-paid-executives-to-quit-in-cost-cutting-drive-report-2708816-2025-04-14",
      "headline": "Dr Reddy's asks several top-paid executives to quit in cost-cutting drive: ReportDr Reddy's Laboratories (DRL) FY24 annual report shows it had over 26,000 employees worldwide as of March 2024. That includes 21,757 permanent staff. In FY24, the company hired 6,281 people and spent Rs 5,030 crore on employee benefits,"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/layoff-in-40s-no-1-target-corporate-news-trend-bombay-shaving-company-ceo-shantanu-deshpande-tip-how-to-avoid-2708807-2025-04-14",
      "headline": "Over 40? You might be first in line for layoff, says Bombay Shaving Company CEOShantanu Deshpande, founder and CEO of Bombay Shaving Company, said that professionals in their 40s are now the number one targets for layoffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-billionaires-lost-over-rs-2-lakh-crore-us-donald-trump-tariff-impact-share-market-2708781-2025-04-14",
      "headline": "Tycoons in turmoil: Indian billionaires caught in Trump's tariff stormThe net worth of Mukesh Ambani, Gautam Adani, Shiv Nadar, and others has taken a massive hit amid a sharp correction in equity markets, fuelled by foreign investor exits and escalating global trade friction. All thanks to US President Donald Trump's tariff shock.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rs-225-crore-lumpsum-or-rs-84k-monthly-which-pension-plan-should-you-opt-for-ups-vs-nps-2708752-2025-04-14",
      "headline": "Rs 2.25 crore lumpsum or Rs 84k monthly? Which pension plan should you opt forUnder UPS, the government puts in 10% of your basic salary and dearness allowance and adds another 8.5% to your pension pot. On the other hand, under NPS, the government contributes 14% of your salary. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blusmart-uber-fleet-partnership-pivot-business-plan-financial-struggle-report-2708750-2025-04-14",
      "headline": "BluSmart likely to end cab service, join hands with Uber: ReportThe company, which started out by operating electric vehicles on Uber's platform nearly six years ago, is now preparing to shut down its own cab service and supply cars to Uber again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/investing-or-borrowing-check-new-sbi-hdfc-boi-interest-rates-rbi-repo-rate-cut-2708706-2025-04-14",
      "headline": "Investing or borrowing? Check new SBI, HDFC, BOI interest ratesThe latest rate cut signals a broader trend—savers are using savings accounts mainly for transactions, while putting the rest in fixed deposits for better returns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-mehul-choksi-what-is-pnb-bank-scam-rs-13850-crore-arrested-in-belgium-nirav-modi-2708698-2025-04-14",
      "headline": "Mehul Choksi arrested in Belgium: What is the Rs 14,000-crore PNB scam?Mehul Choksi once headed the Gitanjali Group, a well-known jewellery firm. Born in 1959, Choksi was active in the diamond industry for many years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bank-of-india-home-loan-interest-rates-cut-new-and-existing-borrowers-check-details-2708679-2025-04-14",
      "headline": "Bank of India cuts home loan rates for new, existing customers. Check detailsThis adjustment is expected to make borrowing slightly easier for individuals at a time when the RBI is clearly looking to revive private investment and sustain domestic demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-this-week-what-to-expect-key-factors-to-watch-expert-insights-2708654-2025-04-14",
      "headline": "What to expect from stock market this week? 4 key things investors should knowMultiple factors could determine the mood on Dalal Street. From April 12 to 19, investors will be watching crucial Q4 earnings, economic data releases in India, the US, and China."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zaheer-khan-sagarika-ghatge-baby-boy-announcement-name-revealed-2709735-2025-04-16",
      "headline": "Sagarika Ghatge-Zaheer Khan become parents to baby boy, reveal nameActor Sagarika Ghatge and cricketer Zaheer Khan announced the birth of their son on Tuesday on Instagram. The couple shared a beautiful picture with their baby and also revealed his name in the caption. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/how-deepika-padukone-made-ibrahim-ali-khan-realise-his-father-saif-ali-khan-was-big-actor-2709724-2025-04-16",
      "headline": "It took Deepika Padukone for Ibrahim to realise his father Saif was 'big actor'Ibrahim Ali Khan got candid about growing up on film sets, and being raised by famous parents. In an interview recently, he talked about the moment he finally became aware of his father's popularity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-enjoys-7-course-meal-made-by-her-favourite-chef-raha-kapoor-2709706-2025-04-16",
      "headline": "Alia Bhatt's lavish seven-course meal has the cutest Raha connectionLittle Raha, in an adorable gesture, prepared a 7-course meal for her mother Alia Bhatt. The heartwarming act was shared by Alia on social media, garnering much attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-6-detailed-report-sunny-deol-film-is-rs-53-crore-strong-during-weekdays-2709700-2025-04-16",
      "headline": "Jaat box office Day 6: Sunny Deol's film is Rs 53 crore strong during weekdaysSunny Deol's 'Jaat' is doing good business at the box office even on weekdays. The film has got two more days to enjoy an unchallenged run before Akshay Kumar's 'Kesari 2' hits the screens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prajakta-koli-slams-magazine-for-claims-about-regretting-marriage-with-vrishank-khanal-2709694-2025-04-16",
      "headline": "Prajakta Koli blasts magazine for claims about regretting marriage with VrishankPrajakta Koli has publicly challenged a magazine's claim that she regrets marrying her longtime boyfriend Vrishank Khanal. The content creator and actor clarified her stance on social media, dismissing the story as false."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-bad-ugly-box-office-collection-day-6-ajith-kumar-100-crore-in-tamil-nadu-2709697-2025-04-16",
      "headline": "Good Bad Ugly box office Day 6: Rs 100 crore in Tamil Nadu, more records for AjithAjith Kumar's 'Good Bad Ugly' grossed over Rs 100 crore in Tamil Nadu, confirmed the makers. The film is expected to shatter more records. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aamir-ali-opens-up-about-being-sexually-harassed-at-14-stopped-taking-trains-2709675-2025-04-16",
      "headline": "Aamir Ali opens up about being sexually harassed at 14: Stopped taking trainsActor Aamir Ali has revealed a distressing experience from his teenage years when he faced sexual harassment. He recollected he was 14 when he was touched inappropriately. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alex-onell-phule-controversy-watch-it-and-debate-it-dont-change-it-exclusive-2709507-2025-04-16",
      "headline": "Alex O'Nell on Phule controversy: Watch it and have a conversation | ExclusiveActor Alex O'Nell discusses the controversy surrounding the film 'Phule', which is a biopic about social reformers Jyotirao and Savitribai Phule, amidst objections from certain organisations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jewel-thief-jaideep-ahlawat-saif-ali-khan-nikita-dutta-kunal-kapoor-fun-bts-jaadu-shoot-2709666-2025-04-16",
      "headline": "Jaideep, Saif and others grooving to Jewel Thief song Jaadu is pure vibe. VideoThe Netflix heist-thriller 'Jewel Thief' is set to premiere on April 25. Ahead of its release, Nikita Dutta and Kunal Kapoor shared a fun behind-the-scenes clip from the promotions, where the cast is seen enjoying a light-hearted moment while grooving to the song 'Jaadu'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vincy-aloshious-drugged-co-star-misbehaved-with-her-2709657-2025-04-16",
      "headline": "Malayalam actor claims co-star insisted on fixing her dress on set: He was on drugsMalayalam actor Vincy Aloshious revealed that her co-star, allegedly under the influence of drugs, insisted on fixing her dress. However, she did not name the person."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-kesari-2-delhi-chief-minister-rekha-gupta-2709648-2025-04-16",
      "headline": "Emotional Rekha Gupta on Akshay Kumar's Kesari 2: Want to give more for motherlandDelhi Chief Minister Rekha Gupta was emotional after watching Akshay Kumar's 'Kesari Chapter 2' at a special screening. Addressing the media, she said that the film was goosebumps-inducing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/who-is-cody-john-meet-emma-roberts-low-ley-actor-fiance-glbs-2709637-2025-04-16",
      "headline": "Who is Cody John? Meet Emma Roberts' low-key actor fiancéEmma Roberts is engaged to actor Cody John, confirming the news on Instagram. The couple, together since 2022, keeps their relationship low-key, despite growing public interest in their romantic journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ibrahim-ali-khan-on-dating-rumours-with-palak-tiwari-calls-her-a-good-friend-2709567-2025-04-15",
      "headline": "Ibrahim Ali Khan responds to dating rumours with Palak TiwariIbrahim Ali Khan has responded to rumours about his relationship with Palak Tiwari, describing her as a 'good friend'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/home-alone-2-director-chris-columbus-calls-donald-trump-cameo-a-curse-2709552-2025-04-15",
      "headline": "Home Alone 2 director Chris Columbus calls Donald Trump cameo a 'curse'Director Chris Columbus reveals his regret over Donald Trump's cameo in 'Home Alone 2'. He describes it as a 'curse' and an 'albatross' on the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-member-jin-announces-second-solo-album-echo-2709540-2025-04-15",
      "headline": "BTS member Jin announces second solo album EchoBTS' Jin is set to make a comeback with his second solo album 'Echo', releasing this May. Fans anticipate this as a step towards a BTS group reunion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/anthony-mackie-says-avengers-doomsday-will-bring-back-old-marvel-feeling-2709504-2025-04-15",
      "headline": "Anthony Mackie says Avengers Doomsday will bring back 'old Marvel feeling'In an exciting development for Marvel fans, Anthony Mackie promises a return to classic Marvel vibes with 'Avengers: Doomsday'. Directed by the Russo Brothers, the film is set for a May 2026 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-reacts-to-hit-3-being-compared-with-animal-marco-and-kill-2709492-2025-04-15",
      "headline": "Nani reacts to HIT 3 being compared with Animal, Marco, and KillAt the trailer launch of HIT: The Third Case, Nani addressed fan comparisons between HIT 3, Animal, Marco, and Kill, stating that HIT 3 follows its own cinematic language and grammar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kalki-director-nag-ashwin-says-he-wrote-inception-like-story-before-christopher-nolan-2709446-2025-04-15",
      "headline": "Kalki's Nag Ashwin says he wrote Inception-like story before Christopher Nolan'Kalki 2898 AD' director Nag Ashwin recently opened up about his early writing experiences, revealing that his story was similar to the Hollywood film Inception, and sharing his admiration for Trivikram's 2010 film Khaleja."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/cate-blanchett-on-her-hollywood-retirement-i-am-serious-about-giving-up-acting-2709458-2025-04-15",
      "headline": "Cate Blanchett on her Hollywood retirement: I am serious about giving up actingCate Blanchett, known for her versatility, revealed her serious intent to retire from acting. The acclaimed actor said that she wished to explore other interests beyond the film industry."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sonia-gandhi-rahul-gandhi-ed-chargesheet-details-national-herald-case-ajl-young-indian-assets-2709713-2025-04-16",
      "headline": "Gandhis key beneficiaries of Rs 5,000 crore assets: ED in National Herald caseIn the ED chargesheet, Sonia Gandhi has been named accused no 1, and Rahul as accused no 2. A special court will decide on taking cognisance of the chargesheet on April 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/urdu-signboard-maharashtra-supreme-court-language-bombay-high-court-2709729-2025-04-16",
      "headline": "Language is not religion: Supreme Court upholds use of Urdu signboardThe top court described Urdu as the finest example of 'Ganga-Jamuni tehzeeb' and criticised prejudice against languages, calling such bias a \"threat to India's cultural strength\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/robert-vadra-ed-questioning-priyanka-gandhi-hugs-haryana-land-case-robert-vadra-2709755-2025-04-16",
      "headline": "Priyanka Gandhi hugs Robert Vadra outside ED office as he returns for questioningBefore entering the ED office in the national capital, Robert Vadra was seen sharing a warm hug with wife and Congress MP Priyanka Gandhi Vadra, who stepped out of the car to see him off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-hostess-ventilator-sexually-assaulted-hospital-staff-gurugram-cops-2709638-2025-04-16",
      "headline": "Air hostess on ventilator sexually assaulted by hospital staff in Gurugram: CopsThe case came to light after the 46-year-old air hostess registered a complaint alleging that she was sexually assaulted by hospital staff while unconscious and on a ventilator."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dlf-camellias-anmol-singh-jaggi-how-did-gensol-promoter-use-company-funds-to-buy-ultra-luxury-home-2709702-2025-04-16",
      "headline": "How Gensol promoter used company funds to buy ultra-luxury DLF Camellias flatDLF Camellias is a luxury housing project located in Sector 42, Gurgaon. It comprises 4 BHK, 5 BHK, and 6 BHK luxury apartments. Prices for these upscale homes begin at Rs 70 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/waqf-amendment-act-petition-supreme-court-muslim-properties-fundamental-rights-constitutional-validity-2709619-2025-04-16",
      "headline": "Waqf Amendment Act legal battle begins, Supreme Court to hear 73 petitions todayThe Supreme Court will on Wednesday hear 73 petitions challenging the constitutional validity of the Waqf (Amendment) Act, 2025, on grounds ranging from alleged religious discrimination and executive overreach to dilution of Waqf protections."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/2611-turning-point-in-india-pakistan-ties-s-jaishankar-says-pak-stuck-in-bad-habits-2709659-2025-04-16",
      "headline": "26/11 turning point in India-Pak ties: S Jaishankar says Pak stuck in bad habitsOn November 26, 2008, a group of 10 Pakistani terrorists launched attacks at multiple locations in Mumbai, killing 166 persons in the nearly 60-hour siege."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-man-strangled-youtuber-wife-lover-affair-body-dumped-bike-bhiwani-arrested-2709497-2025-04-15",
      "headline": "YouTuber kills husband with help of lover after he sees them in intimate actA woman, who is a YouTuber, was arrested on charges of killing her husband after he came to know about her affair with a man, who is also a YouTuber in Haryana's Bhiwani. The accused dumped the victim's body in a drain."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-rehab-centre-inmate-assaulted-for-refusing-to-wardens-wash-clothes-2709693-2025-04-16",
      "headline": "Bengaluru rehab patient dragged, beaten for refusing to wash warden's clothesA shocking video from a Bengaluru rehabilitation centre shows an inmate being violently beaten by staff for not obeying orders to wash clothes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-visa-indian-citizens-trump-tariff-threats-beijing-xi-jinping-modi-2709664-2025-04-16",
      "headline": "Amid Trump's tariff war, China issues over 85,000 visas to 'Indian friends'China has issued over 85,000 visas to Indian citizens in 2025, significantly up from last year, amidst growing diplomatic tensions with the US over trade tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vincy-aloshious-drugged-co-star-misbehaved-with-her-2709657-2025-04-16",
      "headline": "Malayalam actor claims co-star insisted on fixing her dress on set: He was on drugsMalayalam actor Vincy Aloshious revealed that her co-star, allegedly under the influence of drugs, insisted on fixing her dress. However, she did not name the person."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dusu-president-cow-dung-laxmibai-college-principal-office-delhi-university-gobar-video-2709644-2025-04-16",
      "headline": "Madam will get AC removed now, modern cooling: Cow dung payback for DU principalA viral video showed the Delhi University Students' Union president smearing cow dung on the walls of Lakshmibai College Principal Pratyush Vatsala's office, days after the latter was seen doing the same in a classroom to \"beat the heat\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zaheer-khan-sagarika-ghatge-baby-boy-announcement-name-revealed-2709735-2025-04-16",
      "headline": "Sagarika Ghatge-Zaheer Khan become parents to baby boy, reveal nameActor Sagarika Ghatge and cricketer Zaheer Khan announced the birth of their son on Tuesday on Instagram. The couple shared a beautiful picture with their baby and also revealed his name in the caption. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-interim-order-jaggi-brothers-anmol-punit-alleged-wrongdoings-gensol-engineering-2709665-2025-04-16",
      "headline": "Sebi vs Jaggi brothers: What's in the interim order over wrongdoings?During its probe, the market regulator found 'blatant violation of rules of corporate governance' and 'alleged wrongdoings'.  It said that the promoters were running Gensol like a private firm. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/telangana-men-killed-injured-in-dubai-bakery-attack-by-pakistani-national-2709634-2025-04-16",
      "headline": "Pakistani national kills two Telangana workers with sword at Dubai bakeryExpressing grief, Union Minister of State for Home Bandi Sanjay Kumar said he had spoken to MEA officials and that Union home ministry officials were in touch with them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aamir-ali-opens-up-about-being-sexually-harassed-at-14-stopped-taking-trains-2709675-2025-04-16",
      "headline": "Aamir Ali opens up about being sexually harassed at 14: Stopped taking trainsActor Aamir Ali has revealed a distressing experience from his teenage years when he faced sexual harassment. He recollected he was 14 when he was touched inappropriately. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prajakta-koli-slams-magazine-for-claims-about-regretting-marriage-with-vrishank-khanal-2709694-2025-04-16",
      "headline": "Prajakta Koli blasts magazine for claims about regretting marriage with VrishankPrajakta Koli has publicly challenged a magazine's claim that she regrets marrying her longtime boyfriend Vrishank Khanal. The content creator and actor clarified her stance on social media, dismissing the story as false."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-says-immigrants-could-get-money-plane-tickets-if-they-self-deport-glbs-2709628-2025-04-16",
      "headline": "Leave US and get cash, plane tickets? Trump's proposed plan for immigrantsDonald Trump floated a plan where the US would offer money and plane tickets to undocumented immigrants who choose to leave the US on their own.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pak-kfc-employee-killed-radical-islamist-party-open-fire-anti-israel-protest-2709692-2025-04-16",
      "headline": "KFC worker killed in Pak as Islamist party activists ransack outlet, open fireA large group of TLP activists stormed the KFC outlet in the early hours of Tuesday and opened fire, killing one employee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-kkr-ajinkya-rahane-lack-of-clarity-angkrish-raghuvanshi-blame-2709686-2025-04-16",
      "headline": "Rahane blames lack of clarity with Angkrish for review horror in PBKS vs KKRAjinkya Rahane blamed lack of clarity for the review horror during the PBKS vs KKR game. Rahane said that the communication with Angkrish Raghuvanshi wasn't clear enough in the end."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alex-onell-phule-controversy-watch-it-and-debate-it-dont-change-it-exclusive-2709507-2025-04-16",
      "headline": "Alex O'Nell on Phule controversy: Watch it and have a conversation | ExclusiveActor Alex O'Nell discusses the controversy surrounding the film 'Phule', which is a biopic about social reformers Jyotirao and Savitribai Phule, amidst objections from certain organisations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/this-nation-is-more-divided-than-ever-joe-biden-in-chicago-address-glbs-2709629-2025-04-16",
      "headline": "Biden slams Trump in 1st post-presidency speech; White House takes bedtime jibeIn his first major speech since leaving the Oval Office, Joe Biden blasted the Trump administration for slashing Social Security staff, closing offices, and risking benefit delays. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/faridabad-lover-woman-attacks-boyfriend-marriage-pressure-divorced-haryana-2709596-2025-04-16",
      "headline": "Faridabad man beaten up by girlfriend, her family after refusing to leave wifeA married man in Faridabad was seriously injured after allegedly being assaulted by his girlfriend and her family for refusing to leave his wife and children to marry her."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-administration-took-no-action-to-return-wrongly-deported-man-us-judge-glbs-2709618-2025-04-16",
      "headline": "US judge blasts Trump admin in wrongful deportation case, asks officials to testifyA US judge slammed the Trump administration for failing to help wrongly deported Kilmar Abrego Garcia return from El Salvador, saying \"nothing has been done.\" She ordered officials to submit docs and testify under oath by April 23.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mayank-yadav-fit-again-lucknow-super-gants-vs-rajasthan-royals-2709763-2025-04-16",
      "headline": "IPL 2025: Fit-again Mayank Yadav joins LSG squad, likely to play against RRMayank Yadav is back in Lucknow Super Giants camp ahead of their key clash against Rajasthan Royals. The speedster, returning from injury, could be the answer to the franchise's bowling struggles as they seek to solidify their playoff push in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-psg-vs-aston-villa-europa-league-anthem-error-watch-video-2709721-2025-04-16",
      "headline": "PSG, Villa players hold back laughs as Europa anthem played before CL clashA Europa League anthem blunder set a bizarre tone for Aston Villa's Champions League clash with PSG, leaving players holding back laughter. But once the whistle blew, Villa brought intensity, forcing PSG to dig deep to survive the quarter-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-play-in-tournament-warriors-defeat-grizzlies-in-121-116-thriller-behind-curry-butler-glbs-2709718-2025-04-16",
      "headline": "NBA Play-in tournament: Warriors defeat Grizzlies in 121-116 thriller behind Curry, ButlerThe Golden State Warriors edged out the Memphis Grizzlies in a thriller 121-116 victory in an NBA Play-in tournament showdown on Tuesday, April 15 at Chase Center. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-nitish-rana-riyan-parag-rajasthan-royals-captaincy-2709708-2025-04-16",
      "headline": "Making Riyan Parag RR stand-in captain over me was correct call: Nitish RanaNitish Rana said he had no issues with RR appointing Riyan Parag, the stand-in skipper, over him while Sanju Samson was recovering from injury. Riyan captained the Royals during the first 3 games of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-borussia-dortmund-vs-fc-barcelona-psg-vs-aston-villa-wrap-2709705-2025-04-16",
      "headline": "Barcelona, PSG reach semis after surviving Villa, Dortmund comebackFC Barcelona and PSG narrowly escaped Champions League heartbreak as Dortmund and Aston Villa threatened major comebacks in two dramatic second-leg encounters. A Guirassy hat-trick and a Villa fightback made it close, but the giants held on—just."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-kkr-ajinkya-rahane-lack-of-clarity-angkrish-raghuvanshi-blame-2709686-2025-04-16",
      "headline": "Rahane blames lack of clarity with Angkrish for review horror in PBKS vs KKRAjinkya Rahane blamed lack of clarity for the review horror during the PBKS vs KKR game. Rahane said that the communication with Angkrish Raghuvanshi wasn't clear enough in the end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-kkr-nehal-wadhera-full-press-conference-2709699-2025-04-16",
      "headline": "Nehal Wadhera praises Yuzvendra Chahal masterclass after PBKS stun KKRPunjab Kings batter Nehal Wadhera praised Yuzvendra Chahal's match-winning effort with the ball against Kolkata Knight Riders in IPL 2025. Chahal turned the match around with a brilliant bowling session, capturing four key wickets to help PBKS defeat KKK by 16 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-kkr-ajinkya-rahane-full-press-conference-2709688-2025-04-16",
      "headline": "Rahane admits 'collective failure' after KKR fail to chase 112 vs PBKSKolkata Knight Riders captain Ajinkya Rahane described his team's 16-run loss against Punjab Kings as a \"collective batting failure\" after a spectacular collapse on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/la-2028-olympics-south-california-city-of-pomona-to-host-cricket-2709676-2025-04-16",
      "headline": "LA 2028 Olympics: South California city of Pomona to host cricketThe City of Pomona on the West Coast of the United States will host cricket during the Los Angeles Olympics. The LA28 Olympic Games will feature men's and women's cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-alan-wilkins-cancer-free-join-commentary-2709658-2025-04-16",
      "headline": "Commentary icon Alan Wilkins set to join IPL 2025 after beating cancerAlan Wilkins announced himself ready to return to the commentary box for IPL 2025 after beating throat cancer. The 71-year-old veteran, known for his iconic voice, called this comeback a fresh lease on life and urged fans: \"Never give up.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-kkr-shreyas-iyer-glenn-maxwell-number-3-ricky-ponting-2709661-2025-04-16",
      "headline": "Moving Shreyas Iyer from No.3 for Maxwell? Ricky Ponting has hilarious responsePBKS coach Ricky Ponting made a hilarious remark when asked if he would consider moving Shreyas Iyer from number three in favour of Marcus Stoinis. Shreyas has been in fine form for PBKS at the No.3 spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-kkr-nehal-wadhera-full-press-conference-2709699-2025-04-16",
      "headline": "Nehal Wadhera praises Yuzvendra Chahal masterclass after PBKS stun KKRPunjab Kings batter Nehal Wadhera praised Yuzvendra Chahal's match-winning effort with the ball against Kolkata Knight Riders in IPL 2025. Chahal turned the match around with a brilliant bowling session, capturing four key wickets to help PBKS defeat KKK by 16 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-kkr-ajinkya-rahane-full-press-conference-2709688-2025-04-16",
      "headline": "Rahane admits 'collective failure' after KKR fail to chase 112 vs PBKSKolkata Knight Riders captain Ajinkya Rahane described his team's 16-run loss against Punjab Kings as a \"collective batting failure\" after a spectacular collapse on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/la-2028-olympics-south-california-city-of-pomona-to-host-cricket-2709676-2025-04-16",
      "headline": "LA 2028 Olympics: South California city of Pomona to host cricketThe City of Pomona on the West Coast of the United States will host cricket during the Los Angeles Olympics. The LA28 Olympic Games will feature men's and women's cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-alan-wilkins-cancer-free-join-commentary-2709658-2025-04-16",
      "headline": "Commentary icon Alan Wilkins set to join IPL 2025 after beating cancerAlan Wilkins announced himself ready to return to the commentary box for IPL 2025 after beating throat cancer. The 71-year-old veteran, known for his iconic voice, called this comeback a fresh lease on life and urged fans: \"Never give up.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-kkr-shreyas-iyer-glenn-maxwell-number-3-ricky-ponting-2709661-2025-04-16",
      "headline": "Moving Shreyas Iyer from No.3 for Maxwell? Ricky Ponting has hilarious responsePBKS coach Ricky Ponting made a hilarious remark when asked if he would consider moving Shreyas Iyer from number three in favour of Marcus Stoinis. Shreyas has been in fine form for PBKS at the No.3 spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-magic-edge-past-hawks-120-95-to-clinch-playoff-spot-trae-young-ejected-late-in-fourth-quarter-glbs-2709663-2025-04-16",
      "headline": "NBA Play-in tournament: Magic edge past Hawks 120-95 to clinch Playoff Spot; Trae Young ejectedThe Orlando Magic edged out the Atlanta Hawks in a 7-vs-8 Play-In Tournament matchup on Tuesday, April 15, winning 120-95 at the Kia Centre. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mark-boucher-on-kkr-batting-collapse-pbks-vs-kkr-2709612-2025-04-16",
      "headline": "KKR batted themselves into a hole: Mark Boucher's honest assessment of collapseFormer South Africa cricketer Mark Boucher said that the Kolkata Knight Riders (KKR) batted themselves into a hole following their 16-run loss against the Punjab Kings (PBKS) on Match 31 of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-nehal-wadhera-on-ricky-ponting-shreyas-iyer-pbks-beat-kkr-2709615-2025-04-16",
      "headline": "How Ricky Ponting and Shreyas Iyer inspired Mullanpur miracle? Nehal Wadhera revealsPunjab Kings (PBKS) batter Nehal Wadhera revealed how head coach Ricky Ponting and captain Shreyas Iyer inspired them to defend the lowest score in the IPL's history and register a 16-run victory over Kolkata Knight Riders (KKR). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-kkr-ajinkya-rahane-quip-shreyas-iyer-post-match-handshake-viral-2709653-2025-04-16",
      "headline": "Ajinkya Rahane's quip to Shreyas Iyer after KKR's loss to PBKS goes viralAjinkya Rahane didn't hold back in his post-match chat with Shreyas Iyer. Speaking in Marathi, the KKR skipper gave a candid breakdown of the defeat—one that saw PBKS script a dramatic comeback and defend just 111 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-rr-viabhav-suryavanshi-historic-debut-plan-2709640-2025-04-16",
      "headline": "Historic IPL debut on cards? What's Rajasthan's plan for Vaibhav SuryavanshiA historic IPL debut is knocking on the doors for Vaibhav Suryavanshi as he continues to impress within the Rajasthan Royals camp. Will RR take the punt and put the 13-year-old into the mix?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-kkr-yuzvendra-chahal-ricky-ponting-injury-scare-2709610-2025-04-16",
      "headline": "PBKS vs KKR: Emotional Ricky Ponting reveals how Yuzi Chahal overcame injury scareAn emotional Ricky Ponting revealed how Yuzvendra Chahal overcame an injury scare to become PBKS' hero against KKR on Tuesday, April 15. Chahal was the star of the show as Punjab defended the lowest-ever target in IPL history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-preity-zinta-hugs-yuzvendra-chahal-pbks-vs-kkr-2709597-2025-04-15",
      "headline": "PBKS vs KKR: Preity Zinta elated, hugs Yuzi Chahal after Punjab's record winPunjab Kings (PBKS) owner Preity Zinta was seen hugging Yuzvendra Chahal following his match-winning performance against Kolkata Knight Riders (KKR) in Match 31 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-kkr-shreyas-iyer-ajinkya-rahane-mullanpur-2709599-2025-04-15",
      "headline": "Highest chase, lowest score defended: PBKS hand KKR 2 big losses in 2 seasonsIn the matter of two seasons, the Punjab Kings have handed Kolkata Knight Riders to massive losses. PBKS beat KKR by 16 runs to set a record for the lowest score defended in the history of the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-rr-viabhav-suryavanshi-historic-debut-plan-2709640-2025-04-16",
      "headline": "Historic IPL debut on cards? What's Rajasthan's plan for Vaibhav SuryavanshiA historic IPL debut is knocking on the doors for Vaibhav Suryavanshi as he continues to impress within the Rajasthan Royals camp. Will RR take the punt and put the 13-year-old into the mix?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-kkr-yuzvendra-chahal-ricky-ponting-injury-scare-2709610-2025-04-16",
      "headline": "PBKS vs KKR: Emotional Ricky Ponting reveals how Yuzi Chahal overcame injury scareAn emotional Ricky Ponting revealed how Yuzvendra Chahal overcame an injury scare to become PBKS' hero against KKR on Tuesday, April 15. Chahal was the star of the show as Punjab defended the lowest-ever target in IPL history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-preity-zinta-hugs-yuzvendra-chahal-pbks-vs-kkr-2709597-2025-04-15",
      "headline": "PBKS vs KKR: Preity Zinta elated, hugs Yuzi Chahal after Punjab's record winPunjab Kings (PBKS) owner Preity Zinta was seen hugging Yuzvendra Chahal following his match-winning performance against Kolkata Knight Riders (KKR) in Match 31 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-kkr-shreyas-iyer-ajinkya-rahane-mullanpur-2709599-2025-04-15",
      "headline": "Highest chase, lowest score defended: PBKS hand KKR 2 big losses in 2 seasonsIn the matter of two seasons, the Punjab Kings have handed Kolkata Knight Riders to massive losses. PBKS beat KKR by 16 runs to set a record for the lowest score defended in the history of the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-kkr-ajinkya-rahane-reaction-mullanpur-2709582-2025-04-15",
      "headline": "Ajinkya Rahane brutal in assessing KKR's shock loss in Punjab: We batted very badlyAjinkya Rahane was brutal in assessing KKR's batting performance after their shocking loss to PBKS in Mullanpur on April 15. KKR lost the match by 16 runs chasing a target of 112 runs on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-yuzvendra-chahal-marco-jansen-harshit-rana-pbks-vs-kkr-2709576-2025-04-15",
      "headline": "PBKS vs KKR: Chahal, Jansen script miracle as Punjab defend lowest IPL scorePunjab Kings (PBKS) registered a thrilling 16-run victory over Kolkata Knight Riders (KKR) in Match 31 of the Indian Premier League 2025 (IPL 2025).   Yuzvendra Chahal (4/28) and Marco Jansen (3/17) were the stars of the show for Punjab, who defended the lowest ever score in IPL history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/weightlifting-mirabhai-chanu-indian-wrestling-federation-athletes-commission-2709562-2025-04-15",
      "headline": "Mirabhai Chanu elected as Wrestling Federation's Athletes Commission chairpersonTokyo Olympic medallist Mirabhai Chanu was elected as the Indian Wrestling Federation's Athletes Commission chairperson on Tuesday, April 15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunil-narine-leaves-r-ashwin-behind-in-elite-ipl-list-pbks-vs-kkr-2709554-2025-04-15",
      "headline": "Sunil Narine leaves R Ashwin behind in elite IPL list after bamboozling PBKSKolkata Knight Riders (KKR) all-rounder Sunil Narine left Ravichandran Ashwin behind in all-time wicket takers' list in IPL history as he surpassed his tally of 185 scalps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-play-in-tournament-preview-magic-vs-hawks-injury-report-and-how-to-watch-glbs-2709550-2025-04-15",
      "headline": "NBA Play-In tournament preview: Magic vs Hawks, injury report and how to watchThe 2025 NBA Play-in tournament begins with a thrilling Eastern Conference matchup. The Orlando Magic host Atlanta Hawks at the Kia Center on Tuesday night, April 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-rr-nitish-rana-press-conference-bat-check-2709534-2025-04-15",
      "headline": "RR's Nitish Rana comment on bat checks in IPL: No issues, it's the umpire's rightRajasthan Royals batter Nitish Rana has said that he has no issues with the umpires checking the bats as he feels it is their right at the end of the day. RR's' Shimron Hetmyer, RCB's Phil Salt and MI skipper Hardik Pandya's bats were measured on the Field Of Play recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/russell-westbrook-makes-fashion-line-debut-at-wnba-draft-2025-glbs-2709530-2025-04-15",
      "headline": "Russell Westbrook makes fashion line debut at WNBA Draft 2025NBA star Russell Westbrook made history after designing an outfit for Georgia Amoore for the WNBA Draft 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-rr-rahul-dravid-kl-rahul-banter-delhi-2709521-2025-04-15",
      "headline": "DC vs RR: Rahul Dravid, KL Rahul enjoy banter ahead of IPL 2025 clashRR coach Rahul Dravid and DC wicketkeeper-batter KL Rahul enjoyed some banter on the eve of the clash between both teams in IPL 2025. Dravid and Rahul shared a few laughs during a light-hearted conversation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shreyas-iyer-gets-dismissed-for-duck-against-kolkata-knight-riders-2709510-2025-04-15",
      "headline": "IPL 2025: Shreyas Iyer out for duck in first meeting against ex-side KKRPunjab Kings captain Shreyas Iyer got dismissed for a two-ball duck against Kolkata Knight Riders (KKR) in Match 31 of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-stand-wankhede-stadium-mumbai-cricket-approval-2709508-2025-04-15",
      "headline": "Rohit Sharma stand at Wankhede Stadium gets green light from Mumbai cricket bodyIndia captain Rohit Sharma will join the the likes of Sachin Tendulkar and Sunil Gavaskar in getting a stand named after him at the iconic Wankhede Stadium in Mumbai. The Mumbai Cricket Association approved a propsal for the same in its AGM on Tuesday, April 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bat-size-checks-mohit-sharma-hilarious-dc-vs-rr-delhi-2709503-2025-04-15",
      "headline": "Let them get banned: Mohit Sharma's hilarious take on bat size checks in IPLIPL 2025, DC vs RR: Senior fast bowler Mohit Sharma welcomed the BCCI's decision to check the size of the bats in the field of play. The fast bowler highlighted the lack of balance between bat and ball in modern-day T20s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-glenn-maxwell-on-family-support-pbks-vs-kkr-2709502-2025-04-15",
      "headline": "Joined by family, Glenn Maxwell hopes for mid-season turnaround in IPL 2025Australia and Punjab Kings (PBKS) all rounder Glenn Maxwell revealed that his family has come to India to support him amid poor form in the ongoing Indian Premier League 2025 (IPL 2025). "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}