{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stop-us-travel-turkey-tourism-boycott-us-deal-missile-ace-investor-shankar-sharma-2725670-2025-05-16",
      "headline": "Stop all bookings to America, warns ace investor as Indians ditch TurkeyTourism to Turkey and Azerbaijan has already taken a major hit, especially after reports that Pakistan used Turkish-made drones in its recent strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-to-open-may-20-check-gmp-expected-listing-gains-2725648-2025-05-16",
      "headline": "Borana Weaves IPO to open May 20: Check GMP, expected listing gainsAccording to grey market trends, the IPO is commanding a premium of Rs 55 per share, suggesting potential listing gains of over 25% for successful applicants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-assures-india-manufacturing-plans-intact-despite-donald-trump-remarks-2725630-2025-05-16",
      "headline": "Apple assures India manufacturing plans intact despite Trump remarks: ReportWhile Apple has not issued a public statement, sources said the company reaffirmed to Indian officials that India remains a key part of its global supply chain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-share-price-stock-in-focus-today-sebi-probe-stake-sale-japan-sbmc-2725615-2025-05-16",
      "headline": "Explained: Why Yes Bank shares are in focus todayYes Bank stock: The shares fell over 1% in early trade but later recovered to trade in the green. At the start of the day, Yes Bank shares opened at Rs 21.50, slightly below Thursday's close of Rs 21.51."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-offers-zero-tariff-bilateral-trade-deal-to-us-report-2725614-2025-05-16",
      "headline": "Pakistan offers zero-tariff bilateral trade deal to US: ReportThe development comes shortly after US President Donald Trump claimed credit for brokering a ceasefire between India and Pakistan, following four days of intense cross-border hostilities involving drones and missile strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bharti-airtel-share-price-falls-3-percent-in-early-trade-today-2725602-2025-05-16",
      "headline": "Explained: Why Bharti Airtel shares fell 3% in early trade today At 9:35 am, shares of Bharti Airtel were trading 2.69% lower at Rs 1,816.60 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-share-price-down-1-percent-internal-audit-report-rs-674-crore-interest-wrong-2725600-2025-05-16",
      "headline": "IndusInd bank shares down 2% after private lender flags interest mistakeIndusInd bank stock opened at Rs 735.95 after having closed at Rs 780.30 in the previous session. The shares have lost 7.29% in the past 5 days, 23.55% over the last 6 months, and 45.48% over the past year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-200-points-nifty-remains-above-25000-indusind-bank-down-3-2725598-2025-05-16",
      "headline": "Sensex, Nifty open lower after yesterday's rally; IndusInd Bank down 3%The BSE Sensex was down 226.18 points to 82,304.56 at 9:20 am, while the NSE Nifty50 fell 67.80 points to trade at 24,994.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-prediction-today-sensex-nifty-opening-higher-dalal-street-trading-rally-nse-bse-2725577-2025-05-16",
      "headline": "Stock market today: Sensex, Nifty likely to open higher. Here's whyBoth the Sensex and Nifty touched their highest levels in the last seven months in the last session. So far this week, the Nifty has gained around 4.5% and the BSE Sensex about 4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-may-16-shares-in-news-today-hyundai-airtel-indusind-bank-bhel-bajaj-auto-nse-bse-trading-2725574-2025-05-16",
      "headline": "Stocks to watch on May 16: Hyundai, Airtel, IndusInd Bank, BHEL, Bajaj AutoHyundai Motor, BHEL, Delhivery, Emami will announce their earnings for the January-March quarter on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-accounting-error-internal-audit-department-rs-674-crore-incorrect-interest-2725571-2025-05-16",
      "headline": "IndusInd Bank flags Rs 674 crore error as 'incorrectly recorded interest'The bank said its Internal Audit Department (IAD) found that a total of Rs 674 crore was wrongly shown as interest over three quarters in FY 2024-25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-offered-zero-tariff-trade-deal-donald-trump-2725297-2025-05-15",
      "headline": "India offered zero-tariff trade deal: Donald TrumpUS President Donald Trump claimed that India has offered the United States a trade deal with \"literally zero tariffs\". "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/putul-director-indira-dhar-to-unveil-debut-bollywood-film-cannes-film-festival-2025-2725666-2025-05-16",
      "headline": "Director of Oscar-nominated film Putul to unveil her next at Cannes Film FestivalAcclaimed filmmaker Indira Dhar is making her Bollywood debut with 'Echoes of Valour', a poignant biopic set in an Indian Army family.  The film's first look and title will be unveiled at the Cannes Film Festival 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/anupam-kher-makes-red-carpet-debut-at-cannes-2025-with-tanvi-the-great-2725627-2025-05-16",
      "headline": "Anupam Kher makes red carpet debut at Cannes 2025 with 'Tanvi the Great'Anupam Kher made his Cannes debut ahead of the premiere of his film, 'Tanvi the Great'. He shared a heartfelt message on Instagram embracing his Hindi roots and urging everyone to follow their dream despite struggles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/when-bhumi-pednekar-spoke-about-her-too-big-lips-people-pay-lakhs-to-get-it-done-2725656-2025-05-16",
      "headline": "Bhumi Pednekar's old clip about 'too big lips' resurfacesActor Bhumi Pednekar's old interview in which she reacted to criticism regarding her looks has surfaced online. The actor spoke about how people comment on her lips. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gagan-arora-on-choosing-jewel-thief-and-breaking-out-of-college-boy-roles-2725360-2025-05-16",
      "headline": "Gagan Arora on choosing Jewel Thief, and breaking out of 'college boy' rolesActor Gagan Arora is on a mission to break stereotypes with the diverse roles he's been embracing. In an exclusive interview with India Today, the 31-year-old, who shot to fame with 'College Romance', shared that he's been fighting and working relentlessly each day to prove his versatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/patralekhaa-says-desperation-for-work-anxiety-made-her-do-bold-role-in-love-games-2725650-2025-05-16",
      "headline": "Patralekhaa says desperation for work, anxiety made her do bold role in Love GamesBollywood actor Patralekhaa admitted taking on a bold role in Vikram Bhatt's 'Love Games' due to desperation for work and anxiety issues. She made her Bollywood debut with 'CityLights' in 2014. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-reacts-to-babil-khan-viral-video-bashing-bollywood-felt-terrible-as-a-parent-2725647-2025-05-16",
      "headline": "Karan Johar reacts to Babil Khan's viral video: I felt terribleBabil Khan's emotional video stirred widespread attention and concern in the Indian film industry, prompting reactions from family and peers alike. Karan Johar  reacted to the video and expressed his empathy as a parent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kajal-aggarwal-joins-nitesh-tiwari-ramayana-as-mandodari-opposite-yash-ravana-2725626-2025-05-16",
      "headline": "Kajal Aggarwal joins Nitesh Tiwari's Ramayana, to play Ravana's wife MandodariKajal Aggarwal has been cast as Mandodari in Nitesh Tiwari's highly awaited 'Ramayana'. She will play Mandodari, opposite Yash's Ravana. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nitanshi-goel-cannes-debut-in-black-gold-gown-gets-phool-marks-from-fans-2725619-2025-05-16",
      "headline": "Nitanshi Goel's Cannes debut in black-gold gown gets 'phool marks' from fansActor Nitanshi Goel made her much-anticipated debut at the Cannes Film Festival, turning heads in a striking black and gold gown by Jade. The 'Laapataa Ladies' star received widespread praise online for her elegant appearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/maaman-review-soori-family-drama-promising-ideas-outdated-values-2725613-2025-05-16",
      "headline": "Maaman Review: Promising ideas meet patriarchy in Soori's family dramaReleased-Fri May 16, 2025Maaman movie review: Director Prasanth Pandiyaraj's' 'Maaman' starring Soori, Aishwarya Lekshmi and Swasika, is a family drama that explores the relationship between a doting uncle and his nephew. While the film sets up nice conflicts, it often gets subverted due to skewed ideas about family. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-diagnosed-with-liver-tumour-to-undergo-surgery-says-husband-shoaib-ibrahim-2725610-2025-05-16",
      "headline": "TV actor Dipika Kakar diagnosed with liver tumour, to undergo surgery soonTV actor Dipika Kakar has been diagnosed with a tumour in her liver bigger than a tennis ball and will undergo surgery soon. Her husband, Shoaib Ibrahim, shared the health update and requested fans to pray for her speedy recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-says-shakiras-wardrobe-malfunction-affected-his-met-gala-entry-2725582-2025-05-16",
      "headline": "Diljit Dosanjh says Shakira's wardrobe malfunction affected his Met Gala entryDiljit Dosanjh recently opened up about Shakira's unexpected wardrobe malfunction just before her Met Gala appearance this year. In a newly released YouTube vlog, the singer shared behind-the-scenes moments from his debut at the prestigious event."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mouni-roy-social-media-hate-plastic-surgery-rumours-palak-tiwari-celebrity-bashing-2725585-2025-05-16",
      "headline": "Mouni Roy addresses social media hate, Palak Tiwari reflects on celebrity bashingActors Mouni Roy and Palak Tiwari talked about social media hate. The two talked about navigating through the relentless trolling, especially on one's appearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vijay-raaz-quitted-sexual-harassment-case-sherni-film-set-2725569-2025-05-16",
      "headline": "'Stree' actor Vijay Raaz acquitted in 2020 sexual harassment caseActor Vijay Raaz has been acquitted of all sexual harassment and stalking charges. He was accused of molesting a crew member during the shooting of Vidya Balan's 'Sherni'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-bond-actor-joe-don-baker-dies-at-89-glbs-2725564-2025-05-16",
      "headline": "James Bond actor Joe Don Baker dies at 89Joe Don Baker, acclaimed actor of Walking Tall and three James Bond films, has died at 89. A versatile performer across film and TV, he retired in 2012 and leaves behind a celebrated legacy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/alex-g-announces-2025-north-american-tour-with-nilufer-yanya-glbs-2725558-2025-05-16",
      "headline": "Alex G Announces 2025 North American tour with Nilüfer YanyaAlex G will embark on a 16-city North American tour in fall 2025, joined by Nilüfer Yanya. Highlights include major venues like Radio City and Ryman. Tickets go on sale May 20.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lollapalooza-2025-full-lineup-and-set-times-released-what-to-know-glbs-2725546-2025-05-16",
      "headline": "Lollapalooza 2025 full lineup and set times released: What to knowLollapalooza 2025 returns to Chicago's Grant Park July 31–August 3 with a diverse lineup, including Olivia Rodrigo, Twice, and A$AP Rocky. Full daily schedule and tickets now available online.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chris-brown-arrested-in-uk-for-alleged-attack-at-london-club-glbs-2725544-2025-05-16",
      "headline": "R&B Star Chris Brown formally charged over alleged nightclub incident in LondonSinger Chris Brown was arrested in Manchester over a 2023 London nightclub assault. He allegedly attacked music producer Abe Diaw. No formal charges yet; the case may affect his UK tour.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/human-remains-found-near-taylor-swifts-rhode-island-mansion-glbs-2725539-2025-05-16",
      "headline": "Human remains found near Taylor Swift's mansion in US amid serial killer scareA human leg bone was found near Taylor Swift's Rhode Island mansion, alarming locals and fuelling serial killer fears amid similar cases across the Northeast. Police say no foul play is suspected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/scarlett-johansson-reacts-to-oscars-snubbing-avengers-endgame-2725431-2025-05-15",
      "headline": "Scarlett Johansson reacts to Oscars snubbing 'impossible movie' Avengers EndgameActress Scarlett Johansson has reacted to MCU's Avengers: Endgame getting snubbed at Oscars 2020. She called the sci-fi action-thriller an 'impossible movie.' "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-conflict-military-action-all-party-foreign-tour-army-2725633-2025-05-16",
      "headline": "India to mount diplomatic offensive on Pak, send MPs to brief countriesA delegation of MPs from all political parties will begin an outreach tour after May 22 to brief foreign nations on the recent India-Pakistan conflict and India's stance, sources said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-news-live-jammu-and-kashmir-operation-sindoor-indian-army-loc-border-2725566-2025-05-16",
      "headline": "Live: Army details how 6 terrorists were killed in 2 anti-terror ops in J&KIndia Pakistan Conflict Live Updates: Today marks the sixth day since India and Pakistan reached an understanding to cease hostilities, bringing an end to the heightened military tensions that had escalated following the April 22 Pahalgam terrorist attack and India's subsequent retaliatory Operation Sindoor. Following a meeting between the Directors General of Military Operations (DGMOs) of India and Pakistan after the ceasefire, both armies firmed up the arrangement to halt military actions. The Indian Army said it will pursue confidence-building measures to reduce the 'alertness level' in line with the understanding. Stay tuned to IndiaToday.in for all the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/defence-budget-additional-allocation-weapons-technology-operation-sindoor-2725581-2025-05-16",
      "headline": "Defence budget may get Rs 50,000-crore push amid Operation Sindoor: SourcesThe additional spending will be directed towards the purchase of weapons and ammunition, as well as technology, following Operation Sindoor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-under-fire-as-us-military-strategist-slams-1-billion-imf-bailout-for-pak-glbs-2725568-2025-05-16",
      "headline": "Trump under fire as US military strategist slams $1 billion IMF bailout for PakEx-Pentagon adviser Michael Rubin slammed the IMF's $1B bailout to Pakistan, calling it aid to a \"terror-addled, pro-China regime.\" He said it undermines Trump, bails out China, and rewards Pakistan's terrorism-linked actions against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retirement-india-test-captain-jasprit-bumrah-drs-2725624-2025-05-16",
      "headline": "DRS - Who should be India's next Test captain after Rohit's retirement?Rohit Sharma's retirement from Test cricket has created a significant leadership void in the Indian team. In this edition of the Democratic Review System, we explore the potential captaincy options India can consider ahead of their Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-leader-p-chidambaram-concerns-india-alliance-future-says-bloc-is-frayed-2725535-2025-05-16",
      "headline": "INDIA alliance is frayed: P Chidambaram expresses concerns over bloc's futureThe former Union finance minister warned that the INDIA bloc was fighting against a \"formidable machinery\", which must be fought on all fronts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/thank-trump-for-peace-kashmiri-waiter-told-me-in-doha-white-house-secretary-glbs-2725541-2025-05-16",
      "headline": "Kashmiri waiter in Doha thanked Trump for peace, claims White House Press SecretaryWhite House Press Secretary Karoline Leavitt credited President Trump for brokering an India-Pakistan ceasefire, citing a Kashmiri waiter's gratitude, despite Indian officials denying US involvement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/celebi-aviation-clearance-revoked-statement-turkey-india-pakistan-conflict-2725457-2025-05-15",
      "headline": "Erdogan's daughter not owner, we are not Turkish: Aviation firm on losing clearanceCelebi Aviation's security clearance was revoked by Indian authorities following tensions with Turkey after Operation Sindoor. The company has denied any political affiliations or Turkish ownership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/scorched-cities-why-india-urgently-needs-a-national-heatwave-action-plan-2724762-2025-05-16",
      "headline": "Why India urgently needs a national heatwave action planTemperatures have been projected to reach 45°C in certain areas of Rajasthan. The impact of urban heat islands will contribute to major health risks in cities like Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/in-a-first-jaishankar-holds-first-ever-call-with-taliban-foreign-minister-glbs-2725562-2025-05-16",
      "headline": "In a 1st, Jaishankar speaks to Taliban minister, welcomes J&K attack condemnationIn the first political-level contact between India and Afghanistan since the Taliban seized power in Kabul in August 2021, External Affairs Minister S Jaishankar spoke with the country's acting Foreign Minister over the phone and thanked him for condemning the Pahalgam attacks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/former-fbi-chief-james-comey-assassination-threat-donald-trump-8647-post-2725603-2025-05-16",
      "headline": "Ex-FBI chief under scanner for 'murder threat' to Trump after '8647' postJames Comey, who was fired by Trump during his first term, has deleted the post after he faced severe backlash from Republicans and members of Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nitanshi-goel-cannes-debut-in-black-gold-gown-gets-phool-marks-from-fans-2725619-2025-05-16",
      "headline": "Nitanshi Goel's Cannes debut in black-gold gown gets 'phool marks' from fansActor Nitanshi Goel made her much-anticipated debut at the Cannes Film Festival, turning heads in a striking black and gold gown by Jade. The 'Laapataa Ladies' star received widespread praise online for her elegant appearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-conflict-turkey-drones-azerbaijan-drones-congress-bjp-amit-malviya-prime-minister-modi-s-jaishankar-2725607-2025-05-16",
      "headline": "Congress can't align with people's sentiments on Turkey, slams BJP, party hits backWhile the BJP slammed the Congress for evading questions on calls to boycott Turkey and Azerbaijan over their support to Pakistan, the Congress hit back, stating that decisions on diplomatic ties should be clarified by the government, not the opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/new-covid-19-wave-spreads-in-asia-infections-rise-in-hong-kong-and-singapore-glbs-2725563-2025-05-16",
      "headline": "New Covid-19 wave spreads in Asia, infections rise in Hong Kong and SingaporeCovid-19 cases are rising sharply in Hong Kong and Singapore, with health officials warning of a new wave across Asia. According to reports, the increase may be a reflexion of declining immunity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-assures-india-manufacturing-plans-intact-despite-donald-trump-remarks-2725630-2025-05-16",
      "headline": "Apple assures India manufacturing plans intact despite Trump remarks: ReportWhile Apple has not issued a public statement, sources said the company reaffirmed to Indian officials that India remains a key part of its global supply chain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-says-shakiras-wardrobe-malfunction-affected-his-met-gala-entry-2725582-2025-05-16",
      "headline": "Diljit Dosanjh says Shakira's wardrobe malfunction affected his Met Gala entryDiljit Dosanjh recently opened up about Shakira's unexpected wardrobe malfunction just before her Met Gala appearance this year. In a newly released YouTube vlog, the singer shared behind-the-scenes moments from his debut at the prestigious event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-ranthambore-tigress-kankatis-fate-hangs-in-the-balance-2725253-2025-05-15",
      "headline": "Why Ranthambore tigress Kankati's fate hangs in the balanceTwo human kills in quick succession later, forest officials debate if shifting the sub-adult tigress out of the national park is a plausible option  \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-tweeted-my-statement-without-listening-samajwadi-mp-on-caste-remark-on-vyomika-singh-2725575-2025-05-16",
      "headline": "Yogi Adityanath didn't listen to me: Samajwadi MP on Vyomika Singh caste remarkSamajwadi Party MP Ramgopal Yadav accused BJP of targeting officers based on caste and religion, alleging CM Yogi shared his remarks without context. He defended his comments by citing bias in law enforcement and governance.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/maaman-review-soori-family-drama-promising-ideas-outdated-values-2725613-2025-05-16",
      "headline": "Maaman Review: Promising ideas meet patriarchy in Soori's family dramaReleased-Fri May 16, 2025Maaman movie review: Director Prasanth Pandiyaraj's' 'Maaman' starring Soori, Aishwarya Lekshmi and Swasika, is a family drama that explores the relationship between a doting uncle and his nephew. While the film sets up nice conflicts, it often gets subverted due to skewed ideas about family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/new-leak-reveals-iphone-folds-display-details-2725589-2025-05-16",
      "headline": "Leak reveals iPhone Fold display details, punch-hole camera is almost certainThe upcoming iPhone Fold is rumoured to ditch the dynamic island. Here is what the new rumour indicates about the iPhone Fold's display. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-offers-zero-tariff-bilateral-trade-deal-to-us-report-2725614-2025-05-16",
      "headline": "Pakistan offers zero-tariff bilateral trade deal to US: ReportThe development comes shortly after US President Donald Trump claimed credit for brokering a ceasefire between India and Pakistan, following four days of intense cross-border hostilities involving drones and missile strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/operation-sindoor-indian-army-8-year-old-boy-tn-karur-donates-savings-2725611-2025-05-16",
      "headline": "8-year-old from Tamil Nadu donates savings to Indian Army, wins heartsEight-year-old Sai Dhanvish from Tamil Nadu donated his year-long savings to the Indian Army. Known for helping others, he marked the gesture at the Collector's office. His parents run a fish shop in Velliyanai."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/jaipur/story/jaipur-man-lies-on-funeral-pyre-halts-mother-cremation-over-silver-bangles-rajasthan-2725620-2025-05-16",
      "headline": "Son halts mother's cremation in Jaipur, lies on pyre over silver banglesIn Jaipur, a man laid on his mother's funeral pyre, halting the cremation over a dispute about her silver bangles. The incident caused a two-hour delay and was caught on video.\r\n\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-laliga-team-effort-not-lamine-yamal-alone-hansi-flick-2725662-2025-05-16",
      "headline": "Hansi Flick credits Barcelona's LaLiga title to team effort, not Yamal aloneHansi Flick has transformed a youthful Barcelona side into LaLiga champions, but he insists their triumph is down to unity, discipline, and teamwork — not just the breakout brilliance of Lamine Yamal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mitchell-johnson-overseas-players-lives-safety-india-2725654-2025-05-16",
      "headline": "Lives, safety most important: Johnson asks overseas players to skip IPLIPL 2025: With the tournament resuming on May 17, former fast bowler Mitchell Johnson said that foreign players shouldn't go back to India keeping their safety in mind. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mitchell-starc-delhi-capitals-not-returning-remainder-of-season-reports-2725634-2025-05-16",
      "headline": "Mitchell Starc opts against returning to India for remainder of IPL 2025: ReportsMitchell Starc is reportedly not going to return for the remainder of IPL 2025, leaving Delhi Capitals without their pace spearhead at a crucial stage. His absence comes as a major setback as the team pushes for a spot in the playoffs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retirement-india-test-captain-jasprit-bumrah-drs-2725624-2025-05-16",
      "headline": "DRS - Who should be India's next Test captain after Rohit's retirement?Rohit Sharma's retirement from Test cricket has created a significant leadership void in the Indian team. In this edition of the Democratic Review System, we explore the potential captaincy options India can consider ahead of their Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-tim-david-rcb-rain-bengaluru-chinnaswamy-2725606-2025-05-16",
      "headline": "Swim David: Watch RCB star enjoy rainy evening in Bengaluru before IPL resumptionIPL 2025: Australian batter Tim David enjoyed the rainy weather in Bengaluru as he was seen swimming on the ground covers at the M Chinnaswamy Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-ravindra-jadeja-test-captaincy-india-2725588-2025-05-16",
      "headline": "Ashwin joins Test captaincy debate, backs his spin twin to lead India for 2 yearsFormer India spinner R. Ashwin has weighed in on the India Test captaincy debate, backing his spin twin Ravindra Jadeja to lead the men's Test team for the next two years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-casper-ruud-italian-open-record-2725580-2025-05-16",
      "headline": "Jannik Sinner in elite company with Big 3 after hammering Casper RuudItalian Open 2025: Jannik Sinner put on a dominating performance after beating Casper Ruud 6-0, 6-1 in the quarterfinal. He will next face Tommy Paul in the semis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/doha-diamond-league-neeraj-chopra-preview-90m-jan-zelezny-coach-2725576-2025-05-16",
      "headline": "With Zelezny in his corner, fit-again Neeraj Chopra aims to join 90m club in DohaInjury-free and working with legendary coach Jan Železný, Neeraj Chopra is eyeing the elusive 90m mark as he kicks off his 2025 season in Doha. The two-time Olympic medallist is confident and in form, looking to join the elite club at a venue famed for big javelin throws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/la-liga-barcelona-espanyol-treble-hansi-flick-2725573-2025-05-16",
      "headline": "Barcelona completes treble with 28th La Liga titleBarcelona won their 28th La Liga title after beating Espanyol 2-0 on Thursday at the RCDE Stadium on the back of goals from Fermin Lopez and Lamine Yamal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/la-liga-barcelona-car-fans-injured-drive-2725570-2025-05-16",
      "headline": "Several fans injured after being hit by a car before Barcelona derbyA female driver was arrested by Catalonia's police force after her car hit several Espanyol supporters before the Catalan derby against Barcelona in LaLiga.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-argentina-probable-squad-2026-fifa-world-cup-qualifiers-2725509-2025-05-15",
      "headline": "Messi named in Argentina probable squad for 2026 FIFA World Cup qualifiersArgentina have named captain Lionel Messi in their probable squad for the 2026 FIFA World Cup qualifiers against Chile and Colombia, the national team announced on Thursday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-casper-ruud-italian-open-record-2725580-2025-05-16",
      "headline": "Jannik Sinner in elite company with Big 3 after hammering Casper RuudItalian Open 2025: Jannik Sinner put on a dominating performance after beating Casper Ruud 6-0, 6-1 in the quarterfinal. He will next face Tommy Paul in the semis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/doha-diamond-league-neeraj-chopra-preview-90m-jan-zelezny-coach-2725576-2025-05-16",
      "headline": "With Zelezny in his corner, fit-again Neeraj Chopra aims to join 90m club in DohaInjury-free and working with legendary coach Jan Železný, Neeraj Chopra is eyeing the elusive 90m mark as he kicks off his 2025 season in Doha. The two-time Olympic medallist is confident and in form, looking to join the elite club at a venue famed for big javelin throws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/la-liga-barcelona-espanyol-treble-hansi-flick-2725573-2025-05-16",
      "headline": "Barcelona completes treble with 28th La Liga titleBarcelona won their 28th La Liga title after beating Espanyol 2-0 on Thursday at the RCDE Stadium on the back of goals from Fermin Lopez and Lamine Yamal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/la-liga-barcelona-car-fans-injured-drive-2725570-2025-05-16",
      "headline": "Several fans injured after being hit by a car before Barcelona derbyA female driver was arrested by Catalonia's police force after her car hit several Espanyol supporters before the Catalan derby against Barcelona in LaLiga.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-argentina-probable-squad-2026-fifa-world-cup-qualifiers-2725509-2025-05-15",
      "headline": "Messi named in Argentina probable squad for 2026 FIFA World Cup qualifiersArgentina have named captain Lionel Messi in their probable squad for the 2026 FIFA World Cup qualifiers against Chile and Colombia, the national team announced on Thursday.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}