{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/defence-stocks-grse-cochin-shipyard-mazagon-dock-rally-sharply-what-should-investors-do-2724532-2025-05-14",
      "headline": "GRSE, Cochin Shipyard, Mazagon Dock shares rise up to 17%: Good time to buy?At 12:17 pm, shares of Cochin Shipyard were trading 10.37% higher at Rs 1,740.80, while GRSE was trading 15.92% higher at 2,220. Mazagon Dock Shipbuilders was also up over 5%.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-itr-7-form-out-what-is-different-and-who-must-file-itr-filing-2025-2724502-2025-05-14",
      "headline": "New ITR-7 Form out: What's different and who must fileNew fields have been added to the ITR-7 form to help eligible entities clearly report housing loan interest claimed under Section 24(b)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-steel-share-price-jumps-capital-expnditure-expansion-plan-2724481-2025-05-14",
      "headline": "Explained: Why Tata Steel shares jumped over 4% todayAt around 10:30 am, shares of the company were trading 4.41% higher at Rs 156.10 on the BSE. The rally was sparked by fresh optimism following disclosures from top company officials about the scale and focus of Tata Steel's expansion plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/raymond-shares-down-64-percent-why-is-the-stock-falling-amid-realty-demerger-2724477-2025-05-14",
      "headline": "Raymond shares crash 64%: Why is the stock falling after realty demerger?At last count, the stock was trading at Rs 556.45, down 64.36% from its previous close of Rs 1,561.30. The sharp fall coincided with the ex-date of the demerger, when Raymond shares stopped factoring in the value of its real estate business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-continues-sensex-nifty-rise-key-reasons-to-know-2724468-2025-05-14",
      "headline": "Sensex jumps over 500 points today: Why is the stock market rising today?Today's sharp rebound followed Tuesday's volatile session where the Nifty had tumbled over 400 points from its intraday high before closing near day's low. This was largely due to profit booking after Monday's euphoric ceasefire rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-shares-fall-sharply-after-q4-results-key-reasons-to-know-2724462-2025-05-14",
      "headline": "Tata Motors shares fall after Q4 results. Key reasons to knowAt first glance, the headline numbers seemed disappointing. A 51% year-on-year drop in consolidated net profit to Rs 8,470 crore and flat revenue at Rs 1.19 lakh crore. But despite the sharp dip in profit, Tata Motors outperformed Street expectations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/raymond-stock-in-focus-realty-business-demerger-all-you-need-to-know-2724461-2025-05-14",
      "headline": "Raymond stock in spotlight as realty demerger takes effect. Check detailsAs per the approved scheme, Raymond shareholders will receive one equity share of Raymond Realty for every share held in Raymond. The standalone real estate company is expected to be listed during the September quarter of FY26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-300-points-nifty-above-24600-as-inflation-cools-2724451-2025-05-14",
      "headline": "Sensex surges over 400 points, Nifty nears 24,800 as inflation coolsAt 9:29 am, the BSE Sensex was up 462.27 points at 81,610.49, while the NSE Nifty50 rose 135.35 points to 24,713.70. Both indices extended gains shortly after the opening bell, signalling bullish momentum. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/msci-includes-indias-coromandel-nykaa-to-key-index-to-global-standard-index-in-may-rejig-2724447-2025-05-14",
      "headline": "MSCI includes India's Coromandel, Nykaa to key index in May rejigThe inclusion could bring passive inflows worth $216 million-$227 million into Coromandel and $172 million - $181 million into Nykaa, according to IIFL Alternate Research and JM Financial estimates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-opening-cooling-inflation-us-china-deal-positive-2724438-2025-05-14",
      "headline": "Stock market today: Sensex, Nifty likely to open positive as inflation coolsGift Nifty futures were quoting at 24,729.5 as of 8:15 am, suggesting the Nifty 50 could open comfortably above Tuesday's close of 24,578.35. This comes a day after the Sensex and Nifty logged their steepest single-day losses in a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-microsoft-is-firing-about-6000-employees-while-spending-billions-on-ai-glbs-2724395-2025-05-14",
      "headline": "Why Microsoft is firing about 6,000 employees while spending billions on AI?Microsoft is cutting around 6,000 jobs to save money, even while it spends big on artificial intelligence. The company says the move will help it focus on important areas as building AI tools is becoming more expensive and affecting profits.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-declines-to-6-year-low-of-316-in-april-2724166-2025-05-13",
      "headline": "Retail inflation declines to 6-year low of 3.16% in AprilRetail inflation dropped to a six-year low of 3.16% in April 2025 from 3.34% in March, thanks to cheaper vegetables, fruits, pulses, and protein-rich food."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/enrique-iglesias-to-perform-in-mumbai-this-october-report-2724542-2025-05-14",
      "headline": "Spanish singer Enrique Iglesias to perform in Mumbai this October: ReportEnrique Iglesias will reportedly perform in Mumbai this October. The singer, popular for tracks like 'Bailamos' and 'Heart Attack', has earlier performed in India in 2004 and 2012."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-rajkumar-hiurani-reunite-5-years-pk-3-idiots-2724537-2025-05-14",
      "headline": "Aamir Khan and Rajkumar Hirani to reunite after 5 years: ReportAamir Khan and Rajkumar Hirani are set to reunite after five years for an upcoming project. Reportedly, the production is expected to begin after 'Sitare Zameen Par' release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/salma-hayek-is-ageless-and-iconic-at-58-on-sports-illustrated-swimsuit-cover-2724516-2025-05-14",
      "headline": "Salma Hayek is ageless and iconic at 58 on Sports Illustrated Swimsuit cover. WatchAt 58, Salma Hayek makes a powerful debut on the 'Sports Illustrated Swimsuit' cover, challenging age stereotypes with grace and confidence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-says-directors-dont-have-guts-to-slam-actors-like-ranbir-kapoor-2724515-2025-05-14",
      "headline": "Vivek Agnihotri says directors don't 'have guts' to slam actors like Ranbir KapoorFilmmaker Vivek Agnihotri recently said in an interview that Bollywood directors do not have the courage to criticise stars for their performances, while they do the same behind closed doors. He was speaking in the context of the criticism of 'Animal' director Sandeep Reddy Vanga. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/spider-noir-nicolas-cage-looks-dark-spider-man-1st-look-teaser-leaked-2724510-2025-05-14",
      "headline": "Spider-Noir: Nicolas Cage looks dark as Spider-Man in 1st look, teaser leakedActor Nicolas Cage is set returning as Spider-Man in the upcoming series 'Spider-Man Noir'. The makers unveiled his first look from the live-action drama. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/santhanam-dd-next-level-janasena-ttd-board-member-2724501-2025-05-14",
      "headline": "Janasena, BJP members condemn use of devotional song in actor Santhanam's filmTamil actor Santhanam's upcoming film, 'DD Next Level', is currently embroiled in controversy over the use of devotional song. Janasena and BJP members have condemned the use and called for removal of the song from the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/robert-downey-jr-flexes-his-muscles-in-bts-pics-from-doomsday-sets-2724489-2025-05-14",
      "headline": "Robert Downey Jr flexes his muscles in BTS pics from Doomsday setsRobert Downey Jr is busy filming his upcoming movie Avengers: Doomsday. On Tuesday, the actor posted a BTS picture from the set, flexing his biceps, drawing attention from fans. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-hits-back-at-vivek-agnihotri-calls-him-liar-2724483-2025-05-14",
      "headline": "Anurag Kashyap hits back at Vivek Agnihotri, calls him 'jhoota aadmi'Filmmaker Vivek Agnihotri recently accused Anurag Kashyap of alcoholism and shirking writing duties during their collaboration on the film Goal. Anurag Kashyap has strongly denied these allegations, calling Vivek a liar and clarifying he was never on set."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/samay-raina-dodges-question-on-indias-got-latent-in-first-public-appearance-after-row-2724464-2025-05-14",
      "headline": "Samay Raina's funny reaction to paps' question on comeback after Latent rowComedian Samay Raina made his first public appearance on Tuesday following the announcement of his much-anticipated comeback tour. However, he remained tight-lipped when asked about the return of his show India's Got Latent.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nimrat-kaur-sofia-quershi-vyomika-singh-operation-sindoor-2724453-2025-05-14",
      "headline": "Actor Nimrat says Sofiya Qureshi-Vyomika Singh's Op Sindoor briefing sends strong messageNimrat Kaur praised women officers Colonel Sofiya Qureshi and Wing Commander Vyomika Singh in Operation Sindoor, highlighting India's secularism and women empowerment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/cannes-2025-urvashi-rautela-trolled-over-bold-parrot-clutch-colourful-outfit-2724436-2025-05-14",
      "headline": "Cannes 2025: Urvashi Rautela trolled over bold parrot clutch, colourful outfitAnother year, another bold look from Bollywood actor Urvashi Rautela. She walked the red carpet at the 78th Cannes Film Festival in a colourful ensemble, a tiara and a crystal parrot-shaped clutch, sparking buzz online. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/sonu-nigam-moves-karnataka-high-court-to-cancel-fir-on-bengaluru-concert-remarks-2724432-2025-05-14",
      "headline": "Sonu Nigam moves Karnataka High Court to quash case over Bengaluru concert remarksSinger Sonu Nigam has approached the Karnataka High Court to quash an FIR filed against him for allegedly making objectionable remarks at a concert that reportedly hurt Kannadiga sentiments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/robert-benton-oscar-winning-filmmaker-behind-kramer-vs-kramer-dies-at-92-2724424-2025-05-14",
      "headline": "Robert Benton, Oscar-winning filmmaker behind Kramer vs. Kramer, dies at 92Robert Benton's son, John, said that he died Sunday at his home in Manhattan of 'natural causes.' During a 40-year screen career, the Texas native received six Oscar nominations and won three times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pawandeep-rajan-indian-idol-12-winner-mera-saaya-hospital-room-multiple-surgeries-2724429-2025-05-14",
      "headline": "Indian Idol 12 winner Pawandeep Rajan sings Mera Saaya from hospital room. WatchIndian Idol 12 winner Pawandeep Rajan was seen singing 'Mera Saaya' from the hospital room. He underwent multiple surgeries after being involved in a serious car accident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/robert-de-niro-donald-trump-philistine-president-fight-for-speech-leonardo-dicaprio-cannes-2025-2724421-2025-05-14",
      "headline": "Robert De Niro shreds 'Philistine President' Trump in fiery Cannes speechAcclaimed actor and filmmaker Robert De Niro was awarded the honorary Palme d'Or at Cannes Film Festival 2025 by Leonardo DiCaprio. In his acceptance speech, he slammed President Donald Trump and called for protests against him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/stranger-things-final-season-wraps-filming-set-for-november-2025-release-glbs-2724412-2025-05-14",
      "headline": "Stranger Things final season wraps filming, set for November 2025 releaseStranger Things has completed filming for its final season, marking the end of an iconic sci-fi saga. Cast and creators call the farewell emotional, with a potential late 2025 release on the horizon.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/espn-goes-direct-to-consumer-in-disneys-bold-streaming-expansion-glbs-2724410-2025-05-14",
      "headline": "ESPN goes direct-to-consumer in Disney's bold streaming expansionDisney is launching a $29.99/month ESPN streaming service offering full sports coverage. It will also be bundled with Disney+ and Hulu, marking Disney's strongest push into direct-to-consumer sports streaming.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/disneys-2025-snow-white-remake-now-streaming-digitally-in-uk-and-us-glbs-en-2724405-2025-05-14",
      "headline": "Disney's 2025 Snow White remake now streaming digitally in UK and USDisney's 2025 Snow White remake is now on digital platforms after mixed reviews and modest box office returns. It's expected to stream on Disney+ by late June or early July 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kim-kardashian-testifies-in-paris-tearful-account-of-2016-armed-robbery-glbs-2724403-2025-05-14",
      "headline": "Thought I was going to die: Kim Kardashian's tearful account of armed robberyKim Kardashian tearfully testified in Paris about her 2016-armed robbery, describing the traumatic ordeal that changed her life. The robbers tracked her online and made off with $6 million in jewelry.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bsf-jawan-pk-shaw-detained-by-pakistan-after-accidentally-crossing-border-repatriated-at-wagah-border-2724498-2025-05-14",
      "headline": "Pak returns BSF jawan to India 20 days after he accidentally crossed borderBSF constable Purnam Kumar Shaw of the 182nd Battalion was detained by Pakistan Rangers on April 23 after he inadvertently crossed the International Border near Ferozepur, Punjab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ins-vikrant-brahmos-equipped-warships-submarines-blockaded-paks-karachi-port-during-op-sindoor-sources-2724482-2025-05-14",
      "headline": "INS Vikrant-led 36-ship armada was in position to hit Karachi: SourcesFollowing the recent terror attack in Jammu and Kashmir's Pahalgam in which 26 people were killed, India launched a tri-pronged pressure strategy on Pakistan. The Navy was placed on high alert, prompting Pakistan to issue NAVAREA warnings amid fears of a possible naval strike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/creative-naming-will-not-alter-reality-india-rejects-chinas-renaming-of-some-places-in-arunachal-pradesh-2724450-2025-05-14",
      "headline": "Creative naming can't alter reality: India rejects China's Arunachal renamingIn a strongly worded statement, the Ministry of External Affairs (MEA) firmly rejected China's latest attempt to rename several locations in Arunachal Pradesh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chinese-state-run-global-times-xinhua-news-agencys-x-accounts-blocked-in-india-for-spreading-pak-propaganda-2724525-2025-05-14",
      "headline": "China's Global Times, Xinhua blocked in India for spreading Pak propagandaIndia on Wednesday banned Chinese state-run handles of Xinhua News Agency and Global Times on microblogging site X over the spreading of Pakistani propaganda and unverified information amid simmering tensions between Delhi and Islamabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/br-gavai-next-chief-justice-six-months-tenure-first-woman-cji-bv-nagarathna-just-36-days-term-supreme-court-2710040-2025-05-14",
      "headline": "Gavai to be CJI for 6 months, first woman CJI might serve just 36 daysJustice BR Gavai took oath as the 52nd Chief Justice of India on Wednesday, and will serve as the CJI for six months. If you think this is a short tenure, consider that the first possible woman CJI will serve for just 36 days. Yet, her tenure will not be the shortest as CJI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-pakistan-reporter-shuts-down-prime-minister-narendra-modi-peace-deal-2724418-2025-05-14",
      "headline": "US official shuts down Pak reporter who accused PM Modi of blocking peace dealWhen the Pakistani reporter asked whether the US was disappointed that PM Modi did not welcome the 'peace deal,' US Department of State official Thomas Pigott said that the focus was on the ceasefire. 'Our focus is the ceasefire and encouraging direct communication,' said the US official."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-islamist-maulana-abdul-quddus-faruqi-calls-suicide-attack-kolkata-taliban-style-hindu-hate-cleric-2724261-2025-05-14",
      "headline": "Would send suicide bombers to Kolkata: Bangladeshi cleric advocates Taliban tacticA Bangladeshi Islamic cleric, Maulana Abdul Quddus Faruqi, has called for suicide attacks on Kolkata, endorsing a Taliban-style tactic. In the video that has been watched over 1.3 lakh times, Faruqi declared that if the Bangladesh army permitted it, he would plan the attack. He used hate-filled rhetoric against Hindus and India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-ramps-up-trade-pact-efforts-donald-trump-signals-another-major-deal-tariff-2724469-2025-05-14",
      "headline": "India ramps up trade pact efforts as Trump signals another major deal in worksIndia's recent proposal to the World Trade Organisation to slap retaliatory tariffs on the US -- in response to its import duties on Indian steel and aluminium -- will also feature in the upcoming trade talks during deliberations on the bilateral trade agreement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/virat-kohli-premanand-maharaj-prasann-ho-anushka-sharma-question-viral-video-2724485-2025-05-14",
      "headline": "Virat Kohli's reply to Premanand Maharaj's 'Prasann Ho' question goes viralA day after announcing his Test retirement, Virat Kohli visited Shri Hit Radha Keli Kunj Ashram in Vrindavan with Anushka Sharma to seek blessings. A video of their conversation with Premanand Maharaj has since gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-ceasefire-live-operation-sindoor-us-trump-pak-radiation-leak-reports-air-strikes-pm-modi-bjp-congress-2724443-2025-05-14",
      "headline": "Live: Cabinet security meet at PM's residence, first since India-Pak ceasefireIndia-Pakistan Ceasefire Live: The Indian armed forces launched Operation Sindoor on May 7 to avenge the Pahalgam attack where 26 people - mostly tourists – were killed. Subsequently, the two countries were involved in military actions against each other. Defence Minister Rajnath Singh told an all-party meeting on May 8 that at least 100 hardcore terrorists and their associates were killed in Indian strikes on terror sites in Pakistan and Pakistan-occupied-Kashmir (PoK) under the ongoing Operation Sindoor. The two neighbouring countries reached an understanding for ceasefire on May 10. Follow indiatoday.in for more updates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anil-kumble-names-ideal-contender-for-virat-kohlis-no-4-spot-in-test-squad-2724511-2025-05-14",
      "headline": "Anil Kumble names ideal contender for Virat Kohli's no 4 spot in Test squadLegendary India spinner and former head coach Anil Kumble has given his ideal replacement for Virat Kohli's number four spot in the Indian Test team following the retirement of the star batter. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/colonel-sofiya-qureshi-fake-attack-claim-x-rss-denied-by-belagavi-police-karnataka-operation-sindoor-pahalgam-attack-pakistan-2724467-2025-05-14",
      "headline": "Fake X post claims RSS-led attack on Col Sofiya Qureshi's home in KarnatakaColonel Sofiya Qureshi, a key face of Operation Sindoor, has been falsely targeted by viral posts alleging an RSS-led attack on her family, claims now officially debunked by Belagavi police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/cannes-2025-urvashi-rautela-trolled-over-bold-parrot-clutch-colourful-outfit-2724436-2025-05-14",
      "headline": "Cannes 2025: Urvashi Rautela trolled over bold parrot clutch, colourful outfitAnother year, another bold look from Bollywood actor Urvashi Rautela. She walked the red carpet at the 78th Cannes Film Festival in a colourful ensemble, a tiara and a crystal parrot-shaped clutch, sparking buzz online. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-trump-comparing-pm-modi-shehbaz-sharif-hyphenating-india-pak-2724435-2025-05-14",
      "headline": "Trump comparing PM Modi with Shehbaz Sharif, hyphenating India-Pak: CongressCongress leader Pawan Khera shared a clip of Donald Trump from an event in Saudi Arabia and criticised the US president, saying that he is hyphenating India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/husband-affair-not-abetment-of-suicide-unless-wife-was-tormented-delhi-high-court-2724522-2025-05-14",
      "headline": "Husband's affair isn't abetment of suicide unless wife was tormented: CourtThe Delhi High Court said an extramarital relationship was not a ground to implicate the husband for dowry death in the absence of a nexus between the alleged relationship and dowry demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-urges-bcci-to-hold-remainder-of-ipl-2025-quietly-2724488-2025-05-14",
      "headline": "No dancing girls, no DJ: Gavaskar urges BCCI to hold remainder of IPL 2025 quietlyLegendary India cricketer Sunil Gavaskar has urged the BCCI to host the remainder of the Indian Premier League 2025 in a quiet manner to respect the sentiments of the families, who've lost their loved ones in the recent attacks by Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/woman-shuts-down-man-asking-her-to-speak-in-marathi-video-viral-2724512-2025-05-14",
      "headline": "Woman shuts down man asking her to speak in Marathi. Video goes viralA video showing a Marathi-speaking man confronting a woman for not speaking in Marathi has gone viral, with the girl firmly defending her right to speak in her language of choice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-india-pakistan-terrorist-camp-attack-pahalgam-strike-ai-video-indian-army-2724294-2025-05-13",
      "headline": "Watch India Today special: Operation Sindoor reconstructed using AIIndia Today TV's special report on Operation Sindoor, using AI, reconstructs the daring, covert 100-hour Indian military mission that eliminated over 100 terrorists across nine cross-border camps with precision airstrikes, sending a powerful message of deterrence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/lashkar-e-taiba-terror-allies-glorify-pak-military-operation-operation-bunyan-marsoos-threaten-india-2724496-2025-05-14",
      "headline": "Lashkar, terror allies glorify Pak military op, threaten India at Karachi rallyRadical clerics and leaders from banned and controversial groups assembled under the umbrella of the Difa-e-Watan Council (DWC) -- an alliance known for hosting extremist ideologues -- to heap praise on the military's role in the aftermath of Operation Sindoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/who-is-new-upsc-chairman-meet-ajay-kumar-man-behind-defence-reforms-like-agniveer-2724519-2025-05-14",
      "headline": "1985-batch IAS Ajay Kumar, behind defence reforms like Agniveer, now UPSC chairmanDr Ajay Kumar, a retired 1985-batch IAS officer, has been appointed as the new Chairman of UPSC. He earlier served as India's Defence Secretary and played a major role in reforms like Agniveer and the creation of the Chief of Defence Staff. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/gaganyaan-mission-training-on-hold-where-are-the-four-astronauts-2724503-2025-05-14",
      "headline": "Where are the four Gaganyaan astronauts as Op Sindoor is paused?The four astronauts-Group Captains Shubhanshu Shukla, Prashanth B Nair, Ajit Krishnan, and Angad Pratap-have taken different paths recently. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-couple-refuses-pay-pizza-delivery-man-not-speaking-marathi-2724479-2025-05-14",
      "headline": "Watch: Mumbai couple refuses to pay pizza delivery man for not speaking MarathiThe incident took place in Mumbai's Bhandup area. When the delivery boy asked if there is a compulsion to speak in Marathi, the woman in the viral video says, \"Hai yahan pe aise hi.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-z-category-enhanced-bulletproof-car-tighter-security-measures-mha-sources-2724417-2025-05-14",
      "headline": "S Jaishankar's security enhanced with two bulletproof vehicles: Government sourcesAs per government sources, the security of External Affairs Minister S Jaishankar has been increased with the addition of two bulletproof vehicles and tighter measures around his residence in Delhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cpm-bikash-ranjan-bhattacharya-operation-sindoor-terrorist-pahalgam-attack-died-2724423-2025-05-14",
      "headline": "'Have Pahalgam terrorists been found?' CPM leader questions Operation SindoorCommunist Party Of India (Marxist) Rajya Sabha MP Bikash Ranjan Bhattacharya, during an interview, questioned if the goals of Operation Sindoor have been achieved. He asked if any terrorist involved in the Pahalgam terror attack had died."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/alien-earth-1st-look-poster-of-adarsh-gouravs-hollywood-sci-fi-series-out-2724548-2025-05-14",
      "headline": "Alien Earth: 1st look poster of Adarsh Gourav's Hollywood sci-fi series outThe first-look poster of Adarsh Gourav's upcoming show 'Alien: Earth' was unveiled on Wednesday. The sci-fi series will premiere in September. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-rajkumar-hiurani-reunite-5-years-pk-3-idiots-2724537-2025-05-14",
      "headline": "Aamir Khan and Rajkumar Hirani to reunite after 5 years: ReportAamir Khan and Rajkumar Hirani are set to reunite after five years for an upcoming project. Reportedly, the production is expected to begin after 'Sitare Zameen Par' release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/salma-hayek-is-ageless-and-iconic-at-58-on-sports-illustrated-swimsuit-cover-2724516-2025-05-14",
      "headline": "Salma Hayek is ageless and iconic at 58 on Sports Illustrated Swimsuit cover. WatchAt 58, Salma Hayek makes a powerful debut on the 'Sports Illustrated Swimsuit' cover, challenging age stereotypes with grace and confidence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-says-directors-dont-have-guts-to-slam-actors-like-ranbir-kapoor-2724515-2025-05-14",
      "headline": "Vivek Agnihotri says directors don't 'have guts' to slam actors like Ranbir KapoorFilmmaker Vivek Agnihotri recently said in an interview that Bollywood directors do not have the courage to criticise stars for their performances, while they do the same behind closed doors. He was speaking in the context of the criticism of 'Animal' director Sandeep Reddy Vanga. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yograj-singh-reacts-to-rohitsharma-and-virat-kohlis-retirements-2724538-2025-05-14",
      "headline": "Great players should play till 50: Yograj Singh reacts to Rohit, Kohli's retirementsFormer India all-rounder Yograj Singh has reacted to the retirements of star Indian batting duo of Rohit Sharma and Virat Kohli saying that great players should continue playing till the age of 50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-shankar-basu-olympic-role-model-2724536-2025-05-14",
      "headline": "Virat Kohli trained like an Olympic athlete: Former India coachShanker Basu praised Virat Kohli for setting the benchmark for other players with his strong work and training discipline. Earlier, Kohli retired from Test cricket before India's tour of England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-wtc-final-south-africa-playoffs-2724514-2025-05-14",
      "headline": "WTC Final-bound South Africa players likely to miss playoffsSouth African cricketers, who are a part of the World Test Championship Final against Australia, are most likely to miss the playoffs in the Indian Premier League 2025. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anil-kumble-names-ideal-contender-for-virat-kohlis-no-4-spot-in-test-squad-2724511-2025-05-14",
      "headline": "Anil Kumble names ideal contender for Virat Kohli's no 4 spot in Test squadLegendary India spinner and former head coach Anil Kumble has given his ideal replacement for Virat Kohli's number four spot in the Indian Test team following the retirement of the star batter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chinelle-henry-wpl-history-west-indies-vs-england-2724499-2025-05-14",
      "headline": "WPL history maker ruled out of West Indies' tour of EnglandWest Indies all-rounder Chinelle Henry missed out on the tour of England after he failed to recover from a leg injury. The visitors called up Realeanna Grimmond and Jahzara Claxton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-urges-bcci-to-hold-remainder-of-ipl-2025-quietly-2724488-2025-05-14",
      "headline": "No dancing girls, no DJ: Gavaskar urges BCCI to hold remainder of IPL 2025 quietlyLegendary India cricketer Sunil Gavaskar has urged the BCCI to host the remainder of the Indian Premier League 2025 in a quiet manner to respect the sentiments of the families, who've lost their loved ones in the recent attacks by Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-italian-open-history-feat-francisco-cerundolo-2724478-2025-05-14",
      "headline": "Jannik Sinner equals historic feat after pre-quarters winItalian Open 2025: Jannik Sinner made his way through to the quarters in Rome after beating Argentina's Francisco Cerundolo 7-6 (7-2), 6-3 on Tuesday at Centre Court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/diego-maradona-death-daughter-doctor-negligence-2724454-2025-05-14",
      "headline": "Maradona's daughter testifies against football star's doctor for negligenceGianinna Maradona, Diego Maradona's daughter, told the court that her father's health had significantly deteriorated a month before his death, and that she had raised her concerns with Dr. Luque multiple times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-jasprit-bumrah-test-captaincy-kris-srikkanth-2724445-2025-05-14",
      "headline": "Don't thrust Test captaincy on Shubman Gill, Bumrah best option: Kris SrikkanthIn an exclusive interaction, World Cup-winner, Kris Srikkanth, shared his thoughts on the race to succeed Rohit Sharma as India's next Test captain. While heaping praise on Virat Kohli's contributions to red-ball cricket, the former India opener also backed Sai Sudharsan for a long haul in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/daniil-medvedev-italian-open-2025-rowdy-rome-crowd-boos-video-2724442-2025-05-14",
      "headline": "Watch: Medvedev hits back at rowdy Rome crowd with aggressive responseItalian Open 2025: Daniil Medvedev faced a rowdy crowd in Rome that heckled him during his pre-quarterfinal match against Lorenzo Musetti on Tuesday, May 13. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-test-retirement-maharashtra-chief-minister-meeting-2724427-2025-05-14",
      "headline": "Maharashtra CM meets Rohit Sharma, wishes him well after Test retirementMaharashtra Chief Minister Devendra Fadnavis was delighted to meet Rohit Sharma at his residence, extending his best wishes after the Indian captain's retirement from Test cricket. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-italian-open-history-feat-francisco-cerundolo-2724478-2025-05-14",
      "headline": "Jannik Sinner equals historic feat after pre-quarters winItalian Open 2025: Jannik Sinner made his way through to the quarters in Rome after beating Argentina's Francisco Cerundolo 7-6 (7-2), 6-3 on Tuesday at Centre Court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/diego-maradona-death-daughter-doctor-negligence-2724454-2025-05-14",
      "headline": "Maradona's daughter testifies against football star's doctor for negligenceGianinna Maradona, Diego Maradona's daughter, told the court that her father's health had significantly deteriorated a month before his death, and that she had raised her concerns with Dr. Luque multiple times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-jasprit-bumrah-test-captaincy-kris-srikkanth-2724445-2025-05-14",
      "headline": "Don't thrust Test captaincy on Shubman Gill, Bumrah best option: Kris SrikkanthIn an exclusive interaction, World Cup-winner, Kris Srikkanth, shared his thoughts on the race to succeed Rohit Sharma as India's next Test captain. While heaping praise on Virat Kohli's contributions to red-ball cricket, the former India opener also backed Sai Sudharsan for a long haul in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/daniil-medvedev-italian-open-2025-rowdy-rome-crowd-boos-video-2724442-2025-05-14",
      "headline": "Watch: Medvedev hits back at rowdy Rome crowd with aggressive responseItalian Open 2025: Daniil Medvedev faced a rowdy crowd in Rome that heckled him during his pre-quarterfinal match against Lorenzo Musetti on Tuesday, May 13. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-test-retirement-maharashtra-chief-minister-meeting-2724427-2025-05-14",
      "headline": "Maharashtra CM meets Rohit Sharma, wishes him well after Test retirementMaharashtra Chief Minister Devendra Fadnavis was delighted to meet Rohit Sharma at his residence, extending his best wishes after the Indian captain's retirement from Test cricket. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}