{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-stark-irony-of-worlds-4th-largest-economy-with-81-crore-free-mealers-2749762-2025-07-06",
      "headline": "The stark irony of world's 4th largest economy with 81 crore free-mealersIndia's growing wealth gap often sparks despair, but the author, a retired ESIC Regional Director, argues the real solution lies in enforcing India's long-ignored labour laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oxford-india-forum-2025-business-leaders-policymakers-entrepreneurs-kalli-purie-isro-ai-2751203-2025-07-05",
      "headline": "Oxford India Forum 2025 celebrates India's rising influence, youthful ambitionThe Oxford India Forum 2025 brought together a dynamic mix of business leaders, policymakers, entrepreneurs, academics and students to reflect on India's evolving global role and the path forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/the-great-indian-salary-crisis-middle-class-unemployment-job-loss-268-04-07-2025",
      "headline": "The Great Indian Salary CrisisWhite-collar employees in India are caught in a salary spiral where costs keep climbing, pay moves slowly, and financial stability slips further away. On paper, the economy is booming, but the pay cheques of working middle-class Indians tell a very different story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-proposes-retaliatory-duties-at-world-trade-body-against-us-tariffs-on-autos-2750911-2025-07-04",
      "headline": "India proposes retaliatory duties at world trade body against US tariffs on autosIndia has proposed to impose an equivalent amount of duty collected from products originating in the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/real-estate-vs-mutual-funds-where-should-you-invest-explains-stock-market-expert-2750826-2025-07-04",
      "headline": "Real Estate vs Mutual Funds: Where should you invest, explains stock market expertOwning a house was once every family's dream, but times have changed. With high prices and new ways to invest, is real estate still smart, or are mutual funds better? A stock market expert explains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/video/ankur-mehra-book-pixels-to-profits-creators-must-think-like-startups-not-influencers-2750822-2025-07-04",
      "headline": "Ankur Mehra says creators must think like startups, not influencersAnkur Mehra, in his new book Pixels to Profits, urges creators to stop chasing follower counts and instead build sustainable, multi-platform businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/success-isnt-about-number-of-followers-in-creator-economy-ankur-mehra-2750781-2025-07-04",
      "headline": "Success isn't about number of followers in creator economy: Ankur MehraIn a conversation with Business Today's Sakshi Batra, Ankur Mehra, author of Pixels to Profits, explains what it really takes to succeed in the creator economy, and why chasing viral fame or follower counts may be the wrong metric altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-192-points-higher-nifty-below-25500-infosys-gains-1-percent-2750774-2025-07-04",
      "headline": "Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/prada-kolhapuri-chappal-gi-tag-law-protection-indian-articrafts-artisans-reform-global-policy-fashion-2750757-2025-07-04",
      "headline": "India tags it, West sells it. Can Prada's Kolhapuri row lead to real reform?The luxury brand's new \"toe-ring sandal\" has ignited not just cultural outrage but also legal action in India, with a Public Interest Litigation filed in the Bombay High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-itr-2-and-itr-3-forms-why-they-are-missing-and-what-to-do-income-tax-filing-2750711-2025-07-04",
      "headline": "Where are ITR-2 and ITR-3 forms? Why they're missing and what to doIt's ITR season but many taxpayers can't find the ITR-2 and ITR-3 forms on the Income Tax portal yet. If you have capital gains, foreign income or business income, this delay might worry you. The good news is there's an extended deadline this year. Here's why these forms are missing and what you should do next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sbi-credit-card-rules-changing-from-july-15-here-is-what-cardholders-must-know-2750616-2025-07-04",
      "headline": "SBI credit card rules changing from July 15: Here's what cardholders must knowAt present, many cardholders pay only a small part of their bill to avoid late charges. But now, the way the minimum amount due (MAD) is calculated will change starting July 15, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/exclusive-world-bank-poverty-in-india-measurement-metrics-one-in-four-below-minimum-standard-of-living-2750607-2025-07-04",
      "headline": "One in 4 Indians still below minimum standard of living: World BankDespite a sharp drop in extreme poverty, about one in four Indians still falls below the level needed to meet essential needs and maintain a minimum standard of living."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-ban-jane-street-stock-manipulation-bank-nifty-options-futures-shorting-reason-interim-order-2750597-2025-07-04",
      "headline": "Sebi bans Jane Street for stock market manipulation. Here's what went wrongUS Trading Firm Jane Street: Securities and Exchange Board of India (Sebi) said the trades executed by the group were \"prima facie fraudulent and manipulative\" and violated the country's capital market regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-rs-36-lakh-in-5-years-know-who-can-avail-this-government-scheme-national-savings-certificate-nsc-2750564-2025-07-04",
      "headline": "Want Rs 36 lakh in 5 years? Know who can avail this government schemeThis government scheme offers guaranteed returns, so you don't have to worry about market ups and downs. For the current quarter, the interest rate is fixed at 7.7% per year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/soham-parekh-us-startups-multiple-jobs-moonlighting-why-reasons-latest-update-2750540-2025-07-04",
      "headline": "Why did Soham Parekh work multiple jobs? Indian techie shares his reasonsHe confirmed that he worked at several companies simultaneously and misrepresented his location and employment status in the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-gathering-dust-in-locker-financial-advisor-explains-how-to-make-it-work-2750539-2025-07-04",
      "headline": "Gold gathering dust in locker? Financial advisor explains how to make it workA financial advisor has warned that family gold stored in lockers faces risk from rust, floods, and poor insurance. He explains how a scheme can offer safety and steady returns instead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epf-nps-can-build-rs-12-crore-retirement-fund-tax-expert-breaks-it-down-2750519-2025-07-04",
      "headline": "EPF, NPS can build Rs 12 crore retirement fund. Tax expert breaks it downFor salaried individuals earning up to Rs 14.65 lakh annually, Bangar believes this combination offers the best of both worlds: zero tax under the new regime and long-term wealth creation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-82-points-higher-nifty-below-25500-bajaj-finance-up-2-percent-2750516-2025-07-04",
      "headline": "Sensex opens 82 points higher, Nifty below 25,500; Bajaj Finance up 2%The S&P BSE Sensex was up 46.97 points to 83,286.44, while the NSE Nifty50 added 14.45 points to 25,419.75 as of 9:22 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-openai-collaboration-ai-enterprise-chatgpt-business-sam-altman-vijay-guntur-2750514-2025-07-04",
      "headline": "HCLTech joins hands with OpenAI to take AI to businessesThe collaboration aims to help global companies adopt AI at scale, combining HCLTech's industry experience with OpenAI's advanced AI models and tools."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-banned-sebi-from-stock-market-rs-4843-crore-seized-unlawful-gains-equity-derivatives-trading-2750504-2025-07-04",
      "headline": "Global trading firm Jane Street banned by Sebi from securities marketAccording to an order published on Sebi's website, the regulator has ordered the seizure of Rs 48.4 billion (approximately $570 million), which it claims is the total amount of illegal profit made by Jane Street. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dearness-allowance-da-hike-4-percent-pay-commission-7th-8th-cpi-data-central-government-employees-2750493-2025-07-04",
      "headline": "DA hike July 2025: 4% increase likely for central government employeesDearness Allowance is revised twice a year, in January and July. It is based on the average of All India Consumer Price Index for Industrial Workers (AICPI-IW) data over the past 12 months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-world-most-valued-company-ai-boom-chipmaking-apple-microsoft-2750330-2025-07-03",
      "headline": "Nvidia to become world's most valued company ever with $3.9 trillion market capNvidia is set to become the most valuable company ever, reaching a $3.92 trillion market cap amid soaring AI demand. Its dominance in AI chipmaking has fuelled rapid growth, outpacing rivals like Apple and Microsoft.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-appoints-former-niti-aayog-ceo-amitabh-kant-as-non-executive-director-2750310-2025-07-03",
      "headline": "IndiGo appoints former NITI Aayog CEO Amitabh Kant as non-executive directorIndiGo has appointed former NITI Aayog CEO Amitabh Kant as a Non-Executive Director on its board, pending regulatory and shareholder approvals. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-bars-foreclosure-charges-on-floating-rate-loans-to-micro-small-businesses-2750292-2025-07-03",
      "headline": "RBI bars foreclosure charges on floating rate loans to micro, small businessesAccording to the new rules, no prepayment charges will be allowed on floating rate loans to MSEs or to individuals borrowing for business purposes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-poverty-income-inequality-ppp-mmrp-who-is-poor-world-bank-niti-aayog-2750057-2025-07-03",
      "headline": "How poor is 'poor' in India?Millions of Indians have exited extreme poverty, yet many still live one crisis away from hunger, debt, or despair. In this deep dive, we examine why poverty is retreating in numbers, but not in reality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-files-confidential-papers-for-ipo-to-raise-rs-4250-crore-report-2750174-2025-07-03",
      "headline": "Meesho files confidential papers for IPO to raise Rs 4,250 crore: ReportMeesho is a well-known player in India's booming e-commerce space, taking on giants like Amazon and Flipkart, with big global investors such as Prosus, Elevation Capital, WestBridge Capital, SoftBank, and Peak XV Partners backing it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-settles-170-points-lower-nifty-below-25500-maruti-down-1-percent-2750131-2025-07-03",
      "headline": "Sensex settles 170 points lower, Nifty below 25,500; Maruti down 1%The S&P BSE Sensex was down by 170.22 points to end at 83,239.47, while the NSE Nifty50 fell by 48,10 points to close at 25,405.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/investing-mutual-fund-sip-regular-checks-money-management-portfolio-review-2750107-2025-07-03",
      "headline": "Don't set and forget: Why your SIPs need regular check-upsWhile the idea of 'set it and forget it' may seem peaceful, doing so could lead to long-term underperformance, missed opportunities, or even a shortfall in your retirement goals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-founder-and-ceo-nithin-kamath-cautions-investors-against-risks-in-unlisted-shares-2750088-2025-07-03",
      "headline": "Zerodha's Nithin Kamath cautions investors against risks in unlisted sharesNithin Kamath said that many people get carried away by the hype around buying shares of companies before they go public. But in reality, unlisted shares are risky and can leave investors stuck without a way to sell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/crude-oil-wti-brent-forecast-middle-east-tension-iran-israel-conflict-sp-global-2750084-2025-07-03",
      "headline": "Has the oil market grown numb to conflict in the Middle East?Global oil demand growth in 2025 is on track to be just 870,000 barrels per day. This would make it the weakest year for oil demand since 2001, except during major economic disruptions like the 2008 financial crisis and the COVID-19 pandemic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-income-inequality-now-worse-than-british-era-says-financial-analyst-2750041-2025-07-03",
      "headline": "India's income inequality now worse than British era, says financial analystThe divide between India's rich and poor is bigger than ever, with almost half the people surviving on very little, while a privileged few hold most of the wealth, says Hardik Joshi, a financial analyst."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-ceo-sashidhar-jagdishan-moves-supreme-court-against-lilavati-hospital-fir-2749997-2025-07-03",
      "headline": "HDFC Bank CEO moves Supreme Court against Lilavati Hospital FIRThe clash between one of India's largest private banks and a big Mumbai hospital is linked to a financial transaction, but the exact details of the FIR or the amount involved were not shared in court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lost-your-itr-login-here-is-how-to-file-income-tax-using-net-banking-2749970-2025-07-03",
      "headline": "Lost your ITR login? Here's how to file income tax using net bankingIf you can't remember your Income Tax portal password, you don't need to reset it straight away. Most major banks in India allow you to access the e-Filing portal through their net banking services. It's a safe and easy way to file your return on time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nestle-axis-bank-dividend-stock-ex-date-share-price-stock-market-july-3-2749960-2025-07-03",
      "headline": "Axis Bank, Nestle India set dividend record dates; last day to buy shares todayNestle India and Axis Bank have fixed July 4 as the record date, which will decide who is eligible to receive the dividend payouts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-pulls-out-chinese-staff-from-plants-south-india-iphone-production-takes-hit-report-2749935-2025-07-03",
      "headline": "The quiet Chinese game to disrupt iPhone production in IndiaThe latest model, the iPhone 17, was to be a huge step in Apple's plans to make India its second home for high-end production. That roadmap now looks uncertain as Foxconn has pulled out Chinese staff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-soham-parekh-the-indian-techie-accused-of-moonlighting-in-us-2749908-2025-07-03",
      "headline": "Who is Soham Parekh, Indian techie who worked at 4-5 US startups at same time?Soham Parekh, who is believed to be based in India, is alleged to have simultaneously worked at up to four or five startups—many of them backed by Y Combinator—raising questions about hiring practices in remote-first tech culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-157-points-higher-nifty-above-25500-eternal-up-2-percent-2749901-2025-07-03",
      "headline": "Sensex, Nifty struggle for direction as markets await India-US deal newsThe S&P BSE Sensex was down by 13.01 points to 83,396.68, while the NSE Nifty50 lost 3.70 points to 25,449.70 as of 9:29 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-expectation-sensex-nifty-trading-setup-bse-nse-us-vietnam-trade-deal-china-2749878-2025-07-03",
      "headline": "Will Sensex, Nifty open higher amid US–Vietnam trade deal impact?Gift Nifty futures were trading at 25,584 points at 8:18 am, suggesting an increase from the previous close of 25,574.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-july-3-nse-bse-trading-nykaa-rvnl-nestle-yes-bank-dmart-pnb-2749874-2025-07-03",
      "headline": "Stocks to watch on July 3: Nykaa, RVNL, Nestle, Yes Bank, Dmart, PNBInvestors are now watching company announcements for the April–June quarter results, while developments related to a possible trade deal between India and the United States are also being closely followed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retiring-without-children-here-is-how-to-plan-for-a-comfortable-and-secure-future-2749583-2025-07-02",
      "headline": "Retiring without children? Here's how to plan for a comfortable and secure futureToday, more and more Indians are choosing to remain child-free or find themselves without direct heirs for various reasons. For them, retirement planning isn't just about saving money and building a corpus, it's about securing comfort, care, dignity, and independence in their golden years."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vikrant-massey-deepika-padukone-8-hour-shift-request-she-deserves-2751670-2025-07-06",
      "headline": "Vikrant Massey on Deepika Padukone's 8-hour shift request: She deserves itActor Vikrant Massey has backed his 'Chhapaak' (2020) co-star Deepika Padukone's call for shorter work shifts. He also reflected on the importance of flexible timings and financial considerations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-gets-emotional-during-speech-at-us-event-for-telugu-community-2751647-2025-07-06",
      "headline": "Samantha gets emotional during speech at US event for Telugu communityActor Samantha Ruth Prabhu was recently moved to tears during her speech at Telugu Association of North America (TANA) 2025 event. She addressed the North American Telugu community in her speech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/madhavan-praises-priyanka-chopra-heads-of-state-actor-2751617-2025-07-06",
      "headline": "Madhavan gives shout-out to Priyanka's performance in Heads of State, actor reactsActor Priyanka Chopra recently responded to R Madhavan's praise for her performance in 'Heads of State'. The latter expressed pride in her achievements and Hollywood fame."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jackson-wang-joins-vijay-varma-pratik-gandhi-jeetendra-kumar-jaideep-ahlawat-netflix-the-great-indian-kapil-show-watch-viral-video-2751623-2025-07-06",
      "headline": "Jackson Wang to light up Kapil Sharma Show with Vijay Varma, Pratik Gandhi. WatchK-pop idol Jackson Wang is all set to appear in the next episode of Netflix's 'The Great Indian Kapil Show'. He was joined by Vijay Varma, Jeetendra Kumar, Pratik Gandhi, and Jaideep Ahlawat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-takes-a-dig-at-prada-flaunts-og-kolhapuri-footwear-2751597-2025-07-06",
      "headline": "Kareena Kapoor takes a dig at Prada, flaunts her OG Kolhapuri footwearActor Kareena Kapoor flaunted her OG Kolhapuri footwear as she took a dig at Prada following the latest controversy. The luxury brand was called out for copying traditional Kolhapuri chappal designs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-first-look-fans-call-ranveer-singh-beast-new-spy-thriller-2751578-2025-07-06",
      "headline": "Dhurandhar 1st look X review: Fans call Ranveer Singh a beast in new spy-thrillerRanveer Singh surprised fans with the first look of his upcoming film 'Dhurandhar'. The action-packed theme of the spy-thriller received appreciation from fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/richard-gere-14th-dalai-lama-90th-birthday-dharamshala-2751547-2025-07-06",
      "headline": "Actor Richard Gere attends Dalai Lama's 90th birthday, seeks his blessingsActor Richard Gere attended the 14th Dalai Lama's 90th birthday celebrations in Dharamshala. In a heartfelt moment, the Hollywood star was seen receiving blessings from the Tibetan spiritual leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-wishes-lord-of-bling-ranveer-singh-shares-sweet-gesture-wife-deepika-padukone-2751577-2025-07-06",
      "headline": "KJo wishes lord of bling Ranveer Singh, shares his sweet gesture for wife DeepikaKaran Johar shared a special post to celebrate Ranveer Singh's 40th birthday. The filmmaker wrote a heartfelt note and praised the actor's style and what he does to make his wife Deepika Padukone smile. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-reunion-us-allu-arjun-joins-sukumar-sreeleela-recites-iconic-dialogue-2751532-2025-07-06",
      "headline": "Pushpa reunion in US: Allu Arjun joins Sukumar, Sreeleela, recites iconic dialogueAllu Arjun paid tribute to Telugu culture and cinema at the North American Telugu Society (NATS) with his iconic dialogue from 'Pushpa 2'. He also felicitated director K Raghvendra Rao at the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-teaser-ranveer-singh-wreaks-havoc-fierce-new-avatar-r-madhavan-akshaye-khanna-arjun-rampal-aditya-dhar-2751546-2025-07-06",
      "headline": "Dhurandhar first look: Ranveer Singh wreaks havoc in fierce new avatarRanveer Singh shared the gripping first look of his upcoming film 'Dhurandhar'. Also starring R Madhavan, Sanjay Dutt, Akshaye Khanna, and others in key roles, the movie will release in theatres on December 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kaagaz-ke-phool-chronicle-of-guru-dutt-descent-from-hope-to-surrender-pyaasa-2751522-2025-07-06",
      "headline": "Kaagaz Ke Phool: Chronicle of Guru Dutt's descent from hope to surrender'Kaagaz Ke Phool' (1959)explores the contrasting worldviews in Guru Dutt's iconic film 'Pyaasa' (1957). While 'Pyaasa' portrays the artist's defiance against a shallow society, embracing authenticity and love, 'Kaagaz Ke Phool' presents a tragic tale of surrender, loneliness, and despair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-beams-with-pride-abhishek-bachchan-wins-praise-for-kaalidhar-laapata-2751506-2025-07-06",
      "headline": "Big B beams with pride as Abhishek wins praise for Kaalidhar Laapata. See postAmitabh Bachchan shared a heartfelt message for son Abhishek after his latest film 'Kaalidhar Laapata' received an outpouring of love from fans. The veteran actor expressed how his heart swelled with pride seeing the appreciation coming Abhishek's way.\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-emotional-note-for-shefali-jariwala-death-will-find-you-every-time-you-are-born-2751494-2025-07-06",
      "headline": "Parag Tyagi's emotional note for Shefali: Will find you every time you are bornIn an emotional note, actor Parag Tyagi remembered his wife, Shefali Jariwala. He posted old photos together and expressed his love for her in every lifetime.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-box-office-day-2-anurag-basu-film-sara-ali-khan-pankaj-tripathi-ali-fazal-aditya-roy-kapur-saturday-growth-2751474-2025-07-06",
      "headline": "Metro In Dino box office Day 2: Anurag Basu's film shows solid Saturday growthAnurag Basu's 'Metro In Dino' saw a strong jump on day two, raking in Rs 6 crore and pushing its domestic total to Rs 9.5 crore. The boost came largely from evening shows in urban hubs like Pune, NCR, and Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suresh-raina-tamil-cinema-debut-production-no-1-chennai-spirit-2751357-2025-07-05",
      "headline": "Suresh Raina to debut with Tamil film Production No 1: Chennai's spirit with meFormer international cricketer Suresh Raina is all set to make his acting debut with 'Production No 1'. The announcement about Raina's Tamil film was made at a grand event in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-ajay-devgn-clash-with-yrf-son-of-sardaar-felt-helpless-2751336-2025-07-05",
      "headline": "Kajol on Ajay Devgn's clash with YRF over Son of Sardaar: I felt helplessActor Kajol recently recalled how Ajay Devgn's clash with Yash Raj Films over 'Son of Sardaar' (2012) release impacted her. She opened up on how she dealt with it as someone connected to both Ajay and Aditya Chopra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-wipes-instagram-feed-clean-before-40-birthday-dhurandhar-update-aditya-dhar-2751292-2025-07-05",
      "headline": "Ranveer Singh wipes his Instagram feed clean a day before birthday, builds intrigueIn a surprising move, actor Ranveer Singh has cleared his Instagram feed a day before his 40th birthday. This sudden move has left fans speculating the reason behind the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ghaati-release-anushka-shetty-postponed-action-thriller-vikram-prabhu-2751282-2025-07-05",
      "headline": "Anushka Shetty's Ghaati release gets postponed again, producers issue statementThe release date of actor Anushka Shetty's action-drama 'Ghaati' has been postponed yet again. The producers confirmed the same in an official statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-on-paparazzi-culture-nysa-yug-too-young-when-paps-began-chasing-her-2751285-2025-07-05",
      "headline": "Kajol on paparazzi culture: Nysa was too young when paps began chasing herKajol, in a recent interview, opened up about the constant glare of paparazzi and how she's guided her children, Nysa and Yug, to cope with it. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-score-shubman-gill-akash-deep-birmingham-2751704-2025-07-06",
      "headline": "Body blow for Bazball as Shubman Gill's India storm Birmingham bastionEngland (ENG) vs India (IND), 2nd Test: Shubman Gill's record-breaking run with the bat and an inspired bowling show, sans Jasprit Bumrah, helped India hammer England by 336 runs in Birmingham. India recovered from the heartbreak of Leeds to win for the first time at Edgbaston. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-was-an-attack-on-all-of-humanity-pms-message-on-terrorism-at-brics-2751722-2025-07-06",
      "headline": "It was an attack on all of humanity: PM condemns Pahalgam carnage at BricsPrime Minister Narendra Modi condemned the Pahalgam terror attack while addressing the issue of terrorism at 17th Brics Summit in Brazil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bilawal-bhutto-pak-ready-extradite-hafiz-saeed-masood-azhar-india-talha-saeed-terrorists-2751673-2025-07-06",
      "headline": "Bilawal Bhutto says ready to extradite Hafiz Saeed to India, draws his son's irePakistan was open to handing over terrorists Hafiz Saeed and Masood Azhar to India, former Foreign Minister Bilawal Bhutto Zardari said. However, Hafiz Saeed's son, Talha Saeed, hit back saying Bilawal's statement was wrong."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kangana-ranaut-bjp-mp-himachal-cloudburst-mandi-floods-disaster-relief-funds-2751718-2025-07-06",
      "headline": "I have no funds, no cabinet: Kangana Ranaut's bizarre recipe for disaster reliefIn shocking remarks, BJP MP Kangana Ranaut said she neither had disaster relief funds nor a Cabinet post, but stressed she was making efforts to get central assistance for rain-hit Himachal Pradesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/rice-desi-basmati-supremacy-world-biryani-day-support-kalanamak-joha-gobindobhog-hotel-industry-agriculture-2751240-2025-07-06",
      "headline": "Can Joha, Gobindobhog, Kalanamak beat the basmati-biryani nexus?The long-grain Basmati rice has received government support and surged ahead of other aromatic varieties like UP's Kalanamak, Assam's Joha and West Bengal's Gobindobhog. While Basmati acreage and exports have surged, with its long grain suiting the hotel and biryani industry, other aromatic rice varieties await government hand-holding to become bestsellers. Can they beat the Basmati-biryani nexus?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-7-live-score-updates-carlos-alcaraz-aryna-sabalenka-sonay-kartal-2751607-2025-07-06",
      "headline": "Wimbledon Day 7 Highlights: Alcaraz beats Rublev, Sabalenka through to quartersWimbledon Highlights, Day 7: Karen Khachanov advanced to the quarters after beating Kamil Majchrzak of Poland. Aryna Sabalenka reached the quarterfinals after beating Elise Mertens. Five-time Grand Slam champion Carlos Alcaraz beat Andrey Rublev in four sets to advance to the quarters. Taylor Fritz also advanced to the quarters after Jordan Thompson retired due to injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-stats-records-birmingham-test-shubman-gill-2751713-2025-07-06",
      "headline": "India win historic Birmingham Test to end 63-year-long wait: Stat PackENG vs IND, 2nd Test: Shubman Gill's India set a plethora of records after beating Ben Stokes' England by 336 runs in the second Test at Edgbaston in Birmingham. India became the first Asian team to win a Test at the venue since 1962. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/without-global-south-world-bodies-are-like-phone-with-sim-but-no-network-pm-calls-out-double-standards-2751698-2025-07-06",
      "headline": "Global South a victim of double standards: PM bats for inclusion at BricsPrime Minister Narendra Modi strongly advocated for comprehensive reforms to ensure inclusion and better representation of the Global South, while addressing the Brics summit in Brazil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-breaks-test-records-wearing-nike-vest-bcci-sponsorship-controversy-2751688-2025-07-06",
      "headline": "Explained: Is Shubman Gill in trouble for sporting Nike vest in Birmingham Test?England vs India: Shubman Gill made history with record-breaking double centuries during the Edgbaston Test. But, his choice to wear a Nike vest amid BCCI's Adidas deal has sparked widespread debate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-police-constable-vidisha-earned-salary-without-active-duty-probe-ordered-2751622-2025-07-06",
      "headline": "Madhya Pradesh cop earned Rs 28 lakh in 12 years without doing duty. Here's howA police constable from Madhya Pradesh's Vidisha district managed to earn Rs 28 lakh for 12 years without reporting for duty in a single day. When summoned, the constable claimed he was battling mental health issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-moga-doctor-shot-clinic-by-men-patients-injured-police-encounter-2751699-2025-07-06",
      "headline": "Men shot Punjabi actor's doctor-father in clinic, injured in police encounterA doctor was injured after unidentified men, posing as patients, opened fire on him at his clinic in Punjab's Moga. The doctor is the father of Punjabi actor Tania. The accused were later caught after being injured in a police encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/the-great-indian-salary-crisis-middle-class-unemployment-job-loss-268-04-07-2025",
      "headline": "The Great Indian Salary CrisisWhite-collar employees in India are caught in a salary spiral where costs keep climbing, pay moves slowly, and financial stability slips further away. On paper, the economy is booming, but the pay cheques of working middle-class Indians tell a very different story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/louis-vuitton-autorickshaw-handbag-drives-internet-into-frenzy-memes-jokes-hilarious-comments-2751524-2025-07-06",
      "headline": "Louis Vuitton's autorickshaw handbag drives Internet into frenzy. Best reactions hereLouis Vuitton's autorickshaw-shaped handbag, blending Indian street culture with luxury, has divided the internet; several call it quirky genius, others see it as cultural appropriation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/we-arent-anti-hindi-uddhav-sena-sanjay-raut-distances-from-mk-stalin-imposition-stance-2751579-2025-07-06",
      "headline": "We aren't anti-Hindi: Uddhav Sena distances from Stalin's language stanceClarifying that the Thackeray brothers' stance is only against Hindi imposition in primary schools, Uddhav Sena MP Sanjay Raut wished Stalin luck in his battle, while drawing the line. 'Their stand against the imposition of Hindi means they will not speak Hindi and neither let anyone speak Hindi. But that is not our stand in Maharashtra,' he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/stranded-british-f-35-fighter-jet-moved-from-thiruvananthapuram-airport-after-22-days-2751592-2025-07-06",
      "headline": "British F-35 jet moved from grounded position after being stuck for 22 daysA team of British technical experts arrived at Thiruvananthapuram airport today to assess the stranded F-35, following which the fighter jet was moved out after 22 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rjd-election-commission-bihar-electoral-rolls-revision-supreme-court-2751695-2025-07-06",
      "headline": "RJD challenges Bihar voter rolls' revision in Supreme CourtRJD MP Manoj Jha has filed a petition challenging the Election Commission's electoral rolls revision in poll-bound Bihar. Assembly polls are slated to be held in Bihar later this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-ruckus-as-muharram-procession-changes-route-in-ujjain-2-policemen-injured-2751728-2025-07-06",
      "headline": "Video: People break barricades during Ujjain Muharram procession, 2 cops injuredThe incident happened when people participating in the Muharram procession tried to go towards Abdal Pura instead of the fixed route Nikas Chauraha from Khajurwali Masjid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-502-04-07-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-teaser-ranveer-singh-wreaks-havoc-fierce-new-avatar-r-madhavan-akshaye-khanna-arjun-rampal-aditya-dhar-2751546-2025-07-06",
      "headline": "Dhurandhar first look: Ranveer Singh wreaks havoc in fierce new avatarRanveer Singh shared the gripping first look of his upcoming film 'Dhurandhar'. Also starring R Madhavan, Sanjay Dutt, Akshaye Khanna, and others in key roles, the movie will release in theatres on December 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shinde-sena-sanjay-gaikwad-thackeray-cousins-hindi-imposition-row-sambhaji-maharaj-2751654-2025-07-06",
      "headline": "Was Sambhaji Maharaj fool in learning 16 languages? Sena leader slams ThackeraysShinde Sena MLA Sanjay Gaikwad attacked the Thackeray cousins for their opposition to Hindi and the three-language policy in Maharashtra schools and said Chhatrapati Sambhaji Maharaj had learnt 16 languages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/salute-to-sacrifice-how-disability-pension-for-armed-forces-veterans-won-legal-sanctity-2750956-2025-07-05",
      "headline": "How disability pension for armed forces veterans won legal sanctityLast December, INDIA TODAY highlighted how the defence ministry had challenged disability pensions by contradicting the government's policy to reduce litigation"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/texas-flood-death-toll-many-children-among-those-dead-over-eight-hundred-rescued-2751705-2025-07-06",
      "headline": "59, including 21 children, dead in Texas flooding; 850 rescued so farThere were 18 adults and four children still pending identification. Authorities did not say if those 22 individuals were included in the death count of 59."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/supreme-court-seeks-removal-of-d-y-chandrachud-from-official-residence-writes-to-centre-2751543-2025-07-06",
      "headline": "Top court seeks removal of ex-Chief Justice from official home, writes to CentreSupreme Court administration writes to the Ministry of Housing and Urban Affairs, seels removal of former Chief Justice of India, Justice DY Chandrachud from official residence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-stark-irony-of-worlds-4th-largest-economy-with-81-crore-free-mealers-2749762-2025-07-06",
      "headline": "The stark irony of world's 4th largest economy with 81 crore free-mealersIndia's growing wealth gap often sparks despair, but the author, a retired ESIC Regional Director, argues the real solution lies in enforcing India's long-ignored labour laws."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-grenada-test-series-victory-2751746-2025-07-07",
      "headline": "Australia crush West Indies in Grenada to secure series victoryWI vs AUS: Australia took an unassailable 2-0 lead in the three-match series after winning the second Test by 133 runs in Grenada. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-aryna-sabalenka-taylor-fritz-wimbledon-day-7-2751744-2025-07-07",
      "headline": "Carlos Alcaraz survives Rublev scare, Sabalenka, Fritz into quartersWimbledon: Carlos Alcaraz and Aryna Sabalenka booked their berths in the quarterfinals of the grass court major after beating Andrey Rublev and Elise Mertens in straight sets on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sunil-gavaskar-interview-eng-vs-ind-edgbaston-shubman-gill-record-2751739-2025-07-07",
      "headline": "Sunil Gavaskar backs Shubman Gill to score 1000 runs in England Test seriesSpeaking to IndiaToday.in, Sunil Gavaskar said he would be more than happy if Shubman Gill breaks his record for most runs by an Indian in a Test series. The batting great backed Gill to go past Donald Bradman's all-time tally of 974 runs and go for 100 in the Anderson-Tendulkar Trophy. Gill scored 430 runs in the second Test, which India won by 336 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-edgbaston-stats-shubman-gill-joke-press-conference-journalist-2751738-2025-07-07",
      "headline": "Shubman Gill trolls stats talk after Edgbaston win: Where's my favourite journalist?England vs India, 2nd Test: Shubman Gill took a friendly swipe at talk of history and statistics after India ended their long wait for a win in Birmingham. India defeated England by 336 runs on Sunday to seal a memorable victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/magnus-carlsen-wins-superunited-rapid-blitz-croatia-title-2751724-2025-07-06",
      "headline": "Magnus Carlsen trolls haters after Grand Chess Tour Zagreb win, deletes post laterWorld No. 1 Magnus Carlsen won the SuperUnited Rapid and Blitz Croatia on Sunday, July 06, overcoming a poor Rapid section with a stellar show in the fastest format. He took a dig at his critics with a meme before deleting the post. D Gukesh finished third after slipping in Blitz rounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-akash-deep-sister-cancer-emotional-tribute-2751720-2025-07-06",
      "headline": "My sister has cancer: Emotional Akash Deep dedicates Edgbaston win to brave siblingEngland vs India, 2nd Test: Akash Deep played a match-winning role in India's 336-run victory over England in Birmingham. He dedicated his 10-wicket haul to his sister, who has been battling cancer for two months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-akash-deep-10-wickets-stats-2751717-2025-07-06",
      "headline": "Akash Deep goes past Jasprit Bumrah with 10-wicket match haul in BirminghamAkash Deep starred with a 10-wicket haul as India secured a historic Test victory over England at Edgbaston. His performance, combined with Shubman Gill's twin centuries, marked a landmark moment for Indian cricket abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-jasprit-bumrah-england-vs-india-2nd-test-2751719-2025-07-06",
      "headline": "Definitely: Shubman Gill confirms Jasprit Bumrah's return at Lord'sENG vs IND: After missing the second Test at Edgbaston in Birmingham, Jasprit Bumrah will return to play when the Lord's Test starts on July 12.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-stats-records-birmingham-test-shubman-gill-2751713-2025-07-06",
      "headline": "India win historic Birmingham Test to end 63-year-long wait: Stat PackENG vs IND, 2nd Test: Shubman Gill's India set a plethora of records after beating Ben Stokes' England by 336 runs in the second Test at Edgbaston in Birmingham. India became the first Asian team to win a Test at the venue since 1962. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-virat-kohli-hails-shubman-gill-for-indias-for-historic-edgbaston-win-2751712-2025-07-06",
      "headline": "Virat Kohli hails Shubman Gill's 'fearless' India for historic Edgbaston triumphVirat Kohli was full of praise for India's new Test captain, Shubman Gill, following the team's historic victory in the second match against England at Edgbaston, Birmingham. India beat England by 336 runs to level the series 1-1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-score-shubman-gill-akash-deep-birmingham-2751704-2025-07-06",
      "headline": "Body blow for Bazball as Shubman Gill's India storm Birmingham bastionEngland (ENG) vs India (IND), 2nd Test: Shubman Gill's record-breaking run with the bat and an inspired bowling show, sans Jasprit Bumrah, helped India hammer England by 336 runs in Birmingham. India recovered from the heartbreak of Leeds to win for the first time at Edgbaston. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-akash-deep-10-wickets-stats-2751717-2025-07-06",
      "headline": "Akash Deep goes past Jasprit Bumrah with 10-wicket match haul in BirminghamAkash Deep starred with a 10-wicket haul as India secured a historic Test victory over England at Edgbaston. His performance, combined with Shubman Gill's twin centuries, marked a landmark moment for Indian cricket abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-jasprit-bumrah-england-vs-india-2nd-test-2751719-2025-07-06",
      "headline": "Definitely: Shubman Gill confirms Jasprit Bumrah's return at Lord'sENG vs IND: After missing the second Test at Edgbaston in Birmingham, Jasprit Bumrah will return to play when the Lord's Test starts on July 12.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-stats-records-birmingham-test-shubman-gill-2751713-2025-07-06",
      "headline": "India win historic Birmingham Test to end 63-year-long wait: Stat PackENG vs IND, 2nd Test: Shubman Gill's India set a plethora of records after beating Ben Stokes' England by 336 runs in the second Test at Edgbaston in Birmingham. India became the first Asian team to win a Test at the venue since 1962. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-virat-kohli-hails-shubman-gill-for-indias-for-historic-edgbaston-win-2751712-2025-07-06",
      "headline": "Virat Kohli hails Shubman Gill's 'fearless' India for historic Edgbaston triumphVirat Kohli was full of praise for India's new Test captain, Shubman Gill, following the team's historic victory in the second match against England at Edgbaston, Birmingham. India beat England by 336 runs to level the series 1-1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-score-shubman-gill-akash-deep-birmingham-2751704-2025-07-06",
      "headline": "Body blow for Bazball as Shubman Gill's India storm Birmingham bastionEngland (ENG) vs India (IND), 2nd Test: Shubman Gill's record-breaking run with the bat and an inspired bowling show, sans Jasprit Bumrah, helped India hammer England by 336 runs in Birmingham. India recovered from the heartbreak of Leeds to win for the first time at Edgbaston. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-cash-prize-india-womens-football-team-afc-asia-cup-qualification-2751703-2025-07-06",
      "headline": "India Women's team rewarded Rs 42.75 lakh for AFC Asia Cup qualificationThe AIFF have announced that they will reward the India women's football team with a prize of Rs 42.75 lakhs for their dominant performance leading to their qualification in the AFC Women's Asia Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-south-africa-2nd-test-wiaan-mulder-test-captaincy-record-2751702-2025-07-06",
      "headline": "Wiaan Mulder hits historic double century on Test captaincy debutZIM vs SA, 2nd Test: Wiaan Mulder scored an unbeaten 264 and set the record for being the first South African to score a double hundred on Test captaincy debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-breaks-test-records-wearing-nike-vest-bcci-sponsorship-controversy-2751688-2025-07-06",
      "headline": "Explained: Is Shubman Gill in trouble for sporting Nike vest in Birmingham Test?England vs India: Shubman Gill made history with record-breaking double centuries during the Edgbaston Test. But, his choice to wear a Nike vest amid BCCI's Adidas deal has sparked widespread debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-unlikely-icc-world-club-championship-report-2751681-2025-07-06",
      "headline": "No IPL teams, Pakistan unlikely to play in World Club Championship: ReportReports have suggested that the proposed World Club Championship will not feature teams from Pakistan. In addition, no teams from the Indian Premier League are also expected to feature in the inaugural edition set to be held in 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-day-5-washington-sundar-ravindra-jadeja-assist-ben-stokes-wicket-2751678-2025-07-06",
      "headline": "Wicket Washington, assist Jadeja: How India outfoxed Ben Stokes on Day 5England vs India, 2nd Test: India had England reeling at 153 for 6 at Lunch on Day 5, chasing 608. Washington Sundar and Ravindra Jadeja combined brilliantly to dismiss Ben Stokes at the stroke of the break on Sunday in Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ravi-shastri-questions-shubman-gills-tactics-on-day-5-2751671-2025-07-06",
      "headline": "Shastri questions Shubman Gill's tactics on Day 5, Akash Deep proves him wrongFormer India cricketer Ravi Shastri was seen questioning Shubman Gill's tactics on Day 5 of the second Test against England at Edgbaston, Birmingham. However, he was proven wrong by Akash Deep's menacing new ball spell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-akash-deep-opening-spell-wickets-day-5-birmingham-test-2751668-2025-07-06",
      "headline": "ENG vs IND: 'Fan favourite' Akash Deep's fiery spell leaves England rattledENG vs IND: Akash Deep gave England an early jolt by removing both Ollie Pope and Harry Brook in his opening spell on the final day's play of the Birmingham Test. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-day-5-washington-sundar-ravindra-jadeja-assist-ben-stokes-wicket-2751678-2025-07-06",
      "headline": "Wicket Washington, assist Jadeja: How India outfoxed Ben Stokes on Day 5England vs India, 2nd Test: India had England reeling at 153 for 6 at Lunch on Day 5, chasing 608. Washington Sundar and Ravindra Jadeja combined brilliantly to dismiss Ben Stokes at the stroke of the break on Sunday in Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ravi-shastri-questions-shubman-gills-tactics-on-day-5-2751671-2025-07-06",
      "headline": "Shastri questions Shubman Gill's tactics on Day 5, Akash Deep proves him wrongFormer India cricketer Ravi Shastri was seen questioning Shubman Gill's tactics on Day 5 of the second Test against England at Edgbaston, Birmingham. However, he was proven wrong by Akash Deep's menacing new ball spell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-akash-deep-opening-spell-wickets-day-5-birmingham-test-2751668-2025-07-06",
      "headline": "ENG vs IND: 'Fan favourite' Akash Deep's fiery spell leaves England rattledENG vs IND: Akash Deep gave England an early jolt by removing both Ollie Pope and Harry Brook in his opening spell on the final day's play of the Birmingham Test. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-jonathan-trott-virat-kohli-2751660-2025-07-06",
      "headline": "Shubman Gill almost a carbon copy of Virat Kohli: Jonathan TrottENG vs IND: Shubman Gill has earned praise from Jonathan Trott after he scored 430 runs in India's second Test against the Ben Stokes-led England at Edgbaston in Birmingham.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-did-akash-deep-dismiss-joe-root-on-a-no-ball-2751650-2025-07-06",
      "headline": "Did Akash Deep dismiss Joe Root on a no-ball? Commentator highlights umpiring blunderIndia seamer Akash Deep's dismissal of star England batter Joe Root on Day 4 of the second Test at Edgbaston, Birmingham has sparked controversy with a commentator claiming that it was a no ball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-martin-zubimendi-transfer-confirmed-real-sociedad-2751624-2025-07-06",
      "headline": "Arsenal sign Spanish midfielder Martin Zubimendi from Real SociedadArsenal have confirmed the incoming transfer of Martin Zubimendi from Real Sociedad. The Spanish midfielder will be a welcome addition and has signed a long-term deal with the London-based club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-7-live-score-updates-carlos-alcaraz-aryna-sabalenka-sonay-kartal-2751607-2025-07-06",
      "headline": "Wimbledon Day 7 Highlights: Alcaraz beats Rublev, Sabalenka through to quartersWimbledon Highlights, Day 7: Karen Khachanov advanced to the quarters after beating Kamil Majchrzak of Poland. Aryna Sabalenka reached the quarterfinals after beating Elise Mertens. Five-time Grand Slam champion Carlos Alcaraz beat Andrey Rublev in four sets to advance to the quarters. Taylor Fritz also advanced to the quarters after Jordan Thompson retired due to injury. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronald-sister-cryptic-response-diogo-jota-funeral-2751587-2025-07-06",
      "headline": "Why did Ronaldo not show up at Diogo Jota's funeral? Sister clarifiesCristiano Ronaldo's sister issued a cryptic response on social media defending her brother for not turning up to fellow national teammate Diogo Jota's funeral. The two had recently shared the pitch during Portugal's UEFA Nations League final win over Spain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-7-schedule-order-of-play-matches-carlos-alcaras-aryna-sabalenka-2751583-2025-07-06",
      "headline": "Wimbledon Day 7 schedule: Alcaraz vs Rublev, Sabalenka take center-stageWimbledon Day 7 sets up a blockbuster Sunday with Carlos Alcaraz, Aryna Sabalenka, and Sonay Kartal in action. From homegrown heroes to top seeds chasing glory, it's a schedule loaded with high-stakes tennis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-5-weather-updates-edgbaston-2751576-2025-07-06",
      "headline": "Day 5 Highlights: Akash Deep's 10-wicket haul helps India conquer BirminghamEngland (ENG) vs India (IND), 2nd Test Day 5 Highlights: India have completed a historic maiden win at Edgbaston, Birmingham as they beat England by 336 runs. Akash Deep was the star of the victory on Day 5 as he registered his maiden ten-wicket haul. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-england-batting-coach-marcus-trescothick-fed-up-shubman-gill-batting-birmingham-2751567-2025-07-06",
      "headline": "ENG vs IND: England batting coach fed up with Gill's batting dominanceMarcus Trescothick clearly had more than enough after Shubman Gill put up one of his best performances in whites. He scored a 269 in the first innings and followed it up with 161 to put India in a position of control. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-not-new-to-tough-challenges-608-chase-marcus-trescothick-2751552-2025-07-06",
      "headline": "England not new to tough challenges: Batting coach on 608 chase vs IndiaMarcus Trescothick said England aren't too worried about the 608-run chase, backing the team's belief under Ben Stokes and Brendon McCullum to adapt and fight despite being in a tough position against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/video-lionel-messi-solo-goal-inter-miami-mls-2751544-2025-07-06",
      "headline": "Ankara Messi 2.0: 38-year-old floors 5 defenders to score stunning solo-goalLionel Messi showcased his timeless skill with a stunning solo goal and brace to lead Inter Miami to a 4-1 victory against CF Montreal. The goal reminded fans of his Ankara Messi moment from 2007."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}