{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-your-45-day-credit-card-grace-period-might-be-a-debt-trap-explains-ca-2771271-2025-08-14",
      "headline": "Why your 45-day credit card grace period might be a debt trap, explains CAMany believe a credit card's 45-day grace period means free borrowing time. But as an expert explains, even a small unpaid balance can turn it into a costly debt trap."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-it-stocks-gain-offset-broad-decline-infosys-rise-2-percent-2771269-2025-08-14",
      "headline": "Sensex, Nifty end marginally higher as investors await Trump-Putin meet outcomeThe S&P BSE Sensex gained 57.75 points to end at 80,597.66, while the NSE Nifty50 added just 11.95 points to close at 24,631.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-upgraded-to-bbb-on-economic-resilience-and-sustained-fiscal-consolidation-outlook-stable-sp-global-2771259-2025-08-14",
      "headline": "S&P upgrades India's sovereign rating to 'BBB' on growth, fiscal disciplineThe move comes more than a year after S&P revised India's outlook to positive from stable in May 2024, on the back of robust growth and improved expenditure quality. The rating agency also revised India's transfer and convertibility assessment to 'A-' from 'BBB+'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fedex-ups-dhl-courier-service-top-executives-india-antitrust-probe-cci-report-2771243-2025-08-14",
      "headline": "Fresh scrutiny on FedEx, UPS, DHL top brass in antitrust case: ReportExecutives set to be questioned include Subhasish Chakraborty, Managing Director of DTDC Express; R.S. Subramanian, Managing Director of DHL Express India, and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/7-major-income-tax-changes-in-2025-that-will-impact-your-money-2771231-2025-08-14",
      "headline": "7 major income tax changes in 2025 that will impact your money2025 has brought a wave of changes to India's income tax rules, from bigger exemptions to extended filing deadlines. Here's a simple breakdown of the seven key updates that could directly affect your finances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cognizant-salary-hike-eligible-employees-november-1-2771152-2025-08-14",
      "headline": "Cognizant to roll out wage hikes for 80% of eligible employees. Details hereIT giant Cognizant is set to give salary hikes to 80% of eligible employees from November 1, with top performers in India receiving high single-digit increases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jsw-cement-share-price-market-debut-stock-fall-2-percent-buy-sell-book-profit-review-2771158-2025-08-14",
      "headline": "JSW Cement shares fall after listing at 4% premium: Should you hold or sell?JSW Cement's share price listed at 4% above its issue price of Rs 147. On the BSE, the stock opened at Rs 153, up 4.1%, while on the NSE it debuted at Rs 153.50, a gain of 4.4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/man-invested-rs-18000month-for-4-years-earned-less-than-fds-ca-explains-why-2771104-2025-08-14",
      "headline": "Man invested Rs 18,000/month for 4 years, earned less than FDs. CA explains whyThe investor believed he was on the right track. His funds showed a compound annual growth rate (CAGR) of 11%. But when he calculated his portfolio XIRR—the actual return on his money—it was just 6%. That's less than the 7% a fixed deposit would have paid over the same period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-economy-credit-rating-improve-moodys-fitch-reason-inflation-forex-reserve-2771031-2025-08-14",
      "headline": "Pakistan's credit rating gets a lift from Moody's. Here's whyS&P Global Ratings raised Pakistan's rating to B- from CCC+ on July 24, while Fitch Ratings did the same in April. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-cheque-clear-rule-faster-october-4-few-hours-personal-finance-trending-news-money-tips-2771065-2025-08-14",
      "headline": "RBI's new rule: Cheques to clear in just hours starting this dateUnder the new rule, cheques will be scanned, presented, and cleared continuously during business hours, reducing the clearing cycle from the current T+1 days to just a few hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icici-bank-cuts-minimum-balance-after-backlash-check-new-rules-and-penalties-2771058-2025-08-14",
      "headline": "ICICI Bank cuts minimum balance after backlash. Check new rules and penaltiesThe bank's decision comes after strong public criticism, particularly over the earlier increase in urban and metro monthly average balance levels. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/jsw-cement-share-price-market-debut-rs-153-nse-bse-opening-price-4-percent-listing-gain-2771045-2025-08-14",
      "headline": "JSW Cement shares list at 4% premium on stock market debut On the BSE, the shares opened at Rs 153, up 4.1%, while on the NSE they began trading at Rs 153.50, a gain of 4.4%."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-khushi-kapoor-emotional-tribute-mother-sridevi-birth-anniversary-photos-2771093-2025-08-14",
      "headline": "Janhvi and Khushi Kapoor pay emotional tribute to their mother Sridevi. See photosA day after the late actor Sridevi's birth anniversary, actor Janhvi Kapoor shared throwback photos in remembrance of her mother. Khushi also paid an emotional tribute on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/india-exclusive-kim-tae-hee-on-hollywood-debut-butterfly-taking-a-break-hi-bye-mama-stairway-to-heaven-love-from-india-2771255-2025-08-14",
      "headline": "India Exclusive: Kim Tae-hee on Hollywood debut Butterfly, taking a break and love from IndiaIn this exclusive chat with India Today's Bhavna Agarwal, Kim Tae-hee opens up about feeling liberated to take on more challenging roles, why she's now more comfortable with natural acting over heavy makeup, and the overwhelming love she receives from India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/independence-day-song-ae-mere-watan-ke-logon-made-nehru-cry-still-plays-nationwide-2771174-2025-08-14",
      "headline": "Ae Mere Watan ke…: India's favourite I-Day song, the one that made Nehru weepIn every lane, every loudspeaker, 'Ae Mere Watan Ke Logon' still lives on. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-shehnaz-gill-brother-shehbaz-badesha-mridul-tiwari-salman-khan-fans-ka-faisla-2771197-2025-08-14",
      "headline": "BB 19: Shehnaz Gill's brother Shehbaz Badesha or Mridul Tiwari, who will fans pick?'Bigg Boss 19' is set to premiere on August 14. Ahead of the grand launch, the makers announced a major twist in this year's season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-nadaaniyan-criticism-khushi-kapoor-ibrahim-ali-khan-2771230-2025-08-14",
      "headline": "Karan Johar asks Nadaaniyan critics to move on: Let it goFilmmaker Karan Johar addressed the social media backlash against 'Nadaaniyan'. The film received poor reviews and sparked widespread trolling. Johar reflected on the lessons learnt and asked people to move on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-movie-review-hrithik-roshan-jr-ntr-take-a-world-tour-story-stays-home-2771233-2025-08-14",
      "headline": "War 2 review: Hrithik Roshan, Jr NTR take a world tour, story stays homeRelease Date:Thu Aug 14, 2025War 2 movie review: The Hrithik Roshan and Jr NTR-starrer is more like a travel brochure tirelessly shot for three hours. The only real mission is to save the story, but how can you save something that doesn't exist? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zoe-kravitz-shares-hilarious-snake-mishap-destroyed-taylor-swift-bathroom-2771192-2025-08-14",
      "headline": "Zoe Kravitz shares hilarious snake mishap that destroyed Taylor Swift's bathroomActor Zoe Kravitz shares how a pet snake, a wildfire evacuation, and Taylor Swift's Beverly Hills mansion led to an unforgettable, and destructive celebrity sleepover."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-janhvi-kapoor-seek-blessings-tirupati-param-sundari-2771153-2025-08-14",
      "headline": "Sidharth and Janhvi seek blessings at Tirupati ahead of Param Sundari releaseActors Sidharth Malhotra and Janhvi Kapoor visited the Tirumala temple in Tirupati on Wednesday. Their visit came ahead of the release of their film 'Param Sundari' on August 29. Malhotra opened up about his experience in an Instagram video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-sadaa-sayed-breaks-down-over-supreme-court-stray-dog-removal-verdict-2771147-2025-08-14",
      "headline": "Actor Sadaa Sayed moved to tears over top court's stray dog order: I feel ashamedActor Sadaa Sayed broke down in tears over the Supreme Court's order to remove all stray dogs from Delhi. Her emotional response highlights the controversy and public concern surrounding the ruling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-delhis-kashish-singhal-fails-to-answer-rs-1-crore-question-on-ancient-rome-2771155-2025-08-14",
      "headline": "KBC 17: Delhi's Kashish Singhal fails to answer Rs 1 crore question on ancient RomeIn the latest episode of 'Kaun Banega Crorepati' 17, contestant Kashish Singhal succeeded in winning Rs 50 lakh, which will assist her in repaying the loan of Rs 15 lakh that her father took during the family's time of crisis."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/andhera-review-priya-bapat-namid-malhotra-shine-in-this-dim-series-2771122-2025-08-14",
      "headline": "Andhera review: Priya Bapat, Karanvir Malhotra shine in this dim seriesRelease Date:Thu Aug 14, 2025Prime Video's latest series, 'Andhera, starring Priya Bapat, Karanvir Malhotra, and Prajakta Koli, premiered on August 14. The serious blends supernatural horror with sci-fi ambition but falters due to an underdeveloped core idea and uneven storytelling. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sharmila-tagore-supreme-court-ruling-stray-dogs-shuts-door-voiceless-2771107-2025-08-14",
      "headline": "Sharmila Tagore says Supreme Court stray dog ruling shuts door on the voicelessVeteran Bollywood actor Sharmila Tagore is the latest public figure to speak out against the Supreme Court's ruling to relocate stray dogs from the Delhi-NCR region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/video-pankaj-tripathi-arrives-for-muhurat-puja-of-mirzapur-the-film-2771103-2025-08-14",
      "headline": "Video: Pankaj Tripathi arrives for Mirzapur The Film's muhurat pujaThe muhurat puja of 'Mirzapur The Film' was held on Wednesday at the Excel office in Mumbai. It was attended by Pankaj Tripathi, Ravi Kishan, Rasika Dugal, Ali Fazal, Shweta Tripathi, Shirya Pilgaonkar, Harshita Gaur, Jitendra Kumar and Divyenndu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/coolie-review-rajinikanth-lokesh-kanagaraj-too-many-ideas-too-little-impact-2771082-2025-08-14",
      "headline": "Coolie review: Rajinikanth's film has too many ideas, but too little impactRelease Date:Thu Aug 14, 2025Coolie movie review: Director Lokesh Kanagaraj's 'Coolie', starring Rajinikanth, Shruti Haasan and Sathyaraj, is a template revenge thriller that takes more detours than it should. Keeping Rajinikanth's charm aside, the film hardly offers anything new or substantial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-aamir-khan-cameo-fanboy-moment-rajinikanth-hits-the-spot-lokesh-kanagaraj-2771073-2025-08-14",
      "headline": "Coolie: Aamir Khan's fanboy moment with Rajinikanth hits the spotAamir Khan's cameo in Rajinikanth's 'Coolie' has caught the attention of all. The actor impressed fans with his swag in the climax of the movie. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-x-review-hrithik-and-jr-ntr-action-thrills-story-sparks-debate-2771042-2025-08-14",
      "headline": "War 2 X review: Hrithik and Jr NTR's action thrills, but story sparks debateWar 2, starring Hrithik Roshan and Jr NTR, sparked mixed reactions. Praised for its action and visuals, but criticised for plot and VFX. Fans are divided."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/shilpa-shirodkar-car-hit-cityflo-bus-mumbai-company-denies-responsibility-2771028-2025-08-14",
      "headline": "Shilpa Shirodkar's car hit by bus, slams transport firm for shirking responsibilityActor Shilpa Shirodkar's car was struck by a Cityflo bus in Mumbai on Wednesday. The bus company denied liability despite police assistance in filing a complaint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-unveils-life-of-a-showgirl-album-cover-features-sabrina-carpenter-travis-kelce-2770990-2025-08-14",
      "headline": "Taylor Swift unveils Life of a Showgirl album, cover, and featuresPop sensation Taylor Swift shares details for her 12th studio album 'The Life of a Showgirl'. The former Eras tourmates will team up on the LP's title track."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-x-review-rajinikanth-energy-nagarjuna-charm-win-over-fans-lokesh-kanagaraj-2771005-2025-08-14",
      "headline": "Coolie X review: Rajinikanth's energy and Nagarjuna's charm win fans overRajinikanth's 'Coolie' released in theatres today, and fans are in the mood to celebrate. Directed by Lokesh Kanagaraj, the theatres have turned into a carnival with fans rejoicing and dancing. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/massive-cloudburst-in-jks-chositi-union-minster-says-substantial-casualties-feared-2771209-2025-08-14",
      "headline": "17 dead after massive cloudburst in Jammu and Kashmir's Kishtwar UpdatesA massive cloudburst struck Chositi in Jammu and Kashmir near the Machail Mata Shrine on Thursday, killing at least 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/any-misadventure-will-have-painful-consequences-india-slams-hateful-comments-by-pakistani-leadership-2771282-2025-08-14",
      "headline": "Pak's anti-India rhetoric to hide own failures: India slams Asim Munir's remarksIndia lashed out at Pakistan Army chief Asim Munir's \"reckless\" nuclear threats, saying such war-mongering comments were part of Islamabad's playbook to distract from its domestic failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/burial-orders-from-temples-information-centre-locals-saw-burials-least-bothered-dharmasthala-whistleblower-2771186-2025-08-14",
      "headline": "Exclusive: Dharmasthala whistleblower claims burial orders came from templeIn an exclusive India Today interview, the Dharmasthala whistle-blower alleged decades-long undocumented burials in forest areas. He claimed temple authorities ordered the burials, many showing assault marks, while locals remained silent. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/us-warns-india-of-sanctions-more-tariffs-if-trump-putin-alaska-talks-fail-2771240-2025-08-14",
      "headline": "US warns India of sanctions, more tariffs if Trump-Putin Alaska talks failThe US Treasury Secretary warned that additional secondary tariffs on India could be imposed depending on the outcome of President Trump's meeting with Vladimir Putin in Alaska."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/coolie-review-rajinikanth-lokesh-kanagaraj-too-many-ideas-too-little-impact-2771082-2025-08-14",
      "headline": "Coolie review: Rajinikanth's film has too many ideas, but too little impactRelease Date:Thu Aug 14, 2025Coolie movie review: Director Lokesh Kanagaraj's 'Coolie', starring Rajinikanth, Shruti Haasan and Sathyaraj, is a template revenge thriller that takes more detours than it should. Keeping Rajinikanth's charm aside, the film hardly offers anything new or substantial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/poll-panel-agrees-to-list-65-lakh-deleted-names-in-searchable-format-during-bihar-voter-revision-hearing-2771261-2025-08-14",
      "headline": "Bihar voter revision: Poll panel to list 65 lakh deleted names in searchable formatThis development came after the Supreme Court directed the poll body to publish the district-wise list of all omitted voters and state the reasons for their deletion, whether due to death, migration, or double registration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/akhilesh-yadav-expels-mla-pooja-pal-from-samajwadi-party-hours-after-her-praise-for-yogi-adityanath-2771235-2025-08-14",
      "headline": "Akhilesh Yadav expels Samajwadi MLA hours after her praise for Yogi AdityanathSamajwadi Party Member of the Legislative Assembly Pooja Pal praised Uttar Pradesh Chief Minister Yogi Adityanath for delivering justice and acting against criminals. Hours later, the Samajwadi Party expelled her for anti-party activities, citing serious indiscipline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jinnah-escape-gandhi-struggle-nehru-tryst-the-last-24-hours-of-british-raj-2771200-2025-08-14",
      "headline": "Jinnah's escape, Gandhi's struggle, Nehru's tryst: The last 24 hours of British RajOn August 14, 1947, tension, hope, and tragedy swirled, as the countdown to the end of the British Raj began. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/when-pro-animal-pet-dog-lover-mahatma-gandhiji-approved-killing-60-strays-supreme-court-delhi-ncr-2771185-2025-08-14",
      "headline": "When pet dog lover Gandhiji approved the killing of 60 straysMahatma Gandhi, who was committed to ahimsa, approved the killing of 60 stray dogs when human lives were at risk. He saw it as a \"duty in distress\", not indiscriminate violence. His stance reflected the delicate balance between compassion and societal responsibility of that time. In 2015, his views were quoted in the Supreme Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dharmasthala-karnataka-mass-burial-case-whistleblower-revelations-buried-bodies-myself-2771214-2025-08-14",
      "headline": "Buried 80 bodies myself: Dharmasthala whistleblower's explosive 'revelations'The whistleblower in the Dharmasthala mass burial case revealed how the bodies, allegedly of sexual assault victims, were buried in forest areas without documentation or official oversight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-upgraded-to-bbb-on-economic-resilience-and-sustained-fiscal-consolidation-outlook-stable-sp-global-2771259-2025-08-14",
      "headline": "S&P upgrades India's sovereign rating to 'BBB' on growth, fiscal disciplineThe move comes more than a year after S&P revised India's outlook to positive from stable in May 2024, on the back of robust growth and improved expenditure quality. The rating agency also revised India's transfer and convertibility assessment to 'A-' from 'BBB+'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jangli-maharaj-road-pune-history-hot-mix-technology-pothole-free-indian-streets-pothole-plague-pmc-civil-engineering-2770138-2025-08-14",
      "headline": "How Pune's indestructible JM Road shames contractors, babus, netas alikeCan a road in India remain pothole-free for 50 years? A 2.5-km stretch in Pune, known as Jangli Maharaj Road, shines as an example of civic engineering amid the pan-India pothole plague. Built in 1976, the road came with a 10-year warranty and hasn't needed major repairs in all these years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-movie-review-hrithik-roshan-jr-ntr-take-a-world-tour-story-stays-home-2771233-2025-08-14",
      "headline": "War 2 review: Hrithik Roshan, Jr NTR take a world tour, story stays homeRelease Date:Thu Aug 14, 2025War 2 movie review: The Hrithik Roshan and Jr NTR-starrer is more like a travel brochure tirelessly shot for three hours. The only real mission is to save the story, but how can you save something that doesn't exist? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-to-create-army-rocket-force-after-operation-sindoor-setback-pm-shehbaz-sharif-announcement-2771199-2025-08-14",
      "headline": "Pakistan to create Army Rocket Force after Op Sindoor setbackWeeks after biting the dust against India during Operation Sindoor, Pakistan has announced the formation of an Army Rocket Force, which is reportedly modelled after the Chinese People's Liberation Army Rocket Force. The new force will oversee missile combat in conventional conflicts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-military-officers-gallantry-awards-independence-day-2771253-2025-08-14",
      "headline": "Op Sindoor heroes to receive gallantry awards on Independence Day: SourcesOfficers from all three services who played key roles during Operation Sindoor, in which India targeted terror and military sites in Pakistan, will be honoured with gallantry medals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/skull-found-on-australian-coast-turns-out-to-be-26-million-year-old-ancient-whale-2771268-2025-08-14",
      "headline": "26-million-year-old half skull confirmed to be of ancient whale speciesUnlike the gentle giants that cruise today's oceans, Janjucetus dullardi was a compact, sharp-toothed predator, more reminiscent of a dolphin than a whale. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/independence-day-song-ae-mere-watan-ke-logon-made-nehru-cry-still-plays-nationwide-2771174-2025-08-14",
      "headline": "Ae Mere Watan ke…: India's favourite I-Day song, the one that made Nehru weepIn every lane, every loudspeaker, 'Ae Mere Watan Ke Logon' still lives on. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dewald-brevis-r-ashwin-csk-under-the-table-deal-ipl-corruption-2771160-2025-08-14",
      "headline": "Ashwin exposes CSK, claims team paid Dewald Brevis under the table in IPL 2025Legendary spinner Ravichandran Ashwin has exposed the Indian Premier League's under the table deals. Ashwin has claimed that CSK paid a much higher price than the stipulated Rs 2.2 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/man-dead-2-injured-as-tree-collapses-on-bike-in-south-delhis-kalkaji-amid-heavy-rain-2771154-2025-08-14",
      "headline": "Man dead, 2 injured as tree crashes on bike in Delhi's Kalkaji amid heavy rainA large tree fell on a bike in Delhi's Kalkaji amid heavy rain, killing one and injuring two, also damaging a nearby vehicle. Severe waterlogging hit key Delhi roads ahead of Independence Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-fencing-underarmour-jyotika-rishika-olympics-2770996-2025-08-14",
      "headline": "Fencing sisters Jyotika and Rishika turn grit and guts into global recognitionFencers Jyotika Dutta and Rishika Khajuria have turned hard work and persistence into results. Their Under Armour deal is a milestone, showing that Indian fencing has talent, promise, and a brighter future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/salt-and-sugar-for-babies-grandmas-all-for-both-science-isnt-2770592-2025-08-14",
      "headline": "Salt and sugar for babies? Grandma's all for both, science isn'tEven though doctors strongly advise no sugar and no salt for infants, many elderly caregivers find it hard to accept. But real care isn't about sticking to old habits, it's about understanding what's truly best for the baby."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/i-am-a-doctor-liver-health-exercise-diet-alcohol-awareness-hepatitis-testing-vaccination-2770692-2025-08-14",
      "headline": "I am a doctor and this is the single worst thing you can do to your liverOur liver doesn't get the respect it deserves. As unhealthy lifestyles rise, here's the single most harmful habit that can damage the second-largest organ in the body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-economy-credit-rating-improve-moodys-fitch-reason-inflation-forex-reserve-2771031-2025-08-14",
      "headline": "Pakistan's credit rating gets a lift from Moody's. Here's whyS&P Global Ratings raised Pakistan's rating to B- from CCC+ on July 24, while Fitch Ratings did the same in April. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/masked-robbers-loot-retired-justice-ramesh-gargs-indore-home-rakshabandhan-2771002-2025-08-14",
      "headline": "Chilling video of robbery at ex-judge's home, one loots, other ready to attackA gang of masked and armed burglars broke into retired Justice Ramesh Garg's Indore home, looting cash and valuables worth several lakh rupees with professional precision while the family was sleeping."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-khushi-kapoor-emotional-tribute-mother-sridevi-birth-anniversary-photos-2771093-2025-08-14",
      "headline": "Janhvi and Khushi Kapoor pay emotional tribute to their mother Sridevi. See photosA day after the late actor Sridevi's birth anniversary, actor Janhvi Kapoor shared throwback photos in remembrance of her mother. Khushi also paid an emotional tribute on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/india-exclusive-kim-tae-hee-on-hollywood-debut-butterfly-taking-a-break-hi-bye-mama-stairway-to-heaven-love-from-india-2771255-2025-08-14",
      "headline": "India Exclusive: Kim Tae-hee on Hollywood debut Butterfly, taking a break and love from IndiaIn this exclusive chat with India Today's Bhavna Agarwal, Kim Tae-hee opens up about feeling liberated to take on more challenging roles, why she's now more comfortable with natural acting over heavy makeup, and the overwhelming love she receives from India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-nadaaniyan-criticism-khushi-kapoor-ibrahim-ali-khan-2771230-2025-08-14",
      "headline": "Karan Johar asks Nadaaniyan critics to move on: Let it goFilmmaker Karan Johar addressed the social media backlash against 'Nadaaniyan'. The film received poor reviews and sparked widespread trolling. Johar reflected on the lessons learnt and asked people to move on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/photo/hrithik-roshan-saba-azad-tiger-shroff-anil-kapoor-celebs-attend-war-2-screening-2771216-2025-08-14",
      "headline": "Hrithik-Saba, Tiger Shroff to Anil Kapoor: Celebs attend War 2 screeningActor Hrithik Roshan, Saba Azad to Anil Kapoor, celebrities were captured attending 'War 2' screening at the YRF studio in Mumbai. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/wayne-rooney-tom-brady-birmingham-city-work-ethic-2771278-2025-08-14",
      "headline": "Football is not NFL: Rooney hits out at Tom Brady over work ethic remarkWayne Rooney believes that Tom Brady's comments during his managerial stint with Birmingham City were unfair. Nonetheless, the legendary striker believes that the club are going in the right direction now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-maxwell-powerplay-bowling-t20-world-cup-2771274-2025-08-14",
      "headline": "Maxwell eyes powerplay bowling role for Australia in T20 World CupAUS vs SA: Glenn Maxwell aims to take on a bigger role as a powerplay bowler for Australia in the 2026 T20 World Cup, citing his experience and variations as key assets. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/tottenham-hotspur-condemn-racial-abuse-mathys-tel-uefa-super-cup-loss-2771262-2025-08-14",
      "headline": "Tottenham condemns racial abuse aimed at Mathys Tel after Super Cup defeatTottenham Hotspur have expressed their disgust at the online racial abuse aimed at French forward Mathys Tel following their UEFA Super Cup loss to Paris Saint-Germain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-atherton-on-anderson-tendulkar-trophy-and-ashes-2005-2771251-2025-08-14",
      "headline": "Was Anderson Tendulkar Trophy at par with Ashes 2005? Former England captain answersFormer England captain Michael Atherton has shared his thoughts on the comparisons between the Anderson Tendulkar Trophy and the Ashes 2005. India and England finished the 5-match series with a 2-2 draw."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shoaib-akhtar-babar-azam-rizwan-batting-pindi-pitches-2771190-2025-08-14",
      "headline": "Shoaib Akhtar rips into Pakistan batters, calls for mega changes in culturePakistan bowling legend Shoaib Akhtar has slammed the team's batting performance after their crushing ODI series loss to West Indies. Akhtar has warned that the star batters won't find flat pitches everywhere."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/i-pray-india-refuse-to-play-against-pakistan-in-the-asia-cup-basit-ali-2771175-2025-08-14",
      "headline": "I pray India refuse to play against us in Asia Cup 2025: Ex-Pakistan batterFormer Pakistan cricketer Basit Ali has expressed his concerns about facing India in the Asia Cup 2025 after their recent series defeat against West Indies after over 33 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dewald-brevis-r-ashwin-csk-under-the-table-deal-ipl-corruption-2771160-2025-08-14",
      "headline": "Ashwin exposes CSK, claims team paid Dewald Brevis under the table in IPL 2025Legendary spinner Ravichandran Ashwin has exposed the Indian Premier League's under the table deals. Ashwin has claimed that CSK paid a much higher price than the stipulated Rs 2.2 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-responds-to-david-warners-surfboard-remark-ahead-of-ashes-2771119-2025-08-14",
      "headline": "Joe Root responds to David Warner's 'surfboard' remark ahead of Ashes 2025-26Star England batter Joe Root has responded to David Warner's remarks about his poor performances in Australia. Warner had said that Josh Hazlewood is going to give Root a tough time in Australia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samsons-trade-to-csk-is-not-going-to-work-r-ashwin-2771075-2025-08-14",
      "headline": "Sanju Samson's trade to Chennai Super Kings is not going to work: R AshwinChennai Super Kings (CSK) spinner Ravichandran Ashwin has said that the trade deal between CSK and Rajasthan Royals (RR) may not come to fruition due to several factors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-haryana-steelers-team-preview-swot-analysis-2771060-2025-08-14",
      "headline": "Defending champions Haryana Steelers eye back-to-back PKL titlesHaryana Steelers aim to become the second team to defend Pro Kabaddi League title. The squad faces challenges with defensive gaps and Naveen Kumar's injury concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dewald-brevis-r-ashwin-csk-under-the-table-deal-ipl-corruption-2771160-2025-08-14",
      "headline": "Ashwin exposes CSK, claims team paid Dewald Brevis under the table in IPL 2025Legendary spinner Ravichandran Ashwin has exposed the Indian Premier League's under the table deals. Ashwin has claimed that CSK paid a much higher price than the stipulated Rs 2.2 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-responds-to-david-warners-surfboard-remark-ahead-of-ashes-2771119-2025-08-14",
      "headline": "Joe Root responds to David Warner's 'surfboard' remark ahead of Ashes 2025-26Star England batter Joe Root has responded to David Warner's remarks about his poor performances in Australia. Warner had said that Josh Hazlewood is going to give Root a tough time in Australia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samsons-trade-to-csk-is-not-going-to-work-r-ashwin-2771075-2025-08-14",
      "headline": "Sanju Samson's trade to Chennai Super Kings is not going to work: R AshwinChennai Super Kings (CSK) spinner Ravichandran Ashwin has said that the trade deal between CSK and Rajasthan Royals (RR) may not come to fruition due to several factors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-haryana-steelers-team-preview-swot-analysis-2771060-2025-08-14",
      "headline": "Defending champions Haryana Steelers eye back-to-back PKL titlesHaryana Steelers aim to become the second team to defend Pro Kabaddi League title. The squad faces challenges with defensive gaps and Naveen Kumar's injury concerns."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}