{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/two-new-gst-levies-health-and-clean-energy-may-replace-compensation-cess-but-at-what-cost-2744140-2025-06-21",
      "headline": "Two new GST levies may replace compensation cess, but at what cost?Health and Clean Energy levies may replace the Compensation Cess, but tax experts warn of rising compliance burdens and fresh coordination challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-debut-india-showroom-mumbai-july-china-made-model-y-ev-suvs-report-2743896-2025-06-20",
      "headline": "Tesla to open first showroom in Mumbai next month, sell China-made EVs: ReportTesla is set to open its first showroom in Mumbai next month and sell Model Y rear-wheel-drive SUVs shipped from Tesla's China factory as the company seeks expansion in the world's third-biggest automobile market, Bloomberg News reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-growth-lies-in-its-heartland-adani-enterprises-pranav-adani-2743714-2025-06-20",
      "headline": "India's growth lies in its heartland: Adani Enterprises Director Pranav AdaniThe remarks came as part of a broader statement of intent from the newly launched Chintan Research Foundation, which Adani said would focus on three critical areas: climate change, trade, and geopolitics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-1046-points-higher-nifty-above-25100-airtel-jumps-3-percent-2743705-2025-06-20",
      "headline": "Sensex ends 1,046 points higher, Nifty above 25,100; Bharti Airtel jumps 3%The S&P BSE Sensex jumped 1,046.30 points to end at 82,408.17, while the NSE Nifty50 added 319.50 points to close at 25,112.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-lifestyle-inflation-fuelling-debt-among-indias-middle-class-2743647-2025-06-20",
      "headline": "Is lifestyle inflation fuelling debt among India's middle class?Lifestyle inflation is no longer a silent threat. It is reshaping how India's middle class earns, spends and saves. It fuels debt, shrinks buffers and puts long-term financial goals at risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/early-retirement-age-40-savings-needed-corpus-inflation-fire-trend-financial-independence-2743639-2025-06-20",
      "headline": "Planning to retire at 40? Here's what it really takesThe idea of retiring at 40 sounds almost rebellious. Stop working just when most people are hitting their career peak, and live the rest of your life on your own terms. No bosses, no Monday blues, no waiting for the weekend. But can you do it? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/financial-clarity-money-management-wealth-mindset-abhishek-walia-2743570-2025-06-20",
      "headline": "CA explains how Rs 80,000 per month income can beat Rs 2 lakhThe CA's insights suggest that intentional financial management is key to wealth building. A clear financial purpose can transform how resources are allocated, leading to sustainable growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rbi-eases-infrastructure-financing-norms-sensex-nifty-rise-2743540-2025-06-20",
      "headline": "Sensex jumps over 1,100 points: Why is the stock market rising today?The primary catalyst for this rally was the RBI's announcement concerning infrastructure financing. The central bank has implemented new norms that relax provisioning requirements for under-construction infrastructure projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/power-finance-corporation-share-price-rise-jumps-6-percent-today-reason-why-rbi-update-project-finance-2743503-2025-06-20",
      "headline": "Power Finance Corporation share price jumps 6% today. Here's whyWhile PFC has faced some pressure in recent months, with its stock falling 9.14% in the last six months and 14.44% over the past year, Friday's gain marks a strong rebound following the regulatory update."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-228-points-higher-nifty-above-24800-nestle-gains-1-percent-2743481-2025-06-20",
      "headline": "Sensex opens 228 points higher, Nifty above 24,800; Nestle gains 1%The S&P BSE Sensex was up 160.43 points to 81,522.30, while the NSE Nifty50 gained 36.45 points to 24,829.70 as of 9:23 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-lower-geopolitical-tensions-market-volatility-2743468-2025-06-20",
      "headline": "Sensex, Nifty opening: Will stock market open higher? Check key levelsAs of 8:00 am, Gift Nifty futures were trading at 24,800. This suggests that the Nifty50 may open near its previous closing level of 24,793.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-20-oswal-pumps-biocon-united-spirits-sai-life-sciences-nestle-india-2743464-2025-06-20",
      "headline": "Stocks to watch today: Oswal Pumps, Biocon, United Spirits, Sai Life SciencesShares of Nestle India could be in focus after the company announced that its Board of Directors will meet on June 26. They will consider a proposal to issue bonus shares."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/28-years-later-review-danny-boyle-proves-third-times-a-charm-in-this-zombie-follow-up-2744149-2025-06-21",
      "headline": "28 Years Later review: Danny Boyle proves third time's a charm in this zombie follow-upReleased-Fri Jun 20, 2025'28 Years Later', the third installment in the franchise, brings fresh energy to the zombie genre with a gripping story. Danny Boyle's direction and strong performances make it a thrilling watch that honours the legacy of the original '28 Days Later'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vir-das-praises-aamir-khan-sitaare-zameen-par-urges-fans-to-watch-2744145-2025-06-21",
      "headline": "Vir Das urges fans to watch Aamir Khan's Sitaare Zameen Par, calls it breezyJoining critics, viewers, and fellow celebrities, actor-comedian Vir Das has added his voice to the growing praise for Aamir Khan's 'Sitaare Zameen Par'. The film, which released in theatres on Friday, has already become a major talking point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sanam-saeed-mohib-mirza-welcome-baby-boy-vali-hasan-2744111-2025-06-21",
      "headline": "Pakistani actors Sanam Saeed-Mohib Mirza welcome baby boy Vali HasanPakistani actor Sanam Saeed, best known for her role in 'Zindagi Gulzar Hai', welcomed her first child with her actor-husband Mohib Mirza. She shared the name of her baby boy on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-emotional-birthday-wish-for-husband-shoaib-ibrahim-2744096-2025-06-21",
      "headline": "Dipika Kakar's emotional birthday wish for husband ShoaibActor Dipika Kakar shared a heartfelt note on the occasion of her actor-husband Shoaib Ibrahim's birthday. She thanked him for walking through the best and worst times, and staying by her side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-named-brand-ambassador-for-world-para-athletics-championship-2744107-2025-06-21",
      "headline": "Kangana Ranaut named brand ambassador for World Para Athletics, expresses prideActor and politician Kangana Ranaut has been named as the official Brand Ambassador for the World Para Athletics Championships. In a heartwarming speech, she expressed gratitude and pride. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-new-look-with-moustache-breaks-internet-fans-demand-comeback-2744078-2025-06-21",
      "headline": "Govinda's new look with moustache breaks internet, fans demand comebackBollywood actor Govinda is creating quite a stir online with his latest photos, debuting a fresh new look. While many speculated it might be for an upcoming film, fans also took the opportunity to urge the star to return to the big screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/international-yoga-day-2025-shilpa-shetty-to-hina-khan-celebs-share-inspiring-posts-2744070-2025-06-21",
      "headline": "International Yoga Day 2025: Shilpa Shetty to Hina Khan, celebs share postsOn International Yoga Day 2025, actors including Hina Khan, Shilpa Shetty, Anupam Kher and Nimrat Kaur, shared uplifting social media posts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-suga-apologises-to-fans-in-1st-instagram-post-after-military-service-addresses-past-controversy-2744055-2025-06-21",
      "headline": "BTS's Suga apologises to fans in 1st Instagram post, addresses past controversyBTS member Suga has completed his social service and shared a heartfelt message with fans expressing gratitude and remorse over a past incident. He reflected on his time away as a period of self-introspection and pledged to work harder to repay the love and support of the ARMY."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fading-echoes-why-hindi-cinema-struggles-to-honour-its-musical-legends-on-screen-2743502-2025-06-21",
      "headline": "Fading Echoes: Why Hindi cinema struggles to honour its musical legends on-screenWhy have Bollywood filmmakers not been able to create musical biopics like other genres? Despite the immensely talented composers and singers of yesteryear's cinema, we don't have any musical adaptation at par with Western musicians. On Cinematic Saturday, we reflect on why Indian storytellers are missing out on the musical legacies of cinema's maestros."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kuberaa-box-office-day-1-dhanush-nagarjuna-film-opens-strong-with-rs-13-crore-2744043-2025-06-21",
      "headline": "Kuberaa box office Day 1: Dhanush, Nagarjuna's film opens strong with Rs 13 crore'Kuberaa' released in theatres on June 20, starring Dhanush, Rashmika Mandanna and Nagarjuna. The Telugu crime-thriller opened to great reviews. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sitaare-zameen-par-box-office-day-1-aamir-khan-film-starts-decent-earns-rs-115-crore-2744034-2025-06-21",
      "headline": "Sitaare Zameen Par box office Day 1: Aamir Khan's film off to a brilliant startSitaare Zameen Par box office collection Day 1: Aamir Khan made a strong comeback with the RS Prasanna directorial on June 20. The film, a spiritual sequel to the 2007 hit, had a decent opening at the domestic box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/prosenjit-chatterjee-on-sitaare-zameen-pars-cinema-only-move-aamir-can-take-risk-2743891-2025-06-20",
      "headline": "Prosenjit Chatterjee on Sitaare Zameen Par's cinema-only move: Aamir can take riskActor Prosenjit Chatterjee, in an exclusive interaction, reacted to Aamir Khan's decision to ditch OTT and release 'Sitaare Zameen Par' in theatres. He said that such kind of changes are important. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vivek-agnihotri-takes-jibe-at-john-abraham-goal-slams-stardom-system-in-bollywood-2743844-2025-06-20",
      "headline": "Vivek Agnihotri takes jibe at John Abraham's Goal, slams stardom system in BollywoodDirector Vivek Agnihotri opened up about the challenges he faced during the shoot of John Abraham's 'Dhan Dhana Dhan Goal'. While criticising Bollywood's stardom system, he also slammed the stardom system of Bollywood.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshaye-khannas-ott-film-revamped-for-theatres-as-akshardham-operation-vajra-shakti-2743879-2025-06-20",
      "headline": "Akshaye Khanna's OTT film revamped for theatres as Akshardham Operation Vajra ShaktiActor Akshaye Khanna's action drama 'State of Siege: Temple Attack' is set for a theatrical release on July 4, 2025, under a new title - 'Akshardham: Operation Vajra Shakti'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/elio-review-sweet-funny-pixar-film-lacks-emotional-depth-2743874-2025-06-20",
      "headline": "Elio review: Pixar's new offering is sweet and funny but lacks sparkReleased-Fri Jun 13, 2025Elio movie review: Pixar's Elio is a heartwarming story about an orphaned boy turned cosmic ambassador. Despite its charm, the film misses the emotional depth expected from Pixar's best works."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-returns-mumbai-saif-ali-khan-kareena-kapoor-sunjay-kapur-funeral-2743878-2025-06-20",
      "headline": "Karisma Kapoor returns to Mumbai with Saif Ali Khan and Kareena Kapoor. WatchKarisma Kapoor, along with sister Kareena Kapoor and Saif Ali Khan, returned to Mumbai after Sunjay Kapur's funeral in Delhi. A video of them leaving Delhi has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diana-penty-was-initial-choice-for-rockstar-was-dropped-after-2-3-weeks-2743812-2025-06-20",
      "headline": "Diana Penty says she was dropped from Rockstar after workshops, later bagged CocktailActor Diana Penty said in an interview that she was rejected for Ranbir Kapoor-starrer 'Rockstar' before she made her debut with 'Cocktail.' She was dropped from the film after two to three weeks of workshops. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jackson-wang-dances-to-katrina-kaif-chikni-chameli-during-india-visit-2743850-2025-06-20",
      "headline": "Jackson Wang dances to Katrina Kaif's Chikni Chameli during India visit. WatchK-pop star Jackson Wang visited India to promote his upcoming album 'Magic Man 2'. In one of the viral moments from his trip, Wang was seen dancing to Katrina Kaif's 'Chikni Chameli'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/veteran-pakistani-actor-ayesha-khan-dies-at-76-body-discovered-after-a-week-2743855-2025-06-20",
      "headline": "Veteran Pakistani actor Ayesha Khan dies at 76, body discovered after a weekVeteran Pakistani actor Ayesha Khan was found dead in her apartment in Karachi, Pakistan. She was 76. Her body was discovered in a decomposed state nearly a week after her death.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/days-after-crash-aviation-body-orders-air-india-to-remove-3-officials-for-serious-lapses-2744144-2025-06-21",
      "headline": "Days after crash, aviation body orders removal of 3 Air India officials for lapsesAs per the DGCA's June 20 order, the officials were linked to crew pairing violations, licensing breaches and oversight failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/election-commission-cites-privacy-legal-issues-congress-rahul-gandhi-demands-cctv-video-polling-booths-2744187-2025-06-21",
      "headline": "Election Commission cites privacy, legal issues as Congress demands CCTV footages of polling boothsElection Commission cites privacy, legal issues as Congress demands CCTV footages of polling booths"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nitish-kumar-hikes-social-security-pension-ahead-of-bihar-elections-rjd-nda-2744100-2025-06-21",
      "headline": "Poll bonanza? Nitish Kumar hikes social security pension in Bihar to Rs 1,100Under the revised scheme, senior citizens and persons with disabilities will now receive Rs 1100 per month, up from the earlier amount of Rs 400."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-slams-pm-modi-make-in-india-manufacturing-china-profits-2744072-2025-06-21",
      "headline": "Assemble as many iPhones but...: Rahul Gandhi's stark truth on 'Make In India'Rahul Gandhi, during his visit to Nehru Place, Delhi's largest electronics market, suggested that electronic parts were being imported and 'assembled in India' and not being built here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sherlock-holmes-india-greatest-test-batter-part-2-2743895-2025-06-21",
      "headline": "Who is India's greatest Test batsman? Sherlock Holmes concludes his investigationGavaskar, Tendulkar, Dravid or Kohli? Who is the greatest Indian batter? After a thorough investigation in Part 1, Sherlock Holmes deduced Kohli comes in fourth in this field of four. Readers agreed with Holmes overwhelmingly. In this second and concluding part of his investigation, Holmes narrows in on Dravid, Gavaskar and Sachin to find the greatest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-live-updates-tel-aviv-tehran-donald-trump-white-house-missiles-drones-2743961-2025-06-20",
      "headline": "Live: At least 430 people killed, 3,500 injured in Iran since start of conflictIsrael-Iran Conflict Live Updates: The Israel-Iran conflict showed no signs of stopping as the long-time enemies fired missiles and drones at each other on the ninth day. Israel bombed nuclear infrastructure in Iran. Tehran retaliated by firing missiles armed with cluster munitions, marking the first reported use of such weapons in the ongoing conflict. Meanwhile, US President Donald Trump, who will decide if the US will participate in the conflict, presided over a national security meeting about Iran with top aides at the White House on Friday, a US official said. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-nobel-peace-prize-india-pakistan-war-repeats-claim-pm-modi-call-2744063-2025-06-21",
      "headline": "Won't get Nobel for halting India-Pak war: Trump at it again after PM fact-checkIn a lengthy social media post, US President Donald Trump argued that he deserved the Nobel Peace Prize for multiple peace efforts, including his involvement in 'stopping' the war between India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/israel-claims-hezbollah-site-bombed-amid-missile-strike-by-iran-across-key-cities-2744138-2025-06-21",
      "headline": "Ground report: Iran strikes cause widespread damage, leave roads empty in IsraelIn Israel, cities like Bat Yam and Tel Aviv have faced missile attacks, with buildings damaged and casualties reported. Iran has also experienced attacks, with reports of devastation and casualties in cities like Qom. The situation remains tense with both nations continuing to exchange fire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/ranthambore-iconic-tigress-arrowhead-final-walk-viral-video-2744091-2025-06-21",
      "headline": "Photographer shares video of Ranthambore's iconic tigress Arrowhead's final walkIn an emotional post on Instagram, a wildlife photographer shared a video of Ranthambore's iconic tigress Arrowhead's final walk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/are-indian-astronauts-being-called-back-from-us-as-ax-4-mission-is-postponed-2744175-2025-06-21",
      "headline": "Has Isro called back Indian astronauts part of Ax-4 mission?Sources within ISRO clarified that only the ISRO chairman and the Indian support team stationed in the United States are returning to India, while the astronauts themselves remain in Florida, ready to launch once a new date is set."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-cricket-score-1st-test-day-2-leeds-updates-2744148-2025-06-21",
      "headline": "1st Test, Day 2 Live: Pant, Gill look to extend India's dominanceEngland (ENG) vs India (IND), 1st Test Day 2 Live Score Updates from Leeds: India start the second day of the Headingley Test match with 359 runs for the loss of 3 wickets. Shubman Gill and Rishabh Pant are at the crease as India look to extend their dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-at-international-yoga-day-yoga-gives-direction-of-peace-amid-unrest-that-world-witnesses-today-2744019-2025-06-21",
      "headline": "Yoga gives direction of peace as world today witnesses unrest: PM ModiAs conflicts in West Asia and Europe rage on, PM Modi said that yoga kills ego and 'takes us from me to we,' highlighting its power to foster global unity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-tamil-nadu-governor-r-n-ravi-stuns-crowd-in-madhurai-with-51-push-ups-at-yoga-day-event-2744089-2025-06-21",
      "headline": "Video: Tamil Nadu Governor stuns crowd with 51 push-ups at Yoga Day eventThe Governor not only led by example during the yoga session but also delivered a jaw-dropping performance that blurred the lines between age and youth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-shubman-gill-day-1-captaincy-virat-kohli-2744058-2025-06-21",
      "headline": "First day in office: Shubman Gill and Virat Kohli. Same same, but differentENG vs IND, Leeds Test: On his first day as Test captain, Shubman Gill led with calm authority, silencing doubts not with flair but with discipline and steel. At Headingley, he and his young team signalled that India's red-ball future may well be in safe hands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/british-f-35-fighter-jets-surprise-stopover-in-india-explained-words-of-war-2743943-2025-06-20",
      "headline": "British F-35 fighter jet's surprise stopover in India explained | Words of WarAn F-35 fighter jet from the British Royal Navy made an emergency landing in Thiruvananthapuram due to a technical snag—and it's still parked there 5 days later. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-new-look-with-moustache-breaks-internet-fans-demand-comeback-2744078-2025-06-21",
      "headline": "Govinda's new look with moustache breaks internet, fans demand comebackBollywood actor Govinda is creating quite a stir online with his latest photos, debuting a fresh new look. While many speculated it might be for an upcoming film, fans also took the opportunity to urge the star to return to the big screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/28-years-later-review-danny-boyle-proves-third-times-a-charm-in-this-zombie-follow-up-2744149-2025-06-21",
      "headline": "28 Years Later review: Danny Boyle proves third time's a charm in this zombie follow-upReleased-Fri Jun 20, 2025'28 Years Later', the third installment in the franchise, brings fresh energy to the zombie genre with a gripping story. Danny Boyle's direction and strong performances make it a thrilling watch that honours the legacy of the original '28 Days Later'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-498-20-06-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/tulsi-gabbard-says-media-twisted-her-iran-testimony-after-trump-calls-her-wrong-glbs-2744005-2025-06-21",
      "headline": "Tulsi Gabbard says media twisted her Iran testimony after Trump calls her wrongTulsi Gabbard responded to President Trump's criticism of her Iran nuclear assessment, accusing the media of misrepresenting her testimony. She clarified that US intelligence shows Iran could produce a nuclear weapon soon.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/israel-iran-conflict-earthquakes-back-to-back-potential-link-nuclear-activities-seismic-sites-damage-contamination-2744110-2025-06-21",
      "headline": "Twin quakes shake Iran amid Israel conflict. Is there link to nuclear activities?Iran was hit by a 5.1 magnitude earthquake on Friday, five days after a 2.5 magnitude quake. The timing of these earthquakes amid Tehran's conflict with Israel at its peak, and recent satellite imagery showing damage at Iranian nuclear sites, have fuelled speculation of a potential connection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fading-echoes-why-hindi-cinema-struggles-to-honour-its-musical-legends-on-screen-2743502-2025-06-21",
      "headline": "Fading Echoes: Why Hindi cinema struggles to honour its musical legends on-screenWhy have Bollywood filmmakers not been able to create musical biopics like other genres? Despite the immensely talented composers and singers of yesteryear's cinema, we don't have any musical adaptation at par with Western musicians. On Cinematic Saturday, we reflect on why Indian storytellers are missing out on the musical legacies of cinema's maestros."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/pranjali-awasthi-rs-100-crore-ai-startup-founder-at-16-delvai-dash-2744115-2025-06-21",
      "headline": "At 16, she built a Rs 100-crore AI firm, now she's making 'ChatGPT with hands'Pranjali Awasthi is an Indian teen who started coding at 7, and founded the Rs 100 crore startup Delv.AI at 16. Now 18, she's building Dash, an AI tool she calls \"ChatGPT with hands\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-yashasvi-jaiswal-hundred-jasprit-bumrah-bowlind-2744103-2025-06-21",
      "headline": "How Bumrah test shaped Yashasvi Jaiswal's imposing Leeds hundredYashasvi Jaiswal scored a brilliant century on Day 1 of India's first Test against England at Headingley. His confidence from India A practice helped India dominate the English bowling attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/surrender-of-values-sonia-gandhi-slams-india-silence-israel-iran-gaza-strikes-2744168-2025-06-21",
      "headline": "Surrender of values: Sonia Gandhi slams India's silence on Iran, Gaza strikesIn an article, 'It is still not too late for India's voice to be heard', Sonia Gandhi accused the Narendra Modi government of abandoning India's long-standing and principled commitment to a peaceful two-nation solution envisioning an independent Palestine along with Israel."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-icc-black-sock-fine-explained-leeds-test-2744171-2025-06-21",
      "headline": "Why Shubman Gill could face ICC sanction over his black socksEngland vs India: India's new Test captain, Shubman Gill, may face ICC sanctions for wearing black socks on the opening day of the Leeds Test against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bizzare-run-out-maharashtra-premier-league-rahul-tripath-2744173-2025-06-21",
      "headline": "Massive collision, comical run out attempt: Viral clip has fans in splitsA chaotic mid-pitch collision during the Maharashtra Premier T20 Eliminator match led to a comical run-out meltdown. This incident shifted momentum, helping Raigad Royals secure a dramatic win and move closer to the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-cricket-score-1st-test-day-2-leeds-updates-2744148-2025-06-21",
      "headline": "1st Test, Day 2 Live: Pant, Gill look to extend India's dominanceEngland (ENG) vs India (IND), 1st Test Day 2 Live Score Updates from Leeds: India start the second day of the Headingley Test match with 359 runs for the loss of 3 wickets. Shubman Gill and Rishabh Pant are at the crease as India look to extend their dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-sam-konstas-west-indies-test-series-emotional-debut-india-2744139-2025-06-21",
      "headline": "Australia's Sam Konstas recalls Test debut vs India: Emotions got to meTeenage opener Sam Konstas said he has \"come a long way\" since his combative debut against India, after earning a recall for Australia's opening Test against the West Indies. The 19-year-old acknowledged the progress he has made in his game and temperament since that high-pressure introduction to Test cricket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/manpreet-singh-400-international-matches-indian-hockey-grit-consistency-2744113-2025-06-21",
      "headline": "Manpreet Singh hits 400: A testament to unyielding gritManpreet Singh has played 400 international matches for India, showcasing remarkable grit and consistency. His milestone underlines his pivotal role as Indian hockey aims for success in upcoming tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-yashasvi-jaiswal-hundred-jasprit-bumrah-bowlind-2744103-2025-06-21",
      "headline": "How Bumrah test shaped Yashasvi Jaiswal's imposing Leeds hundredYashasvi Jaiswal scored a brilliant century on Day 1 of India's first Test against England at Headingley. His confidence from India A practice helped India dominate the English bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sanjay-manjrekar-shubman-gill-test-captaincy-leeds-hundred-2744093-2025-06-21",
      "headline": "Sanjay Manjrekar makes U-turn on captain Shubman Gill after Leeds showSanjay Manjrekar revealed that he was initially against Shubman Gill being appointed India's Test captain over Jasprit Bumrah. However, he added that he never expected Gill to fail, as he always had the temperament to succeed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-leeds-weather-forecast-headingley-pitch-2744087-2025-06-21",
      "headline": "ENG vs IND, 1st Test Day 2, Leeds forecast: Conditions set to play key roleIndia posted a commanding 359 for 3 on Day 1 at Leeds with strong centuries from Yashasvi Jaiswal and Shubman Gill. Rain clouds are expected to affect play on Day 2, potentially favouring seam bowlers and shortening the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-matured-ipl-captaincy-nasser-hussain-leeds-hundred-2744080-2025-06-21",
      "headline": "Shubman Gill has matured since IPL captaincy: Hussain praises Leeds hundredFormer England captain Nasser Hussain praised Shubman Gill after the Indian skipper's unbeaten century on Day 1 of the first Test against England at Headingley. Gill's 127 not out guided India to a dominant 359 for 3 at stumps on the opening day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mark-wood-hopeful-return-final-england-india-test-knee-injury-2744062-2025-06-21",
      "headline": "England pacer Mark Wood hopeful of comeback in fifth Test against IndiaEngland pace spearhead Mark Wood is hopeful of making a comeback in the ongoing Test series against India. The fast bowler said he is working on his recovery and could return in time for the final match of the five-Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sanjay-manjrekar-shubman-gill-test-captaincy-leeds-hundred-2744093-2025-06-21",
      "headline": "Sanjay Manjrekar makes U-turn on captain Shubman Gill after Leeds showSanjay Manjrekar revealed that he was initially against Shubman Gill being appointed India's Test captain over Jasprit Bumrah. However, he added that he never expected Gill to fail, as he always had the temperament to succeed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-leeds-weather-forecast-headingley-pitch-2744087-2025-06-21",
      "headline": "ENG vs IND, 1st Test Day 2, Leeds forecast: Conditions set to play key roleIndia posted a commanding 359 for 3 on Day 1 at Leeds with strong centuries from Yashasvi Jaiswal and Shubman Gill. Rain clouds are expected to affect play on Day 2, potentially favouring seam bowlers and shortening the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-matured-ipl-captaincy-nasser-hussain-leeds-hundred-2744080-2025-06-21",
      "headline": "Shubman Gill has matured since IPL captaincy: Hussain praises Leeds hundredFormer England captain Nasser Hussain praised Shubman Gill after the Indian skipper's unbeaten century on Day 1 of the first Test against England at Headingley. Gill's 127 not out guided India to a dominant 359 for 3 at stumps on the opening day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mark-wood-hopeful-return-final-england-india-test-knee-injury-2744062-2025-06-21",
      "headline": "England pacer Mark Wood hopeful of comeback in fifth Test against IndiaEngland pace spearhead Mark Wood is hopeful of making a comeback in the ongoing Test series against India. The fast bowler said he is working on his recovery and could return in time for the final match of the five-Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-highest-asian-wicketkeeper-batter-sena-3000-test-runs-headingley-2744057-2025-06-21",
      "headline": "Rishabh Pant becomes Asia's most successful Test wicketkeeper in SENA countriesENG vs IND: Rishabh Pant became the most successful Asian wicketkeeper-batter in SENA countries during the first Test against England, marking the milestone with a vital innings that helped India dominate Day 1 and set the tone for the new World Test Championship cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-shubman-gill-day-1-captaincy-virat-kohli-2744058-2025-06-21",
      "headline": "First day in office: Shubman Gill and Virat Kohli. Same same, but differentENG vs IND, Leeds Test: On his first day as Test captain, Shubman Gill led with calm authority, silencing doubts not with flair but with discipline and steel. At Headingley, he and his young team signalled that India's red-ball future may well be in safe hands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sherlock-holmes-india-greatest-test-batter-part-2-2743895-2025-06-21",
      "headline": "Who is India's greatest Test batsman? Sherlock Holmes concludes his investigationGavaskar, Tendulkar, Dravid or Kohli? Who is the greatest Indian batter? After a thorough investigation in Part 1, Sherlock Holmes deduced Kohli comes in fourth in this field of four. Readers agreed with Holmes overwhelmingly. In this second and concluding part of his investigation, Holmes narrows in on Dravid, Gavaskar and Sachin to find the greatest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-bayern-munich-boca-juniors-flamengo-chelsea-2744048-2025-06-21",
      "headline": "Bayern Munich edge Boca Juniors, Flamengo stun 10-man ChelseaBayern Munich secured their place in the FIFA Club World Cup knockout stage with a narrow win over Boca Juniors. Flamengo stunned Chelsea with a strong second-half comeback, shifting group dynamics significantly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-questions-ben-stokes-bowling-first-decision-headingley-test-2744035-2025-06-21",
      "headline": "Michael Vaughan slams Ben Stokes's decision to bowl in Leeds TestFormer England captain Michael Vaughan said he was \"staggered\" that Ben Stokes chose to bowl first after winning the toss on the opening day of the Test series against India. The decision backfired as the tourists plundered 359 runs for the loss of just three wickets on a flat pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-bowling-coach-tim-southee-reaction-toss-india-dominate-leeds-test-2744030-2025-06-21",
      "headline": "Southee defends England's decision to bowl after India's Leeds show on Day 1ENG vs IND: England bowling coach Tim Southee came to the defence of captain Ben Stokes's decision to bowl first in the opening Test at Headingley after India put themselves firmly in the driver's seat on Day 1"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sachin-tendulkar-sourav-ganguly-banter-1st-test-day-1-leeds-2744021-2025-06-21",
      "headline": "Sachin Tendulkar nostalgic after young India's Leeds show, Sourav Ganguly reactsENG vs IND: Indian cricket legends Sachin Tendulkar and Sourav Ganguly were back in the spotlight after a nostalgic and light-hearted exchange on social media, following India's dominant display on the opening day of the first Test against England at Headingley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-reaction-parisdiamond-league-win-javelin-consistency-2744018-2025-06-21",
      "headline": "More 90m throws coming, but Neeraj Chopra proud of consistencyOlympic medal-winning Indian javelin throw superstar Neeraj Chopra was proud of his consistency after clinching his first Diamond League title in two years, upstaging German rival Julian Weber in a strong field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-questions-ben-stokes-bowling-first-decision-headingley-test-2744035-2025-06-21",
      "headline": "Michael Vaughan slams Ben Stokes's decision to bowl in Leeds TestFormer England captain Michael Vaughan said he was \"staggered\" that Ben Stokes chose to bowl first after winning the toss on the opening day of the Test series against India. The decision backfired as the tourists plundered 359 runs for the loss of just three wickets on a flat pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-bowling-coach-tim-southee-reaction-toss-india-dominate-leeds-test-2744030-2025-06-21",
      "headline": "Southee defends England's decision to bowl after India's Leeds show on Day 1ENG vs IND: England bowling coach Tim Southee came to the defence of captain Ben Stokes's decision to bowl first in the opening Test at Headingley after India put themselves firmly in the driver's seat on Day 1"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sachin-tendulkar-sourav-ganguly-banter-1st-test-day-1-leeds-2744021-2025-06-21",
      "headline": "Sachin Tendulkar nostalgic after young India's Leeds show, Sourav Ganguly reactsENG vs IND: Indian cricket legends Sachin Tendulkar and Sourav Ganguly were back in the spotlight after a nostalgic and light-hearted exchange on social media, following India's dominant display on the opening day of the first Test against England at Headingley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-reaction-parisdiamond-league-win-javelin-consistency-2744018-2025-06-21",
      "headline": "More 90m throws coming, but Neeraj Chopra proud of consistencyOlympic medal-winning Indian javelin throw superstar Neeraj Chopra was proud of his consistency after clinching his first Diamond League title in two years, upstaging German rival Julian Weber in a strong field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/javelin-paris-diamond-league-neeraj-chopra-title-win-result-julian-weber-2743987-2025-06-21",
      "headline": "No 90m, but Neeraj Chopra wins Paris Diamond League in first major crown of 2025There was no 90-metre magic for Neeraj Chopra, but he secured his first title of the season by claiming victory at the Paris Diamond League on Friday, June 20. Neeraj overcame the threat of Julian Weber to claim the first title win of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-headingley-test-yashasvi-jaiswal-planning-shubman-gill-2743980-2025-06-21",
      "headline": "Yashasvi Jaiswal reveals plan with Shubman Gill during Headingley standYashasvi Jaiswal opened up on his key partnership with Shubman Gill during India's dominant Day 1 at Headingley, revealing their simple but effective gameplan that led to twin centuries and a powerful platform for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/javelin-paris-diamond-league-neeraj-chopra-live-updates-2743977-2025-06-21",
      "headline": "Paris Diamond League Highlights: Neeraj beats Weber to title winNeeraj Chopra at Paris Diamond League Highlights: Neeraj Chopra has finally claimed his first title win of the season, overcoming the challenge from Julian Weber in Paris on Friday, June 20. The Indian ace's first attempt was his best one as he claimed the crown. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-mature-century-headingley-test-sunil-gavaskar-2743976-2025-06-21",
      "headline": "Mature Shubman Gill was gorgeous vs England: Gavaskar on Headingley 127ENG vs IND: Shubman Gill marked his first Test as captain with a brilliant 127, guiding India to 359/3 on Day 1 at Headingley. Sunil Gavaskar praised his maturity, calmness and a touching gesture to the dressing room."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-day-one-yashasvi-jaiswal-hundred-leeds-2743974-2025-06-21",
      "headline": "Yashasvi Jaiswal reveals mantra after Leeds hundred: Being myself, keeping it simpleYashasvi Jaiswal revealed his mantra after scoring his fifth Test hundred on Day one of the match at Leeds on Friday, June 20. Jaiswal created a lot of records on his way to the hundred against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sunil-gavaskar-in-awe-of-rishabh-pants-measured-leeds-knock-2743969-2025-06-21",
      "headline": "Stupid no more: Sunil Gavaskar in awe of Rishabh Pant's measured Leeds knockLegendary India batter Sunil Gavaskar was in awe of Rishabh Pant for his measured approach against England on Day 1 of the first Test at Headingley, Leeds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-shubman-gill-hundred-yuvraj-singh-wasim-jaffer-leeds-2743967-2025-06-20",
      "headline": "Shubman Gill dazzles in Leeds: Yuvraj Singh, Wasim Jaffer praise India captainYuvraj Singh, Wasim Jaffer and Irfan Pathan led the way with praise for new Indian Test captain Shubman Gill as he scored a fine hundred on Day 1 of the first Test against England on Friday, June 20. Gill entered an elite list with Virat Kohli following his first hundred as captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-1st-test-shubman-gill-yashasvi-jaiswal-rishabh-pant-leeds-test-2743952-2025-06-20",
      "headline": "ENG vs IND: Gill and Jaiswal smash tons as India's NextGen pummel EnglandShubman Gill led Indian team from the front on Day 1 of the first Test against England with a classy century on his captaincy debut at Headingley, Leeds. He was well-supported by Yashasvi Jaiswal, who continued his love affair with first Tests in overseas conditions and hit his 5th Test ton."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-headingley-shubman-gill-century-test-captaincy-virat-kohli-2743933-2025-06-20",
      "headline": "ENG vs IND: Shubman Gill echoes Virat Kohli with century on Test captaincy debutShubman Gill silenced critics of his overseas Test record with a composed 140-ball century on his captaincy debut in the Headingley Test on June 20, matching Virat Kohli's feat and starting India's new era strongly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-viral-video-rishabh-pant-ben-stokes-banter-leeds-2743928-2025-06-20",
      "headline": "Watch: Rishabh Pant, Ben Stokes exchange words after India star's signature shotEngland vs India, 1st Test: Vice-captain Rishabh Pant and England captain Ben Stokes were involved in a friendly exchange in the final session of the opening day in Leeds. Pant played a restrained knock after walking into bat at No. 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-kalyan-chaubey-statement-reply-bhaichung-bhutia-allegations-corruption-2743915-2025-06-20",
      "headline": "AIFF Chief Kalyan Chaubey hits back at Bhutia, urges unity in football rowAIFF President Kalyan Chaubey responded to Bhaichung Bhutia's corruption claims, calling them baseless and urging constructive input instead. The exchange comes ahead of a key Executive Committee meeting on Indian football's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-yashasvi-jaiswal-shubman-gill-stump-mic-leeds-2743910-2025-06-20",
      "headline": "Watch: Yashasvi Jaiswal reminds Shubman Gill of his shaky running habit in viral videoYashasvi Jaiswal reminded Shubman Gill about his shaky running habit in a viral video during their partnership against England on Day 1 of the first Test in Leeds. Jaiswal scored a brilliant hundred and created a few records along the way.  "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}