{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-trusts-names-neville-tata-bhaskar-bhat-as-new-trustees-report-2817724-2025-11-11",
      "headline": "Tata Trusts names Neville Tata, Bhaskar Bhat as new trustees: ReportNeville, 32, currently leads Trent's value fashion brand Zudio and serves on several other Tata Trust boards. Bhaskar Bhat, a former Titan managing director, is credited with driving the company's diversification and expansion during his tenure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/all-new-paytm-app-brings-greater-privacy-stronger-security-and-control-for-users-2817586-2025-11-11",
      "headline": "All-new Paytm app brings greater privacy, stronger security and control for usersReinforcing its commitment to being the safest UPI app in India, Paytm now prevents screen recording during UPI payments, adding a critical layer of security that protects users from potential fraud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-stays-firm-amid-wedding-demand-time-to-buy-2817570-2025-11-11",
      "headline": "Gold stays firm amid wedding demand. Time to buy?Gold continues to shine, backed by festive demand and supportive global trends. But with prices already high, many are wondering if the rally still has room to run or if caution is the smarter bet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-reverse-early-losses-to-end-higher-fuelled-by-it-auto-stocks-2817448-2025-11-11",
      "headline": "Sensex, Nifty reverse early losses to end higher fuelled by IT and auto stocksThe S&P BSE Sensex added 335.97 points to close at 83,871.32, while the NSE Nifty50 gained 120.60 points to end at 25,694.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/physicswallah-ipo-review-day-1-subscription-weak-demand-gmp-signal-muted-listing-alakh-pandey-pw-2817402-2025-11-11",
      "headline": "PhysicsWallah IPO: Is it a good bet or should investors skip the listing?PhysicsWallah IPO will remain open for bidding from November 11 to November 13, 2025, with the allotment to be finalised on November 14, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/equity-inflows-fall-19-percent-in-october-despite-market-rise-amfi-2817356-2025-11-11",
      "headline": "Equity inflows fall 19% in October despite market rise: AMFIAmong equity categories, most still managed to bring in money, but with mixed momentum. Flexicap funds remained the most sought-after option, collecting Rs 8,928 crore, a solid 27% rise month-on-month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warren-buffet-last-letter-berkshire-hathaway-shareholders-retirement-key-takeaways-2817336-2025-11-11",
      "headline": "Warren Buffett signs off: Key takeaways from his final letter to shareholdersThe 95-year-old investor, who has led Berkshire for nearly six decades, announced he will no longer write the company's annual reports or address shareholders at the annual meeting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-80000-crore-lying-unclaimed-why-families-fail-to-access-loved-ones-savings-2817320-2025-11-11",
      "headline": "Rs 80,000 crore lying unclaimed: Why families fail to access loved ones' savingsFamilies in India are losing track of their own inheritance. With Rs 80,000 crore unclaimed, financial advisers warn that the problem is not wealth creation, but the absence of clear records, nominations and open discussions at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-price-futures-continue-to-rise-explained-2817304-2025-11-11",
      "headline": "Gold at Rs 1.25 lakh, Silver extends gains: Why are prices rising again?Gold prices surged to Rs 1.24 lakh and silver neared Rs 1.55 lakh amid easing U.S. shutdown worries and Fed rate-cut hopes. Should investors buy now or wait for dips?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bajaj-finance-share-price-crashes-8-percent-whats-behind-todays-slide-2817274-2025-11-11",
      "headline": "Bajaj Finance share price crashes 8%: What's behind today's slide?Shares of Bajaj Finance crashed nearly 8% today after solid earnings were overshadowed by a trimmed growth outlook and rising asset stress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-better-sip-returns-follow-the-10-7-10-mantra-says-expert-2817266-2025-11-11",
      "headline": "Want better SIP returns? Follow the 10-7-10 mantra, says expertSIP investors often look for the magic formula to grow wealth faster. According to an expert, the 10-7-10 mantra may be the closest thing to one — a simple, disciplined approach that can potentially boost long-term returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/government-updates-pension-rules-parents-must-file-this-document-for-75-benefit-2817211-2025-11-11",
      "headline": "Government updates pension rules: Parents must file this document for 75% benefitParents receiving family pension from the government must now file this key document every year to keep the 75% benefit. The revision is part of a new effort to reduce errors and incorrect payouts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/pine-labs-ipo-last-day-close-today-will-you-get-profit-subscribe-skip-gmp-trend-review-listing-date-2817214-2025-11-11",
      "headline": "Pine Labs IPO closes today: Is it worth betting on for listing gains?The Rs 3,899.91 crore IPO is a book-built issue, consisting of a fresh issue of 9.41 crore shares worth Rs 2,080 crore and an offer for sale (OFS) of 8.23 crore shares worth Rs 1,819.91 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-sips-vs-direct-stocks-where-should-young-professionals-bet-2817203-2025-11-11",
      "headline": "Mutual fund SIPs vs direct stocks: Where should young professionals bet?For young professionals, the lure of direct stocks, instant control, multi-bagger dreams, and social-media bravado is understandable. Yet four decades of global and Indian evidence reveal a sobering pattern: discipline and diversification, not adrenaline and instinct, drive enduring wealth creation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-commercial-vehicles-listing-november-12-demerger-details-share-allotment-record-date-2817176-2025-11-11",
      "headline": "Tata Motors CV arm to list on November 12: What investors should knowTata Motors' decade-long restructuring reaches its final stage as its commercial vehicles arm lists on November 12. What this means for investors, share allotments, and how trading will begin?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bajaj-finance-share-price-falls-7-after-q2-results-growth-guidance-cut-asset-quality-stress-2817165-2025-11-11",
      "headline": "Bajaj Finance share price falls 7% after Q2 results. Should you buy the dip?Bajaj Finance shares plunged nearly 7% after Q2 results showed solid profit growth but weaker guidance and rising asset stress. With valuations still rich, is this a buying opportunity?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-flat-despite-positive-global-sentiment-q2-earnings-2817161-2025-11-11",
      "headline": "Sensex, Nifty flat despite positive global sentiment, Q2 earningsThe S&P BSE Sensex was down by 242.13 points to 83,293.22, while the NSE Nifty50 lost 72.35 points to 25,502.00 as of 9:32 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/groww-ipo-listing-date-share-price-prediction-strong-debut-muted-opening-latest-gmp-trend-2817155-2025-11-11",
      "headline": "Groww IPO listing: Strong debut or muted opening on cards? Check what GMP saysThe parent company of Groww, Billionbrains Garage Ventures Ltd, saw massive investor interest during the subscription window. Groww allotment was finalised on November 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/how-to-choose-right-ipo-read-drhp-pe-ratio-pricing-explained-avoid-overvaluation-retail-investor-guide-2817142-2025-11-11",
      "headline": "Not every IPO is a jackpot: How to know if an IPO is really worth your moneyMany retail investors still go by hype, brand names, and subscription figures rather than understanding whether the issue is actually worth investing in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/physicswallah-ipo-open-today-review-subscribe-skip-gmp-trend-details-pw-alakh-pandey-2817120-2025-11-11",
      "headline": "PhysicsWallah IPO opens today: Should you subscribe? Here's what GMP indicatePhysicsWallah's Rs 3,480 crore IPO consists of a fresh issue of 28.44 crore shares worth Rs 3,100 crore and an offer for sale (OFS) of 3.49 crore shares worth Rs 380 crore."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bb-19-episode-79-tanya-mittal-calls-amaal-mallik-shameless-amid-kitchen-conflict-2817780-2025-11-11",
      "headline": "BB 19 Episode 79: Tanya Mittal calls Amaal Mallik shameless amid kitchen conflict Episode 79 of 'Bigg Boss 19' saw political warfare turn personal as Kunickaa Sadanand's all-female alliance clashed with Amaal Malik over bias. It culminated in a bitter kitchen confrontation with Tanya over basic house rules.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/iranian-actor-homayoun-ershadi-from-the-kite-runner-taste-of-cherry-dies-at-78-2817764-2025-11-11",
      "headline": "Iranian actor Homayoun Ershadi, from The Kite Runner, Taste of Cherry, dies at 78 Iranian actor Homayoun Ershadi from 'The Kite Runner' died at the age of 78. He had also acted in the Iranian film 'Taste of Cherry'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/south-korean-pop-icon-hyuna-collapses-on-stage-after-reported-weight-loss-2817750-2025-11-11",
      "headline": "South Korean pop icon HyunA collapses on-stage after reported weight loss South Korean pop icon HyunA collapsed during her live performance recently. The singer who had recently lost 10 kg in a month, sparked health concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-wraps-the-raja-saab-shoot-director-maruthi-calls-it-a-victorious-journey-2817731-2025-11-11",
      "headline": "Prabhas wraps The Raja Saab shoot, director Maruthi calls it a victorious journey Director Maruthi wrapped up the shooting of 'The Raja Saab', featuring Prabhas in the lead role. Maruthi also shared the new poster of the upcoming horror-comedy on social media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/marty-supreme-trailer-timothee-chalamet-transforms-into-table-tennis-prodigy-in-new-sports-comedy-2817723-2025-11-11",
      "headline": "Marty Supreme trailer: Timothee Chalamet is table tennis prodigy in sports comedy Timothee Chalamet plays a table tennis prodigy in his upcoming sports-comedy - 'Marty Supreme'. The Josh Safdie film also features Gwyneth Paltrow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sex-or-conversation-vicky-kaushal-choice-leaves-kajol-and-twinkle-in-splits-2817657-2025-11-11",
      "headline": "Sex or conversation? Vicky Kaushal's choice leaves Kajol and Twinkle in splits Vicky Kaushal humorously prioritised good sex over good conversation on 'Two Much with Kajol and Twinkle'. His remark sparked laughter in the talk show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-promo-amitabh-bachchan-harsh-gujral-abhishek-upmanyu-anubhav-singh-bassi-ravi-gupta-2817664-2025-11-11",
      "headline": "KBC 17: Watch Harsh Gujral, Abhishek Upmanyu, Anubhav Bassi, Ravi Gupta join Big B Stand-up comedians will take centre stage on the upcoming episode of 'Kaun Banega Crorepati 17'. A new promo shows Harsh Gujral, Abhishek Upmanyu, Anubhav Singh Bassi, and Ravi Gupta joining Amitabh Bachchan for a lively and humorous episode."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arshad-warsi-on-his-children-joining-bollywood-2817680-2025-11-11",
      "headline": "Arshad Warsi on his children joining Bollywood: Why would anyone bet on my son? Arshad Warsi opened up about his children's acting ambitions, asserting that nepotism doesn't guarantee success in Bollywood. He said he wouldn't use his connections to help them, adding, \"Nobody can help anybody here - you have to make your own way.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dulquer-salmaans-kaantha-lands-in-legal-trouble-ahead-of-release-2817665-2025-11-11",
      "headline": "Dulquer Salmaan's Kaantha lands in legal trouble ahead of release Just days before its scheduled release, Dulquer Salmaan's much-awaited film 'Kaantha' has landed in legal trouble. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bhagyashri-borse-thanks-team-period-drama-thriller-kaantha-14-november-2817635-2025-11-11",
      "headline": "Bhagyashri Borse calls Dulquer Salmaan Emperor of Acting Bhagyashri Borse thanks director Selvamani Selvaraj, Rana Daggubati, and Dulquer Salmaan as 'Kaantha' nears its release date, speaking openly about her experience on the project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/gatha-vaibhava-trailer-launch-kichcha-sudeep-dushyanth-ss-debut-fantasy-romance-2817495-2025-11-11",
      "headline": "Gatha Vaibhava trailer: Suni's blend of fantasy and reality keeps you guessing The trailer of 'Gatha Vaibhava', an upcoming fantasy romance film starring debutant SS Dushyanth and Ashika Ranganath, presents multiple worlds blending fantasy into reality. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nargis-fakhri-marks-14-years-of-rockstar-shares-bts-moments-with-ranbir-kapoor-2817653-2025-11-11",
      "headline": "Nargis Fakhri marks 14 years of Rockstar, shares BTS moments with Ranbir Kapoor On 'Rockstar's 14th anniversary, Nargis Fakhri shared an unseen behind-the-scenes video with Ranbir Kapoor, calling the film a journey that \"changed her life completely.\" The actor reflected on how her debut role as Heer still lives within her, even after all these years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-ssmb-29-globetrotter-teaser-launch-live-jiohotstar-2817580-2025-11-11",
      "headline": "Rajamouli's Globetrotter: Mahesh Babu's entry and more details on upcoming event SS Rajamouli's 'Globetrotter' event is currently trending across the nation for the scale at which the teaser release is being planned. Here's everything you need to know about the teaser launch event scheduled for November 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dc-crime-jimmy-olsen-leads-superman-spin-off-series-as-narrator-and-investigator-2817619-2025-11-11",
      "headline": "DC Crime: Jimmy Olsen leads Superman spin-off series as narrator and investigator DC Studios has launched 'DC Crime', a new spin-off featuring Jimmy Olsen as an investigator. The series blends true-crime style with metahuman mysteries, exploring deeper social themes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sandeep-reddy-vanga-joins-nagarjuna-and-ram-gopal-varma-to-discuss-shiva-legacy-2817611-2025-11-11",
      "headline": "Sandeep Reddy Vanga joins Nagarjuna and Ram Gopal Varma to discuss Shiva legacy As the cult classic 'Shiva' gears up for its 4K Dolby Atmos re-release, filmmaker Sandeep Reddy Vanga joins Nagarjuna and Ram Gopal Varma for a nostalgic conversation on how the film changed Indian cinema forever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-gopal-varma-praises-ram-charan-for-chikiri-song-calls-it-explosive-2817637-2025-11-11",
      "headline": "Ram Gopal Varma praises Ram Charan for Chikiri song, calls it explosive Ram Gopal Varma, known for his outspoken opinions and controversial remarks, surprised fans by showering praise on Ram Charan and Buchi Babu Sana for their latest song 'Chikiri Chikiri' from 'Peddi'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kim-kardashian-slams-psychics-after-bar-exam-setback-pathological-liars-2817573-2025-11-11",
      "headline": "Kim Kardashian slams psychics after bar exam setback: Pathological liars Kim Kardashian has criticised psychics in a new TikTok video after failing the California Bar Exam, despite predictions she would pass. The reality star earlier reflected on her legal journey and expressed her determination to continue pursuing law."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gauri-khan-making-memories-moment-with-rani-mukerji-karan-johar-2817591-2025-11-11",
      "headline": "Gauri Khan's making memories moment with Rani Mukerji, Karan Johar. Video Gauri Khan shared glimpses of her recent travels and outings with her mother Savita Chhibber, Rani Mukerji, Karan Johar, and close friends, calling it a time for \"making memories.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chinmayi-sripada-voices-concern-on-sexual-grooming-amid-jani-master-controversy-2817568-2025-11-11",
      "headline": "Chinmayi Sripada voices concern on sexual grooming amid Jani Master controversy Chinmayi Sripada expressed concern over the sexual harassment allegations against choreographer Jani Master on social media. She also reflected on consent and how the ecosystem enables abusers."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/landslide-win-for-nda-in-bihar-forecast-three-exit-polls-2817628-2025-11-11",
      "headline": "NDA to retain Bihar with bigger mandate, PK's party non-starter: Poll of exit pollsThe poll of polls projects the NDA to win 147 seats, comfortably surpassing the 122-seat majority mark in the 243-member Bihar Assembly. The India Today Group has not conducted any exit poll, and the figures are a compilation of exit poll results published by different agencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/live-updates-several-injured-as-car-goes-up-in-flames-near-red-fort-3-vehicles-catch-fire-2816884-2025-11-10",
      "headline": "Live: Al Falah University website hacked, anti-radicalisation message displayedA massive blast ripped through a Hyundai i20 near Gate No. 1 of Delhi's Red Fort Metro Station around 6:50 pm on Monday, killing ten people and leaving several others critically injured. The explosion occurred as the car halted at a red light, and agencies suspect it to be a planned terror attack, invoking the UAPA in the FIR. Forensic teams have collected 42 exhibits, including car parts and gas cylinder fragments, to determine the nature of explosives used. The NIA has formally taken over the probe as nationwide alerts remain in force. Stay tuned to indiatoday.in for all the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-tears-into-pak-pms-baseless-terror-claims-says-charges-meant-to-deflect-internal-crisis-2817755-2025-11-11",
      "headline": "False claims by delirious Pak leadership: India rejects Sharif's blast chargeThe Ministry of External Affairs reacted after Pakistan Prime Minister Shehbaz Sharif blamed India for back-to-back terror attacks in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/fact-check/story/delhi-blast-prime-suspect-umar-un-nabi-was-fired-for-patients-death-in-jk-2817688-2025-11-11",
      "headline": "Delhi blast prime suspect Umar Nabi was fired for patient's death in J&KBefore Faridabad, Dr Umar Un Nabi worked in a Jammu and Kashmir hospital. And was terminated. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/prashant-kishor-fails-to-impress-bihar-goes-nda-way-exit-polls-prediction-2817684-2025-11-11",
      "headline": "Prashant Kishor farsh par as Bihar goes NDA's way, exit polls showPrashant Kishor may have captured curiosity, but he seemed to have failed to capture votes, a compilation of major pollsters showed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/islamabad-court-bombing-pakistan-in-state-of-war-says-defence-minister-khawaja-asif-after-islamabad-court-bombing-2817466-2025-11-11",
      "headline": "Pak at war, cities now target: Minister Khwaja Asif as Islamabad blast kills 12Pakistan's Defence Minister Khawaja Asif declared the country is \"in a state of war\" after a deadly suicide bombing near Islamabad's judicial complex killed 12. He called the attack a wake-up call, warning that peace talks with Afghanistan's Taliban-led government are unrealistic amid escalating cross-border terrorism threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-ambassador-sergio-gor-sworn-in-strengthens-us-india-ties-glbs-2817782-2025-11-12",
      "headline": "Trump's pick for India, Sergio Gor, vows to take ties to 'next level'Ambassador Gor told India Today at a reception held in his honour at the Kennedy Center that both President Trump and Indian Prime Minister Narendra Modi share a \"remarkable chemistry\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jaish-e-mohammed-terror-module-jammu-kashmir-doctors-faridabad-module-delhi-red-fort-blast-2817779-2025-11-12",
      "headline": "How poster propaganda case led cops to bust white-collar terror module: TimelineA poster propaganda case in Srinagar escalated into a major inter-state terror investigation, revealing a sophisticated white-collar module with doctors linked to their Pakistani handlers. The module is in the news for its link to a car blast near Delhi's Red Fort that killed 10 people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/yunuss-worry-bengals-headache-why-nov-13-awami-protest-matters-beyond-dhaka-2817767-2025-11-11",
      "headline": "Yunus's worry, Bengal's headache: Why Nov 13 Awami protest matters beyond DhakaIf the Awami League's planned November 13 protest in Dhaka turns violent or triggers an exodus, it could directly aggravate Bengal's own volatile political atmosphere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/islamabad-court-blast-pakistan-prime-minister-pm-shehbaz-sharif-blames-india-for-suicide-attack-2817633-2025-11-11",
      "headline": "Pakistan PM jumps to blame India for Islamabad suicide blast that killed 12Within hours of the suicide blast in Islamabad in which 12 people were killed, Pakistan Prime Minister Shehbaz Sharif blamed India for it. He also alleged New Delhi's role in the attack on a cadet college in Wana on Monday, saying Afghan Taliban was acting as \"India's proxy\". Sharif's allegations came without any evidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-new-luxury-how-republic-of-nature-redefines-meaningful-living-on-ecr-2814472-2025-11-06",
      "headline": "The New Luxury: How Republic of Nature Redefines Meaningful Living on ECRDiscover how Republic of Nature by GTB Developers is reshaping Chennai's East Coast Road with design-forward homes that blend luxury, nature, and mindfulness in one of India's most refined new communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-blast-2025-red-fort-explosion-shatters-calm-reminds-of-2008-2011-terrorist-attacks-civilian-security-targets-2817482-2025-11-11",
      "headline": "How Delhi blast broke the terror patternThe deadly explosion outside Delhi's Red Fort that killed 12 people was a break from a pattern. Delhi last saw a big terror attack in 2011, 14 years ago. Monday's blast was also the biggest terror attack on a major Indian city in the last one decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/airport-divorce-the-new-trend-taking-off-on-social-media-2817326-2025-11-11",
      "headline": "Airport Divorce, the new trend taking off on social mediaTravel unravels a lot, not just about yourself, but about your partner too. And now, someone has come up with a \"divorce\" strategy to prevent relationship turbulence before you take off to make memories with your significant other. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/faridabad-hospital-radicalised-doctors-jaish-link-what-we-know-of-red-fort-blast-2817624-2025-11-11",
      "headline": "Red Fort car blast not suicide attack, bomb wasn't fully developed: SourcesIntelligence sources said that the blast near the Red Fort was not a suicide attack, as the suspect triggered the explosion in panic. The bomb was premature and not fully developed, which limited its impact, sources further revealed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-elections-second-phase-rjd-jdu-bjp-nitish-kumar-tejashwi-yadav-mahagatbandhan-voting-2817012-2025-11-11",
      "headline": "Bihar records 66.9% turnout in Phase 2, highest-ever for the stateBihar elections Phase 2: Chief Election Commissioner Gyanesh Kumar said voter turnout in Bihar's second phase reached a historic 66.9%, the highest since 1951, with women recording an unprecedented 71% participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-asim-munir-power-grab-islamabad-with-shehbaz-sharif-backed-coup-constitutional-amendment-2816891-2025-11-11",
      "headline": "Asim Munir's military coup in Pakistan, without the militaryThough Pakistan has seen coups and military dictators, the coup being staged by army chief Asim Munir is unprecedented. Through the 27th Constitutional Amendment, Munir is getting sweeping powers. The \"constitutional coup\" would dismantle Pakistan's remaining democratic safeguards and permanently alter its civil-military balance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-high-alert-bomb-attack-muhammad-yunus-grameen-bank-overnight-arson-in-dhaka-delhi-pakistan-blast-2817625-2025-11-11",
      "headline": "Bangladesh on high alert after bomb attack on Yunus' bank, arson in DhakaAhead of Bangladesh's announced election, Dhaka was rocked by a wave of bombings and arson on November 10 and 11. The Grameen Bank headquarters linked to the interim administration's chief, Muhammad Yunus, and the student-led National Citizen Party office, were attacked. The incidents have triggered a high alert across Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dr-shaheen-professor-turned-jaish-recruiter-arrested-in-terror-module-case-2817726-2025-11-11",
      "headline": "Who is Dr Shaheen, professor-turned-Jaish recruiter arrested in terror module case?A former medical college lecturer from Lucknow, Dr Shaheen Shahid, now stands accused of heading the Indian wing of Jaish-e-Mohammed's women's outfit. She is among the several doctors arrested in a terror module case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-trusts-names-neville-tata-bhaskar-bhat-as-new-trustees-report-2817724-2025-11-11",
      "headline": "Tata Trusts names Neville Tata, Bhaskar Bhat as new trustees: ReportNeville, 32, currently leads Trent's value fashion brand Zudio and serves on several other Tata Trust boards. Bhaskar Bhat, a former Titan managing director, is credited with driving the company's diversification and expansion during his tenure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/doctor-muzzamil-shakeel-arrested-faridabad-rented-room-two-months-stored-explosives-and-never-returned-delhi-police-sources-2817612-2025-11-11",
      "headline": "Arrested J&K doctor rented room for 2 months, stored explosives, never returnedDr Muzzamil Shakeel, a doctor from Faridabad's Al Falah Hospital, who was arrested after 360 kgs of explosives were found in his rented room in the city, paid a rent of Rs 2,400 for his room to store the explosives and never returned there, police sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/indians-in-canada-applicants-face-nearly-three-month-wait-visitor-visas-longest-among-all-ircc-students-2817369-2025-11-11",
      "headline": "Canada makes Indians wait longest for visitor visa, 99 days; it's 59 for PakistanisCanada's visa bottleneck has deepened for Indian nationals, with visitor visa processing now averaging 99 days and Super Visas hitting 169 days. The delays are reportedly being caused by high application volumes, country-specific checks, and resource constraints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/bollywood-legend-dharmendra-dies-aged-89-2817129-2025-11-11",
      "headline": "Dharmendra responding to treatment and is recovering: Hema MaliniVeteran actor Dharmendra is responding to treatment and is recovering, according to his family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/indian-origin-businesswoman-navkiran-dhillon-sues-london-ivf-clinic-over-stroke-vision-loss-uk-health-argc-ivig-immunotherapy-2817671-2025-11-11",
      "headline": "Indian-origin woman suffers stroke, vision loss after IVF, sues London clinicAn Indian-origin businesswoman has sued a London fertility clinic, alleging she suffered a stroke and vision loss following an intensive IVF \"bootcamp\" that included IVIg immunotherapy. Navkiran Dhillon-Byrne claimed the clinic failed to obtain proper informed consent and overstated her chances of success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/genetic-testing-for-a-certain-blood-cancer-is-free-now-across-india-2817538-2025-11-11",
      "headline": "Free genetic testing for blood cancer now in India. Here's how and whereFree genetic tests to boost access to targeted cancer care in India\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bb-19-episode-79-tanya-mittal-calls-amaal-mallik-shameless-amid-kitchen-conflict-2817780-2025-11-11",
      "headline": "BB 19 Episode 79: Tanya Mittal calls Amaal Mallik shameless amid kitchen conflictEpisode 79 of 'Bigg Boss 19' saw political warfare turn personal as Kunickaa Sadanand's all-female alliance clashed with Amaal Malik over bias. It culminated in a bitter kitchen confrontation with Tanya over basic house rules.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/iranian-actor-homayoun-ershadi-from-the-kite-runner-taste-of-cherry-dies-at-78-2817764-2025-11-11",
      "headline": "Iranian actor Homayoun Ershadi, from The Kite Runner, Taste of Cherry, dies at 78Iranian actor Homayoun Ershadi from 'The Kite Runner' died at the age of 78. He had also acted in the Iranian film 'Taste of Cherry'."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-fc-barcelona-really-want-to-go-back-camp-nou-inter-miami-2817778-2025-11-11",
      "headline": "Lionel Messi opens up on abrupt FC Barcelona departure: Really want to go back Lionel Messi has once again opened up about his deep-rooted love for FC Barcelona, admitting that he still misses the city and dreams of returning one day to live in Catalonia with his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/deepti-sharma-exclusive-womens-world-cup-life-after-new-era-2817759-2025-11-11",
      "headline": "Deepti Sharma on life after World Cup glory and women's cricket's rise: Feels surreal India's Women's World Cup hero Deepti Sharma opened up on how life has seen a sudden fame, which also marks the sport's new era. She shared how public recognition and the title win are reshaping her world and women's cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/karnataka-nurtures-future-champions-4th-mini-games-concludes-with-over-5000-young-athletes-ytvd-2817757-2025-11-11",
      "headline": "Karnataka Nurtures Future Champions: 4th Mini Games Concludes With Over 5,000 Young Athletes. The 4th Mini Karnataka Games 2025, a week-long event for under-14 athletes, has concluded in Bengaluru. Organized by the Karnataka Olympic Association, the Department of Youth Empowerment and Sports, and the Sports Authority of Karnataka, the games featured over 5,000 participants competing in 27 sports. An official stated, 'Future of our country will be relying on our young children. At this age, if we groom and then if we make them to participate in state level and national level, then they will be our products for next Olympics and Asian Games and Commonwealth Games and international championships.' The state government has also announced cash prizes for national-level medalists and job reservations for sports achievers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/venkatesh-prasad-karnataka-cricket-president-election-anil-kumble-backing-2817722-2025-11-11",
      "headline": "Venkatesh Prasad to run for Karnataka cricket president with Kumble, Srinath backing Former India fast bowler Venkatesh Prasad announced his bid for the Karnataka State Cricket Association (KSCA) president's post. His panel received strong backing from legends Anil Kumble and Javagal Srinath ahead of the November 30 elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sumit-nagal-help-china-embassy-australia-open-playoff-visa-rejected-social-media-appeal-2817719-2025-11-11",
      "headline": "Sumit Nagal seeks Chinese embassy help after visa denied for Australia Open Playoff India's top-ranked tennis player Sumit Nagal has urged Chinese authorities to review his visa rejection ahead of the Australian Open Asia-Pacific Playoff in Chengdu. The denial has cast doubt over his participation in the crucial event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-spin-practice-india-test-bavuma-leads-proteas-attack-kolkata-2817706-2025-11-11",
      "headline": "South Africa show attacking intent against spin in nets to prepare for Kolkata Test IND vs SA, 1st Test: Buoyed by their series-levelling win over Pakistan, South Africa began training in India with an aggressive focus on countering spin ahead of the opening Test starting Friday. With Temba Bavuma returning as captain, the Proteas looked upbeat in nets, though top-order consistency and selection reshuffles remain key concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-1st-test-pitch-kolkata-curator-eden-gardens-2817677-2025-11-11",
      "headline": "India asked for spin-friendly pitch at Eden Gardens, reveals Kolkata curator IND vs SA, 1st Test: In an interview with India Today, Kolkata pitch curator Sujan Mukherjee discussed the nature of the Eden Gardens surface ahead of the series opener between India and South Africa on November 14, addressing whether the pitch will favour spin."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/atp-finals-turin-cardiac-arrests-two-spectators-die-2817669-2025-11-11",
      "headline": "Two fans die due to cardiac arrest on second day of ATP Finals in Turin Two spectators, aged 70 and 78, tragically died of cardiac arrests on the second day of the ATP Finals in Turin despite prompt medical intervention. The FITP and ATP paid condolences following the passing of two spectators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-eden-gardens-pitch-1st-test-sujan-mukherjee-exclusive-2817661-2025-11-11",
      "headline": "Spin-friendly pitch? Eden curator reveals talk with coach Gambhir before 1st Test India vs South Africa: With India wary of rank turners after last year's 0-3 defeat to New Zealand, Eden Gardens curator Sujan Mukherjee has promised a sporting pitch for the opener. The surface is expected to offer bounce early and gradual turn later, keeping both pacers and spinners interested across five days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-century-drought-equals-virat-kohli-record-sri-lanka-odi-opener-2817636-2025-11-11",
      "headline": "800 days and counting: Babar Azam equals Virat Kohli as wait for century prolongs Babar Azam's century drought stretched to 800 days as he was dismissed for 29 in the ODI series opener against Sri Lanka. The Pakistan skipper showed flashes of class early on but was ultimately outfoxed, leaving his wait for a hundred to continue after 83 innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-1st-test-pitch-kolkata-curator-eden-gardens-2817677-2025-11-11",
      "headline": "India asked for spin-friendly pitch at Eden Gardens, reveals Kolkata curator IND vs SA, 1st Test: In an interview with India Today, Kolkata pitch curator Sujan Mukherjee discussed the nature of the Eden Gardens surface ahead of the series opener between India and South Africa on November 14, addressing whether the pitch will favour spin."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/atp-finals-turin-cardiac-arrests-two-spectators-die-2817669-2025-11-11",
      "headline": "Two fans die due to cardiac arrest on second day of ATP Finals in Turin Two spectators, aged 70 and 78, tragically died of cardiac arrests on the second day of the ATP Finals in Turin despite prompt medical intervention. The FITP and ATP paid condolences following the passing of two spectators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-eden-gardens-pitch-1st-test-sujan-mukherjee-exclusive-2817661-2025-11-11",
      "headline": "Spin-friendly pitch? Eden curator reveals talk with coach Gambhir before 1st Test India vs South Africa: With India wary of rank turners after last year's 0-3 defeat to New Zealand, Eden Gardens curator Sujan Mukherjee has promised a sporting pitch for the opener. The surface is expected to offer bounce early and gradual turn later, keeping both pacers and spinners interested across five days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-century-drought-equals-virat-kohli-record-sri-lanka-odi-opener-2817636-2025-11-11",
      "headline": "800 days and counting: Babar Azam equals Virat Kohli as wait for century prolongs Babar Azam's century drought stretched to 800 days as he was dismissed for 29 in the ODI series opener against Sri Lanka. The Pakistan skipper showed flashes of class early on but was ultimately outfoxed, leaving his wait for a hundred to continue after 83 innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-visit-hyderabad-confirmed-telengana-cm-revnath-reddy-new-poster-confirmed-2817620-2025-11-11",
      "headline": "Lionel Messi to visit Hyderabad in December: Telanagan CM confirms with new posterLionel Messi will visit Hyderabad on December 13, 2025, as part of his 'GOAT Tour to India 2025'. Telangana CM Revanth Reddy confirmed the news by unveiling an official poster announcing the football legend's arrival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-abu-dhabi-december-date-sources-2817614-2025-11-11",
      "headline": "IPL 2026 auction to be held in Abu Dhabi on 15 or 16th December: SourcesThe Indian Premier League (IPL) auction is heading back to the Gulf, with Abu Dhabi set to host the upcoming IPL 2026 mini-auction in mid-December, sources told India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-spin-attack-stifles-ireland-first-day-sylhet-test-2817579-2025-11-11",
      "headline": "Bangladesh bounce back to stifle Ireland with spinners in Sylhet TestBangladesh staged a strong comeback to restrict Ireland after the visitors made a promising start. Paul Stirling and debutant Cade Carmichael built a solid foundation, but Mehidy Hasan Miraz and Hasan Murad triggered a middle-order collapse. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anvay-dravid-selected-india-u19-b-squad-bengaluru-tri-series-2817592-2025-11-11",
      "headline": "Anvay Dravid, named in India U-19 B squad for Afghanistan tri-series in BengaluruAnvay Dravid, son of Rahul Dravid, has been named in India's Under-19 B squad for the upcoming tri-series in Bengaluru. He continues to rise up the ranks in youth-level cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-shubman-gill-optional-session-kolkata-eden-gardens-2817513-2025-11-11",
      "headline": "After quiet Aus tour, Shubman Gill sweats in optional session before Kolkata TestIndia vs South Africa: Captain Shubman Gill led from the front in an optional training session at Eden Gardens on Tuesday. The star batter spent 90 minutes in the nets, taking on both spin and pace in the lead-up to the series opener on 14 November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaheen-afridi-appointed-pakistan-odi-captain-after-rizwan-steps-down-2817487-2025-11-11",
      "headline": "Shaheen Shah Afridi: I became Pakistan captain only after Rizwan decided to resignPAK vs SL: Shaheen Shah Afridi revealed that he became Pakistan's ODI captain only after Mohammad Rizwan voluntarily stepped down from the role, following discussions between them and the PCB."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/venkatesh-iyer-kkr-overpirces-release-aaron-finch-ipl-2026-auction-retention-2817484-2025-11-11",
      "headline": "KKR should release overpriced Venkatesh Iyer, buy him for lower price: Aaron FinchAaron Finch believes Kolkata Knight Riders (KKR) should part ways with Venkatesh Iyer ahead of the IPL 2026 auction, suggesting that the all-rounder's steep Rs 23.75 crore price tag no longer reflects his performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/naseem-shah-ancestral-home-attacked-lower-dir-pacer-stays-sri-lanka-odi-2817471-2025-11-11",
      "headline": "Pakistan pacer Naseem Shah's ancestral home attacked with gunshots, none harmedUnknown assailants fired at the gate of Pakistan pacer Naseem Shah's ancestral home in Khyber Pakhtunkhwa, but with no injuries reported, he chose to stay with the team for the ODI against Sri Lanka as police investigate the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-shubman-gill-optional-session-kolkata-eden-gardens-2817513-2025-11-11",
      "headline": "After quiet Aus tour, Shubman Gill sweats in optional session before Kolkata TestIndia vs South Africa: Captain Shubman Gill led from the front in an optional training session at Eden Gardens on Tuesday. The star batter spent 90 minutes in the nets, taking on both spin and pace in the lead-up to the series opener on 14 November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaheen-afridi-appointed-pakistan-odi-captain-after-rizwan-steps-down-2817487-2025-11-11",
      "headline": "Shaheen Shah Afridi: I became Pakistan captain only after Rizwan decided to resignPAK vs SL: Shaheen Shah Afridi revealed that he became Pakistan's ODI captain only after Mohammad Rizwan voluntarily stepped down from the role, following discussions between them and the PCB."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/venkatesh-iyer-kkr-overpirces-release-aaron-finch-ipl-2026-auction-retention-2817484-2025-11-11",
      "headline": "KKR should release overpriced Venkatesh Iyer, buy him for lower price: Aaron FinchAaron Finch believes Kolkata Knight Riders (KKR) should part ways with Venkatesh Iyer ahead of the IPL 2026 auction, suggesting that the all-rounder's steep Rs 23.75 crore price tag no longer reflects his performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/naseem-shah-ancestral-home-attacked-lower-dir-pacer-stays-sri-lanka-odi-2817471-2025-11-11",
      "headline": "Pakistan pacer Naseem Shah's ancestral home attacked with gunshots, none harmedUnknown assailants fired at the gate of Pakistan pacer Naseem Shah's ancestral home in Khyber Pakhtunkhwa, but with no injuries reported, he chose to stay with the team for the ODI against Sri Lanka as police investigate the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-ashes-marcus-trescothick-cricket-fast-australian-pitches-joe-root-form-2817410-2025-11-11",
      "headline": "England will enjoy bouncy Australian pitches, suits our style: Marcus TrescothickAssistant coach Marcus Trescothick said England are confident of thriving on Australia's fast, bouncy pitches in the upcoming Ashes, believing the conditions will suit their aggressive style of play. He also backed Joe Root to shine in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ian-botham-warns-england-limited-ashes-warm-up-matches-australia-2817403-2025-11-11",
      "headline": "Ian Botham slams England's Ashes build-up: Not the way I would prepareIan Botham has questioned England's decision to play just one internal match in Australia before the start of the Ashes, warning that the visitors could arrive underprepared for one of cricket's toughest challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-beast-mode-training-ashes-duckett-england-australia-test-series-2817382-2025-11-11",
      "headline": "Ben Stokes in beast mode: Ben Duckett fires strong warning to Australia for AshesLeft-handed batter Ben Duckett has praised captain Ben Stokes' intense preparation ahead of the Ashes, calling him \"crucial\" to England's chances of ending their 14-year wait for a Test series win in Australia.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-mumbai-indians-possible-retentions-auction-strategy-deepak-chahar-2817044-2025-11-11",
      "headline": "IPL 2026 retention prediction: Will Mumbai Indians release Deepak Chahar?As the Mumbai Indians gear up for IPL 2026, they will look to fix several glaring weaknesses in their squad ahead of the mini-auction. Can they bet on Deepak Chahar for another season after a poor show in 2025? Here is a probable list of players the five-time champions might retain on the deadline day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-australian-tabloid-joe-root-ben-stokes-headlines-reaction-2817330-2025-11-11",
      "headline": "Australian tabloid calls Joe Root Average Joe: Ashes banter or disrespect?The Australian media has launched sharp verbal attacks on England's Joe Root and Ben Stokes ahead of the Ashes Test series, starting November 21. Australia are favourites to beat England in the much-awaited five-Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/ons-jabeur-pregnancy-announcement-maternity-break-tennis-comeback-2817334-2025-11-11",
      "headline": "Former World No.2 Ons Jabeur announces pregnancy with husband Karim KamounFormer World No. 2 Ons Jabeur has announced that she is expecting her first child with husband Karim Kamoun and will be taking a break from tennis to focus on her well-being. Daria Kasatkina, Belinda Bencic, Barbora Krejcikova and other tennis stars congratulated Jabeur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-1-backed-atiqa-mir-makes-history-first-indian-female-karting-pole-sitter-2817317-2025-11-11",
      "headline": "Atiqa Mir continues meteoric rise, secures historic pole, podium in COTFA seriesAt just ten years old, Atiqa Mir made history as the first female driver to secure pole position in the COTFA Mini class, marking a significant milestone for Indian motorsport with Formula 1 support. She converted her pole into a heat victory and finished third in the final, highlighting her consistency and composure under pressure."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}