{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/kristin-cabot-resigns-from-astronomer-after-viral-coldplay-kiss-cam-scandal-glbs-2760932-2025-07-25",
      "headline": "Kristin Cabot, Astronomer HR head, resigns after viral Coldplay kiss-cam scandalAstronomer's HR chief Kristin Cabot resigned after being caught on a Coldplay \"kiss cam\" with CEO Andy Byron, who also stepped down amid the viral scandal and public backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sunder-pichai-net-worth-hits-usd-1-billion-alphabet-shares-rise-quarterly-results-google-ceo-money-salary-2760915-2025-07-25",
      "headline": "Billionaire behind your browser: Sundar Pichai's net worth crosses $1 billionAlphabet stock has returned around 120% to investors since 2023 and is now trading close to its all-time high. This has benefited top executives, including Sundar Pichai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-uk-free-trade-deal-how-the-deal-could-boost-bilateral-trade-2760706-2025-07-24",
      "headline": "India-UK free trade deal: How the deal could boost bilateral tradeThe deal is expected to provide greater market access for Indian products and services, while UK companies, particularly in sectors like automobiles and medical equipment, will also benefit from reduced tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-some-purchases-are-priceless-startup-founder-shyam-achuthan-on-spending-and-living-well-2760739-2025-07-24",
      "headline": "Why some purchases are priceless: Startup founder on spending and living wellWe often treat money decisions like maths problems, but this startup founder says some buys, like a family car or your own home, bring wealth you can't count."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pm-modi-in-uk-for-fta-cheaper-scotch-and-cars-on-cards-2760695-2025-07-24",
      "headline": "PM Modi in UK for FTA: Cheaper scotch and cars on cardsPrime Minister Narendra Modi is in the UK for a meeting with the UK Prime Minister and is also expected to meet King Charles III, with the India-UK Free Trade Agreement (FTA) being the main focus. This agreement is set to provide significant market access to Indian sectors like fisheries, textiles, gems, jewellery, and leather, with a potential market size of $5.2 billion in the UK for the fisheries sector alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/money-matters-but-joy-matters-more-edelweiss-mutual-fund-radhika-gupta-mantra-for-life-2760708-2025-07-24",
      "headline": "Money matters, but joy matters more: Edelweiss' Radhika Gupta's mantra for lifeMany young earners feel constant pressure to save every rupee for the future. It's common to hear advice about building a fat retirement fund or aiming for the highest returns. But Radhika Gupta wants people to know that money is only useful if it also makes your present better."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/textile-exports-leather-goods-engineering-software-indias-economy-benefit-uk-trade-deal-pm-modi-2760679-2025-07-24",
      "headline": "Whisky, chocolates, cars: What gets cheaper for Indians after UK trade dealThe trade agreement was signed by India's Commerce Minister Piyush Goyal and the UK's Secretary of State for Business and Trade, Jonathan Reynolds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-542-points-lower-nifty-below-25100-as-volatility-weighs-heavy-2760677-2025-07-24",
      "headline": "Sensex ends 542 points lower, Nifty below 25,100 as volatility weighs heavyThe S&P BSE Sensex ended 542.47 points lower at 82,184.17, while the NSE Nifty50 declined 157.80 points to close at 25,062.10. Selling pressure was visible across sectors, with FMCG, IT, and financial stocks dragging the indices down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/small-shopkeepers-are-turning-away-from-upi-payments-2760642-2025-07-24",
      "headline": "Small shopkeepers are turning away from UPI paymentsAccording to the National Payments Corporation of India (NPCI), UPI saw over 14.04 billion transactions in June 2024. Yet, for many at the grassroots, the system seems too complex and risky to fully embrace. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/anil-ambani-ed-raid-today-reliance-power-infra-shares-down-5-percent-loan-fraud-2760636-2025-07-24",
      "headline": "ED raids hit Anil Ambani stocks: Reliance Power, Infra sink 5%Reliance Infrastructure has lost 9.37% in the past five trading sessions, Reliance Power has fallen by 7.41% during the same period. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filed-the-wrong-itr-form-heres-how-to-fix-it-to-avoid-penalty-2760613-2025-07-24",
      "headline": "Filed the wrong ITR form? Here's how to fix it to avoid penaltyMany taxpayers only spot mistakes after hitting 'Submit'. Filing the wrong form can snowball into bigger headaches later, from refund delays to unexpected penalties. But tax experts say you do have ways to set things right, provided you act quickly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-over-500-points-why-stock-market-is-down-today-2760574-2025-07-24",
      "headline": "Sensex plunges 600 points. Why is the stock market down today?The S&P BSE Sensex dropped 592.85 points to 82,133.79 by 1:04 pm, while the NSE Nifty50 fell 169.25 points to 25,050.65. All broader market indices were in the red as market sentiment weakened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-now-on-digilocker-see-how-it-helps-you-pension-account-pf-balance-2760554-2025-07-24",
      "headline": "EPFO now on DigiLocker: See how it helps youThe government has been making several digital changes for EPFO members in the last few months. This new feature on DigiLocker is another step to make your provident fund details more accessible. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-raid-today-why-reason-loan-bribery-rs-3000-crore-fraud-sbi-sebi-2760549-2025-07-24",
      "headline": "Loan, lies and bribery? Why Anil Ambani is facing ED heatMultiple agencies, including the National Housing Bank, the Securities and Exchange Board of India (Sebi), the National Financial Reporting Authority (NFRA), and Bank of Baroda shared findings and inputs that contributed to the investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-whats-on-the-table-in-the-landmark-usd-34-billion-deal-2760546-2025-07-24",
      "headline": "India-UK FTA: What's on the table in landmark $34 billion deal?For Indian businesses, the FTA opens up wider access to British markets by slashing tariffs and easing compliance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-penalty-for-missed-income-tax-deadlines-panel-suggests-in-new-income-tax-bill-2025-2760516-2025-07-24",
      "headline": "No penalty for missed income tax deadlines? Panel suggests in New Tax BillThe suggestions come from the Select Committee, which has studied the new Income Tax Bill, 2025. This new Bill is meant to replace the old Income Tax Act of 1961."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ed-conducts-raids-on-properties-linked-to-anil-ambani-in-mumbai-2760503-2025-07-24",
      "headline": "ED conducts raids on properties linked to Anil Ambani in MumbaiThe Enforcement Directorate (ED) on Thursday carried out searches at multiple locations in Mumbai connected to industrialist Anil Ambani's companies, days after the State Bank of India (SBI) classified Reliance Communications and Ambani himself as 'fraud'. While his personal residence wasn't searched, ED teams from Delhi and Mumbai targeted premises tied to Reliance Anil Ambani Group (RAAGA) companies in connection with an ongoing money laundering investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/iex-share-price-plunges-20-today-whats-behind-the-fall-2760496-2025-07-24",
      "headline": "IEX share price crashes 23% to hit 52-week low. What's behind the fall?IEX shares nosedived after CERC announced phased implementation of market coupling. The move aims to centralise price discovery, challenging IEX's dominance. Investors await clarity from the company's Q1FY26 results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enforcement-directorate-raids-anil-ambani-linked-premises-in-mumbai-days-after-sbi-declared-him-fraud-2760489-2025-07-24",
      "headline": "ED raids Anil Ambani-linked premises in Mumbai days after SBI's 'fraud' tagWhile Anil Ambani's personal residence was not part of the search operation, the ED teams from Delhi and Mumbai visited premises tied to some of his group companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-ipo-check-key-dates-issue-size-and-other-key-details-2760481-2025-07-24",
      "headline": "NSDL IPO: Check key dates, issue size and other key detailsThe NSDL IPO will open on July 30 and close on August 1, offering 5.01 crore shares through an offer for sale by existing institutional shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-share-price-down-q1-results-buy-sell-hold-review-expert-outlook-price-target-2760467-2025-07-24",
      "headline": "Infosys shares down 1% despite good Q1 results. Should you buy, hold, or sell?Infosys posted a consolidated net profit of Rs 6,921 crore for the June quarter, up 8.7% compared to the same period last year. The revenue grew by 7.5% year-on-year to Rs 42,279 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/investment-advisor-on-whatsapp-telegram-stock-tip-groups-scam-2760465-2025-07-24",
      "headline": "Investment advisor explains how 'free' stock tip groups scam peopleThe investment advisor explains how so-called \"free\" stock tip groups on WhatsApp and Telegram are duping thousands of unsuspecting retail investors, all under the guise of financial advice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-44-points-lower-nifty-below-25300-tata-motors-up-1-percent-2760439-2025-07-24",
      "headline": "Sensex opens 44 points lower, Nifty below 25,300; Tata Motors up 1%The S&P BSE Sensex was down by 122.46 points to 82,604.18, while the NSE Nifty50 lost 14.95 points to 25,204.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-donald-trump-pm-modi-tariff-export-duties-2760432-2025-07-24",
      "headline": "India-US trade deal still pending: Is Trump asking for too much?In the last few weeks, the US has signed several trade agreements with countries such as Vietnam, Indonesia, the Philippines and Japan. But a deal with India remains out of reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-uk-visit-trade-deal-tariff-import-tax-keir-starmer-eu-piyush-goyal-trump-us-2760419-2025-07-24",
      "headline": "PM Modi UK visit: All you need to know about India-UK trade deal on the cardsThe free trade agreement will be India's first major bilateral trade deal with a developed country in over 10 years. It is also the most important trade deal the UK has signed since leaving the European Union."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-house-bank-loan-emi-burden-expert-explains-drawabacks-2760148-2025-07-23",
      "headline": "Explained: Why buying flats on hefty EMIs may not be wiseAs returns from residential real estate continue to underwhelm, financial advisors are urging Indians to rethink the emotional appeal of homeownership and consider smarter, more flexible investment avenues for long-term wealth creation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-aspiration-to-achievement-paytms-operational-discipline-powers-profitability-2760125-2025-07-23",
      "headline": "From aspiration to achievement: Paytm's operational discipline powers profitabilityThe new stock pricing implies that the Noida-based firm will be valued at 63-times of FY27-ended earnings. This revised valuation reflects the brokerage's positive view of Paytm's structural profitability journey, operating leverage, and robust performance in its core business segments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-540-points-nifty-settles-above-25200-tata-motors-bharti-airtel-rally-over-2-2760104-2025-07-23",
      "headline": "Sensex up 540 points, Nifty tops 25,200; Tata Motors, Airtel gain over 2%The S&P BSE Sensex rose 539.83 points to 82,726.64 at the closing bell, while the NSE Nifty50 settled 159 points higher at 25,219.90. Most of the broader market indices also gained during the trading session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ed-files-rs-1654-crore-case-against-myntra-over-fdi-violations-2760042-2025-07-23",
      "headline": "ED files Rs 1,654-crore case against Myntra over FDI violationsThe investigation comes at a time when e-commerce firms operating in India, particularly those backed by foreign investment, are facing increasing regulatory scrutiny for allegedly bypassing FDI rules through complex business arrangements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/indiqube-spaces-ipo-review-skip-subscribe-latest-gmp-listing-date-allotment-price-band-2760007-2025-07-23",
      "headline": "Indiqube Spaces IPO: Should you invest? Check GMP and review by expertsIndiqube Spaces is aiming to raise Rs 700 crore through this IPO. The issue includes a fresh issue of 2.74 crore shares worth Rs 650 crore and an offer for sale of 21 lakh shares valued at Rs 50 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mumbais-luxury-real-estate-market-hits-rs-14750-crore-sales-2759986-2025-07-23",
      "headline": "Mumbai's luxury real estate market hits Rs 14,750 crore salesEven as affordability worsens for the middle class, Mumbai's luxury real estate market continues to soar, fuelled by billionaires, upgraders and a fresh pipeline of designer residences in coveted neighbourhoods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sri-lotus-developers-ipo-review-shah-rukh-khan-amitabh-bachchan-bollywood-celebrities-2759947-2025-07-23",
      "headline": "SRK and Big B back this IPO: All you need to know about Sri Lotus DevelopersOther celebrities, including Hrithik Roshan, Ajay Devgn, Ektaa Kapoor, Sara Ali Khan, Tiger Shroff, and Rajkummar Rao have also invested in the firm as per reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ca-abhishek-walia-explains-why-timing-your-investments-matters-as-much-as-diversifying-2759920-2025-07-23",
      "headline": "CA explains why timing your investments matters as much as diversifyingCA explains that good investing isn't just about picking the right assets, it's about planning for the right moments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paytm-posts-rs-123-crore-profit-in-q1-is-it-a-good-time-to-buy-the-stock-2759902-2025-07-23",
      "headline": "Paytm posts Rs 123 crore profit in Q1: Is it a good time to buy the stock?Paytm's Q1 profit signals a turning point, but long-term sustainability hinges on regulatory clarity, competitive strength, and consistent execution across payments and lending. Investors must weigh promise against real-world pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/deepinder-goyal-net-worth-rs-2000-crore-rise-eternal-shares-rise-record-high-2759886-2025-07-23",
      "headline": "Deepinder Goyal adds Rs 2,000 crore as Eternal shares hit record highShares of Eternal jumped over 21% in the last 48 hours, hitting a new record high of Rs 311.60 on the NSE on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-over-200-points-up-nifty-above-25100-infosys-gains-1-2759880-2025-07-23",
      "headline": "Sensex, Nifty open higher after US-Japan trade deal; Tata Motors leads gainsThe S&P BSE Sensex was up by 201.98 points to 82,388.09, while the NSE Nifty50 gained 63 points to 25,123.90 as of 9:27 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-july-23-us-japan-trade-deal-15-percent-tariff-2759869-2025-07-23",
      "headline": "Will US-Japan trade deal weigh in on Sensex, Nifty today?Gift Nifty futures were trading at 25,181.50 as of 8:30 am, indicating that the Nifty 50 may open above Tuesday's close of 25,060.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-mainboard-market-dalal-street-rs-258-lakh-crore-primary-market-2759861-2025-07-23",
      "headline": "IPO season heating up with Rs 2.58 lakh crore in queue: Is Dalal Street ready?After a steady first half, the second half of 2025 is expected to be packed with major public issues.  In July alone, 11 mainboard IPOs have either been listed or are set to launch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/astronomer-ceo-quit-why-kristin-cabot-was-not-fired-over-coldplay-kiss-cam-scandal-2759715-2025-07-22",
      "headline": "CEO quits, HR head stays: Why Astronomer didn't fire Kristin Cabot over kiss cam rowAstronomer CEO Andy Byron resigned after a viral kiss cam video showed him and HR head Kristin Cabot cuddling at a Coldplay concert, sparking public backlash. While Cabot remains employed, legal experts say contractual obligations and internal investigations likely explain the delay in any action against her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-posts-rs-123-crore-profit-in-q1fy26-strengthens-lead-in-merchant-payments-2759667-2025-07-22",
      "headline": "Paytm posts Rs 123 crore profit in Q1FY26, strengthens lead in merchant paymentsOperating revenue rises 28% YoY; contribution profit up 52% as AI-led efficiencies and financial services boost bottom line."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sarzameen-review-ibrahim-ali-khan-kajol-prithviraj-sukumaran-film-forgets-sar-loses-zameen-still-thinks-it-patriotic-2760917-2025-07-25",
      "headline": "Sarzameen review: A film that forgets Sar, loses Zameen, still thinks it's patrioticRelease Date:Fri Jul 25, 2025Sarzameen movie review: In this Ibrahim Ali Khan, Kajol and Prithviraj Sukumaran-starrer, neither the patriotism lands nor the emotional family drama connects. What you get instead is a hollow story trying hard to feel important."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-netflix-this-weekend-july-25-mandala-murders-the-sandman-season-2-2760502-2025-07-25",
      "headline": "Top films and shows to watch on Netflix this weekendNetflix's new weekend lineup caters to a diverse audience base. From intense crime-dramas to spine-chilling horror as well as fantasy and comedy genres, there is a mix of various themes in this weekend's releases which appeals to all viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-jiohotstar-this-weekend-sarzameen-the-society-ronth-2760916-2025-07-25",
      "headline": "Top films and shows to watch on JioHotstar this weekendFrom thrillers to crime dramas and reality series, here's what you can watch on JioHotstar this weekend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-lisa-debuts-netflix-show-hitmakers-rejects-rough-tracks-2760807-2025-07-24",
      "headline": "Blackpink's Lisa debuts on Netflix's Hitmakers, rejects rough tracksAfter much excitement, Lisa makes her Netflix debut on 'Hitmakers'. Twelve producers present original songs to her, but only one track wins her approval. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shaan-grover-mahesh-dalle-memes-after-saiyaara-was-initially-disturbed-2760808-2025-07-24",
      "headline": "Shaan Grover on 'Mahesh Dalle' memes after Saiyaara: Was initially disturbedActor Shaan Grover, in an exclusive conversation with IndiaToday.in, spoke about the criticism he received for his role in 'Saiyaara'. The film stars Ahaan Panday and Aneet Padda in the lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-babla-mehta-known-as-voice-of-mukesh-dies-in-mumbai-2760726-2025-07-24",
      "headline": "Singer Babla Mehta, known as Voice of Mukesh, dies in MumbaiSinger Babla Mehta, known as the Voice of Mukesh, died on July 22 in Mumbai. He also sang alongside legendary singer Late Lata Mangeskar in the film 'Chandni'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shweta-tripathi-10-years-masaan-legacy-vicky-kaushal-neeraj-ghaywan-richa-chadha-2760714-2025-07-24",
      "headline": "As Masaan turns 10, Shweta Tripathi discusses why it's relevance will never fadeShweta Tripathi, in an exclusive interview with IndiaToday.in, spoke about her debut film 'Masaan' as it completed a decade today. The actor opened up about the timeless social relevance of the Neeraj Ghaywan-directorial, and how the movie continues to hold a special place in her heart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-season-3-episode-3-belly-conrad-jeremiah-2760657-2025-07-24",
      "headline": "The Summer I Turned Pretty just got ringed and entered its villain eraThe latest episode of The Summer I Turned Pretty is here and everybody is talking about it. Jeremiah proposes to Belly and everything turns into chaos, here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fauda-season-5-trailer-doron-faces-trauma-terror-hamas-attack-2760734-2025-07-24",
      "headline": "Fauda 5 trailer: After Hamas attack, Doron faces new threats and inner demonsThe trailer for the Israeli show 'Fauda' Season 5 is finally out. The new season will showcase a storyline two years after the Hamas-led attack on Israel on October 7, 2023, and the outbreak of the Swords of Iron war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/saiyaara-7-questions-for-mohit-suri-box-office-success-criticism-originality-ahaan-panday-aneet-padda-2760697-2025-07-24",
      "headline": "Saiyaara: 7 questions we want to ask Mohit Suri after watching Ahaan-Aneet's film'Saiyaara' has struck a chord with audiences, earning Rs 150 crore at the box office. However, the film faces criticism for its lack of originality and unrealistic portrayal of Alzheimer's disease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/10-years-of-masaan-film-that-gave-a-brilliantly-restrained-actor-like-vicky-kaushal-2760626-2025-07-24",
      "headline": "10 years of Masaan, film that gave a brilliantly restrained actor like Vicky KaushalActor Vicky Kaushal's 'Masaan' marked ten years on July 24, 2025. The film has received immense praise for its performances and grounded storytelling. IndiaToday.in shares insights on how the film elevated Vicky Kaushal's brilliance as a restrained actor.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vicky-kaushal-celebrates-10-years-of-masaan-so-much-to-learn-grow-2760710-2025-07-24",
      "headline": "Vicky Kaushal celebrates 10 years of Masaan: So much to learn, to growVicky Kaushal clocked 10 years of his iconic debut film 'Masaan' on Thursday. As the film turned a decade old, the actor reflected on his growth and learnings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-honours-sandeep-vanga-fire-and-fearlessness-as-saiyaara-stirs-hearts-2760693-2025-07-24",
      "headline": "Mohit Suri honours Sandeep Vanga's fire and fearlessness as Saiyaara stirs heartsAs 'Saiyaara' soars to success, director Mohit Suri dedicates a special note to fellow filmmaker Sandeep Reddy Vanga for supporting his film publicly even before its release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nushrratt-bharuccha-on-sexism-in-bollywood-hero-vanity-van-nicer-than-mine-2760547-2025-07-24",
      "headline": "Nushrratt Bharuccha on sexism in Bollywood: Hero's vanity van nicer than mineActor Nushrratt Bharuccha recalled instances of sexism and inequality in Bollywood. She stated in a recent interview that there have been times when she sought permission to use the hero's vanity van because they are nicer than hers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bad-girl-teaser-varsha-bharath-vetri-maaran-removed-from-youtube-minor-portrayal-problem-2760682-2025-07-24",
      "headline": "Vetri Maaran's Bad Girl teaser removed from YouTube over minor portrayal problemThe Madras High Court has ordered the removal of the 'Bad Girl' film teaser from social media due to concerns of inappropriate portrayal of minors, classifying it as child pornography."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-tara-sutaria-old-photo-resurfaces-sparks-buzz-around-love-life-2760689-2025-07-24",
      "headline": "Did Ahaan Panday-Tara Sutaria date each other? Their old pic sparks buzzAhaan Panday's debut in Mohit Suri's 'Saiyaara' has drawn attention, but a resurfaced teenage photo with Tara Sutaria has sparked fresh rumours of a past romance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/selena-gomez-only-murders-in-the-building-season-5-release-date-announced-2760539-2025-07-24",
      "headline": "Selena Gomez's Only Murders 5 release date announced: When and where to watchSinger-actor Selena Gomez's 'Only Murders In The Building' is all set for the release of its 5th season. Here's everything about the release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sacha-baron-cohen-flaunts-six-pack-for-marvel-role-thanks-ozempic-2760582-2025-07-24",
      "headline": "Sacha Baron Cohen flaunts six-pack for Marvel role, thanks OzempicActor Sacha Baron Cohen posted his Men's Fitness UK cover on Instagram on Wednesday. He revealed his sculpted physique in a series of shirtless photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mareesan-review-fahadh-faasil-vaduvelu-road-trip-takes-wrong-turn-post-interval-2760648-2025-07-24",
      "headline": "Maareesan review: Fahadh-Vadivelu's road trip takes wrong turn post-intervalRelease Date:Fri Jul 25, 2025Maareesan movie review: Director Sudheesh Sankar's 'Maareesan', starring Vadivelu and Fahadh Faasil, is a comedy thriller. While the film wows you with a brilliant first half, it takes a formulaic turn in the second half."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/textile-exports-leather-goods-engineering-software-indias-economy-benefit-uk-trade-deal-pm-modi-2760679-2025-07-24",
      "headline": "Whisky, chocolates, cars: What gets cheaper for Indians after UK trade dealThe trade agreement was signed by India's Commerce Minister Piyush Goyal and the UK's Secretary of State for Business and Trade, Jonathan Reynolds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-hulk-hogan-dies-71-cardiac-arrest-wrestling-2760845-2025-07-24",
      "headline": "WWE great Hulk Hogan dies at 71 due to cardiac arrestLegendary American wrestler Hulk Hogan died due to cardiac arrest, aged 71, on Thursday, WWE confirmed on Thursday. Hogan helped World Wrestling Entertainment catapult into mainstream popularity in the 1980s. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-ahmedabad-crash-pilots-called-in-sick-aviation-ministry-2760704-2025-07-24",
      "headline": "Days after Air India Ahmedabad crash, 112 pilots called in sickMinister of State for Civil Aviation Murlidhar Mohol said that out of the total pilots who asked for leave on June 16, 61 were senior pilots and the rest 51 were flight officers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/kristin-cabot-resigns-from-astronomer-after-viral-coldplay-kiss-cam-scandal-glbs-2760932-2025-07-25",
      "headline": "Kristin Cabot, Astronomer HR head, resigns after viral Coldplay kiss-cam scandalAstronomer's HR chief Kristin Cabot resigned days after being caught on a Coldplay kiss-cam with CEO Andy Byron, who also stepped down earlier amid the viral scandal and public backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-president-donald-trump-said-that-he-wants-elon-musk-and-all-business-in-the-us-to-thrive-2760809-2025-07-24",
      "headline": "I want Elon...: Trump walks back on threats to Musk, won't slash subsidiesIn this social media post, US President Donald Trump said that he wants Musk and all other businesses within the US to thrive. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/there-is-no-alternative-macron-says-france-will-recognize-palestine-as-a-state-glbs-2760926-2025-07-25",
      "headline": "France will recognise Palestine as a state, says Macron; draws Israel's ireEmmanuel Macron announced that France will officially recognise the State of Palestine, a move he plans to formalise at the UN General Assembly in September. In response, Israeli Prime Minister Netanyahu criticised the decision, while Palestinian leaders welcomed France's support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-4th-test-day-2-rishabh-pant-fight-indian-bowlers-manchester-2760878-2025-07-24",
      "headline": "Manchester Test: Indian bowlers fail to back up Pant's fight with fractured toeManchester Test, Day 2: Rishabh Pant showed great courage batting with a fractured toe to push India's total past 350. However, India's bowling unit failed to contain England as they reduced the deficit significantly by stumps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/dont-bother-we-can-use-english-words-pm-tells-translator-struggling-with-hindi-2760732-2025-07-24",
      "headline": "Don't bother, we can use English words: PM to translator struggling with HindiPrime Minister Narendra Modi told the translator, who struggled with Hindi during British Prime Minister Keir Starmer's speech, to use English words in between."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sunder-pichai-net-worth-hits-usd-1-billion-alphabet-shares-rise-quarterly-results-google-ceo-money-salary-2760915-2025-07-25",
      "headline": "Billionaire behind your browser: Sundar Pichai's net worth crosses $1 billionAlphabet stock has returned around 120% to investors since 2023 and is now trading close to its all-time high. This has benefited top executives, including Sundar Pichai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/after-india-uk-trade-deal-signed-pm-modi-meets-king-charles-2760852-2025-07-24",
      "headline": "PM Modi meets King Charles at Sandringham House, gifts him tree saplingPM Modi met King Charles III at Sandringham House the United Kingdom after India and UK signed the free trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-shows-lack-of-desire-to-reach-ceasefire-says-witkoff-as-us-israel-exit-peace-talks-glbs-2760920-2025-07-25",
      "headline": "Hamas shows no desire for ceasefire, says Witkoff as US, Israel exit peace talksHamas has been insisting on a full Israeli withdrawal from Gaza and a complete end to the war before releasing all hostages. Meanwhile, Israel refuses to end the conflict unless Hamas gives up its weapons and control over Gaza — a demand Hamas rejects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bhopal/story/bhopal-drug-bust-unveils-exploitation-network-targeting-girls-at-gym-colleges-2760848-2025-07-24",
      "headline": "Bhopal drug bust unveils exploitation network targeting girls at gym, collegesDuring the investigation, police recovered several videos from one of the accused's phones showing young women being drugged and sexually assaulted, uncovering a more sinister operation than first suspected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/hulk-hogan-death-john-cena-triple-h-ric-flair-tribute-2760911-2025-07-25",
      "headline": "Hulk Hogan dies: Cena, Triple H and wrestling world mourn death of WWE legendJohn Cena, Triple H and the wrestling world paid their tributes to Hulk Hogan after the WWE Hall Of Famer passed away on Thursday, July 24. Hogan leaves behind a rich legacy as one of the greatest of all time in wrestling history. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/varanasi-doctor-recorded-extorted-by-grindr-date-after-hotel-meet-loses-rs-8-lakh-2760906-2025-07-25",
      "headline": "Varanasi doctor extorted by man he met on queer dating app, loses Rs 8 lakhThe doctor came into contact with an individual using the profile name \"luking4mature\" on the Grindr app, and after a brief exchange of messages, the person introduced himself as Vikas. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/neil-hopper-fraud-charges-cornwall-surgeon-limb-removal-case-2760828-2025-07-24",
      "headline": "UK surgeon amputated both legs, faked sepsis for Rs 5.5 crore insuranceDr Neil Hopper falsely claimed he had lost his legs to sepsis in an attempt to claim GBP 235,622 (Rs 2.75 crore) from one insurer and GBP 231,031 (Rs 2.7 crore) from another."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-express-mid-air-birth-muscat-mumbai-flight-crew-assist-2760804-2025-07-24",
      "headline": "Baby born mid-air on Air India Express Muscat-Mumbai flight, crew assists deliveryWhen a Thai national went into labour, the crew swiftly ensured a secure environment for the birth. The cabin crew, trained for such emergencies, rose to the occasion and assisted with the delivery, receiving timely help from a nurse who was also on board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/china-open-badminton-pv-sindhu-fan-unnati-hooda-profile-2760812-2025-07-24",
      "headline": "Who is Unnati Hooda? 17-year-old PV Sindhu fan who just stunned her idolChina Open 2025: At 17, Unnati Hooda clinched the biggest win of her career when she defeated PV Sindhu in the pre-quarterfinals of the Super 1000 tournament on Thursday. The Haryana shuttler, a fan of Sindhu, is starting to make waves at the highest level. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ghaziabad-fake-embassy-where-are-4-micronations-of-con-diplomat-harshvardhan-jain-2760790-2025-07-24",
      "headline": "Ghaziabad fake embassy: Where are 4 'micronations' of con-diplomat?On paper, these so-called micronations have everything a modern state is made of: sovereignty, land, citizens, currency, flag and constitution. On the ground: just some signboards.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/democratic-newsroom/video/language-war-should-hindi-be-the-link-language-democratic-newsroom-debates-2760811-2025-07-24",
      "headline": "Language war: Should Hindi be the link language? Democratic Newsroom debatesIn this edition of Democratic Newsroom, the focus is on the raging language war over Hindi. The discussion explores linguistic pluralism versus the push for uniformity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/koneru-humpy-reaches-final-faces-divya-deshmukh-all-indian-womens-world-cup-2760871-2025-07-24",
      "headline": "Koneru Humpy sets up historic all-Indian Women's World Cup final vs Divya DeshmukhGrandmaster Koneru Humpy advanced to the final of the FIDE Women's World Cup after a thrilling tiebreak victory over China's Lei Tingjie. She will face 19-year-old Divya Deshmukh in the first-ever all-Indian final. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/harshvardhan-jain-fake-embassy-loan-fraud-stf-fake-companies-2760930-2025-07-25",
      "headline": "Not just fake embassy, 'Ladonia envoy' formed an East India Company as wellUP STF has revealed that Harshvardhan Jain set up fake companies abroad for money laundering. Between 2008 and 2011, his associate Ehsaan Ali Syed fraudulently secured loans worth £70 million.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/navi-mumbai-student-beaten-marathi-wedding-invitation-card-2760936-2025-07-25",
      "headline": "Student beaten in Mumbai over distributing wedding invitation card in MarathiA college student in Navi Mumbai was allegedly beaten for distributing a wedding invite in Marathi. The incident sparked political outrage, with the Maharashtra Navnirman Sena demanding strict action.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ahmedabad-engineer-builds-grenade-drone-gati-get-army-order-2760933-2025-07-25",
      "headline": "Ahmedabad techie builds automated grenade detonation drone, Army orders 20 unitsEngineer Keshavkant Sharma from Ahmedabad created 'Gati', a drone that automates grenade detonation and returns safely. After successful trials, the Indian Army placed an order for over 20 units.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-impact-feature/story/chuck-mangione-smooth-jazz-maestro-behind-feels-so-good-dies-at-84-glbs-2760946-2025-07-25",
      "headline": "Chuck Mangione, smooth jazz maestro behind 'Feels So Good,' dies at 84Jazz legend Chuck Mangione, famed for \"Feels So Good,\" died at 84. Known for his flugelhorn mastery and crossover hits, he left a lasting legacy in music and pop culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-netflix-this-weekend-july-25-mandala-murders-the-sandman-season-2-2760502-2025-07-25",
      "headline": "Top films and shows to watch on Netflix this weekendNetflix's new weekend lineup caters to a diverse audience base. From intense crime-dramas to spine-chilling horror as well as fantasy and comedy genres, there is a mix of various themes in this weekend's releases which appeals to all viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-jiohotstar-this-weekend-sarzameen-the-society-ronth-2760916-2025-07-25",
      "headline": "Top films and shows to watch on JioHotstar this weekendFrom thrillers to crime dramas and reality series, here's what you can watch on JioHotstar this weekend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shaan-grover-mahesh-dalle-memes-after-saiyaara-was-initially-disturbed-2760808-2025-07-24",
      "headline": "Shaan Grover on 'Mahesh Dalle' memes after Saiyaara: Was initially disturbedActor Shaan Grover, in an exclusive conversation with IndiaToday.in, spoke about the criticism he received for his role in 'Saiyaara'. The film stars Ahaan Panday and Aneet Padda in the lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-season-3-episode-3-belly-conrad-jeremiah-2760657-2025-07-24",
      "headline": "The Summer I Turned Pretty just got ringed and entered its villain eraThe latest episode of The Summer I Turned Pretty is here and everybody is talking about it. Jeremiah proposes to Belly and everything turns into chaos, here's why."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pants-pain-bearing-capacity-is-immense-shardul-thakur-2760919-2025-07-25",
      "headline": "Rishabh Pant's pain-bearing capacity is high, spirit unmatched: Shardul ThakurIndia all-rounder Shardul Thakur hailed Rishabh Pant for his immense pain-bearing capacity as the wicketkeeper-batter battled through a toe fracture to bat for the team during the fourth Test at Old Trafford in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-manchester-test-injury-substitutes-system-drs-2760922-2025-07-25",
      "headline": "DRS: Should cricket introduce a substitutes for injuries after Pant's episode?Rishabh Pant braved the pain to come out and bat for India on Day 2 of the Manchester Test after suffering a broken toe. While Pant won hearts with his bravery, was it a move that was necessary? Could we have a system where a substitute for a seriously injured player can be brought in to maintain the balance between both sides? In the latest edition of India Today's Democratic Review System, we discuss if substitutes are needed in cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/hulk-hogan-death-john-cena-triple-h-ric-flair-tribute-2760911-2025-07-25",
      "headline": "Hulk Hogan dies: Cena, Triple H and wrestling world mourn death of WWE legendJohn Cena, Triple H and the wrestling world paid their tributes to Hulk Hogan after the WWE Hall Of Famer passed away on Thursday, July 24. Hogan leaves behind a rich legacy as one of the greatest of all time in wrestling history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-slams-41-ball-century-vs-england-champions-in-wcl-2760907-2025-07-25",
      "headline": "AB de Villiers goes berserk, slams 41-ball century vs England Champions in WCLSouth Africa Champions captain AB de Villiers clobbered a 41-ball hundred during Match 8 of the World Championship of Legends (WCL) against England Champions and guided them to a 10-wicket win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-4th-test-day-2-rishabh-pant-fight-indian-bowlers-manchester-2760878-2025-07-24",
      "headline": "Manchester Test: Indian bowlers fail to back up Pant's fight with fractured toeManchester Test, Day 2: Rishabh Pant showed great courage batting with a fractured toe to push India's total past 350. However, India's bowling unit failed to contain England as they reduced the deficit significantly by stumps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-6th-t20i-report-tim-seifert-ish-sodhi-2760876-2025-07-24",
      "headline": "Seifert, Rachin and Sodhi help New Zealand thump Zimbabwe before finalTim Seifert and Ish Sodhi starred as New Zealand defeated Zimbabwe by 60 runs in the tri-series. The win keeps New Zealand unbeaten and gain momentum ahead of their final against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/koneru-humpy-reaches-final-faces-divya-deshmukh-all-indian-womens-world-cup-2760871-2025-07-24",
      "headline": "Koneru Humpy sets up historic all-Indian Women's World Cup final vs Divya DeshmukhGrandmaster Koneru Humpy advanced to the final of the FIDE Women's World Cup after a thrilling tiebreak victory over China's Lei Tingjie. She will face 19-year-old Divya Deshmukh in the first-ever all-Indian final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-pakistan-3rd-t20i-score-shahibzada-farhan-2760867-2025-07-24",
      "headline": "Pakistan avoid embarrassing clean sweep in Bangladesh, win 3rd T20I in DhakaBAN vs PAK, 3rd T20I: Pakistan rode on a quick-fire 63 from Sahibzada Farhan and an all-round bowling effort to hammer Bangladesh by 74 runs and avoid a clean sweep in Dhaka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-resumption-aiff-kalyan-chaubey-new-india-coach-2760858-2025-07-24",
      "headline": "ISL will take place this year, new India coach in 10 days: Kalyan ChaubeyAll India Football Federation president Kalyan Chaubey has assured that the Indian Super League will take place this year. The AIFF chief also said that the new India coach will be announced in 10 days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-hulk-hogan-dies-71-cardiac-arrest-wrestling-2760845-2025-07-24",
      "headline": "WWE great Hulk Hogan dies at 71 due to cardiac arrestLegendary American wrestler Hulk Hogan died due to cardiac arrest, aged 71, on Thursday, WWE confirmed on Thursday. Hogan helped World Wrestling Entertainment catapult into mainstream popularity in the 1980s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/china-open-badminton-pv-sindhu-fan-unnati-hooda-profile-2760812-2025-07-24",
      "headline": "Who is Unnati Hooda? 17-year-old PV Sindhu fan who just stunned her idolChina Open 2025: At 17, Unnati Hooda clinched the biggest win of her career when she defeated PV Sindhu in the pre-quarterfinals of the Super 1000 tournament on Thursday. The Haryana shuttler, a fan of Sindhu, is starting to make waves at the highest level. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/koneru-humpy-reaches-final-faces-divya-deshmukh-all-indian-womens-world-cup-2760871-2025-07-24",
      "headline": "Koneru Humpy sets up historic all-Indian Women's World Cup final vs Divya DeshmukhGrandmaster Koneru Humpy advanced to the final of the FIDE Women's World Cup after a thrilling tiebreak victory over China's Lei Tingjie. She will face 19-year-old Divya Deshmukh in the first-ever all-Indian final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-pakistan-3rd-t20i-score-shahibzada-farhan-2760867-2025-07-24",
      "headline": "Pakistan avoid embarrassing clean sweep in Bangladesh, win 3rd T20I in DhakaBAN vs PAK, 3rd T20I: Pakistan rode on a quick-fire 63 from Sahibzada Farhan and an all-round bowling effort to hammer Bangladesh by 74 runs and avoid a clean sweep in Dhaka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-resumption-aiff-kalyan-chaubey-new-india-coach-2760858-2025-07-24",
      "headline": "ISL will take place this year, new India coach in 10 days: Kalyan ChaubeyAll India Football Federation president Kalyan Chaubey has assured that the Indian Super League will take place this year. The AIFF chief also said that the new India coach will be announced in 10 days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-hulk-hogan-dies-71-cardiac-arrest-wrestling-2760845-2025-07-24",
      "headline": "WWE great Hulk Hogan dies at 71 due to cardiac arrestLegendary American wrestler Hulk Hogan died due to cardiac arrest, aged 71, on Thursday, WWE confirmed on Thursday. Hogan helped World Wrestling Entertainment catapult into mainstream popularity in the 1980s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/china-open-badminton-pv-sindhu-fan-unnati-hooda-profile-2760812-2025-07-24",
      "headline": "Who is Unnati Hooda? 17-year-old PV Sindhu fan who just stunned her idolChina Open 2025: At 17, Unnati Hooda clinched the biggest win of her career when she defeated PV Sindhu in the pre-quarterfinals of the Super 1000 tournament on Thursday. The Haryana shuttler, a fan of Sindhu, is starting to make waves at the highest level. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}