{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-accuses-kia-of-tax-evasion-in-vw-like-dispute-report-2675260-2025-02-05",
      "headline": "Government accuses Kia of tax evasion in VW-like dispute: ReportKia competes with Hyundai and Maruti Suzuki in the world's third-largest auto market, where it has a share of 6% of roughly 4 million units a year, and its Kia Seltos and Sonet SUVs are among the top sellers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-end-lower-as-consumer-shares-fall-rupee-drops-2675234-2025-02-05",
      "headline": "Sensex, Nifty end lower as consumer stocks weigh; rupee dropsShare Market: The S&P BSE Sensex was down 312.53 points to 78,271.28 at the closing bell, while the NSE Nifty50 settled 42.95 points lower at 23,696.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/openai-sam-altman-meets-with-it-minister-ashwini-vaishnaw-to-discuss-india-ai-roadmap-2675222-2025-02-05",
      "headline": "OpenAI's Sam Altman meets with IT minister to discuss India's AI roadmapIn a post on X, Ashwini Vaishnaw said he had a \"super cool discussion\" with Altman on India's \"strategy of creating the entire AI stack - GPUs, model, and apps\" and that OpenAI was willing to collaborate on all three."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-regime-relief-capital-gains-tax-rs-12-lakh-does-it-apply-2675212-2025-02-05",
      "headline": "Will Rs 12 lakh income qualify for zero tax even with capital gains?The biggest announcement was that individuals earning up to Rs 12 lakh would not have to pay any tax. But does this still apply if you have additional income from capital gains? Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quick-commerce-zepto-delivering-cars-now-skoda-kylaq-new-teaser-sparks-buzz-february-8-2675195-2025-02-05",
      "headline": "Zepto delivering cars now? Skoda's new teaser sparks buzzWhile the teaser does not confirm the exact details, it suggests that Skoda cars could soon be purchased through Zepto."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arbitrator-may-decide-who-controls-ratan-tatas-fortune-report-2675159-2025-02-05",
      "headline": "Arbitrator may decide who controls Ratan Tata's fortune: ReportRatan Tata had set up two entities in 2022 to manage his personal wealth for charitable purposes—the RTEF under Section 8 of the Companies Act 2013 and the Ratan Tata Endowment Trust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/services-sector-growth-slows-to-more-than-2-year-low-in-january-2675132-2025-02-05",
      "headline": "Services sector growth slows to more than 2-year low in JanuaryDemand for services rose at the slowest pace in 14 months but remained sturdy. It was supported by international demand that was the strongest in five months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-us-tarifff-trade-war-actions-impact-all-factors-explained-2675093-2025-02-05",
      "headline": "Explained: Is China playing it safe in latest trade war with US? US-China trade war: China's countermeasures appear more restrained compared to its approach during the previous trade war. This has raised a key question: Is China playing it safe in the latest trade standoff with the US?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reasons-behind-itc-hotels-delisting-from-sensex-and-bse-what-you-need-to-know-2675060-2025-02-05",
      "headline": "ITC Hotels to be dropped from Sensex, BSE indices today. Here's why ITC Hotels shares opened at Rs 188 per share on the BSE and Rs 180 per share on the NSE at a discount of over 30% compared to the discovered price of Rs 260 on the NSE and Rs 270 on the BSE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-flat-as-rbi-policy-meet-kicks-off-fmcg-stocks-fall-2675037-2025-02-05",
      "headline": "Sensex, Nifty open flat as RBI policy meet kicks off; FMCG stocks fallShare Market Today: The S&P BSE Sensex was down by 14.87 points to 78,568.94, while the NSE Nifty50 added 30.40 points to 23,769.65 as of 9:28 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-starts-today-will-new-governor-sanjay-malhotra-cut-rates-decision-february-7-2675029-2025-02-05",
      "headline": "RBI MPC meeting starts today: Will new Governor Sanjay Malhotra cut rates?RBI MPC Meeting 2025: The repo rate has been unchanged at 6.5% since February 2023, and the last rate cut was announced during the Covid-19 pandemic in May 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-expectations-bull-run-on-dalal-street-will-the-stock-market-rally-last-2675023-2025-02-05",
      "headline": "Bull run on Dalal Street: Will the stock market rally last? Share market today: The stock market saw a bull run in the last session with the benchmark indices, Sensex and Nifty, both closing over 1.5% higher, driven by gains in banking and financial stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tatas-milennial-friend-shantanu-naidu-gets-top-role-at-tata-motors-2675017-2025-02-05",
      "headline": "Ratan Tata's millennial friend Shantanu Naidu gets top role at Tata MotorsIn 2018, Shantanu Naidu began working as Ratan Tata's assistant, a role that brought him public attention, especially after a viral video of his birthday surprise for the industrialist.\r\n "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/p-chidambaram-on-budget-2025-gst-cut-would-have-benefited-everybody-2674953-2025-02-04",
      "headline": "P Chidambaram on Budget 2025: 'GST cut would have benefited everybody'Former Finance Minister P Chidambaram analysed Nirmala Sitharaman's Budget 2025, criticising its focus on tax cuts for a small segment of the population."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/finance-minister-nirmala-sitharaman-says-gst-council-to-decide-on-fewer-lower-tax-rates-soon-2674903-2025-02-04",
      "headline": "GST Council to decide on fewer, lower tax rates soon: Nirmala SitharamanFinance Minister Nirmala Sitharaman stated on Tuesday that the GST Council is close to finalising a decision on tax rate rationalisation, with the review process nearly complete. At present, the Goods and Services Tax (GST) is structured into four slabs: 5 per cent, 12 per cent, 18 per cent, and 28 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-to-get-a-student-credit-card-check-eligibility-and-documents-required-2674860-2025-02-04",
      "headline": "How to get a student credit card? Check eligibility and documents requiredWhile the credit card can be a valuable financial tool, students must be aware of its potential misuse and pitfalls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/i-will-think-about-india-nirmala-sitharaman-as-trump-2-0-goes-big-on-crypto-2674644-2025-02-04",
      "headline": "I will think about India: Nirmala Sitharaman as Trump 2.0 goes big on cryptoFinance Minister Nirmala Sitharaman said that the government during its G20 presidency pushed for a global understanding of crypto regulations and how to tackle trading in cryptocurrencies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-stock-market-rally-sensex-jumps-1397-points-nifty-nears-23750-as-bulls-take-charge-2674640-2025-02-04",
      "headline": "Market rally: Sensex jumps 1,397 points, Nifty nears 23,750 as bulls take chargeStock Market: The S&P BSE Sensex surged by 1397.07 points to close at 78,583.81, while the NSE Nifty50 added 378.20 points to end at 23,739.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/exclusive-nirmala-sitharaman-on-budget-2025-tax-relief-for-citizens-2674621-2025-02-04",
      "headline": "Exclusive: Nirmala Sitharaman on Budget 2025 tax relief for citizensFinance Minister Nirmala Sitharaman stated that the tax relief introduced in Budget 2025 reflects Prime Minister Narendra Modi's commitment to honouring taxpayers for their contribution to nation-building."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-hindenburg-went-after-adani-group-founder-nathan-anderson-breaks-silence-2674623-2025-02-04",
      "headline": "Why did Hindenburg go after Adani Group? Nathan Anderson breaks silenceHindenburg Research founder Nathan Anderson maintained that all the firm's reports, including the one on Adani Group, were accurate. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-on-ott-when-and-where-to-watch-sanya-malhotra-hindi-remake-of-great-indian-kitchen-stmp-2675365-2025-02-05",
      "headline": "Mrs on OTT: When and where to watch Sanya Malhotra's filmSanya Malhotra's Mrs, the Hindi remake of The Great Indian Kitchen, will release on Zee5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kapil-sharma-says-coldplay-wanted-to-appear-on-his-show-sent-his-team-a-mail-2675358-2025-02-05",
      "headline": "Kapil Sharma says Coldplay reached out to appear on his showKapil Sharma recently revealed that British band Coldplay expressed their desire to take part in his show. The band was in India as part of their Music of Spheres tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aamir-ali-on-finding-love-again-staying-private-after-divorce-dating-ankita-kukreja-2675310-2025-02-05",
      "headline": "Aamir Ali opens up finding love again, staying private after divorceAamir Ali shared insights on finding love again after his divorce from Sanjeeda Shaikh. He talked about his emotional journey and staying private about his personal life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/celebrity-masterchef-review-farah-khan-tejasswi-prakash-2675267-2025-02-05",
      "headline": "Too many celebs spoil the broth: Why Celebrity MasterChef is not palatableWhile Celebrity MasterChef offers entertainment, it lacks the raw authenticity that made the original MasterChef format so compelling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-meets-ar-rahman-new-pic-sparks-collaboration-rumours-2675203-2025-02-05",
      "headline": "Ed Sheeran meets AR Rahman, sparks collaboration rumoursEd Sheeran and AR Rahman shared a picture together, sparking collaboration rumours. Fans are excited about the possibility of a joint musical project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-recruit-season-2-review-noah-centineo-teo-yoo-2675194-2025-02-05",
      "headline": "The Recruit S2 review: Teo Yoo steals the show in this Noah Centineo seriesReleased-Fri Jan 31, 2025The Recruit Season 2 sees Noah Centineo's Owen Hendricks embark on a new mission in South Korea. The season introduces Teo Yoo as Jung Kyung, who steals the spotlight with his flawless performance. Read more about how this season fared."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/blackpink-lisa-shares-release-date-of-white-lotus-season-3-2675179-2025-02-05",
      "headline": "Blackpink's Lisa shares release date of White Lotus Season 3. WatchThe release date of the highly-anticipated White Lotus Season 3 is here. The HBO show will begin streaming from this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mufasa-the-lion-king-to-stream-ott-february-on-rent-disney-plus-hotstar-2675172-2025-02-05",
      "headline": "Mufasa: The Lion King to stream on OTT from February, but here's the catchMufasa: The Lion King is set to stream on Disney+ Hotstar from February 18. The musical film will be available to stream on Video-on-demand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/vincenzo-actor-ok-taec-yeon-proposes-to-girlfriend-in-front-eiffel-tower-paris-2675097-2025-02-05",
      "headline": "Vincenzo actor Ok Taec-yeon's agency responds to rumoured proposal picturesImages of Ok Taec-yeon proposing to his girlfriend sparked rumours online. His agency clarified these images are not proposal pictures and urged fans to rely on official news."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/medical-dreams-ott-sharman-joshi-tvf-show-on-neet-aspirants-2675078-2025-02-05",
      "headline": "Medical Dreams on OTT: When, where to watch Sharman Joshi's show on NEET aspirantsMedical Dreams, a new TVF show headlined by Sharman Joshi, premiered on February 4. Revolving around the lives of NEET aspirants, the series is streaming on YouTube. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/arjun-kapoor-bhumi-pednekar-and-rakul-preet-singh-mere-husband-ki-biwi-ott-release-stmp-2675053-2025-02-05",
      "headline": "Mere Husband Ki Biwi on OTT: When and where to watch Arjun, Rakul, Bhumi's filmArjun Kapoor, Bhumi Pednekar, and Rakul Preet Singh's upcoming romantic comedy Mere Husband Ki Biwi will hit theatres on February 21. The film is touted to stream on Disney+ Hotstar after its theatrical release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-defends-bianca-censori-grammys-nude-outfit-most-googled-person-2675056-2025-02-05",
      "headline": "Kanye West defends wife amid row over 'nude' outfit: We beat the GrammiesRapper Kanye West shared his first statement after his unexpected appearance with wife Bianca Censori at the 67th Grammys. Bianca's sheer dress, almost giving the illusion of nudity on the red carpet, drew criticism from all across. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ive-empathy-review-a-sonic-and-musical-evolution-of-the-k-pop-group-2675032-2025-02-05",
      "headline": "IVE Empathy review: A sonic and musical evolution of the K-pop groupIVE embarks on a new journey with their 3rd EP 'IVE EMPATHY', expanding their musical themes to embrace empathy. The album highlights the group's evolving artistry and global appeal, marking another milestone in their impressive career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-removes-karla-sofia-gascon-emilia-perez-oscar-campaign-controversial-posts-zoe-saldana-2675013-2025-02-05",
      "headline": "Netflix removes Karla Sofia Gascon from Oscar campaign after controversial postsEmilia Perez actor Karla Sofia Gascon has been removed from Netflix's Oscar campaign for the film. This comes following backlash over her controversial posts in the past. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-gets-a-head-massage-in-chennai-video-2674929-2025-02-04",
      "headline": "Ed Sheeran gets a head massage in Chennai, jokes 'it's abuse'. WatchSinger Ed Sheeran is currently in India. On Tuesday, the British singing sensation shared a fun video of himself getting a head massage in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-mantis-to-genie-make-a-wish-netflix-k-drama-slate-2025-2674899-2025-02-04",
      "headline": "Squid Game 3, Mantis to Genie Make a Wish: Netflix unveils 2025 K-drama slateNetflix unveiled the 2025 slate of its upcoming K-dramas and films. From Squid Game 3, Mantis to Genie Make a Wish, here's what all you can watch on the OTT site."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/nadaaniyan-introducing-the-parents-of-khushi-kapoor-and-ibrahim-ali-khan-2674908-2025-02-04",
      "headline": "Nadaaniyan: Introducing the parents of Khushi Kapoor and Ibrahim Ali KhanThe official social media handle of Karan Johar's Dharmatic Entertainment has shared photos of the core Nadaaniyan team. It stars Khushi Kapoor and Ibrahim Ali Khan in the lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vivekanandan-viralanu-shine-tom-chacko-swasika-stmp-2674672-2025-02-04",
      "headline": "Vivekanandan Viralanu: Here's where you can watch the Tom Chacko releaseMalayalam actors Shine Tom Chacko and Swasika's Vivekanandan Viralanu will soon be available to stream on an OTT platform. The announcement was shared by makers on social media recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/boman-irani-on-the-mehta-boys-vs-animal-debate-2674619-2025-02-04",
      "headline": "Boman Irani on The Mehta Boys vs Animal debate: Not every father-son film is sameActor Boman Irani, who is all set to make his directorial debut with The Mehta Boys, reacts to Animal comparisons, stating not all father-son films are alike. Avinash Tiwary jokes that theirs offers the real family drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sarah-michelle-gellar-to-star-in-buffy-the-vampire-slayer-sequel-2674579-2025-02-04",
      "headline": "Sarah Michelle Gellar to star in Buffy the Vampire Slayer sequel: ReportActor Sarah Michelle Gellar will reportedly be reprising her role as Buffy Summers for Buffy the Vampire Slayer's sequel on Hulu. Chloe Zhao is in talks to direct the show. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-assembly-elections-exit-polls-matrize-cvoter-peoples-pulse-pmark-bjp-win-prediction-aap-congress-arvind-kejriwal-narendra-2675346-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP comeback in Delhi after 27 years, predict exit polls, big setback for AAP  Live UpdatesDelhi exit poll results: A majority of exit polls have predicted that the BJP would break its losing streak in Delhi and stop the juggernaut of the AAP, which was eyeing a third term in the national capital.\r\n\r\n election outcome will determine whether the AAP continues its dominance, the BJP breaks its losing streak, or Congress makes a surprising comeback."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/us-military-plane-illegal-indian-immigrants-lands-amritsar-texas-donald-trump-border-crackdown-2675167-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US military plane carrying 104 illegal Indian immigrants lands in AmritsarPolice and civil administration officials were at the airport to receive the 104 illegal immigrants comprising 79 men and 25 women.  An official from the US Embassy was also present. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/verified-nuclear-peace-deal-iran-us-israel-smithereens-exaggerated-donald-trump-2675284-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Reports that US-Israel will blow Iran into smithereens exaggerated: TrumpAmid Israeli Prime Minister Benjamin Netanyahu's visit to the US, President Donald Trump has refuted reports suggesting that Washington is working in cahoots with the Jewish nation to \"blow Iran into smithereens\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-press-conference-nagpur-hitman-reporter-question-india-vs-england-2675345-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What kind of question is that? Rohit Sharma stunned by reporter's 'Hitman' jibeRohit Sharma was stumped by a bouncer in the press conference in Nagpur on Wednesday. Rohit did not appreciate the jibe-like undertone of a question about his form ahead of the ODI series against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/how-social-media-made-investing-cool-for-young-indians-2674618-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How social media made investing 'cool' for young IndiansA recent report shows that 93 per cent of young adults actively save money, with a significant portion allocating 20–30 per cent of their monthly earnings towards future financial goals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-assembly-election-2025-exit-polls-live-updates-aap-bjp-congress-arvind-kejriwal-pm-modi-rahul-gandhi-2675266-2025-02-05?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "BJP's lotus to bloom, setback for AAP in Delhi, predict exit pollsDelhi Election Exit Poll Result 2025 Live: Polling for the 70-member Delhi Assembly took place today, witnessing a sluggish start before voters turned out in large numbers to decide the city's next government. The AAP, led by Arvind Kejriwal, is vying for a third consecutive term, while the BJP and the Congress are aiming to regain lost ground. Key battleground constituencies such as New Delhi, Kalkaji, and Jangpura have emerged as high-stakes contests. Vote counting is scheduled for February 8, but exit polls may provide early indications of the possible outcome. However, as history has shown, exit poll data should be taken with a pinch of salt. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-usaid-funded-pakistan-ngo-link-to-terrorist-organisation-lashkar-e-taiba-let-falahs-e-insaniat-2675197-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hafiz Saeed's LeT kept bleeding India, USAID kept funding itOver half of American international funding is channelled through USAID, which is in US President Donald Trump's crosshairs. Despite red flags, USAID ended up funding the Pakistan-based Falah-e-Insaniat Foundation (FIF), a front for Hafiz Saeed-led Lashkar-e-Taiba (LeT). USAID funded the FIF and LeT, which led multiple terror attacks in India, despite it being banned by the US government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-virendra-sachdeva-arvind-kejriwal-party-aapda-jibe-delhi-elections-exit-poll-result-2675363-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'AAP-da is leaving': Delhi BJP chief after exit polls favour party sweepA majority of exit polls showed a BJP victory in the Delhi Assembly polls. Reacting to the exit polls forecast, BJP leader Virendraa Sachdeva said that the people of Delhi want a corruption-free government in the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/kerala-man-applied-for-zomato-chief-of-staff-role-did-not-get-through-his-experience-2675353-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kerala man applied for Zomato Chief of Staff role, didn't get through. His experienceThe Kerala man's post came after Zomato CEO Deepinder Goyal shared a hiring update regarding the Chief of Staff role.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/a-celebration-of-rohit-bals-legacy-at-blenders-pride-fashion-tour-2025-2673256-2025-02-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "A Celebration of Rohit Bal's Legacy at Blenders Pride Fashion Tour 2025A grand celebration of Rohit Bal's iconic work at Blenders Pride Fashion Tour brought together his closest friends, industry icons, and admirers in an unforgettable evening honouring his legacy and artistic brilliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-umpires-nitin-menon-not-going-pakistan-2675288-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Only Indian umpire in ICC elite panel decides against travelling to PakistanIndian umpire Nitin Menon has pulled out of the upcoming Champions Trophy 2025, set to be held in Pakistan and Dubai. BCCI sources suggest that Menon decided against travelling to Pakistan for personal reasons."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/ttd-takes-action-against-18-non-hindu-employees-br-naidu-tirupati-2675199-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Transfer or retire: Tirupati temple board removes 18 non-Hindu employeesTirumala Tirupati Devasthanams (TTD) has taken action against 18 employees for practicing non-Hindu religious activities, violating the board's rule that staff must adhere to Hindu traditions. They are offered the option to transfer to other departments or take VRS."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-invites-deepika-padukone-to-be-first-customer-at-her-manali-restaurant-2675296-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kangana invites Deepika Padukone to be first customer at her Manali restaurantKangana Ranaut invited Deepika Padukone to be her first customer at her new restaurant, The Mountain Story, in Manali. The restaurant opens on February 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-assembly-election-2025-voting-polling-aap-arvind-kejriwal-congress-bjp-narendra-modi-rahul-gandhi-2674994-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AAP, BJP trade barbs alleging poll code violation; nearly 58% voting till 5 pmDelhi is voting today in a fierce three-way battle between the ruling AAP, BJP and Congress. AAP is eyeing a third consecutive term while the BJP aims to reclaim power after 27 years. The Congress, wiped off in the last two elections, is eyeing a comeback."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/technology/news/story/dont-use-ai-tools-like-chatgpt-and-deepseek-indian-finance-ministry-tells-its-employees-2675205-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Don't use AI tools like ChatGPT and DeepSeek, Finance Ministry tells employees India's finance ministry has advised its employees to avoid using AI tools like ChatGPT and DeepSeek for official work to avoid risking data confidentiality. This advisory comes ahead of OpenAI chief Sam Altman's scheduled visit to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-prayagraj-holy-dip-maha-kumbh-prayagraj-2675073-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi takes holy dip in Sangam at Maha Kumbh, performs aartiMaha Kumbh 2025: PM Modi performed the ritual bath, offered prayers and is likely to address a gathering and talk about nation-building."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-fort-william-kolkata-named-after-why-it-needed-renaming-vijay-durg-modi-decolonise-explained-2675215-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who was Fort William in Kolkata named after, and why it needed renamingFort William in Kolkata, the headquarters of the Indian Army's Eastern Command, has been renamed Vijay Durg. The fort was originally named after a monarch who played a crucial role in the rise and spread of Protestant Christianity in Europe. Its renaming is a tribute to Chattrapati Shivaji, an icon of nationalism and resistance in Indian history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-occupied-kashmir-anti-india-event-hamas-jaish-lashkar-terrorists-attend-2675283-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "In a 1st, Hamas part of terror meet in PoK attended by Jaish, Lashkar leadersHamas, a Palestinian terror outfit that was recently involved in a war with Israel, has largely kept its activities limited to the Middle East. Its participation in a Pakistan-backed conference signals growing links with Pakistan-based terror outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/after-calling-india-ai-efforts-hopeless-sam-altman-now-says-india-should-be-a-leader-in-ai-2675130-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "OpenAI CEO Sam Altman says India should be a leader in AIOpenAI CEO Sam Altman, who previously dismissed India's ability to develop large-scale AI models, has now said the country should play a leading role in artificial intelligence. Here is the full story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uniform-civil-code-in-uttarakhand-live-in-relationship-registered-in-the-state-in-first-10-days-2675235-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "One live-in relationship registered under Uttarakhand Civil Code so farA total of five applications have been received from live-in couples for the mandatory registration. One has been granted registration while four others are being verified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/road-to-us-visa-h1b-l1-work-visa-temples-hanuman-ganesha-ahmedabad-chilkur-hyderabad-delhi-punjab-telangana-2674645-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Visa Hanuman is so sought after these days Across India, \"visa temples\" attract people aspiring to work and live abroad. From Gujarat's Visa Hanuman to Punjab's Hawaijahaj (Aeroplane) Gurdwara, places of worship are seeing a rush of devotees amid the uncertainty over the H-1B visa programme and hiring uncertainties in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/vijay-mallya-karnataka-high-court-banks-debt-recovery-kingfisher-airlines-loan-default-2675207-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vijay Mallya approaches court, says banks recovered debt multiple times overVijay Mallya, in his petition before the Karnataka High Court, sought directions to the banks to provide an account statement of the recovered amount in the Kingfisher Airlines loan default case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-says-us-will-take-over-gaza-strip-we-will-develop-we-will-own-it-2675004-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US will take over Gaza: Trump's shock announcement with Netanyahu by his sideUS President Donald Trump said that the US will take over and develop Gaza, asserting long-term ownership, while Israeli Prime Minister Benjamin Netanyahu called it a historic idea that could reshape Gaza's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-regime-relief-capital-gains-tax-rs-12-lakh-does-it-apply-2675212-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will Rs 12 lakh income qualify for zero tax even with capital gains?The biggest announcement was that individuals earning up to Rs 12 lakh would not have to pay any tax. But does this still apply if you have additional income from capital gains? Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-wishes-love-and-light-to-husband-abhishek-bachchan-on-his-49th-birthday-see-post-2675373-2025-02-05",
      "headline": "Aishwarya Rai wishes 'love and light' to husband Abhishek on his 49th birthdayAbhishek Bachchan is celebrating his 49th birthday today. His wife and actor Aishwarya Rai Bachchan shared a throwback photo from Abhishek's childhood on social media to wish him 'love and light'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/sanam-teri-kasam-actor-mawra-hocane-marries-ameer-gilani-in-dreamy-wedding-2675357-2025-02-05",
      "headline": "Pics: Sanam Teri Kasam actor Mawra Hocane marries Ameer Gilani in dreamy weddingSanam Teri Kasam star and Pakistani actor Mawra Hocane recently got married to the love of her life, actor Ameer Gilani. The pair later shared dreamy images from their wedding photoshoot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kapil-sharma-says-coldplay-wanted-to-appear-on-his-show-sent-his-team-a-mail-2675358-2025-02-05",
      "headline": "Kapil Sharma says Coldplay reached out to appear on his showKapil Sharma recently revealed that British band Coldplay expressed their desire to take part in his show. The band was in India as part of their Music of Spheres tour. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/crazxy-teaser-sohum-shah-abhimanyu-is-stuck-in-a-sticky-situation-2675347-2025-02-05",
      "headline": "Crazxy teaser: Sohum Shah's Abhimanyu is stuck in a sticky situationCrazxy teaser released: The first teaser of Sohum Shah's Crazxy is here, which sees him presumably having the worst day of his life. The film releases in cinemas this month. "
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/cricket-india-vs-england-rohit-sharma-press-conference-odi-nagpur-future-champions-trophy-2675364-2025-02-05",
      "headline": "Nagpur press conference tests Rohit Sharma's patience, captain mum about futureIndia vs England: Captain Rohit Sharma fielded several tough questions with composure when speaking to the press on the eve of the first ODI in Nagpur. Rohit will lead India in the 3-match ODI series, starting February 6. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-india-vs-england-loses-cool-at-reporter-2675349-2025-02-05",
      "headline": "Rohit Sharma snaps at reporter: Not here to address reports about my futureRohit Sharma lost his cool at a reporter during the pre-match press conference ahead of the ODI series between India and England. An irritated Rohit said that it was not his job to address media reports that speculated about his future in the Indian team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-press-conference-nagpur-hitman-reporter-question-india-vs-england-2675345-2025-02-05",
      "headline": "What kind of question is that? Rohit Sharma stunned by reporter's 'Hitman' jibeRohit Sharma was stumped by a bouncer in the press conference in Nagpur on Wednesday. Rohit did not appreciate the jibe-like undertone of a question about his form ahead of the ODI series against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-india-vs-england-jos-buttler-champions-trophy-preparations-press-conference-2675337-2025-02-05",
      "headline": "Jos Buttler on Champions Trophy preparations: Facing India is a great challengeIND vs ENG: England skipper Jos Buttler said that facing a team like India in the upcoming series will help the Three Lions prepare well for the Champions Trophy to be held from February 19 to March 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharma-varun-chakravarthy-india-champions-trophy-squad-india-vs-england-2675333-2025-02-05",
      "headline": "Rohit Sharma hints at Varun Chakravarthy's inclusion for Champions TrophyICC Champions Trophy 2025: Rohit Sharma has dropped a big hint about Varun Chakravarthy's immediate future. The India captain said that if Varun does well against England in the 3-match ODI series, he might be added to India's Champions Trophy squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rishabh-pant-foundation-launch-help-needy-commerical-inconme-donation-2675329-2025-02-05",
      "headline": "Pant launches foundation to help needy, pledges 10 percent of commercial incomeIndian cricketer Rishabh Pant has announced the launch of the Rishabh Pant Foundation. The wicketkeeper-batter stated that he will donate 10 percent of his commercial income to support those in need."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-live-streaming-squads-schedule-odi-series-2675316-2025-02-05",
      "headline": "India vs England ODI series: Squads, schedule and all you need to knowIndia vs England ODI Series 2025: Rohit Sharma's India and Jos Buttler's England will be up against each other in a three-match ODI series, starting February 6 at the VCA Stadium in Nagpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-odi-team-news-joe-root-playing-11-2675295-2025-02-05",
      "headline": "Joe Root returns as England announce playing XI for first ODI in NagpurIndia vs England, 1st ODI: Joe Root will feature in an ODI match for the first time since the 2023 World Cup. The former captain will bat at No. 3 for England in the series opener in Nagpur on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-umpires-nitin-menon-not-going-pakistan-2675288-2025-02-05",
      "headline": "Only Indian umpire in ICC elite panel decides against travelling to PakistanIndian umpire Nitin Menon has pulled out of the upcoming Champions Trophy 2025, set to be held in Pakistan and Dubai. BCCI sources suggest that Menon decided against travelling to Pakistan for personal reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-eng-jos-buttler-t20-boom-odi-cricket-future-2675287-2025-02-05",
      "headline": "Jos Buttler 'unsure' of future of ODI cricket after T20 boom  IND vs ENG: Jos Buttler said that ODI cricket has fallen behind a wee bit amidst the growth of T20 cricket. Buttler is set to play in the upcoming three-match ODI series against India, starting February 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-michael-vaughan-calls-out-harry-brook-for-disrespecting-spin-ind-vs-eng-2675265-2025-02-05",
      "headline": "Vaughan calls out Brook for disrespecting spin: He thinks he can just whack itFormer England cricketer Michael Vaughan has called out Harry Brook for disrespecting spinners in the recent T20I series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-live-streaming-squads-schedule-odi-series-2675316-2025-02-05",
      "headline": "India vs England ODI series: Squads, schedule and all you need to knowIndia vs England ODI Series 2025: Rohit Sharma's India and Jos Buttler's England will be up against each other in a three-match ODI series, starting February 6 at the VCA Stadium in Nagpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-odi-team-news-joe-root-playing-11-2675295-2025-02-05",
      "headline": "Joe Root returns as England announce playing XI for first ODI in NagpurIndia vs England, 1st ODI: Joe Root will feature in an ODI match for the first time since the 2023 World Cup. The former captain will bat at No. 3 for England in the series opener in Nagpur on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-umpires-nitin-menon-not-going-pakistan-2675288-2025-02-05",
      "headline": "Only Indian umpire in ICC elite panel decides against travelling to PakistanIndian umpire Nitin Menon has pulled out of the upcoming Champions Trophy 2025, set to be held in Pakistan and Dubai. BCCI sources suggest that Menon decided against travelling to Pakistan for personal reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-eng-jos-buttler-t20-boom-odi-cricket-future-2675287-2025-02-05",
      "headline": "Jos Buttler 'unsure' of future of ODI cricket after T20 boom  IND vs ENG: Jos Buttler said that ODI cricket has fallen behind a wee bit amidst the growth of T20 cricket. Buttler is set to play in the upcoming three-match ODI series against India, starting February 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-michael-vaughan-calls-out-harry-brook-for-disrespecting-spin-ind-vs-eng-2675265-2025-02-05",
      "headline": "Vaughan calls out Brook for disrespecting spin: He thinks he can just whack itFormer England cricketer Michael Vaughan has called out Harry Brook for disrespecting spinners in the recent T20I series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-t20-world-cup-2025-gongadi-trisha-telangana-cm-2675253-2025-02-05",
      "headline": "G Trisha rewarded with Rs 1 crore by Telangana CM after World Cup heroics  Telangana Chief Minister Sri A Revanth Reddy announced a prize money of Rs 1 crore for Gongadi Trisha, who won the Player of the Tournament award after India defended their U19 Women's T20 World Cup title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jos-buttler-on-joe-root-ind-vs-eng-odi-series-nagpur-odi-2675226-2025-02-05",
      "headline": "Comeback man Joe Root enjoying his cricket: Jos Buttler fires warning to India ahead of ODIsEngland's white-ball captain Jos Buttler has backed star batter Joe Root to play a crucial role for their team in the upcoming ODI series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-squad-tri-series-pakistan-icc-champions-trophy-2675221-2025-02-05",
      "headline": "South Africa name weakened squad for 1st ODI in Pakistan tri-seriesSouth Africa have named a weakened squad for the first ODI of the tri-series against Pakistan and New Zealand. The Proteas named a 12-member squad for the first game, and will only announce the final squad after SA20 Eliminator.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-rohit-sharma-jos-buttler-aggressive-brand-champions-trophy-2675217-2025-02-05",
      "headline": "Rohit deserves credit for India playing aggressive ODI cricket: Jos ButtlerSpeaking to the press on the eve of the ODI series opener in Nagpur, England captain Jos Buttler praised his Indian counterpart, Rohit Sharma, for pushing India to play aggressively in the 50-over format of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-cuttack-stadium-2nd-odi-tickets-stampede-situation-injured-2675190-2025-02-05",
      "headline": "Stampede scare during 2nd ODI ticket sale in Cuttack, few fans fall unconsciousA stampede-like situation erupted during the ticket sale for the 2nd ODI in Cuttack, as massive crowds gathered in anticipation of the India vs England match. The overwhelming rush led to chaotic scenes, with several fans struggling to maintain their footing at the overcrowded ticket counters. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ravindra-jadejas-selection-for-champions-trophy-left-me-surprised-s-badrinath-2675180-2025-02-05",
      "headline": "Ravindra Jadeja's selection for Champions Trophy left me surprised: S BadrinathFormer India cricketer Subramaniam Badrinath revealed that Ravindra Jadeja's selection in the Indian team for the England ODI series and the Champions Trophy left him surprised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-varun-chakravarthy-number-two-icc-t20i-bowling-rankings-latest-2675166-2025-02-05",
      "headline": "Varun Chakravarthy closes in on No. 1 spot, three Indians in top 10 ICC T20I Rankings: Spinner Varun Chakravarthy closed in on the top spot of the bowling rankings in men's T20Is. He won the Player of the Series award for taking 14 wickets in five matches against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-t20-rankings-abhishek-sharma-second-spot-batters-england-series-2675163-2025-02-05",
      "headline": "Abhishek Sharma jumps to second spot after England heroicsAbhishek Sharma's record-breaking century against England in the Mumbai T20I earned him a rise to second place in the latest ICC T20I rankings for batters.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-cuttack-stadium-2nd-odi-tickets-stampede-situation-injured-2675190-2025-02-05",
      "headline": "Stampede scare during 2nd ODI ticket sale in Cuttack, few fans fall unconsciousA stampede-like situation erupted during the ticket sale for the 2nd ODI in Cuttack, as massive crowds gathered in anticipation of the India vs England match. The overwhelming rush led to chaotic scenes, with several fans struggling to maintain their footing at the overcrowded ticket counters. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ravindra-jadejas-selection-for-champions-trophy-left-me-surprised-s-badrinath-2675180-2025-02-05",
      "headline": "Ravindra Jadeja's selection for Champions Trophy left me surprised: S BadrinathFormer India cricketer Subramaniam Badrinath revealed that Ravindra Jadeja's selection in the Indian team for the England ODI series and the Champions Trophy left him surprised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-varun-chakravarthy-number-two-icc-t20i-bowling-rankings-latest-2675166-2025-02-05",
      "headline": "Varun Chakravarthy closes in on No. 1 spot, three Indians in top 10 ICC T20I Rankings: Spinner Varun Chakravarthy closed in on the top spot of the bowling rankings in men's T20Is. He won the Player of the Series award for taking 14 wickets in five matches against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-t20-rankings-abhishek-sharma-second-spot-batters-england-series-2675163-2025-02-05",
      "headline": "Abhishek Sharma jumps to second spot after England heroicsAbhishek Sharma's record-breaking century against England in the Mumbai T20I earned him a rise to second place in the latest ICC T20I rankings for batters.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-zaheer-khan-on-mayank-yadav-fitness-for-ipl-2025-lucknow-super-giants-lsg-2675148-2025-02-05",
      "headline": "LSG want Mayank Yadav 150 per cent fit, not just 100 per cent: Zaheer KhanFormer India fast bowler and Lucknow Super Giants mentor Zaheer Khan has stressed the importance of having Mayank Yadav at his 150% fitness before fielding him in the upcoming IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-may-introduce-semi-automated-var-offside-before-2024-25-season-ends-2675145-2025-02-05",
      "headline": "Premier League may introduce semi-automated VAR offside before season endsPremier League Chief Football Officer Tony Scholes has said that semi-automated offside technology could be introduced before the end of the 2024-25 season, following \"significant\" progress in testing.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mumbai-vs-haryana-ranji-trophy-quarterfinals-lahli-kolkata-eden-gardens-2675133-2025-02-05",
      "headline": "Mumbai's Ranji Trophy quarter-finals moved from Haryana to KolkataRanji Trophy: Mumbai and Haryana were scheduled to play their quarter-final in Lahli, Haryana. However, the match has been shifted to Eden Gardens, Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-ashleigh-gardner-replaces-beth-mooney-captain-gujarat-giants-2675111-2025-02-05",
      "headline": "Ashleigh Gardner replaces Beth Mooney as captain of Gujarat Giants Gujarat Giants have appointed Australian all-rounder Ashleigh Gardner as the team captain for the upcoming season of the Women's Premier League (WPL). Gardner, a key figure in Australian cricket, made her debut in 2017."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}