{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-restricts-bangladeshi-imports-via-northeast-check-posts-in-reciprocal-move-2726437-2025-05-18",
      "headline": "India restricts Bangladesh imports through northeast check postsA wide range of Bangladeshi products will be restricted via the Integrated Check Posts in the northeastern states of Assam, Meghalaya, Tripura, and Mizoram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-talks-piyush-goyal-to-lead-team-to-washington-for-bta-negotiations-ytvd-2726160-2025-05-17",
      "headline": "India-US Bilateral Trade Agreement: Final Phase Negotiations Aim For ConclusionUnion Minister Piyush Goyal will lead a team to the United States for trade talks. India and the US are working to finalize the Bilateral Trade Agreement (BTA) by early July. The US President has proposed a trade agreement with India that would have no tariffs on a wide range of American products. The US President stated, 'India is one of the highest tariff nations in the world. It's very hard to sell into India.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-drops-chinese-lounge-partner-dragonpass-what-it-means-for-indian-flyers-2726082-2025-05-16",
      "headline": "Adani drops Chinese lounge partner DragonPass: What it means for Indian flyersThe move, triggered by rising national security concerns, has ended DragonPass's access to Adani-managed airport lounges across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-the-middle-class-is-chasing-expensive-brands-explains-market-expert-2725916-2025-05-16",
      "headline": "Why the middle class is chasing expensive brands, explains market expertA market expert noted that nearly 75% of luxury spending today comes from the middle class, not due to rising incomes, but because of social media, marketing tricks, and peer pressure that fuel the urge to appear successful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-traders-body-boycotts-turkey-and-azerbaijan-over-support-for-pakistan-2725887-2025-05-16",
      "headline": "Indian traders' body boycotts Turkey and Azerbaijan over support for PakistanThe move comes after both Turkey and Azerbaijan openly showed support for Pakistan, at a time when India is facing sensitive national security challenges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-first-phase-likely-to-be-ready-by-july-1-say-sources-2725866-2025-05-16",
      "headline": "India-US trade deal: First phase likely to be ready by July 1, say sourcesIndia and the United States are in negotiations for a trade deal, with sources indicating that phase one could be ready by July 1st. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/un-sees-indian-economy-growing-at-63-percent-as-global-outlook-wobbles-2725850-2025-05-16",
      "headline": "India to grow at 6.3%, ahead of China, US, and European Union: UN reportAccording to the UN's mid-year update of the World Economic Situation and Prospects (WESP), India's growth is being fuelled by strong household spending and solid government investments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-slips-200-points-nifty-holds-ground-above-25000-defence-stocks-surge-2725827-2025-05-16",
      "headline": "Sensex slips 200 points, Nifty holds ground above 25,000; defence stocks surgeThe S&P BSE Sensex lost 200.15 points to close at 82,330.59, while the NSE Nifty50 was down 42.30 points to end at 25,019.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipo-next-week-2-public-listing-belrise-industries-borana-weaves-details-gmp-price-band-2725818-2025-05-16",
      "headline": "2 IPOs to open next week: Check Belrise Industries, Borana Weaves detailsWhile Belrise Industries will open for bidding on May 21, investors can bid for the IPO of Borana Weaves starting May 20, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-is-july-31-your-tax-deadline-find-out-2725807-2025-05-16",
      "headline": "ITR filing 2025: Is July 31 your tax deadline? Find outFiling your return on time helps avoid penalties and delays in refunds. It also keeps your financial records in order. So, if your deadline is July 31, skip the last-minute rush and file in advance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-is-digital-form-16-a-game-changer-for-salaried-taxpayers-2725775-2025-05-16",
      "headline": "ITR filing 2025: Is digital Form 16 a game-changer for salaried taxpayers?Digital Form 16 is an electronic version of the traditional Form 16. It's generated directly from the TRACES portal, which is managed by the Income Tax Department. This means all your salary details, TDS, and tax-saving deductions are recorded accurately and match what the government sees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/government-clears-187-startups-for-tax-relief-heres-what-it-means-2725727-2025-05-16",
      "headline": "Government clears 187 startups for tax relief. Here's what it meansTo qualify, the start-up must be recognised by the Department for Promotion of Industry and Internal Trade (DPIIT). It should be a private limited company or a limited liability partnership and its turnover should not cross Rs 100 crore in any year since incorporation."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-shares-glowing-praise-for-rumoured-girlfriend-ana-de-armas-ballerina-2726602-2025-05-18",
      "headline": "Tom Cruise shares glowing praise for rumoured girlfriend Ana de Armas' BallerinaHollywood star Tom Cruise was all praises for rumoured girlfriend Ana de Armas's film 'Ballerina'. He spoke about it during the London premiere of his film 'Mission: Impossible - The Final Reckoning'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-confirms-hera-pheri-3-exit-did-not-have-creative-disagreement-with-priyadarshan-2726587-2025-05-18",
      "headline": "Paresh Rawal confirms Hera Pheri 3 exit, says 'had no creative difference'Bollywood actor Paresh Rawal has announced his exit from the eagerly-awaited film Hera Pheri 3, clarifying that it is not due to creative differences. He expressed his respect and faith in the director Priyadarshan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/sonu-kakkar-reunites-with-neha-kakkar-tony-kakkar-parents-anniversary-after-family-rift-2726581-2025-05-18",
      "headline": "Sonu Kakkar reunites with Neha-Tony for parents' anniversary after family riftAfter publicly acknowledging a rift with her family, singer Sonu Kakkar was seen celebrating her parents' anniversary. The pictures also featured her siblings, Neha and Tony Kakkar.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mission-impossible-8-box-office-day-1-tom-cruise-2726580-2025-05-18",
      "headline": "Mission Impossible 8 box office Day 1: Tom Cruise film opens strong at Rs 17.5 cr'Mission: Impossible – The Final Reckoning' has made a grand entry in India, releasing six days ahead of the global launch and receiving an enthusiastic response from Indian audiences. The film has become the highest-opening Hollywood film of 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gram-chikitsalaya-amol-parashar-show-is-a-healing-touch-diagnosing-deeper-truth-2726566-2025-05-18",
      "headline": "Gram Chikitsalaya: Amol Parashar's show is a healing touch, diagnosing deeper truth'Gram Chikitsalaya' is about a doctor trying to make a village more aware of the healthcare system that they need, but it is also about a deep understanding of the neglected rural population of the country. The series is headlined by Amol Parashar as Dr Prabhat Sinha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malti-marie-adorable-tea-party-with-priyanka-chopra-manager-is-the-cutest-thing-2726561-2025-05-18",
      "headline": "Malti's adorable tea party with Priyanka Chopra's manager is the cutest thingPriyanka Chopra's daughter, Malti, hosted an adorable tea party for her mother's manager. Sweet moments from their intimate celebration were shared online on Sunday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/guns-n-roses-india-ecstatic-fans-say-even-gods-wanted-this-to-happen-after-mumbai-show-2726536-2025-05-18",
      "headline": "Guns N Roses: Ecstatic fans say 'even gods wanted this to happen' after Mumbai showGuns N' Roses rocked Mumbai on Saturday with an electrifying performance. Elated fans shared highlights from the unforgettable night on their respective X handles. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-rahul-vaidya-thanks-virat-kohli-for-unblocking-him-you-are-pride-of-india-2726515-2025-05-18",
      "headline": "Singer Rahul Vaidya thanks Virat Kohli for unblocking him: You are pride of IndiaAfter previously calling Virat Kohli and his fans \"jokers,\" singer Rahul Vaidya has now thanked the cricketer for unblocking him on Instagram. Sharing a screenshot of his post, Vaidya praised Kohli, calling him the pride of India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-abhishek-bachchan-groove-to-rahul-vaidyas-kajra-re-at-wedding-2726490-2025-05-18",
      "headline": "Aishwarya-Abhishek groove to Kajra Re at wedding, daughter Aaradhya joinsVideos of Aishwarya Rai and Abhishek Bachchan from a recent wedding are now going viral. The clips were shared by singer Rahul Vaidya, who performed at the event.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/babil-khan-exits-sai-rajeshs-film-after-backlash-things-didnt-go-as-planned-2726484-2025-05-18",
      "headline": "Babil Khan exits Sai Rajesh's film after backlash: Things didn't go as plannedActor Babil Khan has confirmed exiting director Sai Rajesh's upcoming movie. The duo shared respective posts on social media expressing admiration for each other. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/haqeeqat-war-film-forged-in-india-steely-defiance-in-defeat-2726425-2025-05-18",
      "headline": "Haqeeqat, a war film forged in India's steely defiance in defeatHaqeeqat (1964) vividly portrays the bravery and sacrifice of Indian soldiers during the 1962 Sino-Indian war. The film combines gripping war scenes, patriotic music, and emotional storytelling to honour the heroes of Rezang La."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-trailer-review-kamal-haasan-silambarasan-gangster-drama-mani-ratnam-2726382-2025-05-17",
      "headline": "Thug Life trailer review: Kamal Haasan, STR in a gangster tale more like Nayakan 2.0The trailer of Mani Ratnam's much-anticipated film 'Thug Life', starring Kamal Haasan, offered a stylish peek into a familiar gangster world, but with the director's signature storytelling depth and visual grandeur. The film also stars Trisha Krishnan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-wants-more-films-with-rashmika-mandanna-says-chemistry-not-a-problem-2726393-2025-05-17",
      "headline": "Vijay Deverakonda wants more films with Rashmika, says 'chemistry not a problem'Actor Vijay Deverakonda candidly spoke about his marriage plans, his on-screen chemistry with Rashmika Mandanna, and whether he's currently seeking a life partner. The duo has long been rumoured to be in a relationship."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-ex-mother-in-law-sujatha-vijayakumar-breaks-silence-amid-row-aarti-kenishaa-2726351-2025-05-17",
      "headline": "Ravi Mohan's ex-mother-in-law breaks silence amid row: Still want him as our heroAarti's mother and producer Sujatha Vijayakumar has responded to serious allegations by actor Ravi Mohan, clarifying her financial dealings and appealing for family peace. She shared a two-page statement on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddharth-nigam-unaware-of-mumbai-before-dhoom-3-feared-being-trafficked-2726344-2025-05-17",
      "headline": "Siddharth Nigam was unaware of YRF before Dhoom 3: Mumbai bula ke bech diya tohActor Siddharth Nigam shares his initial disbelief and fears when auditioning for Dhoom 3. He felt the casting call was fake and feared that he would be trafficked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rahul-bhat-on-whether-cannes-is-becoming-a-fashion-event-rather-than-film-festival-2726321-2025-05-17",
      "headline": "Cannes becoming fashion event more than film festival? Actor Rahul Bhat answersRahul Bhat shares his perspective on the Cannes Film Festival, emphasising it as a celebration of cinema rather than just fashion. He is attending Cannes for the third time this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-trailer-kamal-haasan-silambarasan-trisha-krishnan-mani-ratnam-2726320-2025-05-17",
      "headline": "Thug Life trailer: Kamal Haasan ready to fight death in Mani Ratnam actionerThe highly-anticipated trailer of Kamal Haasan and Mani Ratnam's 'Thug Life' is out. Also starring Trisha Krishnan and Silambarasan in pivotal roles, the trailer was launched at a grand event on May 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/murderbot-appletv-new-show-season-1-alexander-skarsgard-secunit-hacks-governor-module-reluctant-antihero-2726298-2025-05-17",
      "headline": "Murderbot review: Alexander Skarsgard elevates show with deadpan deliveryReleased-Fri May 16, 2025'Murderbot' follows a security cyborg that hacks itself and who'd rather watch telly than protect humans. Apple TV's sci-fi comedy presents Alexander Skarsgard as the reluctantly sentient SecUnit navigating freedom while hiding its autonomous status from suspicious scientists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-to-begin-ak46-filming-in-november-eyes-mid-2026-release-2726299-2025-05-17",
      "headline": "Ajith Kumar to begin AK46 filming in November, eyes mid 2026 releaseTamil actor Ajith Kumar has confirmed his next film, tentatively titled 'AK46'. In an interview, he shared that he will begin the shooting in November 2025. \r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/children-killed-massive-fire-near-hyderabad-charminar-several-feared-trapped-2726527-2025-05-18",
      "headline": "17 of family killed in building fire near Hyderabad's Charminar; 8 were childrenFire broke out near Gulzar House in the Hyderabad Old City, an area close to the historical monument Charminar, resulting in the deaths of 17 people, including eight children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/imf-loan-new-conditions-pakistan-india-tensions-risk-2726583-2025-05-18",
      "headline": "IMF slaps 11 new conditions on Pak, flags India risk after Op Sindoor: ReportThe IMF has imposed 11 new conditions on Pakistan for its next bailout tranche, emphasising parliamentary approval of a Rs 17.6 trillion budget and energy sector reforms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladeshi-actor-nusraat-faria-sheikh-hasina-role-mujib-biopic-arrested-dhaka-airport-2726612-2025-05-18",
      "headline": "Bangladeshi actor who played Sheikh Hasina in Mujib biopic arrested in DhakaBangladeshi actor Nusraat Faria was arrested at the Dhaka airport on charges of attempted murder in a case related to the mass uprising against then-PM Sheikh Hasina. Faria played the role of Hasina in the 2023 film 'Mujib: The Making of a Nation'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/akshoka-university-professor-ali-khan-mahmudabad-political-science-arrested-operation-sindoor-facebook-post-2726550-2025-05-18",
      "headline": "Ashoka University professor arrested over social media post on Operation SindoorAli Khan Mahmudabad, a Political Science professor at Ashoka University, was arrested in Delhi over a social media post on Operation Sindoor, following a complaint by BJP youth wing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/india-pakistan-war-will-shape-future-battles-chinese-weapons-operation-sindoor-brahmos-sukhoi-rafale-pl-15-2726349-2025-05-18",
      "headline": "Killer weapons battle-tested, India-Pak mini-war will shape future warsLethal weapons — ranging from missiles to fighter jets to drones, and air defence systems — from multiple countries that saw trials for years witnessed battle-testing in the India-Pakistan mini-war. Over half a dozen Indian and Chinese weapons were war-tested for the first time. As the world's arms manufacturers and strategic experts take note of the limited India-Pakistan war, here's why it will shape all wars to come."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/white-house-advisory-board-appoints-two-former-jihadists-one-had-links-to-let-and-al-qaida-2726579-2025-05-18",
      "headline": "Ex-terror convict, Hamas-linked scholar picked as Trump's advisors: ReportIsmail Royer, a convicted terrorist with documented ties to Lashkar-e-Taiba, Hamas, and the Muslim Brotherhood, has been appointed to the White House Advisory Board alongside Shaykh Hamza Yusuf, who is also accused of promoting jihadi ideology."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/pslv-c61-mission-fails-former-isro-scientist-explains-what-happens-next-2726586-2025-05-18",
      "headline": "PSLV-C61 fails: Former Isro scientiest explains what happens nextHere's how Isro typically approaches the analysis of a lost mission, such as a launch failure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/youtuber-jyoti-malhotra-travel-with-jo-pakistan-spy-case-arrest-pak-official-2726493-2025-05-18",
      "headline": "'Spy' YouTuber outed by own video, exposes link to expelled Pak officialYouTuber Jyoti Malhotra's videos, which have come under scrutiny after her arrest on charges of spying for Pakistan, have exposed her close ties with a Pakistani official posted in India, who also faced government action on espionage charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/akash-anand-bsp-chief-national-coordinator-journey-mayawati-2726604-2025-05-18",
      "headline": "The revolving door: Akash Anand's boomerang ride through BSP's power corridorsAkash's political career within the BSP is marked by repeated exits, dramatic comebacks, and public apologies. His path has often resembled a revolving door which spins with every twist of Mayawati's strategic will."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-india-pak-government-delegation-tharoor-owaisi-shiv-sena-ubt-sanjay-raut-baraat-india-bloc-2726539-2025-05-18",
      "headline": "Boycott this 'baraat': Sanjay Raut slams delegation diplomacy on Op SindoorFifty-one political leaders cutting across party lines will be part of the seven delegations travelling to world capitals to present India's resolve to tackle terrorism in the backdrop of Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/viral-video-turkish-president-erdogan-grabs-french-president-emmanuel-macron-finger-sparks-powerplay-talk-2726471-2025-05-18",
      "headline": "Handshake power play? Turkey's Erdogan grabs Macron's finger mid-talkIn the video, Recep Tayyip Erdogan is seen grabbing Emmanuel Macron's hand and patting it. Things take a curious turn when an unsuspecting Macron extends his other hand to Erdogan. As Macron tries to free his hand, Erdogan -- while exchanging a few words -- holds on to the French President's index finger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-pakistan-copy-paste-diplomacy-india-narendra-modi-shehbaz-sharif-2726582-2025-05-18",
      "headline": "Copycat Pakistan can't stop peeking at India's strategic cheat sheetIn the high-stakes game of strategy, Islamabad seems more focused on imitation than innovation. From diplomatic expulsions to global outreach and battlefield optics, Pakistan's every move has mirrored India's almost like reading from a borrowed script."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/goa-yoga-cows-not-pleasure-yog-bhoomi-not-bhog-bhoomi-chief-minister-pramod-sawant-2726492-2025-05-18",
      "headline": "Goa is no longer bhog bhoomi: Chief Minister on state's 'Sanatana' shiftGoa Chief Minister Pramod Sawant said that Goa is more of a 'yog bhoomi' (land of devotion and yoga) and 'go-mata bhoomi' (land of cows) than a 'bhog bhoomi' (land of pleasure), asserting that the coastal state is attracting more people for its temples and culture than for its 'sun, sand, and sea.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-confirms-hera-pheri-3-exit-did-not-have-creative-disagreement-with-priyadarshan-2726587-2025-05-18",
      "headline": "Paresh Rawal confirms Hera Pheri 3 exit, says 'had no creative difference'Bollywood actor Paresh Rawal has announced his exit from the eagerly-awaited film Hera Pheri 3, clarifying that it is not due to creative differences. He expressed his respect and faith in the director Priyadarshan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-blocks-land-route-several-bangladeshi-imports-goods-textile-trade-2726562-2025-05-18",
      "headline": "India blocks land route for several Bangladeshi goods, hits textile tradeSeveral items like fruits, fruit-flavoured and carbonated drinks, processed food items, wooden furniture, plastic, dyes, cotton and cotton yarn waste, among others, have been included in the list. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gram-chikitsalaya-amol-parashar-show-is-a-healing-touch-diagnosing-deeper-truth-2726566-2025-05-18",
      "headline": "Gram Chikitsalaya: Amol Parashar's show is a healing touch, diagnosing deeper truth'Gram Chikitsalaya' is about a doctor trying to make a village more aware of the healthcare system that they need, but it is also about a deep understanding of the neglected rural population of the country. The series is headlined by Amol Parashar as Dr Prabhat Sinha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-484-16-05-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lyricist-javed-akhtar-abuses-he-faces-would-prefer-hell-if-only-other-choice-is-pakistan-2726447-2025-05-18",
      "headline": "Would prefer hell if only other choice is Pak: Javed Akhtar on 'facing abuse'Javed Akhtar was attending the launch of Shiv Sena (UBT) leader Sanjay Raut's book Narkatla Swarg (Heaven in the Swamp) in Mumbai on Saturday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/polish-woman-films-man-following-her-in-himachal-tells-him-to-stop-in-viral-video-2726497-2025-05-18",
      "headline": "Polish woman records man following her during trek in Himachal. Video goes viralKasia, a Polish content creator known for documenting her travel experiences online, was walking down a mountain from her guest house when the man approached her, asking for a picture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/mexican-navy-training-vessel-with-over-200-onboard-strikes-new-yorks-brooklyn-bridge-several-injured-2726473-2025-05-18",
      "headline": "Mexican Navy ship with 200 onboard hits New York's Brooklyn Bridge, 2 killedAt the time of impact, around 8:26 pm local time, several sailors who were on top of the boat started falling off, while a few desperately held on to the mast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pokhran-1-anniversary-smiling-buddha-operation-51-years-india-first-nuclear-test-2726534-2025-05-18",
      "headline": "When Buddha finally smiled: 51 years since India's first nuclear testCodenamed 'Smiling Buddha', the operation established India's technological prowess, strategic autonomy, and national resolve on the world stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/video/mexican-navy-training-ship-cuauhtemoc-collides-brooklyn-bridge-new-york-united-states-2726483-2025-05-18",
      "headline": "Sailors dangle high above water after Mexican Navy ship hits Brooklyn Bridge A Mexican Navy training ship, the Cuauhtémoc, collided with the Brooklyn Bridge in New York around 8:26 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/harsh-goenka-posts-old-pic-mukesh-ambani-3-indian-ceos-azerbaijan-baku-2726538-2025-05-18",
      "headline": "Harsh Goenka posts old pic of 3 Indian CEOs in Azerbaijan. Can you name them?In a now-viral post on X, Industrialist Harsh Goenka shared a throwback photograph from a visit to Azerbaijan with three fellow CEOs. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/benjamin-sesko-leave-rb-leipzig-transfer-interest-liverpool-arsenal-reports-2726615-2025-05-18",
      "headline": "Liverpool, Arsenal target Benjamin Sesko set to for RB Leipzig exit: ReportsBenjamin Sesko's departure from RB Leipzig now seems inevitable, with Arsenal, Liverpool and Chelsea circling. The Slovenian forward's release clause is considered affordable, making him a top target in the summer transfer window."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-loses-10-kg-through-strict-diet-to-prepare-for-england-tour-2726613-2025-05-18",
      "headline": "Sarfaraz Khan loses 10 kg through strict diet to prepare for England tourIndia batter Sarfaraz Khan is toiling hard to prepare for the upcoming England tour, having lost 10 kg through a strict diet plan. Sarfaraz is yet to play a single Test outside of India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-brendon-mccullum-ecb-sacks-data-analysts-2726606-2025-05-18",
      "headline": "Ahead of India series, ECB sacks data analysts as McCullum to rely on gutAhead of the upcoming India Test series, the ECB has decided to part ways with their data analysts as coach Brendon McCullum will trust his gut feeling and intuition going forward. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-pbks-sanju-samson-sacrifice-opening-spot-vaibhav-suryavanshi-2726601-2025-05-18",
      "headline": "Sanju Samson sacrifices RR opening spot for Vibhav Suryavanshi vs PBKSSanju Samson made a selfless return to RR's XI, backing teenage prodigy Vaibhav Suryavanshi to open despite recent struggles. The skipper's decision highlights his recognition of the youngster breakout performance this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/coco-gauff-finals-clay-italian-open-jasmine-paolini-2726599-2025-05-18",
      "headline": "Lot to improve: Gauff strives for progress after losing Italian Open finalItalian Open 2025: Coco Gauff said that she needs to work on her game before the French Open after losing back-to-back finals on clay in Madrid and Rome. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-pbks-playing-xis-mitchell-owen-debut-kwena-maphaka-2726600-2025-05-18",
      "headline": "RR vs PBKS: Punjab hand big-hitting Mitchell Owen debut, Royals bring in MaphakaPunjab Kings have handed Mitchell Owen his IPL debut while Rajasthan Royals have replaced Jofra Archer with the young Kwena Maphaka. Owen is considered to be one of the most exciting T20 talents in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-gt-ishant-sharma-beyond-playoffs-every-game-important-2726591-2025-05-18",
      "headline": "GT's Ishant Sharma looks past playoffs in DC clash: Every game importantGT pacer Ishant Sharma urged focus beyond just the DC clash, highlighting the importance of maintaining momentum across all remaining league games to clinch a top-two finish, which provides a second chance to reach the IPL final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-test-captain-ravi-shastri-shubman-gill-2726589-2025-05-18",
      "headline": "Don't want Jasprit Bumrah to be made India Test captain: Ravi ShastriRavi Shastri revealed why he doesn't want Jasprit Bumrah as the next India Test captain. Bumrah has been considered by many to be the favourite to replace Rohit Sharma as the new captain of the Indian Test team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-rajasthan-royals-vs-punjab-kings-today-match-updates-2726585-2025-05-18",
      "headline": "RR vs PBKS Live: Pressure rises for Punjab after Shreyas Iyer departsIPL 2025, RR vs PBKS Live Updates: Punjab Kings are looking considerable trouble after they lose their 4th wicket in their skipper Shreyas Iyer. It is now down to Shashank Singh and Nehal Wadhera to recover for Punjab against the RR bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-badminton-india-star-feature-2726573-2025-05-18",
      "headline": "Lakshya Sen: What has gone wrong with the promising badminton star?Lakshya Sen was India's best badminton player at the Paris Olympics last year, where he agonisingly missed out on winning a medal, but since then, the youngster has struggled to find his feet.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-kkr-kolkata-elimination-aaron-finch-2726567-2025-05-18",
      "headline": "KKR have themselves to blame for IPL 2025 elimination: Aaron FinchAaron Finch has claimed that KKR have themselves to blame for their poor IPL 2025 campaign and subsequent elimination from the play-offs race on Saturday, May 17. KKR were eliminated after their game against RCB was washed out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-gt-ishant-sharma-beyond-playoffs-every-game-important-2726591-2025-05-18",
      "headline": "GT's Ishant Sharma looks past playoffs in DC clash: Every game importantGT pacer Ishant Sharma urged focus beyond just the DC clash, highlighting the importance of maintaining momentum across all remaining league games to clinch a top-two finish, which provides a second chance to reach the IPL final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-test-captain-ravi-shastri-shubman-gill-2726589-2025-05-18",
      "headline": "Don't want Jasprit Bumrah to be made India Test captain: Ravi ShastriRavi Shastri revealed why he doesn't want Jasprit Bumrah as the next India Test captain. Bumrah has been considered by many to be the favourite to replace Rohit Sharma as the new captain of the Indian Test team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-rajasthan-royals-vs-punjab-kings-today-match-updates-2726585-2025-05-18",
      "headline": "RR vs PBKS Live: Pressure rises for Punjab after Shreyas Iyer departsIPL 2025, RR vs PBKS Live Updates: Punjab Kings are looking considerable trouble after they lose their 4th wicket in their skipper Shreyas Iyer. It is now down to Shashank Singh and Nehal Wadhera to recover for Punjab against the RR bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-badminton-india-star-feature-2726573-2025-05-18",
      "headline": "Lakshya Sen: What has gone wrong with the promising badminton star?Lakshya Sen was India's best badminton player at the Paris Olympics last year, where he agonisingly missed out on winning a medal, but since then, the youngster has struggled to find his feet.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-kkr-kolkata-elimination-aaron-finch-2726567-2025-05-18",
      "headline": "KKR have themselves to blame for IPL 2025 elimination: Aaron FinchAaron Finch has claimed that KKR have themselves to blame for their poor IPL 2025 campaign and subsequent elimination from the play-offs race on Saturday, May 17. KKR were eliminated after their game against RCB was washed out. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}