{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-higher-as-adani-group-stocks-rally-up-to-20-percent-2641039-2024-11-27",
      "headline": "Sensex, Nifty end higher as Adani stocks rally up to 20% The S&P BSE Sensex added 230.02 points to close at 80,234.08, while the NSE NIfty50 gained 82.20 points to end at 24,276.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-life-insurance-faces-cyberattack-fraudsters-steal-customer-data-demand-extortion-2641013-2024-11-27",
      "headline": "HDFC Life faces cyberattack: Fraudsters steal customer data, demand extortionThe breach occurred between November 19 and November 21, 2024 and the cybercriminals managed to steal personal information about HDFC Life's customers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-jumps-18-percent-should-you-buy-now-or-wait-2640982-2024-11-27",
      "headline": "Ola Electric share price jumps 18%: Should you buy now or wait?The rally in Ola Electric shares followed the company's announcement of its new electric scooter lineup, which aims to make EVs more accessible across various segments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pan-20-project-uses-existing-old-pan-card-valid-need-to-upgrade-expert-views-2640953-2024-11-27",
      "headline": "PAN 2.0: Will existing PAN card remain valid or do you need to upgrade?PAN 2.0: With an investment of Rs 1,435 crore, the government aims to introduce advanced Digital PAN/TAN services as part of this e-governance reform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-share-price-multibagger-returns-qip-should-you-buy-stock-2640932-2024-11-27",
      "headline": "Zomato shares up 131% this year: Should you buy multibagger stock?Zomato share price: On Wednesday, the stock added another 3%, reaching an intraday high of Rs 289.70, inching closer to its September peak of Rs 298.20."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-enterprise-green-energy-shares-gain-up-to-5-after-clarification-on-us-bribery-charge-2640859-2024-11-27",
      "headline": "Adani Group stocks gain up to 17% after clarification on US bribery chargeAdani Group stocks such as Adani Green Energy Ltd, Adani Power Ltd, Adani Energy Solutions Ltd, and Adani Enterprises Ltd gained as much as 10% after a fresh clarification on the US bribery charges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-mobility-share-price-rises-sharply-new-range-of-electric-scooters-2640858-2024-11-27",
      "headline": "Explained: Ola Electric share price jumped 13% todayOla Electric Mobility share price opened at Rs 77.71 on the Bombay Stock Exchange (BSE), a 5% increase from the previous close of Rs 73.47, and touched a high of Rs 83.90, marking an increase of over 13%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-stock-market-listing-should-you-hold-or-sell-2640846-2024-11-27",
      "headline": "NTPC Green Energy shares rise after listing. Should you hold or sell?NTPC Green Energy market listing: By 10:40 am, NTPC Green shares climbed further to Rs 120.80, signalling strong post-listing momentum. The upward movement in NTPC Green's share price defied expectations of a muted debut.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-stocks-make-muted-debut-on-dalal-street-lists-at-3-percent-premium-2640834-2024-11-27",
      "headline": "NTPC Green Energy shares make muted debut on D-Street, lists at 3% premiumNTPC Green Energy listing: NTPC Green Energy shares opened at Rs 111.50 each on the NSE (National Stock Exchange), marking a 3.24% increase from the issue price of Rs 108."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-engineers-ipo-allotment-online-step-by-step-guide-to-check-status-latest-gmp-2640828-2024-11-27",
      "headline": "Enviro Infra Engineers IPO allotment: Step-by-step guide to check statusEnviro Infra Engineers IPO allotment: Investors who have bid for the Enviro Infra Engineers IPO can check their allotment status through the online portals of the Bombay Stock Exchange (BSE) and Bigshare Services Pvt Ltd. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-adani-green-energy-enterprises-shares-gain-2-percent-2640808-2024-11-27",
      "headline": "Sensex, Nifty open flat; Adani Green Energy shares gain 2%The S&P BSE Sensex was down 61.58 points to 79,942.48, while the NSE Nifty50 lost 13.55 points to 24,180.95 "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-energy-ola-electric-mm-ntpc-green-energy-stocks-to-watch-today-2640797-2024-11-27",
      "headline": "Adani Green Energy, Ola Electric, M&M, NTPC Green Energy: Stocks to watch todaySeveral stocks such as NTPC Green Energy, Adani Green Energy, Ola Electric are expected to be in focus today. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-clarification-no-bribery-charges-against-gautam-adani-nephew-in-us-indictment-2640796-2024-11-27",
      "headline": "No bribery charges against Gautam Adani, nephew in US indictment: Adani GreenGautam Adani Bribery Case: Adani Green Energy Ltd (AGEL) highlighted that the charges in the US Department of Justice (DOJ) indictment and the civil complaint by the US Securities and Exchange Commission (SEC) do not include allegations of bribery or corruption. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warren-buffett-money-net-worth-children-donates-usd-12-billion-unveils-plans-for-his-wealth-after-death-2640786-2024-11-27",
      "headline": "Warren Buffett donates $1.1 billion, reveals wealth distribution plan after deathWarren Buffett: In his latest letter to Berkshire Hathaway shareholders, the 94-year-old provided a deeply personal reflection on life's unpredictability and shared detailed plans for the distribution of his wealth after his passing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/adani-stocks-drop-as-moodys-downgrades-outlook-for-7-entities-2640712-2024-11-26",
      "headline": "Adani stocks drop as Moody's downgrades outlook for 7 entitiesShares of Adani Group stocks dropped during Tuesday's session after Moody's downgraded the outlook for seven of its companies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-donald-trump-trade-tariff-on-china-can-india-gain-import-duty-explained-experts-factors-exports-2640315-2024-11-26",
      "headline": "Will India gain as Trump points tariff bazooka at China?US President-elect Donald Trump has announced punitive tariff measures against China, Canada and Mexico. Will India be able to overcome its challenges and seize this opportunity? This is what experts say.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/youth-unemployment-in-india-at-102-percent-says-union-labour-minister-shobha-karandlaje-2640498-2024-11-26",
      "headline": "Youth unemployment in India at 10.2%, says Union Labour ministerA report by the International Labour Organisation's (ILO) Institute for Human Development (IHD) shows the worldwide youth unemployment rate was 15.6% in 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-listing-date-share-price-latest-gmp-market-debut-strong-or-muted-expert-view-2640484-2024-11-26",
      "headline": "NTPC Green Energy listing: What does latest GMP signal ahead of market debut? NTPC Green Energy listing: Shares of NTPC Green Energy Limited will make their debut on Dalal Sreet on Wednesday with investors eyeing a strong opening on the stock exchanges. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-marginally-lower-adani-green-shares-down-7-percent-moody-ratings-2640430-2024-11-26",
      "headline": "Sensex, Nifty end marginally lower; Adani Green shares down 7%The S&P BSE Sensex was down 105.79 points to 80,004.06, while the NSE Nifty50 lost 27.40 points to 24,194.50. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/moody-ratings-downgrade-negative-adani-group-7-firms-adani-green-apsez-2640389-2024-11-26",
      "headline": "More trouble for Adani Group as Moody's downgrades outlook for 7 firmsThe downgrade comes in the wake of legal troubles involving Gautam Adani, the chairman of Adani Group, and his associates after charges of bribery by US authorities. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-leadership-devendra-fadnavis-eknath-shinde-ajit-pawar-delhi-tomorrow-maharashtra-chief-minister-2641034-2024-11-27",
      "headline": "Mahayuti allies to meet BJP brass in Delhi amid impasse over Chief MinisterDespite the Mahayuti alliance securing a massive victory, there have been conflicting voices within the coalition. The BJP and the Shiv Sena have pushed for Devendra Fadnavis and Eknath Shinde as the next Chief Minister, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-protests-hindu-monk-arrest-chinmay-krishna-das-high-court-petition-seeks-ban-iskcon-fundamentalist-organisation-2640924-2024-11-27",
      "headline": "Iskcon a fundamentalist organisation, Bangladesh tells court as plea seeks banA writ petition was filed in the Bangladesh High Court demanding a ban on Iskcon, a Hindu religious organisation. The development comes amid protests over the arrest of Hindu leader Chinmoy Krishna Das."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-unrest-imran-khan-supporters-protest-imran-khan-release-jail-midnight-crackdown-cops-2640965-2024-11-27",
      "headline": "Imran Khan's supporters end protest in Pak as violent midnight clash kills 6 copsPakistan Protest: Pakistani TV channels showed footage of Imran Khan's supporters facing tear gas and climbing on the shipping containers placed on the roads leading to D-Chowk in the heart of Islamabad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/doctors-dead-scorpio-suv-collides-with-divider-hits-truck-on-agra-lucknow-expressway-kannauj-road-accident-2640893-2024-11-27",
      "headline": "5 doctors dead as Scorpio crashes into divider, hits truck on Agra expresswayKannauj Accident: Five doctors from Saifai Medical College were dead in a road accident on the Lucknow-Agra Expressway in Uttar Pradesh's Kannauj district early Wednesday. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-files-copyrights-case-against-nayanthara-vignesh-shivan-netflix-documentary-naanum-rowdy-dhaan-clips-2640962-2024-11-27",
      "headline": "Dhanush files case against Nayanthara, Vignesh Shivan over Netflix documentaryActor Dhanush has filed a case against Nayanthara and Vignesh Shivan over unauthorised use of Naanum Rowdy Dhaan clips in their Netflix documentary. The case was heard in Madras High Court today, November 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-maharashtra-chief-minister-pick-mahayuti-deadlock-2641000-2024-11-27",
      "headline": "Allies will sit together to decide: Devendra Fadnavis on chief minister deadlockAmid uncertainty over Maharashtra's next Chief Minister, BJP leader Devendra Fadnavis dismissed reports of discord, asserting that the BJP, Shiv Sena, and NCP would jointly form the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/who-is-chinmoy-krishna-das-bangladesh-hindu-monk-leader-sanatani-muhammad-yunus-government-profile-2640841-2024-11-27",
      "headline": "The Hindu monk who struck fear in the heart of Yunus government in BangladeshChinmoy Krishna Das Brahmachari rose from obscurity to become the undisputed leader of Hindus in Bangladesh. After getting lakhs to attend his rallies, the monk struck fear in the heart of the caretaker government, which has arrested him in a contentious sedition case. Here's more about the monk whom Iskcon Bangladesh found too hot to handle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-enterprise-green-energy-shares-gain-up-to-5-after-clarification-on-us-bribery-charge-2640859-2024-11-27",
      "headline": "Adani Group stocks gain up to 17% after clarification on US bribery chargeAdani Group stocks such as Adani Green Energy Ltd, Adani Power Ltd, Adani Energy Solutions Ltd, and Adani Enterprises Ltd gained as much as 10% after a fresh clarification on the US bribery charges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditi-rao-hydari-siddarths-new-wedding-pictures-exude-regal-elegance-2640885-2024-11-27",
      "headline": "Aditi Rao Hydari-Siddharth's new wedding pics exude regal eleganceRenowned actor Aditi Rao Hydari and her husband Siddharth shared a series of stunning wedding photographs on social media. The couple looked regal in traditional attire designed by Sabyasachi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/yoda-diagnostics-launches-beat-the-diabetes-campaign-to-raise-awareness-and-promote-personalized-diabetes-care-2636609-2024-11-20",
      "headline": "Yoda Diagnostics Launches 'Beat the Diabetes' Campaign to Raise Awareness and Promote Personalized Diabetes CareEmpowering Personalized Diabetes Care: Yoda Diagnostics' 'Beat the Diabetes' Campaign Promotes Genetic-Based Medication Plans"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-perth-test-criticism-steve-okeefe-australia-team-tall-poppy-syndrome-2641027-2024-11-27",
      "headline": "Tall poppy syndrome: Ex-spinner says intense scrutiny of Australia not justified Australia vs India: Former spinner Steve O'Keefe said he was not impressed by the intense criticism of the Australian Test team after they were rolled over in Perth. O'Keefe expressed confidence in Australia's ability to bounce back. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/eknath-shinde-will-not-accept-deputy-chief-minister-post-maharashtra-polls-mahayuti-suspense-tussle-bjp-ncp-ajit-pawar-2640897-2024-11-27",
      "headline": "Eknath Shinde won't accept Deputy Chief Minster's post: Sena's message to BJPShiv Sena leader Sanjay Shirsat's remarks today come as the BJP has remained firm on their decision for Devendra Fadnavis to occupy the post of Chief Minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/syed-mushtaq-ali-trophy-urvil-patel-rishabh-pant-fastest-hundred-2640877-2024-11-27",
      "headline": "Unsold in IPL auction, Gujarat's Urvil Patel hits second fastest T20 hundredSyed Mushtaq Ali Trophy: Urvil Patel broke Rishabh Pant's record for the fastest hundred by an Indian batter in T20 cricket. The right-hander hit a 28-ball hundred for Gujarat against Tripura on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/chandrayaan-4-mission/story/chandrayaan-4s-rover-to-be-12-times-heavier-than-chandrayaan-3s-pragyan-2640947-2024-11-27",
      "headline": "Chandrayaan-4's rover to be 12 times heavier than PragyanChandrayaan-4: This ambitious upgrade in rover size is part of Isro's broader plans for lunar exploration and sample return. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-yashasvi-jaiswal-perth-test-rankings-2640975-2024-11-27",
      "headline": "Yashasvi Jaiswal rises to career-best No. 2 after Perth Test 161AUS vs IND: Yashasvi Jaiswal jumped two places up to No.2 in the latest Test rankings for batters. The youngster scored a hundred in the Perth Test and helped India win by 295 runs at the Optus Stadium. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/us-woman-finds-marijuana-instead-of-burrito-in-package-she-ordered-from-uber-eats-2640916-2024-11-27",
      "headline": "US woman finds marijuana instead of burrito in package she ordered from Uber EatsA woman in New Jersey was shocked to receive an ounce of marijuana wrapped in foil in a package she ordered from Uber Eats. It was supposed to be a burrito. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-intense-underwater-prep-for-mission-impossible-8-see-photo-video-2640847-2024-11-27",
      "headline": "Tom Cruise's intense underwater prep for Mission Impossible 8: From depths to skiesTom Cruise shared BTS photo and video from Mission: Impossible – The Final Reckoning, showcasing his underwater stunt training. The film, releasing in May 2025, marks the franchise's epic finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-icc-rankings-jasprit-bumrah-number-1-perth-test-2640970-2024-11-27",
      "headline": "ICC Rankings: Jasprit Bumrah reclaims No. 1 spot after Perth Test heroicsICC Test Rankings: India's pace spearhead Jasprit Bumrah dethroned Kagiso Rabada from the top spot. He returns to the top spot in the bowling charts for the first time since October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rss-chief-mohan-bhagwat-values-sanskar-india-pran-shakti-book-launch-event-delhi-2640998-2024-11-27",
      "headline": "500 years of our values barred many from seeing India's 'pran shakti': RSS chiefRSS chief Mohan Bhagwat said it is the 'pran shakti' of India which makes it \"rush\" to extend its help if there is a crisis in any part of the world, without considering whether the country, facing such a situation, is hostile or friendly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/adani-bribery-case-mukul-rohatgi-congress-parliament-rule-267-2640855-2024-11-27",
      "headline": "Congress repeats 'arrest Gautam Adani' call, BJP says 'Soros script'Adani bribery case: The Rajya Sabha was adjourned as it saw stormy scenes after several opposition leaders gave notices for a discussion on the Adani bribery case. Rahul Gandhi repeated his call for Adani's arrest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-pollution-air-quality-aqi-level-smog-health-emergency-politics-severe-swast-2640142-2024-11-27",
      "headline": "Millions breathe poison, but why public health isn't political priority in IndiaDelhi AQI: Air pollution is behind 7% of all daily deaths in 10 Indian cities, and reduction of life expectancy, and overwhelming of hospitals in Delhi. Despite the health emergency, it isn't a political priority. Is it we the people to blame for it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ms-dhoni-shah-rukh-khan-brand-market-report-cricketers-bollywood-2640788-2024-11-27",
      "headline": "Cricketers are bigger than Bollywood stars in the brand marketVirat Kohli, MS Dhoni, and Sachin Tendulkar have ranked higher than popular Bollywood actors, including Shah Rukh Khan and Amitabh Bachchan, in a latest Brand Endorser Report 2024 by Hansa Research. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sean-abbott-phil-hughes-tribute-10-anniversary-sheffield-shield-sydney-2640896-2024-11-27",
      "headline": "Video: Sean Abbott breaks down on 10th anniversary of Phil Hughes's deathSean Abbott was comforted by his New South Wales teammates after he struggled to control his emotions while paying tribute to Phil Hughes on the 10th anniversary of the cricketer's death. Abbott overcame the poignant moment and went on to deliver with the ball in a Sheffield Shield match in Sydney. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canadian-sheridan-college-suspending-academic-programmes-cutting-staff-international-student-cap-government-policy-shift-2640933-2024-11-27",
      "headline": "Canada's cap on foreign students hits hard, college to cut 40 programmes, staffSheridan College in Ontario is suspending 40 academic programmes and cutting staff ahead of the expected decline in enrolment because of Canada's cap on international students. The college anticipates a 30% drop in students next year, causing a revenue loss of $112 million."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/abhay-deol-and-zeenat-aman-shabana-azmi-bun-tikii-to-premiere-at-palm-springs-festival-2641021-2024-11-27",
      "headline": "Abhay Deol and Zeenat Aman's Bun Tikii to premiere at Palm Springs FestivalAbhay Deol, Zeenat Aman and Shabana Azmi's Bun Tikki will have its world premiere at the Palm Springs Festival. The film is being helmed by Faraz Arif Ansari. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-actor-subba-raju-gets-married-at-47-2641043-2024-11-27",
      "headline": "Baahubali actor Subba Raju gets married at 47, says 'hitched finally'Telugu actor Penumatsa Subba Raju got married in a dreamy ceremony by the beach. Posting a picture with his wife on Instagram, he shared the happy news. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/divya-prabha-criticism-leaked-nude-scene-from-all-we-imagine-as-light-2641032-2024-11-27",
      "headline": "Actor Divya Prabha reacts to criticism for nude scene from All We Imagine As LightActor Divya Prabha was criticised after her nude scene from All We Imagine As Light leaked online. She called the reactions to the video 'pathetic'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mufasa-shah-rukh-khan-draws-parallel-between-him-and-the-lion-king-in-new-promotional-video-2641035-2024-11-27",
      "headline": "Mufasa: Shah Rukh Khan draws parallel between him and the lion king in new promoIn a new promo for Mufasa The Lion King, Shah Rukh Khan likened his personal journey to that of the titular character. The film, releasing December 2024, will explore Mufasa's rise from orphan to ruler."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/michael-clarkes-tribute-to-phil-hughes-will-have-a-drink-for-him-today-2641033-2024-11-27",
      "headline": "Michael Clarke's tribute to Phil Hughes: Will have a drink for him todayMichael Clarke paid his tribute to Phil Hughes on his 10-year death anniversary. His untimely death sent shock waves across the cricketing world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-perth-test-criticism-steve-okeefe-australia-team-tall-poppy-syndrome-2641027-2024-11-27",
      "headline": "Tall poppy syndrome: Ex-spinner says intense scrutiny of Australia not justified Australia vs India: Former spinner Steve O'Keefe said he was not impressed by the intense criticism of the Australian Test team after they were rolled over in Perth. O'Keefe expressed confidence in Australia's ability to bounce back. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-icc-test-batting-rankings-border-gavaskar-trophy-perth-test-hundred-australia-vs-india-2640988-2024-11-27",
      "headline": "Virat Kohli closes in top 10 of Test batting rankings after Perth Test hundred Star India batter Virat Kohli has jumped nine places in the latest ICC Test batting rankings after his magnificent 100* in the first Test against Australia in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/new-zealand-drop-will-young-from-playing-xi-vs-england-after-india-heroics-2640983-2024-11-27",
      "headline": "New Zealand drop Will Young from playing XI vs England after India heroicsNew Zealand dropped Will Young from their playing XI to make way for Kane Williamson in 1st Test vs England. Will Young was New Zealand's top run-scorer in their 3-0 whitewash vs India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-yashasvi-jaiswal-perth-test-rankings-2640975-2024-11-27",
      "headline": "Yashasvi Jaiswal rises to career-best No. 2 after Perth Test 161AUS vs IND: Yashasvi Jaiswal jumped two places up to No.2 in the latest Test rankings for batters. The youngster scored a hundred in the Perth Test and helped India win by 295 runs at the Optus Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-icc-rankings-jasprit-bumrah-number-1-perth-test-2640970-2024-11-27",
      "headline": "ICC Rankings: Jasprit Bumrah reclaims No. 1 spot after Perth Test heroicsICC Test Rankings: India's pace spearhead Jasprit Bumrah dethroned Kagiso Rabada from the top spot. He returns to the top spot in the bowling charts for the first time since October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-reveals-reason-behind-backing-out-from-ipl-2025-auction-2640937-2024-11-27",
      "headline": "Ben Stokes reveals reason behind backing out from IPL 2025 auctionIPL 2025 mega auction: Ben Stokes revealed the reason behind pulling out of the auction. He said that he wanted to focus on his commitments to England cricket."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/pep-guardiola-scratches-nose-bizarre-explanation-champions-league-manchester-city-vs-feyenoord-2640923-2024-11-27",
      "headline": "Guardiola shocks press with explanation for scratches on nose after tough drawChampions League 2024-25: Manchester City manager Pep Guardiola came up with a bizarre explanation for scratches on his nose and forehead after the Premier League giants were held to a 3-3 draw at home by Feyenoord on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sean-abbott-phil-hughes-tribute-10-anniversary-sheffield-shield-sydney-2640896-2024-11-27",
      "headline": "Video: Sean Abbott breaks down on 10th anniversary of Phil Hughes's deathSean Abbott was comforted by his New South Wales teammates after he struggled to control his emotions while paying tribute to Phil Hughes on the 10th anniversary of the cricketer's death. Abbott overcame the poignant moment and went on to deliver with the ball in a Sheffield Shield match in Sydney. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-will-finish-as-one-of-the-greatest-fast-bowlers-glenn-maxwell-2640892-2024-11-27",
      "headline": "Jasprit Bumrah will finish as one of the greatest fast bowlers: Glenn MaxwellGlenn Maxwell said that Jasprit Bumrah will finish as one of the greatest fast bowlers of all time. He also praised Yashasvi Jaiswal for his great resolve while batting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-reveals-reason-behind-backing-out-from-ipl-2025-auction-2640937-2024-11-27",
      "headline": "Ben Stokes reveals reason behind backing out from IPL 2025 auctionIPL 2025 mega auction: Ben Stokes revealed the reason behind pulling out of the auction. He said that he wanted to focus on his commitments to England cricket."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/pep-guardiola-scratches-nose-bizarre-explanation-champions-league-manchester-city-vs-feyenoord-2640923-2024-11-27",
      "headline": "Guardiola shocks press with explanation for scratches on nose after tough drawChampions League 2024-25: Manchester City manager Pep Guardiola came up with a bizarre explanation for scratches on his nose and forehead after the Premier League giants were held to a 3-3 draw at home by Feyenoord on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sean-abbott-phil-hughes-tribute-10-anniversary-sheffield-shield-sydney-2640896-2024-11-27",
      "headline": "Video: Sean Abbott breaks down on 10th anniversary of Phil Hughes's deathSean Abbott was comforted by his New South Wales teammates after he struggled to control his emotions while paying tribute to Phil Hughes on the 10th anniversary of the cricketer's death. Abbott overcame the poignant moment and went on to deliver with the ball in a Sheffield Shield match in Sydney. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-will-finish-as-one-of-the-greatest-fast-bowlers-glenn-maxwell-2640892-2024-11-27",
      "headline": "Jasprit Bumrah will finish as one of the greatest fast bowlers: Glenn MaxwellGlenn Maxwell said that Jasprit Bumrah will finish as one of the greatest fast bowlers of all time. He also praised Yashasvi Jaiswal for his great resolve while batting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/syed-mushtaq-ali-trophy-urvil-patel-rishabh-pant-fastest-hundred-2640877-2024-11-27",
      "headline": "Unsold in IPL auction, Gujarat's Urvil Patel hits second fastest T20 hundredSyed Mushtaq Ali Trophy: Urvil Patel broke Rishabh Pant's record for the fastest hundred by an Indian batter in T20 cricket. The right-hander hit a 28-ball hundred for Gujarat against Tripura on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-phil-salt-virat-kohli-rcb-2640864-2024-11-27",
      "headline": "RCB have always had fiery personalities: Salt on playing with KohliIPL 2025: Phil Salt said that he's ready to play alongside Virat Kohli after Royal Challengers Bengaluru RCB) bought him for a price of INR 11.50 crore in the auction that took place in Saudi Arabia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashish-nehra-reveals-why-shami-was-released-he-was-part-of-gts-retention-plan-2640856-2024-11-27",
      "headline": "Ashish Nehra reveals why Shami was released: He was part of GT's retention planIPL 2025 mega auction: Ashish Nehra revealed why Mohammed Shami was released by the franchise. Shami was sold for Rs 10 crore to SunRisers Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-ben-stokes-jacob-bethell-test-debut-2640836-2024-11-27",
      "headline": "Jacob Bethell has got something very special: Ben Stokes NZ vs ENG: England skipper Ben Stokes backed Jacob Bethell's selection saying that the Three Lions picked him after taking into account all factors. Bethell will make his Test debut at the Hagley Oval in Christchurch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/63-not-out-remembering-phil-hughes-on-10th-death-anniversary-2640814-2024-11-27",
      "headline": "63 not out: Remembering Phil Hughes on 10th death anniversary27 November marks the 10-year death anniversary of Australian cricketer Phil Hughes. His untimely death "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/atp-awards-2024-carlos-alcaraz-dominic-thiem-nominees-2640811-2024-11-27",
      "headline": "Carlos Alcaraz, Dominic Thiem amongst nominees for ATP Awards Carlos Alcaraz and Dominic Thiem are amongst the nominees for the Stefan Edberg Sportsmanship Award in the 2024 ATP Awards. Alcaraz won the French Open and Wimbledon earlier this year"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ms-dhoni-shah-rukh-khan-brand-market-report-cricketers-bollywood-2640788-2024-11-27",
      "headline": "Cricketers are bigger than Bollywood stars in the brand marketVirat Kohli, MS Dhoni, and Sachin Tendulkar have ranked higher than popular Bollywood actors, including Shah Rukh Khan and Amitabh Bachchan, in a latest Brand Endorser Report 2024 by Hansa Research. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-perth-test-hundred-explained-minor-adjustments-game-aus-vs-ind-2640779-2024-11-27",
      "headline": "Sunil Gavaskar, Matthew Hayden dissect Virat Kohli's comeback knock in Perth TestBorder-Gavaskar Trophy: Virat Kohli silenced his critics with a masterful century in the Perth Test, showcasing his ability to adapt and overcome challenges. Minor technical tweaks, particularly in his stance and shot selection, helped him rediscover his vintage form and play a part in India's memorable victory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/63-not-out-remembering-phil-hughes-on-10th-death-anniversary-2640814-2024-11-27",
      "headline": "63 not out: Remembering Phil Hughes on 10th death anniversary27 November marks the 10-year death anniversary of Australian cricketer Phil Hughes. His untimely death "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/atp-awards-2024-carlos-alcaraz-dominic-thiem-nominees-2640811-2024-11-27",
      "headline": "Carlos Alcaraz, Dominic Thiem amongst nominees for ATP Awards Carlos Alcaraz and Dominic Thiem are amongst the nominees for the Stefan Edberg Sportsmanship Award in the 2024 ATP Awards. Alcaraz won the French Open and Wimbledon earlier this year"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ms-dhoni-shah-rukh-khan-brand-market-report-cricketers-bollywood-2640788-2024-11-27",
      "headline": "Cricketers are bigger than Bollywood stars in the brand marketVirat Kohli, MS Dhoni, and Sachin Tendulkar have ranked higher than popular Bollywood actors, including Shah Rukh Khan and Amitabh Bachchan, in a latest Brand Endorser Report 2024 by Hansa Research. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-perth-test-hundred-explained-minor-adjustments-game-aus-vs-ind-2640779-2024-11-27",
      "headline": "Sunil Gavaskar, Matthew Hayden dissect Virat Kohli's comeback knock in Perth TestBorder-Gavaskar Trophy: Virat Kohli silenced his critics with a masterful century in the Perth Test, showcasing his ability to adapt and overcome challenges. Minor technical tweaks, particularly in his stance and shot selection, helped him rediscover his vintage form and play a part in India's memorable victory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-jasprit-bumrah-perth-test-ravi-shastri-2640774-2024-11-27",
      "headline": "Bumrah enjoys the responsibility of captaincy: Ravi Shastri AUS vs IND: Jasprit Bumrah drew praise from Wasim Akram and Ravi Shastri for his match-winning performance in the Perth Test which India won by 295 runs to take a 1-0 lead in the five-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-venkatesh-iyer-kkr-captaincy-conundrum-ipl-2025-mega-auction-2640770-2024-11-27",
      "headline": "Beyond Venkatesh Iyer: KKR face captaincy conundrum despite impressive IPL auctionDespite an impressive IPL 2025 Auction, KKR does seem to have a captaincy hole to fill in their new-look squad. While Venkatesh Iyer seems to be the main candidate, he may not be the only choice they have in their ranks. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/world-chess-championship-final-d-gukesh-ding-liren-game-two-draw-analysis-2640751-2024-11-27",
      "headline": "Analysis: How D Gukesh held Ding Liren to draw with black pieces in Game 2Indian Grandmaster D. Gukesh demonstrated resilience by securing a draw in the second game against reigning champion Ding Liren in the ongoing World Chess Championship on Tuesday. The game, largely uneventful, saw Gukesh, playing with black pieces, recover composure following his loss in the opening game due to a critical blunder in the French Defense. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wrestling-bajrang-punia-slapped-with-4-year-ban-for-violation-of-anti-doping-code-2640742-2024-11-26",
      "headline": "Bajrang Punia slapped with 4-year ban for violation of anti-doping codeOlympics bronze medallist Bajrang Punia has been handed a 4-year suspension by the National Anti-Doping Agency (NADA) for refusing to provide a urine sample during the selection trials for the national team. Bajrang was given a provisional suspension in April this year. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}