{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-156-points-lower-nifty-below-24400-adani-enterprises-falls-4-2720369-2025-05-06",
      "headline": "Sensex ends 156 points lower, Nifty below 24,400; Adani Enterprises falls 4%The BSE Sensex ended 155.77 points lower at 80,641.07, while the NSE Nifty50 fell 81.55 points to settle at 24,379.60. Most of the broader market indices also declined during the trading session due to high selling pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-denies-reports-of-stake-sale-to-japans-smbc-calls-it-speculative-2720360-2025-05-06",
      "headline": "Yes Bank denies reports of stake sale to Japan's SMBC, calls it 'speculative'The private sector lender clarified that while it regularly explores business opportunities, there is nothing material to disclose under current regulatory norms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saying-yes-to-a-joint-loan-here-is-how-it-can-affect-your-credit-score-2720344-2025-05-06",
      "headline": "Saying yes to a joint loan? Here's how it can affect your credit scoreEvery time an EMI is paid on time, it reflects positively on both borrowers' credit profiles. Over time, this builds your credit score. If you were added as a co-applicant to help someone get a loan because your own score was low, this is your chance to improve it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-5-common-mistakes-you-must-avoid-while-filing-your-tax-returns-2720287-2025-05-06",
      "headline": "ITR filing 2025: 5 common mistakes you must avoid while filing your tax returnsUsing the wrong ITR form can delay your tax processing or, worse, your return may get rejected. Also, filing your ITR is not the final step, you must also verify it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/is-the-global-economy-breathing-easier-as-trump-eases-up-on-tariffs-2720249-2025-05-06",
      "headline": "Is the worst over for global economy as Trump eases stance on tariffs?Even as Trump suggests deals are near with countries like India, Japan, and South Korea, and China reviews a fresh proposal from Washington, the global economy isn't breathing easy yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/opted-for-new-tax-regime-here-is-a-look-at-key-benefits-what-you-can-claim-itr-filing-2720230-2025-05-06",
      "headline": "Opted for new tax regime? Here's a look at key benefits, what you can claimThe government brought in the new tax regime to make things simpler for taxpayers. It gives you more tax slabs with lower rates, which means you may end up paying less tax."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-gives-up-listing-gains-slides-4-after-weak-debut-hold-or-sell-2720209-2025-05-06",
      "headline": "Ather Energy gives up listing gains, slides 4% after weak debut. Hold or sell?Ather Energy's stock opened at Rs 328 on the NSE, up 2.2% over its issue price of Rs 321, but slipped over 4% to an intraday low of Rs 308.95 amid weak market sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-down-today-know-why-sensex-nifty-falling-2720190-2025-05-06",
      "headline": "Sensex down over 200 points. Why is the stock market down today?As of 10:48 am, the BSE Sensex was down 213.43 points at 80,583.41, while the NSE Nifty50 slipped 72.40 points to 24,388.75. Broader indices saw sharper cuts, with the Nifty midcap and smallcap indices falling around 1% each, reflecting risk-off sentiment in domestic-focused sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-makes-lukewarm-market-debut-lists-just-2-percent-above-ipo-price-2720179-2025-05-06",
      "headline": "Ather Energy makes muted debut on Dalal Street, lists 2% above IPO priceAt the time of listing, the Bengaluru-based company was valued at around Rs 12,144 crore, slightly below its implied market capitalisation of Rs 12,300 crore at the upper end of the IPO price band (Rs 304–Rs 321)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/japans-smbc-likely-in-advanced-talks-to-buy-majority-stake-in-yes-bank-share-price-market-reaction-2720169-2025-05-06",
      "headline": "Explained: Why Yes Bank shares are rising todayYes Bank shares rose sharply as shareholders reacted positively to the news. At around 9:43 am, shares of the bank were trading 5.30% higher at Rs 18.69."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-over-80-points-nifty-above-24400-pharma-stocks-tumble-2720159-2025-05-06",
      "headline": "Sensex down over 80 points, Nifty above 24,400; pharma stocks tumbleThe BSE Sensex was down 28.27 points to trade at 80,768.57 around 9:24 am, while the NSE Nifty50 was down 10.85 points to 24,450.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-slips-snapping-9-day-rally-as-oil-prices-hit-4-year-low-2720098-2025-05-06",
      "headline": "Wall Street slips, snapping 9-day rally as oil prices hit 4-year lowWall Street's nine-day winning streak ended Monday as oil prices fell to a four-year low following an OPEC+ output boost. Tech stocks and Buffett's exit also weighed on markets.\r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-skips-priyanka-chopra-not-shah-rukh-khan-diljit-dosanjh-kiara-advani-in-stories-about-indians-at-met-gala-2025-2720283-2025-05-06",
      "headline": "Karan Johar is all praise for Indian celebs at Met Gala 2025, except for PriyankaFilmmaker Karan Johar reviewed the Met Gala 2025 looks of Indian celebrities. He mentioned everyone from Shah Rukh Khan to Diljit Dosanjh and Kiara Advani, but Priyanka Chopra wasn't to be found on his list. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-suriya-retro-director-karthik-subbaraj-overwhelmed-2720284-2025-05-06",
      "headline": "Rajinikanth watches Suriya's Retro, director Karthik Subbaraj is overwhelmedSuperstar Rajinikanth recently watched Suriya's 'Retro' and appreciated director Karthik Subbaraj. The filmmaker expressed his happiness with a special note on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pawandeep-rajan-health-update-multiple-fractures-under-observation-in-icu-2720279-2025-05-06",
      "headline": "Pawandeep Rajan suffered multiple fractures, in ICU and recovering: Singer's teamIndian Idol 12 winner Pawandeep Rajan met with a major accident on May 5 and is currently undergoing treatment in Noida. His team has provided an update on his health, assuring fans that he is doing fine now and is under observation in the ICU."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-instagram-post-about-met-gala-2025-with-turban-culture-mother-tongue-main-hoon-punjab-2720259-2025-05-06",
      "headline": "Main hoon Punjab: Diljit wraps Met Gala with 'turban, culture, mother tongue' For Diljit Dosanjh, heritage and culture came first and fashion later as he walked the blue carpet at the Met Gala 2025. The 41-year-old took a bit of Punjab's royal history in his Maharaja-inspired look at the fashion's biggest night. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/varun-tej-lavanya-tripathi-announce-pregnancy-2720246-2025-05-06",
      "headline": "Telugu actors Varun Tej, Lavanya Tripathi announce pregnancyTelugu actors Varun Tej and Lavanya Tripathi announced that they are expecting their first child. They shared the announcement on their social media pages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shakira-shares-car-with-diljit-dosanjh-says-hi-india-in-viral-met-gala-clip-2720238-2025-05-06",
      "headline": "Shakira shares car with Diljit Dosanjh, says 'Hi, India' in viral Met Gala clipDiljit Dosanjh reunited with Priyanka Chopra and Nick Jonas at the Met Gala. The singer even shared a car with Shakira while making his way to the prestigious event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-wins-hearts-as-he-supports-mother-to-be-kiara-advani-at-met-gala-2025-2720222-2025-05-06",
      "headline": "Sidharth Malhotra wins hearts as he supports mother-to-be Kiara at Met Gala 2025Sidharth Malhotra's support for pregnant wife Kiara Advani at Met Gala 2025 touched hearts, even without a red carpet appearance. A viral video and his heartfelt tribute online made their quiet moment the real showstopper."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-teaser-netflix-2720212-2025-05-06",
      "headline": "Squid Game 3 teaser: No dialogue, just dread as final game resumesNetflix's teaser for 'Squid Game' Season 3 hints at a darker, more dramatic finale as Seong Gi-hun awakens in a coffin, sparking theories about new game dynamics and unseen threats. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-introduces-himself-at-met-gala-fans-say-foreign-media-failed-to-recognise-him-2720192-2025-05-06",
      "headline": "SRK introduces himself at Met Gala, fans say foreign media failed to recognise himShah Rukh Khan's Met Gala debut was nothing short of iconic. In one of the viral moments from the blue carpet, the actor was seen introducing himself to the foreign media and fans thought the media failed to recognise him. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-on-owning-met-gala-2025-with-diamonds-legacy-and-grace-i-am-a-memory-from-home-2720185-2025-05-06",
      "headline": "I'm a memory from home: SRK on owning Met Gala 2025 with diamonds, legacy and graceShah Rukh Khan represented India at MET Gala 2025 in a black Sabyasachi suit teamed up with tons of diamonds. He later spoke to the media and, quite graciously, called himself a 'memory from home'.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-nervous-for-met-gala-sabyasachi-convinced-me-my-kids-suhana-khan-abram-khan-were-wowed-2720180-2025-05-06",
      "headline": "SRK says he was 'nervous' for Met Gala: Sabyasachi convinced me, my kids were wowedShah Rukh Khan was among the other prominent stars to attend the Met Gala 2025. During one of his interactions, the actor confessed feeling 'nervous' before the appearance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/raid-2-box-office-collection-day-5-detailed-report-ajay-devgn-film-en-route-to-rs-100-crore-2720165-2025-05-06",
      "headline": "Raid 2 box office Day 5: Ajay Devgn's film en route to Rs 100 croreThe benchmark of Rs 100 crore now seems like a cakewalk for 'Raid 2', which wrapped up a fantastic first weekend at the box office. The Monday collection for the film also looks decent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajaz-khan-nowhere-to-be-found-phone-switched-off-after-fir-in-rape-case-police-2720152-2025-05-06",
      "headline": "Ajaz Khan's phone switched off after FIR in rape case, searching for him: PoliceActor Ajaz Khan seems to have gone absconding after Mumbai Police registered an FIR against him in a rape case filed by a woman alleging that he raped her on the pretext of marriage and a role in his show 'House Arrest'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-carasses-baby-bump-in-black-gaurav-gupta-ensemble-2720126-2025-05-06",
      "headline": "Kiara Advani caresses baby bump in black Gaurav Gupta ensembleMother-to-be Kiara Advani made a stunning debut at the Met Gala as she flaunted her baby bump on the blue carpet. The actor wore an ensemble by Indian designer Gaurav Gupta. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/met-gala-2025-nick-jonas-adjusting-priyanka-chopra-gown-pure-husband-goals-2720117-2025-05-06",
      "headline": "Met Gala 2025: Nick Jonas adjusting Priyanka Chopra's gown is pure husband goalsPriyanka Chopra and Nick Jonas return to the Met Gala 2025 with their amazing outfits while following this year's theme, 'Superfine: Tailoring Black Style'. One of the viral moments featured Nick helping his wife fix her gown at the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rihanna-pregnant-with-third-child-debuts-baby-bump-at-met-gala-2025-glbs-2720112-2025-05-06",
      "headline": "Rihanna pregnant with third child, debuts baby bump at Met Gala 2025Rihanna revealed her third pregnancy at the 2025 Met Gala, dazzling fans with a baby bump reveal. She and A$AP Rocky continue to charm the world with their growing family.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-strikes-iconic-pose-at-met-gala-2025-proves-hes-here-to-rule-2720111-2025-05-06",
      "headline": "Shah Rukh Khan strikes iconic pose at MET Gala 2025, proves he's here to ruleShah Rukh Khan's Met Gala debut was one of the highly anticipated appearances. Amid much craze and fanfare, the superstar stunned all with his signature pose at the annual fashion event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/netflix-star-millena-brandao-dies-at-11-after-mysterious-illness-in-brazil-glbs-2720095-2025-05-06",
      "headline": "Netflix star Millena Brandão dies at 11 after mysterious illness in BrazilMillena Brandão, 11-year-old actress from Netflix's Sintonia, died after a mysterious illness and multiple cardiac arrests. Her condition rapidly worsened after early symptoms were misdiagnosed as dengue.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/thunderbolts-twist-revealed-marvel-confirms-team-is-the-new-avengers-glbs-2720093-2025-05-06",
      "headline": "Thunderbolts twist revealed: Marvel confirms team is the New AvengersMarvel reveals Thunderbolts' secret identity as the New Avengers just days after release, surprising fans. The post-credits twist echoes comic lore and reshapes the MCU's future lineup.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-congress-mallikarjun-kharge-pm-narendra-modi-intel-three-days-before-cancelled-visit-2720307-2025-05-06",
      "headline": "PM had intel 3 days before J&K attack, cancelled own visit: Mallikarjun KhargeCongress chief Mallikarjun Kharge claimed that PM Narendra Modi cancelled his own visit to Kashmir after receiving an intel report on a possible attack in Jammu and Kashmir three days before the Pahalgam terror attack happened."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-tensions-mock-drills-defence-locations-up-delhi-bengal-mumbai-pahalgam-terror-attack-full-list-here-2720224-2025-05-06",
      "headline": "Mega security drill at 259 sites tomorrow, including Delhi, Mumbai and ChennaiAmid rising India-Pakistan tensions after the April 22 Pahalgam terror attack, the Centre has announced a nationwide civil defence drill on May 7 across 259 locations. The mock drill will include air raid sirens, blackout protocols, and public training, with officials urging citizens to keep torches, candles, and cash ready."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pahalgam-attack-india-pakistan-war-military-response-turkish-military-aircraft-warship-land-karachi-2719839-2025-05-06",
      "headline": "What are Turkish warship, military planes doing in Pak amid war fears?As a panicked Pakistan waits for an Indian military response to the Pahalgam terror attack, it looks to be getting military help from its \"brother\" Turkey. In one week, a Turkish Air Force C-130 aircraft and a warship reached Pakistan. While both Turkey and Pakistan have denied claims of military hardware delivery, the timing and nature of these visits suggest they may carry more strategic weight than acknowledged."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-civil-defence-drills-and-the-many-messages-india-wants-to-send-2720319-2025-05-06",
      "headline": "India's civil defence drills and the many messages India wants to sendThe sheer breadth of the exercise — covering 244 districts and involving civilian participation in blackouts, air raid sirens, evacuation drills, and camouflaging vital infrastructure — marks a departure from the limited, targeted responses of the past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/india-at-met-gala-2025-srk-kiara-advani-diljit-dosanjh-isha-ambani-priyanka-chopra-2720208-2025-05-06",
      "headline": "India at the Met Gala 2025: The hits (and the misses)With a strong lineup of Indian celebrities in attendance, Met Gala 2025 gave us some memorable fashion moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-nationwide-mock-defence-security-drills-cash-torch-medical-kits-electronic-failure-focus-check-details-2720252-2025-05-06",
      "headline": "Keep cash, torch, medical kits handy: What tomorrow's security drill will focus onCitizens will be trained in key civil defence measures, including how to respond to air raid sirens, conduct themselves during a blackout, and maintain basic emergency supplies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-isolated-global-stage-allies-friends-china-gulf-nations-pahalgam-terror-attack-2720227-2025-05-06",
      "headline": "Left out in the cold, Pakistan struggling to find friends as terror bitesWhile tensions between India and Pakistan after terror attacks are not new, what has changed this time is the reaction of some of Islamabad's allies to the April 22 massacre in Pahalgam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tronto-delhi-air-india-flight-diverted-frankfurt-after-lavatories-clogged-2720362-2025-05-06",
      "headline": "Toronto-Delhi Air India flight diverted to Frankfurt due to clogged toiletsAn Air India flight from Toronto to Delhi was diverted to Frankfurt after multiple lavatories became clogged, marking the second such incident in under two months involving a wide-body aircraft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/kamala-harris-makes-met-gala-debut-in-classic-off-white-gown-2720286-2025-05-06",
      "headline": "Kamala Harris makes Met Gala debut in classic Off-White gownKamala Harris stepped onto the Met Gala red carpet for the first time in a sleek black-and-cream off-white gown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/dont-forget-1971-surrender-baloch-leader-akhtar-mengal-hits-back-pakistan-army-chief-asim-munir-2720356-2025-05-06",
      "headline": "Don't forget 1971 surrender: Baloch leader hits back at Pakistan army chiefGeneral Asim Munir's threat to Baloch separatists drew a sharp rebuke from former Balochistan Chief Minister Akhtar Mengal, who reminded him of Pakistan's humiliating defeat in the 1971 war.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-built-underground-bases-bunker-network-wealthy-near-extinction-event-2720325-2025-05-06",
      "headline": "US built underground 'city' for rich to survive doomsday, claims ex-officialFormer assistant secretary of Housing and Urban Development Catherine Austin Fitts alleged that $21 trillion in taxpayer funds were funnelled into this clandestine project between 1998 and 2015."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-instagram-post-about-met-gala-2025-with-turban-culture-mother-tongue-main-hoon-punjab-2720259-2025-05-06",
      "headline": "Main hoon Punjab: Diljit wraps Met Gala with 'turban, culture, mother tongue' For Diljit Dosanjh, heritage and culture came first and fashion later as he walked the blue carpet at the Met Gala 2025. The 41-year-old took a bit of Punjab's royal history in his Maharaja-inspired look at the fashion's biggest night. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-live-updates-un-security-council-india-pakistan-tensions-jk-attack-pm-modi-victims-air-force-army-navy-2720140-2025-05-06",
      "headline": "Live: NSA Ajit Doval meets PM, Home Ministry convenes crucial meetingPahalgam terror attack live updates: Amid rising India-Pakistan tensions in the wake of the Pahalgam terror attack in which 26 people were killed by terrorists, the United Nations Security Council has held closed-door consultations where envoys called for restraint and dialogue. Meanwhile, a parliamentary panel has sought details from two key ministries overseeing information flow on the action they have planned against social media platforms and influencers who \"seem to be working against national interest\", following the Pahalgam terror attack. Follow indiatoday.in for more updates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistani-national-detained-caught-trying-to-enter-india-third-detention-three-days-pahalgam-terror-attack-tension-2720304-2025-05-06",
      "headline": "Another Pakistani caught trying to enter India, third detention in 3 daysThree Pakistanis, including two civilians and a soldier, have been arrested along the India-Pakistan border in separate infiltration attempts after the April 22 Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/the-lowdown-was-operation-blue-star-a-mistake-2720147-2025-05-06",
      "headline": "What was Operation Bluestar? Did Army walk into a trap?In response to a question on Operation Bluestar, Congress leader Rahul Gandhi acknowledged the historical wrongs committed by his party during the 1984 anti-Sikh riots. In this edition of The Lowdown, we take a look at the inside story of Operation Bluestar, the terrible fallout and its far-reaching ramifications.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/prince-louis-hair-flick-moment-with-big-brother-george-goes-viral-video-2720189-2025-05-06",
      "headline": "Prince Louis' hair-flick moment with big brother George goes viral. Watch videoA video of Prince Louis' hilarious hair-flick moment with Prince George went viral on social media for all the right reasons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-breaks-silence-on-quitting-india-rcb-captaincy-2720288-2025-05-06",
      "headline": "Virat Kohli breaks silence on quitting as India, RCB captain: Needed to be happyVirat Kohli revealed that the relentless pressure of leadership eventually pushed him to step down as captain of both the Indian team and Royal Challengers Bangalore. He also admitted that, during that challenging period, he briefly considered leaving RCB.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/united-nations-security-council-meeting-pakistan-india-tension-grill-concerns-nuclear-talks-missile-tests-pahalgam-terror-attack-2720173-2025-05-06",
      "headline": "Pak fails to sway UN as members question LeT links, missile tests: SourcesIn an attempt to divert attention from the Pahalgam terror attack that killed 26 civilians, Pakistan brought up the Kashmir issue, accusing India of military buildup and making provocative statements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-house-speaker-mike-johnson-support-india-pakistan-pahalgam-terror-attack-energy-resources-donald-trump-war-terrorism-2720194-2025-05-06",
      "headline": "Will help India with resources to fight terrorism: US Speaker after J&K attackUS House Speaker Mike Johnson on Tuesday pledged full support for India's fight against terrorism, promising energy and resources to aid its efforts amid heightened tensions with Pakistan following the Pahalgam attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/sabyasachi-manish-malhotra-at-met-when-designers-walk-the-carpet-2720357-2025-05-06",
      "headline": "Sabyasachi, Manish Malhotra at Met: When designers walk the carpetSabyasachi and Manish Malhotra stepped onto the Met steps dressed in their own creations, embodying the night's theme – \"Superfine: Tailoring Black Style\" – that celebrated Black style, particularly focusing on the history and cultural significance of Black dandyism and menswear tailoring."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-sirens-blackouts-and-bunker-drills-indias-mock-war-day-explained-2720168-2025-05-06",
      "headline": "India's first mock drill since 1971 war tomorrow: What will happen, why it mattersDuring the drills, air raid warning sirens will be activated, and civilians and students will be trained in civil defence to protect themselves in the event of a hostile attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-teaser-netflix-2720212-2025-05-06",
      "headline": "Squid Game 3 teaser: No dialogue, just dread as final game resumesNetflix's teaser for 'Squid Game' Season 3 hints at a darker, more dramatic finale as Seong Gi-hun awakens in a coffin, sparking theories about new game dynamics and unseen threats. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/opted-for-new-tax-regime-here-is-a-look-at-key-benefits-what-you-can-claim-itr-filing-2720230-2025-05-06",
      "headline": "Opted for new tax regime? Here's a look at key benefits, what you can claimThe government brought in the new tax regime to make things simpler for taxpayers. It gives you more tax slabs with lower rates, which means you may end up paying less tax."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kashvee-gautam-ruled-out-of-tri-series-due-to-injury-to-be-replaced-by-kranti-goud-2720363-2025-05-06",
      "headline": "Kashvee Gautam ruled out of tri series due to injury, to be replaced by Kranti GoudIndia women's all-rounder Kashvee Gautam has been ruled out of the ongoing tri series due to an injury. Gautam made her debut during the first match of the series and has remained wicketless after three matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-rcb-podcast-mark-boucher-impact-2720355-2025-05-06",
      "headline": "He stunned me: Virat Kohli reveals ex-RCB star's massive impact on his young careerIPL 2025: Speaking to Mayanti Langer on an RCB podcast, Virat Kohli recalled how Mark Boucher's guidance helped him understand his potential and the work he needed to put in to make a seamless transition to international cricket."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/french-minister-apologises-to-liverpool-fans-for-2022-champions-league-final-blame-2720337-2025-05-06",
      "headline": "French minister apologises to Liverpool fans over 2022 Champions League chaosFrance's Justice Minister Gérald Darmanin has issued an apology to Liverpool fans for wrongly blaming them for the chaotic scenes before the 2022 Champions League final at the Stade de France.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-breaks-silence-on-quitting-india-rcb-captaincy-2720288-2025-05-06",
      "headline": "Virat Kohli breaks silence on quitting as India, RCB captain: Needed to be happyVirat Kohli revealed that the relentless pressure of leadership eventually pushed him to step down as captain of both the Indian team and Royal Challengers Bangalore. He also admitted that, during that challenging period, he briefly considered leaving RCB.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-recalls-2019-world-cup-heartbreak-it-was-a-horrible-hangover-2720278-2025-05-06",
      "headline": "Virat Kohli recalls 2019 World Cup heartbreak: It was a horrible hangoverStar India batter Virat Kohli recalled India's heartbreaking loss in the 2019 World Cup semi-final against New Zealand and compared it to a 'horrible hangover'. India lost to New Zealand by 18 runs and got knocked out of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-hansi-flick-lamine-yamal-on-barcelona-vs-inter-milan-2720244-2025-05-06",
      "headline": "Barcelona's Hansi Flick praises Lamine Yamal's impact ahead of Inter clashBarcelona manager Hansi Flick has praised 17-year-old Lamine Yamal ahead of their UEFA Champions League semifinal second leg against Inter Milan in Italy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-slams-virat-kohlis-strike-rate-critics-gives-new-nickname-to-batting-star-2720234-2025-05-06",
      "headline": "AB de Villiers slams Kohli's strike rate critics, gives new nickname to batterFormer South Africa cricketer AB de Villiers has slammed star India batter Virat Kohli's critics amid his prolific run in the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-sudharsan-shubman-gill-gujarat-titans-captaincy-2720220-2025-05-06",
      "headline": "Shubman Gill is a very competitive captain: Sai Sudharsan praises GT skipperGujarat Titans opener Sai Sudharsan praised skipper Shubman Gill as a competitive captain while highlighting the strong chemistry behind their successful opening partnership.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-gt-predicted-xi-team-news-head-to-head-mumbai-pitch-2720206-2025-05-06",
      "headline": "Will Gujarat be able to stop Mumbai's winning juggernaut and claim top spot?Mumbai Indians (MI) are set to take on Gujarat Titans (GT) in Match 56 of the Indian Premier League 2025 (IPL 2025) at Wankhede Stadium in Mumbai. MI are on a six-match winning streak while Gujarat are also in fine form with both their batting and bowling firing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-fans-burn-alexander-arnold-jersey-after-defender-announces-departure-2720181-2025-05-06",
      "headline": "Liverpool fans burn Alexander-Arnold's jersey after defender announces departureLiverpool fans burned Trent Alexander-Arnold's jersey in protest after the English defender announced his decision to leave the club at the end of the 2024–25 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-always-said-i-will-be-next-sachin-tendulkar-reveals-school-teacher-2720170-2025-05-06",
      "headline": "Virat Kohli always said I will be next Sachin Tendulkar, reveals school teacherStar India batter Virat Kohli's school teacher has recently revealed that he had the desire to be the next Sachin Tendulkar right from his childhood and worked hard to excel both in cricket and academics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-slams-virat-kohlis-strike-rate-critics-gives-new-nickname-to-batting-star-2720234-2025-05-06",
      "headline": "AB de Villiers slams Kohli's strike rate critics, gives new nickname to batterFormer South Africa cricketer AB de Villiers has slammed star India batter Virat Kohli's critics amid his prolific run in the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-sudharsan-shubman-gill-gujarat-titans-captaincy-2720220-2025-05-06",
      "headline": "Shubman Gill is a very competitive captain: Sai Sudharsan praises GT skipperGujarat Titans opener Sai Sudharsan praised skipper Shubman Gill as a competitive captain while highlighting the strong chemistry behind their successful opening partnership.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-gt-predicted-xi-team-news-head-to-head-mumbai-pitch-2720206-2025-05-06",
      "headline": "Will Gujarat be able to stop Mumbai's winning juggernaut and claim top spot?Mumbai Indians (MI) are set to take on Gujarat Titans (GT) in Match 56 of the Indian Premier League 2025 (IPL 2025) at Wankhede Stadium in Mumbai. MI are on a six-match winning streak while Gujarat are also in fine form with both their batting and bowling firing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-fans-burn-alexander-arnold-jersey-after-defender-announces-departure-2720181-2025-05-06",
      "headline": "Liverpool fans burn Alexander-Arnold's jersey after defender announces departureLiverpool fans burned Trent Alexander-Arnold's jersey in protest after the English defender announced his decision to leave the club at the end of the 2024–25 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-always-said-i-will-be-next-sachin-tendulkar-reveals-school-teacher-2720170-2025-05-06",
      "headline": "Virat Kohli always said I will be next Sachin Tendulkar, reveals school teacherStar India batter Virat Kohli's school teacher has recently revealed that he had the desire to be the next Sachin Tendulkar right from his childhood and worked hard to excel both in cricket and academics."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}