{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/itc-hotels-bse-nse-market-listing-eligibility-and-other-details-2670948-2025-01-28",
      "headline": "ITC Hotels to list on BSE, NSE tomorrow. Check eligibility and other key details Earlier this month, ITC Ltd allotted equity shares of ITC Hotels amounting to Rs 125.11 crore to its shareholders and the latter ceased to be a subsidiary of ITC ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-big-liquidity-boost-what-it-means-for-the-economy-central-bank-to-inject-rs-60000-crore-into-economy-know-the-3-steps-2671369-2025-01-28",
      "headline": "RBI's big liquidity boost: What it means for the economy The RBI has announced OMO purchase auctions of Government of India securities for an aggregate amount of Rs 60,000 crore in three tranches of Rs 20,000 crore each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-higher-but-volatility-caps-gains-key-things-to-know-2671362-2025-01-28",
      "headline": "Sensex, Nifty end higher but volatility caps gains. All you need to knowStock Market Today: The S&P BSE Sensex closed 535.24 points higher at 75,901.41, while the NSE Nifty settled 146.90 points higher at 22,976.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rebounds-today-but-volatility-remains-high-investor-strategy-2671291-2025-01-28",
      "headline": "Stock market rebounds but remains volatile. What should investors do? Indian Share Market: Should the increased stock market volatility prompt investors to exit the market, or is it better to stay calm and stick with their investments? Should they even consider adding more to their portfolios?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/200-uk-companies-to-move-to-permanent-4-day-work-week-with-no-pay-loss-2671268-2025-01-28",
      "headline": "200 UK companies sign up for 4-day workweek amid '70-hour debate' in IndiaThe 4 Day Week Foundation campaign director, mentioned that the traditional 9-5, five-day working week which was invented 100 years ago, is now outdated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-share-price-ground-boieng-737-max-jet-operational-january-29-2671246-2025-01-28",
      "headline": "Explained: Why SpiceJet shares rose 4% todaySpiceJet shares were trading 3.94% higher at Rs 45.60 on the Bombay Stock Exchange at around 12:54 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ubs-to-lay-off-nearly-3000-employees-post-credit-suisse-takeover-says-report-2671194-2025-01-28",
      "headline": "UBS to lay off nearly 3,000 employees post Credit Suisse takeover: Report UBS Group AG: The impacted employees have been given an option to join a program that allows up to a year to find a new role within the bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-up-700-points-nifty-gains-key-reasons-2671218-2025-01-28",
      "headline": "Sensex jumps 900 points: 3 things to know about today's stock market rallyShare Market: While global markets were hit due to a slide in AI and tech stocks, Sensex and Nifty displayed resilience and surged sharply, supported by a rally in heavyweight banking and financial services stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/deepseek-china-ai-startup-global-technology-stocks-selloff-wall-street-nvidia-openai-microsoft-2671177-2025-01-28",
      "headline": "Explained: Why China's DeepSeek triggered a slide in global AI stocksChinese startup DeepSeek has turned up the heat in the global AI race and its new models have raised hard questions about whether US companies can keep their edge as the landscape shifts beneath their feet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-open-higher-despite-tech-sell-off-sparked-by-deepseek-2671137-2025-01-28",
      "headline": "Sensex, Nifty open higher despite global tech sell-off sparked by DeepSeek Share Market Today: The S&P BSE Sensex was up 366.45 points to 75,732.62 at around 9:16 am, while the NSE Nifty50 rose 111.25 points to trade at 22,940.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-us-chipmaker-biggest-market-loss-in-history-deepseek-china-tech-shockwaves-2671112-2025-01-28",
      "headline": "Nvidia plunges $593 billion as DeepSeek soars, biggest market loss in historyUS chipmaker Nvidia dived 17 per cent, wiping off nearly USD 593 billion in the biggest market capitalisation loss in history, following a wave of selling as China's DeepSeek developed a free AI assistant using lower-cost chips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-business-loan-differs-from-a-personal-loan-interest-emis-guideline-2670901-2025-01-27",
      "headline": "How business loan differs from a personal loan?Personal loans can be taken for almost anything, be it meeting medical expenses, buying a car or house, for marriage of a son or daughter, etc."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-oil-turns-to-sweet-crude-as-russian-oil-supplies-tighten-report-2670897-2025-01-27",
      "headline": "Indian Oil turns to sweet crude as Russian oil supplies tighten: ReportThe United States recently imposed sweeping sanctions on Russia, targeting its oil producers and shipping networks. This has made it difficult for many countries, including India, to continue sourcing Russian crude oil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/this-ceos-4-month-salary-beats-sunder-pichai-and-tim-cook-annual-pay-who-is-he-2670836-2025-01-27",
      "headline": "This CEO's 4-month salary beats Sunder Pichai and Tim Cook's annual pay. Who is he?Niccol, who was earlier the CEO of Chipotle, joined Starbucks in September 2024. He was granted a $5 million sign-on bonus within the first month of stepping into his new role as revealed in company filings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zoho-founder-sridhar-vembu-to-take-new-role-steps-down-as-ceo-social-media-post-shailesh-kumar-davey-2670853-2025-01-27",
      "headline": "Zoho founder Sridhar Vembu to take new role, steps down as CEOSridhar Vembu resigns as Zoho CEO: As part of the leadership transition, Sridhar Vembu has handed over the role of group CEO to Shailesh Kumar Davey, a co-founder of the company."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-dalal-street-bleeds-sensex-tanks-824-points-nifty-below-23000-2670815-2025-01-27",
      "headline": "Dalal Street bleeds: Sensex tanks 824 points, Nifty below 23,000The S&P BSE Sensex was down 824.29 points to close at 75,366.17, while the NSE Nifty50 lost 263.05 points to end at 22,829.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-government-may-prioritise-infrastructure-and-introduce-supply-chain-reforms-2670760-2025-01-27",
      "headline": "Budget 2025: Will government prioritise infrastructure and supply-chain reforms? Budget 2025 Expectations: Experts hope that Budget 2025 might announce key reforms to strengthen the infrastructure sector, which is the backbone of the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shark-tank-india-judge-startups-losing-money-harsh-goenka-shares-post-x-2670790-2025-01-27",
      "headline": "Are Shark Tank India judges losing money? Harsh Goenka shares insightsHarsh Goenka, Chairman of RPG Group, recently shared insights about financial data that revealed losses in companies owned or co-founded by some of the Shark Tank India judges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-check-expected-salary-hike-fitment-factor-and-key-faqs-2670704-2025-01-27",
      "headline": "8th Pay Commission: Check expected salary hike, and key FAQs8th Pay Commission: The government will soon appoint a chairman and two members to the panel to recommend changes in the pay structure of central government employees."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-investors-lose-rs-10-lakh-crore-whats-ahead-for-dalal-street-sensex-nifty-2670712-2025-01-27",
      "headline": "Stock market crash: Investors lose Rs 10 lakh crore. What's ahead for D-Street? Investors on Dalal Street faced losses as stock markets continued to decline, bringing the market capitalisation of all listed companies on the Bombay Stock Exchange (BSE) down. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-interacts-with-team-on-set-of-his-netflix-series-stardom-2671422-2025-01-28",
      "headline": "Watch: Aryan Khan interacts with team on set of his Netflix series StardomSuperstar Shah Rukh Khan's son Aryan Khan is all set to make his showbiz debut with the Netflix series Stardom, which he will be directing. It will reportedly star Mona Singh in a pivotal role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rekha-brings-elegance-to-ghum-hai-kisikey-pyaar-meiin-promo-watch-2671377-2025-01-28",
      "headline": "Rekha brings elegance to Ghum Hai Kisikey Pyaar Meiin promo as show takes new leapRekha introduces new characters in the promo of Ghum Hai Kisikey Pyaar Meiin's new season, which promises to explore love and sacrifice. The show will premiere on January 30 at 8 pm on Star Plus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/black-warrant-kartar-ujagar-singh-hanging-case-real-story-zahaan-kapoor-vikramaditya-motwane-2671344-2025-01-28",
      "headline": "Black Warrant's Kartar-Ujagar Singh and their real-story: Hanged for Rs 500?Vikramaditya Motwane's Black Warrant shows the real-life story of two brothers, Kartar and Ujagar Singh, who were executed for a crime orchestrated by a Delhi doctor. But why were they hanged while the man who hired him walked free? Read on to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-2-actors-yim-siwan-and-jo-yuri-on-squid-game-2-bollywood-bts-v-cameo-rumours-2671331-2025-01-28",
      "headline": "Exclusive: Yim Si-wan, Jo Yu-ri talk about Squid Game 2, Bollywood, and moreYim Si-wan and Jo Yu-ri, stars of Netflix's Squid Game 2, discussed their roles and aspirations for lighter dramas in an exclusive interview with India Today Digital. They also revealed interest in Bollywood and reacted to BTS V cameo rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rakhi-sawant-third-marriage-shaadi-pakistan-mein-hogi-2671310-2025-01-28",
      "headline": "Rakhi Sawant plans to marry again: 'Shaadi Pakistan mein hogi, Islamic rituals'Rakhi Sawant shared her plans to marry a Pakistani suitor, Dodi Khan, in Pakistan, reception in India, and honeymoon in Europe. The Bigg Boss fame was previously married to businessman Adil Khan Durrani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lady-gaga-announces-new-album-mayhem-2671232-2025-01-28",
      "headline": "Lady Gaga announces new album MayhemPop star Lady Gaga has announced her new album, Mayhem, which will release in March. It will consist of 14 songs in total. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-concert-on-disney-hotstar-83-lakh-views-165-crore-minutes-watched-2671205-2025-01-28",
      "headline": "Coldplay Concert on Disney+ Hotstar: 83 lakh views, 16.5 crore minutes watchedBritish rock band Coldplay's Ahmedabad concert, which was held on January 26, invited a whopping 83 lakh views. The music group also performed in Mumbai. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/video/it-exclusive-wi-ha-joon-on-bts-v-cameo-rumours-in-squid-game-3-spills-the-beans-on-s2-2671155-2025-01-28",
      "headline": "IT Exclusive: Wi Ha-joon on BTS' V cameo rumours in Squid Game 3, spills the beans on S2In an exclusive chat with India Today's Bhavna Agarwal, Wi Ha-jun of Squid Game shared insights on staying grounded despite his meteoric rise to fame, addressed concerns about Jun-ho's reduced screen time in Season 2, and expressed his desire to star in a Bollywood action movie. He also reacted to rumors of BTS' V making a cameo in Squid Game 3."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/video/it-exclusive-squid-game-2s-lee-byung-hun-on-frontman-gi-hun-bollywood-working-in-hollywood-2671151-2025-01-28",
      "headline": "IT Exclusive: Squid Game 2's Lee Byung-hun on Frontman-Gi-hun, BollywoodIn an exclusive chat with India Today's Bhavna Agarwal, Squid Game actor Lee Byung-hun explored his character's evolution into an active player this season, the nuanced dynamics with Gi-hun (Lee Jung-jae), and the rising global prominence of Korean content. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jaideep-ahlawat-to-face-off-against-manoj-bajpayee-in-the-family-man-3-2671005-2025-01-27",
      "headline": "Jaideep Ahlawat to face off against Manoj Bajpayee in The Family Man 3: ReportPataal Lok's Jaideep Ahlawat is expected to play Manoj Bajpayee's nemesis in The Family Man 3. The makers wrapped up shooting the web series  in December 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sharda-sinha-son-calls-her-long-awaited-padma-vibhushan-honour-matter-of-pride-2670945-2025-01-27",
      "headline": "Sharda Sinha's son calls her 'long awaited' Padma Vibhushan honour 'matter of pride'Sharda Sinha, the legendary folk singer known for her Chhath songs, was posthumously awarded the Padma Vibhushan. Her son called it a proud moment for Bihar and a message to future generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-chris-martin-and-actor-dakota-johnson-at-maha-kumbh-2670923-2025-01-27",
      "headline": "Watch: Coldplay's Chris Martin and actor Dakota Johnson at Maha KumbhColdplay's lead singer Chris Martin and his partner and actor Dakota Johnson were seen arriving at the Maha Kumbh Mela 2025. The band recently concluded the final leg of its Indian concert in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-actor-wi-ha-jun-wants-to-do-a-bollywood-action-film-2670878-2025-01-27",
      "headline": "Squid Game actor Wi Ha-jun wants to do a Bollywood action filmSouth Korean star Wi Ha-jun wants to do a Bollywood action film. In a conversation with India Today Digital, he also opened up about BTS singer V's rumoured cameo appearance in Squid Game Season 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-trailer-sanya-malhotra-nishant-dahiya-kanwaljit-singh-zee5-premiere-on-february-7-2670852-2025-01-27",
      "headline": "Mrs trailer: Sanya Malhotra leads film about a woman's quest for her identityThe trailer of Mrs released on January 27. Featuring Sanya Malhotra in the main role, the film will release on Zee 5 on February 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-wont-perform-infrastructure-remark-social-media-criticism-reactions-coldplay-ahmedabad-concert-2670783-2025-01-27",
      "headline": "X users turn on Diljit Dosanjh after Coldplay's Ahmedabad triumph: Stop complainingAfter Coldplay's massive final concert in Ahmedabad, singer Diljit Dosanjh came under fire from X users for his remarks that he would not perform in India again due to inadequate infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-lee-byung-hun-on-squid-game-2-frontman-chemistry-with-gi-hun-hollywood-and-indian-cinema-2670759-2025-01-27",
      "headline": "Exclusive: Lee Byung-hun on Lee Jung-jae, Squid Game 2, working in BollywoodLee Byung-hun recently sat down with India Today Digital where he discussed Squid Game, his chemistry with Lee Jung-jae, and if he would work in Bollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/watch-video-singer-guru-randhawa-celebrates-republic-day-soldiers-in-baramulla-kashmir-2670727-2025-01-27",
      "headline": "Watch: Singer Guru Randhawa celebrates Republic Day with soldiers in KashmirGuru Randhawa marked Republic Day in Baramulla, Kashmir, with soldiers. He paid tribute to their service and was honoured by the Indian Army."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-makes-history-with-ahmedabad-concert-but-it-is-not-a-world-record-2670745-2025-01-27",
      "headline": "Coldplay makes history with Ahmedabad concert, but it's not a world recordColdplay on Sunday created history by delivering its biggest-ever concert in Ahmedabad, Gujarat. However, the band couldn't surpass the world record of having the largest number of attendees at a concert. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhoom-dhaam-trailer-pratik-gandhi-and-yami-gautam-promise-a-fun-valentines-film-2670729-2025-01-27",
      "headline": "Dhoom Dhaam trailer: Pratik Gandhi and Yami Gautam promise a fun Valentine's filmThe first trailer of the upcoming Netflix release, Dhoom Dhaam, is here. The film promises an exciting blend of romance and adventure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-martin-dakota-johnson-stroll-in-ahmedabad-post-coldplays-biggest-concert-january-26-2670659-2025-01-27",
      "headline": "Chris Martin, Dakota Johnson stroll in Ahmedabad post Coldplay's biggest concertChris Martin and Dakota Johnson were seen strolling in Ahmedabad post Coldplay's grand concert. The couple was spotted on Judges Road, surrounded by fans and bodyguards. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-icc-cricketer-of-the-year-award-emulates-virat-kohli-2671447-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jasprit Bumrah becomes 1st Indian pacer to win ICC Cricketer of the Year awardJasprit Bumrah has emulated the likes of Sachin Tendulkar and Virat Kohli to become ICC's men's Cricketer Of The Year for his incredible performance in 2024. He became the first Indian pacer to win the award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-summons-sri-lankan-envoy-fishermen-injured-firing-2671355-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Unacceptable: India summons Sri Lankan envoy after 5 fishermen injured in firingAn incident of firing by the Sri Lankan Navy during the apprehension of 13 Indian fishermen in the proximity of Delft Island was reported in the early hours of Tuesday. India has lodged a strong protest with the Sri Lankan envoy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sam-pitroda-controversy-illegal-bangladeshi-migrants-india-bjp-delhi-elections-2671323-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sam Pitroda, again. Remark on illegal Bangladeshis sparks row, gives BJP ammoThe controversial remarks by Sam Pitroda, in a video that has gone viral, come days ahead of the Delhi elections, where illegal immigration has been a burning topic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-global-strategy-ai-deepseek-nvidia-chatgpt-sixth-generation-fighter-jets-us-trump-2671223-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DeepSeek to sixth-gen fighter jets: How China is shaking up the worldDeepSeek: Donald Trump's inauguration may have taken the centerstage in the past few days, but it is China that is shaking the global landscape with groundbreaking advancements in fighter jets and artificial intelligence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-2025-shahi-snan-airfare-soar-formula-decide-ticket-prices-prayagraj-delhi-mumbai-dgca-what-is-happening-2671352-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Airfare unfair? What formula do airlines use to decide ticket pricesAirfares to and from Prayagraj have shot up fivefold on Shahi Snan days of Maha Kumbh. But Kumbh or no Kumbh, airfares remain sky-high in India all year round. There are several questions on fare monitoring and fair-play. The biggest question, amid allegations of profiteering, is what formula airlines use to determine ticket prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-live-score-3rd-t20i-ind-eng-score-updates-rajkot-2671457-2025-01-28?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "3rd T20I Live Score: India eye series win RajkotIndia (IND) vs England (ENG) 3rd T20I Live Score and Updates: India will face England in Tuesday's third match of the five T20I series at the Niranjan Shah Stadium in Rajkot. India have taken a 2-0 lead and England must win the Rajkot encounter to stay alive in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/who-is-ruby-dhalla-indian-origin-politician-gunning-for-canada-prime-minister-justin-trudeaus-job-2671365-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Ruby Dhalla, Indian-origin politician gunning for Justin Trudeau's job?Ruby Dhalla is aiming to succeed Justin Trudeau as the leader of the Liberal Party, a role that could lead to the prime ministership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-maharajas-have-rights-remark-bjp-jyotiraditya-scindia-congress-pawan-khera-row-2671312-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rahul Gandhi says BJP wants India where 'maharajas' have rights, Scindias reactCongress leader Rahul Gandhi claimed that \"maharajas (kings) enjoyed rights\" while the backward classes, including Dalits and tribals, did not have such entitlements. His remarks triggered a war of words between the BJP and Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/satellite-photos-show-china-building-large-fusion-research-facility-experts-2671427-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Satellite photos show China building large fusion research facility: ExpertsSatellite photos show four outlying \"arms\" that will house laser bays, and a central experiment bay that will hold a target chamber containing hydrogen isotopes the powerful lasers will fuse together, producing energy, said Decker Eveleth, a researcher at US-based independent research organisation CNA Corp."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-pm-modi-illegal-immigration-us-india-h1b-visa-issue-phone-call-2671168-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi 'will do what's right' on taking back illegal immigrants: TrumpAmid reports that India and the US identified 18,000 undocumented Indians in America, President Donald Trump said Prime Minister Narendra Modi \"will do what's right\" when it came to taking back Indian immigrants who are living in the US illegally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/i-140-form-petition-h1b-visa-petition-indians-form-green-card-permanent-residency-new-executive-order-trump-2670952-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How H-1B visa holders stay beyond 6 years in US. It's the I-140 magicThe H-1B visa system, used by mostly by American companies to hire Indians, is under the scanner after now-President Donald Trump made immigration and employment key campaign issues. How is the temporary H-1B visa, which affords a maximum six-year stay in the US, used for permanent residency? Here's all about the I-140 petition    that is the gateway to the US Green Card and permanent residency."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/ghaziabad-woman-claims-30-40-blinkit-riders-assaulted-family-viral-video-2671399-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ghaziabad woman claims 30-40 Blinkit riders assaulted father, brother, shares videoA Ghaziabad-based woman claimed that her father and brother were assaulted by 30-40 BlinkIt delivery partners in Rajinder Nagar Sector 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/story/kia-syros-review-first-drive-kias-newest-to-take-on-the-nexon-brezza-venue-xuv-3xo-2670943-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kia Syros review, first drive: Versatile and quirky compact SUVKia Syros Review: Kia has added yet another compact SUV to its Indian portfolio. It sits above the Sonet and takes on the likes of the Tata Nexon, Maruti Suzuki Brezza, Hyundai Venue, and Mahindra XUV 3XO. So what new flavour does it bring to the market? Let's find out."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/fact-check/story/deepseek-ai-chatbot-china-censorship-arunachal-pradesh-galwan-taiwan-chatgpt-2671394-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "From where does DeepSeek seek its answers? DeepSeek might compete with OpenAI's ChatGPT and Google's Gemini in capabilities. But when it comes to politically sensitive questions, it exposes its Chinese DNA. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shaturgan-sinha-campaign-aap-arvind-kejriwal-congress-rahul-gandhi-shotgun-khamosh-atishi-manish-sisodia-next-2671254-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why TMC's Shotgun firing for AAP will turn Congress khamoshDelhi Election: The Trinamool Congress has asked its MP Shatrughan Sinha to campaign for the Aam Admi Party in the Delhi Assembly election. This move by an INDIA bloc member must be particularly stinging for the Congress because Sinha is a former party member."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-anticipatory-bail-sexual-assault-case-relief-bus-driver-2671335-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "School driver gets relief after 'assault' turns out to be urinary infectionThe victim's father recorded a statement saying that the pain his daughter was experiencing in her private part on the day of the alleged incident turned out to be a urinary tract infection after medical diagnosis. The case is from Pune in Maharashtra. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/revenge-quitting-new-workplace-trend-to-rise-in-2025-2671351-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Revenge Quitting: Why employees are walking out and how companies can respondRevenge quitting, a new workplace trend where employees leave their jobs abruptly out of frustration, is expected to rise in 2025. Here are the top reasons why people revenge quit, how it can impact companies, and what employers can do to address it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/vivek-ramaswamy-elon-musk-doge-exit-us-ohio-governor-bid-donald-trump-presidency-2671190-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vivek Ramaswamy was asked if Elon Musk fired him from DOGE. He said thisVivek Ramaswamy denied rumours of a rift with Elon Musk, a week after the Indian-origin entrepreneur quit the Department of Goverment Efficiency (DOGE) and teased an Ohio governor's bid, saying he would be running for elected office soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-aromatherapy-will-find-more-appeal-in-2025-2670761-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why aromatherapy will find more appeal in 2025With the pendulum shifting towards mindfulness, inner peace and healing, the demand for this natural stress-buster will only grow\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/donald-trump-hints-at-rejoining-who-but-he-has-this-condition-2671289-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Donald Trump hints at rejoining WHO. But, he has this conditionDonald Trump: He had blamed his decision to exist WHO on the UN health agency's mishandling of the Covid-19 pandemic and other international health crises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rakhi-sawant-third-marriage-shaadi-pakistan-mein-hogi-2671310-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rakhi Sawant plans to marry again: 'Shaadi Pakistan mein hogi, Islamic rituals'Rakhi Sawant shared her plans to marry a Pakistani suitor, Dodi Khan, in Pakistan, reception in India, and honeymoon in Europe. The Bigg Boss fame was previously married to businessman Adil Khan Durrani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-concert-economy-coldplay-tour-india-massive-scope-focus-infrastructure-2671238-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM pushes for 'concert economy' after Coldplay's tour: India has massive scopeColdplay Ahmedabad Concert: Prime Minister Narendra Modi spoke about British rock band Coldplay's sold-out shows in Mumbai and Ahmedabad, stressing that India has a massive scope for live concerts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/deepseek-breakthrough-raises-ai-energy-questions-2671434-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DeepSeek breakthrough raises AI energy questionsThe AI revolution has come with assumptions that computing and energy needs will grow exponentially, resulting in massive tech investments in both data centres and the means to power them, bolstering energy stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-enemy-property-case-grandmother-wrongly-made-bhopal-nawab-successor-lawyer-2671445-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Enemy property: Lawyer claims Saif's grandmother wrongly made Nawab's successorEnemy property expert Jagdish Chhavani said Sajida Sultan was made the successor of Bhopal's Nawab against the rule as Jawaharlal Nehru had good relations with Saif Ali Khan's grandfather."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jawan-director-atlee-calls-shah-rukh-khan-his-godfather-in-cinema-2671477-2025-01-28",
      "headline": "Jawan director Atlee calls Shah Rukh Khan his 'godfather in cinema'Director Atlee, who recently ventured into owning a pickleball team, credits superstar Shah Rukh Khan as his 'godfather' in cinema and inspiration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shah-rukh-khan-message-to-friends-allu-arjun-yash-prabhas-mahesh-babu-2671405-2025-01-28",
      "headline": "SRK's message to friends Allu Arjun, Yash: Stop performing fast-paced dance movesShah Rukh Khan delighted fans at Global Village, Dubai, by addressing his South Indian colleagues as friends and sharing an update on his upcoming film King."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kriti-sanon-joins-dhanush-aanand-l-rai-tere-ishq-mein-raanjhanaa-spiritual-sequel-2671429-2025-01-28",
      "headline": "Kriti Sanon's intense 1st look from Anand L Rai's Tere Ishq Mein with Dhanush out'Tere Ishk Mein' teaser: Kriti Sanon joins Aanand L Rai's Tere Ishq Mein alongside Dhanush, playing the intense role of Mukti. The first look video of Kriti Sanon as Multi is now out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-to-play-lord-karthikeya-in-trivikram-socio-mythological-film-aa22-2671274-2025-01-28",
      "headline": "Allu Arjun to play Lord Karthikeya in Trivikram's socio-mythological film: ReportTrivikram's upcoming socio-mythological Film: After the monumental success of Pushpa 2: The Rule, Allu Arjun is reportedly gearing up for a socio-mythological fantasy, directed by Trivikram Srinivas, where he might play Lord Karthikeya, the god of war."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-live-score-3rd-t20i-ind-eng-score-updates-rajkot-2671457-2025-01-28",
      "headline": "3rd T20I Live Score: India eye series win RajkotIndia (IND) vs England (ENG) 3rd T20I Live Score and Updates: India will face England in Tuesday's third match of the five T20I series at the Niranjan Shah Stadium in Rajkot. India have taken a 2-0 lead and England must win the Rajkot encounter to stay alive in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-icc-cricketer-of-the-year-award-emulates-virat-kohli-2671447-2025-01-28",
      "headline": "Jasprit Bumrah becomes 1st Indian pacer to win ICC Cricketer of the Year awardJasprit Bumrah has emulated the likes of Sachin Tendulkar and Virat Kohli to become ICC's men's Cricketer Of The Year for his incredible performance in 2024. He became the first Indian pacer to win the award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ranji-trophy-return-delhi-team-training-lun-ch-chhole-poori-kadhi-chawal-2671443-2025-01-28",
      "headline": "Kohli skips chhole poori for old-time favourite during Delhi training returnVirat Kohli decided to skip chhole poori and decided to settle for an old-time favourite during lunch after practising with the Delhi Ranji Trophy team on Tuesday, January 28. Kohli is gearing up for his return to the tournament after a gap of 13 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-t20-world-cup-2025-gongadi-trisha-india-vs-scotland-2671437-2025-01-28",
      "headline": "All-round Trisha stars as India floor Scotland in U19 Women's T20 World CupU19 T20 Women's World Cup: Gongadi Trisha scored 110 runs and picked up three wickets as India beat Scotland by 150 runs in the Super Sixes match at the Bayuemas Oval in Kuala Lumpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-hugs-childhood-friend-ranji-trophy-delhi-training-shawez-khan-2671373-2025-01-28",
      "headline": "Watch: Kohli hugs childhood friend during Ranji Trophy training in DelhiRanji Trophy: Virat Kohli reunited with his childhood friend Shawez Khan during a training session with the Delhi Ranji team at Arun Jaitley Stadium, showcasing his humble side while preparing for a highly-anticipated return to domestic cricket after over a decade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ranji-trophy-virat-kohli-kl-rahul-sunil-gavaskar-delhi-karnataka-2671349-2025-01-28",
      "headline": "Sunil Gavaskar questions Virat Kohli, KL Rahul missing previous Ranji Trophy gameSunil Gavaskar questioned the reason behind Virat Kohli and KL Rahul missing the previous round of Ranji Trophy games for Delhi and Karnataka respectively. Kohli and Rahul said they were dealing with niggles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-axar-patel-batting-aakash-chopra-all-rounders-2671334-2025-01-28",
      "headline": "Axar Patel a responsible batter, he can't bat as low as No. 8 in T20Is: Aakash ChopraIndia vs England: All-rounder Axar Patel should bat higher-up the order and India need to use their all-rounders better, said former opener Aakash Chopra. India played three all-rounders in the second T20I in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/archery-sheetal-devi-anand-mahindra-scorpio-n-gift-2671295-2025-01-28",
      "headline": "Anand Mahindra moved by Sheetal Devi's determination, gifts armless archer new SUVAnand Mahindra gifted India's armless archer Sheetal Devi a brand-new Mahindra Scorpio-N. He also praised the para-athlete for her grit and determination. Last year, Sheetal bagged the bronze medal in the mixed team compound event in archery at Paris Paralympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/virat-kohli-young-fan-advice-how-to-become-a-cricketer-ranji-trophy-training-delhi-2671296-2025-01-28",
      "headline": "Watch: Kohli's wholesome advice to young fan on how to become a cricketerVirat Kohli took time to greet a young fan attending his training session with the Delhi Ranji Trophy squad at the Arun Jaitley Stadium in New Delhi. He even offered advice on how to become a future Indian cricketer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ab-de-villiers-cricket-return-changers-south-africa-champions-world-championship-of-legends-2671280-2025-01-28",
      "headline": "AB de Villiers set for cricket return in World Championship of LegendsAB de Villiers announced his cricket comeback, set to captain Game Changers South Africa Champions in the World Championship of Legends, reigniting excitement among fans as he prepares to showcase his brilliance nearly four years after retiring from the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-t20-world-cup-gongadi-trisha-century-india-vs-scotland-2671259-2025-01-28",
      "headline": "India's Trisha hits historic first-ever century in U19 Women's T20 World CupU19 Women's T20 World Cup: India's G Trisha etched her name in the history books after becoming the first-ever batter to score a hundred in the tournament. She got to the landmark in the match against Scotland at the Bayuemas Oval in Kuala Lumpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-axar-patel-batting-aakash-chopra-all-rounders-2671334-2025-01-28",
      "headline": "Axar Patel a responsible batter, he can't bat as low as No. 8 in T20Is: Aakash ChopraIndia vs England: All-rounder Axar Patel should bat higher-up the order and India need to use their all-rounders better, said former opener Aakash Chopra. India played three all-rounders in the second T20I in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/archery-sheetal-devi-anand-mahindra-scorpio-n-gift-2671295-2025-01-28",
      "headline": "Anand Mahindra moved by Sheetal Devi's determination, gifts armless archer new SUVAnand Mahindra gifted India's armless archer Sheetal Devi a brand-new Mahindra Scorpio-N. He also praised the para-athlete for her grit and determination. Last year, Sheetal bagged the bronze medal in the mixed team compound event in archery at Paris Paralympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/virat-kohli-young-fan-advice-how-to-become-a-cricketer-ranji-trophy-training-delhi-2671296-2025-01-28",
      "headline": "Watch: Kohli's wholesome advice to young fan on how to become a cricketerVirat Kohli took time to greet a young fan attending his training session with the Delhi Ranji Trophy squad at the Arun Jaitley Stadium in New Delhi. He even offered advice on how to become a future Indian cricketer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ab-de-villiers-cricket-return-changers-south-africa-champions-world-championship-of-legends-2671280-2025-01-28",
      "headline": "AB de Villiers set for cricket return in World Championship of LegendsAB de Villiers announced his cricket comeback, set to captain Game Changers South Africa Champions in the World Championship of Legends, reigniting excitement among fans as he prepares to showcase his brilliance nearly four years after retiring from the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-t20-world-cup-gongadi-trisha-century-india-vs-scotland-2671259-2025-01-28",
      "headline": "India's Trisha hits historic first-ever century in U19 Women's T20 World CupU19 Women's T20 World Cup: India's G Trisha etched her name in the history books after becoming the first-ever batter to score a hundred in the tournament. She got to the landmark in the match against Scotland at the Bayuemas Oval in Kuala Lumpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-delhi-training-back-foot-batting-ranji-trophy-arun-jaitley-stadium-2671247-2025-01-28",
      "headline": "Watch: Virat Kohli focusses on backfoot game, plays cracking shots at Delhi netsRanji Trophy 2024-25: Virat Kohli focused on playing off the backfoot when he trained with the Delhi Ranji team at the Arun Jaitley Stadium in New Delhi on Tuesday, January 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-amelia-kerr-smriti-mandhana-icc-womens-cricketer-of-the-year-award-new-zealand-2671225-2025-01-28",
      "headline": "New Zealand sensation Amelia Kerr named Women's Cricketer of the Year New Zealand all-rounder Amelia Kerr won the ICC Women's Cricketer of the Year award after a stellar 2024 where she also became the Player of the Tournament in the Women's T20 World Cup in the UAE. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/virat-kohli-joins-delhis-ranji-trophy-squad-ahead-of-return-to-domestic-cricket-2671219-2025-01-28",
      "headline": "Virat Kohli joins Delhi's Ranji trophy squad ahead of return to domestic cricketIndian batter Virat Kohli has joined Delhi's Ranji Trophy squad in preparation for his return to domestic cricket. Kohli returns to the Ranji Trophy after 12 years, set to play for Delhi against Railways, his first appearance since facing Uttar Pradesh in 2012."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-travis-head-opener-1st-test-2671207-2025-01-28",
      "headline": "Travis Head named opening partner for Usman Khawaja in 1st Test SL vs AUS: Australia skipper Steve Smith confirmed that Travis Head would open the batting alongside Usman Khawaja in the opening Test in Galle. Head was picked as the opener, ahead of Sam Konstas and Nathan McSweeney. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-australian-open-atp-wta-rankings-eva-lys-paula-badosa-2671183-2025-01-28",
      "headline": "Novak Djokovic climbs in rankings, lucky loser gains big after dream runAustralian Open: Novak Djokovic climbed one place up to No.6 in the ATP rankings. Paula Badosa returned to the top 10 while lucky loser Eva Lys made her debut in the top 100 of the WTA rankings after advancing to the fourth round at Melbourne Park. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/david-miller-injury-paarl-royals-vs-durban-super-gianst-south-africa-champions-trophy-scare-2671171-2025-01-28",
      "headline": "South Africa handed injury scare as David Miller picks niggle in SA20 clashDavid Miller's injury during SA20 raises concerns for South Africa's Champions Trophy campaign, compounded by ongoing fitness issues with fast bowler Lungi Ngidi. Both players are crucial to the Proteas' hopes for international glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sri-lanka-vs-australia-cricket-test-series-squads-live-streaming-steve-smith-2671163-2025-01-28",
      "headline": "Sri Lanka vs Australia Test series: Squads and all you need to know SL vs AUS: Dhananjaya de Silva's Sri Lanka and Steve Smith's Australia will lock horns in a two-match Test series, starting Wednesday, January 29 in Galle. Australia have already qualified for the World Test Championship final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-joins-delhi-ranji-trophy-team-training-arun-jaitley-stadium-return-domestic-cricket-2671160-2025-01-28",
      "headline": "Virat Kohli joins Delhi Ranji team, begins training at Arun Jaitley StadiumVirat Kohli joined Delhi Ranji Trophy squad in their training session at the Arun Jaitely Stadium on January 28, ahead of his return to domestic cricket in the side's upcoming clash against Railways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-australian-open-atp-wta-rankings-eva-lys-paula-badosa-2671183-2025-01-28",
      "headline": "Novak Djokovic climbs in rankings, lucky loser gains big after dream runAustralian Open: Novak Djokovic climbed one place up to No.6 in the ATP rankings. Paula Badosa returned to the top 10 while lucky loser Eva Lys made her debut in the top 100 of the WTA rankings after advancing to the fourth round at Melbourne Park. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/david-miller-injury-paarl-royals-vs-durban-super-gianst-south-africa-champions-trophy-scare-2671171-2025-01-28",
      "headline": "South Africa handed injury scare as David Miller picks niggle in SA20 clashDavid Miller's injury during SA20 raises concerns for South Africa's Champions Trophy campaign, compounded by ongoing fitness issues with fast bowler Lungi Ngidi. Both players are crucial to the Proteas' hopes for international glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sri-lanka-vs-australia-cricket-test-series-squads-live-streaming-steve-smith-2671163-2025-01-28",
      "headline": "Sri Lanka vs Australia Test series: Squads and all you need to know SL vs AUS: Dhananjaya de Silva's Sri Lanka and Steve Smith's Australia will lock horns in a two-match Test series, starting Wednesday, January 29 in Galle. Australia have already qualified for the World Test Championship final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-joins-delhi-ranji-trophy-team-training-arun-jaitley-stadium-return-domestic-cricket-2671160-2025-01-28",
      "headline": "Virat Kohli joins Delhi Ranji team, begins training at Arun Jaitley StadiumVirat Kohli joined Delhi Ranji Trophy squad in their training session at the Arun Jaitely Stadium on January 28, ahead of his return to domestic cricket in the side's upcoming clash against Railways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-rajkot-weather-forecast-smog-pitch-conditions-2671150-2025-01-28",
      "headline": "Will England batters face visibility issues in the 3rd T20I in Rajkot?India vs England, 3rd T20I: Rajkot is expected to offer ideal conditions for a high-scoring T20I contest on Tuesday, January 28. England batters are unlikely to face visibility issues at the Niranjan Shah Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-jos-buttler-t20i-record-rajkot-2671149-2025-01-28",
      "headline": "Jos Buttler eyes all-time T20I record in India before Rajkot clashIND vs ENG: Jos Buttler has a chance to become the leading run-scorer by a visiting batter on Indian soil when England take part in the third T20I on Tuesday, January 28 at the Niranjan Shah Stadium in Rajkot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neymar-al-hilal-contract-mutual-termination-santos-return-transfer-news-2671126-2025-01-28",
      "headline": "Neymar and Al Hilal mutually terminate contract as Santos return imminentNeymar's injury-hit stint at Al Hilal ends as the Brazilian star edges closer to a nostalgic return to his boyhood club Santos, bringing hope for a revival of his career in Brazil's top-flight football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-3rd-t20i-predicted-11-shivam-shami-participation-2670984-2025-01-28",
      "headline": "3rd T20I Predicted 11: Shivam Dube in, Mohammed Shami's participation unclearIndia (IND) vs England (ENG) 3rd T20I Predicted Playing 11: World Cup-winning all-rounder Shivam Dube might replace Dhruv Jurel in India's playing XI for the Rajkot match. However, Mohammed Shami's participation will depend on coach Gautam Gambhir and captain Suryakumar Yadav.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}