{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-talks-piyush-goyal-to-lead-team-to-washington-for-bta-negotiations-ytvd-2726160-2025-05-17",
      "headline": "India-US Bilateral Trade Agreement: Final Phase Negotiations Aim For ConclusionUnion Minister Piyush Goyal will lead a team to the United States for trade talks. India and the US are working to finalize the Bilateral Trade Agreement (BTA) by early July. The US President has proposed a trade agreement with India that would have no tariffs on a wide range of American products. The US President stated, 'India is one of the highest tariff nations in the world. It's very hard to sell into India.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-drops-chinese-lounge-partner-dragonpass-what-it-means-for-indian-flyers-2726082-2025-05-16",
      "headline": "Adani drops Chinese lounge partner DragonPass: What it means for Indian flyersThe move, triggered by rising national security concerns, has ended DragonPass's access to Adani-managed airport lounges across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-the-middle-class-is-chasing-expensive-brands-explains-market-expert-2725916-2025-05-16",
      "headline": "Why the middle class is chasing expensive brands, explains market expertA market expert noted that nearly 75% of luxury spending today comes from the middle class, not due to rising incomes, but because of social media, marketing tricks, and peer pressure that fuel the urge to appear successful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-traders-body-boycotts-turkey-and-azerbaijan-over-support-for-pakistan-2725887-2025-05-16",
      "headline": "Indian traders' body boycotts Turkey and Azerbaijan over support for PakistanThe move comes after both Turkey and Azerbaijan openly showed support for Pakistan, at a time when India is facing sensitive national security challenges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-first-phase-likely-to-be-ready-by-july-1-say-sources-2725866-2025-05-16",
      "headline": "India-US trade deal: First phase likely to be ready by July 1, say sourcesIndia and the United States are in negotiations for a trade deal, with sources indicating that phase one could be ready by July 1st. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/un-sees-indian-economy-growing-at-63-percent-as-global-outlook-wobbles-2725850-2025-05-16",
      "headline": "India to grow at 6.3%, ahead of China, US, and European Union: UN reportAccording to the UN's mid-year update of the World Economic Situation and Prospects (WESP), India's growth is being fuelled by strong household spending and solid government investments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-slips-200-points-nifty-holds-ground-above-25000-defence-stocks-surge-2725827-2025-05-16",
      "headline": "Sensex slips 200 points, Nifty holds ground above 25,000; defence stocks surgeThe S&P BSE Sensex lost 200.15 points to close at 82,330.59, while the NSE Nifty50 was down 42.30 points to end at 25,019.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipo-next-week-2-public-listing-belrise-industries-borana-weaves-details-gmp-price-band-2725818-2025-05-16",
      "headline": "2 IPOs to open next week: Check Belrise Industries, Borana Weaves detailsWhile Belrise Industries will open for bidding on May 21, investors can bid for the IPO of Borana Weaves starting May 20, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-is-july-31-your-tax-deadline-find-out-2725807-2025-05-16",
      "headline": "ITR filing 2025: Is July 31 your tax deadline? Find outFiling your return on time helps avoid penalties and delays in refunds. It also keeps your financial records in order. So, if your deadline is July 31, skip the last-minute rush and file in advance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-is-digital-form-16-a-game-changer-for-salaried-taxpayers-2725775-2025-05-16",
      "headline": "ITR filing 2025: Is digital Form 16 a game-changer for salaried taxpayers?Digital Form 16 is an electronic version of the traditional Form 16. It's generated directly from the TRACES portal, which is managed by the Income Tax Department. This means all your salary details, TDS, and tax-saving deductions are recorded accurately and match what the government sees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/government-clears-187-startups-for-tax-relief-heres-what-it-means-2725727-2025-05-16",
      "headline": "Government clears 187 startups for tax relief. Here's what it meansTo qualify, the start-up must be recognised by the Department for Promotion of Industry and Internal Trade (DPIIT). It should be a private limited company or a limited liability partnership and its turnover should not cross Rs 100 crore in any year since incorporation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-latest-imf-funding-what-can-be-done-india-oppose-economic-collapse-terror-support-2725731-2025-05-16",
      "headline": "What Pakistan can and can't do with IMF loanThe International Monetary Fund (IMF) has approved a fresh loan package for Pakistan, agreeing to release USD 1 billion under its Extended Fund Facility (EFF)."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-trailer-review-kamal-haasan-silambarasan-gangster-drama-mani-ratnam-2726382-2025-05-17",
      "headline": "Thug Life trailer review: Kamal Haasan, STR in a gangster tale more like Nayakan 2.0The trailer of Mani Ratnam's much-anticipated film 'Thug Life', starring Kamal Haasan, offered a stylish peek into a familiar gangster world, but with the director's signature storytelling depth and visual grandeur. The film also stars Trisha Krishnan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-wants-more-films-with-rashmika-mandanna-says-chemistry-not-a-problem-2726393-2025-05-17",
      "headline": "Vijay Deverakonda wants more films with Rashmika, says 'chemistry not a problem'Actor Vijay Deverakonda candidly spoke about his marriage plans, his on-screen chemistry with Rashmika Mandanna, and whether he's currently seeking a life partner. The duo has long been rumoured to be in a relationship."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-ex-mother-in-law-sujatha-vijayakumar-breaks-silence-amid-row-aarti-kenishaa-2726351-2025-05-17",
      "headline": "Ravi Mohan's ex-mother-in-law breaks silence amid row: Still want him as our heroAarti's mother and producer Sujatha Vijayakumar has responded to serious allegations by actor Ravi Mohan, clarifying her financial dealings and appealing for family peace. She shared a two-page statement on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddharth-nigam-unaware-of-mumbai-before-dhoom-3-feared-being-trafficked-2726344-2025-05-17",
      "headline": "Siddharth Nigam was unaware of YRF before Dhoom 3: Mumbai bula ke bech diya tohActor Siddharth Nigam shares his initial disbelief and fears when auditioning for Dhoom 3. He felt the casting call was fake and feared that he would be trafficked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rahul-bhat-on-whether-cannes-is-becoming-a-fashion-event-rather-than-film-festival-2726321-2025-05-17",
      "headline": "Cannes becoming fashion event more than film festival? Actor Rahul Bhat answersRahul Bhat shares his perspective on the Cannes Film Festival, emphasising it as a celebration of cinema rather than just fashion. He is attending Cannes for the third time this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-trailer-kamal-haasan-silambarasan-trisha-krishnan-mani-ratnam-2726320-2025-05-17",
      "headline": "Thug Life trailer: Kamal Haasan ready to fight death in Mani Ratnam actionerThe highly-anticipated trailer of Kamal Haasan and Mani Ratnam's 'Thug Life' is out. Also starring Trisha Krishnan and Silambarasan in pivotal roles, the trailer was launched at a grand event on May 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/murderbot-appletv-new-show-season-1-alexander-skarsgard-secunit-hacks-governor-module-reluctant-antihero-2726298-2025-05-17",
      "headline": "Murderbot review: Alexander Skarsgard elevates show with deadpan deliveryReleased-Fri May 16, 2025'Murderbot' follows a security cyborg that hacks itself and who'd rather watch telly than protect humans. Apple TV's sci-fi comedy presents Alexander Skarsgard as the reluctantly sentient SecUnit navigating freedom while hiding its autonomous status from suspicious scientists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-to-begin-ak46-filming-in-november-eyes-mid-2026-release-2726299-2025-05-17",
      "headline": "Ajith Kumar to begin AK46 filming in November, eyes mid 2026 releaseTamil actor Ajith Kumar has confirmed his next film, tentatively titled 'AK46'. In an interview, he shared that he will begin the shooting in November 2025. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aman-verma-turns-magician-for-living-says-paapi-pet-ka-sawaal-hai-2726290-2025-05-17",
      "headline": "Actor Aman Verma turns magician for living, says 'paapi pet ka sawaal hai'Popular television actor Aman Verma appears to have made an unexpected career shift, from being a TV personality to performing as a magician. When curious fans asked about the change, Verma humorously responded that it was for his 'paapi pet'. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-says-mujhpe-bharosa-karo-in-chat-with-avneet-kaur-recalls-india-visit-mission-impossible-the-final-reckoning-promotions-2726274-2025-05-17",
      "headline": "Tom Cruise says 'mujhpe bharosa karo' in chat with Avneet Kaur, recalls India visitTom Cruise surprised fans by speaking Hindi in the latest promo for 'Mission: Impossible – The Final Reckoning'. The actor expressed his love for India and fondly recalled his visit to the country. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/how-nayanthara-navigated-through-controversies-stmp-2675122-2025-02-05",
      "headline": "How Lady Superstar Nayanthara rose above controversies and ruled Tamil cinemaFrom her legal battle with Dhanush to facing online trolls after the birth of her twin boys, Nayanthara has navigated a range of controversies throughout her career. Here is an overview of some of these challenges and how the Lady Superstar managed them—all while steadily rising to fame."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-joins-chiranjeevi-157th-film-with-anil-ravipudi-announcement-video-out-2726252-2025-05-17",
      "headline": "Nayanthara joins Chiranjeevi's 157th film with Anil Ravipudi, announcement video outIt's official! Nayanthara has been roped in for megastar Chiranjeevi's next film, tentatively titled 'Mega157'. Set for a Sankranthi 2026 release, it is directed by Anil Ravipudi. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/guns-n-roses-mumbai-concert-details-songs-expected-2726251-2025-05-17",
      "headline": "Guns N' Roses Mumbai performance: The rock revival we've all been waiting forGuns N' Roses is set to electrify Mumbai with their iconic rock energy on May 17 at the Mahalaxmi Race Course. This concert promises to be a legendary celebration of timeless anthems and unforgettable performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kristen-stewart-directorial-debut-the-chronology-of-water-impresses-cannes-with-four-minute-ovation-2726244-2025-05-17",
      "headline": "Kristen Stewart's directorial debut impresses Cannes with four-minute ovationKristen Stewart made her directorial debut with 'The Chronology of Water'. The film received appreciation at the ongoing Cannes Film Festival. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/beyond-beauty-beneath-pain-why-filmmakers-keep-returning-to-a-wounded-kashmir-2726217-2025-05-17",
      "headline": "Beyond beauty, beneath pain: Why filmmakers keep returning to a wounded Kashmir?What is it about Kashmir that keeps attracting cinema? Why do filmmakers keep going back to the Valley despite its turbulent past? It certainly can't be all about beauty. It is more. On Cinematic Saturday, we spoke to the actors and directors who have shot in Kashmir, to understand why Kashmir is for cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/joaquin-phoenix-in-tears-as-eddington-gets-five-minute-standing-ovation-at-cannes-pedro-pascal-emma-stone-2726232-2025-05-17",
      "headline": "Joaquin Phoenix in tears as Eddington gets five-minute standing ovation at Cannes'Eddington', starring Joaquin Phoenix, Emma Stone, Pedro Pascal and Austin Butler, received thunderous applause at the 78th Cannes Film Festival. In clips that were shared online, Phoenix is seen visibly moved by the response. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/black-white-and-gray-creator-says-show-is-about-us-not-about-its-characters-2725952-2025-05-17",
      "headline": "Black, White and Gray creator says show is about us, not about its charactersSony LIV's crime thriller 'Black White and Gray - Love Kills' broke new ground with its unique mockumentary style, offering a compelling narrative that explores the complexities of human nature. The show challenged viewers to rethink their perceptions of truth and bias, delivering a culturally rooted story that resonates deeply with Indian audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mission-impossible-final-reckoning-review-tom-cruise-vs-ai-2726166-2025-05-17",
      "headline": "Mission Impossible 8 review: Tom Cruise vs AI battle, guess who wins?Released-Sat May 17, 2025Tom Cruise once again dazzles with breathtaking stunts and nostalgia in 'Mission Impossible: The Final Reckoning', proving his unmatched dedication to action cinema. Despite some narrative flaws, the film stands out for its thrilling sequences and Cruise's charisma, even at 62."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/evolution-of-mental-health-portrayal-in-k-drama-its-okay-to-not-be-okay-doctor-slump-weightlifting-fairy-kim-bok-joo-2726039-2025-05-16",
      "headline": "It's Okay to Not be Okay to Doctor Slump: Evolution of mental health portrayalK-dramas have evolved significantly in portraying mental health, moving from stigma and stereotypes to nuanced and empathetic storytelling. These dramas now highlight real struggles like trauma, anxiety, and burnout, encouraging open conversations about mental well-being."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jaishankar-remarks-on-op-sindoor-misrepresented-government-on-pakistan-admission-claim-2726403-2025-05-17",
      "headline": "Jaishankar's remarks on Op Sindoor misrepresented: Centre on 'admission' claimThe Ministry of External Affairs on Saturday said that a remark made by Jaishankar on Operation Sindoor is being falsely represented. This comes after Congress MP Rahul Gandhi hit out at the government for \"informing\" Pakistan before the strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-is-jyoti-malhotra-haryana-youtuber-travel-vlogger-arrest-spying-pakistan-2726301-2025-05-17",
      "headline": "YouTuber arrested for spying visited Pak this year. Who is Jyoti Malhotra?Jyoti Malhotra, who was arrested along with six others for sharing sensitive information with Pakistani agents, operates the YouTube channel 'Travel with Jo' and has about 3,77,000 followers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-vs-congress-showdown-shashi-tharoor-role-operation-sindoor-global-diplomacy-2726340-2025-05-17",
      "headline": "BJP vs Congress showdown over Shashi Tharoor's role in Op Sindoor diplomacyCongress MP Shashi Tharoor will lead an all-party delegation to present the nation's point of view on recent India-Pakistan tensions. His nomination has sparked a war of words between the BJP and Congress leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/13-councillors-resign-from-aap-in-delhi-likely-to-form-new-faction-indraprastha-vikas-party-2726268-2025-05-17",
      "headline": "15 Delhi councillors resign from AAP, announce formation of new partyThe rebel AAP councillors, under the leadership of Mukesh Goel, announced a new party called Indraprastha Vikas Party. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/video/noida-jaypee-aman-society-severe-storm-blows-away-safal-store-viral-video-2726408-2025-05-17",
      "headline": "Watch: Noida vegetable store ravaged by storm, blown away like deck of cardsA resident filming the storm from an upper floor captured the dramatic moment when powerful winds tore through the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-kkr-knocked-out-ipl-2025-bengaluru-rain-washout-2726417-2025-05-17",
      "headline": "Defending champions KKR knocked out as rain washes out match in BengaluruKolkata Knight Riders were eliminated from IPL 2025 after their match against Royal Challengers Bengaluru was washed out on Saturday. The rain ended KKR's hopes of staying in the competition amid a challenging season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/adopted-at-birth-girl-joins-2-men-to-murder-odisha-woman-who-raised-her-2726359-2025-05-17",
      "headline": "Adopted at birth, girl joins 2 men to murder Odisha woman who raised herThe 13-year-old allegedly conspired with two men to kill her adoptive mother over her opposition to the relationship and to gain control of her property."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/post-operation-sindoor-pakistan-claiming-victory-narrative-war-time-to-deploy-ins-tharoor-icbm-asaduddin-owaisi-2723063-2025-05-11",
      "headline": "Shashi Tharoor in India's global outreach mission: Why it makes senseCongress leader Shashi Tharoor has been picked for India's Operation Sindoor global outreach mission and so has AIMIM chief Asaduddin Owaisi. A few days ago, India Today commentator Kamlesh Singh had mooted the very same idea, highlighting the Kerala MP's diplomatic and linguistic prowess that can cripple Pakistan's post-operation illusion. Tharoor's gravitas and Owaisi's firepower could prove to be India's best shot at reclaiming the global narrative, he had argued. We are re-offering the full article in the context of the latest development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/20-ft-cobra-odisha-school-classroom-rescued-video-2726410-2025-05-17",
      "headline": "Ssshowdown at school: Watch 2 men bag a hissing, slithering 20-ft CobraA 20-foot King Cobra slithered into a classroom in Odisha. In a nerve-wracking rescue, two men from the Snake Helpline team cornered the hissing, defiant cobra -- one grabbing its tail, the other guiding its head --before finally securing it inside a bag. Watch the dramatic moments unfold as students and locals look on in shock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/himanta-biswa-sarma-rahul-gandhi-gaurav-gogoi-all-party-delegations-operation-sindoor-outreach-2726289-2025-05-17",
      "headline": "Himanta Sarma's 'drop MP' request after Gaurav Gogoi named for Op Sindoor outreachAssam Chief Minister Himanta Biswa Sarma demanded Rahul Gandhi to drop Congress's Gaurav Gogoi from the list of four MPs nominated by the party for the government's delegations to be sent abroad to explain India's stance on Pak-sponsored terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/available-for-country-shashi-tharoor-on-leading-delegation-for-op-sindoor-outreach-2726338-2025-05-17",
      "headline": "Nation needs me, I am available: Shashi Tharoor on key role in Op Sindoor outreachCongress MP Shashi Tharoor, who will lead one of the seven all-party delegations of parliamentarians tasked with briefing countries on Pak-sponsored terrorism and Operation Sindoor, said the nation needed him and he was available."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/little-girl-from-bengal-dances-to-aayi-nai-in-viral-video-2726352-2025-05-17",
      "headline": "Little girl from Bengal dances to Aayi Nai in viral video, delights InternetA video of a little girl from West Bengal has delighted the internet with her 'Aayi Nai' dance video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aiims-helicopter-emergency-landing-kedarnath-chardham-yatra-2726279-2025-05-17",
      "headline": "Video: Helicopter ambulance makes emergency landing in KedarnathThe helicopter belonged to the All India Institute of Medical Sciences (AIIMS), Rishikesh, and arrived in Kedarnath to pick up a patient."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-in-7-member-delegation-of-mps-that-will-brief-nations-on-recent-india-pakistan-conflict-2726183-2025-05-17",
      "headline": "Shashi Tharoor among 7 MPs named for vital role in Operation Sindoor outreachSenior Congress leader Shashi Tharoor will lead one of the seven all-party delegations of MPs tasked with briefing key foreign governments on the recent India-Pakistan conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-not-recommended-congress-centre-diplomatic-outreach-pakistan-conflict-2726212-2025-05-17",
      "headline": "Rift out in open? Centre snubs Congress picks, names Shashi Tharoor for key roleShashi Tharoor was among the seven MPs named by the Centre to lead an all-party delegation to expose Pakistan-sponsored terrorism. However, Tharoor's name was not recommended by the Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-trailer-review-kamal-haasan-silambarasan-gangster-drama-mani-ratnam-2726382-2025-05-17",
      "headline": "Thug Life trailer review: Kamal Haasan, STR in a gangster tale more like Nayakan 2.0The trailer of Mani Ratnam's much-anticipated film 'Thug Life', starring Kamal Haasan, offered a stylish peek into a familiar gangster world, but with the director's signature storytelling depth and visual grandeur. The film also stars Trisha Krishnan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-484-16-05-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mission-impossible-final-reckoning-review-tom-cruise-vs-ai-2726166-2025-05-17",
      "headline": "Mission Impossible 8 review: Tom Cruise vs AI battle, guess who wins?Released-Sat May 17, 2025Tom Cruise once again dazzles with breathtaking stunts and nostalgia in 'Mission Impossible: The Final Reckoning', proving his unmatched dedication to action cinema. Despite some narrative flaws, the film stands out for its thrilling sequences and Cruise's charisma, even at 62."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/haryana-based-youtuber-among-arrested-for-spying-for-pakistan-2726271-2025-05-17",
      "headline": "Haryana-based YouTuber among 6 arrested for spying for PakistanHaryana-based YouTuber Jyoti Malhotra and five others have been arrested for sharing sensitive information with Pakistani intelligence operatives. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/foreign-couple-says-nothing-is-too-raw-to-eat-in-india-in-video-internet-reacts-2726265-2025-05-17",
      "headline": "Foreign couple says nothing is 'too raw to eat' in India in video, Internet reactsContent creators Guru and Lia shared their admiration for Indian cuisine in a video that they shared on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/beyond-beauty-beneath-pain-why-filmmakers-keep-returning-to-a-wounded-kashmir-2726217-2025-05-17",
      "headline": "Beyond beauty, beneath pain: Why filmmakers keep returning to a wounded Kashmir?What is it about Kashmir that keeps attracting cinema? Why do filmmakers keep going back to the Valley despite its turbulent past? It certainly can't be all about beauty. It is more. On Cinematic Saturday, we spoke to the actors and directors who have shot in Kashmir, to understand why Kashmir is for cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-drone-attack-operation-sindoor-air-defence-army-2726277-2025-05-17",
      "headline": "Over 600 Pak drones downed by India's air defence during hostilitiesIndia's air defence systems successfully thwarted Pakistani drone attacks, shooting down over 600 drones under Operation Sindoor, the retaliatory response to the terrorist strikes in Pahalgam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/karnataka-bengaluru-software-engineer-sanjay-murder-hit-and-run-cigarette-konanakunte-cross-2726219-2025-05-17",
      "headline": "Caught on camera: Bengaluru techie killed in hit-and-run over cigarette disputeA man in a Hyundai Creta followed the software engineer duo and deliberately rammed his vehicle into their motorcycle after they allegedly refused to give him a cigarette. One was killed, and his friend remains in critical condition."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-pbks-punjab-kings-bowling-coach-james-hopes-press-conference-2726421-2025-05-17",
      "headline": "Bowling coach James Hopes confident PBKS can maintain momentum after breakPunjab Kings' bowling coach James Hopes expressed confidence ahead of their upcoming IPL clash against Rajasthan Royals, highlighting the team's preparedness and the fearless mindset of the young Indian players. Reflecting on the week-long break in the middle of the tournament, Hopes said the players have returned feeling refreshed and are back in rhythm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-kkr-knocked-out-ipl-2025-bengaluru-rain-washout-2726417-2025-05-17",
      "headline": "Defending champions KKR knocked out as rain washes out match in BengaluruKolkata Knight Riders were eliminated from IPL 2025 after their match against Royal Challengers Bengaluru was washed out on Saturday. The rain ended KKR's hopes of staying in the competition amid a challenging season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-on-ipl-2025-final-eden-gardens-kolkata-bcci-2726411-2025-05-17",
      "headline": "Talks on with BCCI to keep Kolkata as venue for IPL final: Sourav GangulyFormer India captain Sourav Ganguly has revealed that he's in regular talks with the BCCI for keeping the Indian Premier League 2025 (IPL 2025) final at Eden Gardens in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-kkr-rain-delay-white-pigeon-fan-tribute-virat-kohli-2726407-2025-05-17",
      "headline": "Nature's tribute to Virat Kohli? White pigeons fly over stadium amid rain delayRCB vs KKR: As rain delayed play in Bengaluru, fans spotted a group of white pigeons flying over the M Chinnaswamy Stadium. They said that the sight of the birds was a symbolic tribute to Virat Kohli's legendary career in whites.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-gt-delhi-capitals-all-rounder-vipraj-nigam-full-press-conference-2726395-2025-05-17",
      "headline": "Very tough to replace Starc but Delhi Capitals have made a few changes: ViprajDelhi Capitals all-rounder Vipraj Nigam admitted that it would be a tough task for the team to replace Mitchell Starc, but expressed confidence in the management's ability to make the most of the available players. DC are currently placed fifth on the points table with 13 points, and their chances of making the playoffs look even more challenging now, especially with Starc not returning to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-gt-vipraj-nigam-dharamsala-rescue-pbks-match-indian-army-2726388-2025-05-17",
      "headline": "Indian army helped us: DC's Vipraj Nigam on Dharamsala evacuationDelhi Capitals all-rounder Vipraj Nigam thanked the Indian army and the government of India for safely escorting players from Dharamsala after their IPL 2025 match against Punjab Kings was suspended midway due to rising tensions between India and Pakistan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-gt-parthiv-patel-delhi-capitals-vs-gujarat-titans-2726387-2025-05-17",
      "headline": "We are playing good cricket and want to carry on with that: GT Assistant coachGujarat Titans (GT) assistant coach Parthiv Patel wants his team to carry the winning momentum in the last leg of the Indian Premier League 2025 (IPL 2025). GT will take on Delhi Capitals on Sunday, May 18 at Arun Jaitley Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-parthiv-patel-on-kagiso-rabada-dc-vs-gt-2726376-2025-05-17",
      "headline": "Will GT's Kagiso Rabada get a chance against Delhi? Parthiv Patel answersGujarat Titans (GT) assistant coach Parthiv Patel has opened up on Kagiso Rabada's inclusion in the playing XI for their upcoming fixture against Delhi Capitals (DC). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-tribute-rcb-fans-wear-test-jersey-ipl-match-2726373-2025-05-17",
      "headline": "RCB Fans don white jersey to celebrate Virat Kohli's Test legacy in BengaluruRoyal Challengers Bengaluru fans wore Virat Kohli's Test jersey to honour his retirement from Test cricket. The tribute highlighted Kohli's stature as India's most successful Test captain and inspired cheers despite rain delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/hansi-flick-warns-barcelona-against-complacency-before-villarreal-match-2726360-2025-05-17",
      "headline": "Hansi Flick issues warning to Barcelona players: Partying is no excusesHewad coach Hansi Flick has cautioned Barcelona players to remain focused on their final LaLiga match despite recent title celebrations. The coach emphasised the importance of finishing the season strongly against a motivated Villarreal side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-gt-vipraj-nigam-dharamsala-rescue-pbks-match-indian-army-2726388-2025-05-17",
      "headline": "Indian army helped us: DC's Vipraj Nigam on Dharamsala evacuationDelhi Capitals all-rounder Vipraj Nigam thanked the Indian army and the government of India for safely escorting players from Dharamsala after their IPL 2025 match against Punjab Kings was suspended midway due to rising tensions between India and Pakistan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-gt-parthiv-patel-delhi-capitals-vs-gujarat-titans-2726387-2025-05-17",
      "headline": "We are playing good cricket and want to carry on with that: GT Assistant coachGujarat Titans (GT) assistant coach Parthiv Patel wants his team to carry the winning momentum in the last leg of the Indian Premier League 2025 (IPL 2025). GT will take on Delhi Capitals on Sunday, May 18 at Arun Jaitley Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-parthiv-patel-on-kagiso-rabada-dc-vs-gt-2726376-2025-05-17",
      "headline": "Will GT's Kagiso Rabada get a chance against Delhi? Parthiv Patel answersGujarat Titans (GT) assistant coach Parthiv Patel has opened up on Kagiso Rabada's inclusion in the playing XI for their upcoming fixture against Delhi Capitals (DC). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-tribute-rcb-fans-wear-test-jersey-ipl-match-2726373-2025-05-17",
      "headline": "RCB Fans don white jersey to celebrate Virat Kohli's Test legacy in BengaluruRoyal Challengers Bengaluru fans wore Virat Kohli's Test jersey to honour his retirement from Test cricket. The tribute highlighted Kohli's stature as India's most successful Test captain and inspired cheers despite rain delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/hansi-flick-warns-barcelona-against-complacency-before-villarreal-match-2726360-2025-05-17",
      "headline": "Hansi Flick issues warning to Barcelona players: Partying is no excusesHewad coach Hansi Flick has cautioned Barcelona players to remain focused on their final LaLiga match despite recent title celebrations. The coach emphasised the importance of finishing the season strongly against a motivated Villarreal side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishant-sharma-on-virat-kohli-friendship-memories-2726362-2025-05-17",
      "headline": "Virat Kohli will always be Cheeku for us: Ishant on his bond with India starIndia pacer Ishant Sharma opened up on his long-standing bond with Virat Kohli, saying that the star Indian batter will always be \"Cheeku\" to those who grew up with him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-kings-miss-stoinis-inglis-ipl-match-rajasthan-royals-2726357-2025-05-17",
      "headline": "Punjab Kings will miss key players against Rajasthan Royals: James HopesPunjab Kings will be without key players Marcus Stoinis and Josh Inglis for their IPL match against Rajasthan Royals. The team remains confident in their squad depth despite these absences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-message-to-rohit-sharma-after-wankhede-stand-honour-2726345-2025-05-17",
      "headline": "Watch: Rahul Dravid's humorous message to Rohit Sharma for Wankhede stand honourRahul Dravid congratulated Rohit Sharma after the Mumbai Cricket Association named a stand at the Wankhede Stadium in his honour, joking that he now knows who to call for match tickets at the venue.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arun-dhumal-says-quality-of-ipl-will-remain-intact-as-most-of-overseas-players-2726337-2025-05-17",
      "headline": "Most of overseas players are back, the quality of IPL will remain intact: Arun DhumalIPL chairman Arun Dhumal is confident that the quality of the IPL will remain intact after its resumption as most of the players are available for the final leg of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-julian-weber-break-90m-barrier-doha-javelin-2726323-2025-05-17",
      "headline": "90m barrier breached, Neeraj Chopra will be free to go for glory, more gloryNeeraj Chopra finally breached the 90m-mark in Doha Diamond League on May 16. After the event, Neeraj said that he has much better throws in him than his career-best one in Doha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-dean-huijsen-transfer-complete-afc-bournemouth-laliga-2726324-2025-05-17",
      "headline": "Real Madrid win race to complete Dean Huijsen signing from AFC BournemouthReal Madrid kicked off their rebuild by signing Spanish starlet Dean Huijsen from Bournemouth, fending off major European rivals and sealing their first deal ahead of the 2025 FIFA Club World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-argentina-team-kerala-international-matches-spots-minister-sponsor-chaos-2726302-2025-05-17",
      "headline": "Messi-led Argentina team will come to Kerala: Sports minister amid sponsor chaosDespite swirling rumours and sponsor troubles, Kerala's Sports Minister remains hopeful that Lionel Messi and the Argentina team will honour their planned 2025 visit to the state, assuring fans that the deal is still intact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-emi-martinez-aston-villa-vs-tottenham-leaves-crying-transfer-2726285-2025-05-17",
      "headline": "Aston Villa's Emi Martinez leaves field in tears, fuelling Saudi linksEmiliano Martinez's teary exit after Aston Villa's win over Spurs has sparked rumours of a possible summer departure, with Saudi interest intensifying and manager Unai Emery unable to offer clarity on his future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-julian-weber-break-90m-barrier-doha-javelin-2726323-2025-05-17",
      "headline": "90m barrier breached, Neeraj Chopra will be free to go for glory, more gloryNeeraj Chopra finally breached the 90m-mark in Doha Diamond League on May 16. After the event, Neeraj said that he has much better throws in him than his career-best one in Doha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-dean-huijsen-transfer-complete-afc-bournemouth-laliga-2726324-2025-05-17",
      "headline": "Real Madrid win race to complete Dean Huijsen signing from AFC BournemouthReal Madrid kicked off their rebuild by signing Spanish starlet Dean Huijsen from Bournemouth, fending off major European rivals and sealing their first deal ahead of the 2025 FIFA Club World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-argentina-team-kerala-international-matches-spots-minister-sponsor-chaos-2726302-2025-05-17",
      "headline": "Messi-led Argentina team will come to Kerala: Sports minister amid sponsor chaosDespite swirling rumours and sponsor troubles, Kerala's Sports Minister remains hopeful that Lionel Messi and the Argentina team will honour their planned 2025 visit to the state, assuring fans that the deal is still intact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-emi-martinez-aston-villa-vs-tottenham-leaves-crying-transfer-2726285-2025-05-17",
      "headline": "Aston Villa's Emi Martinez leaves field in tears, fuelling Saudi linksEmiliano Martinez's teary exit after Aston Villa's win over Spurs has sparked rumours of a possible summer departure, with Saudi interest intensifying and manager Unai Emery unable to offer clarity on his future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-name-board-room-after-sachin-tendulkar-in-his-honour-at-mumbai-headquarters-2726291-2025-05-17",
      "headline": "BCCI name board room in Sachin Tendulkar's honour at Mumbai HeadquartersBCCI (Board of Control for Cricket in India) named a board room in Sachin Tendulkar's honour at their Mumbai Headquarters. The legendary batter inaugurated the board room named 'SRT 100'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-ipl-2025-batting-reactions-opener-2726283-2025-05-17",
      "headline": "Found our new opener: Bumrah wows fans with batting skills in MI netsIPL 2025: Mumbai Indians speedster Jasprit Bumrah left fans in awe after he played some incredible shots in a nets session before the resumption of the Indian Premier League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-kkr-rain-weather-scenario-2726269-2025-05-17",
      "headline": "What happens if the RCB vs KKR clash gets washed off due to rain?IPL 2025: Both Kolkata Knight Riders and Royal Challengers Bengaluru will be affected if Saturday's match at the M Chinnaswamy Stadium in Bengaluru gets called off due to rain. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-kkr-bengaluru-weather-live-updates-rain-score-chinnaswamy-2726188-2025-05-17",
      "headline": "RCB vs KKR Live: KKR crash out after group clash vs RCB called offRCB vs KKR, IPL 2025 Live Score, Bengaluru weather live updates: Defending champions Kolkata Knight Riders were eliminated from the playoff race after their group clash against RCB was washed out due to incessant rain in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-vs-carlos-alcaraz-italian-open-final-2726233-2025-05-17",
      "headline": "Sinner vs Alcaraz: All you need to know about Italian Open 2025 finalItalian Open 2025: Jannik Sinner beat Tommy Paul on Saturday to set up a clash with four-time Grand Slam champion Carlos Alcaraz on Sunday, May 18. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-ruben-amorim-chelsea-loss-europa-league-final-playing-xi-2726223-2025-05-17",
      "headline": "Ruben Amorim says United's Chelsea loss will help him pick Europa Final XIRuben Amorim drew positives from Manchester United's Premier League loss to Chelsea, revealing that the performance helped him shape ideas for the starting XI in their high-stakes Europa League final against Tottenham Hotspur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-praggnanandhaa-superbet-classic-tiebreak-2726194-2025-05-17",
      "headline": "Praggnanandhaa wins Superbet Classic after a tough tiebreakR Praggnanandhaa clinched his maiden title on the Grand Chess Tour by outplaying France's Maxime Vachier-Lagrave in the Superbet Classic.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/uae-vs-bangladesh-t20i-series-live-streaming-squads-schedule-timings-2726189-2025-05-17",
      "headline": "UAE vs Bangladesh T20I series: Squads, schedule and all you knowLitton Das' Bangladesh and Muhammad Waseem's United Arab Emirates (UAE) will be up against each other in a two-match T20I series at the Sharjah Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-wankhede-stand-surykumar-yadav-tribute-post-2726185-2025-05-17",
      "headline": "Suryakumar Yadav pens heartfelt tribute to Rohit Sharma on Wankhede honourSuryakumar Yadav shared a heartfelt tribute to ODI skipper Rohit Sharma after the Wankhede Stadium named a stand in his honour, celebrating the Mumbai legend's legacy and achievements in the presence of dignitaries and family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-playoffs-scenarios-explained-rcb-kkr-gt-pbks-dc-mi-lsg-how-to-qualify-2726054-2025-05-17",
      "headline": "IPL 2025 playoffs scenarios explained: What each team needs to do to qualifyThe race for the playoffs is heating up as IPL 2025 resumes following a one-week break due to India-Pakistan tensions. With 13 league games remaining, seven of the 10 teams remain mathematically in contention for a playoff spot. Former champions Chennai Super Kings, Rajasthan Royals, and Sunrisers Hyderabad have been eliminated from the race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-shreyas-iyer-rishabh-pant-sunil-gavaskar-india-captain-2726175-2025-05-17",
      "headline": "Shubman, Shreyas or Pant? Sunil Gavaskar picks his next India captainFormer batter Sunil Gavaskar reckoned that Shubman Gill is the most apt choice as the Indian Test captain after Rohit Sharma bid goodbye to the purest format earlier this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-doha-diamond-league-90-metres-feature-2726165-2025-05-17",
      "headline": "Relief, then fire: Neeraj Chopra's 90m mark breakthrough lights a fresh fuseAfter years of near misses, Neeraj Chopra finally broke the elusive 90-metre barrier in the Doha Diamond League on Friday, marking a historic milestone. Yet, with fierce rivals rising, this breakthrough signals just the beginning of a new, fiercer battle ahead."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}