{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-stock-market-opening-april-28-trading-nse-bse-dalal-street-2716040-2025-04-28",
      "headline": "Sensex, Nifty opening: Will stock market rise or fall today?The situation between India and Pakistan remains tense after the recent attack in Kashmir. This tension pulled down both the Sensex and Nifty on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-april-28-ril-idfc-first-bank-mahindra-axis-bank-2716027-2025-04-28",
      "headline": "Stocks to watch on April 28: RIL, IDFC First Bank, Mahindra, Axis BankVarious stocks are likely to see big movements today, April 28, as several companies are set to announce their quarterly earnings and other key updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-lifted-171-million-people-extreme-poverty-2012-to-2022-world-bank-data-2715692-2025-04-27",
      "headline": "India lifted 171 million people from extreme poverty from 2012 to 2022: World BankRural extreme poverty dropped from 18.4 per cent to 2.8 per cent, and urban from 10.7 per cent to 1.1 per cent, narrowing the rural-urban gap from 7.7 to 1.7 percentage points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-simplifies-online-pf-transfers-form-13-job-change-uan-2715484-2025-04-26",
      "headline": "Changing jobs? Check this EPFO update on PF transfersEffective January 2025, the requirement for employer approval in most transfer cases has been eliminated. Previously, PF balance transfers required coordination between source and destination EPFO offices, often causing delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/e-commerce-crops-data-storage-top-india-us-trade-deal-negotiations-report-2715475-2025-04-26",
      "headline": "E-commerce, crops, data storage top India-US trade deal negotiations: ReportDiscussions will now begin on issues such as market access for US farm goods, India's data localisation rules, and the role of big tech in e-commerce—areas that have previously proved politically sensitive in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-airlines-may-face-turbulence-as-pakistan-closes-its-skies-pahalgam-terror-attack-2715193-2025-04-25",
      "headline": "Indian airlines may face turbulence as Pakistan closes its skiesPakistan has announced shutting its airspace to Indian carriers as tensions rise between the two neighbours following a deadly militant attack in Indian Kashmir earlier this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-to-invest-rs-1000-crore-in-tamil-nadu-plant-report-2715130-2025-04-25",
      "headline": "Samsung to invest Rs 1,000 crore in Tamil Nadu plant: ReportSamsung's Tamil Nadu factory currently employs over 2,000 people. In 2022–23, the plant contributed one-fifth of Samsung's Rs 1 lakh crore sales in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-589-points-lower-nifty-sustains-24000-level-adani-ports-ends-4-percent-lower-2715111-2025-04-25",
      "headline": "Sensex, Nifty close lower as rising India-Pakistan tension spooks investorsThe S&P BSE Sensex lost 588.80 points to end at 79,212.53, while the NSE Nifty50 was down 207.35 points to end at 24,039.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kashmir-economy-impact-tourism-sector-slowdown-pahalgam-terror-attack-india-pakistan-tension-2715110-2025-04-25",
      "headline": "Pahalgam terror attack casts big shadow on Kashmir's booming tourism economyKashmir was slowly rebuilding its image as a peaceful tourist destination after years of conflict, especially after the abrogation of Article 370 in August 2019. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-revises-cut-off-timings-for-overnight-mutual-fund-redemptions-details-here-2715063-2025-04-25",
      "headline": "Sebi revises cut-off timings for overnight mutual fund redemptions. Details hereSebi aims to make sure stock brokers and clearing members use client funds wisely by investing in secure overnight mutual fund schemes (MFOS). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-may-buy-10-boeing-planes-turned-down-by-china-report-trump-tariff-announcement-us-china-trade-war-2715010-2025-04-25",
      "headline": "Air India may buy 10 Boeing planes turned down by China: ReportThe ongoing trade tensions between the US and China, marked by steep duties above 100%, have impacted various sectors, even the aviation industry has taken a hit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-stock-exchange-website-portal-crash-psx-down-india-tension-kashmir-attack-2714960-2025-04-25",
      "headline": "Pakistan Stock Exchange portal crashes amid rising geopolitical heatThe online portal of PSX showed a message saying \"We'll be back soon,\" indicating that the website was temporarily unavailable."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/atul-kulkarni-visits-pahalgam-after-terror-attack-this-is-our-kashmir-2716013-2025-04-28",
      "headline": "Actor Atul Kulkarni visits Pahalgam after attack, says 'this is our Kashmir'Actor Atul Kulkarni visits Pahalgam days after the terror attack to send out a message to the world. He urged the people to visit Pahalgam and not to be afraid. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgns-father-asked-me-to-drink-own-urine-to-speed-up-recovery-paresh-rawal-2715944-2025-04-27",
      "headline": "Ajay Devgn's father asked me to drink own urine to speed up recovery: Paresh RawalActor Paresh Rawal shared a surprising remedy he followed for an injury recovery - consuming his own urine. This revelation was made during a conversation with Lallantop, a sister channel of India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-to-make-his-met-gala-debut-in-a-sabyasachi-ensemble-report-2715941-2025-04-27",
      "headline": "Shah Rukh Khan to make his Met Gala debut in a Sabyasachi ensemble: ReportAccording to reports, Bollywood icon Shah Rukh Khan is set to debut at the Met Gala 2025, donning a Sabyasachi creation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tv-actor-navina-bole-accuses-sajid-khan-of-misconduct-says-he-asked-her-to-strip-2715905-2025-04-27",
      "headline": "TV actor Navina Bole accuses Sajid Khan of misconduct, says he asked her to stripTV actor Navina Bole has come forward with allegations against filmmaker Sajid Khan, accusing him of inappropriate behaviour during a meeting. This adds to the growing list of accusations against Khan, who has been previously named in other misconduct cases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/havoc-review-tom-hardy-is-the-only-saving-grace-of-gareth-evans-gore-thriller-2715896-2025-04-27",
      "headline": "Havoc review: Tom Hardy is the only saving grace in Gareth Evans' gore actionerReleased-Fri Apr 25, 2025Netflix's 'Havoc', directed by Gareth Evans, pairs Tom Hardy with a thrilling plot, but ultimately disappoints. Why? Read on and find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fleeing-romania-to-being-an-oscar-nominee-why-sebastian-stan-is-truly-a-star-2713501-2025-04-27",
      "headline": "Fleeing Romania to being an Oscar nominee: Why Sebastian Stan is truly a starActor Sebastian Stan's journey from Romania to ruling the roost in Hollywood is anything but typical. From a childhood under a strict regime to becoming a celebrated actor, Stan's story is one of resilience and talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ground-zero-box-office-collection-day-2-emraan-hashmi-film-collects-rs-3-crorw-2715878-2025-04-27",
      "headline": "Ground Zero box office Day 2: Emraan Hashmi film picks pace, collects Rs 3 croreEmraan Hashmi's military drama 'Ground Zero' is witnessing growth at the box office despite facing competition from other Bollywood films. The film chronicles the story of BSF officer Narendra Nath Dhar Dubey's operation against terrorist mastermind Ghazi Baba."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-diplomat-ott-release-when-where-to-watch-john-abrahams-political-thriller-2715868-2025-04-27",
      "headline": "The Diplomat OTT release: When, where to watch John Abraham's political thriller'The Diplomat', starring John Abraham, is reportedly set to premiere on Netflix on May 9, 2025. The film delves into the intricacies of diplomacy and personal conflicts, inspired by the true story of Indian diplomat JP Singh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sinners-production-designer-hannah-bleacher-reveals-hidden-tribute-to-chadwick-boseman-2715827-2025-04-27",
      "headline": "Sinners production designer reveals hidden tribute to Chadwick BosemanIn a recent interview, 'Sinners' production designer Hannah Bleacher unveiled a subtle tribute to Chadwick Boseman embedded in the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-pahalgam-terror-attack-reaction-kesari-chapter-2-screening-2715836-2025-04-27",
      "headline": "Woh gussa fir se jaaga hai: Akshay Kumar on Pahalgam attack at Kesari 2 screeningAkshay Kumar attended a screening of Kesari Chapter 2 and addressed the audience about the Pahalgam terror attack, expressing anger. He said that the anger Indians had after Jallianwala Bagh incident has been rekindled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-biebers-grandfather-bruce-dale-dies-at-80-singer-wife-hailey-pay-tribute-2715804-2025-04-27",
      "headline": "Justin Bieber's grandfather dies at 80. Singer, wife Hailey pay tributePop icon Justin Bieber mourns the loss of his grandfather, Bruce Dale, who died at 80. The singer shared a loving tribute on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-chapter-2-box-office-collection-day-9-akshay-kumar-r-madhavan-2715785-2025-04-27",
      "headline": "Kesari Chapter 2 box office Day 9: Akshay Kumar film sees jump, earns Rs 57 croreKesari 2, starring Akshay Kumar, R Madhavan, and Ananya Panday, is maintaining a good momentum at the box office. The film has already crossed Rs 50 crore mark and also witnessed a jump in numbers on Day 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/khalid-rahman-ashraf-hamza-arrested-possession-of-hybrid-ganja-2715763-2025-04-27",
      "headline": "Directors Khalid Rahman, Ashraf Hamza arrested for possession of hybrid ganjaDirector Khalid Rahman, who directed the recently-released film 'Alapuzzha Gymkhana' and director Ashraf Hamza, along with one other, were arrested for the possession of hybrid ganja by the Excise department of Kochi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/madhuri-dixit-husband-sriram-nene-parents-not-happy-when-he-quit-job-as-doctor-moved-to-india-2715757-2025-04-27",
      "headline": "Madhuri Dixit's in-laws 'weren't happy' when husband Shriram Nene moved to IndiaMadhuri Dixit and her husband Dr Shriram Nene relocated to India after years in the USA, where Dr Nene had a successful medical career. Despite initial resistance from his parents, Dr Nene transitioned from being a heart surgeon to a medical-tech entrepreneur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/waqt-yash-chopra-sunil-dutt-sharmila-tagore-sadhana-shivdasani-shashi-kapoor-raaj-kapoor-2715641-2025-04-27",
      "headline": "Waqt: An absurd masterpiece of earthquakes, epiphanies and Raaj Kumar at his best'Waqt', the 1965 blockbuster directed by Yash Chopra, is a quintessential masala film that blends drama, music, and a star-studded cast. Known for its engaging narrative and memorable performances, it remains a beloved classic in Hindi cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karthik-subbaraj-on-why-romance-is-the-soul-of-retro-with-suriya-pooja-hegde-2715653-2025-04-26",
      "headline": "Karthik Subbaraj on why romance is the soul of Suriya's RetroDirector Karthik Subbaraj, known for films like 'Pizza' and 'Jigarthanda', is shifting focus to romance in his latest venture 'Retro'. Starring Suriya, the film delves into love's transformative power against a vintage gangster backdrop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/ar-rahman-ponniyin-selvan-2-makers-face-rs-2-crore-fine-in-copyright-case-2715630-2025-04-26",
      "headline": "AR Rahman, Ponniyin Selvan 2 makers face Rs 2 crore fine in copyright caseThe Delhi High Court has intervened in a copyright dispute involving composer A R Rahman and the film 'Ponniyin Selvan 2'. The court found Rahman's song identical to the Junior Dagar Brothers' Shiv Stuti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/content-creator-misha-agarwal-dies-two-days-before-25th-birthday-2715616-2025-04-26",
      "headline": "Content creator Misha Agarwal dies two days before 25th birthdayInfluencer Misha Agarwal has passed away just days before her 25th birthday, leaving her followers and family in shock. The cause of her death is yet to be revealed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashley-rebello-styling-raveena-tandon-yeh-raat-aur-yeh-doori-song-karisma-kapoor-spy-her-look-2715615-2025-04-26",
      "headline": "Karisma sent people to spy on Raveena's look: Andaz Apna Apna designer AshleyThe beloved cult classic 'Andaz Apna Apna' returns to cinemas, bringing back memories for costume designer Ashley Rebello, who reminisces about creating iconic looks for the film's stars. He recounted a behind-the-scene anecdote before the shoot of the song 'Yeh Raat Aur Yeh Doori'."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/united-states-call-india-pakistan-responsible-solution-pahalgam-terror-attack-jammu-kashmir-2716004-2025-04-28",
      "headline": "US urges India, Pak to work towards 'responsible solution' after Pahalgam attackThe US said it stands with India against terrorism after the deadly Pahalgam terror attack and urged India and Pakistan to work towards a responsible resolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-army-officer-guides-35-40-people-to-safety-jammu-and-kashmir-2715950-2025-04-27",
      "headline": "Took cover in pit, ran for life: How Army officer saved 35-40 lives in PahalgamA software engineer from Karnataka recounted his narrow escape during the deadly Pahalgam terrorist attack that killed 26, crediting the quick thinking of his brother, an Army officer, for saving the lives of 35-40 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aimim-chief-asaduddin-owaisi-warns-pakistan-retaliation-warmongering-its-leaders-2715984-2025-04-28",
      "headline": "You are ISIS's successors: Asaduddin Owaisi to Pak over Pahalgam terror attackThe AIMIM Lok Sabha MP's remarks came after Pakistani Minister Hanif Abbasi openly threatened India with nuclear retaliation in response to India suspending the Indus Waters Treaty after the Pahalgam terrorist attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/black-hawk-army-pilot-risky-visual-separation-move-led-to-deadly-washington-potomac-river-crash-2716039-2025-04-28",
      "headline": "Ignoring instructor, Army pilot's risky move led to deadly Washington crash: ReportCaptain Rebecca Lobach failed to follow her co-pilot and instructor Andrew Eaves's order of turning left in a bid to avoid the descending aircraft. However, she failed to heed to his instructions, just 15 seconds before the crash."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-1/",
      "headline": "A brief history of terrorism in KashmirTo trace the evolution of insurgency and terrorism, we revisit Kashmir's turbulent history from Independence through the violent 1990s, when terror dominated the narrative."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/vancouver-festival-attack-toll-reaches-11-murder-charges-filed-against-suspect-glbs-2715998-2025-04-28",
      "headline": "Vancouver festival attack suspect charged with murder as toll rises to 11Murder charges were filed against Kai-Ji Adam Lo after a car ramming attack at a Vancouver festival killed 11 people. Authorities confirmed his history of mental health issues, with more charges expected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-leader-udit-raj-questions-shashi-tharoor-after-slammed-bilawal-bhutto-pahalgam-attack-2715983-2025-04-28",
      "headline": "Is he BJP spokesperson? Congress leader on Shashi Tharoor slamming Bilawal BhuttoCongress leader Udit Raj seemed to be indicating that Shashi Tharoor deviated from the party line over the Pahalgam attack, where it had questioned the security lapses and intelligence failures on the government's part."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/case-bhojpuri-singer-neha-singh-rathore-criticising-government-pahalgam-terrorist-attack-2715976-2025-04-28",
      "headline": "Case against Neha Singh Rathore for criticising government over Pahalgam attackThe FIR was filed against Neha after an X handle, run by a Pakistani journalists' group, reposted her video in which she claimed that PM Modi will now be seeking votes in Bihar in the name of the Pahalgam attack victims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-votes-today-economic-woes-trump-threats-to-dominate-showdown-2716032-2025-04-28",
      "headline": "Canada votes today: Economic woes, Trump threats to dominate showdownThe snap election, called just weeks after Mark Carney replaced Justin Trudeau as Liberal Party leader and prime minister, comes against a backdrop of economic anxiety, surging costs of living, immigration debates, and an escalating trade conflict with US President Donald Trump."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-bandar-abbas-port-death-toll-rise-government-refutes-missile-fuel-mishandling-2716026-2025-04-28",
      "headline": "Iran port blast toll climbs to 40, government refutes missile cargo linkA powerful explosion at Iran's Bandar Abbas port has killed at least 40 people and injured over 1,200. Fires continued to break out as officials blamed poor chemical storage for the blast.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-urges-russia-to-halt-attacks-as-rubio-warns-us-may-exit-ukraine-peace-deal-glbs-2715997-2025-04-28",
      "headline": "Trump sees hope with Ukraine, but top official signals US may exit peace effortTrump criticised Russian President Vladimir Putin, saying there's \"no reason\" for Russia to bomb civilian areas. He also said that Putin may have no intention of reaching a settlement. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/canadian-national-indigo-flight-hoax-bomb-threat-varanasi-2715951-2025-04-27",
      "headline": "Canadian national arrested in Varanasi for hoax bomb threat on IndiGo flightA Canadian national created panic when he suddenly started shouting that there was a bomb inside his bag, as the Bengaluru-bound IndiGo flight was on the runway at Lal Bahadur Shastri International Airport in Varanasi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/atul-kulkarni-visits-pahalgam-after-terror-attack-this-is-our-kashmir-2716013-2025-04-28",
      "headline": "Actor Atul Kulkarni visits Pahalgam after attack, says 'this is our Kashmir'Actor Atul Kulkarni visits Pahalgam days after the terror attack to send out a message to the world. He urged the people to visit Pahalgam and not to be afraid. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-mocks-kl-rahul-my-home-celebration-dc-vs-rcb-watch-video-2715980-2025-04-28",
      "headline": "Watch: Virat Kohli teases KL Rahul, mimics iconic Chinnaswamy celebration in DelhiVirat Kohli brought light-hearted banter to RCB's big win over DC, cheekily mocking KL Rahul's \"my home\" celebration — with the two stars later sharing laughs as RCB continued their record-breaking away run in IPL 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/china-supports-pakistans-demand-for-independent-probe-in-pahalgam-attack-2715959-2025-04-27",
      "headline": "China backs Pakistan's 'independent probe' demand on Pahalgam terror attackThe Chinese Foreign Minister, Wang Yi, extended China's resolute support to Pakistan in its demand for an independent investigation over India's allegations about its involvement in the Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-rcb-record-6th-away-win-krunal-pandya-virat-kohli-2715972-2025-04-27",
      "headline": "RCB clinch record 6th away win as Krunal Pandya, Virat Kohli fire in DelhiIPL 2025, DC vs RCB: Krunal Pandya chipped in with an all-round show and Virat Kohli hit a solid fifty as RCB clinched a six-wicket win in Delhi on Sunday, April 27. It was RCB's sixth straight win away from home this season -- a new record in the tournament. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tv-actor-navina-bole-accuses-sajid-khan-of-misconduct-says-he-asked-her-to-strip-2715905-2025-04-27",
      "headline": "TV actor Navina Bole accuses Sajid Khan of misconduct, says he asked her to stripTV actor Navina Bole has come forward with allegations against filmmaker Sajid Khan, accusing him of inappropriate behaviour during a meeting. This adds to the growing list of accusations against Khan, who has been previously named in other misconduct cases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terrorist-attack-baisaran-valley-jammu-and-kashmir-tourists-2715931-2025-04-27",
      "headline": "Nothing to fear: Tourists return to Pahalgam days after terror strike killed 26Pahalgam is slowly returning to normal after the terror attacks, with both domestic and international tourists expressing confidence in the region's safety and continuing their travel plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/senthil-balaji-ponmudy-quit-as-tamil-nadu-minister-supreme-court-ultimatum-money-laundering-case-stalin-2715953-2025-04-27",
      "headline": "Senthil Balaji quits as Tamil Nadu Minister days after Supreme Court ultimatumTamil Nadu ministers V Senthil Balaji, who was facing a Supreme Court ultimatum in a money laundering case, and K Ponmudy, who came under fire for controversial religious remarks, resigned from the MK Stalin Cabinet."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-fire-rohini-jhuggi-cluster-children-die-shanties-gutted-rescue-ops-2715928-2025-04-27",
      "headline": "2 children die after massive fire breaks out at jhuggi cluster in Delhi's RohiniA massive fire engulfed slums in Rohini. Bodies of two children under the age of three were recovered from the spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-to-make-his-met-gala-debut-in-a-sabyasachi-ensemble-report-2715941-2025-04-27",
      "headline": "Shah Rukh Khan to make his Met Gala debut in a Sabyasachi ensemble: ReportAccording to reports, Bollywood icon Shah Rukh Khan is set to debut at the Met Gala 2025, donning a Sabyasachi creation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-champions-second-title-vs-tottenham-hotspur-2715969-2025-04-27",
      "headline": "Liverpool clinch 2nd Premier League title in Arne Slot's first year as coachLiverpool fans erupted at Anfield as Arne Slot's side secured the 2024-25 Premier League title with a commanding 5-1 victory over Tottenham, officially ushering in a new era after Jürgen Klopp's departure."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-terrorists-trekked-22-hours-through-rough-terrain-say-sources-2715858-2025-04-27",
      "headline": "Terrorists trekked 22 hours through rough terrain for Pahalgam attack: SourcesTwo mobile phones - one belonging to a local resident and the other to a tourist - were snatched by the terrorists during the Pahalgam attack, sources said. Four attackers were involved in the carnage: three foreign terrorists and one local militant, Adil Thokar, sources added. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/members-of-indian-community-abroad-hold-protest-against-pahalgam-attack-pics-2715989-2025-04-28",
      "headline": "In pics: Members of Indian community abroad hold protests against Pahalgam attackMembers of Indian communities in different countries are taking to the streets to express grief, resentment and anger against the incident, also holding protests."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rcb-director-of-cricket-mo-bobat-on-bowling-performance-dc-vs-rcb-2716045-2025-04-28",
      "headline": "We bowled really well and consistently put pressure on DC batters: RCB DirectorRoyal Challengers Bengaluru (RCB) Director of cricket Mo Bobat praised their all-round bowling performance against Delhi Capitals (DC), which helped them restrict DC to 162. RCB managed to win the match by six wickets and climb to the top of the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-director-mo-bobat-praises-krunal-pandya-dc-vs-rcb-2716033-2025-04-28",
      "headline": "RCB Director praises 'tactical' Krunal Pandya after match-winning show vs DCRoyal Challengers Bengaluru (RCB) Director of cricket Mo Bobat was full of praise for Krunal Pandya following his match-winning all-round performance against Delhi Capitals (DC). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-kevin-pietersen-dc-vs-rcb-ipl-2025-india-2715982-2025-04-28",
      "headline": "T20I comeback for Rahul? Pietersen backs DC star at No. 4 for IndiaIPL 2025, DC v RCB: Delhi Capitals' mentor Kevin Pietersen said that India should consider KL Rahul to bat at No.4 in T20Is. Rahul is currently the top run-getter for DC in the ongoing tournament. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/how-arne-slots-liverpool-won-a-premier-league-race-that-felt-different-2716006-2025-04-28",
      "headline": "How Arne Slot's Liverpool won a Premier League race that felt differentIn a Premier League season shaped by Liverpool's dominance, it was the fierce, unforgiving chase between the chasing pack that truly brought the heartbeat and drama week after relentless week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-anil-kumble-on-krunal-pandya-dc-vs-rcb-2716002-2025-04-28",
      "headline": "Krunal Pandya's judgement of the situation was spot on: Anil KumbleIPL 2025, DC vs RCB: Anil Kumble praised Krunal Pandya for his game awareness after the Royal Challengers Bengaluru beat Delhi Capitals by six wickets on Sunday"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-lsg-zaheer-khan-press-rishabh-pant-captaincy-batting-form-2715966-2025-04-28",
      "headline": "Rishabh Pant fantastic as LSG captain, batting dip not due to price tag: ZaheerIPL 2025, MI vs LSG: Mentor Zaheer Khan praised Rishabh Pant's captaincy, saying the Lucknow Super Giants are not overtly worried about the batting form of their skipper. Pant has managed just 110 runs in nine innings in this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/mi-vs-lsg-ipl-2025-press-conference-zaheer-khan-mayank-yadav-2715981-2025-04-28",
      "headline": "Mayank Yadav will bowl faster as he plays more in IPL 2025: Zaheer KhanIPL 2025: Lucknow Super Giants mentor and former India fast bowler Zaheer Khan on Sunday exuded confidence that express pacer Mayank Yadav's bowling speed will improve as he plays more matches in the IPL. The right-arm tearaway pacer Mayank made his comeback after a long injury lay-off, picking up two wickets against Mumbai Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-mocks-kl-rahul-my-home-celebration-dc-vs-rcb-watch-video-2715980-2025-04-28",
      "headline": "Watch: Virat Kohli teases KL Rahul, mimics iconic Chinnaswamy celebration in DelhiVirat Kohli brought light-hearted banter to RCB's big win over DC, cheekily mocking KL Rahul's \"my home\" celebration — with the two stars later sharing laughs as RCB continued their record-breaking away run in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dc-vs-rcb-ipl-2025-virat-kohli-batting-2715974-2025-04-27",
      "headline": "Kohli flaunts orthodox batting approach: Can't just come out and hitIPL 2025, DC vs RCB: Virat Kohli played a crucial role in Royal Challengers Bengaluru's six-wicket win over Delhi Capitals on Sunday at the Wankhede Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-rcb-record-6th-away-win-krunal-pandya-virat-kohli-2715972-2025-04-27",
      "headline": "RCB clinch record 6th away win as Krunal Pandya, Virat Kohli fire in DelhiIPL 2025, DC vs RCB: Krunal Pandya chipped in with an all-round show and Virat Kohli hit a solid fifty as RCB clinched a six-wicket win in Delhi on Sunday, April 27. It was RCB's sixth straight win away from home this season -- a new record in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-champions-second-title-vs-tottenham-hotspur-2715969-2025-04-27",
      "headline": "Liverpool clinch 2nd Premier League title in Arne Slot's first year as coachLiverpool fans erupted at Anfield as Arne Slot's side secured the 2024-25 Premier League title with a commanding 5-1 victory over Tottenham, officially ushering in a new era after Jürgen Klopp's departure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/mi-vs-lsg-ipl-2025-press-conference-zaheer-khan-mayank-yadav-2715981-2025-04-28",
      "headline": "Mayank Yadav will bowl faster as he plays more in IPL 2025: Zaheer KhanIPL 2025: Lucknow Super Giants mentor and former India fast bowler Zaheer Khan on Sunday exuded confidence that express pacer Mayank Yadav's bowling speed will improve as he plays more matches in the IPL. The right-arm tearaway pacer Mayank made his comeback after a long injury lay-off, picking up two wickets against Mumbai Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-mocks-kl-rahul-my-home-celebration-dc-vs-rcb-watch-video-2715980-2025-04-28",
      "headline": "Watch: Virat Kohli teases KL Rahul, mimics iconic Chinnaswamy celebration in DelhiVirat Kohli brought light-hearted banter to RCB's big win over DC, cheekily mocking KL Rahul's \"my home\" celebration — with the two stars later sharing laughs as RCB continued their record-breaking away run in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dc-vs-rcb-ipl-2025-virat-kohli-batting-2715974-2025-04-27",
      "headline": "Kohli flaunts orthodox batting approach: Can't just come out and hitIPL 2025, DC vs RCB: Virat Kohli played a crucial role in Royal Challengers Bengaluru's six-wicket win over Delhi Capitals on Sunday at the Wankhede Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-rcb-record-6th-away-win-krunal-pandya-virat-kohli-2715972-2025-04-27",
      "headline": "RCB clinch record 6th away win as Krunal Pandya, Virat Kohli fire in DelhiIPL 2025, DC vs RCB: Krunal Pandya chipped in with an all-round show and Virat Kohli hit a solid fifty as RCB clinched a six-wicket win in Delhi on Sunday, April 27. It was RCB's sixth straight win away from home this season -- a new record in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-champions-second-title-vs-tottenham-hotspur-2715969-2025-04-27",
      "headline": "Liverpool clinch 2nd Premier League title in Arne Slot's first year as coachLiverpool fans erupted at Anfield as Arne Slot's side secured the 2024-25 Premier League title with a commanding 5-1 victory over Tottenham, officially ushering in a new era after Jürgen Klopp's departure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-ipl-2025-mi-vs-lsg-fine-mumbai-defeat-2715968-2025-04-27",
      "headline": "Rishabh Pant fined Rs 24 lakh hours after LSG's defeat in MumbaiIPL 2025, MI vs LSG: Rishabh Pant was fined Rs 24 lakh for his second-over rate offence in Lucknow Super Giants' match against the Mumbai Indians on April 27 at the Wankhede Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shahrukh-khan-rinku-singh-rr-vs-gt-press-conference-2715963-2025-04-27",
      "headline": "Need 50-50 balance: Shahrukh Khan on Rinku Singh's bold 300 commentIPL 2025, RR vs GT: In the pre-match press conference, Shahrukh Khan responded to Rinku Singh's comments, saying that teams cannot plan their batting strategies before assessing the conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-lsg-esa-school-kids-hardik-pandya-neeta-ambani-selfie-2715958-2025-04-27",
      "headline": "Hardik Pandya, Nita Ambani snap special selfie with school kids at WankhedeHardik Pandya and Nita Ambani captured a heart-warming selfie with 19,000 schoolchildren after Mumbai Indians extended their winning streak to five matches with a dominant victory over Lucknow Super Giants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-lsg-rishabh-pant-response-critics-mumbai-2715954-2025-04-27",
      "headline": "Pant responds to critics after Mumbai flop-show: Not going to question myselfIPL 2025, MI vs LSG: Captain Rishabh Pant said he was not doubting himself despite enduring a lean patch in the season. Pant was dismissed for 4 off 2 deliveries as Lucknow failed 55 runs short of a 216-run target in Mumbai on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pratika-rawal-india-sri-lanka-tri-series-hard-work-2715952-2025-04-27",
      "headline": "Pratika Rawal reaping the rewards after 'years of hard work'IND-W vs SL-W: 24-year-old Pratika Rawal made an unbeaten 50 off 62 balls as India beat Sri Lanka by nine wickets on Sunday, April 27, at the R Premadasa Stadium in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ravi-bishnoi-six-vs-jasprit-bumrah-mi-vs-lsg-2715943-2025-04-27",
      "headline": "IPL 2025: LSG's Ravi Bishnoi celebrates wildly after smashing six off BumrahRavi Bishnoi pulled off an ecstatic air-punch celebration after hitting a rare six off Jasprit Bumrah during LSG's IPL 2025 clash against Mumbai Indians, creating a light-hearted moment even as his side faced an eventual heavy defeat on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-lsg-match-report-jasprit-bumrah-suryakumar-yadav-2715940-2025-04-27",
      "headline": "Jasprit Bumrah returns to best as Mumbai win 5 in a rowMumbai Indians beat Lucknow Super Giants by 54 runs to continue their incredible run in the Indian Premier League. This was Mumbai's 5th win in a row this season as they continue their sensational second half comeback in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jacob-bethell-phil-salt-faf-du-plessis-dc-vs-rcb-2715937-2025-04-27",
      "headline": "Jacob Bethell debuts as RCB miss Phil Salt, Faf du Plessis returns for DCIPL 2025, DC vs RCB: Phil Salt missed the game in New Delhi after suffering from fever. Delhi Capitals' vice-captain Faf du Plessis has recovered from a groin injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pratika-rawal-india-sri-lanka-tri-series-hard-work-2715952-2025-04-27",
      "headline": "Pratika Rawal reaping the rewards after 'years of hard work'IND-W vs SL-W: 24-year-old Pratika Rawal made an unbeaten 50 off 62 balls as India beat Sri Lanka by nine wickets on Sunday, April 27, at the R Premadasa Stadium in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ravi-bishnoi-six-vs-jasprit-bumrah-mi-vs-lsg-2715943-2025-04-27",
      "headline": "IPL 2025: LSG's Ravi Bishnoi celebrates wildly after smashing six off BumrahRavi Bishnoi pulled off an ecstatic air-punch celebration after hitting a rare six off Jasprit Bumrah during LSG's IPL 2025 clash against Mumbai Indians, creating a light-hearted moment even as his side faced an eventual heavy defeat on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-lsg-match-report-jasprit-bumrah-suryakumar-yadav-2715940-2025-04-27",
      "headline": "Jasprit Bumrah returns to best as Mumbai win 5 in a rowMumbai Indians beat Lucknow Super Giants by 54 runs to continue their incredible run in the Indian Premier League. This was Mumbai's 5th win in a row this season as they continue their sensational second half comeback in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jacob-bethell-phil-salt-faf-du-plessis-dc-vs-rcb-2715937-2025-04-27",
      "headline": "Jacob Bethell debuts as RCB miss Phil Salt, Faf du Plessis returns for DCIPL 2025, DC vs RCB: Phil Salt missed the game in New Delhi after suffering from fever. Delhi Capitals' vice-captain Faf du Plessis has recovered from a groin injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/sudirman-cup-2025-pv-sindhu-india-vs-denmark-score-china-2715936-2025-04-27",
      "headline": "Sudirman Cup: PV Sindhu loses as India go down 1-4 to Denmark in openerSudirman Cup 2025: India began their Sudirman Cup campaign on a disappointing note, losing 1-4 to Denmark. PV Sindhu and HS Prannoy lost their singles matches in stragiht games on Sunday, April 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-lsg-rishabh-pant-flop-zaheer-khan-consoles-no-tension-2715932-2025-04-27",
      "headline": "MI vs LSG: Gutted Rishabh Pant consoled by Zaheer Khan after another flopshowRishabh Pant's disastrous IPL 2025 campaign continued with another early dismissal against Mumbai Indians, but Lucknow Super Giants mentor Zaheer Khan was quick to console his skipper, offering a reassuring gesture."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/antonio-rudiger-apology-copa-del-rey-outburst-real-madrid-vs-barcelona-referee-2715924-2025-04-27",
      "headline": "Antonio Rudiger issues apology after Copa del Rey outburst: Did a mistakeAntonio Rudiger issued a public apology after his furious outburst during Real Madrid's Copa del Rey final loss, admitting shame over throwing an ice pack at the referee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-delhi-capitals-vs-royal-challengers-bengaluru-updates-today-match-2715923-2025-04-27",
      "headline": "DC vs RCB Highlights: Bengaluru continue dream away run with 6-wicket winIPL 2025, DC vs RCB Highlights: Royal Challengers Bengaluru beat Delhi Capitals by 6 wickets at the Arun Jaitley Stadium. RCB also became the first team in IPL history to win six away matches in a row. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-treble-hansi-flick-copa-del-rey-final-real-madrid-2715926-2025-04-27",
      "headline": "Indomitable Barcelona targetting treble: Hansi Flick after Copa del Rey winFC Barcelona are aiming for the treble this season, said manager Hansi Flick after the team beat Real Madrid in the Copa del Rey final to win the first major competition of the season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-lsg-mayank-yadav-returns-rohit-sharma-hardik-pandya-wickets-2715925-2025-04-27",
      "headline": "MI vs LSG: Mayank Yadav hits 140-plus kph on IPL return, bags 2 big wicketsIPL 2025, MI vs LSG: Express fast bowler Mayank Yadav bowled with control and consistency on his return to competitive cricket for the first time since October 2024. He got the wickets of Rohit Sharma and Hardik Pandya in Mumbai on Sunday, April 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-sri-lanka-sneh-rana-colombo-tri-series-victory-highlights-2715912-2025-04-27",
      "headline": "Rana, bowlers script India's thumping win over Sri Lanka in tri-seriesHarmanpreet Kaur's India beat Sri Lanka by nine wickets on Sunday at the R Premadasa Stadium in Colombo to make a brilliant start to their campaign in the Women's tri-series. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-faster-than-virat-kohli-rohit-sharma-to-hit-4000-runs-in-ipl-2715907-2025-04-27",
      "headline": "Suryakumar Yadav faster than Virat Kohli, Rohit Sharma to hit 4000 runs in IPLSuryakumar Yadav became the fastest Indian to score 4000 runs in IPL history, achieving the milestone in just 2714 balls during Mumbai Indians' match against Lucknow Super Giants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-super-league-indians-broadcast-team-retuirn-home-2715898-2025-04-27",
      "headline": "Indians involved in Pakistan Super League return to countryThe Pakistan Cricket Board facilitated the return of 23 Indian nationals who were involved in the production duties of Pakistan Super League, following the Pahalgam terror attack. This move comes amid rising diplomatic tensions between the two nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-lsg-rishabh-pant-trust-lucknow-eoin-morgan-2715892-2025-04-27",
      "headline": "LSG not trusting Rishabh Pant? Eoin Morgan urges captain to embrace big momentsIPL 2025, MI vs LSG: Former England captain said Rishabh Pant should embrace big moments instead of holding himself back. Pant batted at No. 7 in their limp loss to Delhi Capitals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mayank-yadav-injury-return-mi-vs-lsg-2715867-2025-04-27",
      "headline": "Mayank Yadav returns from injury layoff, returns for clash vs MITearaway fast bowler Mayank Yadav made his return to professional cricket in Lucknow Super Giants match vs Mumbai Indians. Mayank has been out of action since India's T20I match vs Bangladesh in October 2024."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/indian-womens-cricket-team-sport-black-armbands-for-pahalgam-terror-attack-victims-2715861-2025-04-27",
      "headline": "Indian women's team sport black armbands to pay homage to Pahalgam attack victimsThe Indian women's cricket team was seen wearing black armbands during the opening match of the tri-nation series against Sri Lanka to pay homage to the victims of the Pahalgam terror attack. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}