{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chief-economic-advisor-v-anantha-nageswaran-says-us-tariff-impact-will-be-temporary-2770946-2025-08-14",
      "headline": "US tariff impact will be temporary, private sector should step up: Chief economistChief Economic Advisor V Anantha Nageswaran attributed the growth slowdown in FY25, which saw a deceleration to 6.5 per cent from FY24's 9.2 per cent, to tight credit conditions and liquidity issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-bank-revises-minimum-balance-for-savings-accounts-after-outrage-2770858-2025-08-13",
      "headline": "ICICI Bank lowers minimum balance for savings accounts after outrageThe new minimum average balance thresholds are as follows: Rs 15,000 for customers in metro and urban areas, Rs 7,500 for semi-urban customers, and Rs 2,500 for those in rural locations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/5-credit-score-myths-you-should-stop-believing-2770794-2025-08-13",
      "headline": "5 credit score myths you should stop believingYour credit score can open doors to better loans and credit cards, or shut them. Yet, many people still rely on half-truths and hearsay. Let's separate fact from fiction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-markets-regulator-plans-simplify-foreign-investment-rules-norms-sebi-reforms-2770669-2025-08-13",
      "headline": "Sebi eases rules for foreign investors: Here's all you need to knowSebi plans to introduce simpler rules to make it easier for foreign investors to enter India's markets. The move aims to cut compliance burdens and attract more long-term overseas capital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indians-sent-abroad-enough-money-in-a-decade-to-build-62-iits-says-rbi-data-2770702-2025-08-13",
      "headline": "Indians sent abroad enough money in a decade to build 62 IITs, says RBI dataIn 2023–24 alone, students remitted about Rs 29,000 crore abroad for their studies, almost the same as the previous year. A decade ago, this figure was just Rs 2,429 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-the-unified-pension-scheme-is-not-winning-over-government-employees-ups-vs-nps-2770652-2025-08-13",
      "headline": "Unified Pension Scheme offers security, but why aren't employees joining?With assured monthly income and inflation protection, UPS should have been an instant hit. Instead, uptake has been lukewarm. Here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-304-points-higher-nifty-above-24600-pharma-stocks-lead-gains-2770661-2025-08-13",
      "headline": "Sensex ends 304 points higher, Nifty above 24,600; pharma stocks lead gainsThe S&P BSE Sensex rose 304.32 points to 80,539.91, while the NSE Nifty50 added 131.95 points, finishing at 24,619.35. Broader market indices also ended the session in the green, as investor sentiment was lifted by favourable inflation data from both India and the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-8-year-low-july-falling-vegatable-price-sticky-core-rising-costs-low-salary-explained-2770612-2025-08-13",
      "headline": "Inflation falls to an 8-year low, but are households feeling any relief?Inflation has fallen to an eight-year low, but are households really feeling the pinch ease in everyday expenses?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chryscapital-takes-over-theobroma-bakery-chain-rs-2000-crores-acquisition-founders-retain-stake-expansion-2770519-2025-08-13",
      "headline": "ChrysCapital takes over Theobroma bakery chain for Rs 2000 croresChrysCapital acquires majority control of Theobroma in a Rs 2,000 crore deal, with the founders retaining only a 10% minority stake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nithin-kamath-explains-how-sebi-quiet-tech-reform-is-empowering-investors-2770544-2025-08-13",
      "headline": "Nithin Kamath explains how Sebi's quiet tech reform is empowering investorsBrokerage firms have to connect with several entities, like multiple stock exchanges, depositories, banks, and others. This meant hundreds of APIs and file formats had to be handled separately, creating hidden challenges behind the scenes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gen-z-mutual-fund-investing-risk-hungry-mid-cap-small-cap-sip-india-2770152-2025-08-13",
      "headline": "SIPs, small-caps, and the Gen Z rush for high returnsGen Z investors are chasing big gains in mid- and small-cap funds, but soaring valuations and volatile markets mean the ride could get bumpy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-property-for-the-first-time-must-know-financial-steps-for-beginners-first-time-homebuyer-tips-2770462-2025-08-13",
      "headline": "Tax perks, hidden costs, rental yield: What first-time homebuyers should knowStepping into the property market for the first time? Before you sign any papers, make sure you're financially prepared to handle not just the purchase price but the many hidden costs that follow. Here's a beginner's financial checklist to make your property investment a smart one."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/netflix-steve-trailer-cillian-murphy-reform-school-mental-health-2770907-2025-08-13",
      "headline": "Steve trailer: Cillian Murphy as headmaster fights his inner demons at reform schoolNetflix has released the official trailer for Steve, a drama starring Cillian Murphy as a headteacher fighting to save his reform school. The film explores deep mental health issues amid institutional challenges in the 1990s England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/antony-starr-farewell-note-final-sixth-season-the-boys-prime-video-homelander-2770903-2025-08-13",
      "headline": "Antony Starr shares farewell note ahead of final season of The BoysActor Antony Starr bid farewell to his role as Homelander in 'The Boys' in a heartfelt Instagram. He said the role helped him grow personally and creatively. The fifth and final season of 'The Boys' will be released in 2026.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/exclusive-vivek-agnihotri-the-bengal-files-trailer-to-be-attached-with-war-2-coolie-2770855-2025-08-13",
      "headline": "Vivek Agnihotri's The Bengal Files trailer to be attached with War 2 and CoolieThe trailer for director Vivek Agnihotri's upcoming film 'The Bengal Files: Right to Life' will be attached to 'War 2' and 'Coolie'. Here's what we know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-hrithik-roshan-jr-ntr-request-fans-avoid-spoilers-yrf-spy-universe-ayan-mukerji-kiara-advani-2770839-2025-08-13",
      "headline": "Hrithik, Jr NTR urge fans to let War 2 be a secret to everyone: Spoilers are no funHrithik Roshan and Jr NTR appealed to fans to keep 'War 2' spoilers under wraps ahead of the film's release. Their request aims to preserve the film's thrilling experience for all viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/atif-aslam-mourns-father-muhammad-aslam-death-instagram-post-final-goodbye-to-iron-man-2770800-2025-08-13",
      "headline": "Atif Aslam mourns father Muhammad Aslam's death: Final goodbye to my Iron manIn an emotional post, Pakistani singer Atif Aslam shared the news of his father Muhammad Aslam's death on Tuesday. His father, aged 77, died of health complications. Atif Aslam has sung several hit songs for both Pakistani and Indian films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/uttar-pradesh-government-praises-mahavatar-narsimha-cultural-revival-2770834-2025-08-13",
      "headline": "Uttar Pradesh government praises Mahavatar Narsimha for cultural revivalThe Uttar Pradesh government applauded 'Mahavatar Narsimha' for its cultural impact on Wednesday. Despite having a slow start, the film performed well at the global box office due to positive word of mouth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/niyati-joshi-exit-yeh-rishta-kya-kehlata-hai-swarna-goenka-farewell-2770836-2025-08-13",
      "headline": "Niyati Joshi exits Yeh Rishta Kya Kehlata Hai after 6 years: Nothing lasts foreverNiyati Joshi has bid an emotional goodbye to her role in Yeh Rishta Kya Kehlata Hai after six years. Her departure marks the end of a memorable chapter for fans and the show alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bipasha-basu-cryptic-post-strong-women-with-mucles-mrunal-thakur-body-shaming-video-2770817-2025-08-13",
      "headline": "Bipasha Basu asks women to get muscles after Mrunal Thakur calls her manly in videoBipasha Basu shared an empowering Instagram story urging women to build strength. Her message challenges outdated views on women's physical power following Mrunal Thakur's body-shaming video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aamir-khan-rajinikanth-old-clip-aatank-hi-aatank-film-viral-coolie-2770691-2025-08-13",
      "headline": "Aamir Khan-Rajinikanth's old clip from Aatank Hi Aatank goes viral ahead of CoolieA clip from the 1995 film 'Aatank Hi Aatank' featuring actors Aamir Khan and Rajinikanth has gone viral. The film garnered the attention of social media users a day before the release of their much-anticipated film 'Coolie'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/fwice-seeks-clarification-from-badshah-over-dallas-event-pakistani-company-2770751-2025-08-13",
      "headline": "Film body seeks clarification from Badshah over Dallas event by Pakistani companyFWICE has written to Badshah seeking clarification on his Dallas concert sponsored by a Pakistani company. The move highlights tensions over cross-border collaborations amid rising national security concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mark-ruffalo-task-crime-drama-hbo-mini-series-premiere-september-2770711-2025-08-13",
      "headline": "Task trailer: Mark Ruffalo races against time to catch suspicious criminalHBO's crime drama Task starring Mark Ruffalo will premiere on 7 September 2025. The series explores a tense moral clash within a family-led crime investigation in Philadelphia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mukesh-khanna-doubts-ranbir-kapoor-play-lord-rama-ramayana-2770572-2025-08-13",
      "headline": "Mukesh Khanna questions Ranbir Kapoor's casting as Lord Rama in RamayanaActor Mukesh Khanna recently shared his views on the casting of the lead role in Nitesh Tiwari's 'Ramayana'. He voiced his reservations about whether Ranbir Kapoor would be able to convincingly portray Lord Rama's 'Maryada Purushottam' image."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/richa-chadha-says-motherhood-has-calmed-her-rebel-spirit-2770670-2025-08-13",
      "headline": "Richa Chadha says motherhood has calmed her rebel spiritActor Richa Chadha shared that since becoming a mother she speaks more gently and has grown more patient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/priyanshu-painyulli-robin-character-mirzapur-spin-off-2770257-2025-08-13",
      "headline": "Exclusive: Priyanshu Painyulli wants a spin-off for Robin's character in MirzapurActor Priyanshu Painyulli, in an interview with India Today, expressed that his character Robin in 'Mirzapur' should have a spin-off. He also expressed how the character changed him and if he would be a part of the film based on the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/west-bengal-mandates-daily-prime-time-bengali-films-cinemas-multiplex-2770688-2025-08-13",
      "headline": "West Bengal orders daily prime time Bengali films in all cinemasWest Bengal government has made it compulsory for all cinema halls to screen Bengali films daily during prime time. This move aims to boost regional cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-50-years-celebration-kamal-haasan-mammootty-tribute-coolie-release-2770637-2025-08-13",
      "headline": "Kamal Haasan, Mammootty pay tribute to Rajinikanth on 50 glorious years in cinemaActors Kamal Haasan and Mammootty paid tribute to superstar Rajinikanth on the completion of his \"glorious 50 years\" in cinema. Apart from them, singer-composer Anirudh Ravichander and director Lokesh Kanagaraj also celebrated his golden jubilee in the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/saare-jahan-se-accha-review-spy-drama-india-pakistan-nuclear-tensions-2770654-2025-08-13",
      "headline": "Saare Jahan Se Accha review: Taut spy tale with impactful performancesRelease Date:Wed Aug 13, 2025Saare Jahan Se Accha series review: The Netflix series explores the tense espionage between India and Pakistan in the 1960s and 70s. The series highlights the personal sacrifices behind nuclear rivalry and quiet patriotism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/divya-khossla-neil-nitin-mukesh-ek-chatur-naar-release-date-first-look-posters-2770650-2025-08-13",
      "headline": "Divya Khossla and Neil Nitin Mukesh's Ek Chatur Naar to release on this date. Posters outThe first-look posters of actors Divya Khossla and Neil Nitin Mukesh's film 'Ek Chatur Naar' were released on Wednesday. The thriller comedy is slated to hit the big screen in September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-celebrates-1st-teacher-rajinikanths-legacy-amid-war-2-vs-coolie-2770614-2025-08-13",
      "headline": "Hrithik Roshan celebrates 1st teacher Rajinikanth's legacy amid War 2 vs CoolieHrithik Roshan celebrated Rajinikanth's 50 years in cinema with a special post on social media. This comes amid their films 'War 2' vas Coolie' at the box office. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-ncr-stray-dogs-relocation-case-shifted-to-3-judge-bench-of-supreme-court-amid-backlash-hearing-tomorrow-2770849-2025-08-13",
      "headline": "Larger Supreme Court bench to hear Delhi dogs case today amid backlashThe Supreme Court has shifted the Delhi-NCR stray dogs case to a new three-judge bench and directed civic bodies to create 5,000-capacity dog shelters within eight weeks, ensuring humane care, sterilisation, and no re-release of strays. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-warns-russia-severe-consequences-putin-refuses-ukraine-peace-deal-glbs-2770930-2025-08-14",
      "headline": "Trump warns Russia of 'very severe consequences' if Putin blocks Ukraine dealThe US president's warning comes after a high-level virtual call between Trump, Zelenskyy, and European leaders, hosted by Germany, to outline non-negotiable positions ahead of the Alaska talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-independence-day-speech-operation-sindoor-honour-armed-forces-valour-2770959-2025-08-14",
      "headline": "PM's Independence Day speech to highlight Op Sindoor, honour armed forces' valourAccording to sources, PM Modi's address will focus on India's global vision, international partnerships, and the vital role of the armed forces in safeguarding the nation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/thats-what-they-do-donald-trump-on-suspected-russian-role-in-us-court-system-hack-2770906-2025-08-13",
      "headline": "That's what they do: Trump on suspected Russian role in US court system hackUS President Donald Trump on Wednesday did not rule out the possibility of Russia being behind the recent hack of the computer system that manages US federal court documents, including highly confidential files, saying, \"They are good at it.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/dear-dump-truck-my-mercedes-stalling-of-ethanol-blending-petrol-asim-munir-pakistan-india-reforms-economy-2770533-2025-08-13",
      "headline": "Dear Dump Truck, My Mercedes is Already Stalling Due to EthanolThe real threat to the Mercedes called India isn't Asim Munir's rickety dump truck. It's our own engine being corroded by ethanol of all kinds. The engine needs servicing and pure petrol so that others don't zoom past us."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-lawyer-filed-life-threat-plea-without-consent-supriya-shrinate-withdraw-statement-pune-court-2770896-2025-08-13",
      "headline": "Rahul Gandhi's lawyer filed life threat plea without consent: Supriya ShrinateCongress leader Rahul Gandhi will withdraw a Pune court statement citing a threat to his life, after his lawyer filed it without consent in a Savarkar defamation case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-bank-revises-minimum-balance-for-savings-accounts-after-outrage-2770858-2025-08-13",
      "headline": "ICICI Bank lowers minimum balance for savings accounts after outrageThe new minimum average balance thresholds are as follows: Rs 15,000 for customers in metro and urban areas, Rs 7,500 for semi-urban customers, and Rs 2,500 for those in rural locations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-safe-are-natural-ozempic-alternatives-in-diabetes-care-2770684-2025-08-13",
      "headline": "How safe are 'natural' Ozempic alternatives in diabetes care?In India, home to 74 million diabetes patients, a range of supplements is being marketed as natural GLP-1 alternatives, but careful awareness is essential"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/stray-dog-rumours-fuel-hyderabad-mob-attack-cops-allegedly-refuse-complaint-2770850-2025-08-13",
      "headline": "Stray dog rumours fuel Hyderabad mob attack, cops allegedly refuse complaintIn Hyderabad, misinformation over stray dogs sparked a mob assault on a 31-year-old woman and her friend. Despite their severe injuries, police delayed responding and allegedly refused to register a case even after a week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/former-indian-diplomat-vikas-swarup-slams-us-over-pakistan-ties-calls-relationship-short-term-and-tactical-2770882-2025-08-13",
      "headline": "US getting in bed with Pak strategic mistake: Ex-diplomat calls ties 'short term'Former Indian diplomat Vikas Swarup said that the relationship with Pakistan right now is a very tactical and short-term, primarily motivated by the financial gain that the Trump family and Witkoff family hope to make from the cryptocurrency assets in Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-son-arjun-engagement-saaniya-chandok-2770884-2025-08-13",
      "headline": "Sachin Tendulkar's son Arjun engaged to Ravi Ghai's granddaughter Saaniya ChandokLegendary Indian batter Sachin Tendulkar's son, Arjun Tendulkar, has been engaged to Saaniya Chandok, the granddaughter of prominent Mumbai businessman Ravi Ghai.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-hearing-bihar-special-intensive-revision-process-voter-friendly-more-identity-options-aadhar-card-inclusion-2770714-2025-08-13",
      "headline": "Bihar SIR process voter-friendly: Supreme Court says 11 documents better than 7The Supreme Court backs Bihar's Special Intensive Revision of voter rolls as \"voter-friendly,\" noting expanded ID options despite Aadhaar exclusion, while petitioners warn of possible mass disenfranchisement.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/who-is-aravind-srinivas-the-man-who-wrote-letter-to-sundar-pichai-seeking-to-buy-google-chrome-2770703-2025-08-13",
      "headline": "Who is Aravind Srinivas, the man who made a bid to buy Google ChromeAravind Srinivas, the CEO and co-founder of Perplexity AI, was born in Chennai, India. He studied at IIT Madras before moving to the US for further education at the University of California, Berkeley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-orders-humane-treatment-new-shelters-stray-dogs-india-2770857-2025-08-13",
      "headline": "Ensure no cruelty: What top court said in its Delhi-NCR stray dogs relocation orderThe Supreme Court, in its August 11 order, issued guidelines ensuring the humane treatment of stray dogs relocated to shelters, emphasising adequate care and the creation of new facilities over the coming weeks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-origin-doctor-to-pay-2-million-dollar-us-healthcare-fraud-ajay-aggarwal-medicare-texas-healthcare-programmes-crime-america-2770842-2025-08-13",
      "headline": "Indian-origin US doctor fined $2M for surgery billing fraudAn Indian-origin doctor has agreed to pay over $2 million to settle allegations of healthcare fraud. Between November 2021 and March 2023, the doctor, Ajay Aggarwal, allegedly billed Medicare and other federally funded programmes for expensive surgical procedures he never performed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-mla-jds-sl-bhojegowda-stray-dogs-supreme-court-compost-rabies-delhi-ncr-2770759-2025-08-13",
      "headline": "Got 2,800 dogs killed, buried them as compost: Shocker from Karnataka politicianJD(S) Karnataka Legislative Council member claimed he oversaw the killing of 2,800 stray dogs in Chikkamagaluru. This comes at a time when the Supreme Court ordered authorities to immediately catch, sterilise, and permanently relocate stray dogs to shelters in Delhi-NCR."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/stray-dogs-permanent-catch-removal-delhi-ncr-supreme-court-order-dog-bites-rabies-life-without-parole-opinion-2770698-2025-08-13",
      "headline": "Life without parole: The state of Delhi-NCR strays?Anger-induced judgments that fail to consider practicality are now a reality in India. Dogs, who have lived with human beings for centuries, are facing unprecedented hate simply for their existence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-next-for-bengali-migrants-heeding-mamata-call-to-return-from-bjp-ruled-states-2769608-2025-08-11",
      "headline": "What next for Bengali migrants heeding Mamata call to return from BJP-ruled states?Bengali identity politics aside, the returnees pose both a humanitarian and socioeconomic integration challenge for the Trinamool Congress government\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-love-story-friendship-band-to-romance-2770407-2025-08-13",
      "headline": "Taylor Swift and Travis Kelce's love story: From friendship band to epic romanceTravis Kelce shared insights on his natural romance with Taylor Swift amid media attention. He recalled how he gifted her a friendship bracelet with his number on it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-video-tea-with-dead-voters-election-commission-dig-2770811-2025-08-13",
      "headline": "Had tea with 'dead people': Rahul Gandhi shares video to take dig at poll bodyRahul Gandhi shared a video claiming to meet \"dead voters\" in Bihar, accusing the Election Commission of voter list irregularities.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/iit-iim-leaders-back-narayana-murthy-engineers-managers-no-difference-2770641-2025-08-13",
      "headline": "IIT, IIM leaders back Narayana Murthy, say engineers and managers similar nowNarayana Murthy says there's no real difference between management and tech graduates today – both approach problems from different angles. We spoke to leaders at IIM Ahmedabad and IIT Gandhinagar to explore how far this is true in the AI age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/putim-trump-meet-sale-of-alaska-summit-russia-ukraine-war-us-russia-diplomacy-negotiations-history-explained-2770647-2025-08-13",
      "headline": "Alaska, where Putin is meeting Trump, was Russian territory. US got it dirt cheapThere is a Russian-American real estate history to Alaska where US President Donald Trump is meeting Vladimir Putin, his Russian counterpart. Alaska was sold in 1867 by the Russian Tsar to the US for merely $7.2 million (roughly $160 million today). Alaska's story is one of America's smartest land deals that Trump would laud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/chia-seeds-yogurt-gut-health-nutrient-absorption-benefits-2770715-2025-08-13",
      "headline": "Why chia seeds with yogurt beat chia water for gut health, says top nutritionistNutrition experts highlight the benefits of pairing soaked chia seeds with yogurt for improved gut health. This combination enhances nutrient absorption and reduces digestive discomfort risks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-honour-killing-woman-killed-family-father-uncle-arrested-neet-qualifier-2770793-2025-08-13",
      "headline": "Save me: Gujarat woman's chilling text to lover hours before honour killingAn 18-year-old woman from Gujarat was allegedly killed by her family in a suspected honour killing, after having cleared the NEET exam. \"Come and take me away, otherwise my family will get me married against my will. If I refuse, they will kill me,\" her last message to her boyfriend detailed her desperation. Hours later, her body was discovered."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/netflix-steve-trailer-cillian-murphy-reform-school-mental-health-2770907-2025-08-13",
      "headline": "Steve trailer: Cillian Murphy as headmaster fights his inner demons at reform schoolNetflix has released the official trailer for Steve, a drama starring Cillian Murphy as a headteacher fighting to save his reform school. The film explores deep mental health issues amid institutional challenges in the 1990s England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/exclusive-vivek-agnihotri-the-bengal-files-trailer-to-be-attached-with-war-2-coolie-2770855-2025-08-13",
      "headline": "Vivek Agnihotri's The Bengal Files trailer to be attached with War 2 and CoolieThe trailer for director Vivek Agnihotri's upcoming film 'The Bengal Files: Right to Life' will be attached to 'War 2' and 'Coolie'. Here's what we know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-hrithik-roshan-jr-ntr-request-fans-avoid-spoilers-yrf-spy-universe-ayan-mukerji-kiara-advani-2770839-2025-08-13",
      "headline": "Hrithik, Jr NTR urge fans to let War 2 be a secret to everyone: Spoilers are no funHrithik Roshan and Jr NTR appealed to fans to keep 'War 2' spoilers under wraps ahead of the film's release. Their request aims to preserve the film's thrilling experience for all viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/atif-aslam-mourns-father-muhammad-aslam-death-instagram-post-final-goodbye-to-iron-man-2770800-2025-08-13",
      "headline": "Atif Aslam mourns father Muhammad Aslam's death: Final goodbye to my Iron manIn an emotional post, Pakistani singer Atif Aslam shared the news of his father Muhammad Aslam's death on Tuesday. His father, aged 77, died of health complications. Atif Aslam has sung several hit songs for both Pakistani and Indian films."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chennai-grand-masters-kartikeyan-win-vidit-gujrathi-vincent-keymer-2770919-2025-08-13",
      "headline": "Chennai Grand Masters: Karthikeyan beats Vidit, Keymer closes in on titleGrandmaster M Karthikeyan kept his hopes alive in the Chennai Grand Masters with a hard-fought win over compatriot Vidit Gujrathi in Round 7, while Germany's Vincent Keymer tightened his grip on the title race. With only two rounds remaining, Keymer leads by 1.5 points and could clinch the crown in the next round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-judiciary-process-defended-richard-masters-city-case-delays-2770916-2025-08-13",
      "headline": "Timing of verdict on Man City's 115 charges out of our hands: Premier League CEOPremier League chief executive Richard Masters on Wednesday defended the league's judicial process, responding to criticism over the slow progress in Manchester City's disciplinary case involving 115 alleged breaches of financial regulations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-fractured-foot-cast-photo-india-england-2770911-2025-08-13",
      "headline": "Rishabh Pant shares photo of his fractured foot in a cast: I hate thisRishabh Pant has expressed his frustration over a plastered left foot, sharing a photo of it on his Instagram stories on Wednesday. He sustained the injury on the opening day of the fourth Test against England at Old Trafford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-goa-afc-champions-league-2-al-seeb-win-2770905-2025-08-13",
      "headline": "FC Goa return to AFC Champions League 2 with 2-1 win over Al SeebFC Goa beat Al Seeb 2-1 to reach the AFC Champions League Two group stage for the first time since 2021. Dejan Drazic and debutant Javier Siverio struck as the Gaurs held firm to secure a historic continental return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-venus-williams-oldest-singles-wildcard-2770897-2025-08-13",
      "headline": "Venus Williams gets a wildcard at 45, oldest singles player since 1981Venus Williams, at 45, will make her Grand Slam return at the US Open after a two-year absence, receiving a wild-card entry for singles. This marks her first major appearance since 2023 and makes her the oldest singles entrant since 1981."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-son-arjun-engagement-saaniya-chandok-2770884-2025-08-13",
      "headline": "Sachin Tendulkar's son Arjun engaged to Ravi Ghai's granddaughter Saaniya ChandokLegendary Indian batter Sachin Tendulkar's son, Arjun Tendulkar, has been engaged to Saaniya Chandok, the granddaughter of prominent Mumbai businessman Ravi Ghai.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-isl-clubs-legal-talks-season-uncertainty-2025-26-2770870-2025-08-13",
      "headline": "ISL saga: AIFF calls for meeting between legal counsels of federation and clubsThe All India Football Federation (AIFF) has asked the legal representatives of the federation and Indian Super League (ISL) clubs to hold discussions over the uncertainty surrounding the upcoming season of India's top-tier football league."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/top-end-t20-series-2025-live-streaming-squads-schedule-timings-2770869-2025-08-13",
      "headline": "Top End T20 series 2025: Squads, schedule and all you need to knowThe Top End T20 Series 2025, running from August 14 to 24 in Darwin, features 11 teams, including international sides like Pakistan Shaheens, Bangladesh A, and Nepal. The tournament will showcase exciting T20 action, ending with the final on August 24.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-darren-cahill-coach-rise-advice-2770854-2025-08-13",
      "headline": "Jannik Sinner a competition animal: How coach's advice scripted Italian star's riseDarren Cahill has played a key role in Jannik Sinner's rise to the top, focusing on consistent daily work. Since joining forces with Cahill in 2022, Sinner has won four Grand Slam titles, including Wimbledon, and now aims to defend his title at the US Open.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-vs-tottenham-uefa-super-cup-live-streaming-team-news-all-details-2770844-2025-08-13",
      "headline": "PSG vs Tottenham Live Streaming, UEFA Super Cup final 2025: All you need to knowEuropa League champions Tottenham Hotspur will be aiming to secure their second trophy in just three months when they face Champions League winners Paris Saint-Germain in the UEFA Super Cup on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-bakes-pizza-with-a-broken-foot-with-hilarious-accent-2770823-2025-08-13",
      "headline": "Watch: Chef Rishabh Pant bakes Pizza with broken foot, unveils hilarious avatarIndia wicketkeeper batter Rishabh Pant recently tried his hand at baking as he attempted to make a pizza with a broken foot with his own hilarious accent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-isl-clubs-legal-talks-season-uncertainty-2025-26-2770870-2025-08-13",
      "headline": "ISL saga: AIFF calls for meeting between legal counsels of federation and clubsThe All India Football Federation (AIFF) has asked the legal representatives of the federation and Indian Super League (ISL) clubs to hold discussions over the uncertainty surrounding the upcoming season of India's top-tier football league."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/top-end-t20-series-2025-live-streaming-squads-schedule-timings-2770869-2025-08-13",
      "headline": "Top End T20 series 2025: Squads, schedule and all you need to knowThe Top End T20 Series 2025, running from August 14 to 24 in Darwin, features 11 teams, including international sides like Pakistan Shaheens, Bangladesh A, and Nepal. The tournament will showcase exciting T20 action, ending with the final on August 24.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-darren-cahill-coach-rise-advice-2770854-2025-08-13",
      "headline": "Jannik Sinner a competition animal: How coach's advice scripted Italian star's riseDarren Cahill has played a key role in Jannik Sinner's rise to the top, focusing on consistent daily work. Since joining forces with Cahill in 2022, Sinner has won four Grand Slam titles, including Wimbledon, and now aims to defend his title at the US Open.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-vs-tottenham-uefa-super-cup-live-streaming-team-news-all-details-2770844-2025-08-13",
      "headline": "PSG vs Tottenham Live Streaming, UEFA Super Cup final 2025: All you need to knowEuropa League champions Tottenham Hotspur will be aiming to secure their second trophy in just three months when they face Champions League winners Paris Saint-Germain in the UEFA Super Cup on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-bakes-pizza-with-a-broken-foot-with-hilarious-accent-2770823-2025-08-13",
      "headline": "Watch: Chef Rishabh Pant bakes Pizza with broken foot, unveils hilarious avatarIndia wicketkeeper batter Rishabh Pant recently tried his hand at baking as he attempted to make a pizza with a broken foot with his own hilarious accent."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}