{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/shadowfax-technologies-ipo-enters-final-day-price-band-gmp-and-should-you-apply-2856064-2026-01-22",
      "headline": "Shadowfax Technologies IPO enters final day: Price band, GMP and should you apply?The allotment is expected to be finalised on 23 January 2026. Shares are likely to list on both the BSE and NSE on 28 January 2026, subject to market conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rupee-slides-over-91-per-us-dollar-free-fall-how-it-impacts-your-expenses-money-2856048-2026-01-22",
      "headline": "Rupee slide is getting worse. Here is how it hits your walletThe rupee's fall may look like a market story, but its ripple effects travel much further. What happens next could shape prices, travel costs and your monthly budget."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-agri-industry-seeks-stronger-push-for-sustainability-nutrition-and-rd-2856042-2026-01-22",
      "headline": "Budget 2026: Agri industry seeks stronger push for sustainability, nutrition and R&DAs India gears up for Union Budget 2026, voices from the agriculture sector are calling for policies that go beyond short-term gains and focus on sustainable farming, food security, better nutrition and stronger support for research and development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-rally-vs-stocks-2026-investment-outlook-portfolio-allocation-personal-finance-2856006-2026-01-22",
      "headline": "Gold and silver keep soaring to record highs, but is it a boom or a bubble?In 2025, gold delivered its strongest annual gains in nearly 50 years, while silver posted its best returns ever. That strength carried into 2026, with silver crossing the Rs 3,00,000 per kg mark in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/global-company-ceos-india-expansion-plan-despite-tariff-uncertainty-pwc-survey-2855998-2026-01-22",
      "headline": "Tariffs or no tariffs, here's why global CEOs are betting big on IndiaIndia's rise in CEO rankings reflects a simple reality. Global companies want growth, scale and stability, and the numbers show India is delivering more of it than most major markets right now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-rebound-is-the-worst-over-after-trump-greenland-tariff-chaos-2855971-2026-01-22",
      "headline": "Sensex, Nifty rebound as global cues improve: Is the worst finally over?The rebound in Sensex and Nifty may not guarantee stability, but Thursday's sharp turnaround shows the benchmarks are finally finding their footing after weeks of relentless selling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-rising-today-sensex-jumps-nifty-rally-nse-bse-up-trump-greendland-global-trade-cues-2855961-2026-01-22",
      "headline": "Sensex jumps over 700 points: Why is the stock market rising todayAs of 9:46 am, the S&P BSE Sensex was up 785.92 points at 82,695.55. The NSE Nifty50 climbed 251.60 points to 25,409.10. The strong opening showed that investors were willing to take fresh positions after recent uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-550-points-nifty-above-25300-eternal-up-6-percent-2855957-2026-01-22",
      "headline": "Sensex, Nifty rally over positive global cues, hopes of India-US trade dealThe S&P BSE Sensex jumped 760.64 points to 82,670.27, while the NSE Nifty added 246.10 points to 25,403.60 as of 9:40 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-trade-setup-higher-trump-greenland-deal-eu-india-fta-2855940-2026-01-22",
      "headline": "Sensex, Nifty today: Stock market likely to open higher. Here's whyGIFT Nifty futures were trading at 25,338 at around 8:09 AM. This points to a positive opening for the Nifty 50, which closed at 25,157.50 on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/movie-isnt-over-gita-gopinath-on-trump-tariffs-and-carneys-speech-2855847-2026-01-21",
      "headline": "Movie isn't over: Gita Gopinath on Trump tariffs and Carney's speechGita Gopinath, Indian-American economist and Professor of Economics at Harvard University, shares her insights on Canadian Prime Minister Mark Carney's remarks on shifting global economic order during the World Economic Forum in Davos and dealing with tariffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pollution-a-bigger-economic-threat-than-tariffs-for-india-says-gita-gopinath-world-economic-forum-davos-2855620-2026-01-21",
      "headline": "Pollution a bigger economic threat than tariffs for India, says Gita GopinathGopinath said discussions about new business development often focus on trade, tariffs and regulations, but pollution is rarely given the importance it deserves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/wef-roundtable-can-india-become-the-third-largest-economy-experts-weigh-in-2855821-2026-01-21",
      "headline": "WEF Roundtable: Can India become the third-largest economy? Experts weigh inAt World Economic Forum (WEF) Roundtable in Davos, India Today Group Vice-Chairperson and Executive Editor-in-Chief Kalli Purie moderated a session on India's growth story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-trusted-value-chain-partner-ashwini-vaishnaw-davos-wef-2026-2855582-2026-01-21",
      "headline": "India has emerged as trusted value chain partner to the world: Ashwini VaishnawUnion Minister Ashwini Vaishnaw said the biggest change over the last decade has been how the world views India's role in global manufacturing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-world-third-largest-economy-world-economic-forum-davos-session-2855697-2026-01-21",
      "headline": "Can India become the world's third-largest economy?At Davos, a session moderated by India Today Group Vice-Chairperson and Executive Editor-in-Chief Kalli Purie brought together leading economist Gita Gopinath, Union Minister Ashwini Vaishnaw, Bharti Chairman Sunil Bharti Mittal, and IKEA Group CEO Juvencio Maeztu Herrera to decode India's journey towards becoming the world's third-largest economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/markets-will-fall-and-bounce-back-says-gita-gopinath-on-uncertain-global-outlook-world-economic-forum-wef-in-davos-2855762-2026-01-21",
      "headline": "Markets will fall and bounce back, says Gita Gopinath on uncertain global outlookGopinath said she had earlier believed the world had passed the peak of tariff tensions by 2025. However, developments at the start of 2026, including tensions over Greenland and a visible rupture between the US and the European Union, changed that view."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/autumn-davos-india-business-summit-ashwini-vaishnaw-wef-2855597-2026-01-21",
      "headline": "An Autumn Davos in India? Ashwini Vaishnaw flags new idea at WEFUnderscoring the growing global recognition of India's economic reforms and investment momentum, Union Minister Ashwini Vaishnaw pitched for an 'Autumn Davos' at the World Economic Forum (WEF)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-nifty-extend-losses-rupee-hits-record-low-foreign-selling-global-trade-worries-2855590-2026-01-21",
      "headline": "Sensex, Nifty extend losses a day after sharp sell-off; rupee hits record lowThe Nifty 50 closed 0.3% lower at 25,157.5, while the BSE Sensex slipped 0.33% to settle at 81,909.63. Both indices touched fresh three-month lows during the day. In the previous session, the Nifty had fallen 1.4% and the Sensex had dropped 1.3%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomatos-deepinder-goyal-to-quit-as-eternal-ceo-blinkit-ceo-albinder-singh-dhindsa-to-take-charge-2855580-2026-01-21",
      "headline": "Zomato's Deepinder Goyal steps down as Eternal CEO, Albinder Dhindsa to take overThe online delivery firm, which runs food delivery platform Zomato and quick commerce arm Blinkit, reported a sequential increase in profit for the third quarter, driven by strong demand for quick-delivery services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-ai-push-puts-it-on-path-to-global-tech-powerhouse-says-ashwini-vaishnaw-world-economic-forum-davos-2855515-2026-01-21",
      "headline": "India's AI push puts it on path to global tech powerhouse, says Ashwini VaishnawThe Union Minister said AI is now being used almost everywhere, making it essential for countries to build capabilities across all layers of the technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/eu-india-trade-deal-news-why-european-union-free-trade-agreement-mother-of-all-deals-jolt-us-president-donald-trump-2855430-2026-01-21",
      "headline": "Why EU-India FTA will be Mother of All Deals, and Trump deserves a thanksAfter almost two decades of work and negotiations, the India-EU Free Trade Agreement (FTA) is the closest it has ever been to fruition. The deal would not only benefit both sides enormously, but also come as a rude awakening for US President Donald Trump."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-muntashir-rejects-ar-rahman-claims-biggest-stars-are-salman-khan-srk-2856053-2026-01-22",
      "headline": "Biggest stars are Salman Khan, SRK: Manoj Muntashir rejects AR Rahman's claims Lyricist Manoj Muntashir contradicted composer AR Rahman's recent remarks on discrimination and communal politics in Bollywood. He underscored the industry's ongoing record of inclusivity and pointed to recent box office hits as supporting evidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-censor-row-why-vijay-farewell-film-needs-early-february-release-2856038-2026-01-22",
      "headline": "Vijay's Jana Nayagan misses Republic Day week, makers now eye February release Jana Nayagan's theatrical release is delayed due to a pending legal dispute with the CBFC. The film's makers now aim for a February release to avoid election-related screening restrictions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/border-2-buzz-rashid-khan-kl-rahul-bollywood-trend-republic-day-release-2855968-2026-01-22",
      "headline": "Afghan cricketer Rashid Khan vows to watch Border 2, Varun Dhawan reacts Afghanistan cricket captain Rashid Khan shared a social media reel expressing excitement for the upcoming film Border 2, sparking reactions from the film's cast members Varun Dhawan and Ahan Shetty, besides Suniel Shetty from the original film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hiraan-chatterjee-second-marriage-controversy-bjp-mla-west-bengal-2855992-2026-01-22",
      "headline": "Bengali actor Hiraan Chatterjee's second wedding sparks row. All you need to know Actor-turned-BJP MLA Hiraan Chatterjee's alleged second marriage has caused an uproar. The conflicting claims from his first wife Anindita Chatterjee and his alleged second wife Ritika Giri have intensified social and legal debates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malavika-mohanan-online-backlash-tamil-telugu-actresses-acting-comments-2855987-2026-01-22",
      "headline": "What did Malavika Mohanan say about Tamil, Telugu actors to attract flak? Malavika Mohanan was criticised for her remarks on the acting abilities of some female actors in the Tamil and Telugu film industries. She claimed that they have stock expressions and do not bother looking at their lines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khan-can-do-better-thinks-farida-jalal-the-bads-of-bollywood-was-okay-2855995-2026-01-22",
      "headline": "Aryan Khan can do better, thinks Farida Jalal: The Ba***ds of Bollywood was okay Veteran actor Farida Jalal offered her perspective on Aryan Khan's debut web series, The Ba***s of Bollywood. She talked about Khan's potential to do a better job at work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-eats-dosa-singapore-festival-priyanka-chopra-bipasha-basu-viral-song-2855974-2026-01-22",
      "headline": "Jiju, yaar. You won't believe which Hindi song Nick Jonas is vibing to over dosa Nick Jonas shared a video of himself having an Indian breakfast and vibing to Priyanka Chopra's viral banger at Art Week 2026 in Singapore. The adorable clip drew praise from fans for embracing Indian culture so vibrantly. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/inside-hollywood-most-bitter-explosive-publicly-unfolding-family-feuds-brooklyn-beckham-victoria-beckham-2855716-2026-01-22",
      "headline": "As Beckhams feud, check out the most famous celeb family fights played out online The Beckhams are only the latest in line. Here are some celebrity family feuds of the past that were fought in public and that could outdo the best-rated drama series in entertainment quotient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/elle-reese-witherspoons-legally-blonde-prequel-to-release-in-july-2855956-2026-01-22",
      "headline": "Elle: Reese Witherspoon's Legally Blonde prequel to release in July The new series based on the Legally Blonde franchise, titled Elle, will premiere in July on Prime Video. Amazon has also renewed the show for a second season ahead of its debut, and production is set to begin this spring."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-moves-in-with-gauri-spratt-in-mumbai-new-relationship-2855950-2026-01-22",
      "headline": "Already married in my heart: Aamir Khan on moving in with girlfriend Gauri Spratt Aamir Khan and Gauri Spratt, who have been in a relationship for some time, have reportedly moved into a new home in Mumbai. Khan recently opened up about their relationship and said how he is already married to Gauri in his heart. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/success-streak-of-anil-ravipudi-what-connects-his-films-with-audiences-2855855-2026-01-22",
      "headline": "One Telugu director, 9 consecutive hits: Tracing success formula of Anil Ravipudi With a decade-long hit streak and a clear understanding of family audiences, Anil Ravipudi continues to succeed by prioritising entertainment over online noise.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/cruz-beckham-likes-meme-mocking-victorias-sensational-dance-at-brooklyns-wedding-2855952-2026-01-22",
      "headline": "Cruz Beckham likes meme on Victoria's 'inappropriate dance' at Brooklyn's wedding Cruz Beckham has drawn attention by liking a meme on social media that pokes fun at Victoria Beckham's dance moves at Brooklyn Beckham's 2022 wedding. The post comes just days after Brooklyn publicly criticised his mother, intensifying the ongoing family feud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sony-executives-call-blake-lively-terrorist-slam-haircare-launch-amid-legal-row-2855938-2026-01-22",
      "headline": "Sony executives call Blake Lively terrorist, slam haircare launch amid legal row Sony Pictures privately criticised Blake Lively during the It Ends With Us controversy, with internal emails showing executives questioning her future in Hollywood. The dispute has since moved to court, with claims of financial losses set to be examined at the May 18 trial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vishal-bhardwaj-shahid-kapoor-address-rumours-highlight-strong-cinematic-partnership-2855933-2026-01-22",
      "headline": "Vishal Bhardwaj addresses Shahid rift rumours: I'm a difficult person to work with Director Vishal Bhardwaj has responded to longstanding rumours regarding a fallout with actor Shahid Kapoor, clarifying their professional relationship during the trailer launch of his upcoming film 'O'Romeo'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/blake-lively-taylor-swift-friendship-rift-unsealed-court-texts-2024-2855925-2026-01-22",
      "headline": "Taylor Swift, Blake Lively's private texts expose friendship rift in Baldoni lawsuit Newly revealed private messages showed Taylor Swift and Blake Lively openly discussing changes in their friendship during the production of It Ends with Us and amid director Justin Baldoni's ongoing legal dispute with Lively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/masters-of-the-universe-teaser-trailer-nicholas-galitzine-travis-knight-2855919-2026-01-22",
      "headline": "Masters of the Universe teaser: Nicholas Galitzine thrills fans with 80s nostalgia Amazon and MGM Studios have unveiled the first teaser for their upcoming live-action 'Masters of the Universe' film, aiming to evoke nostalgia among Generation X with familiar visuals and cast announcements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/censor-poser-why-dhurandhar-2-teaser-needed-certification-but-toxic-did-not-2855591-2026-01-22",
      "headline": "Censor poser: Why Dhurandhar 2 teaser needed certification but Toxic did not Ranveer Singh's Dhurandhar 2 teaser was censored with an A certificate for theatrical screening, while Yash's Toxic teaser on YouTube was not. This brings back the old debate over the differing rules for cinema and digital platforms, and the effectiveness of censorship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zayn-malik-opens-las-vegas-residency-new-unreleased-songs-emotional-performances-2855901-2026-01-22",
      "headline": "Zayn Malik performs unreleased songs at Las Vegas residency, hints at new record Zayn Malik launched his seven-show Las Vegas residency on January 20 at Dolby Live at Park MGM, marking his first solo tour in the city. The singer performed a mix of hits, rare tracks, and four unreleased songs while recovering from illness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/astroworld-tragedy-impact-travis-scott-efforts-help-houston-heal-2855898-2026-01-22",
      "headline": "Travis Scott addresses Astroworld tragedy, shares efforts to aid Houston's recovery In a recent interview, Travis Scott discussed his hopes to support healing in Houston following the 2021 Astroworld Festival tragedy. The rapper emphasised the personal and professional effects of the event and clarified his perspective."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/hindus-and-muslims-can-offer-prayers-on-friday-in-madhya-pradeshs-disputed-bhojshala-supreme-court-rules-2856063-2026-01-22",
      "headline": "Hindus, Muslims can offer Friday prayers at disputed Bhojshala: Supreme CourtThe Supreme Court allowed both Hindu and Muslim devotees to offer prayers at the Bhojshala complex in Dhar on January 23, directing separate timings, spaces, and entry-exit arrangements. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-mayor-post-goes-to-general-woman-category-in-lottery-pick-uproar-as-uddhav-sena-objects-to-draw-2856068-2026-01-22",
      "headline": "Mumbai set to get woman mayor, Uddhav Sena objects, walks out amid lottery pickAs per the reservation, the mayoral posts in Pune, Dhule, Brihanmumbai Municipal Corporation (BMC), Nanded, Navi Mumbai, Malegaon, Mira Bhayandar, Nashik and Nagpur have been reserved for women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-governor-thaawarchand-gehlot-govt-drafted-speech-g-ram-g-law-mention-walks-out-of-assembly-2856011-2026-01-22",
      "headline": "Now, Karnataka Governor walks out of assembly after refusing to read govt speechKarnataka Governor Thaawarchand Gehlot walked out of the Assembly during the Budget session after refusing to read portions of the government's address that referred to the G Ram G law and MGNREGA overhaul, citing them as government propaganda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/korean-tourist-molested-bengaluru-airport-staff-ordeal-what-happened-2855994-2026-01-22",
      "headline": "Took me to men's toilet: Korean woman molested by airport staff details ordealThe South Korean tourist, in an exclusive interview with India Today, narrated her ordeal at Bengaluru's Kempegowda International Airport. The airport staffer has now been arrested."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/davos-wef-mark-carney-canada-middle-power-ambitions-us-hegemony-donald-trump-nato-non-aligned-movement-2855803-2026-01-22",
      "headline": "As Carney points a finger at Trump, four fingers pointing back at CanadaAt Davos, Canadian PM Mark Carney was right in saying the old order is broken. But Canada cannot pretend it was merely a bystander to the making of American hegemony. Having prospered as the US's closest ally for decades, Ottawa now wants to lead a middle-power bloc. Isn't that off the Mark?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/when-layoffs-hit-the-40s-professionals-tell-their-job-loss-stories-2855706-2026-01-21",
      "headline": "When layoffs hit the 40s: Professionals tell their job-loss storiesCorporate professionals in their 40s are increasingly speaking out about how layoffs, age bias, AI-led restructuring, and aggressive cost-cutting are reshaping mid-career job security in India, turning what was once considered the most stable phase of a career into a period marked by uncertainty, stalled growth, and sudden exits despite decades of experience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/moradabad-uttar-pradesh-interfaith-hindu-woman-muslim-man-murdered-found-dead-forest-brothers-conspiracy-honour-killing-2856025-2026-01-22",
      "headline": "Brothers murder sister, her Muslim boyfriend in dishonour killing in UPAn interfaith couple, involving a 19-year-old Hindu woman and her 27-year-old Muslim boyfriend, were found dead in a forest in Uttar Pradesh's Moradabad on Thursday. Police said that, as per preliminary investigations, the three brothers of the woman killed the couple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/sanjeev-khirwar-new-delhi-mcd-commissioner-returns-ladakh-transferred-walk-dog-emptied-thyagraj-stadium-2022-row-2855939-2026-01-22",
      "headline": "IAS officer, who emptied Delhi stadium to walk his dog, is new MCD commissionerSanjeev Khirwar, a 1994-batch IAS officer, was transferred to Ladakh in 2022 after causing a massive row by allegedly emptying Delhi's Thyagraj Stadium to walk his dog."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/greenland-us-donald-trump-denmark-north-america-plate-tectonic-geology-2856023-2026-01-22",
      "headline": "Greenland is heading towards America. Yes, you read that rightThe White House, led by Donald Trump, has ramped up efforts to pressure Denmark into seceding Greenland to the US. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manipur-ethnic-violence-meitei-civilian-kidnapped-shot-dead-churachandpur-kuki-2855959-2026-01-22",
      "headline": "Manipur man kidnapped, shot dead by armed men; chilling murder video goes viralA 38-year-old Meitei man was allegedly abducted by armed men in violence-hit Manipur's Churachandpur district and later shot dead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/men-vandalise-agra-hotel-room-proudly-record-and-flaunt-damage-on-camera-boast-viral-video-2856013-2026-01-22",
      "headline": "Men vandalise Agra hotel room, proudly record and flaunt damage on cameraThe video, shot inside the Agra hotel room, shows the men openly mocking the accommodation while proudly exhibiting acts of vandalism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/visuals/time-tide-tamil-vaishnavism-the-ultimate-synthesis-and-poetic-peak-part-16-339-21-01-2026",
      "headline": "Time, Tide & Tamil Part 16 | Vaishnavism: The Ultimate Synthesis & Poetic PeakIf the Saivite revival was the fierce, indigenous gust that broke the cold austerity of Jain-Buddhist asceticism, the Vaishnavite tradition was the gentle, yet profound force that perfected the shift. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-man-alleges-racism-in-thailand-club-after-being-denied-entry-management-responds-2855997-2026-01-22",
      "headline": "Indian man alleges racism in Thailand club after being denied entry. Management respondsAn Indian man alleged racial discrimination after being denied entry to Yona Beach Club in Thailand despite having valid tickets. The management responded to his post as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-gaza-peace-board-pakistan-accept-invitation-blacklash-israel-war-shehbaz-sharif-2855960-2026-01-22",
      "headline": "To stay in Trump's good books? Pak faces fire at home over Gaza peace board entryPakistan's entry into President Donald Trump's Gaza Peace Board has triggered domestic criticism, with opposition leaders warning the initiative sidelines Palestinian self-rule and risks weakening the United Nations' role globally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-1st-t20i-batting-approach-shubman-gill-abhishek-sharma-rinku-singh-nagpur-2855990-2026-01-22",
      "headline": "No Gill, all thrill: India's hyper aggression returns right before T20 World CupIND vs NZ, 1st T20I: India showcased fearless, aggressive batting to pile up 238 against New Zealand in the T20I series opener in Nagpur. With Shubman Gill out of the side, India returned to their belligerent best, each batter playing without fear of failure, while Rinku Singh provided the cushion in the lower middle order."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/kempegowda-airport-sexual-harassment-case-korean-traveler-alleges-misconduct-2855943-2026-01-22",
      "headline": "Bengaluru airport staff molests Korean tourist on pretext of checking bagThe incident allegedly occurred on January 19, after the woman had completed immigration formalities and was approached by the accused, identified as Afan Ahmed, who claimed he needed to conduct a baggage inspection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/anant-ambani-vantara-jacob-and-co-watch-luxury-collection-2856036-2026-01-22",
      "headline": "The million-dollar Vantara-inspired watch made for Anant AmbaniAnant Ambani is known to be a custodian of luxury, limited-edition watches. And now, one brand has decided to give his venture, Vantara, an ode in the most horological way ever. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-air-force-microlite-aircraft-crash-lands-prayagraj-pilots-rescued-uttar-pradesh-2855927-2026-01-22",
      "headline": "Video: Locals swoop in to rescue IAF pilots after plane crashed in PrayagrajIt was a close shave for two Indian Air Force (IAF) pilots after their microlight aircraft crash-landed in Prayagraj following a technical malfunction on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-ind-vz-nz-shashi-tharoor-x-tweet-2855879-2026-01-22",
      "headline": "Gambhir reacts to Tharoor's PM Modi post, says pitted against his own teamIND vs NZ: India head coach Gautam Gambhir found himself in the spotlight after Shashi Tharoor publicly lauded his role ahead of the New Zealand series. Gambhir's sharp response on X has triggered a massive debate on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/cruz-beckham-likes-meme-mocking-victorias-sensational-dance-at-brooklyns-wedding-2855952-2026-01-22",
      "headline": "Cruz Beckham likes meme on Victoria's 'inappropriate dance' at Brooklyn's weddingCruz Beckham has drawn attention by liking a meme on social media that pokes fun at Victoria Beckham's dance moves at Brooklyn Beckham's 2022 wedding. The post comes just days after Brooklyn publicly criticised his mother, intensifying the ongoing family feud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/is-luxury-nannying-the-new-gen-z-career-move-2855458-2026-01-22",
      "headline": "Is luxury nannying the new Gen Z career move?Moving away from traditional jobs, Gen Z is choosing a new career path, luxury nannying, which is said to offer more benefits than many corporate roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-eats-dosa-singapore-festival-priyanka-chopra-bipasha-basu-viral-song-2855974-2026-01-22",
      "headline": "Jiju, yaar. You won't believe which Hindi song Nick Jonas is vibing to over dosaNick Jonas shared a video of himself having an Indian breakfast and vibing to Priyanka Chopra's viral banger at Art Week 2026 in Singapore. The adorable clip drew praise from fans for embracing Indian culture so vibrantly. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-to-turn-siri-into-a-full-fledged-ai-chatbot-later-this-year-2855970-2026-01-22",
      "headline": "After years of saying no, Apple is turning Siri into an AI chatbotApple is set to turn Siri into a conversational AI later this year, bringing chatbot-style interactions to iPhones, iPads and Macs. Here is everything you need to know."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/jaipur/story/hit-and-run-jaipur-express-highway-anaya-sharma-air-force-aspirant-2855902-2026-01-22",
      "headline": "Air Force aspirant mowed down by speeding Thar in Jaipur, driver fleesThe victim was identified as Anaya Sharma, a Jhunjhunu resident who had recently been selected for the Air Force and was in Jaipur to prepare for her physical examination."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pcb-promo-australia-tour-dig-at-india-controversy-2856060-2026-01-22",
      "headline": "Pakistan take dig at India, new series promo asks 'handshake bhool gaye?' The Pakistan Cricket Board's new promo for the Australia tour has sparked controversy as many interpret it as taking a dig at India and their no handshake policy. Indian teams have refused to shake hands with their Pakistan counterparts in major tournaments following the Pahalgam attacks last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pv-sindhu-lakshya-sen-indonesia-masters-quarterfinals-2026-2856047-2026-01-22",
      "headline": "PV Sindhu becomes first Indian to complete 500 match wins, storms into quarters Indonesia Masters 2026: PV Sindhu became only the sixth women's singles player to complete 500 match wins in her career. The Indian shuttler defeated familiar foe Line Hojmark Kjaerfeldt of Denmark to storm into the quarterfinal of the Super 500 tournament at the iconic Istora in Jakarta. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-novak-djokovic-melbourne-fig-tree-ritual-win-vs-francesco-maestrelli-2856057-2026-01-22",
      "headline": "Djokovic opens up on nostalgic Melbourne fig tree ritual after Australia Open win Novak Djokovic revealed his long-held fig tree ritual in Melbourne after beating Francesco Maestrelli at the Australian Open. The Serbian said the tradition grounds him mentally as he chases history in Melbourne Park this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-exits-big-bash-league-early-for-pakistan-t20-world-cup-2856022-2026-01-22",
      "headline": "Babar Azam's Big Bash League misery ends as Pakistan batter called home BBL 16: Pakistan batter Babar Azam ended his stint in the Big Bash League before Sydney Sixers' crucial knocked out match against Hobart Hurricanes. Babar is expected to join the senior national team as it prepares for the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-big-bash-league-sydney-sixers-chapter-ruled-out-knockouts-final-2856014-2026-01-22",
      "headline": "Babar Azam's stint at Big Bash League: Selling the dream, delivering the dots The hype arrived early, but the sixes did not. Babar Azam's Big Bash stint became a masterclass in how modern T20 cricket has moved on without him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-1st-t20i-batting-approach-shubman-gill-abhishek-sharma-rinku-singh-nagpur-2855990-2026-01-22",
      "headline": "No Gill, all thrill: India's hyper aggression returns right before T20 World Cup IND vs NZ, 1st T20I: India showcased fearless, aggressive batting to pile up 238 against New Zealand in the T20I series opener in Nagpur. With Shubman Gill out of the side, India returned to their belligerent best, each batter playing without fear of failure, while Rinku Singh provided the cushion in the lower middle order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-rcb-ipl-2025-win-reaction-viral-video-fans-support-csk-rivalry-watch-2855973-2026-01-22",
      "headline": "Watch: MS Dhoni finally reacts to RCB's IPL 2025 title, leaves fans in splits MS Dhoni acknowledged Royal Challengers Bengaluru's maiden IPL title with a straightforward, honest response. The CSK legend congratulated RCB and their fans while admitting that, as a competitor, he always wants his own team to win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rinku-singh-underused-simon-doull-100-t20is-world-cup-2855958-2026-01-22",
      "headline": "Rinku Singh underused by India, should have played 100 T20Is by now: Simon Doull IND vs NZ, 1st T20I: Rinku Singh's unbeaten 44 helped India crush New Zealand by 48 runs in Nagpur, prompting Simon Doull to call him one of the best finishers India has underutilized."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-royal-challengers-bengaluru-unbeanten-run-bold-moves-decoding-2855951-2026-01-22",
      "headline": "Decoding RCB's bold moves: Turning weakness into winning weapons in WPL 2026 WPL 2026: RCB have won five matches on the trot and sit atop the points table. With a playoff spot already secured, their focus now shifts to holding on to the top position and booking a direct berth in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-fc-barcelona-liverpool-bayern-munich-round-of-16-race-2855926-2026-01-22",
      "headline": "Barcelona, Bayern and Liverpool return to form as UCL RO16 race tightens Europe's heavyweights responded as the Champions League playoff race intensified, with Barcelona, Bayern Munich and Liverpool returning to winning ways. Crucial victories reshaped the qualification picture as margins tightened across the league phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-arshdeep-singh-playing-xi-pressure-be-ready-all-the-time-t20-world-cup-harshit-rana-2855905-2026-01-22",
      "headline": "IND vs NZ: Arshdeep Singh unfazed by Playing XI pressure, enjoying one game at a time Arshdeep Singh played down any Playing XI pressure after India's dominant Nagpur win, insisting his focus remains on enjoying the game and being ready whenever called upon. The left-arm pacer reiterated that selection decisions are beyond his control as India build towards the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-live-updates-day-5-novak-djokovic-jannik-sinner-iga-swiatek-2855866-2026-01-22",
      "headline": "AUS Open Day 5 live: Swiatek makes strong start, Djokovic cruises into Round 3Australian Open 2026 Live: Novak Djokovic stamped his authority on Day 5, powering through the opening set 6–3 against Francesco Maestrelli at Rod Laver Arena. Jannik Sinner and Iga Swiatek will also take the court later on this star-studded schedule.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-ind-vz-nz-shashi-tharoor-x-tweet-2855879-2026-01-22",
      "headline": "Gambhir reacts to Tharoor's PM Modi post, says pitted against his own teamIND vs NZ: India head coach Gautam Gambhir found himself in the spotlight after Shashi Tharoor publicly lauded his role ahead of the New Zealand series. Gambhir's sharp response on X has triggered a massive debate on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-abhishek-sharma-batting-2855878-2026-01-22",
      "headline": "Abhishek Sharma jokes after Nagpur carnage: I don't have a lot of shotsIND vs NZ: India opener Abhishek Sharma joked at the end of the 1st T20I that he did not have enough shots in his arsenal. Sharma said that he only had a few, and he tried to execute them well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20-world-cup-icc-india-2855865-2026-01-22",
      "headline": "Bangladesh to decide on T20 World Cup participation after meeting cricketersThe Bangladesh government will take a call on T20 World Cup participation in a cabinet meeting on Thursday, January 22. The sports advisor will also meet the cricketers and take their opinion on participation in the World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-1st-t20i-abhishek-sharma-glenn-phillips-nagpur-report-2855827-2026-01-21",
      "headline": "India crush New Zealand in Nagpur, begin final T20 World Cup preps in styleIND vs NZ, 1st T20I: Suryakumar Yadav's India took a 1-0 lead in the five-match series after hammering New Zealand by 48 runs at the VCA Stadium in Nagpur. Abhishek Sharma was the star performer for the hosts with 84 runs off 35 balls. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-third-fastest-indian-9000-t20-runs-new-zealand-2855808-2026-01-21",
      "headline": "Suryakumar Yadav shows signs of form, becomes 3rd fastest Indian to 9000 T20 runsIND vs NZ, 1st T20I: Suryakumar Yadav showed signs of returning to form, becoming the third-fastest Indian to 9,000 T20 runs with a fluent 32 off 22 balls against New Zealand on Wednesday in Nagpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-84-completes-5000-t20-runs-india-vs-new-zealand-nagpur-2855801-2026-01-21",
      "headline": "Abhishek Sharma dazzles Nagpur with 35-ball 84, completes 5000 T20 runsStar India opener Abhishek Sharma lit up Nagpur with a blazing 35-ball 84 in the first T20I against New Zealand on Wednesday and became the fourth-fastest Indian batter to cross 5000 runs in T20 cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/woman-pleads-rohit-sharma-security-breach-daughters-costly-treatment-2855787-2026-01-21",
      "headline": "Didn't stop Rohit Sharma for selfie: Woman explains shocking security breach in IndoreA woman breached security at the Indian team hotel in Indore on Sunday in an attempt to meet Rohit Sharma following India's ODI series against New Zealand. She later revealed that her actions were driven by a desperate effort to draw the Indian cricketer's attention and seek help for her ailing daughter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shashi-tharoor-praises-gautam-gambhir-india-cricket-coach-scrutiny-nz-t20i-series-2855759-2026-01-21",
      "headline": "Gambhir has hardest job after PM Modi, says Shashi Tharoor after meeting coachSenior Congress MP Shashi Tharoor on Wednesday met Indian men's cricket team head coach Gautam Gambhir, hailing him as \"the man with the hardest job in India after the Prime Minister.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2026-day-5-djokovic-sinner-swiatek-schedule-2855752-2026-01-21",
      "headline": "Day 5 Order of Play: Djokovic, Sinner, Swiatek aim for Round 3 berthsDay 5 of the Australian Open 2026 features Novak Djokovic, Jannik Sinner and Iga Swiatek headlining a blockbuster schedule as they aim to book their spots in the third round across Melbourne Park."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-need-to-decide-chinnaswamy-stadium-return-ipl-2026-venkatesh-prasad-2855757-2026-01-21",
      "headline": "RCB need to decide on returning to Chinnaswamy stadium for IPL 2026: Venkatesh PrasadKSCA president Venkatesh Prasad says the ball is now in RCB's court on returning to Chinnaswamy for IPL 2026, assuring the stadium will be completely safe and ready after major upgrades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-1st-t20i-playing-11-no-kuldeep-yadav-ishan-kishan-returns-after-two-years-2855745-2026-01-21",
      "headline": "IND vs NZ, 1st T20I: No Kuldeep Yadav, Ishan Kishan returns after over two yearsIND vs NZ, 1st T20I Playing XIs: New Zealand opted to bowl after winning the toss in the first T20I against India, handing Kristian Clarke a debut, while India recalled Ishan Kishan and left out Kuldeep Yadav and Shreyas Iyer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-statement-t20-world-cup-bangladesh-security-threat-india-2855744-2026-01-21",
      "headline": "ICC says no credible threat to safety of Bangladesh team in IndiaT20 World Cup 2026: The International Cricket Council on Wednesday dismissed Bangladesh's concerns over security in India, saying it's not feasible to change the venues in the eleventh hour. Bangladesh have remained adamant about not playing in India with all four of their league games scheduled across two cities in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-waugh-maxwell-support-odi-cricket-european-t20-premier-league-2855717-2026-01-21",
      "headline": "Waugh, Maxwell open up on ODI cricket's future: Would hate to see it disappearSteve Waugh and Glenn Maxwell have expressed concerns over the future of ODI cricket amid the rapid growth of T20 leagues. Both Waugh and Maxwell are part of the inaugural European T20 Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sydney-sixers-mark-waugh-suggests-dropping-babar-azam-bbl-2855701-2026-01-21",
      "headline": "Drop Babar Azam if you want to win BBL: Mark Waugh urges Sydney Sixers for tough loveFormer Australian all-rounder Mark Waugh has urged the Sydney Sixers to drop Babar Azam and reshuffle their batting to boost their title chances in the Big Bash League 2025-26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-opens-up-tough-calls-india-captain-shreyas-iyer-yuzvendra-chahal-2855696-2026-01-21",
      "headline": "Rohit Sharma opens up on tough calls he took as India captain: Can't please everyoneRohit Sharma has opened up on the hardest decisions of his captaincy, from leaving out Shreyas Iyer in 2022 to managing difficult conversations with senior players, explaining why leadership in Indian cricket means accepting that you cannot please everyone."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-bangladesh-t20-world-cup-request-india-bcb-controversy-2855682-2026-01-21",
      "headline": "ICC votes to replace Bangladesh with Scotland if it doesn't play in IndiaT20 World Cup: The ICC has told the Bangladesh Cricket Board (BCB) to inform the Bangladesh government that if the team continues to refuse to travel to India for the 2026 T20 World Cup, it will be replaced by another side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pooja-vastrakar-returns-rcb-wpl-2026-playoffs-boost-2855632-2026-01-21",
      "headline": "RCB get huge boost as star all-rounder joins squad before WPL 2026 playoffsRoyal Challengers Bengaluru have received a timely boost ahead of the WPL 2026 playoffs with the return of all-rounder Pooja Vastrakar, adding depth and experience to their squad.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}