{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trumps-25-auto-tariff-which-indian-companies-will-pay-the-price-glbs-2700039-2025-03-27",
      "headline": "Trump's 25% auto tariff: Which Indian companies will pay the priceUS President Donald Trump's 25% tariff on car imports will affect a few Indian companies, including Tata Motors, Eicher Motors, and Samvardhana Motherson. These firms ship components to the US and Europe's markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-close-higher-top-gainers-and-losers-donald-trump-tariff-impact-and-more-2700007-2025-03-27",
      "headline": "Sensex, Nifty close higher: Top gainers and losers, tariff impact and key driversStock market today: Some of the top gainers during today's session were Bajaj Finserv, IndusInd Bank, NTPC, L&T, Ultratech Cement, Hero MotoCorp, Adani Enterprises and BPCL. On the other hand, some of the top losers were Tata Motors, Sun Pharma, Eicher Motors, Apollo Hospitals, Bharti Airtel, Kotak Mahindra Bank and HCLTech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-318-points-higher-nifty-just-below-23600-tata-motors-down-5-2699968-2025-03-27",
      "headline": "Sensex ends 318 points higher, Nifty just below 23,600; Tata Motors down 5%Stock market closing bell: The S&P BSE Sensex ended 317.93 points higher at 77,606.43, while the NSE Nifty50 rose 105.10 points to settle at 23,591.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noida-greater-noida-flats-to-get-costlier-registration-fees-increase-20-30-percent-2699948-2025-03-27",
      "headline": "Noida, Greater Noida flat registration fees may rise 20-30%According to a draft notification, circle rates in Noida could see a 20% hike, while in Greater Noida, the increase may go up to 30%. The move is expected to make property transactions more expensive in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-may-receive-reprieve-from-proposed-us-tariffs-sources-2699915-2025-03-27",
      "headline": "India may receive reprieve from proposed US tariffs: SourcesIndia may escape the proposed US tariffs and avoid being grouped with nations like China, Mexico, and Canada, according to government sources. Trade talks between the two countries are progressing smoothly, with no signs of a deadlock as the April 2 deadline for US reciprocal tariffs approaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-may-double-investment-limit-to-10-percent-for-foreign-individual-investors-2699886-2025-03-27",
      "headline": "RBI may double foreign individual investor limit to 10% in listed firms: ReportForeign portfolio investors (FPIs), pressured by poor earnings, high valuations and prospects of U.S. tariffs, have pulled more than $28 billion out of Indian stocks since September's record high in the benchmark NSE Nifty 50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-2025-elon-musk-is-worlds-richest-person-jeff-bezos-and-mark-zuckerberg-among-top-10-billionaires-2699860-2025-03-27",
      "headline": "Elon Musk leads Hurun Global Rich List despite $100 billion drop in net worthElon Musk has reretained his position as the wealthiest person in the world for the fourth time in five years, becoming the first individual to surpass the $400 billion threshold, noted the Hurun Research report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-united-states-reciprocal-tariff-talks-eyes-big-relief-may-not-be-clubbed-china-mexico-canada-sectors-2699822-2025-03-27",
      "headline": "US tariff reprieve for India, may not be treated like China, Canada, Mexico: SourcesTrade talks between the two nations are progressing smoothly, with no deadlock expected before the April 2 deadline for US reciprocal tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-terminates-30-45-more-trainees-from-mysuru-campus-offers-alternative-career-options-2699797-2025-03-27",
      "headline": "Infosys terminates more trainees from Mysuru campus, but offers…: ReportInfosys has terminated more trainees from its Myrusu campus. The IT giant had terminated hundreds of trainees from the same campus just two months ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-down-falls-6-percent-why-is-stock-falling-trump-tarriff-us-car-imports-2699787-2025-03-27",
      "headline": "Tata Motors shares slump as US slaps 25% duty on car importsTata Motors stock price: Tata Motors shares slumped 6% in early trade and were trading 5.26% lower at Rs 670.70 on the Bombay Stock Exchange (BSE) at 9.55 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-update-sensex-nifty-open-lower-amid-us-tariff-uncertainty-wipro-trent-gain-nearly-2-percent-2699764-2025-03-27",
      "headline": "Sensex, Nifty gain after opening lower in volatile trade; Wipro rises nearly 2%Stock market opening: While the Sensex opened 100 points lower, it was trading 64.27 points higher at 77,552.77 at around 9.26 am. The Nifty50 was trading 16.75 points higher at 23,503.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-stocks-to-watch-on-march-27-wipro-bandhan-bank-infosys-vedanta-upl-and-more-2699760-2025-03-27",
      "headline": "Top stocks to watch today: Tata Motors, Wipro, JB Chemicals, Infosys, Vedanta, UPLWhile positive cues are likely to support the two leading indices on Dalal Street, US tariff uncertainty looms large. Here are some of the key stocks that will be in focus today."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sean-baker-reveals-the-inspiration-behind-oscar-winning-film-anora-2700093-2025-03-27",
      "headline": "Oscar-winning director Sean Baker reveals the inspiration behind AnoraAcclaimed director Sean Baker revealed the inspiration behind his latest film, Anora. The film, a collaboration with actor Karren Karagulian, delves into Russian-speaking communities and has won 5 Oscars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/neha-kakkar-on-melbourne-concert-organisers-ran-away-with-my-money-2700083-2025-03-27",
      "headline": "Neha Kakkar on Melbourne concert: Organisers ran away with my moneySinger Neha Kakkar has shared a statement regarding her recently-held Melbourne concert. Kakkar was criticised for breaking down on stage and was booed at the venue after she arrived late. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-floored-by-japanese-fan-who-learnt-telugu-after-watching-rrr-2700048-2025-03-27",
      "headline": "Jr NTR floored by Japanese fan who learnt Telugu after watching RRRActor Jr NTR, on Thursday, shared a touching incident from Japan where a fan learned Telugu after watching his 2022 film RRR. Along with the video, he also highlighted the cinema's role in bridging cultures in the caption. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hayao-miyazaki-on-machine-made-animation-art-creepy-stuff-insult-to-life-2700044-2025-03-27",
      "headline": "When Hayao Miyazaki called machine-made animation 'an insult to life'As Ghibli-style images are going viral, thanks to OpenAI's latest update, an old Hayao Miyazaki clip criticising machine-generated art resurfaced. In the clip, he called such art \"creepy stuff\" which is \"an insult to life\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-box-office-prediction-mohanlal-rs-50-crore-opening-mollywood-biggest-2700030-2025-03-27",
      "headline": "Empuraan box office: Mohanlal eyes Rs 50 crore opening, Mollywood's biggestMohanlal's L2: Empuraan hit theatres on March 27 worldwide amid massive anticipation. The film is expected to rake in over Rs 50 crore on its opening day, as per reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/scooby-doo-live-action-series-greenlit-by-netflix-2699996-2025-03-27",
      "headline": "Scooby-Doo live-action series greenlit by NetflixWe have some good news for Scooby-Doo fans. The beloved cartoon is getting the live-action treatment by streaming giant Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/santosh-director-sandhya-suri-censor-board-ban-india-release-heartbreaking-shahana-goswami-2700008-2025-03-27",
      "headline": "Santosh director calls censor board's ban on film's release heartbreakingSantosh director Sandhya Suri reacted to the film's India being blocked by the censor board. This came after the board demanded extensive and widespread cuts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-wedding-rumours-daughter-of-businessman-fake-2699997-2025-03-27",
      "headline": "Exclusive: Prabhas's team breaks silence on rumours of his weddingIt was rumoured that Telugu superstar Prabhas is finally settling down in life and that he was going to marry the daughter of a businessman. His team responded to the rumours regarding his marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ji-changwook-son-yejin-nana-period-drama-is-finally-in-production-confirms-netflix-2700003-2025-03-27",
      "headline": "Ji Chang-wook, Son Ye-jin's period drama is finally in production, confirms NetflixNetflix is set to produce 'Scandals', a Korean drama inspired by the 2003 film 'Untold Scandal'. Starring Son Ye-jin, Ji Chang-wook, and Nana, this series explores love and power in the Joseon era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dabboo-ratnani-on-rekha-new-photoshoot-we-wrapped-up-in-20-minutes-2699989-2025-03-27",
      "headline": "Dabboo Ratnani on Rekha's new photoshoot: We wrapped up in 20 minutesCelebrity photographer Dabboo Ratnani reveals Rekha called him for a personal shoot. They wrapped up in 20 minutes but spent an hour chatting. The legendary actor was deeply involved in styling, planning every detail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-vs-salman-khan-better-dancer-sikandar-director-responds-2699973-2025-03-27",
      "headline": "Aamir Khan vs Salman Khan: Who's the better dancer, Sikandar director respondsBollywood superstars Salman Khan and Aamir Khan recently sat down to discuss the making of Sikandar with director AR Murugadoss. During their chat, the filmmaker answered a number of questions, including who is the better dancer of the two."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-shares-laapataa-ladies-audition-fans-say-ravi-kishan-was-perfect-choice-2699975-2025-03-27",
      "headline": "Aamir shares Laapataa Ladies audition, fans say Ravi Kishan was 'perfect choice'Aamir Khan shares his audition for Laapataa Ladies. Fans agree Kiran Rao made the right call by casting Ravi Kishan, praising his 'authenticity' and saying Aamir looked 'too elite' for the role."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/deva-ott-release-shahid-kapor-pooja-hegde-film-to-release-on-netflix-2699972-2025-03-27",
      "headline": "Deva OTT release: When and where to watch Shahid Kapor, Pooja Hegde's actionerActors Shahid Kapoor and Pooja Hegde's action-thriller Deva is gearing up for its OTT release. The film, directed by Rosshan Andrrews, will premiere on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/l2-empuraan-movie-review-mohanlal-prithviraj-sukumaran-action-thriller-2699951-2025-03-27",
      "headline": "L2 Empuraan review: Convenient writing aside, Mohanlal-Prithviraj actioner deliversReleased-Thu Mar 27, 2025L2 Empuraan movie review: Director Prithviraj Sukumaran's Empuraan is a fitting sequel to Lucifer. Mounted on a grand scale, the film displays convenient writing but makes up with stunning visuals. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-flaunts-ram-janmabhoomi-watch-worth-rs-61-lakh-fans-react-2699955-2025-03-27",
      "headline": "Salman Khan flaunts Ram Janmabhoomi watch worth Rs 61 lakh, fans reactAhead of the release of his film Sikandar, Salman Khan was seen promoting the film flaunting his luxurious limited-edition Ram Janmabhoomi watch worth Rs 61 lakh. Fans reacted to the pictures, praising his secularism. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/adarsh-gourav-on-criticism-of-hindi-cinema-hansal-mehta-praise-originality-in-films-exclusive-2699921-2025-03-27",
      "headline": "Stop dumbing down films, audiences are smarter than you think: Adarsh GouravIn an exclusive interview with India Today, actor Adarsh Gourav reacted to Hansal Mehta calling him a 'chameleon'. He urged Bollywood to take risks, criticised the obsession with box office numbers, and said filmmakers should stop underestimating audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-wants-to-work-with-ananya-panday-janhvi-kapoor-people-talk-about-age-gap-2699908-2025-03-27",
      "headline": "Salman Khan on working with Ananya, Janhvi: Difficult when people talk about age gapSalman Khan expressed his willingness to work with younger actors like Ananya Panday and Janhvi Kapoor, despite facing criticism over the age gap. He believes collaborating with them provides valuable opportunities for their careers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shruthi-narayanan-first-post-after-private-video-leak-casting-couch-2699909-2025-03-27",
      "headline": "Tamil actor Shruthi Narayanan shares post after alleged casting couch video leakTamil actor Shruthi Narayanan is back in public view on Instagram after a casting couch video allegedly featuring her was leaked online. She had briefly made her Instagram account private."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-south-vs-bollywood-their-audience-isnt-very-accepting-2699865-2025-03-27",
      "headline": "Salman Khan on South vs Bollywood: Their audience isn't very accepting of our filmsSalman Khan recently discussed the popularity of South Indian films and the fan following enjoyed by the actors there. The actors cited \r\n fewer theatres in Bollywood as compared to the South to recover costs. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/immigration-foreigners-bill-2025-lok-sabha-amit-shah-india-not-dharamshala-2700096-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Immigration bill passed in Lok Sabha, Amit Shah says India not a dharamshalaUnion Home Minister Amit Shah said there were some people who wanted to enter India and create unrest, stressing that the country was not a 'dharamshala' and such individuals would be strongly dealt with."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-raises-with-us-accommodating-religious-sensitivities-of-deportees-illegal-immigration-2700127-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India in touch with US over accommodation of religious sensitivities of deporteesLast month, one of the 112 Indians deported from the US to Amritsar alleged that the US Army threw his turban (dastar) in the dustbin after forcing him to take it out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hinduphobia-in-us-academia-texas-houston-university-hinduism-course-sparks-row-narendra-modi-2700010-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Houston University's Lived Hindu Religion course sparks big row in USThe University of Houston's Lived Hindu Religion course has sparked a controversy after a student accused it of distorting Hinduism and promoting \"Hinduphobia\". A lecture video even calls Indian PM Narendra Modi a \"Hindu fundamentalist\". The US university told India Today Digital that the concerns were being reviewed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/message-to-india-bangladesh-mohammad-yunus-china-visit-bangladesh-independence-day-india-new-delhi-message-2699926-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Message to India? Yunus jets to China on Bangladesh Independence DayThe head of Bangladesh's interim government, Muhammad Yunus, chose to fly to Beijing on the country's Independence Day. A senior Bangladesh official called the visit a \"message\". A day earlier, PM Modi sent a message on \"mutual sensitivity\". What are the messages, and what do they convey?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/whats-your-raashee-51-of-indian-singles-prioritise-zodiac-compatibility-survey-2700075-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What's Your Raashee? 51% of Indian singles prioritise zodiac compatibility: SurveyThe art of 'Kundali Matching' or horoscope matching has been practised in India since the Vedic times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nirmala-sitharaman-banter-raghav-chadha-parliament-banking-system-loans-2700025-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Amused: Nirmala Sitharaman banks on humour as Raghav Chadha flags banking woesThe banter between Nirmala Sitharaman and Raghav Chadha took place in Rajya Sabha during a discussion on the Banking Laws (Amendment) Bill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/nandini-milk-curd-prices-hike-rs-4-dairy-farming-karnataka-minister-bjp-congress-2700019-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Karnataka hikes milk, curd prices by Rs 4 starting April 1A month after the Karnataka Milk Federation proposed Rs 5 per litre hike in Nandini milk prices, state Animal Husbandry Minister K Venkatesh announced a Rs 4 hike across all varieties, effective from April 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-kkr-eden-gardens-pitch-curator-sujan-mukherjee-controversy-explained-2700057-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "KKR pitch controversy explained: Why are critics slamming Eden curator?All is not well at the Kolkata Knight Riders' home at the Eden Gardens. After just one match in Kolkata, tensions are flaring up between the side and Eden pitch curator Sujan Mukherjee. Here's everything we know.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/uscirf-us-america-religious-freedom-report-pakistan-origin-commissioner-asif-mahmood-2700082-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US religious freedom report sparks row, spotlight on Pak-origin commissionerAfter the United States Commission on International Religious Freedom (USCIRF) annual report sparked a row, the spotlight is on the agency's Pak-origin Commissioner Asif Mahmood. Read on to know more about him and the controversy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/supreme-court-chief-justice-meeting-bar-associations-justice-yashwant-varma-transfer-2699954-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cash row: Chief Justice to consider demand of bar bodies on judge's transferThe presidents of six bar associations met the CJI on Thursday amid the row over the transfer of Justice Yashwant Varma, in whose residence a huge amount of cash was found."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-rattled-baloch-women-turn-suicide-bombers-explained-army-china-cpec-balochistan-bla-majeed-brigade-2699545-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistan rattled as Baloch women turn suicide bombersIt was a woman suicide bomber of the BLA's elite Majeed Brigade who blew herself in Kalat recently, causing death and destruction to the Pakistani army. Once silent victims, Baloch women from diverse backgrounds are now at the forefront of a growing resistance against the joint exploitation of Balochistan by Pakistan and China. Here's what's driving this trend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/ghibli-memes-internet-is-obsessing-over-today-chatgpt-new-image-generation-feature-2699988-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ghibli-style memes are what the Internet is obsessing over today. No surprise thereWith the help of the tool, social media users created Ghibli-inspired AI-generated images and memes that went viral on X and Instagram, fuelling a viral trend."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/hyderabad-priest-venkata-sai-surya-krishna-apsara-murder-2023-marriage-extramarital-affair-2699891-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hyderabad priest who killed lover, sealed body in septic tank gets life sentenceA Hyderabad court sentenced priest Venkata Sai Surya Krishna to life imprisonment for murdering Apsara, a woman he had an affair with. He killed her after she pressured him for marriage and buried her body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/faridabad-pilot-duped-elon-musk-meeting-rolex-watch-gift-cyber-fraud-2699993-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meeting with Elon Musk, Rolex: Ex-pilot swindled of Rs 72 lakh by fraudstersA Faridabad man was duped of Rs 72.16 lakh after scammers posed as Elon Musk's associates, luring him with fake investment opportunities. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-india-ties-vladimir-putin-narendra-modi-russian-foreign-minister-visit-sergey-lavrov-preparations-underway-2699917-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Now it's our turn': Putin to visit India soon, first since start of Ukraine warThis will be the first visit by Vladimir Putin, who has cultivated close ties with PM Modi, since the war with Ukraine broke out in 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/l2-empuraan-movie-review-mohanlal-prithviraj-sukumaran-action-thriller-2699951-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "L2 Empuraan review: Convenient writing aside, Mohanlal-Prithviraj actioner deliversReleased-Thu Mar 27, 2025L2 Empuraan movie review: Director Prithviraj Sukumaran's Empuraan is a fitting sequel to Lucifer. Mounted on a grand scale, the film displays convenient writing but makes up with stunning visuals. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/us-cancel-fraud-visa-appointment-india-illegal-immigration-2699866-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US cracks down on visa fraud, cancels 2,000 Indian appointments made by 'bots'The US Embassy in India cancelled 2,000 fraudulent visa appointments and suspended related accounts, asserting its zero-tolerance stance on fraud. \r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-assembly-congress-workers-protest-gherao-clash-with-police-water-cannons-2699934-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress workers vs cops outside Odisha assembly, lathicharge, water cannons usedCongress workers clashed with police in Odisha after 14 party MLAs were suspended for disrupting House proceedings. Water cannons were used as protests escalated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tourist-submarine-sinks-egypt-coast-red-sea-hurghada-injured-dead-2700017-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "6 dead as submarine carrying 45 Russian tourists sinks off Egypt's Red SeaThe submarine with tourists from various nationalities sank off the popular destination of Hurghada. Authorities said that emergency responders rescued 29 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-flaunts-ram-janmabhoomi-watch-worth-rs-61-lakh-fans-react-2699955-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan flaunts Ram Janmabhoomi watch worth Rs 61 lakh, fans reactAhead of the release of his film Sikandar, Salman Khan was seen promoting the film flaunting his luxurious limited-edition Ram Janmabhoomi watch worth Rs 61 lakh. Fans reacted to the pictures, praising his secularism. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/political-remarriage-of-aiadmk-bjp-on-the-cards-but-relationship-status-remains-complicated-2699927-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Political remarriage of AIADMK-BJP on cards but relationship status is complicatedEdappadi Palaniswami, the AIADMK boss, met Home Minister Amit Shah ostensibly to discuss the law and order situation in Tamil Nadu on March 25. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-test-series-india-england-tour-2699935-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit Sharma likely to opt out of England tour, Virat Kohli to retain spotSources told India Today that Rohit Sharma might not feature in India's upcoming Test series against England to be held later this year. But Virat Kohli is most likely to retain his spot. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/language-row-tamil-nadu-mk-stalin-yogi-adityanath-on-delimitation-bjp-rattled-by-tamil-nadus-firm-stand-2699802-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yogi Adityanath lecturing us on hate? The irony: Stalin hits back in language rowTamil Nadu Chief Minister MK Stalin hit back at his Uttar Pradesh counterpart for criticising the DMK's stand on delimitation and language policy, calling the BJP's response hypocritical and dubbing it \"political black comedy at its darkest\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hema-malini-raises-deepfake-concerns-in-lok-sabha-this-cannot-be-taken-lightly-2700138-2025-03-27",
      "headline": "Hema Malini raises deepfake concerns in Lok Sabha: This cannot be taken lightlyActor and BJP MP Hema Malini addressed the Lok Sabha about the growing threat of deepfake technology, particularly its impact on celebrities. She emphasised the severe health effects on victims and called for serious attention to this issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sean-baker-reveals-the-inspiration-behind-oscar-winning-film-anora-2700093-2025-03-27",
      "headline": "Oscar-winning director Sean Baker reveals the inspiration behind AnoraAcclaimed director Sean Baker revealed the inspiration behind his latest film, Anora. The film, a collaboration with actor Karren Karagulian, delves into Russian-speaking communities and has won 5 Oscars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/photo/samantha-dreamy-australian-holiday-nature-animals-and-good-vibes-2700100-2025-03-27",
      "headline": "Nature, animals and good vibes: Inside Samantha's dreamy Australian holidayOn Thursday, actor Samantha shared breathtaking pictures and videos from her recent trip to Australia. She enjoyed a series of heartfelt experiences, from feeding kangaroos to spotting adorable sleeping koalas.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/neha-kakkar-on-melbourne-concert-organisers-ran-away-with-my-money-2700083-2025-03-27",
      "headline": "Neha Kakkar on Melbourne concert: Organisers ran away with my moneySinger Neha Kakkar has shared a statement regarding her recently-held Melbourne concert. Kakkar was criticised for breaking down on stage and was booed at the venue after she arrived late. "
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-competition-committee-proposes-replay-kickoff-rule-changes-glbs-2700103-2025-03-27",
      "headline": "NFL competition committee proposes replay, kickoff rule changesThe NFL competition committee has introduced proposals to modify replay reviews and kickoffs. If approved, the changes could impact game flow, strategy, and player safety in the upcoming season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-ruturaj-gaikwad-on-rivalry-virat-kohli-rajat-patidar-2700094-2025-03-27",
      "headline": "CSK vs RCB: Ruturaj Gaikwad talks up friendship with Rajat Patidar ahead of big clashIPL 2025, CSK vs RCB: As the hype builds up for the big-ticket contest in Chennai on Friday. CSK captain Ruturaj Gaikwad talked up his equation with new RCB skipper Rajat Patidar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/2025-world-figure-skating-championships-how-to-watch-full-schedule-top-competitors-glbs-2700098-2025-03-27",
      "headline": "2025 World Figure Skating Championships: How to watch, full schedule, top competitorsThe best figure skaters from around the globe are set to come together for the 2025 ISU World Figure Skating Championships, happening from March 26-30 at TD Garden in Boston, Massachusetts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-russell-wilson-says-hell-start-for-giants-in-2025-glbs-2700086-2025-03-27",
      "headline": "NFL: Russell Wilson says he'll start for Giants in 2025Newly signed QB Russell Wilson declares he will be the Giants' starting quarterback this season. With veteran leadership and championship experience, he's determined to take charge and lead the team to success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-kkr-eden-gardens-pitch-curator-sujan-mukherjee-controversy-explained-2700057-2025-03-27",
      "headline": "KKR pitch controversy explained: Why are critics slamming Eden curator?All is not well at the Kolkata Knight Riders' home at the Eden Gardens. After just one match in Kolkata, tensions are flaring up between the side and Eden pitch curator Sujan Mukherjee. Here's everything we know.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-hindi-commentary-under-scanner-fans-demand-accountability-2700055-2025-03-27",
      "headline": "IPL 2025: Hindi commentary under scanner, fans demand accountabilityThe standards of Hindi commentary in the Indian Premier League 2025 (IPL 2025) are being questioned by fans all over social media, who're openly expressing their displeasure over its quality. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-fiba-explore-european-expansion-new-league-could-feature-top-euroleague-clubs-500m-franchise-fees-glbs-2700049-2025-03-27",
      "headline": "NBA and FIBA explore European expansion: New league could feature top EuroLeague clubs, $500M franchise feesThe NBA (National Basketball Association) is making major strides toward expanding into Europe, with discussions about a new professional basketball league taking center stage at this week's Board of Governors meeting in New York. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-lebron-james-hits-buzzer-beater-to-lead-lakers-past-pacers-glbs-2699994-2025-03-27",
      "headline": "NBA: LeBron James hits Buzzer-Beater to lead Lakers past PacersLeBron James maintained his streak of scoring 10 or more points in a game with a buzzer-beating last-second putback to give the Los Angeles Lakers a nail-biting 120-119 victory over the Indiana Pacers at Gainbridge Fieldhouse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-josh-hazlewood-rcb-legend-nets-2699981-2025-03-27",
      "headline": "Virat Kohli really pushes you in the nets: Josh HazlewoodIPL 2025: Josh Hazlewood said that Virat Kohli tests a player's skills in the nets. Kohli made a brilliant start to his campaign after scoring an unbeaten 59 against Kolkata Knight Riders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vijaykumar-vyshak-reacts-to-arshdeep-singhs-viral-video-2699978-2025-03-27",
      "headline": "Vyshak reacts to Arshdeep's viral video: Happy that he had confidence in mePunjab Kings seamer Vijaykumar Vyshak reacted to Arshdeep Singh's viral video where he was seen suggesting Shreyas Iyer to bring him as an Impact player against Gujarat Titans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-hindi-commentary-under-scanner-fans-demand-accountability-2700055-2025-03-27",
      "headline": "IPL 2025: Hindi commentary under scanner, fans demand accountabilityThe standards of Hindi commentary in the Indian Premier League 2025 (IPL 2025) are being questioned by fans all over social media, who're openly expressing their displeasure over its quality. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-fiba-explore-european-expansion-new-league-could-feature-top-euroleague-clubs-500m-franchise-fees-glbs-2700049-2025-03-27",
      "headline": "NBA and FIBA explore European expansion: New league could feature top EuroLeague clubs, $500M franchise feesThe NBA (National Basketball Association) is making major strides toward expanding into Europe, with discussions about a new professional basketball league taking center stage at this week's Board of Governors meeting in New York. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-lebron-james-hits-buzzer-beater-to-lead-lakers-past-pacers-glbs-2699994-2025-03-27",
      "headline": "NBA: LeBron James hits Buzzer-Beater to lead Lakers past PacersLeBron James maintained his streak of scoring 10 or more points in a game with a buzzer-beating last-second putback to give the Los Angeles Lakers a nail-biting 120-119 victory over the Indiana Pacers at Gainbridge Fieldhouse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-josh-hazlewood-rcb-legend-nets-2699981-2025-03-27",
      "headline": "Virat Kohli really pushes you in the nets: Josh HazlewoodIPL 2025: Josh Hazlewood said that Virat Kohli tests a player's skills in the nets. Kohli made a brilliant start to his campaign after scoring an unbeaten 59 against Kolkata Knight Riders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vijaykumar-vyshak-reacts-to-arshdeep-singhs-viral-video-2699978-2025-03-27",
      "headline": "Vyshak reacts to Arshdeep's viral video: Happy that he had confidence in mePunjab Kings seamer Vijaykumar Vyshak reacted to Arshdeep Singh's viral video where he was seen suggesting Shreyas Iyer to bring him as an Impact player against Gujarat Titans."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}