{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/when-will-you-get-itr-refund-december-2025-cbdt-chairman-ravi-agrawal-delay-reason-2823254-2025-11-20",
      "headline": "Waiting for your tax refund? Here's why it's delayed and when it may arriveAccording to the Income Tax Department, more than 7.57 crore returns were filed by September 23, yet refunds for many taxpayers remain pending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-nearly-450-points-higher-nifty-nears-life-time-high-2823139-2025-11-20",
      "headline": "Sensex ends nearly 450 points higher, Nifty nears life-time highThe S&P BSE Sensex rose 446.21 points to close at 85,632.68, while the NSE Nifty50 climbed 139.50 points to finish at 26,192.15. Broader indices were mixed, but the tone across frontline stocks remained firmly positive, led by gains in heavyweight financial counters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-surges-500-points-nifty-nears-life-time-high-whats-driving-the-rally-2823064-2025-11-20",
      "headline": "Sensex surges 500 points, Nifty nears life-time high. What's driving the rally?At 1.58 am, the S&P BSE Sensex was up 526.63 points to 85,713.10, while the NSE Nifty50 hit a fresh 52-week high and was nearing an all-time high of 26,277. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-share-price-falls-for-second-day-tumbles-10-post-listing-rally-over-2823020-2025-11-20",
      "headline": "Groww share price falls 10% again: Is the post-listing rally over?Around 1:12 pm, shares of the company were trading 9.18% lower at Rs 154.30. Over the last two sessions, the stock has slipped nearly 18%, a sharp reversal that has investors wondering whether the post-listing rally has already run its course."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/leading-e-commerce-platforms-say-they-now-comply-with-anti-dark-pattern-rules-2823001-2025-11-20",
      "headline": "Leading e-commerce platforms say they now comply with anti–dark pattern rulesAmong the 26 companies listed by the CCPA are well-known names such as Flipkart, Myntra, Zomato, Swiggy, Meesho, BigBasket, JioMart and others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/the-new-trade-playbook-why-the-world-needs-a-more-distributed-system-2822970-2025-11-20",
      "headline": "The new trade playbook: Why the world needs a more distributed systemThese shifts are not driven by a single factor but by the combined influence of policy changes, supply chain lessons from recent years, and the evolving priorities of businesses and governments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sip-for-beginners-rs-5000-monthly-investment-tips-how-to-make-1-crore-stock-market-investing-2822963-2025-11-20",
      "headline": "Investing Rs 5,000 every month in SIPs? This is when you can hit Rs 1 crorePeople know SIPs are useful, they hear stories of long-term gains, and they see friends investing every month, but when it comes to choosing where to put a small amount like Rs 5,000, most feel lost."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ed-attaches-anil-ambani-linked-assets-worth-rs-1400-crore-total-nears-rs-9000-crore-2822929-2025-11-20",
      "headline": "ED attaches Anil Ambani-linked assets worth Rs 1,400 crore; total nears Rs 9,000 croreThe latest attachment has been made under the Prevention of Money Laundering Act (PMLA). The properties are located across Navi Mumbai, Chennai, Pune and Bhubaneswar, the sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/considering-personal-loan-for-holiday-travel-ask-these-5-questions-first-2822904-2025-11-20",
      "headline": "Considering a personal loan for holiday travel? Ask these 5 questions firstFunding that year-end getaway through an instant personal loan might seem like a savvy move, but it is important to assess the need thoroughly. An impulsive decision may be overshadowing some important financial realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jp-powers-share-price-zooms-10-today-why-is-it-rising-today-2822883-2025-11-20",
      "headline": "JP Power share price zooms 10%. Why is it rising today?JP Power, which was trading at Rs 22.37, gained over 10% in early trade as investors reacted to clarity on the future of the JP Group's stressed assets. JAL, the former promoter entity, holds close to 24% stake in JP Power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-shares-falling-today-why-reason-down-8-percent-two-day-slide-billionbrains-stock-lower-circuit-2822879-2025-11-20",
      "headline": "Groww shares down 8% again: Why Billionbrains stock is falling todayGroww has been under pressure for two consecutive days. On Wednesday, the stock had already slipped around 10%. This comes after the company made a strong market debut, listing at Rs 112, about 12% higher than its issue price of Rs 100."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-150-points-nifty-crosses-26000-adani-enterprises-gains-1-2822865-2025-11-20",
      "headline": "Sensex rises over 150 points, Nifty crosses 26,000; Groww shares tumble 7%The S&P BSE Sensex climbed over 150 points in early trade, while the NSE Nifty50 moved past the 26,000 mark, signalling a mildly bullish undertone across the market. Broader indices also edged higher, mirroring gains in frontline stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/missed-emi-loan-harassment-digital-lending-expert-panel-india-2822580-2025-11-19",
      "headline": "When missed EMIs become a nightmare: Inside India's loan harassment trapBehind India's digital lending rise is a quieter story of calls, pressure and fear. Data suggests that loan recovery harassment is growing at a pace the system can no longer keep up with."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/stock-market-closing-bell-sensex-ends-500-points-higher-nifty-above-26000-it-shares-rise-hcltech-gains-4-percent-2822531-2025-11-19",
      "headline": "Sensex ends 500 points higher, Nifty above 26,000; HCLTech gains 4%The S&P BSE Sensex jumped 513.45 points to close at 85,186.47, while the NSE Nifty50 gained 142.60 points to end at 26,052.65. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/indian-wedding-insurance-how-to-get-when-premium-middle-class-luxury-shadi-destination-2822529-2025-11-19",
      "headline": "Big fat Indian weddings can now be insured. Should you get one?India is gearing up for one of its busiest wedding seasons ever. In 2025 alone, nearly 46 lakh weddings are expected, generating close to Rs 6.5 lakh crore in spending. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/he-lost-rs-40000-expert-explains-how-online-gaming-apps-trap-users-2822483-2025-11-19",
      "headline": "He lost Rs 40,000: Expert explains how online gaming apps trap usersExpert says insiders from gaming firms have revealed how these apps operate. They label heavy spenders as \"whales\" and have teams calling them daily to push more deposits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/excelsoft-technologies-ipo-open-bidding-subscribe-skip-expert-review-what-gmp-signals-2822438-2025-11-19",
      "headline": "Excelsoft Technologies IPO open for bidding: Should you subscribe? Check GMPExcelsoft Technologies aims to raise Rs 500 crore through the IPO, which includes a fresh issue of 1.50 crore shares worth Rs 180 crore and an offer for sale (OFS) of 2.67 crore shares worth Rs 320 crore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/wrong-member-id-linked-to-your-uan-here-how-epfo-lets-you-fix-it-2822407-2025-11-19",
      "headline": "Wrong member ID linked to your UAN? Here's how EPFO lets you fix itMany employees discover that their UAN has been linked to a wrong member ID, often due to job changes or data errors. EPFO has introduced an easy online method to fix this, without visiting any office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-every-day-micro-payments-eat-into-your-savings-2822376-2025-11-19",
      "headline": "How every day micro-payments eat into your savingsWelcome to India's new spending reality, the age of micro-payments that silently seep into your accounts and cause invisible leaks. By the end of the month, many people find their digital wallets, likePaytm, PhonePe, Google Pay, have quietly leaked hundreds and thousands of rupees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/delhi-ncr-office-space-rent-rise-why-reason-whats-driving-commercial-real-estate-prices-up-noida-2822369-2025-11-19",
      "headline": "NCR office rents are rising: What's driving commercial real estate prices up?Expressway expansions, metro lines, and upcoming airports are easing mobility while opening new economic opportunities in the NCR."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-aneet-padda-viral-video-dating-rumours-fan-frenzy-karan-johar-2823197-2025-11-20",
      "headline": "They are yet not official: Did KJo just confirm Ahaan-Aneet's relationship? Filmmaker Karan Johar recently spoke about the on-screen chemistry between Ahaan Panday and Aneet Padda in Mohit Suri's new film 'Saiyaara'. The director also hinted at their dating speculation among fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-gaurav-khanna-wife-dismisses-astrologer-prediction-on-having-child-2823262-2025-11-20",
      "headline": "Bigg Boss 19: Gaurav Khanna's wife dismisses astrologer prediction on having child During 'Bigg Boss 19' Family Week, Gaurav Khanna's wife Akanksha Chamola dismissed rumours about starting a family. Her candid response sparked conversations on responsibility and personal choices in motherhood among housemates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-nc24-myth-rooted-thriller-high-budget-intense-action-2823285-2025-11-20",
      "headline": "Naga Chaitanya's NC24 gets behind-the-scenes reveal in new video. Watch A behind-the-scenes video offers a rare glimpse into the making of 'NC24', the upcoming film starring Naga Chaitanya and Meenakshi Chaudary. The video highlights the production's ambition, technical expertise, and the extensive preparations underway in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/emotional-or-physical-cheating-govinda-wife-sunita-ahuja-takes-her-pick-after-twinkle-khanna-remark-2823263-2025-11-20",
      "headline": "Emotional or physical cheating? Sunita Ahuja takes her pick after Twinkle's remark Sunita Ahuja breaks her silence on emotional vs physical cheating, calling emotional betrayal the most painful as she reflects on 38 years of marriage with Govinda, rumours of divorce, and the pressures of being a star's wife."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/manoj-bajpayee-family-man-3-funeral-moment-fans-await-season-4-2823243-2025-11-20",
      "headline": "Manoj Bajpayee was asked about The Family Man 3 while heading to father's funeral Actor Manoj Bajpayee shared a bizarre incident of being asked about 'The Family Man 3' while travelling to his father's funeral. The actor also expressed optimism about the arrival of Season 4 amid fan excitement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-set-to-team-up-with-adoor-gopalakrishnan-after-30-years-report-2823211-2025-11-20",
      "headline": "Mammootty set to team up with Adoor Gopalakrishnan after 30 years: Report The legendary Mammootty-Adoor Gopalakrishnan duo, behind classics like 'Mathilukal' and 'Vidheyan', are reportedly set to reunite after three decades for a screen adaptation of 'Randidangazhi', marking Adoor's return to direction after eight years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-warned-sao-paulo-nazi-references-interlagos-concert-2823251-2025-11-20",
      "headline": "Kanye West told Nazi remarks at upcoming show could lead to immediate arrest Rapper Kanye West faces legal action if he mentions Nazis or displays Nazi-related imagery during his upcoming Sao Paulo performance, following the outcry over his recent song and repeated anti-semitic remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nadu-center-basketball-teenage-struggles-substance-abuse-jiohotstar-2823182-2025-11-20",
      "headline": "Nadu Center first impression: A slow start to a basketball-themed series 'Nadu Center' is a slow-paced basketball drama focusing on teenage challenges. The series highlights substance abuse and mental health issues among adolescents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/full-meals-kannada-romantic-drama-review-vinayaka-n-likith-shetty-khushee-ravi-2823125-2025-11-20",
      "headline": "Full Meals review: A decent love triangle tale that delivers in bits and piecesRelease Date:Thu Nov 20, 2025 Full Meals film review: The Kannada romantic drama written and directed by Vinayaka N, presents a love triangle between Likith Shetty, Khushee Ravi and Thejaswini Sharma, where the ladies battle it out to get Lucky (Likith)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-mighty-nein-chaotic-charming-surprisingly-emotional-2823117-2025-11-20",
      "headline": "The Mighty Nein review: Chaotic, charming, and surprisingly emotionalRelease Date:Wed Nov 19, 2025 'The Mighty Nein' on Prime Video delivers a dark, character-driven fantasy packed with emotional depth, sharp humour, stunning animation and rich world-building.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/parasocial-relationships-taylor-swift-cambridge-dictionary-2025-word-of-the-year-2823196-2025-11-20",
      "headline": "Taylor Swift inspires Cambridge Dictionary's word of the year The Cambridge Dictionary has selected 'parasocial' as its word of the year for 2025, a decision closely linked to the global influence of Taylor Swift and the heightened visibility of fan-celebrity relationships in the digital age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priyanka-mohan-joins-666-operation-dream-theatre-cast-1980s-spy-film-hemanth-m-rao-2823145-2025-11-20",
      "headline": "Priyanka Mohan joins cast of retro spy drama 666 Operation Dream Theatre Priyanka Mohan has joined the cast of Hemanth M Rao's '666 Operation Dream Theatre', starring Dhananjaya and Shiva Rajkumar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-action-film-with-yrf-to-feature-aaishvary-thackeray-as-antagonist-2823136-2025-11-20",
      "headline": "Ahaan Panday's action film with YRF to feature Aaishvary Thackeray as antagonist Aaishvary Thackeray has been signed by Yash Raj Films for a new action romance directed by Ali Abbas Zafar. The film also features Sharvari Wagh in a pivotal character."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/son-ye-jin-hyun-bin-win-top-acting-awards-reveal-sons-name-blue-dragon-film-awards-2823165-2025-11-20",
      "headline": "Son Ye-jin shares son Kim Woo-jin's name as Hyun-bin calls him their strength Actors Hyun Bin and Son Ye Jin share personal milestones on stage at the 46th Blue Dragon Film Awards, marking their first appearance as a married couple at the ceremony and revealing their son's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-apologises-meera-vasudevan-thanmathra-nude-scene-2823161-2025-11-20",
      "headline": "When Mohanlal apologised to Meera Vasudevan before filming Thanmathra nude scene Meera Vasudevan recalled the controversial scene from the film 'Thanmathra' where Mohanlal's character gets disoriented during intimacy. She shared that Mohanlal apologised before the nude scene, showing respect for her integrity during the challenging, pivotal moment that signalled the onset of memory loss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nora-fatehi-shenseea-perform-what-do-i-know-tonight-show-jimmy-fallon-2823134-2025-11-20",
      "headline": "Nora Fatehi dazzles on Jimmy Fallon show, performs with Shenseea. See pics Nora Fatehi appeared on 'The Tonight Show Starring Jimmy Fallon', delivering a dynamic performance of her latest single alongside Shenseea and sharing behind-the-scenes moments with host Jimmy Fallon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-day-73-moms-light-up-the-house-divyas-mother-steals-the-show-2823055-2025-11-20",
      "headline": "Bigg Boss Telugu 9 Day 73: Moms light up the house, Divya's mother steals the show Family Week continued with emotional reunions, laughter, teasing and some unexpected heart-warming moments as the families of Pavan, Sanjana and Divya entered the house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/joey-final-eight-unaired-episodes-released-online-completing-friends-spinoff-series-2823127-2025-11-20",
      "headline": "Friends' spin-off Joey finally unveils last 8 unaired episodes after two decades The last eight episodes of the 'Friends' spinoff  'Joey', which were never broadcast in the US, are now available on the official 'Friends' YouTube channel for viewers worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/varun-alagh-joins-shark-tank-india-season-5-investor-brand-building-expertise-2823040-2025-11-20",
      "headline": "Shark Tank India 5: Ghazal Alag introduces husband Varun as new judge Ghazal Alagh's husband Varun Alagh, CEO and Co-founder of Honasa Consumer, joins the investor panel on 'Shark Tank India Season 5', promising to support innovation and startups with his extensive experience in building successful consumer brands."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/police-show-sharjeel-imams-inflammatory-videos-ahead-of-2020-delhi-riots-to-supreme-court-2823188-2025-11-20",
      "headline": "India Today accesses Sharjeel Imam videos played before court to oppose bail pleaThe Delhi Police showed the video to the court while opposing Sharjeel Imam's bail plea, calling him one of the chief conspirators of the Delhi riots which were orchestrated to topple the government and were not spontaneous."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ten-dk-shivakumar-camp-mlas-rush-to-delhi-as-congress-hits-25-year-mark-in-karnataka-2823195-2025-11-20",
      "headline": "Crisis in Karnataka Congress? Shivakumar MLAs rush to Delhi to seek power-sharingMLAs from the DK Shivakumar camp are travelling to Delhi urging the Congress high command to honour the 'power-sharing deal'. More MLAs will to join tomorrow. They will meet Mallikarjun Kharge and KC Venugopal to press their demand."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kashmir-times-jammu-office-raided-ak-rifle-cartridges-rounds-of-pistols-recovered-2823164-2025-11-20",
      "headline": "Kashmir Times office raided, AK rifle cartridges recovered; editors slam actionThe editors condemned the raid as a \"coordinated attempt to silence independent journalism,\" insisting that criticising the government is not inimical to the state and calling on authorities to withdraw the charges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-india-pakistan-nuclear-war-modi-phone-call-trade-deal-tariffs-2822930-2025-11-20",
      "headline": "PM Modi's call, nuclear dust over LA, 350% tariff in Trump's new India-Pak claimRepeating the claim for the nth time, Trump said he settled the conflict between India and Pakistan after threatening the two countries with 350% tariffs. He also claimed that PM Modi called him to say India was not going to war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/doctor-going-through-perimenopause-exactly-how-i-am-managing-it-dr-jaishree-sharad-2822465-2025-11-20",
      "headline": "I'm a doctor going through perimenopause, and here's exactly how I'm managing itA dermatologist's first-hand journey through the science, skin, and soul of hormonal change - perimenopause."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/intellectuals-who-become-terrorists-more-dangerous-cops-supreme-court-delhi-riots-bail-hearing-blast-terror-module-case-2823097-2025-11-20",
      "headline": "Intellectuals turning terrorists more dangerous, Supreme Court told in riots caseDelhi police said a trend has emerged where intellectuals were using state funding to become doctors and engineers and then engage in anti-national activities. The Supreme Court was hearing the bail pleas of activists Umar Khalid and Sharjeel Imam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejashwi-yadav-first-reaction-bihar-poll-defeat-nitish-kumar-oath-nda-government-2823066-2025-11-20",
      "headline": "Hope new government...: What Tejashwi Yadav said in 1st remarks since Bihar lossTejashwi Yadav, who has been surprisingly mum on the Mahagathbandhan's Bihar loss, broke silence with a congratulatory post for Nitish Kumar on taking oath for the 10th time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/emotional-or-physical-cheating-govinda-wife-sunita-ahuja-takes-her-pick-after-twinkle-khanna-remark-2823263-2025-11-20",
      "headline": "Emotional or physical cheating? Sunita Ahuja takes her pick after Twinkle's remarkSunita Ahuja breaks her silence on emotional vs physical cheating, calling emotional betrayal the most painful as she reflects on 38 years of marriage with Govinda, rumours of divorce, and the pressures of being a star's wife."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-7-crore-cash-van-robbery-cctv-suspected-recce-identified-suspect-police-2823021-2025-11-20",
      "headline": "Money Heist in Bengaluru: CCTV shows gang doing recce before Rs 7 crore robberyPolice probing the Rs 7 crore cash van robbery in Bengaluru have identified a suspect by matching CCTV footage with past records. Investigators believe the same gang is linked to earlier ATM robbery cases. A citywide manhunt is underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/hoogly-googly-why-bjp-hits-a-wall-in-west-bengal-mamata-banerjee-trinamool-congress-election-muslim-voters-sir-2822689-2025-11-20",
      "headline": "The Hooghly googly: Why BJP hits a wall in West BengalPM Modi might use the Ganga metaphor to talk about an electoral victory in Bengal after Bihar, but geography itself throws up a Hooghly googly. On the demographic back foot in West Bengal, the BJP's problem is how does it dislodge Mamata Banerjee, who hasn't lodged herself as the CM even after 14 years, playing the eternal opposition to a \"scheming Dilli\"?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/up-bride-dances-with-groom-after-jaimala-disappears-by-morning-before-vidaai-2823260-2025-11-20",
      "headline": "UP bride dances with groom after jaimala, disappears by morning before vidaaiThe groom's family has now filed a complaint against the bride's family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nia-arrests-four-more-prime-accused-in-red-fort-blast-total-six-held-2823180-2025-11-20",
      "headline": "Delhi blast: Bomber's aide, lady doctor among four arrested by NIA; total arrests 6NIA has identified the accused as Dr Muzammil Shakeel Ganai of Pulwama (Jammu and Kashmir), Dr Adeel Ahmed Rather of Anantnag (Jammu and Kashmir), Dr Shaheen Saeed of Lucknow (UP), and Mufti Irfan Ahmad Wagay of Shopian (Jammu and Kashmir)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-seafood-industry-exporters-benefit-surge-china-japan-dispute-taiwan-japanese-pm-sanae-takaichi-row-senkaku-islands-2822985-2025-11-20",
      "headline": "Indian seafood a great hit in China as Beijing takes on TokyoIndian seafood exports to China have been rising amid Beijing's clampdown on imports from Japan. Beijing on Wednesday imposed a complete ban on Japanese seafood imports amid a diplomatic battle over Taiwan. Shares of Indian seafood exporters surged soon after, pointing towards potential gains for the sector, which was hit by steep US tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/cgc-university-mohali-where-vision-becomes-legacy-and-education-becomes-evolution-2821185-2025-11-17",
      "headline": "CGC University, Mohali: Where vision becomes legacy and education becomes evolutionStories of students who dare to dream, of educators who ignite curiosity, and of a community that chooses progress with purpose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/120-bahadur-review-rezang-la-bravery-farhan-akhtar-war-drama-2823018-2025-11-20",
      "headline": "120 Bahadur review: Farhan Akhtar-led war drama salutes bravery but lacks impactRelease Date:Fri Nov 21, 2025120 Bahadur movie review: '120 Bahadur' attempts to honour the bravery of soldiers at Rezang La during the 1962 Indo-China war. Despite sincere performances and stunning visuals, the film falls short of delivering a deeply moving war drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/not-appropriate-for-this-court-to-set-timelines-on-president-governors-clearing-bills-supreme-court-2822931-2025-11-20",
      "headline": "Can't impose timelines on Governors for bills, says Supreme Court, with a riderThe Supreme Court said that Governors cannot sit on Bills indefinitely, even as it was not in favour of fixed timelines for granting assent. While highlighting the separation of powers, the court said prolonged delays in clearing Bills could still be subjected to judicial scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/raulane-controversy-millions-saw-the-photos-but-photographers-paid-the-price-2822798-2025-11-20",
      "headline": "Why the viral Raulane photos turned into a nightmare for the photographersTheir photos spread like wildfire, introducing a little-known village festival to the world. But instead of feeling proud, the photographers stayed up night after night, fighting for the one thing that should've come easily: credit."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-new-island-sindh-drilling-donald-trump-oil-reserves-2823070-2025-11-20",
      "headline": "Pakistan is building a new island. It is because of TrumpPakistan news: Months after US President Donald Trump showed interest in the country's 'massive oil reserves', surprising not just industry experts but Pakistan itself, Islamabad is building an artificial island to ramp up oil and gas exploration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-steve-smith-brutal-response-monty-panesar-sandpaper-sledge-2822994-2025-11-20",
      "headline": "Steve Smith recalls Panesar's embarrassing quiz show after sandpaper sledgeAshes: Steve Smith has responded to Monty Panesar's sandpaper sledge by recalling the former England spinner's awkward appearance on a British quiz show, adding early spice to the build up to the first Test in Perth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/meerut-doctor-investigated-for-using-feviquick-on-childs-bleeding-wound-2822993-2025-11-20",
      "headline": "Meerut doctor accused of using Fevikwik instead of stitches on boy's woundA Meerut doctor is under investigation after a family alleged that he treated their toddler's bleeding wound with Fevikwik instead of stitches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/5-easy-ai-side-hustles-to-start-this-weekend-2823174-2025-11-20",
      "headline": "5 AI side-hustles anyone can start this weekend without a tech backgroundA growing number of everyday workers are building practical AI side-hustles — from small automations to niche tools — proving that real income comes from solving real problems, not becoming an AI expert. Here are 5 AI-based side-hustle plans to get you started."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-nitish-kumar-oath-pk-prashant-kishor-silence-satyagrah-champaran-gandhi-bhitiharwa-tejashwi-rahul-gandhi-2823063-2025-11-20",
      "headline": "Prashant Kishor's silence contrasts Gandhi Maidan noise on Bihar Day 1While JD(U) leader Nitish Kumar was sworn in as Bihar CM amid slogans, cheers and political fanfare at Patna's Gandhi Maidan, Jan Suraaj founder Prashant Kishor, whose party drew a nil, marked the day with silence at the Gandhi Ashram in West Champaran. PK is seeking to position himself as a new kind of opposition, which is focused on accountability and collective action."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/mamdani-is-indian-says-mehdi-hasan-rips-apart-eric-trump-son-as-dumbest-of-dumb-sons-us-politics-new-york-city-2823016-2025-11-20",
      "headline": "Mamdani is Indian, says Mehdi Hasan, rips into Eric TrumpBritish-American journalist Mehdi Hasan slammed Eric Trump for alleging that New York City Mayor-elect Zohran Mamdani \"hates\" Indians. Hasan reminded Eric that Mamdani has Indian heritage, saying that's why he is the dumbest of the dumb sons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-claims-sir-structurally-unsound-writes-to-chief-election-commissioner-gyanesh-kumar-2823166-2025-11-20",
      "headline": "SIR structurally unsound, Mamata Banerjee writes to poll body chiefShe wrote in the letter that the situation in West Bengal regarding SIR has reached an alarming stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-aneet-padda-viral-video-dating-rumours-fan-frenzy-karan-johar-2823197-2025-11-20",
      "headline": "They are yet not official: Did KJo just confirm Ahaan-Aneet's relationship?Filmmaker Karan Johar recently spoke about the on-screen chemistry between Ahaan Panday and Aneet Padda in Mohit Suri's new film 'Saiyaara'. The director also hinted at their dating speculation among fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-gaurav-khanna-wife-dismisses-astrologer-prediction-on-having-child-2823262-2025-11-20",
      "headline": "Bigg Boss 19: Gaurav Khanna's wife dismisses astrologer prediction on having childDuring 'Bigg Boss 19' Family Week, Gaurav Khanna's wife Akanksha Chamola dismissed rumours about starting a family. Her candid response sparked conversations on responsibility and personal choices in motherhood among housemates."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-kagiso-rabada-injury-update-guwahati-test-piet-botha-south-africa-2823293-2025-11-20",
      "headline": "IND vs SA: South Africa to decide on Rabada, Harmer cleared for 2nd Test in Guwahati South Africa bowling coach Piet Botha has said that a final call on Kagiso Rabada's participation in the Guwahati Test will be made on the eve of the match. Rabada missed the first Test due to an injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sam-konstas-fiery-reply-to-virat-kohli-shoulder-charge-boxing-day-test-mcg-2823245-2025-11-20",
      "headline": "Sam Konstas' fiery reply to Kohli after shoulder charge revealed by Oliver Peake Sam Konstas' debut in the Boxing Day Test featured a notable exchange with India star Virat Kohli who shoulder charged him. Oliver Peake has finally lifted the lid on what transpired between the two during the heated incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-washington-sundar-number-three-sitanshu-kothak-2823276-2025-11-20",
      "headline": "Washington Sundar at No.3: India batting coach defends decision for Kolkata Test India batting coach Sitanshu Kothak has defended the decision to use Washington Sundar as the No.3 batter during the Kolkata Test. Sundar scored 29 and 31 during the match and looked India's best batter during the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/russell-crowe-ashes-australian-roots-cricket-connection-joe-rogan-commentary-shane-warne-2823265-2025-11-20",
      "headline": "The Ashes and Russell Crowe: A cricketing connection few know about Russell Crowe's Ashes excitement highlights a lesser-known cricket connection shaped by heritage, family ties and moments that link the actor closely to the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-palash-muchal-engagement-funny-video-jememah-rodrigues-2823261-2025-11-20",
      "headline": "Watch: Smriti Mandhana confirms engagement with Palash Muchhal in hilarious reel In a fun and light-hearted moment, Smriti Mandhana confirmed her engagement by flashing her ring in a playful dance video with her teammates. The video featuring many of the India World Cup winners, has gone viral on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-withholds-ashes-test-xi-announcement-australia-names-two-debutants-perth-opener-2823247-2025-11-20",
      "headline": "England break away from usual tradition for Perth Test against Australia England break with their usual practice by postponing their playing XI for the opening Ashes Test against Australia. England are set to make a call on choosing Mark Wood or Shoaib Bashir in the lineup for the match in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-test-rishabh-pant-captaincy-can-handle-ricky-ponting-2823242-2025-11-20",
      "headline": "Rishabh Pant can handle India captaincy in 2nd Test vs South Africa: Ricky Ponting Ricky Ponting has backed Rishabh Pant to handle India's Test captaincy if needed, citing his calmness, experience as a wicketkeeper, and proven leadership during their years together at Delhi Capitals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/india-fifa-ranking-drop-lowest-afc-asian-cup-bangladesh-loss-isl-chaos-2823239-2025-11-20",
      "headline": "India drops to worst FIFA ranking in almost a decade after Bangladesh loss India's latest rankings drop is not just about lost matches, but lost direction. With defeats piling up and uncertainty off the pitch, the Blue Tigers face a defining moment that demands urgent clarity and change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-gautam-gambhir-advice-shubman-gill-workload-management-2823214-2025-11-20",
      "headline": "Asked Gambhir about Gill's workload, he suggested to skip IPL: Aakash Chopra Aakash Chopra reveals Gautam Gambhir's advice on managing Shubman Gill's heavy workload amid injury concerns. Gill injured his neck during first Test against South Africa at Eden Gardens, Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-score-476-three-century-partnerships-andy-mcbrine-six-wickets-dhaka-test-2823190-2025-11-20",
      "headline": "BAN vs IRE: Bangladesh in control after Litton, Mushfiqur hundreds Bangladesh capitalised on strong partnerships to reach 476 before being bowled out on Day 2 in Dhaka, with Andy McBrine claiming six wickets. Mushfiqur Rahim and Litton Das' hundreds and a disciplined performance by the bowlers put the hosts in a strong position. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-withholds-ashes-test-xi-announcement-australia-names-two-debutants-perth-opener-2823247-2025-11-20",
      "headline": "England break away from usual tradition for Perth Test against Australia England break with their usual practice by postponing their playing XI for the opening Ashes Test against Australia. England are set to make a call on choosing Mark Wood or Shoaib Bashir in the lineup for the match in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-test-rishabh-pant-captaincy-can-handle-ricky-ponting-2823242-2025-11-20",
      "headline": "Rishabh Pant can handle India captaincy in 2nd Test vs South Africa: Ricky Ponting Ricky Ponting has backed Rishabh Pant to handle India's Test captaincy if needed, citing his calmness, experience as a wicketkeeper, and proven leadership during their years together at Delhi Capitals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/india-fifa-ranking-drop-lowest-afc-asian-cup-bangladesh-loss-isl-chaos-2823239-2025-11-20",
      "headline": "India drops to worst FIFA ranking in almost a decade after Bangladesh loss India's latest rankings drop is not just about lost matches, but lost direction. With defeats piling up and uncertainty off the pitch, the Blue Tigers face a defining moment that demands urgent clarity and change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-gautam-gambhir-advice-shubman-gill-workload-management-2823214-2025-11-20",
      "headline": "Asked Gambhir about Gill's workload, he suggested to skip IPL: Aakash Chopra Aakash Chopra reveals Gautam Gambhir's advice on managing Shubman Gill's heavy workload amid injury concerns. Gill injured his neck during first Test against South Africa at Eden Gardens, Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-score-476-three-century-partnerships-andy-mcbrine-six-wickets-dhaka-test-2823190-2025-11-20",
      "headline": "BAN vs IRE: Bangladesh in control after Litton, Mushfiqur hundreds Bangladesh capitalised on strong partnerships to reach 476 before being bowled out on Day 2 in Dhaka, with Andy McBrine claiming six wickets. Mushfiqur Rahim and Litton Das' hundreds and a disciplined performance by the bowlers put the hosts in a strong position. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wbbl-2025-26-meg-lanning-smash-135-wpl-auction-delhi-capitals-release-2823194-2025-11-20",
      "headline": "Fresh off DC release, Meg Lanning proves she's got it with 135 before WPL auctionsMeg Lanning delivered a WBBL masterclass just days after being released by Delhi Capitals, sending a powerful reminder of her value ahead of the WPL auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-chopra-defends-gambhir-player-rotation-india-transition-phase-2823170-2025-11-20",
      "headline": "Are India experimenting too much with the Test team? Aakash Chopra explainsAakash Chopra has defended Gautam Gambhir's use of 24 players in just 18 months as India's Test coach, saying the churn reflects an unavoidable transition period rather than excessive experimentation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-skips-virat-kohli-hails-joe-root-steve-smith-best-batters-of-generation-2823133-2025-11-20",
      "headline": "Stokes overlooks Kohli, hails Root and Smith as top batters of this generationBen Stokes has identified Joe Root and Steve Smith as the greatest batters of their generation before the opening Ashes Test, leaving out Virat Kohli. England and Australia are set to take on each other in the first Ashes Test on November 21."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-backs-ben-stokes-england-to-win-ashes-in-australia-2823148-2025-11-20",
      "headline": "England have tools to win in Australia: Michael Vaughan backs Ben StokesFormer England captain Michael Vaughan has said he believes the Ben Stokes-led side have \"the tools\" to win their first Ashes series Down Under since 2010–11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/east-bengal-lose-wuhan-jiganda-afc-womens-champions-league-match-report-2823152-2025-11-20",
      "headline": "East Bengal lose 0-2 to Wuhan Jiangda in AFC Women's Champions LeagueEast Bengal were outplayed early but not outclassed entirely, with Panthoi's heroics preventing further damage. Now, everything rests on the Nasaf clash as they fight to keep their knockout dream alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/ayush-shetty-advances-australian-open-quarterfinals-win-kodai-naraoka-2823111-2025-11-20",
      "headline": "Australian Open: Satwik-Chirag and Shetty advance, HS Prannoy bows outAyush Shetty progressed to the Australian Open quarterfinals with a straight-games victory over World No.9 Kodai Naraoka, while top-seeded Satwiksairaj Rankireddy and Chirag Shetty also secured their place in the last eight. HS Prannoy's early exit continued his disappointing run this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendon-mccullum-ashes-2025-26-england-performance-define-progress-2823098-2025-11-20",
      "headline": "England's performance in Ashes 2025 will define their progress: Brendon McCullumEngland head coach Brendon McCullum believes that their performance in the upcoming Ashes tour will define how far this team has come. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-india-batting-coach-kotak-defends-gautam-gambhir-eden-gardens-pitch-criticism-2823076-2025-11-20",
      "headline": "Some people have agendas: India batting coach defends Gambhir over Eden remarksIndia batting coach Sitanshu Kotak strongly defends head coach Gautam Gambhir amid criticism over the Eden Gardens pitch. Kotak suggests criticism is driven by individual agendas and calls it unfair to Gambhir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/east-bengal-lose-wuhan-jiganda-afc-womens-champions-league-match-report-2823152-2025-11-20",
      "headline": "East Bengal lose 0-2 to Wuhan Jiangda in AFC Women's Champions LeagueEast Bengal were outplayed early but not outclassed entirely, with Panthoi's heroics preventing further damage. Now, everything rests on the Nasaf clash as they fight to keep their knockout dream alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/ayush-shetty-advances-australian-open-quarterfinals-win-kodai-naraoka-2823111-2025-11-20",
      "headline": "Australian Open: Satwik-Chirag and Shetty advance, HS Prannoy bows outAyush Shetty progressed to the Australian Open quarterfinals with a straight-games victory over World No.9 Kodai Naraoka, while top-seeded Satwiksairaj Rankireddy and Chirag Shetty also secured their place in the last eight. HS Prannoy's early exit continued his disappointing run this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendon-mccullum-ashes-2025-26-england-performance-define-progress-2823098-2025-11-20",
      "headline": "England's performance in Ashes 2025 will define their progress: Brendon McCullumEngland head coach Brendon McCullum believes that their performance in the upcoming Ashes tour will define how far this team has come. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-india-batting-coach-kotak-defends-gautam-gambhir-eden-gardens-pitch-criticism-2823076-2025-11-20",
      "headline": "Some people have agendas: India batting coach defends Gambhir over Eden remarksIndia batting coach Sitanshu Kotak strongly defends head coach Gautam Gambhir amid criticism over the Eden Gardens pitch. Kotak suggests criticism is driven by individual agendas and calls it unfair to Gambhir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-fitness-update-guwahati-test-sitanshu-kothak-2823067-2025-11-20",
      "headline": "Will Shubman Gill play Guwahati Test? India batting coach gives updateIndia batting coach Sithanshu Kothak said that a call on Shubman gill's participation for the Guwahati Test will be made on the eve of the match. Gill's fitness continues to be monitored as he was absent for most of the Kolkata Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-sanju-samson-wear-csk-yellow-jersey-chennai-super-kings-2823062-2025-11-20",
      "headline": "Feel like a champion: Sanju Samson dons CSK's yellow jersey ahead of IPL 2026Sanju Samson has finally donned the iconic Chennai Super Kings yellow, and the India wicketkeeper-batter says the moment feels every bit as surreal and powerful as he had imagined over the years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-ashes-ambition-england-captain-wants-history-in-australia-2823031-2025-11-20",
      "headline": "England captain Ben Stokes desperate to win Ashes in Australia: Our chance at historyBen Stokes has said that he is desperate to join the elite list of England captains who have won an Ashes in Australia, ahead of the first Test in Perth. Stokes has been a key player in the Ashes over the past few years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-steve-smith-brutal-response-monty-panesar-sandpaper-sledge-2822994-2025-11-20",
      "headline": "Steve Smith recalls Panesar's embarrassing quiz show after sandpaper sledgeAshes: Steve Smith has responded to Monty Panesar's sandpaper sledge by recalling the former England spinner's awkward appearance on a British quiz show, adding early spice to the build up to the first Test in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/arshad-nadeem-world-championships-struggle-surgery-recovery-update-2822997-2025-11-20",
      "headline": "Arshad Nadeem yet to get over World Athletics Championships disappointmentParis Olympics Champion Arshad Nadeem said that he is yet to get over his poor performance during the World Athletics Championship in Tokyo earlier this year. Nadeem got eliminated early as he struggled during the four throws he put in during the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/azhar-ali-resigns-pcb-selection-committee-sarfaraz-ahmed-pakistan-shaheens-under-19-2822986-2025-11-20",
      "headline": "Former Pakistan captain Azhar Ali resigns from PCB selection panelFormer Pakistan captain Azhar Ali has resigned from his roles in the Pakistan Cricket Board's selection committee and youth development setup. His decision comes in the wake of Sarfaraz Ahmed being handed full control of the Pakistan Shaheens and Under-19 teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-india-to-do-list-guwahati-test-vs-south-africa-2822962-2025-11-20",
      "headline": "No 2.5 day lottery, Gill replacement: Chopra on India's to-do list for 2nd TestAakash Chopra has revealed what India will need to do ahead of the second Test against South Africa in Guwahati. Chopra also named the player that India should use to replace Shubman Gill in the lineup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/cadillac-f1-wont-settle-for-back-grid-role-graeme-lowdon-2822957-2025-11-20",
      "headline": "Cadillac F1 not going to settle for a long-term back-grid role, says Graeme LowdonGraeme Lowdon says Cadillac F1 will enter the 2026 season focused on execution and rapid development, insisting the new team has no intention of settling into a long-term back-grid position despite the challenges of joining Formula One."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}