{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-real-estate-developers-eye-big-sales-as-debt-hits-historic-low-2780470-2025-09-02",
      "headline": "Top real estate developers eye Rs 1.5 lakh crore sales as debt hits historic lowFresh data from ANAROCK Research shows that the top 10 listed players have already achieved nearly 30% (Rs 44,317 crore) of their combined Rs 1.49 lakh crore pre-sales target for FY26 in just the first quarter. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-200-points-nifty-above-24600-reliance-gains-over-1-2780452-2025-09-02",
      "headline": "Sensex, Nifty open higher ahead of GST Council meet as investors eye major tax cutsThe S&P BSE Sensex gained around 200 points in early trade, while the NSE Nifty50 hovered above 24,600. Broader markets mirrored the upbeat sentiment, extending gains from the previous session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nestle-fires-ceo-over-workplace-relationship-appoints-successor-glbs-2780395-2025-09-02",
      "headline": "Nestlé fires CEO over workplace relationship, appoints successorNestle has dismissed CEO Laurent Freixe for an undisclosed relationship with a subordinate, appointing longtime executive Philipp Navratil as successor. Chairman Paul Bulcke called the move necessary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/gold-prices-soar-to-all-time-high-rupee-hits-record-low-ahead-of-festive-season-2780243-2025-09-01",
      "headline": "Gold prices soar to all-time high, Rupee hits record low ahead of festive seasonAhead of the festive season, prices for precious metals have hit record highs while the Indian rupee has fallen to an all-time low. Gold crossed the ₹1,04,000 per 10 grams mark, and silver leaped past ₹1,20,000 per kilo, driven by tariff uncertainties and safe-haven demand. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-cut-low-tax-shampoo-tv-hybrid-car-175-items-festive-season-pm-modi-consumption-boost-2780246-2025-09-01",
      "headline": "Shampoos, TVs, hybrid cars to get cheaper as government plans GST cutThe biggest reform of the goods and services tax system in nearly a decade comes amid strained trade ties with the US, with PM Modi making repeated calls for increased use of Indian products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-defence-amca-fighter-jets-bid-project-rs-15000-crore-rajnath-singh-2780209-2025-09-01",
      "headline": "Adani Defence to join race for AMCA stealth fighter jet contractThe AMCA project is being led by the Aeronautical Development Agency (ADA), which functions under the Defence Research and Development Organisation (DRDO)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gst-collection-rises-65-percent-in-august-to-rs-186-lakh-crore-2780159-2025-09-01",
      "headline": "India's GST collection rises 6.5% in August to Rs 1.86 lakh croreGST growth was highest in Sikkim (39%), Meghalaya (35%) and Nagaland (33%). Among big states, Maharashtra, Karnataka, Tamil Nadu and UP posted 9–15% gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-clarifies-on-google-play-alert-no-issues-with-paytm-upi-2780091-2025-09-01",
      "headline": "Paytm clarifies on Google Play alert, no issues with Paytm UPIPaytm noted that this transition is part of its migration to new UPI handles after receiving approval from the National Payments Corporation of India (NPCI) to operate as a Third Party Application Provider (TPAP). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-554-points-higher-nifty-above-24600-mahindra-gains-4-percent-2780080-2025-09-01",
      "headline": "Sensex closes 554 points higher, Nifty above 24,600; Mahindra gains 4%The S&P BSE Sensex gained 554.84 points to close at 80,364.49, while the NSE Nifty50 added 198.20 points to close at 24,625.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-india-rely-on-china-for-trade-amid-trumps-50-tariff-tsunami-2780065-2025-09-01",
      "headline": "Can India rely on China to counter Trump's 50% tariff shock?With US tariffs hitting 50% and Indian exporters scrambling, turning to China may seem tempting. But the strategic and economic risks are real. But can India really rely on China as trade tensions escalate with the US after Donald Trump's tariff tsunami?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hardeep-singh-puri-russia-oil-profit-india-us-tariff-sco-meet-pm-modi-vladimir-putin-china-2780079-2025-09-01",
      "headline": "Is India profiting from Russian oil? Union Minister Hardeep Singh Puri explainsUS President Donald Trump recently announced new tariffs on exports in an effort to discourage India's oil imports from Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-to-avoid-a-defective-itr-filing-explains-tax-expert-2780060-2025-09-01",
      "headline": "How to avoid a 'defective' ITR filing, explains tax expertFiling your income tax return is more than just declaring income and paying taxes. Missing key disclosures can make your ITR \"defective\" and even attract steep penalties, warns tax expert. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-satyamev-jayate-helped-me-come-out-trans-actor-trinetra-haldar-2780469-2025-09-02",
      "headline": "Aamir's Satyamev Jayate helped me come out to parents: Trans actor Trinetra HaldarTrans actor Trinetra Haldar shared a heartfelt note after she met Aamir Khan recently. Haldar credited Khan's popular show 'Satyamev Jayate' for coming out to her parents. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/punjab-floods-diljit-dosanjh-ammy-virk-sonam-bajwa-relief-support-2780450-2025-09-02",
      "headline": "Punjab floods: Diljit Dosanjh, Ammy adopt villages, Sonam supports relief groupsActors Diljit Dosanjh, Ammy Virk and Sonam Bajwa have extended support to flood victims in Punjab. Dosanjh has adopted 10 villages, while Virk is supporting 200 families. Bajwa has donated to organisations who are actively working on the ground as rescue teams."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-day-8-episode-9-written-update-neelam-giri-farrhana-bhat-baseer-ali-kunickaa-sadanand-2780431-2025-09-02",
      "headline": "Bigg Boss 19 episode 9: Neelam breaks down, Farrhana clashes with Baseer, KunickaaEpisode 9 of 'Bigg Boss 19' saw Neelam Giri breaking down after a fight with Farrhana Bhatt. Tanya Mittal was confronted over the cleaning room mess. Kunickaa Sadanand was stripped of her captaincy following a vote. Also, a major fight broke out between Farrhana and Baseer Ali. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-birthday-wishes-pawan-kalyan-film-political-service-2780445-2025-09-02",
      "headline": "Chiranjeevi's birthday wish to Pawan Kalyan is pure brother goals. See picMegastar Chiranjeevi shared a warm birthday wish to his brother, Pawan Kalyan, with a throwback picture. In his post, he acknowledged his contributions to cinema and politics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/milap-zaveri-thanks-riteish-deshmukh-reviving-career-with-masti-4-2780451-2025-09-02",
      "headline": "Riteish Deshmukh backed me when no one did: Milap Zaveri on career comebackFilmmaker Milap Zaveri dedicated an emotional note to Ritesh Deshmukh as the actor wrapped 'Masti 4'. Zaveri credited Deshmukh for reviving his career in the industry when no one showed faith. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/param-sundari-box-office-sidharth-malhotra-janhvi-kapoor-film-struggles-after-weekend-2780442-2025-09-02",
      "headline": "Param Sundari box office Day 4: Monday dip hits Sidharth-Janhvi's rom-com hardSidharth Malhotra and Janhvi Kapoor's 'Param Sundari' witnessed a dip on the first Monday. The film earned Rs 28.19 crore in four days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-kalyani-priyadarshan-rs-30-crore-in-5-days-mohanlal-hridayapoorvam-underperforms-2780441-2025-09-02",
      "headline": "Lokah mints Rs 30 crore in 5 days, Mohanlal's Hridayapoorvam underperforms on MondayKalyani Priyadarshan's 'Lokah Chapter 1: Chandra' earned Rs 30 crore in five days and had a solid Monday in theatres. However, Mohanlal's 'Hridayapoorvam's' collection declined on its first Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dwayne-johnson-the-smashing-machine-venice-film-festival-emotional-ovation-2780414-2025-09-02",
      "headline": "Dwayne Johnson in tears over 15-min ovation for The Smashing Machine at Venice FestDwayne Johnson's portrayal of Mark Kerr in 'The Smashing Machine' received a 15-minute standing ovation at the Venice Film Festival, fuelling Oscar buzz. The actor and the entire team werre visibly emotional. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/vijay-sethupathi-to-host-bigg-boss-tamil-9-makers-reveal-neon-logo-2780320-2025-09-01",
      "headline": "Vijay Sethupathi to host Bigg Boss Tamil 9, makers reveal neon logoAfter eight successful seasons, 'Bigg Boss Tamil' returns for its ninth edition. Actor Vijay Sethupathi will once again be at the helm."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-to-shilpa-shetty-bollywood-celebs-extend-support-to-punjab-flood-victims-2780301-2025-09-01",
      "headline": "Sonu Sood to Shilpa Shetty, Bollywood celebs extend support to Punjab flood victimsPunjab is battling one of its worst flood crises, leaving thousands displaced and homes destroyed. Celebrities like Sonu Sood, Sanjay Dutt, Shilpa Shetty, and Himanshi Khurana have stepped forward with prayers, support, and aid for the affected families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ram-kapoor-shares-towel-selfie-on-52nd-birthday-says-he-feels-younger-2780259-2025-09-01",
      "headline": "Ram Kapoor shares towel selfie on 52nd birthday, says he feels youngerRam Kapoor celebrated his 52nd birthday with a towel selfie. He flaunted his 50-kilo weight loss and saying he feels healthier and younger than in 25 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sumona-chakravarti-alleges-car-mobbed-by-maratha-quota-protesters-2779945-2025-09-01",
      "headline": "Sumona Chakravarti alleges car mobbed by Maratha protesters, raises safety concernsActor Sumona Chakravarti shared that her car was mobbed in broad daylight by Maratha quota protesters in South Mumbai, leaving her feeling unsafe and vulnerable. She criticised the lack of police presence and called the incident a mockery of law, order, and civic responsibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saloni-chopra-slams-alleged-abuser-zain-khan-durrani-casting-songs-of-paradise-me-too-2780237-2025-09-01",
      "headline": "Saloni Chopra slams alleged abuser Zain Khan Durrani's casting in Songs of ParadiseActor and filmmaker Saloni Chopra has criticised Prime Video's 'Songs of Paradise' for casting her alleged abuser Zain Khan Durrani, whom she had accused of violence during the MeToo movement in 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anushka-shetty-opens-up-about-violence-in-ghaati-promises-more-films-ahead-2780266-2025-09-01",
      "headline": "Anushka Shetty opens up about violence in Ghaati, promises more films aheadAnushka Shetty's light-hearted banter with Rana Daggubati turned into a candid reveal, as she spoke about choosing stronger scripts and appearing more often on screen. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-enjoys-ganesh-chaturthi-with-mother-in-law-neetu-kapoor-relishes-modaks-2780263-2025-09-01",
      "headline": "Alia Bhatt enjoys Ganesh Chaturthi with mother-in-law Neetu Kapoor, relishes modaksAlia Bhatt shares intimate moments from her Ganesh Chaturthi celebration with Neetu Kapoor, highlighting family warmth and upcoming film projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-asks-for-13-year-old-racing-prodigy-jaden-immanuels-autograph-2780233-2025-09-01",
      "headline": "Ajith Kumar asks for 13-year-old racing prodigy Jaden Immanuel's autographTamil actor Ajith Kumar, who turned professional racer in 2025, recently met Jaden Immanuel, a 13-year-old MotoGP racer from Chennai competing in Germany, and asked the young racer for his autograph. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tanya-mittal-wants-to-be-next-kartik-aaryan-says-enough-of-playing-strong-woman-2780250-2025-09-01",
      "headline": "Tanya Mittal wants to be next Kartik Aaryan, says enough of playing strong woman'Bigg Boss 19' contestant Tanya Mittal, an entrepreneur-turned-influencer from Gwalior, is already making waves in Salman Khan's reality show. In an interview with us, she promises fearless opinions, viral moments, and a clear dream of becoming the next superstar after Kartik Aaryan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ozzy-osbourne-wife-sharon-osbourne-reacts-to-husband-death-2780219-2025-09-01",
      "headline": "Don't wanna say goodbye: Sharon Osbourne reacts to husband Ozzy's deathSharon Osbourne has publicly acknowledged the death of her husband Ozzy Osbourne, reacting to a heartfelt tribute posted on his official Instagram. The legendary singer died after battling Parkinson's disease. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/riddhima-kapoor-debut-bollywood-film-neetu-kapoor-kapil-sharma-exclusive-interview-meant-to-be-2775251-2025-09-01",
      "headline": "Riddhima Kapoor on debut film with Neetu Kapoor, Kapil Sharma: Happened so suddenlyRiddhima Kapoor makes her acting debut alongside mother Neetu Kapoor in a heartfelt family film. The project highlights rare mother-daughter chemistry and a close-knit cast experience in Shimla."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/flood-fears-grip-delhi-as-yamuna-swells-gurugram-shuts-schools-offices-2780415-2025-09-02",
      "headline": "Floodwaters enter Delhi homes as Yamuna swells; Gurugram shuts schools, officesDelhi faces a deepening flood threat as the Yamuna river crossed the danger mark of 205.33 metres early Tuesday, with officials warning levels could touch 206.50 metres by evening. Meanwhile, Gurugram was pounded by over 100 mm of rain in just four hours on Monday, leaving key stretches such as Hero Honda Chowk and the Dwarka Expressway waterlogged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/scott-bessent-backs-us-india-ties-hits-russian-oil-trade-glbs-2780400-2025-09-02",
      "headline": "India a bad actor: Trump aide fumes over oil buys, calls SCO meet 'performative'Treasury Secretary Scott Bessent, addressing the state of bilateral ties, downplayed concerns about Prime Minister Narendra Modi's participation in a recent meeting with Russian President Vladimir Putin and Chinese President Xi Jinping."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manoj-jarange-maratha-quota-protest-azad-maidan-clean-up-bmc-police-notice-protesters-vacate-site-hunger-strike-2780461-2025-09-02",
      "headline": "Clean-up begins at Manoj Jarange's quota stir site in Mumbai after clear-out orderThe Bombay High Court ordered Maratha quota protestors to vacate Mumbai streets by Tuesday noon. Following this, the civic body said it conducted a deep cleaning drive at Azad Maidan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pawan-khera-dual-epic-numbers-voter-ids-delhi-amit-malviya-vote-chori-charge-2780460-2025-09-02",
      "headline": "Quintessential vote chor: Amit Malviya claims Pawan Khera holds 2 voter IDsThe EPIC details shared by Amit Malviya on X show that Congress spokesperson Pawan Khera is registered as a voter in two Assembly constituencies in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-sco-summit-china-president-xi-russia-vladimir-putin-multipolarism-trump-tariff-unipolar-stance-explained-2779993-2025-09-02",
      "headline": "Is this the new world order you're looking at?PM Modi's jovial photo with Russian President Vladimir Putin and Chinese leader Xi Jinping at the SCO summit signals a deeper geopolitical shift. India's assertion of its strategic autonomy amid Trump tariffs finds resonance in China and Russia pushing back against US bullying. This is possibly leading to a new world order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-floods-rain-hoshiarpur-aap-bhagwant-mann-pm-modi-relief-rescue-funds-2780436-2025-09-02",
      "headline": "Punjab floods may worsen: Bhagwant Mann as 29 dead, thousands lose homes in a weekPunjab Flood: Fresh rains on Monday worsened flooding in already affected areas in Punjab. Such was the severity of the crisis that PM Modi, on his return from China, called up Bhagwant Mann to take stock of the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jannik-sinner-ai-quarter-finals-win-alexander-bublik-2780417-2025-09-02",
      "headline": "AI-like Sinner decimates Alexander Bublik; Kazakh left stunned: This is insaneDefending US Open champion Jannik Sinner extended his dominant run at hardcourt Grand Slams with a commanding 6-1, 6-1, 6-1 victory over Kazakhstan's 23rd seed Alexander Bublik on Tuesday to reach the quarter-finals at Flushing Meadows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-has-offered-to-cut-tariffs-to-nothing-but-its-getting-late-trumps-claim-hours-after-pm-putin-meet-2780265-2025-09-01",
      "headline": "India offered zero tariffs, but it's late: Trump's big claim after PM-Putin meetDonald Trump reiterated unsubstantiated claims against India, calling trade a \"one-sided disaster\" and alleging that New Delhi had offered to cut tariffs to zero, but said it was too late."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/gurugram/video/video-people-stuck-for-hours-as-massive-traffic-jam-grips-gurugram-after-heavy-rain-2780376-2025-09-01",
      "headline": "Video: People stuck for hours in '20-km' traffic jam in Gurugram after heavy rainMotorists were stuck for hours as vehicular movement came to a grinding halt on National Highway – 8 in Haryana's Gurugram on Monday evening following a heavy downpour which lashed the Millenium City for about four hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-manipur-visit-september-13-ethnic-violence-mizoram-trip-bjp-2780464-2025-09-02",
      "headline": "PM likely to visit Mizoram, violence-hit Manipur in second week of SeptemberThe Prime Minister will inaugurate development projects in Mizoram and will then be visiting Manipur for the first time since the ethnic violence in 2023. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/news/story/schools-closed-in-punjab-gurugram-jammu-chandigarh-up-amid-heavy-rain-2780474-2025-09-02",
      "headline": "Schools closed in Punjab, Gurugram, Jammu, Chandigarh, UP amid heavy rainHeavy rains and flooding have forced multiple states and cities across North India to shut schools today, September 2, 2025. While Delhi NCR remains under an orange alert, the capital has not yet announced any holiday for students.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-mitchell-starc-t20i-retirement-focus-tests-odi-world-cup-2780412-2025-09-02",
      "headline": "Mitchell Starc announces retirement from T20Is to focus on Tests, ODI World CupMitchell Starc has retired from T20 internationals, bringing an end to a career that spanned 65 matches in the shortest format. The left-arm quick confirmed his decision in order to prioritise Australia's demanding Test calendar from late 2026 onwards and to keep himself in peak condition for the 2027 ODI World Cup."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/punjab-floods-diljit-dosanjh-ammy-virk-sonam-bajwa-relief-support-2780450-2025-09-02",
      "headline": "Punjab floods: Diljit Dosanjh, Ammy adopt villages, Sonam supports relief groupsActors Diljit Dosanjh, Ammy Virk and Sonam Bajwa have extended support to flood victims in Punjab. Dosanjh has adopted 10 villages, while Virk is supporting 200 families. Bajwa has donated to organisations who are actively working on the ground as rescue teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-sacrificed-india-ties-for-family-pakistan-deals-former-biden-era-us-nsa-jake-sullivan-2780258-2025-09-01",
      "headline": "Trump sacrificed India ties for family's Pak deals: Ex-US NSA Jake SullivanUS President Donald Trump has sacrificed India ties for his family's business deals with Pakistan, said Biden-era NSA Jake Sullivan. In an outright conflict of interest, the Trump family is involved in a crypto venture in Pakistan even as the US President mollycoddles Pakistani army chief Asim Munir. The US should have boosted technology, talent and economic ties with India, said Sullivan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kanpur-uttar-pradesh-man-kidnapped-thrashed-tied-up-beheaded-friend-sister-recently-came-out-of-jail-recorded-video-2780443-2025-09-02",
      "headline": "UP man kidnapped, tied up, beheaded over relationship with friend's sisterRishikesh was in a relationship with key accused Pawan and Bobby's sister. Pawan learnt about the same after he came out of jail recently, and plotted the murder soon after as he was angered by their relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nestle-fires-ceo-over-workplace-relationship-appoints-successor-glbs-2780395-2025-09-02",
      "headline": "Nestlé fires CEO over workplace relationship, appoints successorNestle has dismissed CEO Laurent Freixe for an undisclosed relationship with a subordinate, appointing longtime executive Philipp Navratil as successor. Chairman Paul Bulcke called the move necessary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/oneplus-pad-3-price-in-india-announced-sales-to-start-from-september-5-2780487-2025-09-02",
      "headline": "OnePlus Pad 3 price in India announced, sales to start from September 5 OnePlus has finally announced the price and availability of its new tablet, the OnePlus Pad 3, for the Indian market. Here is everything you need to know about it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/donald-trump-aide-peter-pavarro-remarks-trying-chaos-india-brahmin-caste-class-divide-opposition-rahul-gandhi-ammo-2780066-2025-09-01",
      "headline": "Is Trump trying to sow chaos in India?There is a definite pattern to the terms being used by Trump administration functionaries, including Peter Navarro, to attack India and PM Modi. Trump cronies are directly addressing Indians and trying to exploit the country's caste and class fault lines. This after the US injected chaos into Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-woman-spots-missing-husband-on-instagram-reel-finds-out-he-has-another-wife-2780437-2025-09-02",
      "headline": "UP woman spots missing husband on Instagram reel, finds out he has another wifeA woman in UP found her husband, who had been missing for 7 years, in an Instagram reel with another woman. The man had staged his disappearance and married someone else."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-param-sundari-is-all-show-and-little-soul-2780218-2025-09-01",
      "headline": "Why 'Param Sundari' is all show and little soulParam Sundari's narrative, set in stereotyped Kerala, doesn't quite make hearts flicker; the Janhvi Kapoor-Sidharth Malhotra jodi isn't a fun opposites-attract story either\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/besan-chilla-protein-fibre-benefits-weight-loss-suji-chilla-2780483-2025-09-02",
      "headline": "Besan chilla is better for weight loss than suji chillaBoth suji (semolina) and besan (gram flour) chillas are popular healthy breakfast choices in Indian homes. But when it comes to weight loss, which one should you pick? Here's a detailed comparison to help you decide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/openai-plans-giant-1-gw-ai-data-centre-in-india-sam-altman-may-reveal-details-soon-2780453-2025-09-02",
      "headline": "OpenAI plans giant 1 GW AI data centre in India, Sam Altman may reveal details soonOpenAI, the creator of ChatGPT, is preparing for a big move in India with plans to build one of the country's largest artificial intelligence data centres. The facility is expected to have at least 1 gigawatt of capacity, making it a project of huge scale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-felix-auger-aliassime-andrey-rublev-us-open-2025-quarterfinals-wins-2780393-2025-09-02",
      "headline": "Iga Swiatek marches into quarters, Felix Auger Aliassime stuns Andrey RublevWorld No.2 Iga Swiatek and Canada's Felix Auger-Aliassime have reached the US Open 2025 quarterfinals with impressive wins against Ekaterina Alexandrova and Andrey Rublev respectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/polish-woman-shocks-kerala-children-by-speaking-malayalam-priceless-reaction-video-viral-2780485-2025-09-02",
      "headline": "Polish woman shocks Kerala children by speaking Malayalam. Video goes viralA Polish woman posted a video where she decided to surprise children at a wedding in Kerala by speaking to them in Malayalam. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-out-india-new-zealand-series-virat-rohit-back-injury-2780484-2025-09-02",
      "headline": "Cummins to miss Virat Kohli, Rohit Sharma's comeback series due to back injuryAustralia's ODI captain Pat Cummins will miss India's much-anticipated white-ball series, which marks the return of Virat Kohli and Rohit Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/karolina-muchova-us-open-ex-boyfriend-tears-reveals-reason-2780454-2025-09-02",
      "headline": "Ex-boyfriend in the crowd: Tennis star reveals why she broke down in tearsUS Open 2025: 11th seed Karolína Muchová has explained why she broke down in tears during her second-round match last week. The Czech star revealed that she had spotted her ex-boyfriend in the stands. Muchova will now face Naomi Osaka on Wednesday for a place in the semi-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-craig-mcmillan-assistant-coach-women-world-cup-2024-2780444-2025-09-02",
      "headline": "New Zealand name Craig McMillan full-time assistant for Women's World CupFormer New Zealand batter Craig McMillan has been confirmed as the full-time assistant coach of the White Ferns after signing a new deal ahead of the ICC Women's ODI World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-t20i-retirement-explains-call-odi-world-cup-india-tour-2780438-2025-09-02",
      "headline": "Starc explains big retirement call, targets India tour and World Cup in 2027Mitchell Starc retired from T20 internationals, five months before the T20 World Cup in India and Sri Lanka. The 35-year-old fast bowler reiterated his commitment to playing Tests and one-dayers for Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-2025-india-pool-stage-review-harmanpreet-singh-craig-fulton-2780424-2025-09-02",
      "headline": "India ace pool stage test, but bigger battles await in Asia Cup Super 4sIndia made it three out of three with a rampant win over Kazakhstan to head into the Super 4s with a lot of momentum. However, the hosts have a lot of things to sort out ahead of the crucial ties in the Asia Cup 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jannik-sinner-ai-quarter-finals-win-alexander-bublik-2780417-2025-09-02",
      "headline": "AI-like Sinner decimates Alexander Bublik; Kazakh left stunned: This is insaneDefending US Open champion Jannik Sinner extended his dominant run at hardcourt Grand Slams with a commanding 6-1, 6-1, 6-1 victory over Kazakhstan's 23rd seed Alexander Bublik on Tuesday to reach the quarter-finals at Flushing Meadows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-mitchell-starc-t20i-retirement-focus-tests-odi-world-cup-2780412-2025-09-02",
      "headline": "Mitchell Starc announces retirement from T20Is to focus on Tests, ODI World CupMitchell Starc has retired from T20 internationals, bringing an end to a career that spanned 65 matches in the shortest format. The left-arm quick confirmed his decision in order to prioritise Australia's demanding Test calendar from late 2026 onwards and to keep himself in peak condition for the 2027 ODI World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/transfer-deadline-isak-liverpool-donnarumma-city-manchester-united-lammens-guehi-deal-collapses-2780411-2025-09-02",
      "headline": "Isak joins Liverpool, Manchester United sign Lammens, Guehi deal collapsesLiverpool completed the British record signing of Alexander Isak for £125 million on deadline day. The transfer highlights a record-breaking £3 billion spending spree across the Premier League, reshaping squads and stirring last-minute drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-coco-gauff-naomi-osaka-quarterfinals-2780397-2025-09-02",
      "headline": "Naomi Osaka stuns Coco Gauff, returns to Grand Slam quarters after 1658 daysUS Open 2025: Naomi Osaka stunned Coco Gauff, beating her American opponent in straight sets in the Round of 16 clash to qualify for the quarter-finals of the hard-court major. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/antony-real-betis-transfer-manchester-united-permanent-move-deadline-day-2780396-2025-09-02",
      "headline": "Antony seals permanent move to Real Betis after forgetful Manchester United spellAntony ends a turbulent Manchester United spell, sealing a permanent €25 million move to Real Betis. The Brazilian winger aims to revive his career in Spain after a successful loan, ready to make an impact in LaLiga."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-felix-auger-aliassime-andrey-rublev-us-open-2025-quarterfinals-wins-2780393-2025-09-02",
      "headline": "Iga Swiatek marches into quarters, Felix Auger Aliassime stuns Andrey RublevWorld No.2 Iga Swiatek and Canada's Felix Auger-Aliassime have reached the US Open 2025 quarterfinals with impressive wins against Ekaterina Alexandrova and Andrey Rublev respectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-mitchell-starc-t20i-retirement-focus-tests-odi-world-cup-2780412-2025-09-02",
      "headline": "Mitchell Starc announces retirement from T20Is to focus on Tests, ODI World CupMitchell Starc has retired from T20 internationals, bringing an end to a career that spanned 65 matches in the shortest format. The left-arm quick confirmed his decision in order to prioritise Australia's demanding Test calendar from late 2026 onwards and to keep himself in peak condition for the 2027 ODI World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/transfer-deadline-isak-liverpool-donnarumma-city-manchester-united-lammens-guehi-deal-collapses-2780411-2025-09-02",
      "headline": "Isak joins Liverpool, Manchester United sign Lammens, Guehi deal collapsesLiverpool completed the British record signing of Alexander Isak for £125 million on deadline day. The transfer highlights a record-breaking £3 billion spending spree across the Premier League, reshaping squads and stirring last-minute drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-coco-gauff-naomi-osaka-quarterfinals-2780397-2025-09-02",
      "headline": "Naomi Osaka stuns Coco Gauff, returns to Grand Slam quarters after 1658 daysUS Open 2025: Naomi Osaka stunned Coco Gauff, beating her American opponent in straight sets in the Round of 16 clash to qualify for the quarter-finals of the hard-court major. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/antony-real-betis-transfer-manchester-united-permanent-move-deadline-day-2780396-2025-09-02",
      "headline": "Antony seals permanent move to Real Betis after forgetful Manchester United spellAntony ends a turbulent Manchester United spell, sealing a permanent €25 million move to Real Betis. The Brazilian winger aims to revive his career in Spain after a successful loan, ready to make an impact in LaLiga."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-felix-auger-aliassime-andrey-rublev-us-open-2025-quarterfinals-wins-2780393-2025-09-02",
      "headline": "Iga Swiatek marches into quarters, Felix Auger Aliassime stuns Andrey RublevWorld No.2 Iga Swiatek and Canada's Felix Auger-Aliassime have reached the US Open 2025 quarterfinals with impressive wins against Ekaterina Alexandrova and Andrey Rublev respectively. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}