{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-dips-800-points-investors-traders-volatile-market-strategy-2623124-2024-10-25",
      "headline": "Sensex sinks 800 points: How investors can stay safe in volatile marketStock market bloodbath: This year's pre-Diwali period has been especially challenging for benchmark indices, with the Sensex and Nifty heading toward their steepest October decline since the Covid-driven crash in 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-rs-10000-crore-will-tito-shantanu-naidu-who-gets-what-2623105-2024-10-25",
      "headline": "Ratan Tata's Rs 10,000 crore will: Who gets whatRatan Tata died on October 9 in Mumbai and left a Rs 10,000 crore will, which includes provisions for his near and dear ones. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dixon-technologies-shares-fall-over-9-percent-after-rally-short-lived-hit-record-high-should-you-buy-2623056-2024-10-25",
      "headline": "Explained: Why Dixon Technologies share price tumbled over 9% after early rallyThe company's stock reached a peak of Rs 15,999.95, rising by 6.21% after releasing impressive Q2 earnings on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-opens-for-bidding-subscribe-skip-good-bad-latest-gmp-review-2623022-2024-10-25",
      "headline": "Afcons Infrastructure IPO opens for bidding: Should you subscribe or skip? Afcons Infrastructure's IPO consists of a fresh issue of 2.7 crore shares, totalling Rs 1,250.00 crore, and an offer for sale of 9.03 crore shares, amounting to Rs 4,180.00 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-check-latest-gmp-stock-market-debut-date-and-expected-listing-gains-2623028-2024-10-25",
      "headline": "Waaree Energies IPO: Check GMP, allotment details, listing date and expected gainsWaaree Energies IPO: With allotments finalised on October 24, the public issue is expected to have a bumper listing on October 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-is-vidya-mukesh-ambani-twist-on-chipmaker-name-delights-ceo-jensen-huang-ai-summit-2622986-2024-10-25",
      "headline": "Nvidia is Vidya: Mukesh Ambani's twist on chipmaker's name delights Jensen HuangMukesh Ambani, Chairman of Reliance Industries explained that in Indian culture, knowledge (Vidya) is believed to attract wealth, symbolised by Goddess Lakshmi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-stock-market-falling-key-reasons-behind-decline-foreign-investors-fiis-volatility-overvaluation-2622987-2024-10-25",
      "headline": "Sensex drops below 80,000 as market slide continues. What's behind the dip? Sensex plunges below 80,000. What's fueling the sharp decline? Check the key factors behind the distress on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-price-declines-18-percent-q2-net-profit-tumbles-buy-hold-sell-brokerage-views-2622974-2024-10-25",
      "headline": "IndusInd Bank share price dips 18% after Q2 results. Should you buy, sell or hold?In the second quarter, IndusInd Bank's net profit plunged 39% year-on-year to Rs 1,325 crore, falling significantly short of what the market had expected. In comparison, the profit stood at Rs 2,181.47 crore in the same quarter a year ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-volatility-itc-indusind-bank-share-price-q2-results-2622971-2024-10-25",
      "headline": "Sensex, Nifty continue slide amid volatility; IndusInd Bank tumbles 15%The S&P BSE Sensex was down 370.19 points to 79,694.97 at 10:02 am, while the NSE Nifty50 declined 141 points to trade at 24,258.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-25-2024-precious-metals-witness-dip-on-mcx-latest-rates-2622961-2024-10-25",
      "headline": "Gold, silver price today, October 25, 2024: Precious metals witness dip on MCXGold Price Today October 25, 2024: Both gold and silver are trading on the lower side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-canada-tensions-hit-trade-leaving-business-owners-in-a-bind-2622688-2024-10-24",
      "headline": "India-Canada tensions hit trade, leaving business owners in a bindTotal trade between both nations since 2021, was at roughly $6 billion, increased to $9 billion in 2022, but dropped to $8 billion in 2023 as per data from the consulate general of India on commerce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-mukesh-ambani-nvidia-jensen-huang-partner-to-build-large-scale-ai-infrastructure-in-india-2622561-2024-10-24",
      "headline": "Reliance, Nvidia partner to build large-scale AI infrastructure in IndiaThe partnership will see Reliance deploying Nvidia's latest GB 200 supercomputer technology to build a massive AI infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-listing-date-expectations-double-investors-wealth-listing-over-rs-3000-latest-gmp-2622558-2024-10-24",
      "headline": "Waaree Energies IPO to double investors wealth? Here is what we knowWith the latest grey market premium (GMP) suggesting a sharp increase, Waaree Energies IPO is expected to deliver substantial returns to investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-fmcg-stocks-hul-nestle-india-top-losers-2622526-2024-10-24",
      "headline": "Sensex, Nifty end flat as FMCG stocks fall; HUL, Nestle India top losersThe S&P BSE Sensex was down 16.82 points to 80,065.16 at the closing bell, while the NSE Nifty50 ended 36.10 points lower at 24,399.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-platform-fee-hike-details-share-price-falls-q2fy25-results-brokerage-2622510-2024-10-24",
      "headline": "Not a rumour: Zomato clarifies on platform fee hike, shares tumble 4%In its statement, Zomato highlighted that the information about the fee hike was sourced directly from its public mobile application."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nvidia-ceo-jensen-huang-ai-plans-in-india-making-ai-and-exporting-intelligence-2622492-2024-10-24",
      "headline": "Nvidia CEO's AI Plans in India: Making AI and exporting intelligenceHe pointed out that India possesses the crucial elements needed for AI development: data, energy resources, and infrastructure, that can be created."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-ceo-aims-for-expanded-growth-in-india-through-new-partnerships-2622409-2024-10-24",
      "headline": "Nvidia CEO Jensen Huang aims for growth in India through new partnershipsIndia is seen as a key player in the AI market, with its population of 1.4 billion increasingly adopting AI across various sectors such as agriculture, education, and manufacturing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-share-allotment-status-multibagger-listing-gmp-key-details-2622393-2024-10-24",
      "headline": "Waaree Energies share allotment: GMP signals multibagger listing, details hereWaaree Energies IPO share allotment: The IPO was open for subscription from October 21 to October 23, offering shares within a fixed price range of Rs 1,427-1,503 per share."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hindalco-industries-share-price-falls-7-percent-early-trade-today-explained-2622344-2024-10-24",
      "headline": "Explained: Why Hindalco shares plunged over 7% in early trade todayHindalco Industries share price: By around 12:38 am, shares of Hindalco Industries were trading at Rs 683.50, reflecting a 4.73% decrease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/deepak-builders-engineers-ipo-allotment-check-status-gmp-expected-listing-gains-2622334-2024-10-24",
      "headline": "Deepak Builders & Engineers IPO allotment: Check status, expected listing gainsDeepak Builders & Engineers allotment: Investors who have bid for the IPO can check their allotment status online. They can log in to either the BSE website or the website of Kfin Technologies Limited, the registrar for the issue."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-genuine-is-the-desi-ghee-being-consumed-fake-racket-hathras-investigation-2623023-2024-10-25",
      "headline": "Fake ghee in branded packs: India Today investigation busts scamDesi ghee is now under scrutiny, with fears of rampant adulteration spreading across the country. To investigate these claims, an India Today team travelled to Hathras in Uttar Pradesh and uncovered some disturbing truths about the ghee being sold in the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-canada-row-justin-trudeau-khalistan-extremists-hardeep-nijjar-recalled-envoy-sanjay-verma-2622980-2024-10-25",
      "headline": "Trudeau's circle includes Khalistani extremists, says recalled Indian envoyRecalled Indian High Commissioner to Canada Sanjay Verma said Khalistani extremists were being shielded in Canada by the Trudeau government for domestic political reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/severe-cyclonic-storm-dana-starts-landfall-process-at-odisha-coast-2622860-2024-10-25",
      "headline": "Cyclone Dana: 1 dead in Bengal, rain batters Odisha, airport ops resume  Live UpdatesThe coastal districts of Odisha continued to witness extremely heavy rain and gusty winds reaching speeds of 110 km/h as the severe cyclonic storm Dana made landfall after midnight on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-death-will-share-siblings-dog-tito-butler-cook-part-too-shantanu-naidu-share-dog-lover-prince-charles-2623113-2024-10-25",
      "headline": "In Ratan Tata's will, share not just for siblings but dog Tito and butler tooThe industrialist-philanthropist, Ratan Tata, whose estate is estimated to be around Rs 10,000 crore, has left behind a share not just for his siblings but for his butler, cook and German Shepherd Tito as well. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-slams-trolls-over-botox-gone-wrong-comment-zero-proof-no-confirmation-2623006-2024-10-25",
      "headline": "Alia Bhatt slams trolls over 'botox gone wrong' comment: Zero proof...Actor Alia Bhatt shared a long note on Instagram, hitting back at a viral video where a cosmetologist is seen commenting on the way she speaks and looks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/4-gujarat-residents-siblings-die-car-crashes-into-divider-canada-catches-fire-2623131-2024-10-25",
      "headline": "4 Indians die after their Tesla crashes into divider, catches fire in CanadaAmong those who died were 30-year-old Keta Gohil and 26-year-old Nil Gohil, siblings from Godhra in Gujarat. A woman in her 20s was pulled out of the burning car by a motorist who stopped to help. She was admitted to a hospital with serious but non-life threatening injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/odisha-cyclone-dana-zero-casualties-disaster-management-expertise-2623126-2024-10-25",
      "headline": "Cyclone Dana: How Odisha model helped it achieve 'zero casualty mission'Cyclone Dana news: Odisha is no stranger to deadly cyclones striking its coasts in October. Over the years, Odisha's expertise and resilience in dealing with disasters and minimising casualties have come in for praise. Here is how it tackled Cyclone Dana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/do-patti-review-kajol-kriti-sanon-overdo-it-in-a-relevant-but-predictable-story-2623040-2024-10-25",
      "headline": "Do Patti review: Kajol-Kriti Sanon overdo it in a relevant but predictable storyReleased-Fri Oct 25, 2024Do Patti, starring Kajol, Kriti Sanon and Shaheer Sheikh in the lead, was released on Netflix on October 25. The film deals with an important subject and maintains its sensitivity, but falls victim to its exaggerated performances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/elevating-your-career-with-iim-kozhikodes-advanced-operations-analytics-and-supply-chain-management-programme-2621116-2024-10-22",
      "headline": "Elevating Your Career with IIM Kozhikode's Advanced Operations Analytics and Supply Chain Management ProgrammeElevate your career with IIM Kozhikode's comprehensive programme, designed to equip professionals with the latest tools and strategies in operations management and data analytics. Gain hands-on experience through live sessions, capstone projects, and industry-relevant assignments, while accessing the prestigious IIMK Executive Alumni network. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/noida-women-slap-elderly-couple-viral-video-heated-argument-pet-dog-hyde-park-society-2623151-2024-10-25",
      "headline": "Viral video: Women slap elderly couple during argument over pet dog in Noida societyTwo young women walking their dog in a housing society in Noida were caught on camera slapping an elderly couple during an argument. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-is-vidya-mukesh-ambani-twist-on-chipmaker-name-delights-ceo-jensen-huang-ai-summit-2622986-2024-10-25",
      "headline": "Nvidia is Vidya: Mukesh Ambani's twist on chipmaker's name delights Jensen HuangMukesh Ambani, Chairman of Reliance Industries explained that in Indian culture, knowledge (Vidya) is believed to attract wealth, symbolised by Goddess Lakshmi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasas-crew-8-astronauts-safely-return-to-earth-after-seven-months-in-space-2623065-2024-10-25",
      "headline": "Four Nasa astronauts safely return to Earth after seven months in spaceThe mission was initially planned for a shorter duration but was extended due to delays with Boeing's Starliner spacecraft, which required additional crew support for emergency evacuation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/rhea-chakraborty-lookout-notice-supreme-court-bombay-high-court-sushant-singh-rajput-2623097-2024-10-25",
      "headline": "Top court rejects plea to reinstate lookout notice against actor Rhea ChakrabortyThe Supreme Court observed that the petition to restore the circulars against Rhea Chakraborty in Sushant Singh Rajput death case was \"frivolous\" and filed merely because the accused were \"high-profile\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-stock-market-falling-key-reasons-behind-decline-foreign-investors-fiis-volatility-overvaluation-2622987-2024-10-25",
      "headline": "Sensex drops below 80,000 as market slide continues. What's behind the dip? Sensex plunges below 80,000. What's fueling the sharp decline? Check the key factors behind the distress on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/menendez-brothers-us-parents-sentenced-to-life-imprisonment-murder-prosecutor-los-angeles-release-possibility-2622951-2024-10-25",
      "headline": "Menendez brothers, jailed for life for murdering parents in 1989, may get paroleLyle Menendez, then 21, and Erik Menendez, then 18, admitted they fatally shot their entertainment executive father, Jose Menendez, and their mother, Kitty Menendez, in the family's Beverly Hills home, in 1989."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pink-cocaine-what-is-in-it-liam-payne-drug-tusi-ingredients-2623042-2024-10-25",
      "headline": "Pink cocaine is no cocaine, so what's in the mystery drug?Pink cocaine or tusi had drug enforcement agencies on their toes, but alarm bells started ringing after the death of One Direction singer Liam Payne. What makes pink cocaine deadly is, other than the underground chemist, no one knows what's in the concoction. Every batch of tusi varies from the other, and people are unaware what they are snorting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-an-iim-ahmedabad-students-suicide-continues-to-be-discussed-a-month-later-2622678-2024-10-24",
      "headline": "Why an IIM-Ahmedabad student's suicide continues to be discussed a month laterAllegations of involvement of top institute officials in the 24-year-old death just ahead of a major event follow rows over campus restoration and change of logo"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/aadhaar-card-not-valid-document-to-determine-age-supreme-court-2623146-2024-10-25",
      "headline": "Aadhaar card not valid to prove age, school certificates preferred: Supreme CourtA bench comprising Justices Sanjay Karol and Ujjal Bhuyan said that while an Aadhaar card can be used to establish identity, it is not considered proof of date of birth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/milind-deora-likely-to-contest-against-aaditya-thackeray-from-mumbais-worli-seat-2623050-2024-10-25",
      "headline": "Milind Deora likely to contest against Aaditya Thackeray from Mumbai's WorliMaharashtra polls: The Shiv Sena believes that Milind Deora can hold sway in Worli and cater to middle-class Marathis, fishermen and a group of affluent people who reside in the constituency, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/venom-the-last-dance-review-mild-send-off-to-a-solid-franchise-2623024-2024-10-25",
      "headline": "Venom The Last Dance review: A mild send-off to a solid franchiseReleased-Fri Oct 25, 2024Venom The Last Dance movie review: The film, starring Tom Hardy, offers visual splendour but falls short on plot depth, leaving fans with a bittersweet finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-election-sena-vs-sena-mva-uddhav-thackeray-mahayuti-eknath-shinde-konkan-mumbai-thane-2621225-2024-10-25",
      "headline": "Eknath Shinde could become real inheritor of Bal Thackeray legacyThe Maharashtra Assembly election will be the ultimate decider of the Sena vs Sena battle. The most intense fights between Eknath Shinde's and Uddhav Thackeray's factions will be in Thane-Konkan and Mumbai Metropolitan Region. This is why the Shinde Sena has an edge in the regions with 75 seats."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/mcdonalds-burgers-food-poisoning-e-coli-bacteria-double-quarter-pounder-reason-2622931-2024-10-25",
      "headline": "McDonald's says onions to blame for E Coli outbreak, pulls them from menuAn E Coli outbreak linked to McDonald's burgers has sickened at least 49 people across 10 states, including one death, with investigators focusing on slivered onions as the potential source of the infections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/zeeshan-siddique-son-of-baba-siddique-joins-ajit-pawar-ncp-was-expelled-from-congress-in-august-bandra-east-ticket-2622939-2024-10-25",
      "headline": "Baba Siddique's son joins Ajit Pawar's NCP, to contest from Bandra EastZeeshan Siddique was expelled from Congress in August for cross-voting in the Maharashtra legislative council elections. He joined the NCP days after his father and former Maharashtra minister was shot dead outside his office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nt-ramaswamy-slapped-for-his-onscreen-portrayal-by-a-woman-at-love-reddy-screening-2623141-2024-10-25",
      "headline": "Viral: Woman slaps Telugu actor NT Ramaswamy over his on-screen portrayalTelugu actor NT Ramaswamy was slapped by a woman at the Love Reddy screening. The woman was enraged after his character in the film separated the lead pair."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/the-power-behind-k-pop-how-group-cohesion-versatility-fuel-its-worldwide-success-2622874-2024-10-25",
      "headline": "Behind K-Pop's global domination: The power of group cohesion and talentK-pop's global success is driven by a unique blend of high-quality production, intricate choreography, and conceptual storytelling, all executed by multi-talented idols. The genre's true strength, however, lies in the cohesiveness and unity of its groups, enabling them to captivate audiences worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-day-17-update-karan-veer-and-avinash-clash-over-ration-shilpa-shirodkar-gets-reality-check-2623103-2024-10-25",
      "headline": "BB 18 Day 17: Karan Veer and Avinash clash over ration, Shilpa gets reality checkIn the latest Bigg Boss 18 episode, contestants grappled with food scarcity. Arfeen Khan and Avinash Mishra, who are in charge of ration distribution, demanded personal sacrifices for food."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nithya-menen-not-desperate-to-fall-in-love-only-deserving-will-come-into-my-life-2623104-2024-10-25",
      "headline": "Nithya Menen: Not desperate to fall in love, only deserving will come into my lifeNithya Menen, in an exclusive interview with India Today, talked about giving love a chance. She also opened up about her thoughts on marriage."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-keeps-fans-guessing-with-big-announcement-post-ahead-of-retentions-2623152-2024-10-25",
      "headline": "Hardik Pandya keeps fans guessing with Big Announcement post ahead of retentionsIndia and Mumbai Indians all-rounder Hardik Pandya has left his fans on their toes after a big announcement post on his Instagram Story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-pune-test-rohit-sharma-captaincy-defensive-field-setting-2623132-2024-10-25",
      "headline": "Rohit Sharma's captaincy questioned after defensive fields in Pune TestIndia vs New Zealand, 2nd Test: Rohit Sharma's captaincy came under the scanner when New Zealand were allowed to stretch their lead in the second innings without any pressure. Former coach Ravi Shastri questioned the defensive field placements in the post-Lunch session on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-mohammad-rizwan-record-rawalpindi-test-2623121-2024-10-25",
      "headline": "Mohammad Rizwan becomes fastest Pakistani keeper to 2000 Test runs  PAK vs ENG: Mohammad Rizwan reached the landmark of 2000 runs in Test cricket, breaking Sarfaraz Ahmed's record of the fastest Pakistani wicketkeeper to the milestone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-2nd-test-pune-collapse-simon-doull-rohit-sharma-virat-kohli-gautam-gambhir-2623106-2024-10-25",
      "headline": "Indian batters no longer good players of spin, it's a misconception: Simon DoullFormer New Zealand cricketer Simon Doull has criticized India for their dismal show against spin in recent times and said that it's a misconception that they're good players of spin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-concede-successive-100-plus-run-leads-in-home-tests-for-1st-time-since-2001-2623076-2024-10-25",
      "headline": "India concede successive 100-plus run leads in home Tests for 1st time since 2001India trail by 100-plus leads in consecutive Test matches for the first time in over two decades. In the current series, India conceded a 103-run lead in Pune and now finds itself with a 356-run deficit in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-pune-test-mitchell-santner-seven-wickets-elite-list-records-2623068-2024-10-25",
      "headline": "IND v NZ: Santner takes career-best 7 for 53, joins Daniel Vettori in elite listIndia vs New Zealand, 2nd Test: Mitchell Santner picked up his maiden five-wicket haul and finished with seven as India were bundled out for 156 in the first innings. Santner became only the fifth BlackCaps spinner to take five in an innings in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-shubman-gill-anil-kumble-2623061-2024-10-25",
      "headline": "Gill at his best when he attacks, not when he looks to survive: Anil KumbleIND vs NZ: Shubman Gill scored 30 runs and got out to Mitchell Santner in the first innings of New Zealand's second Test against India at the MCA Stadium in Pune. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-should-have-played-domestic-cricket-before-the-test-season-anil-kumble-2623041-2024-10-25",
      "headline": "Maybe Kohli should have played domestic cricket before Test season: KumbleIndia vs New Zealand: Anil Kumble suggested that Virat Kohli might have benefited from some time in domestic cricket ahead of the demanding 10-match Test season, following his dismissal for just one run in the second Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-pune-test-spinners-virat-kohli-rishabh-pant-collapse-2623027-2024-10-25",
      "headline": "6 for 91: Reckless India batters clueless against spin in horror morning sessionIndia vs New Zealand, 2nd Test: India lost as many as six wickets for 91 runs on Friday morning. Indian batters failed the trial by spin as Mitchell Santner took four wickets in a sensational spell. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealamd-batting-collapse-pune-spin-kohli-pant-sarfaraz-gill-2623015-2024-10-25",
      "headline": "'Rohit-Gambhir combo': Fans slam India's shambolic batting collapseIndia vs New Zealand: Fans slammed the Indian team management's intent approach after the hosts suffered another batting collapse, this time against spin bowling in the Pune Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/western-australia-batting-collapse-52-for-2-to-53-all-out-2622989-2024-10-25",
      "headline": "From 52 for 2 to 53-all out: Western Australia lose 8 wickets for just one run Defending champions Western Australia lost eight wickets for just one run coming from a wide before being bowled out for 53, marking the second-lowest team total in the history of Australia's domestic one-day cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-shubman-gill-anil-kumble-2623061-2024-10-25",
      "headline": "Gill at his best when he attacks, not when he looks to survive: Anil KumbleIND vs NZ: Shubman Gill scored 30 runs and got out to Mitchell Santner in the first innings of New Zealand's second Test against India at the MCA Stadium in Pune. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-should-have-played-domestic-cricket-before-the-test-season-anil-kumble-2623041-2024-10-25",
      "headline": "Maybe Kohli should have played domestic cricket before Test season: KumbleIndia vs New Zealand: Anil Kumble suggested that Virat Kohli might have benefited from some time in domestic cricket ahead of the demanding 10-match Test season, following his dismissal for just one run in the second Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-pune-test-spinners-virat-kohli-rishabh-pant-collapse-2623027-2024-10-25",
      "headline": "6 for 91: Reckless India batters clueless against spin in horror morning sessionIndia vs New Zealand, 2nd Test: India lost as many as six wickets for 91 runs on Friday morning. Indian batters failed the trial by spin as Mitchell Santner took four wickets in a sensational spell. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealamd-batting-collapse-pune-spin-kohli-pant-sarfaraz-gill-2623015-2024-10-25",
      "headline": "'Rohit-Gambhir combo': Fans slam India's shambolic batting collapseIndia vs New Zealand: Fans slammed the Indian team management's intent approach after the hosts suffered another batting collapse, this time against spin bowling in the Pune Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/western-australia-batting-collapse-52-for-2-to-53-all-out-2622989-2024-10-25",
      "headline": "From 52 for 2 to 53-all out: Western Australia lose 8 wickets for just one run Defending champions Western Australia lost eight wickets for just one run coming from a wide before being bowled out for 53, marking the second-lowest team total in the history of Australia's domestic one-day cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-virat-kohli-out-bowled-mitchell-santner-ravi-shastri-2622981-2024-10-25",
      "headline": "Worst shot of his career: Virat Kohli faces flak after Pune Test dismissalIndia vs New Zealand, 2nd Test: Virat Kohli paid the price for playing a cross-batted shot early in his innings against Mitchell Santner. The New Zealand spinner was troubling India batters on Day 2 in Pune. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/roberto-mancini-leaves-saudi-arabia-national-team-after-termination-of-contract-2622976-2024-10-25",
      "headline": "Roberto Mancini leaves Saudi Arabia national team after termination of contractRoberto Mancini has left his role as head coach of Saudi Arabia's national team, the country's football federation said Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-yashasvi-jaiswal-joe-root-2nd-test-2622979-2024-10-25",
      "headline": "Yashasvi Jaiswal joins Joe Root in 1000-run Test club in 2024IND vs NZ, 2nd Test: Indian youngster Yashasvi Jaiswal joined England batter Joe Root in the list of batters to have scored 1000 runs in Test cricket in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-australia-pat-cummins-hurt-more-test-series-2622949-2024-10-25",
      "headline": "Got completely beaten: Cummins says 2018-19 series vs India 'hurt more'IND vs AUS: Pat Cummins said that he was hurt after Australia lost their Test series to India back in 2018-19. Cummins will lead the Aussies in the upcoming Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-pitches-india-tour-of-australia-border-gavaskar-trophy-2622942-2024-10-25",
      "headline": "Cummins's cheeky 'pitches' warning to India ahead of Australia TestsAustralia captain Pat Cummins made a lighthearted remark about the pitch conditions when India tour Down Under for the Border Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-dinesh-karthik-2622933-2024-10-25",
      "headline": "Rohit Sharma got out to a ball that he should not have: Karthik IND vs NZ: Dinesh Karthik said that Rohit Sharma shouldn't have got out in the manner he did against Tim Southee on Day 1 of the Pune Test against Tom Latham's New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-australia-pat-cummins-hurt-more-test-series-2622949-2024-10-25",
      "headline": "Got completely beaten: Cummins says 2018-19 series vs India 'hurt more'IND vs AUS: Pat Cummins said that he was hurt after Australia lost their Test series to India back in 2018-19. Cummins will lead the Aussies in the upcoming Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-pitches-india-tour-of-australia-border-gavaskar-trophy-2622942-2024-10-25",
      "headline": "Cummins's cheeky 'pitches' warning to India ahead of Australia TestsAustralia captain Pat Cummins made a lighthearted remark about the pitch conditions when India tour Down Under for the Border Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-dinesh-karthik-2622933-2024-10-25",
      "headline": "Rohit Sharma got out to a ball that he should not have: Karthik IND vs NZ: Dinesh Karthik said that Rohit Sharma shouldn't have got out in the manner he did against Tim Southee on Day 1 of the Pune Test against Tom Latham's New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/maria-sharapova-bryan-brothers-elected-into-tennis-hall-of-fame-2622915-2024-10-25",
      "headline": "Sharapova, American twin Bryan brothers elected into Tennis Hall of FameFive-time singles Grand Slam champion Maria Sharapova and American twins Bob and Mike Bryan were named to the International Tennis Hall of Fame's Class of 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-sanjay-manjrekar-2622862-2024-10-25",
      "headline": "Rohit Sharma is temperamentally brilliant, but defence is a concern: ManjrekarIND vs NZ: Rohit Sharma failed to open his account in the first innings of the Pune Test after Tim Southee dismissed him. Sanjay Manjrekar praised Rohit for his temperament, but advised him to work on his defence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-test-form-concern-2622904-2024-10-25",
      "headline": "Intent vs Runs: Rohit Sharma's form a cause of concern for IndiaIndia captain Rohit Sharma's intent has been the focus throughout the country's home Test season in 2024. But with intent taking precedence over runs, is Rohit Sharma's form a point of concern ahead of the Australia series?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-jose-mourinho-red-card-fenerbahce-1-1-manchester-united-2622901-2024-10-25",
      "headline": "Jose Mourinho sent off as Fenerbahce hold Manchester United to drawJose Mourinho received a red card but his Fenerbahçe team still held his former club Manchester United to a 1-1 draw in the Europa League on Thursday."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}