{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-wars-modi-vs-modi-in-godfrey-phillips-family-saga-2608095-2024-09-29",
      "headline": "Modi vs Modi: The succession war brewing at Godfrey PhillipsAs the legal showdown unfolds, it's Modi vs Modi in a gripping battle that tests family bonds and determines the future of Godfrey Phillips India, highlighting ambition, legacy, and loyalty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-alakh-pandey-young-entrepreneur-behind-physics-wallah-hurun-list-under-35-2607727-2024-09-28",
      "headline": "Meet Alakh Pandey, the young Edtech visionary behind Physics WallahFrom a humble tutor to a trailblazing entrepreneur, Alakh Pandey's journey with Physics Wallah shows how passion and perseverance can turn even the simplest beginnings into a $2.8 billion empire—reshaping education, one formula at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/akriti-chopra-zomato-co-founder-and-chief-people-officer-resigns-2607590-2024-09-27",
      "headline": "Akriti Chopra, Zomato co-founder and Chief People's Officer, resignsIn an email to Zomato CEO Deepinder Goyal, Akriti Chopra announced her decision to resign with immediate effect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sjvn-share-price-gains-6-percent-mou-maharashtra-rs-48000-crore-2607462-2024-09-27",
      "headline": "Explained: Why SJVN shares gained over 6% todayThe stock rose 6.03% to Rs 133.60 on the Bombay Stock Exchange (BSE), with a market capitalisation of Rs 52,520 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-lower-after-hitting-record-highs-as-financial-stocks-fall-2607414-2024-09-27",
      "headline": "Sensex, Nifty end lower after hitting record highs as financial stocks fallThe S&P BSE Sensex ended 264.27 points lower at 85,571.85, while the NSE Nifty50 settled 37.10 points lower at 26,178.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-draft-paper-drhp-sebi-rs-10000-crore-ofs-promoters-zomato-2607407-2024-09-27",
      "headline": "Swiggy files for Rs 10,000 crore IPO: Here's all you need to knowSwiggy's IPO will consist of two main parts: a fresh issue of equity shares worth Rs 3,750 crore, and an offer for sale (OFS) of 18.52 crore shares by existing stakeholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-once-had-a-rs-10000-note-rbi-1938-know-why-it-was-discontinued-2607398-2024-09-27",
      "headline": "India once had a Rs 10,000 note. Know why it was discontinuedThe history of India's Rs 10,000 note dates back to the pre-independence era. In 1938, the Reserve Bank of India (RBI) issued its first Rs 10,000 note, the largest denomination ever printed in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/multi-asset-funds-investment-benefits-tips-strategy-taxation-explained-2607331-2024-09-27",
      "headline": "What are multi-asset funds and are they good for your investment portfolio?Multi-asset funds are schemes that invest in a combination of three or more assets, such as equities, bonds, and gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-boosts-exports-solar-ev-will-it-hurt-india-other-global-markets-2607297-2024-09-27",
      "headline": "China boosts exports: Will it hurt India, other global markets?With a slowing domestic economy, China is looking to global markets to absorb its excess production. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/signature-global-real-estate-multibagger-surges-260-in-1-year-since-ipo-have-you-invested-2607293-2024-09-27",
      "headline": "Real estate multibagger stock soars 260% in 1 year since IPO. Have you invested?Since its debut on the stock exchanges on September 27, 2023, the stock has outperformed not only its peers but also the broader real estate market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-card-spending-rising-defaults-debt-in-india-crisis-2607259-2024-09-27",
      "headline": "Swipe, spend, struggle: How credit card defaults are spiking in IndiaOnce a symbol of freedom, credit cards now trap young Indians in growing debt. Could defaults be the new norm?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krn-heat-exchanger-ipo-check-latest-gmp-subscription-status-allotment-expected-listing-gain-2607230-2024-09-27",
      "headline": "KRN Heat Exchanger IPO: Check latest GMP, subscription status, other detailsKRN Heat Exchanger opened for subscription on September 25 looking to raise Rs 341.95 crore from its public issue, and has already seen bids of over 80 times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-wipro-it-stocks-rally-4-percent-accenture-fy25-guidance-boost-2607196-2024-09-27",
      "headline": "Accenture guidance boost lifts Infosys, Wipro; IT stocks rally up to 4%Accenture not only exceeded market expectations for its Q4 results but also raised its revenue guidance for FY25 to a range of 3-6%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-under-35-list-isha-akash-ambani-alakh-pandey-top-young-entrepreneurs-ghazal-alagh-2607171-2024-09-27",
      "headline": "Isha, Akash Ambani among top young entrepreneurs in Hurun's under-35 listThe Hurun list celebrates 150 entrepreneurs aged 35 or younger from across India, marking their achievements in fields ranging from retail to tech startups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-hit-record-high-for-6th-straight-session-2607157-2024-09-27",
      "headline": "Sensex, Nifty hit record high for 6th straight sessionThe S&P BSE Sensex added 67.47 points to 85,903.59, while the NSE Nifty50 gained 14.70 points to 26,230.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-files-for-ipo-aims-to-raise-about-rs-3750-crore-2607074-2024-09-26",
      "headline": "Swiggy files for IPO, aims to raise about Rs 3,750 croreSwiggy, backed by investment group Prosus and Japan's SoftBank, competes with Zomato in India's online restaurant and cafe food deliveries sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-stock-market-outlook-middle-east-conflict-dampen-dalal-street-rally-heres-what-experts-say-2606949-2024-09-26",
      "headline": "Will Middle East conflict dampen Dalal Street's rally? Here's what experts say Despite the uncertainty arising from the Middle East conflict, Indian stocks have surged, with benchmarks like the Sensex and Nifty showing strong gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vedanta-shares-cross-rs-500-mark-after-gaining-5-more-gains-ahead-2606881-2024-09-26",
      "headline": "Vedanta shares cross Rs 500 mark after gaining 5%. More gains ahead?Vedanta's performance in 2024 has been impressive, with the stock climbing 95% so far this year and gaining 124.35% over the last 12 months. Over a five-year period, the stock has risen by 202%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-all-time-high-market-rally-metal-auto-stocks-2606880-2024-09-26",
      "headline": "Sensex, Nifty close at all-time high led by rally in auto and metal stocksThe S&P BSE Sensex added 666.25 points to end at 85,836.12, while the NSE Nifty50 gained 211.90 points to close at 26,216.05. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hezbollah-war-iran-spy-idf-kill-hassan-nasrallah-location-beirut-airstrike-2608297-2024-09-29",
      "headline": "Iran spy's tip-off helped Israel kill Hezbollah chief Nasrallah: ReportA crucial tip-off from an Iranian mole instigated Israel to launch a deadly airstrike in Lebanon's capital Beirut that killed Hezbollah chief Hassan Nasrallah at the terror group's headquarters. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/burari-suicide-deaths-delhi-police-probe-occult-practices-angle-vasant-kunj-deaths-2608361-2024-09-29",
      "headline": "Police deny reports of probing 'occult practices' angle in Vasant Kunj deathsEarlier, a report by news agency PTI claimed that the police will study the 2018 Burari suicide case to probe any \"occult practice\" angle in the Vasant Kunj deaths."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-mallikarjun-kharge-health-congress-chief-falls-ill-jammu-kashmir-2608395-2024-09-29",
      "headline": "PM Modi speaks to Mallikarjun Kharge after Congress chief falls ill during rallyAddressing a public rally in Kathua, Mallikarjun Kharge felt dizzy and was helped into a chair by his colleagues on stage. Later in the day, PM Modi spoke to the Congress President to enquire about his health."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-hcl-employee-dies-of-cardiac-arrest-in-washroom-of-nagpur-office-2608337-2024-09-29",
      "headline": "40-year-old HCL employee dies of cardiac arrest in Nagpur office washroomThe man, Nitin Edwin Michael, was rushed to the All India Institute of Medical Sciences (AIIMS) in Nagpur, but doctors declared him brought dead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ground-report-syrian-refugees-lebanon-return-home-bekaa-valley-israel-hezbollah-2608314-2024-09-29",
      "headline": "Ground report: Syrian refugees in Lebanon return home as Israel pounds HezbollahIn the last three days, over one lakh people, including Lebanese and Syrians, have reached a Lebanon-Syria border checkpoint in Bekaa Valley as Israeli airstrikes pound southern Lebanon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-eight-haryana-leaders-expelled-six-years-contest-independently-haryana-assembly-polls-2608407-2024-09-29",
      "headline": "BJP expels 8 Haryana leaders for six years over choosing to contest independentlyRanjit Singh Chautala decided to quit the saffron party after he was denied the poll ticket from Rania, the seat he represented in the Assembly when he was an independent MLA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tiktok-influencer-kubra-aykut-who-married-herself-dies-by-suicide-at-26-2608385-2024-09-29",
      "headline": "Turkish influencer who married herself dies by suicide at 26Kubra Aykut had one million followers on her TikTok account and 2,07,000 followers on her Instagram account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/udhayanidhi-stalin-deputy-chief-minister-senthil-balaji-minister-tamil-nadu-cabinet-reshuffle-2608291-2024-09-29",
      "headline": "Udhayanidhi Stalin is Deputy Chief Minister, Senthil Balaji back as MinisterV Senthil Balaji took oath as the Minister of Electricity, Prohibition and Excise, the same portfolio he held from May 2021 to June 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/indians-chronically-overworked-what-is-solution-to-prevent-burnout-big-fours-unemployment-anna-sebastian-periyal-2607329-2024-09-29",
      "headline": "Overwork killing Indians. How to prevent burnout and stay safeProfessionals in India are among the world's most overworked people. Some sectors are worse than others and people reveal why they find it difficult to switch off after work hours. Health experts tell us how to identify signs of burnout, prevent getting overworked and not getting killed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-attack-on-hezbollah-sayyed-hassan-nasrallah-lebanon-beirut-benjamin-netanyahu-2607687-2024-09-27",
      "headline": "No place is too far: Israeli Defence Minister after airstrikes at Houthi targetsIsraeli Airstrikes On Hezbollah Live Updates: Israel has claimed that it killed top Hezbollah leader Nabil Kaouk in its airstrikes on Beirut. The Israeli military said that Kaouk was targeted and eliminated by Israeli fighter jets under the precise direction of military intelligence. Hezbollah hasn't confirmed the development yet. Notably, this comes a day after Israel eliminated Hassan Nasrallah, a top Hezbollah commander who led the militant group for 32 years. Following his death, Hashem Safieddine was named as the next Hezbollah chief. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/conservative-party-indian-visas-race-replace-rishi-sunak-uk-opposition-leader-2608378-2024-09-29",
      "headline": "Spotlight on Indian visas in race to replace Rishi Sunak as UK Opposition LeaderFormer immigration minister Robert Jenrick singled out India as one of the countries that should be subjected to tough visa restrictions across all categories unless it takes back its nationals who enter Britain illegally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aazad-samaj-party-mohammad-anas-2022-up-polls-autolifter-kithore-2608349-2024-09-29",
      "headline": "Politician who fought UP polls in 2022 turns out to be member of car theft gangA gang of six people accused of being involved in luxury car thefts in Delhi, were arrested. Amongst them is Mohammad Anas, who contested Assembly elections from UP's Kithore on Aazad Samaj Party's ticket in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-host-iifa-awards-2024-shah-rukh-khan-kissing-mere-mehboob-mere-sanam-dance-2608332-2024-09-29",
      "headline": "Vicky Kaushal feels surreal to host IIFA with SRK: There's no one like youVicky Kaushal, who co-hosted the IIFA Awards 2024 alongside Shah Rukh Khan, shared a heartfelt post for the iconic actor. Vicky expressed how surreal it was for him to share the stage with someone he had admired and watched growing up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-minu-muneer-accuses-director-of-assault-forced-to-watch-sexual-act-2608256-2024-09-29",
      "headline": "Forced to watch sexual act: Malayalam actor's big charge against filmmakerFormer Malayalam actor Minu Muneer has claimed that popular director-actor Balachandra Menon forced her to watch sexual act. She had earlier accused seven men, including popular actor Jayasurya, of physical and verbal abuse. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-kashmir-encounter-between-security-forces-terrorists-rajouri-thanamandi-dead-injured-2608341-2024-09-29",
      "headline": "Encounter breaks out between security forces, terrorists in J&K's Rajouri Acting on a tip-off, a joint search operation was launched by the security forces at Manial Gali area in Rajouri's Thanamandi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/okra-water-is-the-new-viral-health-drink-for-good-skin-weight-loss-does-it-work-2607302-2024-09-29",
      "headline": "Okra water is the new viral health drink for good skin, weight loss. Does it work?A new wellness trend - drinking okra water - is all over the Internet for its benefits, including weight loss and better skin. But is it really worth the hype, or should you be eating okra (or bhindi) in more traditional ways?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-mother-breaks-down-as-he-introduces-her-for-the-first-time-watch-video-2608157-2024-09-29",
      "headline": "Watch: Diljit Dosanjh's mother breaks down as he introduces her for the first timeA video of Diljit Dosanjh introducing his mother and sister for the first time at his Manchester concert is being widely shared on the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-entertainment-sports-business-politics-423-27-09-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pannas-khokhe-2024-maharashtra-assembly-election-defection-shiv-sena-ncp-congress-prithviraj-chavan-2607615-2024-09-29",
      "headline": "What is pannas khokhe and will it swing Maharashtra pollsCongress leader Prithviraj Chavan said at the 2024 India Today Mumbai Conclave that 'pannas khokhe' would play a big role in the upcoming Maharashtra Assembly election. What is 'pannas khokhe', and will it influence the make-or-break election?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rg-kar-trainee-doctor-rape-murder-junior-doctors-demanded-autopsy-hospital-reveals-cbi-2608235-2024-09-29",
      "headline": "Kolkata doctors demanded rape victim's autopsy at RG Kar Hospital: SourcesThe postmortem of the junior doctor at RG Kar Medical College was conducted at the request of junior doctors and the victim's father, claimed a source. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/woman-trolled-after-her-video-of-dancing-to-aaj-ki-raat-song-from-stree-2-in-metro-goes-viral-2608225-2024-09-29",
      "headline": "Woman dances to Aaj Ki Raat in metro, gets trolled after video goes viralA woman was trolled after a video of her dancing to Stree 2's song 'Aaj Ki Raat' in a metro went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hashem-safieddine-replace-hassan-nasarullah-hezbollah-chief-israel-lebanon-conflict-2608178-2024-09-29",
      "headline": "Hashem Safieddine to head Hezbollah after Hassan Nasrallah's death in airstrikeHashem Safieddine is a cousin of Hassan Nasrallah, who served as chief of the Iran-backed Lebanese militant group for 32 years. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-muntashir-cried-adipurush-controversy-om-raut-saif-ali-khan-prabhas-2608346-2024-09-29",
      "headline": "Manoj Muntashir 'cried' after Adipurush row: Understood nothing is permanentRecently, writer Manoj Muntashir spoke out about the controversy surrounding the dialogues in the Prabhas-starrer Adipurush. The lyricist shared how he cried after the film garnered negative reviews. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israeli-military-kills-hezbollah-leader-nabil-kaouk-airstrike-lebanon-conflict-2608258-2024-09-29",
      "headline": "Israeli military says it killed top Hezbollah leader Nabil Kaouk in airstrikeA day after the death of Hezbollah's chief Hassan Nasrallah, the Israeli military have claimed that they have killed another top Hezbollah leader, Nabil Kaouk, in its airstrikes on Beirut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-urges-air-india-ex-student-suyesha-savant-cockroach-in-meal-2608352-2024-09-29",
      "headline": "Anupam Kher urges Air India to act after ex-student finds cockroach in mealActor Anupam Kher shared a post on X and highlighted the incident where his ex-student found a cockroach in an omlette served by Air India. The actor requested the airlines to look into the matter and act accordingly. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-muntashir-cried-adipurush-controversy-om-raut-saif-ali-khan-prabhas-2608346-2024-09-29",
      "headline": "Manoj Muntashir 'cried' after Adipurush row: Understood nothing is permanentRecently, writer Manoj Muntashir spoke out about the controversy surrounding the dialogues in the Prabhas-starrer Adipurush. The lyricist shared how he cried after the film garnered negative reviews. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-host-iifa-awards-2024-shah-rukh-khan-kissing-mere-mehboob-mere-sanam-dance-2608332-2024-09-29",
      "headline": "Vicky Kaushal feels surreal to host IIFA with SRK: There's no one like youVicky Kaushal, who co-hosted the IIFA Awards 2024 alongside Shah Rukh Khan, shared a heartfelt post for the iconic actor. Vicky expressed how surreal it was for him to share the stage with someone he had admired and watched growing up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-daughter-suhana-khan-king-announced-birthday-abhay-verma-abhishek-bachchan-anirudh-ravichander-2608326-2024-09-29",
      "headline": "SRK's King with daughter Suhana Khan to be announced on his birthday: ReportShah Rukh Khan's next film King with daughter Suhana Khan is believed to be announced on his birthday in November. The actor will turn 59 on November 2. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-to-return-to-zonal-format-bcci-annual-general-meeting-2608413-2024-09-29",
      "headline": "Duleep Trophy likely to return to zonal format from next seasonThe Duleep Trophy is likely to return to its zonal format after the four team competition played in the 2023-24 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wasnt-expecting-a-full-toss-david-miller-on-hardiks-final-over-in-t20-world-cup-2608406-2024-09-29",
      "headline": "Wasn't expecting a full-toss: David Miller on Hardik's final over in T20 World CupDavid Miller revealed that he was not expecting a full-toss from Hardik Pandya in the final over of the T20 World Cup 2024. He felt that he let his country and teammates down at that time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-2nd-test-kanpur-weather-green-park-rain-2608392-2024-09-29",
      "headline": "IND vs BAN 2nd Test Kanpur Weather Report: Is Play possible on Day 4?The Days 2 and 3 of the ongoing second Test between India and Bangladesh were washed out due to rain and wet outfield leaving fans wondering whether they will get to see some action on Day 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-phoebe-litchfield-grace-harris-australia-injury-scare-2608391-2024-09-29",
      "headline": "Litchfield, Harris miss warm-ups as Australia face injury scare  Women's T20 World Cup 2024: Australia have had a couple of injury scares after Grace Harris and Phoebe Litchfield missed both their warm-up matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/happy-birthday-richu-indian-womens-team-celebrate-ahead-of-t20-world-cup-2608388-2024-09-29",
      "headline": "Happy Birthday Richu: Indian women's team celebrate ahead of T20 World CupThe Indian team celebrated Richa Ghosh's 21st birthday as she was smeared with cake, followed by a little tea party. Harmanpreet Kaur-led side will begin their campaign from October 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-squad-mehidy-hasan-mahmudullah-t20i-series-2608367-2024-09-29",
      "headline": "Bangladesh name squad for India T20Is, Mehidy Hasan recalledIND vs BAN: Bangladesh have recalled Mehidy Hasan Miraz, Rakibul Hasan and Parvez Hossain Emon for their three-match T20I series against India. Shoriful Islam has also returned after recovering from a groin injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-holds-93rd-annual-general-meet-here-are-key-takeaways-2608363-2024-09-29",
      "headline": "BCCI holds 93rd annual general meet: Here are key takeaways The BCCI's AGM highlighted important steps for Indian cricket, focusing on good governance and financial planning. With new members in the IPL Governing Council and key decisions on player auctions, the future of cricket in India looks bright."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajay-jadeja-ms-dhoni-ipl-csk-ipl-2025-retentions-2608358-2024-09-29",
      "headline": "Ajay Jadeja highlights MS Dhoni's special trait: 'He doesn't desire to be no 1 or 2'Former India cricketer Ajay Jadeja named his four possible retentions for five-time IPL champions CSK ahead of the mega auction for the 2025 season. Jadeja also highlighted Dhoni's special trait. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/la-liga-frenkie-fc-barcelona-frenkie-de-jong-ankle-mental-trauma-ankle-injuries-2608340-2024-09-29",
      "headline": "FC Barcelona's De Jong opens up on 'mental trauma' after ankle injuriesFrenkie de Jong broke his silence on the mental and physical toll of his recurring ankle injuries, dismissing rumours about surgery and salary, and focusing on his recovery to return stronger for FC Barcelona."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-varun-chakravarthy-parthiv-patel-2608350-2024-09-29",
      "headline": "Varun rewarded for hard work on tough pitches in IPL: Parthiv Patel IND vs BAN: Parthiv Patel said that Varun Chakravarthy found his place back into the Indian T20I team after his impressive performances for KKR on tough pitches to bowl at the Eden Gardens in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-squad-mehidy-hasan-mahmudullah-t20i-series-2608367-2024-09-29",
      "headline": "Bangladesh name squad for India T20Is, Mehidy Hasan recalledIND vs BAN: Bangladesh have recalled Mehidy Hasan Miraz, Rakibul Hasan and Parvez Hossain Emon for their three-match T20I series against India. Shoriful Islam has also returned after recovering from a groin injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-holds-93rd-annual-general-meet-here-are-key-takeaways-2608363-2024-09-29",
      "headline": "BCCI holds 93rd annual general meet: Here are key takeaways The BCCI's AGM highlighted important steps for Indian cricket, focusing on good governance and financial planning. With new members in the IPL Governing Council and key decisions on player auctions, the future of cricket in India looks bright."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajay-jadeja-ms-dhoni-ipl-csk-ipl-2025-retentions-2608358-2024-09-29",
      "headline": "Ajay Jadeja highlights MS Dhoni's special trait: 'He doesn't desire to be no 1 or 2'Former India cricketer Ajay Jadeja named his four possible retentions for five-time IPL champions CSK ahead of the mega auction for the 2025 season. Jadeja also highlighted Dhoni's special trait. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/la-liga-frenkie-fc-barcelona-frenkie-de-jong-ankle-mental-trauma-ankle-injuries-2608340-2024-09-29",
      "headline": "FC Barcelona's De Jong opens up on 'mental trauma' after ankle injuriesFrenkie de Jong broke his silence on the mental and physical toll of his recurring ankle injuries, dismissing rumours about surgery and salary, and focusing on his recovery to return stronger for FC Barcelona."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-varun-chakravarthy-parthiv-patel-2608350-2024-09-29",
      "headline": "Varun rewarded for hard work on tough pitches in IPL: Parthiv Patel IND vs BAN: Parthiv Patel said that Varun Chakravarthy found his place back into the Indian T20I team after his impressive performances for KKR on tough pitches to bowl at the Eden Gardens in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/musheer-khan-thanks-bcci-fans-in-emotional-video-after-road-accident-2608347-2024-09-29",
      "headline": "Musheer Khan thanks BCCI, fans in emotional video after road accidentMusheer Khan and his father Naushad thanked the fans and the BCCI after they were involved in a car accident. Musheer suffered a neck fracture and will remain out of action for at least three months.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pcb-warns-centrally-contracted-players-improve-fitness-or-face-termination-2608343-2024-09-29",
      "headline": "PCB warns centrally contracted players: Improve fitness or face termination\tThe Pakistan Cricket Board (PCB) has initiated a firm directive aimed at improving the fitness levels of their centrally contracted players. In a recent meeting, PCB officials have explicitly warned 6 to 7 players that maintaining poor fitness standards could jeopardise their contracts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-tilak-varmas-fun-slide-ride-with-rohit-sharmas-daughter-samaira-2608339-2024-09-29",
      "headline": "Watch: Tilak Varma's fun slide ride with Rohit Sharma's daughter SamairaTilak Varma and Rohit Sharma's daughter Samaira share a great bond between them. Ritika Sajdeh shared an Instagram story of the two as they took a fun slide. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-aus-5th-odi-ben-duckett-hundred-bristol-harry-brook-2608338-2024-09-29",
      "headline": "ENG vs AUS: Ben Duckett slams fiery 86-ball century in series decider in BristolEngland opener Ben Duckett scored his second ODI hundred during the fifth match against Australia on Sunday, September 29 at at County Ground, Bristol."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-5th-odi-virat-kohli-harry-brook-record-2608333-2024-09-29",
      "headline": "Harry Brook breaks Virat Kohli's record in ODI series vs AustraliaENG vs AUS: Harry Brook scored 312 runs and broke Virat Kohli's record for the most runs by a captain in a bilateral ODI series against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karthik-reflects-if-india-should-have-designated-test-centres-amid-kanpur-match-karthik-reflects-if-india-should-have-designated-test-centres-amid-kanpur-match-former-india-wicketkeeper-batter-dinesh-2608321-2024-09-29",
      "headline": "Karthik reflects if India should have designated Test centres amid Kanpur match Dinesh Karthik opined about if India should have designated Test centres amid the ongoing debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afg-vs-ban-afghanistan-vs-bangladesh-odi-series-2608319-2024-09-29",
      "headline": "Afghanistan to take on Bangladesh in three-match ODI series from November 6Afghanistan will lock horns with Bangladesh in a three-match ODI series beginning from November 6. The series will serve as a preparation for the ICC Champions Trophy 2025. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-to-end-t20-world-cup-drought-fans-excited-for-harmanpreets-women-in-blue-2608298-2024-09-29",
      "headline": "Fans excited for Harmanpreet Kaur's India before T20 World Cup 2024Women's T20 World Cup 2024: Fans Akanksha V Malde and Sakshi Thakare spoke to India Today about India's campaign in the UAE and talked about their chances of lifting the trophy. Watch the matches from October 3 live on Star Sports and Disney+Hotstar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-5th-odi-virat-kohli-harry-brook-record-2608333-2024-09-29",
      "headline": "Harry Brook breaks Virat Kohli's record in ODI series vs AustraliaENG vs AUS: Harry Brook scored 312 runs and broke Virat Kohli's record for the most runs by a captain in a bilateral ODI series against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karthik-reflects-if-india-should-have-designated-test-centres-amid-kanpur-match-karthik-reflects-if-india-should-have-designated-test-centres-amid-kanpur-match-former-india-wicketkeeper-batter-dinesh-2608321-2024-09-29",
      "headline": "Karthik reflects if India should have designated Test centres amid Kanpur match Dinesh Karthik opined about if India should have designated Test centres amid the ongoing debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afg-vs-ban-afghanistan-vs-bangladesh-odi-series-2608319-2024-09-29",
      "headline": "Afghanistan to take on Bangladesh in three-match ODI series from November 6Afghanistan will lock horns with Bangladesh in a three-match ODI series beginning from November 6. The series will serve as a preparation for the ICC Champions Trophy 2025. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-to-end-t20-world-cup-drought-fans-excited-for-harmanpreets-women-in-blue-2608298-2024-09-29",
      "headline": "Fans excited for Harmanpreet Kaur's India before T20 World Cup 2024Women's T20 World Cup 2024: Fans Akanksha V Malde and Sakshi Thakare spoke to India Today about India's campaign in the UAE and talked about their chances of lifting the trophy. Watch the matches from October 3 live on Star Sports and Disney+Hotstar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pt-usha-indian-olympic-association-vs-executive-committee-members-letter-2608295-2024-09-29",
      "headline": "Indian Olympic body chief PT Usha rubbishes allegations of autocratic leadership A day after 12 Executive Committee members wrote a letter to a top International Olympic Committee official, accusing PT Usha of 'autocratic leadership', the legendary athlete lashed out at the allegations. In a strongly-worded reply, Usha said some of these members have 'questionable track record'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/green-park-kanpur-ind-vs-ban-2nd-test-day-3-2608294-2024-09-29",
      "headline": "IND v BAN: Kanpur fan vents out frustration after Day 3 washed out despite no rainA fan expressed his frustration after the Day 3 of the second Test between India and Bangladesh was washed out despite no rain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-t20-series-rinku-singh-abhishek-sharma-opening-saba-karim-2608289-2024-09-29",
      "headline": "Rinku should open with Abhishek Sharma in Bangladesh T20Is: Saba KarimSaba Karim's push to promote Rinku Singh as India's T20 opener alongside Abhishek Sharma could unlock Rinku's full potential, offering India a more explosive top order ahead of their T20I series against Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-new-rankings-sri-lanka-progresses-after-series-win-vs-nz-2608288-2024-09-29",
      "headline": "World Test Championship new rankings: Sri Lanka progresses after series win vs NZSri Lanka registered an emphatic 2-0 win over New Zealand at their home and made crucial progression in the World Test Championship standings. They are currently ranked No. 3 after India and Australia."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}