{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rohan-mirchandani-death-yogurt-brand-epigamia-co-founder-dies-at-42-due-to-cardiac-arrest-2653723-2024-12-22",
      "headline": "Epigamia co-founder Rohan Mirchandani dies at 42 due to cardiac arrestRohan Mirchandani, co-founder of Epigamia, died due to cardiac arrest. Known for transforming India's food market, he led Epigamia's growth to over 20,000 retail outlets in 30 cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-key-decisions-what-cheaper-what-costlier-and-all-other-details-2653637-2024-12-22",
      "headline": "GST Council's key decisions: What's cheaper, what's costlier, and all other detailsGST Council brings key tax changes impacting everyday essentials like popcorn, used cars, fortified rice, corporate sponsorships, and penalties.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/goods-and-services-tax-eighteen-per-cent-used-ev-car-sale-business-jet-fuel-gst-2653536-2024-12-21",
      "headline": "GST at 18% on used EV car sale by business, jet fuel stays out of its ambitThe GST Council in its 55th meeting also decided to clarify on taxability of popcorn, saying caramelised popcorn will continue to attract tax at the rate of 18 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-delays-decision-on-lowering-tax-for-health-life-insurance-premiums-2653343-2024-12-21",
      "headline": "GST Council delays decision on lowering tax for health, life insurance premiumsGST Council Meeting: During the 55th meeting held on Saturday, technical considerations led to the deferral, with the Group of Ministers (GoM) tasked to conduct further deliberations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/55th-gst-council-meeting-2653320-2024-12-21",
      "headline": "GST Council Meeting: Will tax rates on health and life insurance premiums drop today? GST Council Meeting begins: One of the key items on the agenda is the proposal to reduce the Goods and Services Tax (GST) on insurance premiums, a move that could bring relief to policyholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/55th-gst-council-meeting-what-to-expect-costlier-cheaper-food-delivery-luxury-items-insurance-premiums-2653307-2024-12-21",
      "headline": "55th GST Council Meeting begins: What could become costlier or cheaper todayGST Council Meeting: From essential services to luxury items, a wide range of proposals are under discussion, some of which could significantly impact consumers and businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-4000-points-nifty50-decline-5-trading-sessions-this-week-explained-2652984-2024-12-20",
      "headline": "Explained: Why Sensex fell 4,000 points in 5 trading sessionsThe BSE Sensex plummeted over 4,000 points across five consecutive sessions, while the NSE Nifty50 fell approximately 1,200 points, representing a nearly 5% loss within the week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/direct-tax-vivad-se-vishwas-scheme-2024-dtvsv-faqs-for-settling-tax-disputes-easily-2652961-2024-12-20",
      "headline": "Vivad Se Vishwas Scheme: FAQs for settling tax disputes easily Taxpayers can resolve pending income tax disputes under the Direct Tax Vivad Se Vishwas Scheme 2024 by settling the disputed tax amount and avoiding additional interest and penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nita-ambani-to-headline-india-conference-at-harvard-2652947-2024-12-20",
      "headline": "Nita Ambani to headline India Conference at HarvardThe India Conference at Harvard, one of the largest student-led India-focused events in the US, is hosted by students across Harvard's graduate and undergraduate schools."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-today-sensex-nosedives-1100-points-nifty-below-23600-it-stocks-tumble-2652911-2024-12-20",
      "headline": "Sensex nosedives 1,100 points, Nifty falls below 23,600; IT stocks tumbleStock market crash: The S&P BSE Sensex ended 1,176.46 points lower at 78,041.59, while the NSE Nifty50 settled 364.20 points lower at 23,587.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-money-launches-pay-later-margin-trading-facility-mtf-3-things-to-know-2652885-2024-12-20",
      "headline": "Paytm Money launches 'Pay Later' Margin Trading. 3 things to knowPaytm Money launches 'Pay Later' MTF, democratising stock trading with seamless activation, innovative tools, and affordable rates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-today-sensex-down-800-points-bloodbath-dalal-street-explained-2652825-2024-12-20",
      "headline": "Sensex tumbles 1,000 points. What's behind the bloodbath on Dalal Street?Stock market today: The Sensex had fallen 1033.99 points to 78,184.06 at 3:00 pm, while the Nifty50 slipped 299.35 points to trade at 23,652.35. All broader market indices were also trading in negative territory.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/looking-for-high-returns-on-investments-check-these-5-options-equities-ipos-mid-cap-funds-small-cap-funds-elss-p2p-lending-2652800-2024-12-20",
      "headline": "Looking for high returns on investments? Check these 5 optionsBalancing risk and reward is essential for wealth creation. From equities to IPOs and P2P lending, explore these high-return investment options to align with your financial goals and risk appetite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nacdac-infra-ipo-allotment-step-by-step-guide-to-check-status-2652789-2024-12-20",
      "headline": "NACDAC Infra IPO allotment: Step-by-step guide to check statusThe Ghaziabad-based construction company's IPO, open from December 17 to December 19, offered shares in the price range of Rs 33-35 per share with a lot size of 4,000 shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/senores-pharmaceuticals-ipo-check-latest-gmp-price-band-and-should-you-apply-stmp-2652775-2024-12-20",
      "headline": "Senores Pharmaceuticals IPO: Check latest GMP, price band and should you apply?Senores Pharmaceuticals IPO: The Ahmedabad-based pharmaceutical company is offering shares in a price range of Rs 372-391, with a minimum application size of 38 equity shares and multiples thereafter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nithin-kamath-on-margin-trading-facility-what-it-is-and-how-it-works-2652756-2024-12-20",
      "headline": "Zerodha launches Margin Trading Facility: What it is and how it worksZerodha's Nithin Kamath introduces Margin Trading Facility, enabling investors to leverage funds for stock delivery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ventive-hospitality-ipo-opens-check-latest-gmp-price-band-and-other-key-details-stmp-2652752-2024-12-20",
      "headline": "Ventive Hospitality IPO opens: Check latest GMP, price band, and other detailsVentive Hospitality IPO: The subscription window closes on December 24, 2024. The basis of allotment is expected to be finalised by December 26, with shares credited to demat accounts by December 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-extend-losses-amid-weak-global-cues-2652725-2024-12-20",
      "headline": "Sensex, Nifty extend losses amid weak global cuesAt 10:28 am, the S&P BSE Sensex fell 274.86 points to 78,943.19, while the NSE Nifty50 dropped 67.90 points to 23,883.80."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rupee-hits-all-time-low-against-us-dollar-again-key-reasons-behind-pressure-2652736-2024-12-20",
      "headline": "Rupee hits all-time low against US dollar. Why is it under pressure?The rupee surpassed its previous low of 85.0850 reached on Thursday and settled at 85.10 by 10:00 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-you-get-a-personal-loan-with-low-credit-score-follow-these-tips-check-details-2652396-2024-12-19",
      "headline": "Can you get a personal loan with low credit score? Check detailsWhile a low credit score may present challenges, using strategies like reduced DTI, and showing income stability, etc. can help secure a personal loan and improve your credit for the future."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/allu-arjun-hyderabad-theatre-stampede-pushpa-2-osmania-university-panel-members-storm-actor-house-2653759-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Allu Arjun's house vandalised by Osmania University panel members, 8 arrestedOsmania University panel members stormed Telugu actor Allu Arjun's Hyderabad residence, demanding Rs 1 crore compensation over a stampede death at \"Pushpa 2\" premiere earlier this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-receives-kuwait-highest-honour-mubarak-al-kabeer-order-2653711-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi receives Mubarak Al-Kabeer Order, Kuwait's highest honour'The Order of Mubarak Al Kabeer' is an order of knighthood in Kuwait. It is accorded to heads of state and foreign sovereigns and members of royal families as a symbol of friendship. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-air-quality-index-recorded-as-severe-on-sunday-afternoon-no-immediate-respite-likely-2653722-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi's air quality turns severe, experts warn of no immediate respiteThis cycle of pollution has been ongoing since the night of December 16, when Delhi's air first plunged into hazardous territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/smriti-mandhana-misses-out-on-hundred-in-1st-odi-enters-all-time-unlucky-list-2653718-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Smriti Mandhana misses out on hundred in 1st ODI, enters all-time unlucky listSmriti Mandhana missed out on a well-deserved hundred in the 1st ODI between India and West Indies' women's ODI contest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/indian-hotels-more-expensive-than-resorts-tourist-destinations-abroad-room-rent-tariffs-goa-jaisalmer-thailand-2653524-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why hotel rooms in India cost a bomb, push Indians to holiday abroadHotels and resorts in India are way more expensive than those in tourist destinations abroad. India Today Digital found how hotel tariffs in Goa and Jaisalmer were way higher than those in Colombo, Phuket and Hanoi. High hotel rents are pushing Indians to holiday abroad. Hotel industry experts explain what drives tariffs, and offer solutions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-chief-mallikarjun-kharge-election-commission-rule-change-information-bjp-pm-modi-centre-2653647-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Systematic conspiracy: Mallikarjun Kharge slams Centre's election rule changeCongress chief Mallikarjun Kharge accused the central government of systematically undermining the Election Commission's independence through amendments to election rules and other measures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/police-vehicle-in-bjps-vasundhara-rajes-convoy-overturns-4-cops-injured-2653744-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Police vehicle in BJP's Vasundhara Raje's convoy overturns, 4 cops injuredA police vehicle in former Rajasthan Chief Minister Vasundhara Raje's convoy overturned on Sunday leaving four cops injured. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-accident-hit-and-run-boy-killed-speeding-car-suv-driver-arrested-2653685-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Boy, 4, killed after speeding car runs him over in Mumbai, teen driver arrestedA four-year-old boy died after being hit by a speeding car driven by a 19-year-old in Mumbai's Wadala area near Ambedkar College, police reported. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/on-camera-mohali-building-tilts-before-flattening-adjacent-structures-2-dead-2653701-2024-12-22?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "On camera, Mohali building tilts before flattening adjacent structures; 2 deadAt least two people died after a multi-storey building collapsed in the Sohana village of Punjab's Mohali district on Saturday, December 21. The district authorities have launched a rescue operation. Police have booked building owners -- Parwinder Singh and Gagandeep Singh, Mohali Senior Superintendent of Police Deepak Pareek said. Several excavators were pressed into service as part of the rescue operation. Officials said a National Disaster Response Team (NDRF) team was carrying out the operation. Medical teams, along with an ambulance, have also been deployed. A video has now emerged showing the moment when the building collapsed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ex-muslims-claim-germany-magdeburg-christmas-market-attack-saudi-atheist-warn-of-taqiyyah-conspiracy-2653579-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ex-Muslims claim Christmas market attacker isn't ex-Muslim, warn of bigger plotTaleb Al Abdulmohsen, the 50-year-old who killed 5 people and injured 200 at a Christmas market in Germany isn't an ex-Muslim, claim other ex-Muslims, some of whom have known him for years. They say the Saudi attacker was using the Islamic concept of taqiyya to hide his identity, and warn of a bigger conspiracy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-lieutenant-governor-vk-saxena-arvind-kejriwal-civic-issues-video-aap-atishi-2653693-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lt Governor's video shows Delhi's 'hellish conditions,' Arvind Kejriwal respondsDelhi Lieutenant Governor VK Saxena, through a video, spotlighted civic challenges, including overflowing sewers, erratic electricity supply, insufficient water availability, and mountains of garbage across various parts of the city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/stepwell-first-war-of-independence-era-sambhal-survey-excavation-rani-ki-bawdi-2653661-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stepwell dating back to 1857 revolt era found in UP's Sambhal during surveyThe discovery of the 250-foot-deep stepwell, named Rani ki Bawdi, in Uttar Pradesh's Sambhal came after the ruins of an ancient Banke Bihari temple were found in the same area earlier this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/indians-are-chasing-luxury-travel-like-never-before-whats-driving-this-shift-2653015-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indians are chasing luxury travel like never before. What's driving this shift?Luxury travel among Indian tourists is no longer a rare occurrence. Recent statistics also reveal a clear shift in how Indians approach their travel plans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajasthan-farmer-demanding-euthanasia-fined-lakh-by-police-2653710-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rajasthan farmer demanding euthanasia fined Rs 9.91 lakh by police. Here's whyThe notice demands that the farmer deposit Rs 9,91,577 in the accounts branch of the SP office by December 24. If the amount is not paid, legal action will be taken as per rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rohan-mirchandani-death-yogurt-brand-epigamia-co-founder-dies-at-42-due-to-cardiac-arrest-2653723-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Epigamia co-founder Rohan Mirchandani dies at 42 due to cardiac arrestRohan Mirchandani, co-founder of Epigamia, died due to cardiac arrest. Known for transforming India's food market, he led Epigamia's growth to over 20,000 retail outlets in 30 cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/dhaka-20-sheikh-hasina-fading-history-city-finds-hope-in-new-uncertainty-2652938-2024-12-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dhaka 2.0: Sheikh Hasina fading history, city finds hope in new uncertaintyThe writing is on the graffiti walls: the air of liberalism must sustain against rising radicalism. Political hullabaloo aside, good ol Dhaka retains its proud character"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-woman-broke-to-his-house-being-kissed-forcibly-2653707-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Varun Dhawan recalls scary incident of a woman breaking into his homeVarun Dhawan recalled a frightening incident involving a woman who was misled into believing he would run away with her, leading to her breaking into his house. He also discussed inappropriate encounters with fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-entertainment-business-sports-politics-439-20-12-2024?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-india-veto-choices-china-un-intimidated-to-conform-2653588-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "S Jaishankar says India won't be intimidated to conform: No veto on our choicesExternal Affairs Minister S Jaishankar said that India will not permit others to have a veto on its choices and stressed it would act in its interests \"without being intimidated to conform\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-sachin-tendulkar-record-border-gavaskar-trophy-2653683-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Virat Kohli eyes Sachin Tendulkar's historic Test record at MCG IND vs AUS: Virat Kohli scored a hundred in the second innings of the Perth Test, but he has struggled for most part of the series until now. Kohli now has a chance to break Sachin Tendulkar's record in the Boxing Day Test. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/shah-rukh-khan-gauri-khan-suhana-khan-katrina-kaif-ananya-panday-janhvi-kapoor-khushi-kapoor-agastya-nanda-nmacc-arts-cafe-preview-night-2653684-2024-12-22?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Pics: SRK-Gauri, Katrina Kaif, Ananya Panday at NMACC Arts Cafe previewThe Ambani family hosted a gala night for their film industry friends for the NMACC Arts Cafe preview on Saturday. Shah Rukh Khan with wife Gauri Khan and daughter Suhana Khan, actors Ananya Panday, Janhvi Kapoor, Orry, Karan Johar, and others, attended the event in their glam bests."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/elon-musk-germany-christmas-market-attack-suspect-taleb-a-saudi-arabia-ex-muslim-extradition-2653598-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Suicidal empathy: Elon Musk on Germany not extraditing market attacker to SaudiElon Musk shared a thread on X, which alleged that Taleb A, a Saudi doctor suspected of ramming his car into a crowd at a Christmas market in Germany, fled his country in 2006 after being accused of rape and implicated in serious crimes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bihar-muzaffarpur-attack-viral-video-men-police-case-2653604-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man thrashed, forced to lick spit in Bihar's Muzaffarpur, attackers record videoA group of men assaulted and humiliated a man in Bihar Muzaffarpur and filmed the act and uploaded the video online. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-kashmir-winter-srinagar-records-coldest-december-night-in-50-years-temperature-drops-2653649-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Srinagar records coldest December night in 50 years, temperature drops to minus 8° CSrinagar's Friday night temperature dropped from minus 6.2 degrees Celsius to minus 8.5 degrees Celsius, marking its coldest December night since 1974, when the mercury hit minus 10.3 degrees Celsius. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/story/cid-season-2-episode-1-x-review-fans-love-it-2653776-2024-12-22",
      "headline": "CID 2 X reviews: Fans feel nostalgic after watching episode 1, praise visualsCID has returned with its highly-anticipated second season, delighting fans with the comeback of the iconic trio -- ACP Pradyuman, Inspector Abhijeet, and Inspector Daya. The internet has reacted to the first episode of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prashanth-neel-prabhas-salaar-disappointed-make-up-salaar-2-2653748-2024-12-22",
      "headline": "Filmmaker Prashanth Neel was 'little disappointed' with SalaarPrashanth Neel, the director of Salaar, expressed his slight disappointment with his 2023 film, especially after the success of KGF 2. However, he is determined to exceed expectations with Salaar 2, which he believes will be one of his best works."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-statement-for-fans-no-abusive-language-behaviour-warns-fake-fans-2653732-2024-12-22",
      "headline": "Allu Arjun's appeal to fans: Don't resort to abusive language or behaviourAllu Arjun shared a note for his fans on Sunday, urging them to refrain from abusive behaviour. He also cautioned those misrepresenting his fans with fake IDs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-day-75-varun-dhawan-salman-khan-congratulate-keerthy-suresh-wamiqa-gabbi-2653724-2024-12-22",
      "headline": "BB 18 Day 75: Varun Dhawan asks Salman Khan to congratulate KeerthyIn a special episode of Bigg Boss 18, Varun Dhawan, Keerthy Suresh, and Wamiqa Gabbi promoted their film Baby John, with Varun asking Salman Khan to congratulate Keerthy on her wedding. Meanwhile, housemate Shrutika Arjun faced criticism from others for her role in Digvijay Rathee's eviction."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-shares-adorable-picture-with-wife-sanjana-ganesan-ahead-of-mcg-test-2653770-2024-12-22",
      "headline": "Jasprit Bumrah shares adorable picture with wife Sanjana Ganesan ahead of MCG TestJasprit Bumrah shared an adorable picture with wife Sanjana Ganesan ahead of the Boxing Day Test. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/mcsweeney-had-hard-start-in-career-vaughan-suggests-alternate-batting-position-2653758-2024-12-22",
      "headline": "McSweeney had hard start in his career: Vaughan suggests alternate batting positionMichael Vaughan sympathised with Nathan McSweeney after the 25-year-old was dropped from Australia's squad for the final two Tests. Sam Konstas has been given an opportunity for the MCG and SCG Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-harmanpreet-kaur-ms-dhoni-india-women-vs-west-indies-women-2653757-2024-12-22",
      "headline": "Captain Harmanpreet Kaur joins MS Dhoni, Virat Kohli in elite clubINDW vs WIW, 1st ODI: Harmanpreet Kaur completed 1000 runs as ODI skipper as India and West Indies locked horns in the opening ODI on Sunday at the Kotambi Stadium in Vadodara. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-cheteshwar-pujara-mitchell-starc-aus-vs-ind-border-gavaskar-trophy-2024-25-2653746-2024-12-22",
      "headline": "Mitchell Starc more dangerous for India than Pat Cummins: Cheteshwar PujaraIndia batter Cheteshwar Pujara has praised Mitchell Starc's performance in the ongoing Test series against India saying that he's looking a lot more dangerous than Pat Cummins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/after-test-snub-mcsweeney-smacks-4-fours-in-an-over-to-hit-brisk-fifty-in-bbl-2653740-2024-12-22",
      "headline": "After Test snub, McSweeney smacks 4 fours in an over to hit a brisk fifty in BBLNathan McSweeney played a match-winning knock for Brisbane Heat against the Adelaide Strikers in the Big Bash League. The 25-year-old was excluded from Australia's squad for the Boxing Day Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-england-squad-india-tour-odis-t20is-jos-buttler-2653728-2024-12-22",
      "headline": "England name squads for India ODI, T20Is, Buttler to lead   IND vs ENG: Joe Root has returned as England named their ODI and T20I squad for the upcoming tour of India. Ben Stokes missed the bus after sustaining an injury in the Test series against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-england-squad-for-icc-champions-trophy-2025-ben-stokes-joe-root-england-tour-of-india-2653719-2024-12-22",
      "headline": "Joe Root named in England's Champions Trophy squad, Ben Stokes misses out England announced a 15-member squad for the ICC Champions Trophy 2025 and India tour on Sunday, December 22. Joe Root has marked his return to the ODI setup after the World Cup 2023 while Ben Stokes misses out due to injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/smriti-mandhana-misses-out-on-hundred-in-1st-odi-enters-all-time-unlucky-list-2653718-2024-12-22",
      "headline": "Smriti Mandhana misses out on hundred in 1st ODI, enters all-time unlucky listSmriti Mandhana missed out on a well-deserved hundred in the 1st ODI between India and West Indies' women's ODI contest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharma-ravi-shastri-border-gavaskar-trophy-2024-25-aus-vs-ind-ind-vs-aus-2653713-2024-12-22",
      "headline": "Rohit must attack the opposition and not worry about anything: Ravi ShastriFormer India cricketer Ravi Shastri has asked India captain Rohit Sharma to bat with an attacking approach in the last two Tests against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sam-konstas-mcg-boxing-day-test-match-2653712-2024-12-22",
      "headline": "Confident Konstas ready for 'the big leagues' ahead of potential debut at MCGIND vs AUS: Youngster Sam Konstas was added to the Australia squad ahead of the Boxing Day Test match in Melbourne. The confident batter said that he was ready for the challenge.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-england-squad-india-tour-odis-t20is-jos-buttler-2653728-2024-12-22",
      "headline": "England name squads for India ODI, T20Is, Buttler to lead   IND vs ENG: Joe Root has returned as England named their ODI and T20I squad for the upcoming tour of India. Ben Stokes missed the bus after sustaining an injury in the Test series against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-england-squad-for-icc-champions-trophy-2025-ben-stokes-joe-root-england-tour-of-india-2653719-2024-12-22",
      "headline": "Joe Root named in England's Champions Trophy squad, Ben Stokes misses out England announced a 15-member squad for the ICC Champions Trophy 2025 and India tour on Sunday, December 22. Joe Root has marked his return to the ODI setup after the World Cup 2023 while Ben Stokes misses out due to injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/smriti-mandhana-misses-out-on-hundred-in-1st-odi-enters-all-time-unlucky-list-2653718-2024-12-22",
      "headline": "Smriti Mandhana misses out on hundred in 1st ODI, enters all-time unlucky listSmriti Mandhana missed out on a well-deserved hundred in the 1st ODI between India and West Indies' women's ODI contest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharma-ravi-shastri-border-gavaskar-trophy-2024-25-aus-vs-ind-ind-vs-aus-2653713-2024-12-22",
      "headline": "Rohit must attack the opposition and not worry about anything: Ravi ShastriFormer India cricketer Ravi Shastri has asked India captain Rohit Sharma to bat with an attacking approach in the last two Tests against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sam-konstas-mcg-boxing-day-test-match-2653712-2024-12-22",
      "headline": "Confident Konstas ready for 'the big leagues' ahead of potential debut at MCGIND vs AUS: Youngster Sam Konstas was added to the Australia squad ahead of the Boxing Day Test match in Melbourne. The confident batter said that he was ready for the challenge.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pratika-rawal-india-women-vs-west-indies-women-debut-2653706-2024-12-22",
      "headline": "Who is Pratika Rawal? Meet India Women's 150th ODI cricketerIND-W vs WI-W, 1st ODI: Pratika Rawal made her ODI debut on Sunday against the Hayley Matthews-led West Indies, and it was Smriti Mandhana who gave the batter her maiden international cap. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-what-is-indias-record-in-the-much-coveted-boxing-day-test-2653696-2024-12-22",
      "headline": "IND vs AUS: What is India's record in the coveted Boxing Day Test?India are set to play Australia next in Melbourne, in the Boxing Day Test match. What is India's record at the iconic Melbourne Cricket Ground?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/ind-vs-aus-4th-test-akash-deep-press-conference-2653688-2024-12-22",
      "headline": "Was not trying to save follow-on: Akash Deep on Gabba heroicsIndia pacer Akash Deep attended the press conference on Sunday, December 22. He spoke about the dressing room environment after his and Bumrah's heroic partnership in Gabba."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-sachin-tendulkar-record-border-gavaskar-trophy-2653683-2024-12-22",
      "headline": "Virat Kohli eyes Sachin Tendulkar's historic Test record at MCG IND vs AUS: Virat Kohli scored a hundred in the second innings of the Perth Test, but he has struggled for most part of the series until now. Kohli now has a chance to break Sachin Tendulkar's record in the Boxing Day Test. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-bgt-bowling-combination-2653673-2024-12-22",
      "headline": "Cheteshwar Pujara concerned about Indian bowling combination for MCG TestIndia batter Cheteshwar Pujara is concerned about the Indian bowling line-up ahead of the Boxing Day Test match. Pujara feels that the team's bowling is looking slightly weak going into the 4th Test match.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-asia-cup-2024-gongadi-trisha-final-2653648-2024-12-22",
      "headline": "Who is G Trisha? India's U19 World Cup winner, now U19 Asia Cup hero Under-19 Women's Asia Cup 2024: 19-year-old Gongadi Trisha scored a match-winning half-century in the final against Bangladesh, which also helped her win the Player of the Match award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/delhi-sg-pipers-rajkumar-pal-aiming-for-hockey-india-league-spotlight-2653638-2024-12-22",
      "headline": "Delhi SG Pipers' Rajkumar Pal aiming for Hockey India League spotlightIn an exclusive interaction with Indiatoday.in, Delhi SG Pipers' Rajkumar Pal opens up about taking the spotlight with his performances and being realistic about the chances of his side in the 2024-25 season of the Hockey India League. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-bgt-bowling-combination-2653673-2024-12-22",
      "headline": "Cheteshwar Pujara concerned about Indian bowling combination for MCG TestIndia batter Cheteshwar Pujara is concerned about the Indian bowling line-up ahead of the Boxing Day Test match. Pujara feels that the team's bowling is looking slightly weak going into the 4th Test match.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-asia-cup-2024-gongadi-trisha-final-2653648-2024-12-22",
      "headline": "Who is G Trisha? India's U19 World Cup winner, now U19 Asia Cup hero Under-19 Women's Asia Cup 2024: 19-year-old Gongadi Trisha scored a match-winning half-century in the final against Bangladesh, which also helped her win the Player of the Match award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/delhi-sg-pipers-rajkumar-pal-aiming-for-hockey-india-league-spotlight-2653638-2024-12-22",
      "headline": "Delhi SG Pipers' Rajkumar Pal aiming for Hockey India League spotlightIn an exclusive interaction with Indiatoday.in, Delhi SG Pipers' Rajkumar Pal opens up about taking the spotlight with his performances and being realistic about the chances of his side in the 2024-25 season of the Hockey India League. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-under-19-womens-asia-cup-niki-prasad-elated-win-bowlers-final-2653634-2024-12-22",
      "headline": "Bowlers did a fantastic job: Niki Prasad on historic Asia Cup triumphUnder-19 Women's Asia Cup 2024: Captain Niki Prasad praised Gongadi Trisha and the Indian bowlers for putting their best foot forward in the final on Sunday against Bangladesh in Kuala Lumpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-bgt-akash-deep-press-conference-melbourne-2653633-2024-12-22",
      "headline": "Disciplined Akash Deep credits Rohit-Kohli for massive growth-curve in AustraliaIndia pacer Akash Deep credited senior batters Virat Kohli and Rohit Sharma for the betterment of young India fast bowlers. The seamer credited the duo for helping young pacers not look like novices on their first tour of Australia.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-under-19-womens-asia-cup-india-vs-bangladesh-final-niki-prasad-2653615-2024-12-22",
      "headline": "India win Under-19 Women's Asia Cup 2024 title after beating Bangladesh Niki Prasad's India defeated Bangladesh by 41 runs in the final on Sunday, December 22, to become champions in the inaugural edition of the Under-19 Women's Asia Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-akash-deep-bgt-series-level-melbourne-test-2653613-2024-12-22",
      "headline": "India high on confidence after Gabba: Akash Deep feels series 50-50 ahead of MCGIndia seamer Akash Deep believes that the Border-Gavaskar Trophy is 50-50 going into the final two Test matches of the series. The pacer spoke to the press on Sunday and updated about the mood of the Indian camp ahead of the MCG Test."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}