{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-under-old-tax-regime-new-itr-rules-you-should-know-in-2025-2738486-2025-06-10",
      "headline": "Filing under old tax regime? New ITR rules you should know in 2025Key changes in the Income Tax Return (ITR) filing process for those opting for the old tax regime in the Assessment Year 2025–26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-currency-rupee-under-pressure-asia-currencies-ahead-weak-dollar-2738483-2025-06-10",
      "headline": "Rupee stuck in neutral as Asia's currencies race ahead on weak dollarWhile the Singapore dollar, Korean won, and Taiwanese dollar have jumped between 6% and 9.5% so far this year, the rupee has barely moved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-sips-continue-strong-run-touch-rs-26688-crore-in-may-latest-amfi-data-2738454-2025-06-10",
      "headline": "Mutual fund SIPs continue strong run, touch Rs 26,688 crore in May: AMFIMutual fund SIPs reached a fresh high of Rs 26,688 crore in May, inching up from Rs 26,632 crore the previous month, as per AMFI data released on June 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rcb-new-owner-stake-sale-diageo-ipl-cricket-team-virat-kohli-rajat-patidar-report-2738430-2025-06-10",
      "headline": "RCB to get new owner? Diageo looking for stake sale, says reportDiageo Plc, the British company that owns RCB through its Indian arm United Spirits Ltd., is exploring options to sell a part or all of its stake in the franchise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-to-pay-zero-tax-by-setting-up-in-dubai-coinswitch-co-founder-ashish-singhal-calls-it-a-trap-2738408-2025-06-10",
      "headline": "Planning to pay 0 tax by setting up in Dubai? Coinswitch co-founder calls it a trapStarting a company in Dubai sounds appealing with no income tax and easy formalities. But if you operate from India, authorities might still consider it an Indian firm. Here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lilavati-trust-hits-back-at-hdfc-bank-rejects-outstanding-dues-2738409-2025-06-10",
      "headline": "Lilavati Trust hits back at HDFC Bank, rejects outstanding duesIn a sharply worded statement issued Monday, the Trust asserted that neither it nor its permanent trustee Prashant Kishor Mehta has ever borrowed from HDFC Bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paras-defence-share-price-today-stock-plit-record-date-announcement-2738378-2025-06-10",
      "headline": "Paras Defence shares in focus today, rise over 1% in early trade. Here's whyAlongside the 1:2 stock split, Paras Defence also declared its first-ever dividend of Rs 0.50 per share during its Q4 FY25 earnings on April 30. The announcement came on the back of a strong financial performance for the quarter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bengaluru-paying-guest-crisis-explained-2738365-2025-06-10",
      "headline": "Bengaluru's PG crisis: What's behind the mass shutdowns?Once the lifeline for Bengaluru's migrant workforce, why are PGs now vanishing from the city's tech hubs at an alarming pace? Read on know why hundreds of PG accommodations have shut down in the city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-100-points-higher-nifty-above-25100-ntpc-gains-1-percent-2738360-2025-06-10",
      "headline": "Sensex, Nifty extend gains at open but lose steam as profit booking sets inThe S&P BSE Sensex added 68.34 points to 82,513.55, while the NSE Nifty50 gained 19.40 points to 25,128.05 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hiring-news-india-jobs-it-real-estate-september-quarter-q2-fy26-uae-china-asia-report-2738359-2025-06-10",
      "headline": "Hiring plans steady in India Inc for Q3 FY25: ReportIndia ranked second globally, behind the UAE, which reported the strongest hiring sentiment. India reported a Net Employment Outlook (NEO) of 42%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-trading-setup-nse-bse-sensex-nifty-open-higher-global-rbi-policy-2738347-2025-06-10",
      "headline": "Stock market opening today: Sensex, Nifty likely to open higher. Here's whyThe Sensex and Nifty are likely to extend their gains, helped by improving hopes around global trade discussions and the Reserve Bank of India's (RBI) policy measures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-10-nse-bse-trading-wipro-tech-mahindra-motilal-oswal-premier-energies-2738334-2025-06-10",
      "headline": "Stocks to watch on June 10: Wipro, Tech Mahindra, Motilal Oswal, Premier EnergiesSensex and Nifty rose nearly half a percent in the last session, driven by favourable trends in both domestic and global markets. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jackson-wang-namaste-arrives-india-mumbai-visit-promotes-magic-man-2-album-2738472-2025-06-10",
      "headline": "K-pop idol Jackson Wang greets with a namaste as he arrives in IndiaK-pop idol Jackson Wang has arrived in Mumbai for an extended visit to promote his new album and engage with fans. This trip signals a deeper cultural connection and growing K-pop focus on India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/remo-dsouza-accused-copying-dance-moves-in-housefull-5-laal-pari-by-influencer-sandip-brahamin-2738443-2025-06-10",
      "headline": "Influencer accuses Remo D'Souza of copying dance moves in Housefull 5's Laal PariA social media influencer, Sandip Brahamin, has accused Bollywood choreographer Remo D'Souza of copying his dance moves in 'Housefull 5' song Laal Pari.  The makers of the film and Remo D'Souza are yet to respond to his claims.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vivek-agnihotri-renames-the-delhi-files-to-the-bengal-files-on-public-demand-2738399-2025-06-10",
      "headline": "Vivek Agnihotri renames The Delhi Files to The Bengal Files on public demandFilmmaker Vivek Agnihotri has announced a new title for his upcoming political drama, earlier called 'The Delhi Files'. The filmmaker has changed the name to 'The Bengali Files' due to public demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/katrina-kaif-named-global-tourism-ambassador-of-the-maldives-ahead-of-pm-modi-visit-2738424-2025-06-10",
      "headline": "Maldives names Katrina Kaif as global tourism ambassador ahead of PM Modi's visitActor Katrina Kaif was announced as the global tourism ambassador for the Maldives on Tuesday. The development comes a month before PM Modi's scheduled visit to the island country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-wife-upasana-kamineni-newlyweds-akhil-akkineni-zainab-ravdjee-new-pics-2738419-2025-06-10",
      "headline": "Ram Charan, wife Upasana celebrate newlyweds Akhil Akkineni, Zainab with new picsRam Charan and his wife Upasana Kamineni wished newlyweds Akhil Akkineni and Zainab Ravdjee. She shared new pictures from their intimate wedding and reception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-launches-badminton-school-on-father-prakash-padukone-70th-birthday-2738405-2025-06-10",
      "headline": "Deepika Padukone announces badminton school in birthday post for father PrakashDeepika Padukone dedicated a beautiful note to her father and legendary badminton player, Prakash Padukone, as she announced the launch of the 'Padukone School of Badminton' on his 70th birthday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/gurdas-maans-brother-gurpanth-dies-at-68-in-mohali-last-rites-to-be-held-today-2738388-2025-06-10",
      "headline": "Gurdas Maan's brother Gurpanth dies at 68 in Mohali, last rites to be held todayPunjabi singer-turned-actor Gurdas Maan's younger brother reportedly died in Mohali on Monday. His last rites will be held today (June 10) in Chandigarh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neha-dhupia-backs-deepika-padukone-8-hour-shift-call-says-new-moms-need-practical-support-2738398-2025-06-10",
      "headline": "Neha Dhupia backs Deepika's 8-hour shift call, says new moms need practical supportActor Neha Dhupia wrote a note on social media, supporting Deepika Padukone's reported demand for an eight-hour work shift. She tagged Padukone on her Instagram stories, telling all that new mothers don't just require lip service. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-box-office-collection-day-4-detailed-report-akshay-kumar-film-fastest-in-franchise-to-enter-rs-100-crore-club-2738370-2025-06-10",
      "headline": "Housefull 5 box office Day 4: Fastest film in franchise to enter Rs 100 crore clubAkshay Kumar's 'Housefull 5' surpassed the Rs 100 crore-mark in India after five days of theatrical run. The film witnessed a drop on Monday, but nothing that wasn't expected or could play a deterrent in its longer run. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/amanda-seyfried-accuses-paramount-owes-her-money-mean-girls-merchandise-2738354-2025-06-10",
      "headline": "Amanda Seyfried accuses Paramount of owing her money for Mean Girls merchandiseActor Amanda Seyfried has revealed that she has not received royalties from Paramount Pictures for 'Mean Girls' merchandise featuring her image. The issue extends to other cast members, raising concerns about unpaid earnings from the popular 2004 teen film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/thug-life-failure-mani-ratnam-women-characters-trisha-abhirami-aishwarya-lekshmi-2738079-2025-06-10",
      "headline": "How Kamal Haasan's Thug Life failed its women: Trisha, Abhirami, Aishwarya LekshmiDirector Mani Ratnam's 'Thug Life', starring Kamal Haasan and Silambarasan, has been receiving mixed reviews from critics and audiences. However, the biggest injustice was meted out to the women in the film, played by Trisha Krishnan, Abhirami and Aishwarya Lekshmi.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-are-back-kings-of-k-pop-after-military-enlistment-2738339-2025-06-10",
      "headline": "BTS are back: What to expect from the return of Kings of K-popBTS members have started returning from military service, marking the end of a long hiatus and sparking excitement across the K-pop world. HYBE shares have surged as fans and investors anticipate a major comeback and global tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-box-office-collection-day-5-kamal-haasan-mani-ratnam-film-lowest-monday-2738327-2025-06-10",
      "headline": "Thug Life box office Day 5: Is Kamal Haasan's film heading towards a disaster?Kamal Haasan and director Mani Ratnam's 'Thug Life' is struggling to strike big at the box office. The film recorded its lowest Monday collection ever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-v-and-rm-complete-military-service-promise-album-and-concerts-real-soon-2738318-2025-06-10",
      "headline": "BTS' RM and V complete military service, promise album and concerts 'real soon'BTS members RM and V are now back after serving their mandatory military service. They expressed their desire to return to the stage after releasing an album 'real soon.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/new-faces-join-harry-potter-hbo-series-meet-the-malfoys-dursleys-and-more-glbs-2738304-2025-06-10",
      "headline": "New faces join Harry Potter HBO series: Meet the Malfoys, Dursleys, and moreHBO reveals nine new cast members for its upcoming Harry Potter TV series, promising a faithful adaptation of The Sorcerer's Stone. The series will stream exclusively on Max in multiple countries.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sly-stone-groundbreaking-musician-behind-family-affair-dies-in-los-angeles-glbs-2738300-2025-06-10",
      "headline": "Sly Stone, groundbreaking musician behind 'Family Affair,' dies in Los AngelesSly Stone, iconic frontman of Sly and the Family Stone, died at 82. Known for revolutionizing funk and promoting unity through music, his influence shaped decades of American sound and culture.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/diddys-ex-girlfriend-recounts-trauma-in-wake-of-cassies-abuse-claims-glbs-2738298-2025-06-10",
      "headline": "Diddy's ex-girlfriend recounts trauma in wake of Cassie's abuse claimsDiddy's ex-girlfriend broke down in court, saying Cassie's abuse lawsuit mirrored her own trauma. She testified about coerced sex, emotional abuse, and threats linked to her housing and relationship with Combs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/judge-dismisses-justin-baldonis-400-million-defamation-lawsuit-against-blake-lively-glbs-2738291-2025-06-10",
      "headline": "Judge dismisses Justin Baldoni's $400 million defamation lawsuit against Blake LivelyA US judge dismissed Justin Baldoni's $650 million lawsuits against Blake Lively, Ryan Reynolds, and others, ruling insufficient evidence of defamation. A separate trial between Baldoni and Lively begins in 2026.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/frederick-forsyth-author-of-the-day-of-the-jackal-dies-at-86-glbs-2738290-2025-06-10",
      "headline": "Frederick Forsyth, author of 'The Day of the Jackal, dies at 86Frederick Forsyth, bestselling author of The Day of the Jackal, died at 86. A former RAF pilot and journalist, he secretly aided MI6 and leaves behind a legacy of iconic thrillers.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/ktaka-hc-asks-govt-nine-questions-bengaluru-stampede-case-procedural-blunders-2738428-2025-06-10",
      "headline": "Karnataka High Court's 9 big questions to state in Bengaluru stampede caseThe Karnataka High Court sharply criticised the state government while hearing petitions in the Bengaluru stampede case. It questioned procedural lapses, sought accountability and demanded answers to nine key queries regarding crowd management, permissions and emergency preparedness. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sonam-raghuvanshi-raja-murder-honeymoon-meghalaya-chat-sources-indore-2738381-2025-06-10",
      "headline": "Don't like husband getting intimate, Indore woman texted 'lover' days before murderMeghalaya murder case: Sonam Raghuvanshi, accused of killing her husband Raja Raghuvanshi on their honeymoon in Meghalaya, told her lover she did not like her husband getting intimate with her, sources told India Today TV."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/story/huge-fire-breaks-out-at-apartment-in-delhis-dwarka-at-least-2-persons-trapped-2738393-2025-06-10",
      "headline": "Father, two children jump to death while escaping fire at home in Delhi's DwarkaThree members of a family jumped to death after a fire broke out at their apartment on the seventh floor of a multi-storied building. The incident took place in Delhi's Dwarka area on Tuesday morning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/700-us-marines-land-in-la-as-california-sues-trump-over-guard-deployment-glbs-2738297-2025-06-10",
      "headline": "700 Marines, 2,000 additional National Guards sent to LA as Trump doubles downAs the protests enter their fourth day, the deployment of 700 marines in Los Angeles, described as temporary, is intended to support National Guard forces already on the ground. Meanwhile, California has sued the Trump administration, calling the federal deployment unlawful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/five-reasons-why-the-indian-sub-continent-has-changed-post-operation-sindoor-2738471-2025-06-10",
      "headline": "Five reasons why Indian sub-continent has changed post Operation SindoorFrom ending Pak nuclear blackmail to boosting Indian weapons - Operation Sindoor is the biggest masterstroke since the 1998 Pokharan nuclear tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/weather-department-issues-red-alert-for-heatwave-in-delhi-for-next-3-days-predicts-rain-over-the-weekend-2738467-2025-06-10",
      "headline": "Red alert for heatwave in Delhi for next 3 days, then a rain breatherThe heat wave will be followed by storms and rain over the weekend. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/karnataka-government-planned-rcb-event-invited-governor-to-vidhana-soudha-raj-bhavan-on-stampede-row-2738384-2025-06-10",
      "headline": "Chief Minister planned RCB event, invited Governor: Raj Bhavan on stampede rowKarnataka Raj Bhavan sources claim the state government invited the Governor to the Vidhana Soudha felicitation for RCB. This contradicts Chief Minister Siddaramaiah's claim that the event wasn't government-organised. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-students-harvard-university-us-donald-trump-visa-crackdown-2738466-2025-06-10",
      "headline": "Should we stay or leave? Indian students at Harvard caught in Trump's crossfireIndian students at Harvard are facing a \"rollercoaster\" of uncertainty and anxiety amid the Donald Trump administration's relentless crackdown on the prestigious university. They are wondering whether to go back to India or stay in the US for job opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-launches-badminton-school-on-father-prakash-padukone-70th-birthday-2738405-2025-06-10",
      "headline": "Deepika Padukone announces badminton school in birthday post for father PrakashDeepika Padukone dedicated a beautiful note to her father and legendary badminton player, Prakash Padukone, as she announced the launch of the 'Padukone School of Badminton' on his 70th birthday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rcb-new-owner-stake-sale-diageo-ipl-cricket-team-virat-kohli-rajat-patidar-report-2738430-2025-06-10",
      "headline": "RCB to get new owner? Diageo looking for stake sale, says reportDiageo Plc, the British company that owns RCB through its Indian arm United Spirits Ltd., is exploring options to sell a part or all of its stake in the franchise. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bengaluru-paying-guest-crisis-explained-2738365-2025-06-10",
      "headline": "Bengaluru's PG crisis: What's behind the mass shutdowns?Once the lifeline for Bengaluru's migrant workforce, why are PGs now vanishing from the city's tech hubs at an alarming pace? Read on know why hundreds of PG accommodations have shut down in the city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-musk-feud-us-president-president-phone-call-tesla-chief-us-immigration-2738459-2025-06-10",
      "headline": "He wants to speak to me: Donald Trump on plans to speak to Musk on phoneUS President Donald Trump said he has no immediate plans to speak with Telsa chief Elon Musk, days after their public fallout over a Republican tax bill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/thug-life-failure-mani-ratnam-women-characters-trisha-abhirami-aishwarya-lekshmi-2738079-2025-06-10",
      "headline": "How Kamal Haasan's Thug Life failed its women: Trisha, Abhirami, Aishwarya LekshmiDirector Mani Ratnam's 'Thug Life', starring Kamal Haasan and Silambarasan, has been receiving mixed reviews from critics and audiences. However, the biggest injustice was meted out to the women in the film, played by Trisha Krishnan, Abhirami and Aishwarya Lekshmi.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chenab-rail-bridge-project-dr-madhavi-latha-of-iisc-bengaluru-unsung-heroes-2738350-2025-06-10",
      "headline": "IISc professor salutes unsung heroes as support pours in for Chenab Bridge successDr G Madhavi Latha said that thousands of people have contributed significantly to the construction of the iconic Chenab Rail Bridge and she salutes their efforts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/one-nation-one-election-jpc-pp-chaudhary-simultaneous-polls-start-date-2034-why-explained-2738270-2025-06-10",
      "headline": "Why One Nation, One Election might have to wait till 2034The One Nation, One Election initiative will not be implemented before 2034, reiterated BJP MP PP Chaudhary, who is heading the Joint Parliamentary Committee on the proposed Bill. The delay is due to several complex constitutional changes, logistical challenges, and the need for extensive political consensus that the Chaudhary-led panel is working on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/air-force-chief-speaks-to-gp-capt-shubhanshu-shukla-ahead-of-space-launch-2738452-2025-06-10",
      "headline": "IAF chief speaks to Gp. Capt. Shubhanshu Shukla ahead of space launchThe IAF conveyed its support and pride in an official post on X, highlighting the significance of this mission for the nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/australian-journalist-lauren-tomasi-shot-reporting-la-protests-shares-powerful-message-2738361-2025-06-10",
      "headline": "Important to keep on telling stories: Journalist after being shot at LA protestAn Australian reporter hit by a rubber bullet during immigration raid protests in Los Angeles, US, shared a powerful message after the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ed-attaches-92-properties-worth-rs-100-crore-in-muda-scam-probe-in-karnataka-2738468-2025-06-10",
      "headline": "ED attaches Rs 100 crore assets held by proxies in Muda case involving SiddaramaiahThe Enforcement Directorate has attached 92 properties worth Rs 100 crore held by dummy owners in Muda scam probe involving Karnataka Chief Minister Siddaramaiah, his wife and others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/how-to-download-and-install-ios-26-with-apples-stunning-new-liquid-design-on-your-iphone-today-2738375-2025-06-10",
      "headline": "How to download and install iOS 26 with Apple's stunning new design on iPhoneApple has officially rolled out the first developer version of iOS 26 just hours after it was announced at WWDC 2025. Here is how to download and install the latest iOS 26 version, which brings Apple's stunning new liquid glass design to your iPhone today."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fire-explosions-persist-aboard-cargo-ship-off-kerala-coast-salvage-ops-underway-2738420-2025-06-10",
      "headline": "Video: Fire, explosions continue on cargo ship off Kerala coast, firefighting onA major fire and explosions aboard the Singapore-flagged container ship MV Wan Hai 503 off the Kerala coast triggered ongoing firefighting and salvage operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/tiny-notes-big-dreams-what-pocket-money-taught-90s-kids-2738447-2025-06-10",
      "headline": "Tiny notes, big dreams: What pocket money taught 90s kidsThat humble Rs 10 note handed over once a month taught the art of budgeting long before Excel sheets existed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/chennai/story/tn-chennai-13-year-old-minor-girl-sexually-assaulted-leg-broken-in-government-shelter-security-guard-arrested-2738385-2025-06-10",
      "headline": "13-year-old girl sexually assaulted, leg broken inside Chennai government shelterA 13-year-old girl was sexually assaulted and left with a broken leg inside a government-run shelter in Chennai. The accused, a long-time security guard at the facility, was arrested after the survivor identified him. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/election-commission-rahul-gandhi-not-filing-formal-complaint-allegations-of-rigging-maharashtra-assembly-polls-2738387-2025-06-10",
      "headline": "Why no formal complaint? Poll body pulls up Rahul Gandhi over rigging remarksAccording to Election Commission sources, despite Rahul Gandhi's public statements alleging irregularities or raising concerns, no formal complaint or request for a meeting has been submitted by him, even two days after the remarks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/meghalaya-case-indore-woman-lover-caught-for-plotting-murder-attended-husbands-funeral-2738404-2025-06-10",
      "headline": "Video: Indore woman's lover attended her husband's funeral, seen consoling fatherAccording to eyewitnesses, Raj had brought along several people with him to Raja's funeral. On June 2, Raja's body was discovered inside a gorge by the Meghalaya Police. Soon after, his body was brought to his hometown, Indore, for funeral."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-viswanathan-anand-return-world-rapid-and-blitz-championship-2738484-2025-06-10",
      "headline": "Viswanathan Anand set to make return in World Rapid and Blitz team championshipFive-time world champion Viswanathan Anand returns to compete in the World Rapid and Blitz team chess championship. The tournament features top international players but misses Magnus Carlsen, adding intrigue to the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharmas-test-average-wouldve-dropped-to-30s-in-england-sanjay-manjrekar-2738461-2025-06-10",
      "headline": "Rohit Sharma's Test average would've dropped to 30s in England: Sanjay ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar said that Rohit Sharma's Test average would've taken a massive hit, had he decided to play in the upcoming England series beginning from June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-south-africa-vs-australia-nathan-lyon-lords-2738438-2025-06-10",
      "headline": "World Test Championship final key to Australia's quest for greatness: Nathan LyonNathan Lyon emphasises the importance of the World Test Championship final for Australia's cricketing journey to becoming one of the greatest Test sides of all time. The Aussies aim to retain their crown while facing a tough South African side at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhonis-hands-are-faster-than-a-pickpocket-ravi-shastri-2738416-2025-06-10",
      "headline": "MS Dhoni's hands are faster than a pickpocket: Ravi Shastri leaves crowd in splitsFormer India cricketer and head coach Ravi Shastri compared MS Dhoni's quick glovework as a wicketkeeper with a pickpocket. Dhoni has been included in the prestigious ICC Hall of Fame becoming the 11th player to achieve the honour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/world-cup-qualifiers-lionel-messi-argentina-vs-colombia-scaloni-2738417-2025-06-10",
      "headline": "Argentina can play the same way with or without Lionel Messi: Lionel ScaloniArgentina manager Lionel Scaloni says the team can play similarly whether Lionel Messi is in the squad or not. Argentina are all set to play Colombia in their World Cup Qualifier match in Buenos Aires on June 10"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pat-cummins-missing-india-in-the-wtc-final-2025-sa-vs-aus-2738394-2025-06-10",
      "headline": "Pat Cummins missing India in the WTC final: Always expect them to be aroundAustralia captain Pat Cummins said that it was nice to face another opposition apart from India in the World Test Championship (WTC) final as they always make it to the finals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/2026-season-full-schedule-madrid-grand-prix-fia-2738396-2025-06-10",
      "headline": "Formula 1 reveals 2026 calendar, Madrid's debut date revealed in 24-race seasonFormula One and the FIA released the full schedule for the 2026 season as the new car regulations will come into place. The debut date for the Madrid Grand Prix was also revealed on Tuesday, April 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-test-series-arshdeep-singh-debut-kent-2738383-2025-06-10",
      "headline": "Churros, cool breeze and warm sun: Arshdeep Singh happy to be back in 2nd home KentArshdeep Singh returns to Kent, his second home, to prepare for the upcoming India-England Test series. His focus is on regaining red-ball rhythm and improving skills alongside star pacer Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-breaks-stadiums-roof-with-monstrous-six-during-practice-2738369-2025-06-10",
      "headline": "Watch: Rishabh Pant breaks stadium's roof with monstrous six during practiceIndia wicketkeeper batter Rishabh Pant damaged the stadium's roof during a practice session ahead of the five-match Test series against England set to begin from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-england-lions-report-card-kl-rahul-yashasvi-jaiswal-canterbury-2738363-2025-06-10",
      "headline": "KL Rahul A+, Yashasvi Jaiswal D: Report card of Indian stars in India A vs England LionsThe Indian stars got some good time in the middle during the India A vs England Lions series ahead of the start of the Test tour. While some impressed, others failed to make a mark as India get set for the first Test against England, starting on June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhonis-priceless-reaction-to-icc-hall-of-fame-honor-2738357-2025-06-10",
      "headline": "MS Dhoni's priceless reaction after being inducted in ICC Hall of FameLegendary India captain MS Dhoni was inducted into the ICC Hall of Fame amongst six other players. Dhoni said that it was a huge honour to join a club full of legends, and he will cherish it forever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/2026-season-full-schedule-madrid-grand-prix-fia-2738396-2025-06-10",
      "headline": "Formula 1 reveals 2026 calendar, Madrid's debut date revealed in 24-race seasonFormula One and the FIA released the full schedule for the 2026 season as the new car regulations will come into place. The debut date for the Madrid Grand Prix was also revealed on Tuesday, April 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-test-series-arshdeep-singh-debut-kent-2738383-2025-06-10",
      "headline": "Churros, cool breeze and warm sun: Arshdeep Singh happy to be back in 2nd home KentArshdeep Singh returns to Kent, his second home, to prepare for the upcoming India-England Test series. His focus is on regaining red-ball rhythm and improving skills alongside star pacer Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-breaks-stadiums-roof-with-monstrous-six-during-practice-2738369-2025-06-10",
      "headline": "Watch: Rishabh Pant breaks stadium's roof with monstrous six during practiceIndia wicketkeeper batter Rishabh Pant damaged the stadium's roof during a practice session ahead of the five-match Test series against England set to begin from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-england-lions-report-card-kl-rahul-yashasvi-jaiswal-canterbury-2738363-2025-06-10",
      "headline": "KL Rahul A+, Yashasvi Jaiswal D: Report card of Indian stars in India A vs England LionsThe Indian stars got some good time in the middle during the India A vs England Lions series ahead of the start of the Test tour. While some impressed, others failed to make a mark as India get set for the first Test against England, starting on June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhonis-priceless-reaction-to-icc-hall-of-fame-honor-2738357-2025-06-10",
      "headline": "MS Dhoni's priceless reaction after being inducted in ICC Hall of FameLegendary India captain MS Dhoni was inducted into the ICC Hall of Fame amongst six other players. Dhoni said that it was a huge honour to join a club full of legends, and he will cherish it forever."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}