{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wpi-inflation-stays-negative-in-november-despite-food-price-uptick-2836286-2025-12-15",
      "headline": "WPI inflation stays negative in November despite food price uptickGovernment data released on Monday showed Wholesale Price Index (WPI) inflation at (-) 0.32% in November, compared with (-) 1.21% in October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-exports-jump-19-in-november-trade-deficit-hits-5-month-low-2836273-2025-12-15",
      "headline": "India's exports jump 19% in November, trade deficit hits 5-month lowThe US remained India's largest export destination from April to November 2025, despite the imposition of a 50% tariff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-rebound-to-end-marginally-lower-as-fii-outflow-trouble-markets-2836204-2025-12-15",
      "headline": "Sensex, Nifty rebound to end marginally lower as FII outflow troubles marketThe S&P BSE Sensex was down by 54.30 points to close at 85,213.36, while the NSE Nifty50 lost 19.65 points to end at 26,027.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sbi-home-loan-rate-decrease-emis-rbi-repo-cut-check-new-rates-personal-finance-housing-demand-2836181-2025-12-15",
      "headline": "SBI reduces lending rates, EMIs likely to drop: Check new home loan ratesWith several major banks already passing on the benefit, SBI's move will directly help customers whose loans are linked to different lending benchmarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-at-record-highs-should-investors-buy-now-or-wait-2836126-2025-12-15",
      "headline": "Gold and silver at record highs. Should investors buy now or wait?Gold and silver prices are trading near record highs after a powerful rally this year. With both metals delivering strong returns, many investors are now wondering whether it still makes sense to buy or wait for a correction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/december-15-advance-tax-deadline-is-here-who-must-pay-and-what-happens-if-you-dont-2836086-2025-12-15",
      "headline": "December 15 advance tax deadline is here: Who must pay and what happens if you don'tThe third advance tax instalment is due today, December 15. For many taxpayers, missing this deadline could mean mandatory interest and a larger payment at the time of filing returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claimed-tax-refunds-using-fake-donations-heres-what-income-tax-department-is-doing-2836054-2025-12-15",
      "headline": "Claimed tax refunds using fake donations? Here's what income tax department is doingIf you claimed tax benefits by showing donations that were never made, the Income Tax Department may already be watching. Authorities have launched a fresh drive to identify and correct such false claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/labour-law-4-day-work-week-yes-no-ministry-clarification-48-hours-working-overtime-wage-2836041-2025-12-15",
      "headline": "4-day work week under new labour codes? Here's what Labour Ministry clarifiedOn November 21, 2025, the government replaced 29 old labour laws with four new Labour Codes and can Indians really work only four days a week and still get paid for a full week?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hindustan-zinc-share-price-target-rs-660-coverage-brokerage-firm-jefferies-bullish-why-2835994-2025-12-15",
      "headline": "Hindustan Zinc shares may climb to Rs 660. Here's why Jefferies is bullishAccording to brokerage firm Jefferies, the Rs 660 target price suggests a potential upside of around 22%, including a dividend yield of about 4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-200-points-lower-nifty-below-26000-ntpc-down-1-percent-2835962-2025-12-15",
      "headline": "Sensex opens 200 points lower, Nifty below 26,000; NTPC down 1%The S&P BSE Sensex was down by 394.84 points to 84,872.82, while the NSE Nifty50 lost 129.75 points to 25,917.20 as of 9:29 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-gifting-relative-family-sebi-rule-save-tax-how-steps-money-ltcg-stock-market-profit-2835960-2025-12-15",
      "headline": "Want to save tax? Here's how gifting mutual funds can help you with itA lesser-known method is gaining attention, gifting mutual fund units to relatives to legally reduce, or in some cases completely avoid, tax on capital gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/park-medi-world-ipo-allotment-status-check-online-guide-gmp-falls-lowest-listing-details-kfin-bse-2835949-2025-12-15",
      "headline": "Park Medi World IPO: Check allotment status as GMP falls to its lowestPark Medi World IPO closed with an overall subscription of 8.52 times, showing steady demand across categories even as premium expectations cooled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-codes-will-variable-pay-change-your-salary-pf-and-gratuity-2835692-2025-12-14",
      "headline": "New labour codes: Will variable pay change your salary, PF and gratuity?Will your take-home salary change under the new labour codes, and what will higher variable pay mean for your PF and gratuity in the long run? Let's understand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/goa-fire-tragedy-victim-compensation-insurance-claim-accidental-government-rules-actions-legal-help-2835385-2025-12-13",
      "headline": "Goa fire tragedy: From compensation to insurance, what victims can claimThe Uphaar cinema fire in Delhi, the Kumbakonam school blaze, the Mumbai Kamala Mills fire, the Surat coaching centre tragedy, each incident left behind not just casualties, but families pushed into years of legal battles simply to secure basic compensation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/johnson-johnson-ordered-to-pay-usd-40-million-to-2-women-in-talc-cancer-case-2835339-2025-12-13",
      "headline": "Johnson & Johnson ordered to pay $40 million to 2 women in talc powder caseThe verdict comes as the company faces tens of thousands of similar lawsuits nationwide and after its latest attempt to resolve the litigation through bankruptcy was rejected by US courts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-is-young-india-really-spending-money-hint-its-not-gadgets-and-clothes-2835034-2025-12-12",
      "headline": "How is young India really spending money? Hint: It's not gadgets and clothesYoung Indians' spending habits are shifting quickly, and it's no longer about gadgets or new outfits. Here's a closer look at where their money is actually going."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-clears-100-percent-fdi-in-insurance-what-the-new-bill-means-for-the-sector-2835061-2025-12-12",
      "headline": "Cabinet clears 100% FDI in insurance: What the new bill means for the sectorThe government says the changes are designed to offer stronger protection to policyholders and bring more players into the market. This could lead to better products, faster claim settlements, and improved customer service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/aroon-purie-rings-nse-bell-says-its-for-next-chapter-of-india-india-today-group-2835055-2025-12-12",
      "headline": "Aroon Purie rings NSE bell, says it's for next chapter of India, India Today GroupIndia Today Group Chairman and Editor-in-Chief Aroon Purie on Friday rang the closing bell at the National Stock Exchange (NSE) to mark the Group's 50-year journey and said it was for the next chapter of India and the India Today Group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/aroon-purie-nse-closing-bell-ringing-next-chapter-india-today-nation-building-journalism-standard-2835038-2025-12-12",
      "headline": "NSE bell we ring today is for next chapter of India, India Today Group: Aroon PurieThe moment symbolised both a milestone for the media group and a nod to India's financial markets, which have grown alongside the Group's own evolution since 1975."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/video-nse-felicitates-india-today-group-chairman-aroon-purie-on-50-year-milestone-2835027-2025-12-12",
      "headline": "Video: NSE felicitates India Today Group Chairman Aroon Purie on 50-year milestoneNational Stock Exchange (NSE) MD & CEO Ashish Kumar Chauhan on Friday felicitated India Today Group Chairman Aroon Purie as the Group completed 50 years at a ceremony in Mumbai. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-toxic-character-criticism-tere-ishk-mein-audience-reactions-2836346-2025-12-15",
      "headline": "Kriti Sanon responds to criticism of her Tere Ishk Mein's toxic character Actor Kriti Sanon recently spoke about the response to her latest film, Tere Ishk Mein, reacting to comments from audiences who have described her character Mukti as 'toxic' and shared negative sentiments toward the film's portrayal of relationships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-pop-group-exo-to-make-their-long-awaited-comeback-with-reverxe-on-january-19-2836337-2025-12-15",
      "headline": "K-pop group EXO to make their long awaited comeback with Reverxe on January 19 EXO officially announced their eighth full album, 'Reverxe', releasing January 19, 2026, with six members: Suho, Chanyeol, DO, Kai, Sehun, and Lay. The comeback follows legal disputes and aims to test the K-pop legacy group's evolving identity and longevity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-proved-bollywood-is-alive-destroyed-false-narratives-nikitin-dheer-2836309-2025-12-15",
      "headline": "Dhurandhar proved Bollywood is alive, destroyed false narratives: Nikitin Dheer Actor Nikitin Dheer backed Aditya Dhar's espionage-thriller 'Dhurandhar', praising the direction and \"outstanding performances.\" He celebrated the movie for defeating \"false narratives\" and its accurate portrayal of India's geopolitical past, wishing it massive box office success."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bad-boys-director-michael-bay-to-collaborate-with-bhansali-productions-ar-rahman-2836215-2025-12-15",
      "headline": "Bad Boys director Michael Bay to collaborate with Bhanushali Studios, AR Rahman Hollywood director Michael Bay will creatively collaborate with Bhanushali Studios for an Indian film, marking his debut. The movie will be directed by Anthony D'Souza, featuring music by AR Rahman.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salute-to-a-true-legend-randeep-hoodas-special-message-for-john-cena-2836270-2025-12-15",
      "headline": "Salute to a true legend: Randeep Hooda's special message for John Cena Actor Randeep Hooda dedicated a post for WWE legend John Cena after he announced his retirement. Hooda is set to share screen space with John in upcoming film Matchbox. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rrr-trio-rift-speculation-rishab-shetty-praises-45-trailer-excluding-raj-b-shetty-2836198-2025-12-15",
      "headline": "Trouble in Rakshit-Rishab-Raj camp? Kantara actor's new video sparks rift rumours The RRR trio of Sandalwood face speculation of a rift after Rishab Shetty's video omits Raj B Shetty. This hints at changing dynamics amid their individual career paths and film promotions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-khers-indigo-flight-gets-cancelled-he-chooses-faith-over-frustration-2836238-2025-12-15",
      "headline": "Anupam Kher's IndiGo flight gets cancelled, he chooses faith over frustration Anupam Kher shared a calm, philosophical response after his IndiGo flight from Varanasi to Khajuraho was cancelled at the last minute. The incident came amid wider IndiGo flight disruptions affecting several routes. IndiGo later issued a press statement on the flight cancellations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-ranjeet-fa9la-dance-granddaughter-birthday-video-2836194-2025-12-15",
      "headline": "Dhurandhar craze: Ranjeet dances to FA9LA on his granddaughter's birthday. Watch Veteran actor Ranjeet recently grooved on the viral hit 'FA9LA' that featured in the film 'Dhurandhar'. The video of his dance is from the birthday party of his six-year-old granddaughter, Deeya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kritika-kamra-on-womens-perfection-pressure-and-female-gaze-in-the-great-shamsuddin-family-2836179-2025-12-15",
      "headline": "Kritika Kamra: Women are expected to be perfect, we don't allow ourselves to fail Kritika Kamra shares her views on the high expectations women face in society and acting. She highlights the unique female perspective in her latest project and the challenges of balancing work and personal life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-pop-group-enhypen-all-set-for-january-comeback-with-7th-ep-the-sin-vanish-2836225-2025-12-15",
      "headline": "K-pop group ENHYPEN all set for January comeback with 7th EP The Sin: Vanish ENHYPEN will begin 2026 with the release of their seventh EP The Sin: Vanish on January 16, marking their first comeback of the year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/anuj-sachdeva-altercation-goregaon-residential-dispute-society-safety-concerns-2836189-2025-12-15",
      "headline": "TV actor Anuj Sachdeva alleges attack by society resident over parking dispute Actor Anuj Sachdeva released a video on social media documenting an altercation with a fellow resident in his Goregaon housing complex, alleging physical assault and threats following a dispute over parking and his dog."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-worldwide-box-office-rs-500-crore-at-record-speed-no-slowing-down-2836197-2025-12-15",
      "headline": "Dhurandhar worldwide box office: Rs 500 crore at record speed, no slowing down Dhurandhar has swiftly crossed Rs 500 crore at the worldwide box office, joining a select group of Indian films to reach this milestone this year. The film, starring Ranveer Singh, achieved this feat in just ten days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ms-subbalakshmi-biopic-sai-pallavi-carnatic-vocalist-legacy-2836185-2025-12-15",
      "headline": "Actor Sai Pallavi to star in MS Subbalakshmi biopic: Reports Sai Pallavi is reported to take on the lead role in a new biopic centered on renowned classical singer MS Subbalakshmi. The film is said to be directed by Gowtam Tinnanuri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/juhi-babbar-father-launches-daughter-film-career-legacy-acting-comeback-2836180-2025-12-15",
      "headline": "Juhi Babbar: My father is probably only male actor to launch his daughter in a film Juhi Babbar reveals her father personally launched her in films, a rare move in Indian cinema. She discusses the pressures of legacy and challenges faced by married female actors in the industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mukesh-chhabra-on-sara-arjun-ranveer-singh-pairing-in-dhurandhar-age-gap-was-required-2836163-2025-12-15",
      "headline": "Mukesh Chhabra on Sara Arjun-Ranveer pairing in Dhurandhar: Age gap was required Casting director Mukesh Chhabra has explained the decision behind casting Sara Arjun opposite Ranveer Singh in Aditya Dhar's 'Dhurandhar'. He responded to the questions raised over the age gap between the two actors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/why-my-hero-academia-still-stands-out-in-a-crowded-superhero-landscape-2831767-2025-12-15",
      "headline": "Why My Hero Academia still stands out in a crowded superhero landscape In this week's Animania, we dive into My Hero Academia's quirky world of heroes, chaos, and heart, to take a fun look at how the anime blends action, humour, and surprisingly human storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/george-clooney-to-end-on-screen-romance-says-he-no-longer-will-be-kissing-girls-2836124-2025-12-15",
      "headline": "George Clooney to end on-screen romance, says he no longer will be kissing girls George Clooney, 63, is shifting his career after consulting his wife, deciding to forgo romantic roles with younger co-stars and will no longer be \"kissing girls\" in movies. Following Paul Newman's path, the actor is stepping aside for the next generation of leading men.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-enters-finale-week-top-5-locked-bharani-eliminated-2836105-2025-12-15",
      "headline": "Bigg Boss Telugu 9 enters finale week: Top 5 locked, Bharani eliminated The journey to the trophy officially began as Bigg Boss Telugu 9 stepped into its finale week, with host Nagarjuna announcing the prize money, confirming the Top 5 contestants.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/padayappa-re-release-25th-anniversary-rajinikanth-75th-birthday-fan-celebration-chennai-2836136-2025-12-15",
      "headline": "Daughter Soundarya watches Rajinikanth's Padayappa with fans, calls film an emotion Soundarya Rajinikanth watched Padayappa's 25th anniversary re-release with fans in Chennai. The event celebrated Rajinikanth's 75th birthday and sparked widespread fan excitement."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nia-names-7-accused-including-terror-outfits-let-trf-in-jk-attack-chargesheet-details-pak-conspiracy-2836326-2025-12-15",
      "headline": "Lashkar handler behind Pahalgam carnage, TRF executed attack: NIA chargesheetThe NIA has chargesheeted seven accused, five suspects and two terror outfits - Pakistan-based Lashkar-e-Taiba (LeT) and The Resistance Front (TRF), in connection with the carnage that claimed 26 lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-nitish-kumar-pulls-down-womans-hijab-at-event-rjd-slams-vile-act-2836350-2025-12-15",
      "headline": "Video: Nitish Kumar pulls woman's hijab at event, Congress slams 'despicable act'A video showed Nitish Kumar pulling down a doctor's hijab after handing over an appointment letter to her at a Patna event. The video, which is going viral on social media, has sparked widespread outrage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/australia-sydney-bondi-beach-shooting-shooter-is-linked-policemen-froze-delay-response-antisemitism-rise-netanyahu-2836117-2025-12-15",
      "headline": "Bondi shooting, many failures: Australia let off IS shooter, cops froze amid firingThe massacre of 15 people at Sydney's Bondi Beach, where a father-son duo opened fire at people celebrating a Jewish festival, exposes deep flaws in Australia's intelligence and police systems. From the Australian intelligence giving a clean chit to shooter Naveed Akram in 2019 to ignoring antisemitism, and then cops freezing for 20 minutes as the killers rained death, the Bondi shooting has exposed systemic failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-bjp-got-working-president-nitin-nabin-not-full-time-president-jp-nadda-amit-shah-pm-narendra-modi-rss-2836243-2025-12-15",
      "headline": "Why BJP got a working president, and not a full-time president?Nitin Nabin was named the BJP's working president. BJP was gearing for a new national president with JP Nadda given an extension till June 2024 to see through the general election. But why was Nabin named working, and not national, president of the BJP?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/there-is-nuclear-device-buried-in-the-himalayas-nanda-devi-what-does-it-mean-today-ganga-2836004-2025-12-15",
      "headline": "Nuclear device lost in the Himalayas 60 years ago threatens Ganga todayIn 1965, at the height of Cold War anxieties over China's nascent nuclear programme, the CIA and India's Intelligence Bureau launched a covert mission to install a nuclear‑powered listening device high on Nanda Devi. Then the weather turned. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gunfight-breaks-out-in-jammu-and-kashmir-udhampur-2-3-terrorists-believed-hiding-2836338-2025-12-15",
      "headline": "Gunfight breaks out in J&K's Udhampur; 2–3 terrorists believed hidingAn encounter is underway between security forces and terrorists in the upper reaches of Udhampur district in Jammu and Kashmir, with sources saying around three terrorists are believed to be holed up in the area."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bondi-beach-terrorist-shooting-holocaust-survivor-alex-kleytman-killed-shielding-wife-antisemitic-terror-attack-intel-2836206-2025-12-15",
      "headline": "Died shielding wife: Man who survived Hitler's Holocaust killed by Bondi terroristsAfter surviving the horrors of Adolf Hitler's Holocaust and rebuilding his life in Australia, 87-year-old Alex Kleytman was killed in the terrorist attack at Sydney's Bondi Beach. Kleytman, who was at the beach celebrating Hanukkah with his family, died while protecting his wife as the terrorists opened fire at the Jewish gathering."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/story/classes-up-to-grade-5-in-delhi-schools-to-shift-from-hybrid-to-online-mode-as-air-quality-remains-severe-2836335-2025-12-15",
      "headline": "Delhi schools shift Classes up to Grade 5 online as air quality remains severeThe Delhi government has ordered all schools to shift from hybrid to online classes for students up to Class V as long as air quality remains in the severe category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-bigger-tragedy-indigo-crisis-maharaja-vistara-tata-group-merger-public-private-boeing-kolkata-airport-boeing-forgot-2836048-2025-12-15",
      "headline": "How IndiGo crisis reveals a bigger tragedy: Air India not seen as ready solutionWhile lakhs of Indians suffered due to the IndiGo fiasco, not many thought of Air India as the Maharaja in a shining armour that could come to their rescue. Air India, which sucked in much-loved Vistara, is trying to find its feet with a refurbished fleet. But decades of bad memories aren't overwritten overnight. Air India can use this moment to step up and reclaim lost ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-civic-body-polls-to-be-held-on-january-15-result-on-january-16-2836237-2025-12-15",
      "headline": "Battle for Mumbai: Civic body polls to be held on Jan 15, result on Jan 16Twenty-nine municipal corporations, including Brihanmumbai Municipal Corporation, will be voting on January 15, with the result to be announced the next day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-ideological-split-tharoor-urban-technocratic-approach-vs-rahul-gandhi-rural-strategy-2836199-2025-12-15",
      "headline": "Shashi Tharoor's reaction to viral X thread comparing him with Rahul GandhiLending credence to the now-viral thread, which concludes by describing the Opposition as facing \"political decay,\" Shashi Tharoor wrote, \"Thank you for this thoughtful analysis. There has always been more than one tendency in the party; your framing is fair, and reflective of a certain perception of the current reality.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/keep-your-little-ones-cozy-this-winter-with-amazon-everyday-essentials-2833300-2025-12-09",
      "headline": "Keep Your Little Ones Cozy This Winter with Amazon Everyday EssentialsWhether you're looking to care for little ones or find the perfect gift, this collection of baby and kids' essentials brings together nourishment, comfort, and thoughtful design."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/sai-jadhav-breaks-93-year-record-at-indian-military-academy-becomes-first-woman-officer-2836120-2025-12-15",
      "headline": "Sai Jadhav breaks 93-year record at Indian Military Academy, becomes first woman officerSai Jadhav from Kolhapur has become the first woman officer to pass out from the Indian Military Academy, the prestigious armed forces institution. The milestone she achieved breaks a 93-year-old record, as no woman before Sai had accomplished this feat since the academy's establishment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-women-remark-cpim-leader-saidali-majeed-paraded-before-other-men-remark-malappuram-2836085-2025-12-15",
      "headline": "Women married to sleep with husbands, not showcased: CPM leader's remark draws ireA CPI(M) leader in Kerala has sparked a controversy after making misogynistic and offensive remarks targeting Muslim League women candidates during his victory speech in the Malappuram civic body polls."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/man-beheads-live-in-partner-returns-home-to-marry-another-woman-2836168-2025-12-15",
      "headline": "Man beheads live-in partner, returns home to marry another womanA shocking murder case has emerged from Uttar Pradesh where a taxi driver allegedly beheaded his live-in partner to marry another woman. The gruesome crime has sparked a cross-state investigation between UP and Haryana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rob-reiner-wife-michele-singer-reiner-found-dead-apparent-homicide-los-angeles-2836097-2025-12-15",
      "headline": "Rob Reiner's son Nick under investigation in parents' deaths, probe underwayRob Reiner and his wife, Michele Singer Reiner, were discovered dead at their Brentwood residence in California on December 14. Media sources indicated their son, Nick Reiner, is being questioned in connection with the deaths. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-today-50-part-1-revisiting-indias-most-turbulent-decade-2835691-2025-12-14",
      "headline": "India Today @ 50 Part 1: Revisiting India's most turbulent decadeIndia Today Group marks its 50th anniversary with a five-part docu-series reflecting on its impactful journey in Indian journalism. The series revisits pivotal moments from 1975 to 1985, highlighting political and cultural shifts that shaped the nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/sydney-bondi-beach-shooting-2835760-2025-12-14",
      "headline": "No evidence of collusion between Sydney attackers, says PM AlbaneseSydney Bondi Beach Shooting Highlights: Australia is reeling from its deadliest gun attack in nearly three decades after a targeted antisemitic shooting at Sydney's Bondi Beach left 15 dead. Police have identified one of the gunmen as a 50-year-old man who was shot dead at the scene, while the suspected second shooter, his 24-year-old son, remains in critical condition in hospital. An ISIS flag was found in a car linked to the suspects, intensifying terrorism concerns. Authorities raided the family's home in Sydney's Bonnyrigg suburb as the investigation widened. Forty people, including two police officers, remain hospitalised, with victims ranging in age from 10 to 87. Stay with IndiaToday.com for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-likely-to-bring-bill-to-repeal-mgnrega-introduce-alternative-law-for-rural-employment-sources-2836071-2025-12-15",
      "headline": "Government likely to repeal MGNREGA, bring new rural employment law: SourcesThe government circulated the Bill, which aims to \"establish a rural development framework aligned with the national vision of Viksit Bharat @2047\", among the members of the Lok Sabha on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/goat-india-tour-anant-ambani-host-lionel-messi-luis-suarez-rodrigo-de-paul-vantara-delhi-trip-2836314-2025-12-15",
      "headline": "Anant Ambani to host Lionel Messi and co at Vantara after Delhi trip: ReportLionel Messi is reportedly set for a one-night stop at Vantara, the wildlife rescue centre in Jamnagar, where Anant Ambani will host the football star as part of the GOAT India Tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/two-desi-sweet-dishes-kulfi-phirni-100-best-desserts-in-the-world-2836132-2025-12-15",
      "headline": "Two desi desserts you grew up with make it to the 100 best in the worldFood guide TasteAtlas has released its annual 100 Best Desserts in the World list, with two Indian dishes earning a spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-dhaka-sharif-anti-india-osman-hadi-attack-no-proof-india-entry-yunus-govt-seeks-arrest-election-security-2835875-2025-12-15",
      "headline": "Why Yunus admin is dialing India over a pre-election shooting in BangladeshDays after the attack on anti-India and anti-Sheikh Hasina radical leader Sharif Osman Hadi, the Yunus administration has sought India's help to arrest and hand over the shooters. This comes even as the Dhaka Metropolitan Police said there was no verified evidence the assailants crossed into India. Delhi, meanwhile, urged Dhaka to ensure law and order as there has been an uptick in violence with the election approaching."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-jordan-visit-king-abdullah-ii-amman-talks-delegation-level-airport-2836313-2025-12-15",
      "headline": "PM lands in Jordan on 2-day visit, to hold talks with King Abdullah II todayPrime Minister Narendra Modi landed in Amman to begin a two-day official visit to Jordan, highlighting the 75th anniversary of diplomatic relations between the two countries. PM Modi will hold a one-on-one meeting and delegation talks with King Abdullah II."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/karnataka-bengaluru-serial-sexual-offender-arrested-kamakshipalya-police-2835976-2025-12-15",
      "headline": "Bengaluru Police arrests serial sexual offender who targeted women walking aloneBengaluru police arrested a man accused of sexually harassing women alone in the evenings in Bengaluru. The arrest followed a December 2 complaint from Sunkadakatte. The accused is in custody."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-t20i-axar-patel-injury-illness-2836349-2025-12-15",
      "headline": "Axar Patel ruled out of remaining IND vs SA T20Is due to illness India all-rounder Axar Patel has been ruled out of the remaining two T20I matches against South Africa due to illness. His absence comes at a crucial time as India finalises the squad for the 2026 T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/goat-india-tour-anant-ambani-host-lionel-messi-luis-suarez-rodrigo-de-paul-vantara-delhi-trip-2836314-2025-12-15",
      "headline": "Anant Ambani to host Lionel Messi and co at Vantara after Delhi trip: Report Lionel Messi is reportedly set for a one-night stop at Vantara, the wildlife rescue centre in Jamnagar, where Anant Ambani will host the football star as part of the GOAT India Tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tim-seifert-century-melbourne-renegades-big-bash-league-ipl-2026-auction-2836307-2025-12-15",
      "headline": "Tim Seifert warms up for IPL 2026 auction with 53-ball century in BBL Tim Seifert warmed up for the IPL 2026 auction in style by smashing a 56-ball century for Melbourne Renegades against Brisbane Heat, powering a 14-run BBL win and earning Player of the Match honours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-goat-tour-delhi-meets-jay-shah-gifts-t20-world-cup-ticket-jersey-minerva-academy-stars-2836305-2025-12-15",
      "headline": "Messi's GOAT Tour: Meets Minerva academy, Jay Shah gifts World Cup ticket in Delhi Lionel Messi's GOAT tour in India: Lionel Messi's final stop of the GOAT tour in Delhi was short but electric, with roaring crowds, smiling youngsters and a heartfelt goodbye that brought the GOAT India Tour to a memorable close."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jay-shah-invites-lionel-messi-india-usa-t20-world-cup-mumbai-2836277-2025-12-15",
      "headline": "Jay Shah gifts Lionel Messi India vs USA T20 World Cup 2026 ticket in New Delhi Jay Shah gifted Lionel Messi a ticket for the India vs USA match at the ICC Men's T20 World Cup 2026 during a special New Delhi interaction, highlighting a symbolic crossover between global football and Indian cricket.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaheen-afridi-removed-dangerous-bowling-bbl-debut-melbourne-renegades-brisbane-heat-2836193-2025-12-15",
      "headline": "Shaheen Afridi makes horror BBL debut, removed from attack for dangerous bowling Shaheen Shah Afridi suffered a nightmare BBL debut, being taken off for dangerous bowling during the Brisbane Heat vs Melbourne Renegades clash on Monday at Simonds Stadium in Geelong. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messis-goat-tour-in-india-abhinav-bindra-questions-focus-on-individuals-over-sports-culture-2836190-2025-12-15",
      "headline": "Messi in India: Abhinav Bindra questions focus on individuals over sports culture Olympic champion Abhinav Bindra has shared thoughtful reflections on Lionel Messi's GOAT India Tour, questioning the spectacle around fleeting access to icons and urging greater investment in grassroots sport across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-harshit-rana-praises-arshdeep-singh-3rd-t20i-morne-morkel-2836162-2025-12-15",
      "headline": "Arshdeep Singh creates pressure from other end, like bowling with him: Harshit India's seam-bowling all-rounder Harshit Rana said he relishes sharing the new ball with Arshdeep Singh, crediting the left-arm pacer for consistently building pressure from the opposite end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/simon-harmer-icc-player-of-the-month-south-africa-india-test-series-win-2836164-2025-12-15",
      "headline": "Simon Harmer named ICC Men's Player of the Month after incredible India Test tour South Africa's off-spinner Simon Harmer was named ICC Men's Player of the Month for November after a dominant Test series against India, taking 17 wickets at an average of 8.94 and earning Player of the Series honours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-ashes-2025-26-harry-brook-accepts-he-must-curb-aggression-adelaide-test-2836154-2025-12-15",
      "headline": "With the Ashes on the line, England's Harry Brook accepts he must curb aggression The Ashes 2025-26: Speaking ahead of the third Test in Adelaide, England's Harry Brook admitted that his shot-selection in his first tour Down Under have not been ideal and said that he has to cut down on his aggression while batting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shafali-verma-icc-womens-player-month-world-cup-final-performance-india-vs-south-africa-2836144-2025-12-15",
      "headline": "Shafali Verma named ICC Women's Player of the Month after World Cup heist Shafali Verma was named ICC Women's Player of the Month for November 2025 after a match-winning all-round performance in India's World Cup final triumph over South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-advises-suryakumar-yadav-t20i-form-ind-vs-sa-2836115-2025-12-15",
      "headline": "Keep this shot in cold storage: Sunil Gavaskar's blunt advice to SuryakumarFormer India captain Sunil Gavaskar was blunt in his assessment, urging Suryakumar Yadav to put his pick-up shot in \"cold storage\" until he finds the right moment to bring it back."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-super-league-2026-schedule-announced-new-franchises-ipl-overlap-2836089-2025-12-15",
      "headline": "PSL 2026 to start on March 26, confirms PCB chief, again set to clash with IPLThe PCB has confirmed that PSL 11 will run from March 26 to May 3, overlapping with the IPL, prompting schedule adjustments, a January 8 auction for two new franchises, and paving the way for an eight-team league in 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/deepesh-devendran-india-u19-bowling-pakistan-asia-cup-win-2835889-2025-12-15",
      "headline": "Who is Deepesh Devendran? Dale Steyn fan wrecks Pakistan in U19 Asia CupDeepesh Devendran continued his rapid rise by ripping through Pakistan with 3/16 in the U19 Asia Cup clash on Sunday in Dubai, underlining his emergence as India's standout fast-bowling prospect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-josh-tongue-strengthen-pace-attack-ashes-test-adelaide-2836061-2025-12-15",
      "headline": "Desperate England rope in 6'4\" speedster for must-win Adelaide TestEngland recalled Josh Tongue for the must-win third Ashes Test in Adelaide, backing the in-form pacer while retaining Ollie Pope and Will Jacks as they look to end a long winless run in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pm-modi-congratulates-indian-squash-team-historic-maiden-world-cup-win-2836053-2025-12-15",
      "headline": "PM Modi congratulates Indian squash team on historic maiden World Cup winPrime Minister Narendra Modi praised the Indian squash team for their historic maiden Squash World Cup title, saying that the title triumph has made the entire nation proud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-six-uncapped-stars-franchises-could-target-2836014-2025-12-15",
      "headline": "IPL 2026 auction: Six uncapped stars franchises could targetIPL 2026 auction: Uncapped stars to watch – explosive batters, versatile all-rounders and promising young bowlers who could become breakout sensations or bargain buys for franchises"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-new-delhi-visit-india-tour-live-updates-goat-arun-jaitley-stadium-2836013-2025-12-15",
      "headline": "Messi in India Live: Next stop Vantara after Delhi-leg of GOAT tourMessi in India, GOAT tour Day 3 live updates: Lionel Messi has finally arrived at the Arun Jaitley stadium, and he met with the Minerva Academy's young stars for a quick photo-op. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-fast-bowler-blair-tickner-ruled-out-india-white-ball-tour-shoulder-injury-2836005-2025-12-15",
      "headline": "New Zealand pacer Blair Tickner set to miss white-ball tour of IndiaBlair Tickner is likely to miss New Zealand's five-match ODI and three-match T20I series in India, beginning on January 11, after dislocating his shoulder during the second Test against the West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-delhi-visit-smog-aqi-high-orange-alert-goat-tour-2836000-2025-12-15",
      "headline": "'Are your lungs insured Messi?' Fans prepare to welcome GOAT in smoggy DelhiAs Lionel Messi nears to his arrival in fog-hit New Delhi, fans chose humour over chaos. Memes flooded social media, capturing the capital's weather, pollution and anticipation around the football icon's final India stop."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bondi-beach-attack-urgent-blood-donation-appeal-pat-cummins-2835981-2025-12-15",
      "headline": "Australia captain Pat Cummins calls for blood donations after Bondi Beach attackAustralian cricket team captain Pat Cummins has issued an urgent appeal for blood donations following Sunday's deadly attack at Bondi Beach, which claimed 16 lives and left dozens injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-new-delhi-traffic-police-new-rules-diversions-restriction-pm-narendra-modi-meet-2835967-2025-12-15",
      "headline": "Messi in New Delhi: Traffic police set new rules to avoid a Kolkata-like messDelhi authorities have moved early to prevent crowd chaos as Lionel Messi's India tour reaches its final stop. After the Kolkata fallout, tighter traffic planning aims to ensure smoother movement and safer fan access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-coach-brendon-mccullum-clarifies-overprepared-remark-stresses-mindset-adaptability-ashes-loss-2835964-2025-12-15",
      "headline": "Ashes: England coach issues clarification over viral 'overprepared' statementEngland head coach Brendon McCullum said his post-Brisbane \"overprepared\" comment was meant to protect the dressing room and that internal messages can sound different in public."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-india-debut-handle-pressure-14-age-2835959-2025-12-15",
      "headline": "A 14-year-old at the door: Why Vaibhav Suryavanshi feels ready for India debutAt an age when most are still learning the game, Vaibhav Suryavanshi is forcing Indian cricket to confront an uncomfortable question: when talent arrives this early, can patience afford to wait?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunrisers-hyderabad-ipl-2026-auction-strategy-explained-5-players-srh-can-target-2835952-2025-12-15",
      "headline": "IPL 2026 auction strategy explained: 5 players SRH can targetIPL Auction: SunRisers Hyderabad finished 6th in the last edition of the IPL. The team will be looking out for a specialist finisher and a couple of strong spin bowling options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-abhishek-sharma-backs-shubman-gill-suryakumar-yadav-for-t20-world-cup-2835941-2025-12-15",
      "headline": "Shubman, Suryakumar will win matches for India at T20 World Cup: AbhishekIndia opener Abhishek Sharma has thrown his weight behind senior batters Suryakumar Yadav and Shubman Gill ahead of the ICC Men's T20 World Cup, expressing confidence that the duo will come good when it matters most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-poor-form-batting-out-of-runs-india-vs-south-africa-2835939-2025-12-15",
      "headline": "Suryakumar Yadav and the unending search for formSuryakumar Yadav is now without a T20I fifty for 21 innings. When will his yearning for runs end? Can India afford out of form capyain and vice captain going into the T20 World Cup?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-sachin-tendulkar-india-jersey-shakes-hands-watch-video-goat-tour-mumbai-2835929-2025-12-15",
      "headline": "A 10/10 evening: When Mumbai wrapped Lionel Messi and Sachin Tendulkar in loveMessi GOAT Tour in Mumbai: It was the fans who defined the night, as Mumbai poured its love on Lionel Messi and Sachin Tendulkar, creating a 10/10 moment driven by emotion, respect and shared admiration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-xabi-alonso-vinicius-jr-relationship-vs-deportivo-alaves-hug-dressing-room-united-2835926-2025-12-15",
      "headline": "Xabi Alonso makes relationship with Vinicius Jr clear: Real Madrid is very unitedXabi Alonso shut down talk of unrest with a simple gesture. His hug with Vinícius Jr after substitution underlined Real Madrid's unity during their 2-1 La Liga win over Deportivo Alaves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bondi-beach-shooting-michael-vaughan-2835910-2025-12-15",
      "headline": "Bondi beach shooting: Michael Vaughan narrowly escapes attackFormer England cricketer Michael Vaughan narrowly survived the Bondi beach attack on Sunday. Two shooters opened fire in public, killing at least 11 and injuring close to 30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-goat-tour-mumbai-kolkata-2835908-2025-12-15",
      "headline": "Mumbai's message to Kolkata: Messi-merising evening with real GOAT crowdThe city of Mumbai turned up in numbers to get a glimpse of Lionel Messi at the Wankhede Stadium. The event went smoothly, and produced several memorable moments, prompting the Maharashtra CM to tweet that Mumbai has the GOAT fans."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}