{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-will-25-percent-tax-rate-individual-contributions-to-nps-raising-basic-exemption-limit-be-included-under-new-tax-regime-2672511-2025-01-30",
      "headline": "Budget 2025: Will 25% tax rate and fresh deductions be announced under new regime?The government might extend the tax exemption for individual contributions to NPS under the new tax regime, along with several other projected deductions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-can-ai-and-better-financing-transform-education-sector-increased-student-loans-allocations-reduced-rates-of-education-loans-2672437-2025-01-30",
      "headline": "Budget 2025: Can AI and better financing transform education sector?Union Budget 2025: Experts anticipate that Budget 2025 would focus on AI-driven academic programs along with increased allocations for student loans and decreasing rates on education loans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-end-higher-but-it-auto-stocks-limit-gains-tata-motors-down-7-percent-2672416-2025-01-30",
      "headline": "Sensex, Nifty end higher but IT, auto stocks limit gains; Tata Motors down 7%The S&P BSE Sensex gained 226.85 points to close at 76,759.81, while the NSE Nifty50 added 86.40 points to end at 23,249.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-5-exemptions-available-under-new-tax-regime-standard-deduction-employer-contribution-to-nps-exemption-on-gratuity-and-leave-encashment-2672391-2025-01-30",
      "headline": "Budget 2025: 5 exemptions that are available under new tax regimeUnion Budget 2025: To make the new tax regime more attractive for the taxpayers, the government has raised the standard deduction to Rs 75,000 from Rs 50,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-will-government-raise-basic-exemption-limit-give-income-tax-relief-tds-cut-2672399-2025-01-30",
      "headline": "Budget 2025: Will government raise basic exemption limit and cut income tax?Union Budget 2025: With inflation and the rising cost of living affecting household budgets, many are expecting the government to introduce income tax cuts, higher deductions, and a more simplified tax structure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-cancel-registration-4-stock-brokers-single-window-securities-sunness-capital-india-gacm-technologies-infotech-portfolio-2672351-2025-01-30",
      "headline": "Why did Sebi cancel registration of 4 stock brokers? Check hereIn four separate orders, Sebi (Securities and Exchange Board of India) explained the main reason for the cancellation of the four stock brokers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-will-defence-military-naval-railway-sectors-get-a-big-boost-2672329-2025-01-30",
      "headline": "Budget 2025: Will defence, railway sectors get a big boost?Union Budget 2025 is likely to provide enhanced support for modernisation of the defence forces, strengthening naval assets and promoting domestic manufacturing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-5-popular-deductions-not-available-under-new-tax-regime-hra-lta-interest-on-home-loan-children-education-allowance-donation-to-political-party-2672288-2025-01-30",
      "headline": "Budget 2025: These 5 popular deductions are not available under new tax regime  Budget 2025: Interest incurred on home loans is a popular deduction available under Section 24(b) in the old tax regime. However, the same is not included under the new tax regime."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/explained-why-tata-motors-share-price-fell-9-percent-today-q3-results-should-you-buy-jefferies-nuvama-2672241-2025-01-30",
      "headline": "Explained: Why Tata Motors share price fell 9% today Tata Motors stock price: The stock hit the day's low of Rs 684.25. Jefferies downgraded Tata Motors from 'buy' to 'underperform'. The firm also reduced its price target to Rs 660 from Rs 930. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opening-bell-sensex-nifty-open-flat-as-market-awaits-cues-from-budget-us-feds-next-move-2672223-2025-01-30",
      "headline": "Sensex, Nifty open flat as market awaits cues from Budget, US Fed's next moveStock Market Today: The S&P BSE Sensex was up by 33.36 points to 76,566.32, while the NSE Nifty50 gained 34.50 points to 23,197.60 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dr-agarwals-healthcare-ipo-day-2-should-you-subscribe-review-check-latest-gmp-2672219-2025-01-30",
      "headline": "Dr Agarwals Healthcare IPO: Should you subscribe? Check latest GMPDr Agarwals Healthcare IPO aims to raise Rs 3,027.26 crore through a combination of fresh issue of 75 lakh shares and an offer for sale of 6.78 crore shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-share-price-adani-enterprises-adani-ports-q3-focus-today-heres-why-2672208-2025-01-30",
      "headline": "Shares of Adani Enterprises, Adani Ports to be in focus today. Here's whyAdani Enterprises reported a rise in profit in Q3 FY24. The company posted a 2.3 times year-on-year (YoY) jump in consolidated net profit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/axis-bank-launches-devanagari-pin-for-safer-banking-how-it-works-details-2672202-2025-01-30",
      "headline": "Axis Bank launches Devanagari PIN for safer banking. Here's how it worksAxis Bank has unveiled the Devanagari PIN, blending technology and tradition to create a banking PIN that's as personal as your favourite memory, but much harder for cyber criminals to crack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/niti-aayog-fiscal-health-report-bihar-ahead-of-andhra-pradesh-haryana-punjab-2671957-2025-01-29",
      "headline": "Even Bihar beats Punjab, Andhra, Haryana in fiscal health, shows Niti reportPunjab, Andhra Pradesh, West Bengal, Kerala and Haryana are at the bottom of the Niti Aayog's list on fiscal health. Bihar, an earlier Bimaru state, has managed to outpace its richer counterparts in fiscal discipline. Odisha tops the list among states with the best fiscal management, and is followed by Jharkhand and Chhattisgarh, two surprise states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-will-mahila-samman-savings-certificate-get-an-extension-women-empowerment-high-interest-rate-2671947-2025-01-29",
      "headline": "Budget 2025: Will Mahila Samman Savings Certificate get an extension?Union Budget 2025: Mahila Samman Savings Certificate has played a key role in encouraging savings among women from the lower-income group and promoting women's empowerment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-concert-economy-that-pm-modi-mentioned-after-coldplays-india-shows-2671911-2025-01-29",
      "headline": "What is 'concert economy' that PM Modi mentioned after Coldplay's India showsRock band Coldplay set a new record for the largest stadium concert of the 21st century on January 25-26, drawing over 2 lakh fans in Ahmedabad, surpassing George Strait's Texas record of 1,10,905 attendees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-sensex-nifty-gain-1-percent-as-it-stocks-lead-market-recovery-itc-hotels-fall-4-percent-2671901-2025-01-29",
      "headline": "Sensex, Nifty gain 1% as IT stocks lead market recovery; ITC Hotels fall 4%The S&P BSE Sensex surged 631.55 points to end at 76,532.96, while the NSE Nifty50 gained 205.85 points to close at 23,163.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-does-it-make-sense-to-have-a-unified-tax-slab-to-simplify-tax-structure-avoid-confusion-benefit-taxpayers-2671898-2025-01-29",
      "headline": "Budget 2025: Does it make sense to have a unified tax slab?Experts urge government to take the best of both the old and new tax regimes and introduce a unified tax regime that would benefit the taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-rises-over-500-points-whats-behind-todays-bull-run-on-dalal-street-2671828-2025-01-29",
      "headline": "Sensex rises over 500 points: What's behind today's bull run on Dalal StreetShare Market Today: The S&P BSE Sensex was trading 508.25 points higher at 76,409.66 at 1:10 pm, while the NSE Nifty50 rose 170.15 points to trade at 23,127.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-will-taxpayers-get-relief-income-tax-changes-to-watch-out-for-2671823-2025-01-29",
      "headline": "Budget 2025: Will taxpayers get relief? Income tax changes to watch out forBudget 2025: The current income-tax law is complex for average taxpayers due to its technical jargon and numerous provisos, circulars, and notifications. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ashneer-grover-host-mx-player-reality-show-rise-and-fall-watch-teaser-2672590-2025-01-30",
      "headline": "Ashneer Grover to host new OTT reality show Rise and Fall. Watch teaserShark Tank India's Ashneer Grover will host MX Player's reality show, Rise and Fall, where 16 contestants battle for power in a divided house. Watch the teaser of the show here. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/squid-game-season-3-new-visuals-out-series-to-release-on-june-27-2672543-2025-01-30",
      "headline": "Squid Game season 3 new visuals out, series to release on June 27After a super successful season 2, South Korean show Squid Game has been renewed for a third season. The release date is now out, and the series will stream on Netflix from June 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sonu-nigam-on-ar-rahman-great-composer-not-a-great-singer-2672520-2025-01-30",
      "headline": "Sonu Nigam on AR Rahman: Great composer but not a great singerSonu Nigam says AR Rahman is a great composer but not a great singer. He praises Rahman's secure approach and recalls composing a part of Inn Lamhon Ke Daaman Mein from Jodha Akbar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grammys-2025-when-where-to-watch-the-live-streaming-disney-hotstar-2672510-2025-01-30",
      "headline": "Grammys 2025: When and where to watch the live streamingThe 67th Annual Grammy Awards will be broadcast live in India on Disney+ Hotstar on February 3, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grammy-winning-singer-sza-on-stay-at-isha-foundation-no-words-for-my-experience-2672430-2025-01-30",
      "headline": "Grammy-winning singer SZA on stay at Isha Foundation: No words for my experienceGrammy-winning artist SZA recently visited the Isha Foundation in Coimbatore. She also shared a post on Instagram where she described her trip and called it a deeply impactful experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/celebrity-masterchef-review-first-impression-farah-khan-vikas-khanna-ranveer-brar-dipika-kakkar-2672367-2025-01-30",
      "headline": "Celebrity MasterChef first impression: Stars spice up the cooking showdownReleased-Mon Jan 27, 2025MasterChef India launched its first celebrity edition where several stars compete to showcase their culinary skills. The show is judged by Chefs Vikas Khanna, Ranveer Brar and Farah Khan. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kbc-1st-crorepati-harshvardhan-nawathe-got-many-marriage-proposals-2672376-2025-01-30",
      "headline": "KBC's 1st crorepati Harshvardhan Nawathe: Got many marriage proposals, crazy callsKBC's first crorepati, Harshvardhan Nawathe, reflects on his journey, missed acting opportunities, crazy fan moments, and life post-win as the Amitabh Bachchan-hosted show celebrates its 25th anniversary."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-poonam-pandey-takes-holy-dip-in-maha-kumbh-2025-2672292-2025-01-30",
      "headline": "Poonam Pandey takes holy dip in Maha Kumbh 2025: Sab paap dhul gayeActor Poonam Pandey visited Maha Kumbh and took a holy dip. She shared glimpses from her visit on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-the-rule-reloaded-version-on-ott-when-and-where-to-watch-allu-arjuns-film-in-hindi-stmp-2672238-2025-01-30",
      "headline": "Pushpa 2 Reloaded on OTT: When and where to watch Allu Arjun's film in HindiPushpa 2 OTT release: Allu Arjun and Rashmika Mandanna's Pushpa 2: The Rule (Reloaded Version) has made its way to the small screens. The film, with 24 minutes of additional footage, has finally been released on OTT. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anuja-on-ott-oscar-nominated-film-stream-globally-netflix-priyanka-chopra-2672227-2025-01-30",
      "headline": "Anuja on OTT: When and where to watch Priyanka Chopra-backed Oscar-nominated filmOscar-nominated film Anuja is set to premiere globally on Netflix. Backed by Priyanka Chopra and Guneet Monga among others, the movie will stream next week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-house-in-kansas-city-amid-engagement-rumours-2672210-2025-01-30",
      "headline": "Taylor Swift, Travis Kelce plan to buy a house in Kansas City: ReportTaylor Swift and Travis Kelce are reportedly exploring an opportunity to buy a house in Kansas City. Recently, reports about their engagement have been doing the rounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-16-samay-raina-jokes-amitabh-bachchan-sooryavansham-sneaking-into-jalsa-2672204-2025-01-30",
      "headline": "KBC 16: Samay Raina jokes about Big B's Sooryavansham, recalls sneaking into JalsaKBC 16: Amitabh Bachchan recently welcomed content creators Samay Raina, Tanmay Bhat, and Bhuvan Bam on Kaun Banega Crorepati 16. In a viral video from the show, Samay's hilarious banter with Amitabh Bachchan left fans in splits. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-mahira-sharma-dating-cricketer-mohammed-siraj-2672085-2025-01-29",
      "headline": "Bigg Boss's Mahira Sharma dating cricketer Mohammed Siraj? Her mother reactsTV actor Mahira Sharma's mother denies rumours of her daughter dating cricketer Mohammed Siraj. The cricketer was previously rumoured to be dating Asha Bhosle's granddaughter Zanai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/new-docuseries-on-asaram-bapu-throws-spotlight-on-india-darkest-scandal-2672000-2025-01-29",
      "headline": "Watch: New docuseries on Asaram Bapu throws spotlight on India's 'darkest scandal'A new docuseries, Cult of Fear: Asaram Bapu, is currently streaming on Discovery +. The series explores the controversial case surrounding the self-proclaimed Godman. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gabriel-macht-feels-sorry-for-those-who-go-to-law-school-after-watching-suits-2671907-2025-01-29",
      "headline": "Actor Gabriel Macht feels sorry for those who go to law school after watching SuitsSuits star Gabriel Macht said he always feels the need to apologise to people who decided to enroll in a law school after watching his hit TV series, Suits. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sivarapalli-review-rag-mayurs-show-fails-to-pass-authenticity-test-panchayat-remake-2671869-2025-01-29",
      "headline": "Sivarapalli review: Rag Mayur's Panchayat remake fails to pass authenticity testReleased-Fri Jan 24, 2025Sivarapalli, the official Telugu remake of the popular series Panchayat, is currently streaming on Prime Video. While the show features strong performances from actors Rag Mayur, Sunny Palle and Muralidhar Goud, it gives a sense of déjà vu throughout. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-storyteller-satyajit-ray-vintage-storytelling-at-its-most-beautiful-in-paresh-rawal-adil-hussain-film-2671785-2025-01-29",
      "headline": "The Storyteller review: Satyajit Ray's vintage storytelling at its most beautifulReleased-Tue Jan 28, 2025The Storyteller is derived from Satyajit Ray's short story. It features Paresh Rawal and Adil Hussain in the pivotal roles, but it's the stories told in the film and the essence of storytelling that elevate the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-veer-mehra-chum-darang-farah-khan-aditi-rao-hydari-siddharth-javed-akhtar-birthday-2671792-2025-01-29",
      "headline": "BB 18's Karan Veer, Chum Darang party with Farah Khan, Aditi-Siddharth and othersKaran Veer Mehra along with Chum Darang were among the other guests at Javed Akhtar's birthday bash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-mehta-boys-trailer-boman-irani-avinash-tiwary-explore-father-son-dynamics-prime-video-2671791-2025-01-29",
      "headline": "The Mehta Boys trailer: Boman Irani, Avinash Tiwary explore father-son dynamicsThe first full trailer of The Mehta Boys is here, and it promises a heartfelt and layered story about a father-son relationship. Directed by Irani, the film will premiere on Prime Video in February. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-squid-game-star-park-gyu-young-wants-to-play-a-happy-virus-in-bollywood-2671780-2025-01-29",
      "headline": "Exclusive: Squid Game star Park Gyu-young wants to play a 'happy virus' in BollywoodSouth Korean star Park Gyu-young opened up about her solitary experience filming Squid Game 2 and her interest in Bollywood roles. She also humorously addressed BTS' V cameo rumours for Season 3."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/washington-dc-plane-crash-donald-trump-diversity-policies-67-dead-faa-2672663-2025-01-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump blames diversity hiring under Biden, Obama for deadly chopper-plane crashUS President Donald Trump controversially linked FAA diversity hiring to a deadly Washington plane crash, despite no evidence, drawing criticism from officials as investigations continued into the worst US air disaster in over two decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-india-us-relations-donald-trump-pm-modi-out-of-syllabus-foreign-policy-2672574-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Have to conduct out of syllabus foreign policies: Jaishankar on Trump 2.0 External Affairs Minister S Jaishankar said that he was confident that US President Donald Trump will change many things, and we have to conduct foreign policies \"out of syllabus\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/yamuna-poisoning-arvind-kejriwal-aap-bjp-manish-sisodia-delhi-elections-2672602-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP creating crisis before polls: Manish Sisodia's big claim on Yamuna water rowSpeaking to India Today TV, Manish Sisodia addressed the concerns about the progress of Yamuna's clean-up and claimed that 70 per cent of the work promised by Arvind Kejriwal has already been completed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/tulsi-gabbard-us-senate-hearing-donald-trump-national-intelligence-director-pm-modi-putin-assad-hindus-hinduism-snowden-video-2672679-2025-01-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tulsi Gabbard slams Democrats over 'Putin, Modi' puppet charge in fiery speechTulsi Gabbard, Trump's nominee for national intelligence director, dismissed claims she is a puppet for global leaders. She accused Democratic senators of religious bigotry against Hindus during her confirmation hearing. Senators questioned her past remarks on Russia and Syria.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/chess-uzbekistan-player-apology-r-vaishali-flowers-chocolate-video-2672619-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uzbek chess player brings R Vaishali flowers, apologises for handshake snubUzbekistan Grandmaster Nodirbek Yakubboev tendered an in-person apology to R Vaishali on Thursday, January 30. In a video, he can be seen handing out Vaishali flowers and chocolates while apologising to her and her brother R Praggnanandhaa.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/burari-building-collapse-family-rescued-after-30-hours-survived-3-tomatoes-delhi-2672568-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Survived on 3 tomatoes for 30 hours: Family trapped under building debris rescuedTrapped for over 30 hours beneath debris, a family of four in North Delhi's Burari survived on just three tomatoes before being rescued."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/kashyap-kash-patel-donald-trump-fbi-pick-jai-shri-krishna-parents-feet-blessings-senate-confirmation-hearing-2672675-2025-01-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's FBI chief pick Kash Patel says 'Jai Shri Krishna' at US Senate hearingKashyap 'Kash' Patel, US President Donald Trump's nominee for FBI Director, greeted his parents by saying 'Jai Shri Krishna' to them at his confirmation hearing. He also touched their feet to take their blessings before the hearing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-4th-t20i-pune-predicted-11-rinku-singh-arshdeep-singh-return-in-pune-2672674-2025-01-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "4th T20I Predicted 11: Will Rinku Singh, Arshdeep Singh return in Pune?India vs England, 4th T20I Predicted XI: India might make two changes in their playing XI for the fourth T20I against England in Pune after losing the 3rd match in Rajkot on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-mela-train-tickets-prayagraj-irctc-price-travel-cost-airline-uttar-pradesh-2672382-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not just airfares, even Kumbh Mela train tickets are burning a hole in the pocketAs many devotees scramble to reach Prayagraj for Maha Kumbh Mela, booking a train ticket has also become a costly affair, with many opting for Premium Tatkal or longer routes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-live-in-relationships-couples-rules-certificates-uniform-civil-code-2672468-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Previous relationship details, priest NOC: Uttarakhand rules for live-in couplesUttarakhand, which became the first state to implement a civil code, makes it mandatory for live-in partners to register themselves with the district registrar or face a jail term of up to six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/shows/story/the-buzz-donald-trumps-fbi-pick-kash-patel-denies-enemies-list-vows-reform-glbs-2672659-2025-01-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Donald Trump's FBI pick Kash Patel denies 'enemies list,' vows reformKash Patel, Trump's FBI pick, assured Democrats his leadership would be non-political, facing scrutiny over past statements. Republicans backed him, citing FBI reform needs, while critics questioned his independence and past rhetoric. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-plane-crash-washington-dc-black-hawk-american-airlines-questions-conspiracy-2672507-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why didn't the Black Hawk turn, go up or down? Trump is asking the right questionQuestions are being raised after footage showed a US Army Black Hawk helicopter flying straight into an American Airlines jet, killing 64 on board. US President Donald Trump has asked why the chopper didn't turn or go up or down to avoid collision. People are also alleging a conspiracy, even as experts call it a one-in-a-million crash."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/ambedkar-rally-a-start-but-can-congress-stop-attrition-in-sc-st-base-in-madhya-pradesh-2671915-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ambedkar rally a start, but can Congress stop attrition in SC-ST base in MP?While the Scheduled Tribes still support the Congress, the Scheduled Castes are seen as increasingly identifying themselves with the Hindu causes of the BJP"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/salwan-momika-iraqi-sweden-norway-quran-burnt-free-speech-struggle-against-islam-ex-muslim-2672410-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salwan Momika: From gun-toting Iraqi militia leader to Quran-burnerThe body of Salwan Momika, who became infamous after burning the Quran in 2023, has been found with multiple bullet wounds. Momika was an Iraqi Christian militia leader who fled to Sweden after a power struggle with the leader of another armed outfit. Though a Christian who turned atheist, Momika behaved like an extreme Ex-Muslim."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-jet-crash-all-passengers-dead-washington-dc-fire-chief-2672499-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "All 67 feared dead after US plane collides with Army chopper near WashingtonThe mid-air collision between an American Airlines jet and a US Army helicopter near Washington has likely killed all 67 onboard both the aircraft. 28 bodies have been recovered so far. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-stampede-death-toll-victims-families-prayagraj-up-government-2672613-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'No cops, volunteers': Families of Kumbh stampede victims recall night of horrorA total of 30 devotees were killed and another 60 were injured in a stampede incident during the Shaahi Snaan at Triveni Sangam in Prayagraj at Maha Kumbh on Mauni Amavasya on Wednesday.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/squid-game-season-3-new-visuals-out-series-to-release-on-june-27-2672543-2025-01-30?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Squid Game season 3 new visuals out, series to release on June 27After a super successful season 2, South Korean show Squid Game has been renewed for a third season. The release date is now out, and the series will stream on Netflix from June 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/aam-aadmi-party-arvind-kejriwal-param-mitra-samajwadi-party-akhilesh-yadav-support-delhi-polls-2672523-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Arvind Kejriwal gets 'param mitra' Akhilesh Yadav's support for Delhi pollsArvind Kejriwal and Akhilesh Yadav launched an attack on both the BJP and their INDIA bloc ally Congress as they campaigned for AAP in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/swara-bhasker-x-account-permanently-suspended-actor-reacts-on-instagram-2672480-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Swara Bhasker's X account permanently suspended over copyright infringementSwara Bhasker's X account was permanently suspended due to alleged copyright infringements because of her Republic Day posts. She contested it as baseless and urged a review on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-slams-arvind-kejriwal-calls-him-cunning-like-pm-modi-2672669-2025-01-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rahul Gandhi slams Arvind Kejriwal, calls him 'cunning' like PM ModiCongress leader Rahul Gandhi criticised AAP chief Arvind Kejriwal, alleging he lies like PM Modi, and is more cunning. Gandhi accused Kejriwal of indulging in corruption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/ponman-review-basil-joseph-sajin-gopu-breathe-life-as-underdogs-in-brilliant-drama-2672443-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ponman review: Basil Joseph, Sajin Gopu breathe life as underdogs in brilliant dramaReleased-Thu Jan 30, 2025Ponman movie review: Director Jothish Shankar's Ponman, starring Basil Joseph, Sajin Gopu and Lijomol Jose, is a simple yet effective story of underdogs. The proceedings keep you on the edge of the seats.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/raj-thackeray-expresses-shock-over-partys-poll-defeat-votes-disappeared-2672664-2025-01-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Raj Thackeray expresses shock over party's poll defeat: How did votes disappear?Maharashtra Navnirman Sena (MNS) chief Raj Thackeray supported the film \"Chaava,\" questioned the Maharashtra poll results, and reaffirmed his commitment to Marathi pride and party discipline in a recent address."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indian-american-astronaut-sunita-williams-rides-robotic-arm-collect-microbes-space-nasa-2672607-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Sunita Williams rides robotic arm in spaceDuring her spacewalk, she was seen riding the Canadarm2 when the Space Station was flying above London. The robotic arm took her from one end to another. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/swastika-mukherjee-calls-out-uber-when-pet-friendly-isnt-enough-2672512-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Swastika Mukherjee calls out Uber: When 'pet-friendly' isn't enoughSwastika Mukherjee called out Uber after an incident highlighted the gaps in their newly launched 'pet-friendly' feature on their app."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoor-emotional-deva-release-2672579-2025-01-30",
      "headline": "Shahid Kapoor gets emotional ahead of Deva release: One year of blood, sweat, tearsShahid Kapoor shares an emotional note on the eve of Deva's release, reflecting on his dedication to the film. The action thriller, directed by Rosshan Andrrews, is set to hit cinemas on January 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vineeth-sreenivasans-oru-jaathi-jaathakam-faces-ban-in-gulf-countries-report-2672565-2025-01-30",
      "headline": "Vineeth Sreenivasan's Oru Jaathi Jaathakam faces ban in Gulf countries: ReportVineeth Sreenivasan's upcoming film Oru Jaathi Jaathakam, set to release on January 31, has run into a roadblock, with reports suggesting a ban in Gulf countries due to references to the LGBTQ+ community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannada-producer-slams-nanis-hi-nanna-calls-it-a-cheap-copy-of-his-film-2672528-2025-01-30",
      "headline": "Kannada producer slams Nani's Hi Nanna, calls it a 'cheap copy' of his filmProducer Pushkara Mallikarjunaiah has accused the team of Hi Nanna for creating a \"cheap copy\" of his Kannada movie Bheemasena Nalamaharaja without securing the remake rights. The Telugu film's makers are yet to respond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/photo/keerthy-suresh-antony-thattil-mehendi-photos-2672556-2025-01-30",
      "headline": "Inside Keerthy Suresh's mehendi: Vibrant outfits, dance and laughterKeerthy Suresh shares joyful moments from her mehendi ceremony. She got married to Antony Thattil in Goa in December 2024."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-4th-t20i-pune-predicted-11-rinku-singh-arshdeep-singh-return-in-pune-2672674-2025-01-31",
      "headline": "4th T20I Predicted 11: Will Rinku Singh, Arshdeep Singh return in Pune?India vs England, 4th T20I Predicted XI: India might make two changes in their playing XI for the fourth T20I against England in Pune after losing the 3rd match in Rajkot on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-fa-charge-arsenal-over-myles-lewis-skelly-red-card-reaction-2672647-2025-01-30",
      "headline": "Premier League: FA charge Arsenal over Myles Lewis-Skelly red card reactionArsenal were charged for failing to manage their players, who surrounded referee Michale Oliver after Myles Lewis-Skelly was controversially sent off in a 1-0 win against Wolverhampton Wanderers on Saturday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mitchell-starc-test-bowlers-with-700-wickets-international-cricket-aus-vs-sl-2672642-2025-01-30",
      "headline": "SL vs AUS: Mitchell Starc goes past Dale Steyn, joins exclusive 700-Test clubMitchell Starc completed an elite feat on Thursday, January 30. Starc overtook Dale Steyn and reached the 700-wicket club in international cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pedri-extends-contract-with-fc-barcelona-till-2030-2672632-2025-01-30",
      "headline": "Pedri extends contract with FC Barcelona till 2030Barcelona midfielder Pedri extended his contract with the club till 2030. Pedri, who has been instrumental in the team's midfileld since joining the club would hope for a successful stint at the club.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mumbai-indians-owners-buy-stake-in-the-hundred-oval-invincibles-report-2672625-2025-01-30",
      "headline": "Mumbai Indians owners buy stake in The Hundred's Oval Invincibles: ReportReliance Industries Limited (RIL), the owners of the Mumbai Indians franchise, have reportedly bought a stake in the Oval Invincible team in the Hundred."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/chess-uzbekistan-player-apology-r-vaishali-flowers-chocolate-video-2672619-2025-01-30",
      "headline": "Uzbek chess player brings R Vaishali flowers, apologises for handshake snubUzbekistan Grandmaster Nodirbek Yakubboev tendered an in-person apology to R Vaishali on Thursday, January 30. In a video, he can be seen handing out Vaishali flowers and chocolates while apologising to her and her brother R Praggnanandhaa.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-india-vs-england-4th-t20i-assistant-coach-ryan-ten-doeschate-press-conference-2672609-2025-01-30",
      "headline": "Suryakumar Yadav is a couple of shots away from regaining form: Assistant coachIndia's assistant coach Ryan ten Doeschate dismissed concerns over Suryakumar Yadav's dry run with the bat, saying the Indian captain is just a few shots away from regaining his form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wriddhiman-saha-on-his-2022-india-ouster-retires-from-domestic-cricket-2672596-2025-01-30",
      "headline": "Wriddhiman Saha on his 2022 India ouster: Calling it 'injustice' would be unfairFormer India wicketkeeper-batsman Wriddhiman Saha retired from the Ranji Trophy and opened up on his exit from the Indian Test side in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-opening-ceremony-in-pakistan-on-feb-16-no-captain-photoshoot-2672582-2025-01-30",
      "headline": "Pakistan to host opening ceremony on Feb 16 but no captains' photoshootChampions Trophy 2025: Pakistan Cricket Board will host the opening ceremony on February 16 at Huzoori Bagh in Lahore but there will be no captains' photoshoot ahead of the ICC event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-rajeev-shukla-vice-president-delhi-vs-railways-ranji-trophy-2672564-2025-01-30",
      "headline": "Virat Kohli, Rajeev Shukla meet Vice President Jagdeep Dhankhar in DelhiVirat Kohli accompanied BCCI's Rajeev Shukla to meet the country's Vice President Jagdeep Dhankar in New Delhi. Virat met with the Vice-President after Day 1 of Delhi's Ranji Trophy match vs Railways.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-dhruv-jurel-batting-order-coach-gambhir-doeschate-2672558-2025-01-30",
      "headline": "Gautam Gambhir's love for 8 batters: Assistant coach explains T20I strategyIndia assistant coach Ryan Ten Doeschate explained the rationale behind sending Dhruv Jurel to bat at No. 8 in the third T20I against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-india-vs-england-4th-t20i-assistant-coach-ryan-ten-doeschate-press-conference-2672609-2025-01-30",
      "headline": "Suryakumar Yadav is a couple of shots away from regaining form: Assistant coachIndia's assistant coach Ryan ten Doeschate dismissed concerns over Suryakumar Yadav's dry run with the bat, saying the Indian captain is just a few shots away from regaining his form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wriddhiman-saha-on-his-2022-india-ouster-retires-from-domestic-cricket-2672596-2025-01-30",
      "headline": "Wriddhiman Saha on his 2022 India ouster: Calling it 'injustice' would be unfairFormer India wicketkeeper-batsman Wriddhiman Saha retired from the Ranji Trophy and opened up on his exit from the Indian Test side in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-opening-ceremony-in-pakistan-on-feb-16-no-captain-photoshoot-2672582-2025-01-30",
      "headline": "Pakistan to host opening ceremony on Feb 16 but no captains' photoshootChampions Trophy 2025: Pakistan Cricket Board will host the opening ceremony on February 16 at Huzoori Bagh in Lahore but there will be no captains' photoshoot ahead of the ICC event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-rajeev-shukla-vice-president-delhi-vs-railways-ranji-trophy-2672564-2025-01-30",
      "headline": "Virat Kohli, Rajeev Shukla meet Vice President Jagdeep Dhankhar in DelhiVirat Kohli accompanied BCCI's Rajeev Shukla to meet the country's Vice President Jagdeep Dhankar in New Delhi. Virat met with the Vice-President after Day 1 of Delhi's Ranji Trophy match vs Railways.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-dhruv-jurel-batting-order-coach-gambhir-doeschate-2672558-2025-01-30",
      "headline": "Gautam Gambhir's love for 8 batters: Assistant coach explains T20I strategyIndia assistant coach Ryan Ten Doeschate explained the rationale behind sending Dhruv Jurel to bat at No. 8 in the third T20I against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-travis-head-catch-angelo-mathews-video-2672532-2025-01-30",
      "headline": "Greatest close-in catch? Watch Travis Head's one-handed screamer vs Sri LankaSri Lanka vs Australia: Travis Head, standing at short-leg, took a sensational one-handed catch to dismiss Angelo Mathews on Day 2 of the first Test in Galle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sri-lanka-vs-australia-1st-test-day-2-highlights-match-report-khawaja-smith-2672513-2025-01-30",
      "headline": "Australia record-breaking 654, Lanka batting collapse highlights Day 2 in GalleUsman Khawaja's double hundred and twin centuries from Steve Smith and Josh Inglis helped Australia take complete control over Australia on Day 2 of the Test match.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/borussia-dortmund-appoint-niko-kovac-as-new-head-coach-2672446-2025-01-30",
      "headline": "Borussia Dortmund appoint Niko Kovac as new head coachBundesliga club Borussia Dortmund named Niko Kovac as the side's new head coach on Thursday. The 53-year-old Croatian returns to the Bundesliga after managing Wolfsburg from 2022 to 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohlis-brother-vikas-kohli-childhood-coach-rajkumar-sharma-ddca-president-rohan-jaitley-seen-watching-ranji-game-2672415-2025-01-30",
      "headline": "Virat Kohli's brother, coach, Rohan Jaitley in attendance at Ranji gameStar India batter Virat Kohli's brother Vikas Kohli, childhood coach Rajkumar Sharma and DDCA President Rohan Jaitley were seen watching his return to the Ranji Trophy at the Arun Jaitley Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-gaddafi-stadium-to-be-handed-over-to-icc-for-champions-trophy-on-feb-11-pcb-source-2672393-2025-01-30",
      "headline": "Pakistan eases Champions Trophy fears, to hand over Gaddafi Stadium to ICCICC Champions Trophy: The Pakistan Cricket Board (PCB) will be handing over the Gaddafi Stadium in Lahore to the ICC (International Cricket Council) on February 11 ahead of the Champions Trophy 2025. There has been massive scrutiny on Pakistan's preparedness for the mega event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-afghanistan-new-jersey-cultural-heritage-2672392-2025-01-30",
      "headline": "Afghanistan unveil new jersey as tribute to cultural heritageChampions Trophy 2025: Afghanistan have named their brand new jersey for the Champions Trophy 2025. The Afghans will be making their debut in the tournament after impressive performances in bilateral affairs and the ODI World Cup 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-1st-test-josh-inglis-hundred-debut-galle-2672383-2025-01-30",
      "headline": "Josh Inglis becomes 1st Australian in 10 years to hit hundred on Test debut Sri Lanka vs Australia, 1st Test: Josh Inglis became the first Australian batter in 10 years to hit a hundred on Test debut. The 29-year-old got to his maiden three-figure score in just 90 balls as Australia went past 600 in their first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ranji-trophy-shardul-thakur-hat-trick-mumbai-vs-meghalaya-kl-rahul-karnataka-return-2672366-2025-01-30",
      "headline": "In-form Shardul Thakur takes hat-trick, KL Rahul out for 26 on comebackRanji Trophy 2024-25: Shardul Thakur, who hit a hundred for Mumbai earlier in January, took a hat-trick against Meghalaya in the final round of Ranji Trophy group stages. KL Rahul, meanwhile, was dismissed for 26 on his return to the tournament after 5 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-gaddafi-stadium-to-be-handed-over-to-icc-for-champions-trophy-on-feb-11-pcb-source-2672393-2025-01-30",
      "headline": "Pakistan eases Champions Trophy fears, to hand over Gaddafi Stadium to ICCICC Champions Trophy: The Pakistan Cricket Board (PCB) will be handing over the Gaddafi Stadium in Lahore to the ICC (International Cricket Council) on February 11 ahead of the Champions Trophy 2025. There has been massive scrutiny on Pakistan's preparedness for the mega event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-afghanistan-new-jersey-cultural-heritage-2672392-2025-01-30",
      "headline": "Afghanistan unveil new jersey as tribute to cultural heritageChampions Trophy 2025: Afghanistan have named their brand new jersey for the Champions Trophy 2025. The Afghans will be making their debut in the tournament after impressive performances in bilateral affairs and the ODI World Cup 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-1st-test-josh-inglis-hundred-debut-galle-2672383-2025-01-30",
      "headline": "Josh Inglis becomes 1st Australian in 10 years to hit hundred on Test debut Sri Lanka vs Australia, 1st Test: Josh Inglis became the first Australian batter in 10 years to hit a hundred on Test debut. The 29-year-old got to his maiden three-figure score in just 90 balls as Australia went past 600 in their first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ranji-trophy-shardul-thakur-hat-trick-mumbai-vs-meghalaya-kl-rahul-karnataka-return-2672366-2025-01-30",
      "headline": "In-form Shardul Thakur takes hat-trick, KL Rahul out for 26 on comebackRanji Trophy 2024-25: Shardul Thakur, who hit a hundred for Mumbai earlier in January, took a hat-trick against Meghalaya in the final round of Ranji Trophy group stages. KL Rahul, meanwhile, was dismissed for 26 on his return to the tournament after 5 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pcb-shares-video-of-the-new-look-gaddafi-stadium-ahead-of-champions-trophy-2025-2672347-2025-01-30",
      "headline": "PCB shares video of the new-look Gaddafi Stadium ahead of Champions Trophy 2025Champions Trophy 2025: Pakistan Cricket Board shared a video of their new-look Gaddafi Stadium in Lahore showing the renovation work at the venue ahead of the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/russian-skating-couple-yevgenia-shishkova-vadim-naumov-plane-crash-2672348-2025-01-30",
      "headline": "Russian skating couple, world champions in 1990s, was on crashed US planeRussian state media reported that former world champions and ice skating coaches Yevgenia Shishkova and Vadim Naumov were aboard the American Airlines flight that crashed into the Potomac River in Washington on Wednesday night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-usman-khawaja-slams-maiden-200-becomes-1st-australian-to-reach-milestone-in-sri-lanka-sl-vs-aus-1st-test-2672319-2025-01-30",
      "headline": "Usman Khawaja slams maiden 200, 1st Australian to reach milestone in Sri LankaSL vs AUS: Australia opener Usman Khawaja scored his maiden double hundred in Tests on Day 2 of the first Test against Sri Lanka in Galle. He became the first Australian to achieve the landmark in Sri Lanka."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/tennis-us-open-2025-main-draw-schedule-2672323-2025-01-30",
      "headline": "US Open extends main draw to 15 days for 2025 amid scheduling concernsUS Open 2025 Schedule: The 2025 US Open will begin a day earlier and feature 15 days of main draw action, up from the usual 14. The United States Tennis Association (USTA) made the announcement on Wednesday, January 30. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}