{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/centre-finalises-priority-products-for-indigenous-semiconductor-ips-ashwini-vaishnaw-2781021-2025-09-03",
      "headline": "Centre finalises 25 priority products for indigenous semiconductor IPs: IT MinisterIT and Communications Minister Ashwini Vaishnaw said the semiconductor design ecosystem was growing faster than expected, with more than 28 startups moving from concept to product stage under the design-linked incentive scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/markets-end-in-red-gold-soars-to-all-time-high-and-more-2780856-2025-09-02",
      "headline": "Markets end in red, Gold soars to all-time high and moreSensex and Nifty slipped into the red after early gains dragged by banks and heavyweight counters. Nifty fell below 24,600 marks while Sensex closed at 80,200. Mid-caps as well as the small-cap indices have been outperforming with modest gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pnb-bank-of-india-cut-mclr-what-it-means-for-borrowers-2780837-2025-09-02",
      "headline": "PNB, Bank of India cut MCLR: What it means for borrowersPunjab National Bank has made small reductions across different loan tenures. The overnight rate has come down from 8.15% to 8%. The one-month MCLR has dropped slightly to 8.25%, while the three-month rate has been reduced to 8.45%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/luxury-evs-may-get-costlier-as-tax-panel-proposes-steep-gst-hike-report-2780736-2025-09-02",
      "headline": "Luxury EVs may get costlier as tax panel proposes steep GST hike: ReportThe proposal, if approved, would hit global brands such as Tesla, Mercedes-Benz, BMW and BYD the hardest, just as they ramp up their India play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-climate-change-is-driving-up-indias-food-prices-2780716-2025-09-02",
      "headline": "How extreme weather is driving up India's food pricesExperts warn that climate change is making such weather events more frequent, leading to higher volatility in vegetable prices and overall food inflation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-206-points-nifty-below-24600-dr-reddys-mm-among-top-losers-2780710-2025-09-02",
      "headline": "Sensex, Nifty end in red as financial stocks fall; all eyes on GST Council meetThe S&P BSE Sensex was down 206.61 points to 80,157.88 at the closing bell, while the NSE Nifty50 settled 45.45 points lower at 24,579.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-much-should-you-save-in-an-emergency-fund-here-is-the-answer-2780690-2025-09-02",
      "headline": "How much should you save in an emergency fund? Here's the answerWhen crisis knocks, credit cards and loans only add stress. An emergency fund keeps you afloat without debt. The tricky part is figuring out how much you should save. Let's break it down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/brass-city-in-crisis-us-tariff-threatens-livelihoods-of-over-2-lakh-artisans-in-moradabad-2780605-2025-09-02",
      "headline": "Brass city in crisis: Jobs of over 2 lakh Moradabad artisans at risk from US tariffsUS tariffs have struck Moradabad's export-reliant brass industry, freezing shipments, cutting jobs, and throwing the livelihoods of thousands of artisans and workers into immediate jeopardy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-in-trade-talks-with-us-says-piyush-goyal-day-after-modi-meets-xi-putin-sco-summit-tianjin-china-trump-tariffs-2780601-2025-09-02",
      "headline": "Hope we can reach trade deal with US by November, says Piyush GoyalCommerce Minister Piyush Goyal on Tuesday said India is holding talks with the United States on a bilateral trade agreement, day after Trump called ties with India \"one-sided diaster\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-to-take-a-loan-against-mutual-fund-follow-these-steps-2780584-2025-09-02",
      "headline": "How to take a loan against mutual fund? Follow these stepsNeed quick cash but don't want to sell your mutual funds? You can now take a loan against your investments and get instant funds while keeping your portfolio intact. Here's how."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-salaried-employees-change-tax-regimes-while-filing-itr-old-and-new-tax-regime-2780547-2025-09-02",
      "headline": "Can salaried employees change tax regimes while filing ITR?As tax season nears, a common question among employees is whether they can switch from the old tax regime to the new one, or vice versa, while filing their ITR. Understanding the rules can help maximise tax savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/earnings-from-online-gaming-here-is-how-to-file-itr-2780517-2025-09-02",
      "headline": "Earnings from online gaming? Here's how to file ITRThe September 15 ITR deadline is around the corner, and if you earned money from online games like fantasy cricket, rummy, or poker in FY25, it's time to report your winnings to the tax department."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajamouli-kenya-minister-ssmb-29-shoot-film-to-release-120-countries-2781054-2025-09-03",
      "headline": "Rajamouli meets Kenya minister amid SSMB 29 shoot, film to release in 120 countriesSS Rajamouli wrapped up the African schedule of his latest film 'SSMB 29' in Kenya, showcasing iconic African locations. He met Kenyan minister Musalia Mudavadi and other delegates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonakshi-sinha-slams-online-brands-for-using-her-photos-without-permission-2780892-2025-09-02",
      "headline": "Sonakshi Sinha slams online brands for using her photos without permissionSonakshi Sinha has called out online brands for using her social media photos on their websites without permission or usage rights. She urged companies to act ethically and warned them to take down her images before she names them publicly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/millie-bobby-brown-shares-first-photo-of-baby-girl-with-jake-bongiovi-2780893-2025-09-02",
      "headline": "Millie Bobby Brown shares first photo of baby girl with Jake BongioviHollywood actor Millie Bobby Brown, best known as Eleven from 'Stranger Things', is embracing life as a young mum at 21. Here's a glimpse into her family life with husband Jake Bongiovi and their baby girl."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dwayne-johnson-drastic-weight-loss-leaves-fans-stunned-at-venice-film-festival-2780878-2025-09-02",
      "headline": "Dwayne Johnson's drastic weight loss leaves fans stunned at Venice Film FestivalDwayne 'The Rock' Johnson appeared at the photocall and press conference for his latest film 'The Smashing Machine' where his noticeably leaner physique took many by surprise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/inspector-zende-to-wednesday-new-releases-on-netflix-to-watch-this-week-2780855-2025-09-02",
      "headline": "Inspector Zende to Wednesday, new releases on Netflix to watch this weekNetflix is bringing a fresh lineup this week with something for everyone - action, gothic drama, comedy-thriller, and a hard-hitting documentary. Highlights include 'The Fall Guy', 'Wednesday: Season 2 Part 2', 'Inspector Zende', and 'Love Con Revenge'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/filmmaker-sanjay-leela-bhansali-faces-fir-in-bikaner-over-love-war-dispute-2780890-2025-09-02",
      "headline": "FIR filed against Sanjay Leela Bhansali in Bikaner over Love & War disputeAn FIR has been registered against filmmaker Sanjay Leela Bhansali and two others in Bikaner after a man accused them of fraud, misbehaviour, and breach of trust during the making of 'Love & War'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/naveen-kasturia-spy-role-salakaar-jiohotstar-thriller-2776611-2025-09-02",
      "headline": "Naveen Kasturia on Salakaar being a series of firsts, challenges of playing a spyActor Naveen Kasturia steps into his first spy role in the JioHotstar thriller 'Salakaar'. In an exclusive interview, Naveen talks about the challenges of the role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-shriya-saran-first-look-from-teja-sajja-sci-fi-film-out-2780872-2025-09-02",
      "headline": "Mirai: Shriya Saran's first look from Teja Sajja's sci-fi film outAfter 'Retro', Shriya Saran is set to appear in her second film in 2025. 10 days ahead of its release, Teja Sajja unveiled the first look of Saran from their upcoming Telugu sci-fi drama 'Mirai'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonam-turns-53-eyes-comeback-with-strong-roles-in-films-and-ott-2780828-2025-09-02",
      "headline": "Tridev's Sonam turns 53, eyes comeback with strong roles in films and OTTActor Sonam celebrates her 53rd birthday reflecting on her early Bollywood success and long hiatus. She is now ready to return with meaningful roles in films and OTT platforms, embracing her age and experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/the-weeknd-blinding-lights-becomes-1st-track-to-cross-5-billion-streams-on-spotify-2780836-2025-09-02",
      "headline": "The Weeknd's Blinding Lights becomes 1st track to cross 5 billion streams on SpotifyThe Weeknd's 'Blinding Lights' has made history as the first song to hit five billion streams on Spotify. This milestone comes shortly after topping Billboard's Top Hot R&B/Hip-Hop Songs of the 21st Century chart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/from-omi-to-og-pawan-kalyan-receives-special-birthday-wish-from-emraan-hashmi-2780793-2025-09-02",
      "headline": "From Omi to OG: Pawan Kalyan receives special birthday wish from Emraan HashmiThe makers of 'OG' celebrated Pawan Kalyan's birthday in an unconventional style by releasing a special video featuring Emraan Hashmi's character, Omi. The film will be released globally on September 25, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/kiran-rao-biju-toppo-executive-producers-humans-in-the-loop-ai-adivasi-film-2780739-2025-09-02",
      "headline": "Kiran Rao, Biju Toppo back Humans in the Loop before September releaseKiran Rao and Biju Toppo have joined as executive producers for the indie film Humans in the Loop. The film highlights invisible AI labour through an Adivasi woman's story, raising questions about technology and indigenous knowledge."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jungkook-issues-strong-warning-after-fan-trespasses-at-home-2780692-2025-09-02",
      "headline": "BTS' Jungkook issues strong warning after fan trespasses at homeBTS member Jungkook has spoken publicly for the first time following a troubling incident with an intruder at his residence, highlighting ongoing privacy concerns faced by K-pop idols.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/baaghi-4-harnaaz-sandhu-yeh-mera-husn-song-deepika-padukone-besharam-rang-2780719-2025-09-02",
      "headline": "Baaghi 4: Harnaaz Sandhu's Yeh Mera Husn being compared to Besharam RangFeaturing debutant Harnaaz Sandhu, the song 'Yeh Mera Husn' from the upcoming film 'Baaghi 4' released on Tuesday. Several social media users have compared the song to Deepika Padukone's song 'Besharam Rang'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nushrratt-bharuccha-visits-mahakaleshwar-temple-participates-in-shiv-aarti-watch-2780606-2025-09-02",
      "headline": "Nushrratt Bharuccha visits Mahakaleshwar temple ahead of Uff Ye Siyapaa releaseActor Nushrratt Bharuccha recently participated in Shiv aarti at Ujjain's Mahakaleshwar temple. A video of the actor offering prayers has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokesh-kanagaraj-addresses-rajinikanth-coolie-box-office-run-audience-hype-2780740-2025-09-02",
      "headline": "Lokesh Kanagaraj addresses Rajinikanth's Coolie box office run, audience hypeDirector Lokesh Kanagaraj addresses the underperformance of his film Coolie, describing the challenges of audience expectations and the film's global reception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pranit-more-veer-pahariya-controversy-not-the-reason-to-do-bigg-boss-2780741-2025-09-02",
      "headline": "Pranit More on Veer Pahariya controversy: Not the reason to do Bigg BossIn an exclusive interaction with India Today, comedian Pranit More addressed his controversy around Veer Pahariya. He stated that the row was not the reason behind his 'Bigg Boss 19' entry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-makers-apology-to-remove-dialogue-demeaning-bengaluru-women-2780733-2025-09-02",
      "headline": "Lokah makers apologise, to remove dialogue demeaning Bengaluru womenDulquer Salmaan's Wayfarer Films issued an apology to the people of Karnataka over a dialogue demeaning Bengaluru women in 'Lokah Chapter 1: Chandra'. They also promised to remove the dialogue and expressed regret."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suris-saiyaara-holds-strong-with-rs-581-crore-collection-amid-big-releases-2780626-2025-09-02",
      "headline": "Mohit Suri's Saiyaara holds strong with Rs 581 crore collection amid big releasesMohit Suri's 'Saiyaara', starring Ahaan Panday and Aneet Padda, has emerged as a box office sensation, grossing Rs 581 crore worldwide in seven weeks. Despite competition from big releases, the romantic musical continues its strong run."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-calls-us-india-trade-one-sided-relationship-glbs-2781025-2025-09-03",
      "headline": "We get along very well, but...: Trump on US-India ties amid tariff disputeThe US President also claimed that unfair tariff structures were pushing companies to set up production outside America. However, he argued that his administration's trade policies, including the imposition of steep reciprocal tariffs, were beginning to reverse the trend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/russia-in-talks-to-supply-more-s-400-missile-systems-to-india-report-glbs-2781034-2025-09-03",
      "headline": "Russia in talks to supply more S-400 missile systems to India: ReportNew Delhi signed a $5.5 billion agreement with Moscow in 2018 for five S-400 Triumf systems, meant to counter China's growing military power. The deal has faced repeated delays, with the final two units now scheduled for 2026 and 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-accuses-xi-jinping-conspiring-russia-north-korea-beijing-military-parade-2781049-2025-09-03",
      "headline": "As Xi hosts Putin, Kim at Beijing parade, Trump fumes at 'conspiracy against US'US President Trump accused Chinese President Xi Jinping of conspiring with Russia and North Korea as the leaders of the three countries came together for Beijing's largest military parade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-paddy-upton-indian-hockey-virat-kohli-world-cup-olympics-2781037-2025-09-03",
      "headline": "18 Virat Kohlis in one side? Why Indian men's hockey team is built to win bigMental conditioning coach Paddy Upton, in an exclusive chat with India Today, revealed his amazement at the fitness of the Indian men's hockey team, calling them a side that has 18 Virat Kohlis in it. Upton also spoke about his current work with the team and praised Craig Fulton as a coach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/cracks-beneath-concrete-why-india-urban-planning-fails-against-floods-opinion-2781060-2025-09-03",
      "headline": "Cracks beneath concrete: Why India's urban planning fails against floodsRoads do not collapse in isolation. Nor do drains clog themselves. What we are witnessing—from Gurugram's flooded boulevards to Delhi's crumbling flyovers—is the slow, visible erosion of a planning culture that treats cities as finished products rather than evolving organisms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-10-live-updates-carlos-alcaraz-jessica-pegula-krejcikova-new-york-2780927-2025-09-02",
      "headline": "Quarters Live: Djokovic loses third set vs Fritz, Sabalenka advancesUS Open 2025, Day 10 Live updates: Novak Djokovic has claimed the first two sets of his men's singles quarter-final against Taylor Fritz. The Serb is bidding to move one step closer to another Grand Slam semi-final appearance. In the women's draw, defending champion Aryna Sabalenka progressed to the last four after Marketa Vondrousova was forced to withdraw with a shoulder injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-refiners-may-trim-russian-oil-buys-says-us-congressman-after-india-pak-trip-glbs-2781030-2025-09-03",
      "headline": "Indian refiners signalling reduction of Russian oil imports: US CongressmanA US intelligence delegation led by Rep. Brian Fitzpatrick visited India, Nepal, and Pakistan, pushing India to reduce Russian oil imports and advancing counterterrorism coordination with allies in Islamabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/we-respect-russia-india-ties-pakistan-pm-sharif-tells-putin-during-meeting-with-putin-glbs-2780858-2025-09-02",
      "headline": "Shehbaz Sharif perfectly fine with India-Russia ties, but has a demandPakistani Prime Minister Shehbaz Sharif met Russian President Vladimir Putin in Beijing and told him that Islamabad respects Moscow's close diplomatic relations with New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/turning-florida-turnpike-accident-khalistani-playbook-at-play-in-america-us-gurpatwant-singh-pannun-2780773-2025-09-02",
      "headline": "Turning accident into agenda: The Khalistani playbook at play in AmericaThe Khalistani playbook has long been to look for margins and fractures—places where mainstream communities are vulnerable—and drive a wedge. Gurpatwant Singh Pannun recast a human tragedy on Florida's Turnpike into a Khalistani talking point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-congress-leader-r-v-deshpande-insensitive-comment-womens-healthcare-joida-hospital-apology-demand-2780996-2025-09-02",
      "headline": "When you deliver...: Karnataka MLA's shocker on journalist's hospital questionDeshpande's response to a journalist's question regarding the lack of a hospital in Joida taluk has drawn widespread criticism for its tone and perceived insensitivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/california-governor-gavin-newsom-mocks-trump-modi-putin-xi-video-glbs-2781031-2025-09-03",
      "headline": "Have no fear: California Governor Newsom mocks Trump with Modi, Putin, Xi videoPresident Donald Trump said on Tuesday he would deploy National Guard troops to fight crime in Chicago, an extraordinary effort to militarise the country's third-largest city that was likely to trigger a legal battle with local officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/we-have-won-manoj-jarange-set-to-end-hunger-strike-as-state-agrees-to-key-demands-2780764-2025-09-02",
      "headline": "Maratha quota activist Manoj Jarange declares big win, ends hunger strikeMaratha quota activist Manoj Jarange launched an indefinite hunger strike at Mumbai's Azad Maidan on August 29, seeking a 10% quota for the Maratha community in government jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/gen-z-and-millennials-reshaping-indias-work-culture-whats-driving-the-shift-2780877-2025-09-03",
      "headline": "Gen Z doesn't just want jobs. They want workplaces that don't drain themFrom startups to corporates, the Gen Z influence is rewriting how work is done, relaxed culture, flat structures, and growth-driven spaces are replacing old office rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/india-alerts-pakistan-of-potential-sutlej-flooding-amid-heavy-rains-sources-glbs-2781003-2025-09-03",
      "headline": "India alerts Pakistan of potential Sutlej flooding amid heavy rain: ReportThe Ministry of External Affairs alerted Pakistan of likely floods in Sutlej. This comes after India alerted the neighbouring nation thrice of possible flooding in the river Tawi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mainpuri-52-year-old-woman-killed-by-26-year-old-lover-she-met-on-instagram-uttar-pradesh-crime-2781053-2025-09-03",
      "headline": "UP woman, 52, killed by 26-year-old boyfriend she met on InstagramA 52-year-old woman from Farrukhabad was strangled in Mainpuri, Uttar Pradesh, allegedly by her 26-year-old lover she had met on Instagram. Police said the accused, Arun Rajput, killed her after she pressed him for marriage and repayment of money loaned."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/west-bengal/story/exclusive-kolkata-police-arrest-bjps-rakesh-singh-after-midnight-raid-at-hideout-2781029-2025-09-03",
      "headline": "Exclusive: Kolkata Police arrest BJP's Rakesh Singh after midnight raid at hideoutA few BJP leaders led by Rakesh Singh allegedly carried out a protest and vandalism at Bidhan Bhawan, the headquarters of West Bengal Pradesh congress committee in Kolkata after the incident insulting Prime Minister Narendra Modi in Patna last week."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/india-sends-21-tonnes-relief-materials-kabul-deadly-earthquake-glbs-2781008-2025-09-03",
      "headline": "India sends 21 tonnes of relief materials to Kabul after deadly earthquakeThe earthquake, which struck late Sunday night with a magnitude of 6.3, has claimed at least 1,411 lives and injured over 3,000 people, according to officials cited by Al Jazeera. Most casualties have been reported in Kunar province, one of the hardest-hit areas."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-military-strike-kills-11-suspected-tren-de-aragua-cartel-members-vessel-off-venezuela-coast-trump-glbs-2781027-2025-09-03",
      "headline": "Video: US military strikes Venezuelan drug vessel in Caribbean Sea, 11 killedTrump said the strike targeted narcoterrorists linked to Venezuelan leader Nicols Maduro while they were transporting narcotics through international waters toward the United States."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/11-killed-in-pakistans-balochistan-after-suicide-bomber-blows-himself-up-at-political-rally-news-agency-afp-2781009-2025-09-03",
      "headline": "14 killed in suicide bombing at political rally in Pakistan's BalochistanThe explosion hit as crowds left a rally marking Baloch leader Ataullah Mengal's death anniversary. His son, politician Akhtar Mengal, escaped the attack safely. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/idf-kills-hamas-commander-hazem-awni-naeem-who-held-israeli-hostages-glbs-2781024-2025-09-03",
      "headline": "IDF kills Hamas commander Hazem Awni Naeem who held Israeli hostagesIsrael says senior Hamas operative Hazem Awni Naeem, who held hostages Emily Damari, Romi Gonen and Naama Levy, was killed in Gaza City. IDF vows continued strikes against terror leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rajasthan-royals-s-sreesanth-injury-insurance-supreme-court-ipl-2780945-2025-09-02",
      "headline": "From IPL nets to Supreme Court: Rajasthan Royals' 2012 Sreesanth injury insurance rowThe decade-long S. Sreesanth IPL injury dispute reaches the Supreme Court, with Rajasthan Royals and insurer United India Insurance clashing over pre-existing injuries, insurance claims, and legal obligations, highlighting the complex intersection of cricket and law in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cbi-arrests-two-in-rs-22-lakh-bribery-reverse-trap-after-gst-officers-complaint-2781000-2025-09-02",
      "headline": "CBI arrests two in Rs 22 lakh bribery 'reverse trap' after GST officer's complaintThe incident unfolded after the officer, who was probing alleged tax evasion by multiple online companies, was approached by the accused with an offer to favour the firms in exchange for money. Refusing to be complicit, the officer promptly reported the attempt to the CBI, triggering a well-planned operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-man-befriends-minor-on-instagram-rapes-her-records-act-in-mangaluru-7-arrested-2780969-2025-09-02",
      "headline": "Man befriends minor on Instagram, rapes her, records act in Karnataka; 7 arrestedAccording to police reports, the survivor first came into contact with Karthik through Instagram approximately two months before the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-stages-largest-military-parade-with-xi-putin-and-kim-in-beijing-glbs-2781035-2025-09-03",
      "headline": "China stages largest military parade with Xi, Putin and Kim Jong Un in BeijingRussian President Vladimir Putin and North Korean leader Kim Jong Un, who arrived in the Chinese capital on Tuesday, will flank Xi in an unprecedented gathering to mark 80 years since Japan's defeat at the end of World War Two."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prasidh-krishna-reaction-joe-root-spat-india-england-test-series-2781043-2025-09-03",
      "headline": "Don't know why Root reacted that way: Prasidh on heated altercation in 5th TestIndia pacer Prasidh Krishna has opened up about his on-field exchange with Joe Root during the fifth Test at the Oval, saying he was unsure why the senior batter reacted so heatedly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/venus-williams-us-open-doubles-exit-update-future-2781039-2025-09-03",
      "headline": "Venus Williams offers update on future after age-defying doubles run endsVenus Williams offered an update on her tennis future after bowing out of the U.S. Open on Tuesday, her campaign alongside Canadian Leylah Fernandez ending with a quarter-final defeat in the women's doubles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-paddy-upton-indian-hockey-virat-kohli-world-cup-olympics-2781037-2025-09-03",
      "headline": "18 Virat Kohlis in one side? Why Indian men's hockey team is built to win bigMental conditioning coach Paddy Upton, in an exclusive chat with India Today, revealed his amazement at the fitness of the Indian men's hockey team, calling them a side that has 18 Virat Kohlis in it. Upton also spoke about his current work with the team and praised Craig Fulton as a coach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-reach-us-open-semifinals-marketa-vondrousova-injury-withdrawal-2781036-2025-09-03",
      "headline": "Sabalenka reaches semifinals after Vondrousova withdraws due to injuryWorld No. 1 Aryna Sabalenka advanced to the semifinals of the US Open on Tuesday without having to play a point, after her quarterfinal opponent, Marketa Vondrousova, withdrew due to a knee injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-maaya-rajeshwaran-revathi-second-round-loss-junior-singles-report-2781019-2025-09-03",
      "headline": "Indian teen prodigy Maaya Rajeshwaran turns heads despite 2nd-round exitUS Open 2025: 16-year-old Maaya Rajeshwaran narrowly missed an upset against second seed Hannah Klugman at the US Open junior girls singles. Maaya made a mark with her all-round game in New York on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carlos-alcaraz-beats-jiri-lehecka-golf-off-days-semi-finals-secured-2781018-2025-09-03",
      "headline": "US Open: Golf on off-days working wonders as Carlos Alcaraz storms into semisCarlos Alcaraz is blending tennis and golf to perfection. After a commanding straight-sets win over Jiri Lehecka, the Spaniard credits his off-court golf sessions for focus, calm, and energy heading into the US Open semi-finals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-pakistan-sharjah-spinners-dominate-rashid-khan-match-report-2781017-2025-09-03",
      "headline": "Ahead of Asia Cup, Afghanistan stun Pakistan in T20I tri-series in SharjahAfghanistan stunned Pakistan by 18 runs in Sharjah, showcasing brilliant spin bowling and a crucial 65-run innings by Ibrahim Zadran. The win boosts Afghanistan ahead of the Asia Cup and raises alarms for Pakistan's lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-aiff-fsdl-supreme-court-ex-judge-ln-rao-resolution-2781014-2025-09-03",
      "headline": "Supreme Court appoints ex-judge LN Rao to oversee AIFF-FSDL ISL 2025-26 resolutionSupreme Court approves AIFF-FSDL consensual resolution, appointing Justice LN Rao to oversee ISL commercial partner selection. The move ensures a timely 2025-26 Indian football season while averting potential FIFA-AFC suspension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carabao-cup-grimsby-town-fined-unregistered-player-vs-manchester-united-2781011-2025-09-03",
      "headline": "Grimsby Town fined for unregistered player vs Manchester United: What it meansGrimsby Town has been fined £20,000 for fielding Clarke Oduor just past the EFL registration deadline in their Carabao Cup win over Manchester United. Despite the administrative error, their historic 12-11 penalty victory stands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-jessica-pegula-beats-barbora-krejcikova-in-quarter-final-2780989-2025-09-02",
      "headline": "Jessica Pegula downs Barbora Krejcikova to storm into 2nd US Open semi finalJessica Pegula made it into her second consecutive US Open semi-final with a straight-sets win over Barbora Krejcikova. She became the first woman to reach consecutive US Open semi-finals without dropping a set since Serena Williams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sa-1st-odi-aiden-markram-keshav-maharaj-wiaan-mulder-leeds-2780949-2025-09-02",
      "headline": "ENG vs SA: Markram, Maharaj star in South Africa's thumping 7-wicket winSouth Africa handed England a crushing seven-wicket defeat to England in the first ODI of the three-match series at Headingley, Leeds. Keshav Maharaj was adjudged Player of the Match for his sensational bowling spell of 4/22 in 5.3 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-pakistan-sharjah-spinners-dominate-rashid-khan-match-report-2781017-2025-09-03",
      "headline": "Ahead of Asia Cup, Afghanistan stun Pakistan in T20I tri-series in SharjahAfghanistan stunned Pakistan by 18 runs in Sharjah, showcasing brilliant spin bowling and a crucial 65-run innings by Ibrahim Zadran. The win boosts Afghanistan ahead of the Asia Cup and raises alarms for Pakistan's lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-aiff-fsdl-supreme-court-ex-judge-ln-rao-resolution-2781014-2025-09-03",
      "headline": "Supreme Court appoints ex-judge LN Rao to oversee AIFF-FSDL ISL 2025-26 resolutionSupreme Court approves AIFF-FSDL consensual resolution, appointing Justice LN Rao to oversee ISL commercial partner selection. The move ensures a timely 2025-26 Indian football season while averting potential FIFA-AFC suspension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carabao-cup-grimsby-town-fined-unregistered-player-vs-manchester-united-2781011-2025-09-03",
      "headline": "Grimsby Town fined for unregistered player vs Manchester United: What it meansGrimsby Town has been fined £20,000 for fielding Clarke Oduor just past the EFL registration deadline in their Carabao Cup win over Manchester United. Despite the administrative error, their historic 12-11 penalty victory stands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-jessica-pegula-beats-barbora-krejcikova-in-quarter-final-2780989-2025-09-02",
      "headline": "Jessica Pegula downs Barbora Krejcikova to storm into 2nd US Open semi finalJessica Pegula made it into her second consecutive US Open semi-final with a straight-sets win over Barbora Krejcikova. She became the first woman to reach consecutive US Open semi-finals without dropping a set since Serena Williams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sa-1st-odi-aiden-markram-keshav-maharaj-wiaan-mulder-leeds-2780949-2025-09-02",
      "headline": "ENG vs SA: Markram, Maharaj star in South Africa's thumping 7-wicket winSouth Africa handed England a crushing seven-wicket defeat to England in the first ODI of the three-match series at Headingley, Leeds. Keshav Maharaj was adjudged Player of the Match for his sensational bowling spell of 4/22 in 5.3 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rajasthan-royals-s-sreesanth-injury-insurance-supreme-court-ipl-2780945-2025-09-02",
      "headline": "From IPL nets to Supreme Court: Rajasthan Royals' 2012 Sreesanth injury insurance rowThe decade-long S. Sreesanth IPL injury dispute reaches the Supreme Court, with Rajasthan Royals and insurer United India Insurance clashing over pre-existing injuries, insurance claims, and legal obligations, highlighting the complex intersection of cricket and law in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/transfer-window-summer-liverpool-alexander-isak-marc-guehi-manchester-united-2780939-2025-09-02",
      "headline": "A wild summer transfer window: Top picks ft Liverpool-Isak headline act, Guehi the casualtyThe 2025–26 summer transfer window delivered record-breaking moves, dramatic collapses, and strategic signings across Europe. From Liverpool's Isak transfer to Manchester United's rebuild, fans were glued to every twist, making it one of football's most thrilling windows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-10-live-updates-carlos-alcaraz-jessica-pegula-krejcikova-new-york-2780927-2025-09-02",
      "headline": "Quarters Live: Djokovic loses third set vs Fritz, Sabalenka advancesUS Open 2025, Day 10 Live updates: Novak Djokovic has claimed the first two sets of his men's singles quarter-final against Taylor Fritz. The Serb is bidding to move one step closer to another Grand Slam semi-final appearance. In the women's draw, defending champion Aryna Sabalenka progressed to the last four after Marketa Vondrousova was forced to withdraw with a shoulder injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-remarkable-transformation-ahead-of-international-comeback-2780903-2025-09-02",
      "headline": "Rohit stuns fans with remarkable transformation ahead of international comebackIndia's ODI captain Rohit Sharma has stunned fans with his remarkable transformation ahead of his international comeback against Australia in October 2025. The opening batter is looking a lot leaner in his viral photographs, having shed some weight ahead of his return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-coach-wv-raman-on-womens-world-cup-2025-harmanpreet-kaur-2780866-2025-09-02",
      "headline": "Home World Cup can be double-edged sword, can't just relax: Former India coachWV Raman has said that the Indian team should not become complacent for the World Cup, as home advantage can also be a double-edged sword. He feels that other teams also play spin well now, and India will have to battle out the challenges against competitors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-asia-cup-2025-super-4s-preview-india-malaysia-korea-china-schedule-2780876-2025-09-02",
      "headline": "Asia Cup Super 4s: India chase 4th crown as China, Korea and Malaysia plot upsetThe Asia Cup 2025 in Rajgir has reached its business end with India aiming for their fourth crown and a passage into the World Cup next year. However, China, Malaysia and defending champions Korea will be out to spoil the party for the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-odi-world-cup-2027-game-time-challenge-irfan-pathan-2780874-2025-09-02",
      "headline": "Had a long chat with Rohit: Irfan Pathan reveals India captain's World Cup plansIrfan Pathan believes age won't stop Rohit Sharma and Virat Kohli from playing the 2027 ODI World Cup. Instead, he warns irregular ODI fixtures could make staying match-ready the real challenge for India's legends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-remarkable-transformation-ahead-of-international-comeback-2780903-2025-09-02",
      "headline": "Rohit stuns fans with remarkable transformation ahead of international comebackIndia's ODI captain Rohit Sharma has stunned fans with his remarkable transformation ahead of his international comeback against Australia in October 2025. The opening batter is looking a lot leaner in his viral photographs, having shed some weight ahead of his return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-coach-wv-raman-on-womens-world-cup-2025-harmanpreet-kaur-2780866-2025-09-02",
      "headline": "Home World Cup can be double-edged sword, can't just relax: Former India coachWV Raman has said that the Indian team should not become complacent for the World Cup, as home advantage can also be a double-edged sword. He feels that other teams also play spin well now, and India will have to battle out the challenges against competitors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-asia-cup-2025-super-4s-preview-india-malaysia-korea-china-schedule-2780876-2025-09-02",
      "headline": "Asia Cup Super 4s: India chase 4th crown as China, Korea and Malaysia plot upsetThe Asia Cup 2025 in Rajgir has reached its business end with India aiming for their fourth crown and a passage into the World Cup next year. However, China, Malaysia and defending champions Korea will be out to spoil the party for the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-odi-world-cup-2027-game-time-challenge-irfan-pathan-2780874-2025-09-02",
      "headline": "Had a long chat with Rohit: Irfan Pathan reveals India captain's World Cup plansIrfan Pathan believes age won't stop Rohit Sharma and Virat Kohli from playing the 2027 ODI World Cup. Instead, he warns irregular ODI fixtures could make staying match-ready the real challenge for India's legends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gills-return-wont-put-pressure-on-secure-suryakumar-irfan-pathan-2780853-2025-09-02",
      "headline": "Shubman Gill's return won't put pressure on secure Suryakumar: Irfan PathanFormer India cricketer Irfan Pathan feels the return of Shubman Gill in T20Is won't put any extra pressure on Suryakumar Yadav as he's not an insecure player."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-thriller-india-vs-bangladesh-2018-final-2780759-2025-09-02",
      "headline": "Asia Cup: When India clinched final-ball thriller vs BangladeshIndia won the 2018 Asia Cup final against Bangladesh with a dramatic last-ball victory. The thrilling finish highlighted India's resilience and Jadhav's crucial contribution under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-chirag-shetty-bwf-world-championships-2780737-2025-09-02",
      "headline": "Special to be in company of Saina and Sindhu: Chirag ShettySatwiksairaj Rankireddy and Chirag Shetty won their second BWF World Championship medal in 2025. Chirag, speaking to PTI relished the fact they were in the elite company of PV Sindhu and Saina Nehwal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-bans-dream11-crypto-from-jersey-sponsorship-rights-ad-2780679-2025-09-02",
      "headline": "Crypto, online money gaming firms barred from BCCI sponsorship raceThe Indian Cricket Board (BCCI) floated the advertisement for lead sponsorship rights on Tuesday, September 2. The body explicitly mentioned that all companies were not allowed to apply as the jersey sponsor of the Indian team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brad-haddin-reaction-indian-cricket-sunil-gavaskar-criticism-2780668-2025-09-02",
      "headline": "After Gavaskar criticism, Haddin defends his stance on Shreyas's Asia Cup snubFormer Australia wicketkeeper Brad Haddin has responded to Sunil Gavaskar after the former Indian great criticised overseas cricketers for commenting on Indian cricket matters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-bcci-advertisement-india-cricekt-lead-sponsor-dream-11-2780667-2025-09-02",
      "headline": "After Dream11 exit, BCCI invites bids for lead sponsor; deadline September 16The BCCI invited bids for Team India's lead sponsorship rights. The Indian cricket banned applications from real-money gaming platforms and crypto companies in the aftermath of the recently-passed online gaming bill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/erik-ten-hag-reaction-bayer-leverkusen-shock-exit-two-matches-2780638-2025-09-02",
      "headline": "Erik ten Hag shocked as Leverkusen sack him after two matchesErik ten Hag said Bayer Leverkusen's decision to dismiss him after just two Bundesliga matches in charge came as a complete surprise, adding that the club's hierarchy had not shown him sufficient trust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-2025-china-mens-hockey-rise-india-favourites-roelant-oltmans-2780647-2025-09-02",
      "headline": "Chinese revolution: Why China could be India's biggest threat to Asia Cup gloryThe China men's hockey team continues to make heads turn with their gritty and determined performances across the turf. With an all-round attack and rugged defence, are the Chinese side India's biggest threat to Asia Cup glory?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/hockey-asia-cup-china-coach-exclusive-interview-2780618-2025-09-02",
      "headline": "China are improving, but India clear favourites to win Asia Cup: Roelant OltmansFormer India coach and current China assistant coach Roelant Oltmans feels that India are the clear favourites to win the Asia Cup in Rajgir. Oltmans feels that the rise of the Chinese men's team was inevitable and they're building towards LA Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/paddy-upton-exclusive-hockey-asia-cup-virat-kohli-2780634-2025-09-02",
      "headline": "Only Virat Kohli can last half of hockey team's training session: Paddy UptonHockey Asia Cup 2025: Mental conditioning coach Paddy Upton, speaking to India Today, discussed his latest stint with the senior men's hockey team. Upton, who worked with the Indian cricket team in the past, talked up the fitness levels of the Hamanpreet Singh-led hockey team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/hockey-asia-cup-daily-digest-india-make-it-3-out-of-3-as-forwards-finally-click-2780595-2025-09-02",
      "headline": "Hockey Asia Cup daily digest: India make it 3 out of 3 as forwards finally clickIndia produced a statement performance to dismantle Kazakhstan 15-0 to end the pool phase with a 100 percent win record. Ahead of the crucial Super 4s stage, the Indian forwards finally found their groove with field goals finally coming for the hosts in Rajgir."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}