{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-donald-trump-25-percent-tariff-pressure-tactic-farm-dairy-2765184-2025-08-02",
      "headline": "Explained: Why India shouldn't lose sleep over Trump's 25% tariffsIndia shouldn't trade its future for short-term calm. Trump's tariff move is more noise than policy. Staying firm now will protect India's strength and choices in the long run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-president-donald-trump-he-may-consider-giving-tariff-revenue-dividends-to-citizens-2765106-2025-08-02",
      "headline": "May consider dividends to citizens: Trump on tariff revenue disbursal plansTrump has signed a new executive order that imposes fresh import tariffs on goods from 69 countries and the European Union, which will come into effect on August 7."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/loan-fraud-case-ed-issues-lookout-notice-against-anil-ambani-2764968-2025-08-01",
      "headline": "Loan fraud case: ED issues lookout notice against Anil AmbaniA lookout circular has been issued against Anil Ambani at the request of the Enforcement Directorate (ED), preventing him from travelling abroad without court permission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lookout-notice-against-anil-ambani-in-alleged-rs-3000-crore-loan-fraud-case-2764939-2025-08-01",
      "headline": "Anil Ambani faces lookout notice in Rs 3,000-crore loan fraud caseAnil Ambani can now no longer travel outside India without court permission. This comes after a series of crackdowns on his business entities, allegations of fraud against his firms, and a summons issued by a federal agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vandana-vasudevan-on-how-tech-is-reshaping-daily-life-2764868-2025-08-01",
      "headline": "Vandana Vasudevan on how tech is reshaping daily lifeSpeaking with Business Today's Sakshi Batra, OTP Please author Vandana Vasudevan explains how this shift is changing daily routines."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/otp-please-the-double-edged-sword-of-digital-living-vandana-vasudevan-2764846-2025-08-01",
      "headline": "OTP Please! The double-edged sword of digital living: Vandana VasudevanSpeaking with Business Today's Sakshi Batra, OTP Please author Vandana Vasudevan tells how tech has changed how we live, making travel easier for the disabled, food more accessible, and work more flexible. But she warns of fading community bonds, unhealthy habits, and insecure gig jobs. Tech must support life, not replace human connection."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/us-tariffs-will-not-have-significant-adverse-impact-on-indian-economy-sources-2764783-2025-08-01",
      "headline": "US tariffs will not have significant adverse impact on Indian economy: SourcesThe 25% tariff announced by US President Donald Trump will not have a significant adverse impact on the Indian economy, government sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-starlink-monthly-plan-cost-spacex-telecom-satellite-launch-jyotiraditya-scindia-2764764-2025-08-01",
      "headline": "Elon Musk's Starlink to operate soon in India. Check monthly plansUnion Telecom Minister Jyotiraditya Scindia confirmed that Starlink has been awarded a Unified Licence to launch its satellite internet operations in India. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-586-points-lower-nifty-below-25600-infosys-ends-3-percent-down-2764795-2025-08-01",
      "headline": "Sensex closes 586 points lower, Nifty below 25,600; Infosys ends 3% downThe S&P BSE Sensex lost 585.67 points to close at 80,599.91, while the NSE Nifty50 was down by 203 points to end at 24,565.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fd-tips-loss-emergency-fund-mistake-insurance-fund-personal-finance-money-saving-2764639-2025-08-01",
      "headline": "CA explains why you should not use FDs as an emergency fundAccording to RBI guidelines, banks can charge up to 0.5% to 1.0% of the interest rate as a penalty if FDs are broken before their maturity period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-compromise-on-agriculture-dairy-farmers-interest-government-sources-on-us-tariff-2764724-2025-08-01",
      "headline": "Indian interests top priority, no chance of compromising due to US tariffs: SourcesAn official said that the government is closely watching the developments but sees no reason for alarm after the US imposed a 25% tariff on India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-news-probe-not-cooperating-staff-income-tax-department-books-outside-india-report-2764710-2025-08-01",
      "headline": "Jane Street not cooperating in probe with income tax department: ReportThe firm's servers are located outside India, and officials said they are unable to access them. Additionally, accounts books are also being maintained overseas, even though company law requires them to be kept in India."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fwice-warns-kartik-aaryan-over-pakistani-event-actor-denies-link-azadi-utsav-2765376-2025-08-02",
      "headline": "Film body warns Kartik Aaryan over event by Pakistani restaurant, actor denies linkActor Kartik Aaryan's team has clarified that he is not associated with the event organised by a Pakistani-owned restaurant. The response came after Federation of Western lndia Cine Employees (FWICE) warned him against the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-trailer-rajinikanth-kollywood-first-1000-crore-loading-2765359-2025-08-02",
      "headline": "Kollywood's 1st Rs 1,000 crore loading: Internet on Rajinikanth's Coolie trailerThe trailer of director Lokesh Kanagaraj's 'Coolie' has been released amid much anticipation. Social media users have predicted that the Rajinikanth-starrer could be Kollywood's first Rs 1,000 crore film. The film, featuring an ensemble cast, is set to release on August 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-entry-coolie-audio-launch-aamir-khan-hugs-nagarjuna-lokesh-kanagaraj-2765362-2025-08-02",
      "headline": "Coolie audio launch: Crowd erupts as Rajinikanth enters venue, Aamir Khan hugs himSuperstar Rajinikanth received a rousing welcome at the Nehru Indoor Stadium in Chennai on Saturday. He greeted the cast and crew and hugged them as he welcomed them for the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-trailer-rajinikanth-smuggles-gold-with-style-in-this-action-thriller-2765234-2025-08-02",
      "headline": "Coolie trailer: Rajinikanth, Aamir Khan, Nagarjuna go all guns blazingThe trailer for 'Coolie', featuring superstar Rajinikanth, was unveiled in Chennai on Saturday. Directed by Lokesh Kanagaraj, the film revolves around a gold smuggler. The highly anticipated film will release on August 14 and clash with 'War 2' at the box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vaibhavi-merchant-wins-national-award-says-dhindora-baje-re-was-always-special-2765330-2025-08-02",
      "headline": "Vaibhavi Merchant wins National Award, says Dhindora Baje Re was always specialChoreographer Vaibhavi Merchant said the song 'Dhindora Baje Re' from 'Rocky Aur Rani Kii Prem Kahaani' was always special. She further expressed that winning the National Award for the song's choreography has infused a lot of life back into her work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-coolie-poster-sparks-plagiarism-buzz-same-same-but-different-2765277-2025-08-02",
      "headline": "Same same but different: How Rajinikanth's Coolie poster sparks plagiarism buzzSocial media users have compared 'Coolie' posters to Hollywood films like 'Madame Web' and 'Glass'. The Rajinikanth-starrer is set for release on August 14, with its trailer launching today in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/abhishek-banerjee-aparshakti-khurana-and-varun-sharma-unite-for-imtiaz-ali-side-heroes-2765322-2025-08-02",
      "headline": "Abhishek Banerjee, Aparshakti, and Varun Sharma unite for Imtiaz Ali's Side HeroesA new film, 'Side Heroes', featuring actors Abhishek Banerjee, Aparshakti Khurana, and Varun Sharma, has been announced. The film is expected to release on Friendship Day 2026 and is backed by filmmaker Imtiaz Ali. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-kerala-story-director-sudipto-sen-breaks-silence-on-pinarayi-vijayan-national-award-criticism-for-film-reminds-him-of-pfi-threat-vs-achuthanandan-2765337-2025-08-02",
      "headline": "Watch film first: Kerala Story director on Pinarayi Vijayan's National Award criticism'The Kerala Story' director Sudipto Sen slammed Kerala Chief Minister Pinarayi Vijayan's remarks on the movie's National Award win, urging him to watch the film before passing judgment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/the-real-meaning-of-shah-rukh-khans-national-award-winning-speech-2765306-2025-08-02",
      "headline": "The real meaning of Shah Rukh Khan's National Award-winning speechFrom defending his reel son in 'Jawan' to standing tall for his real one, Shah Rukh Khan's National Award speech was more than gratitude. It was a statement. It was also a reminder that the King never left the throne - National Award or not. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-reboot-episode-4-update-a-new-sanskaari-tulsi-enters-the-show-2765252-2025-08-02",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi reboot Ep 4: A new sanskaari Tulsi enters the show Kyunki Saas Bhi Kabhi Bahu Thi reboot Episode 4: As Tulsi holds on to her ideals and the Tulsi plant in the middle of a storm, a new chapter begins - one that questions blood ties, justice, and what truly makes a mother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-holiday-director-nancy-meyers-surprised-by-reports-of-limited-series-news-to-me-2765195-2025-08-02",
      "headline": "The Holiday director Nancy Meyers surprised by reports of limited series: News to me'The Holiday' director Nancy Meyers expressed surprise at reports of the romantic movie being reimagined for a limited series on Apple TV+. She said the development is news to her as well. The original film stars actors Cameron Diaz, Kate Winslet, Jude Law and Jack Black in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aadujeevitham-the-real-kerala-story-got-snubbed-at-the-national-awards-2765157-2025-08-02",
      "headline": "Aadujeevitham: How the real Kerala story got snubbed at the National AwardsPrithviraj Sukumaran and director Blessy's 'Aadujeevitham' aka 'The Goat Life' got snubbed at the National Film Awards, which were announced on August 1 in New Delhi. Many fans pointed out that it was a gross misjudgement by the jury.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/atlee-kamal-haasan-and-mohanlal-congratulate-shah-rukh-khan-and-other-national-award-winners-2765178-2025-08-02",
      "headline": "Atlee, Kamal Haasan, and Mohanlal congratulate SRK and other National Award winnersSouth Indian celebrities, including Atlee, Kamal Haasan, and Mohanlal, shared congratulatory messages to national award winners. Atlee, who directed Shah Rukh Khan's award-winning performance in 'Jawan', thanked the actor for giving him the opportunity to direct him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kishore-kumar-the-voice-of-melody-and-money-2765207-2025-08-02",
      "headline": "Kishore Kumar: The Voice of Melody and MoneyFrom serving as the nation's payday anthem to his eccentric financial dealings, Kishore Kumar's relationship with money was as legendary as his melodies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-recalls-losing-national-award-for-swades-in-old-video-watch-video-2765152-2025-08-02",
      "headline": "Shah Rukh Khan recalls losing national award for Swades in old video. Watch videoAn old video of actor Shah Rukh Khan expressing that he should have won a national award for 'Swades' has surfaced online. Actor Saif Ali Khan won the award instead in 2004 for his performance in 'Hum Tum'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/what-is-in-raanjhanaa-new-ai-altered-climax-viral-video-from-theatre-2765175-2025-08-02",
      "headline": "What is in Raanjhanaa's new AI-altered climax? Viral video from theatreMore than a decade after its release, 'Raanjhanaa' returns to theatres - this time with a twist of fate and a second chance at love. But while fans cheer the AI-altered ending, its original creators call it a betrayal of art. Here's all about it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-the-odyssey-return-of-the-epic-soul-to-world-cinema-2763289-2025-08-02",
      "headline": "Ramayana, The Odyssey, and the return of the epic soul to world cinema'Ramayana-Part 1' and 'The Odyssey', helmed by directors Nitesh Tiwari and Christopher Nolan, respectively, are scheduled for a 2026 theatrical release. Both the movies hint at the resurrection of a bygone cinematic era. Can Tiwari and Nolan recreate mystical epics like 'Lanka Dahan', 'The Ten Commandments', and 'Ben-Hur'? On Cinematic Saturday, we reflect on how the visual storytelling of ancient tales bridges cultural heritage with modern spectacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kingdom-box-office-collection-day-2-detailed-report-major-drop-for-vijay-deverakonda-spy-film-on-friday-2765114-2025-08-02",
      "headline": "Kingdom box office Day 2: Major drop for Vijay Deverakonda's spy film on FridayVijay Deverakonda's 'Kingdom' saw a big drop in its collection on the second day at the box office. The film is expected to pick up the pace on Saturday and Sunday, after already emerging as the biggest opener of the actor's career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-15-detailed-report-ahaan-panday-film-remains-unbothered-by-new-releases-son-of-sardaar-2-and-dhadak-2-2765113-2025-08-02",
      "headline": "Saiyaara box office Day 15: Ahaan Panday's film remains unbothered by new releases'Saiyaara' didn't seem to be affected by 'Son of Sardaar 2' and 'Dhadak 2' at the box office. The film will be entering the Rs 300 crore club by the end of its third weekend in India. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-differs-with-rahul-gandhi-over-trumps-dead-economy-remarks-by-saying-that-he-has-his-reasons-2765377-2025-08-02",
      "headline": "He has his reasons: Shashi Tharoor differs with Rahul Gandhi over Trump's remarkCongress MP Shashi Tharoor has differed with party leader Rahul Gandhi over the latter's support for US President Donald Trump's 'dead economy' remark."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/the-odisha-girl-who-was-allegedly-set-on-fire-by-three-unknown-men-dies-at-aiims-delhi-police-say-no-one-involved-2765395-2025-08-02",
      "headline": "Odisha girl, set ablaze days ago, dies in Delhi; then a twist from copsAlthough initial claims alleged that three individuals were involved in setting the 15-year-old girl on fire, Odisha Police said they have found no indication of involvement by any other person in the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-puts-man-who-slapped-co-passenger-on-no-fly-list-man-who-was-slapped-goes-missing-from-kolkata-airport-2765370-2025-08-02",
      "headline": "IndiGo bans man for slapping co-passenger mid-air, flyer who was hit goes missingIn an official statement, the airlines said that the assaulter has been suspended from flying on any IndiGo flights. Meanwhile, the man who was slapped has gone missing from Kolkata airport. He was scheduled to take a connecting flight to Silchar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-engalnd-5th-test-day-3-highlights-report-akash-deep-washington-sundar-2765396-2025-08-02",
      "headline": "Akash Deep's flair, Washington's assault: India break England's spirit on Day 3India vs England 5th Test: India thoroughly dominated Day 3 of the final Test match. With the bat, the Indian tailenders put up an exceptional assault, and with the ball, Mohammed Siraj's wicket on the final ball of the day, left England reeling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/indian-economy-is-dead-remark-rahul-gandhi-gdp-growth-low-inflation-rising-fdi-2765261-2025-08-02",
      "headline": "Why only someone very ignorant can think that Indian economy is deadIndia's strong GDP growth, low inflation, rising FDI, and sectoral reforms are cementing its rise as a resilient global economic leader amid global uncertainty."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ukraine-hits-russian-oil-facilities-military-targets-in-overnight-drone-strikes-glbs-2765409-2025-08-03",
      "headline": "3 Killed in Ukrainian drone strikes on Russian oil refinery, military sitesUkraine launched overnight drone strikes on key Russian targets, hitting oil facilities, a military airfield, and an electronics plant, underscoring its expanding long-range strike capabilities deep inside Russian territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/look-at-usa-nayab-saini-cites-california-floods-as-gurugram-sinks-after-rain-2765379-2025-08-02",
      "headline": "Look at US...: Nayab Saini cites California floods as Gurugram sinks after rainTaking a veiled jibe at US President Donald Trump, Haryana Chief Minister Nayab Singh Saini said, \"Look at America — a country that calls itself powerful — even its city, California, gets flooded due to heavy rain.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/bengalurus-new-civic-map-why-five-city-corporations-were-carved-out-2764207-2025-07-31",
      "headline": "Bengaluru's new civic map: Why five city corporations were carved outIn a revamped model of urban governance, the existing municipal corporation, Bruhat Bengaluru Mahanagara Palike, will soon cease to exist\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kishore-kumar-the-voice-of-melody-and-money-2765207-2025-08-02",
      "headline": "Kishore Kumar: The Voice of Melody and MoneyFrom serving as the nation's payday anthem to his eccentric financial dealings, Kishore Kumar's relationship with money was as legendary as his melodies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/was-tortured-coerced-to-name-pm-modi-yogi-adityanath-mohan-bhagwat-bjp-mppragya-thakurs-big-claim-on-malegaon-case-2765303-2025-08-02",
      "headline": "Pragya Thakur's big claim after Malegaon verdict: Was coerced to name PM ModiLashing out at the then Congress-led government at the Centre, Pragya Thakur alleged that the party was behind the \"false case\" as part of a larger \"conspiracy\" to \"defame the saffron (Bhagwa) and the armed forces.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/arun-jaitley-died-before-farm-laws-son-rohan-jaitley-trashes-rahul-gandhis-threat-claim-2765393-2025-08-02",
      "headline": "Arun Jaitley died before farm laws: Son trashes Rahul Gandhi's 'threat' claimStrongly refuting Rahul Gandhi's claims, Arun Jaitley's son, Rohan Jaitley, in an interview with India Today TV, called the Congress MP's statement \"completely false and devoid of facts.\" Rohan highlighted Rahul Gandhi's history of making \"fact-free allegations\" against senior BJP leaders, citing his past remarks about the late Defence Minister Manohar Parrikar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-kerala-story-director-sudipto-sen-breaks-silence-on-pinarayi-vijayan-national-award-criticism-for-film-reminds-him-of-pfi-threat-vs-achuthanandan-2765337-2025-08-02",
      "headline": "Watch film first: Kerala Story director on Pinarayi Vijayan's National Award criticism'The Kerala Story' director Sudipto Sen slammed Kerala Chief Minister Pinarayi Vijayan's remarks on the movie's National Award win, urging him to watch the film before passing judgment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-stats-records-oval-test-2765346-2025-08-02",
      "headline": "Shubman Gill finishes England Test series with stunning 754 runs: Stat PackENG vs IND, 5th Test: Shubman Gill didn't have the best of times at The Oval, but overall, the newly-appointed Indian skipper had a spectacular time throughout the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ex-jds-mp-prajwal-revanna-sentenced-to-life-imprisonment-for-rape-fined-rs-10-lakh-2765273-2025-08-02",
      "headline": "Prajwal Revanna sentenced to life imprisonment for rape, fined Rs 11 lakhPrajwal Revanna rape case: The verdict was delivered just 14 months after the case was registered. The Rs 11 lakh fine will go to the rape survivor as compensation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/sona-comstar-legal-battle-rani-kapur-sanjay-kapur-death-dispute-2765394-2025-08-02",
      "headline": "Death, disputes and looming legal battle: Unfolding Sona Comstar sagaWeeks after the sudden death of her son, Rani Kapur has accused family members of misleading her and sidelining her during the crucial transition of control over the family's flagship company, Sona Comstar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/the-real-meaning-of-shah-rukh-khans-national-award-winning-speech-2765306-2025-08-02",
      "headline": "The real meaning of Shah Rukh Khan's National Award-winning speechFrom defending his reel son in 'Jawan' to standing tall for his real one, Shah Rukh Khan's National Award speech was more than gratitude. It was a statement. It was also a reminder that the King never left the throne - National Award or not. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-511-01-08-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-washington-sundar-six-hitting-spree-at-oval-scores-39-ball-50-2765392-2025-08-02",
      "headline": "Watch: Washington Sundar goes on six-hitting spree at Oval, bludgeons 39-ball 50India all-rounder Washington Sundar put on a six-hitting fest on Day 3 of the fifth Test against England at the Oval as he scored a quick-fire 39-ball half-century."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ed-makes-first-arrest-in-rs-3000-crore-loan-fraud-case-against-anil-ambani-2765334-2025-08-02",
      "headline": "ED makes first arrest in Rs 3,000-crore loan fraud case against Anil AmbaniThe ED arrested BTPL Managing Director Partha Sarathi Biswal after uncovering that the firm allegedly received Rs 5.4 crore from Anil Ambani-owned Reliance Power for arranging fake bank guarantees worth Rs 68.2 crore. The case involves money laundering, forged SBI endorsements, and fabricated emails linked to a tender floated by SECI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/micro-content-short-form-storytelling-next-big-career-skill-2765353-2025-08-02",
      "headline": "From reels to resumes: Short-form storytelling is the next big career skillWith attention spans shrinking, storytelling has changed. Microdramas are thriving -- and not just in the entertainment world but in education, training, and other industries. It's the new language of communication, and your next big career skill."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-woman-boyfriend-arrested-for-husbands-murder-as-police-crack-year-old-case-2765408-2025-08-03",
      "headline": "Delhi woman, boyfriend arrested for husband's murder as police crack year-old caseThe arrested accused have been identified as 34-year-old Soniya, a resident of Alipur in Delhi, and her 28-year-old boyfriend Rohit from Sonipat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-venues-india-vs-pakistan-14-september-dubai-2765380-2025-08-02",
      "headline": "Asia Cup 2025: India vs Pakistan to be played on 14 September in DubaiThe Asian Cricket Council (ACC) unveiled the complete schedule and venues for the Asia Cup 2025 on Saturday, August 2. India vs Pakistan fixture has been finalised for September 14, despite widespread backlash."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-hospital-takes-namma-metro-to-transport-liver-for-urgent-transplant-viral-video-2765345-2025-08-02",
      "headline": "Video: Bengaluru hospital trusts Namma Metro to transport liver for urgent surgeryFor the first time in the city's history, a liver was transported via Bengaluru's Namma Metro for an urgent transplant - all to beat the city's traffic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fwice-warns-kartik-aaryan-over-pakistani-event-actor-denies-link-azadi-utsav-2765376-2025-08-02",
      "headline": "Film body warns Kartik Aaryan over event by Pakistani restaurant, actor denies linkActor Kartik Aaryan's team has clarified that he is not associated with the event organised by a Pakistani-owned restaurant. The response came after Federation of Western lndia Cine Employees (FWICE) warned him against the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-trailer-rajinikanth-kollywood-first-1000-crore-loading-2765359-2025-08-02",
      "headline": "Kollywood's 1st Rs 1,000 crore loading: Internet on Rajinikanth's Coolie trailerThe trailer of director Lokesh Kanagaraj's 'Coolie' has been released amid much anticipation. Social media users have predicted that the Rajinikanth-starrer could be Kollywood's first Rs 1,000 crore film. The film, featuring an ensemble cast, is set to release on August 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-entry-coolie-audio-launch-aamir-khan-hugs-nagarjuna-lokesh-kanagaraj-2765362-2025-08-02",
      "headline": "Coolie audio launch: Crowd erupts as Rajinikanth enters venue, Aamir Khan hugs himSuperstar Rajinikanth received a rousing welcome at the Nehru Indoor Stadium in Chennai on Saturday. He greeted the cast and crew and hugged them as he welcomed them for the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-trailer-rajinikanth-smuggles-gold-with-style-in-this-action-thriller-2765234-2025-08-02",
      "headline": "Coolie trailer: Rajinikanth, Aamir Khan, Nagarjuna go all guns blazingThe trailer for 'Coolie', featuring superstar Rajinikanth, was unveiled in Chennai on Saturday. Directed by Lokesh Kanagaraj, the film revolves around a gold smuggler. The highly anticipated film will release on August 14 and clash with 'War 2' at the box office."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-mohammed-siraj-outsmarts-zak-crawley-with-clever-setup-before-stumps-2765398-2025-08-03",
      "headline": "ENG vs IND: Mohammed Siraj outsmarts Zak Crawley with clever setup before stumpsIndia fast bowler Mohammed Siraj outsmarted Zak Crawley with a clever setup just before stumps as he bluffed the England batter to destroy his stumps before the end of the day's play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-engalnd-5th-test-day-3-highlights-report-akash-deep-washington-sundar-2765396-2025-08-02",
      "headline": "Akash Deep's flair, Washington's assault: India break England's spirit on Day 3India vs England 5th Test: India thoroughly dominated Day 3 of the final Test match. With the bat, the Indian tailenders put up an exceptional assault, and with the ball, Mohammed Siraj's wicket on the final ball of the day, left England reeling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-washington-sundar-six-hitting-spree-at-oval-scores-39-ball-50-2765392-2025-08-02",
      "headline": "Watch: Washington Sundar goes on six-hitting spree at Oval, bludgeons 39-ball 50India all-rounder Washington Sundar put on a six-hitting fest on Day 3 of the fifth Test against England at the Oval as he scored a quick-fire 39-ball half-century."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/lewis-hamilton-ferrari-hungary-gp-qualifier-useless-2765391-2025-08-02",
      "headline": "Lewis Hamilton hits new low after Hungary GP qualifier: Absolutely uselessLewis Hamilton was left frustrated with his driving as he took the 12th spot in qualifying while his teammate, Charles Leclerc took pole."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-confirms-ruturaj-gaikwad-return-as-csk-captain-for-ipl-2026-2765386-2025-08-02",
      "headline": "MS Dhoni confirms CSK captain for IPL 2026, concedes major squad issuesLegendary MS Dhoni has confirmed that Ruturaj Gaikwad will return as Chennai Super Kings captain in IPL 2026. Gaikwad was forced to end his season early last year due to injury concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/hungary-gp-charles-leclerc-ferrari-pole-position-mclaren-lewis-hamilton-2765382-2025-08-02",
      "headline": "Charles Leclerc stuns McLaren as he takes unexpected pole at Hungarian GPFerrari were given a pleasant surprise as Charles Leclerc secured pole at the Hungary GP, snatching the fastest lap time from the McLaren duo of Lando Norris and Oscar Piastri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-venues-india-vs-pakistan-14-september-dubai-2765380-2025-08-02",
      "headline": "Asia Cup 2025: India vs Pakistan to be played on 14 September in DubaiThe Asian Cricket Council (ACC) unveiled the complete schedule and venues for the Asia Cup 2025 on Saturday, August 2. India vs Pakistan fixture has been finalised for September 14, despite widespread backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-kumar-dharmasena-faces-flak-for-ravindra-jadeja-lbw-2765375-2025-08-02",
      "headline": "ENG vs IND: Kumar Dharmasena faces fans' wrath after Jadeja lbw howlerSri Lankan umpire Kumar Dharmasena faced fans' flak for his wrong lbw decision against India's Ravindra Jadeja on Day 3 of the fifth Test against England at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/shacarri-richardson-arrested-alleged-domestic-assault-2765372-2025-08-02",
      "headline": "Sprinter Sha'Carri Richardson arrested over alleged domestic assaultSha'Carri Richardson was arrested for allegedly assaulting her boyfriend, fellow sprinter Christian Coleman, at Seattle-Tacoma Airport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jessica-pegula-canadian-open-anastasija-sevastova-upset-2765363-2025-08-02",
      "headline": "Defending champion Pegula stunned by World No.386 in major upsetCanadian Open: Anastasija Sevastova defeated defending champion Jessica Pegula 3–6, 6–4, 6–1 and set up a clash with four-time Grand Slam champion Naomi Osaka. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-karun-nair-return-test-career-205-runs-england-tour-2765364-2025-08-02",
      "headline": "Is this the end for Karun Nair after a disappointing England tour?Karun Nair ended his first Test series on his international return with just 205 runs. His performances have left fans frustrated, with many suggesting that it may be time to give someone else a go."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-venues-india-vs-pakistan-14-september-dubai-2765380-2025-08-02",
      "headline": "Asia Cup 2025: India vs Pakistan to be played on 14 September in DubaiThe Asian Cricket Council (ACC) unveiled the complete schedule and venues for the Asia Cup 2025 on Saturday, August 2. India vs Pakistan fixture has been finalised for September 14, despite widespread backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-kumar-dharmasena-faces-flak-for-ravindra-jadeja-lbw-2765375-2025-08-02",
      "headline": "ENG vs IND: Kumar Dharmasena faces fans' wrath after Jadeja lbw howlerSri Lankan umpire Kumar Dharmasena faced fans' flak for his wrong lbw decision against India's Ravindra Jadeja on Day 3 of the fifth Test against England at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/shacarri-richardson-arrested-alleged-domestic-assault-2765372-2025-08-02",
      "headline": "Sprinter Sha'Carri Richardson arrested over alleged domestic assaultSha'Carri Richardson was arrested for allegedly assaulting her boyfriend, fellow sprinter Christian Coleman, at Seattle-Tacoma Airport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jessica-pegula-canadian-open-anastasija-sevastova-upset-2765363-2025-08-02",
      "headline": "Defending champion Pegula stunned by World No.386 in major upsetCanadian Open: Anastasija Sevastova defeated defending champion Jessica Pegula 3–6, 6–4, 6–1 and set up a clash with four-time Grand Slam champion Naomi Osaka. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-karun-nair-return-test-career-205-runs-england-tour-2765364-2025-08-02",
      "headline": "Is this the end for Karun Nair after a disappointing England tour?Karun Nair ended his first Test series on his international return with just 205 runs. His performances have left fans frustrated, with many suggesting that it may be time to give someone else a go."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}