{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-key-decisions-what-cheaper-what-costlier-and-all-other-details-2653637-2024-12-22",
      "headline": "GST Council's key decisions: What's cheaper, what's costlier, and all other detailsGST Council brings key tax changes impacting everyday essentials like popcorn, used cars, fortified rice, corporate sponsorships, and penalties.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/goods-and-services-tax-eighteen-per-cent-used-ev-car-sale-business-jet-fuel-gst-2653536-2024-12-21",
      "headline": "GST at 18% on used EV car sale by business, jet fuel stays out of its ambitThe GST Council in its 55th meeting also decided to clarify on taxability of popcorn, saying caramelised popcorn will continue to attract tax at the rate of 18 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-delays-decision-on-lowering-tax-for-health-life-insurance-premiums-2653343-2024-12-21",
      "headline": "GST Council delays decision on lowering tax for health, life insurance premiumsGST Council Meeting: During the 55th meeting held on Saturday, technical considerations led to the deferral, with the Group of Ministers (GoM) tasked to conduct further deliberations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/55th-gst-council-meeting-2653320-2024-12-21",
      "headline": "GST Council Meeting: Will tax rates on health and life insurance premiums drop today? GST Council Meeting begins: One of the key items on the agenda is the proposal to reduce the Goods and Services Tax (GST) on insurance premiums, a move that could bring relief to policyholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/55th-gst-council-meeting-what-to-expect-costlier-cheaper-food-delivery-luxury-items-insurance-premiums-2653307-2024-12-21",
      "headline": "55th GST Council Meeting begins: What could become costlier or cheaper todayGST Council Meeting: From essential services to luxury items, a wide range of proposals are under discussion, some of which could significantly impact consumers and businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-4000-points-nifty50-decline-5-trading-sessions-this-week-explained-2652984-2024-12-20",
      "headline": "Explained: Why Sensex fell 4,000 points in 5 trading sessionsThe BSE Sensex plummeted over 4,000 points across five consecutive sessions, while the NSE Nifty50 fell approximately 1,200 points, representing a nearly 5% loss within the week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/direct-tax-vivad-se-vishwas-scheme-2024-dtvsv-faqs-for-settling-tax-disputes-easily-2652961-2024-12-20",
      "headline": "Vivad Se Vishwas Scheme: FAQs for settling tax disputes easily Taxpayers can resolve pending income tax disputes under the Direct Tax Vivad Se Vishwas Scheme 2024 by settling the disputed tax amount and avoiding additional interest and penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nita-ambani-to-headline-india-conference-at-harvard-2652947-2024-12-20",
      "headline": "Nita Ambani to headline India Conference at HarvardThe India Conference at Harvard, one of the largest student-led India-focused events in the US, is hosted by students across Harvard's graduate and undergraduate schools."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-today-sensex-nosedives-1100-points-nifty-below-23600-it-stocks-tumble-2652911-2024-12-20",
      "headline": "Sensex nosedives 1,100 points, Nifty falls below 23,600; IT stocks tumbleStock market crash: The S&P BSE Sensex ended 1,176.46 points lower at 78,041.59, while the NSE Nifty50 settled 364.20 points lower at 23,587.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-money-launches-pay-later-margin-trading-facility-mtf-3-things-to-know-2652885-2024-12-20",
      "headline": "Paytm Money launches 'Pay Later' Margin Trading. 3 things to knowPaytm Money launches 'Pay Later' MTF, democratising stock trading with seamless activation, innovative tools, and affordable rates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-today-sensex-down-800-points-bloodbath-dalal-street-explained-2652825-2024-12-20",
      "headline": "Sensex tumbles 1,000 points. What's behind the bloodbath on Dalal Street?Stock market today: The Sensex had fallen 1033.99 points to 78,184.06 at 3:00 pm, while the Nifty50 slipped 299.35 points to trade at 23,652.35. All broader market indices were also trading in negative territory.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/looking-for-high-returns-on-investments-check-these-5-options-equities-ipos-mid-cap-funds-small-cap-funds-elss-p2p-lending-2652800-2024-12-20",
      "headline": "Looking for high returns on investments? Check these 5 optionsBalancing risk and reward is essential for wealth creation. From equities to IPOs and P2P lending, explore these high-return investment options to align with your financial goals and risk appetite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nacdac-infra-ipo-allotment-step-by-step-guide-to-check-status-2652789-2024-12-20",
      "headline": "NACDAC Infra IPO allotment: Step-by-step guide to check statusThe Ghaziabad-based construction company's IPO, open from December 17 to December 19, offered shares in the price range of Rs 33-35 per share with a lot size of 4,000 shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/senores-pharmaceuticals-ipo-check-latest-gmp-price-band-and-should-you-apply-stmp-2652775-2024-12-20",
      "headline": "Senores Pharmaceuticals IPO: Check latest GMP, price band and should you apply?Senores Pharmaceuticals IPO: The Ahmedabad-based pharmaceutical company is offering shares in a price range of Rs 372-391, with a minimum application size of 38 equity shares and multiples thereafter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nithin-kamath-on-margin-trading-facility-what-it-is-and-how-it-works-2652756-2024-12-20",
      "headline": "Zerodha launches Margin Trading Facility: What it is and how it worksZerodha's Nithin Kamath introduces Margin Trading Facility, enabling investors to leverage funds for stock delivery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ventive-hospitality-ipo-opens-check-latest-gmp-price-band-and-other-key-details-stmp-2652752-2024-12-20",
      "headline": "Ventive Hospitality IPO opens: Check latest GMP, price band, and other detailsVentive Hospitality IPO: The subscription window closes on December 24, 2024. The basis of allotment is expected to be finalised by December 26, with shares credited to demat accounts by December 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-extend-losses-amid-weak-global-cues-2652725-2024-12-20",
      "headline": "Sensex, Nifty extend losses amid weak global cuesAt 10:28 am, the S&P BSE Sensex fell 274.86 points to 78,943.19, while the NSE Nifty50 dropped 67.90 points to 23,883.80."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rupee-hits-all-time-low-against-us-dollar-again-key-reasons-behind-pressure-2652736-2024-12-20",
      "headline": "Rupee hits all-time low against US dollar. Why is it under pressure?The rupee surpassed its previous low of 85.0850 reached on Thursday and settled at 85.10 by 10:00 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-you-get-a-personal-loan-with-low-credit-score-follow-these-tips-check-details-2652396-2024-12-19",
      "headline": "Can you get a personal loan with low credit score? Check detailsWhile a low credit score may present challenges, using strategies like reduced DTI, and showing income stability, etc. can help secure a personal loan and improve your credit for the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-consumer-dismisses-reports-of-starbucks-exiting-india-2652370-2024-12-19",
      "headline": "Tata Consumer dismisses reports of Starbucks exiting India as baselessAn earlier report claimed that Starbucks was considering exiting the Indian market due to high costs and mounting losses."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-mohali-building-collapse-death-toll-rescue-operation-ndrf-sdrf-police-case-owners-2653608-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mohali building collapse toll rises to 2, efforts on to rescue trapped peopleThe three-storey building in Punjab's Mohali collapsed on Saturday when some excavation work was underway in the adjacent building's basement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-india-veto-choices-china-un-intimidated-to-conform-2653588-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "S Jaishankar says India won't be intimidated to conform: No veto on our choicesExternal Affairs Minister S Jaishankar said that India will not permit others to have a veto on its choices and stressed it would act in its interests \"without being intimidated to conform\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/elon-musk-germany-christmas-market-attack-suspect-taleb-a-saudi-arabia-ex-muslim-extradition-2653598-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Suicidal empathy: Elon Musk on Germany not extraditing market attacker to SaudiElon Musk shared a thread on X, which alleged that Taleb A, a Saudi doctor suspected of ramming his car into a crowd at a Christmas market in Germany, fled his country in 2006 after being accused of rape and implicated in serious crimes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bihar-muzaffarpur-attack-viral-video-men-police-case-2653604-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man thrashed, forced to lick spit in Bihar's Muzaffarpur, attackers record videoA group of men assaulted and humiliated a man in Bihar Muzaffarpur and filmed the act and uploaded the video online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/indian-hotels-more-expensive-than-resorts-tourist-destinations-abroad-room-rent-tariffs-goa-jaisalmer-thailand-2653524-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why hotels in India are more expensive than those abroadHotels and resorts in India are way more expensive than those in tourist destinations abroad. India Today Digital found how hotel tariffs in Goa and Jaisalmer were way higher than those in Colombo, Phuket and Hanoi. High hotel rents are pushing Indians to holiday abroad. Hotel industry experts explain what drives tariffs, and offer solutions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-under-19-womens-asia-cup-india-vs-bangladesh-final-niki-prasad-2653615-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India win Under-19 Women's Asia Cup 2024 title after beating Bangladesh Niki Prasad's India defeated Bangladesh by 41 runs in the final on Sunday, December 22, to become champions in the inaugural edition of the Under-19 Women's Asia Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-denies-blocking-ap-dhillon-my-issues-could-be-with-government-not-artists-2653614-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Diljit Dosanjh denies blocking AP Dhillon: My issues could be with government…Diljit Dosanjh denied blocking AP Dhillon on Instagram, stating his 'issues could be with the government and not fellow artists'. The exchange occurred after Dhillon requested Dosanjh to unblock him during a concert."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-nagaur-suv-flips-overturns-accident-tea-viral-video-2653577-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Car flips and crashes in Rajasthan, passengers escape unhurt, ask for teaThe incident took place in Rajasthan's Nagaur on December 20, as the driver lost control of the speeding SUV while making a turn, which led to the car flipping multiple times before landing upside down in front of a car showroom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ex-muslims-claim-germany-magdeburg-christmas-market-attack-saudi-atheist-warn-of-taqiyyah-conspiracy-2653579-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ex-Muslims claim Christmas market attacker isn't ex-Muslim, warn of bigger plotTaleb Al Abdulmohsen, the 50-year-old who killed 5 people and injured 200 at a Christmas market in Germany isn't an ex-Muslim, claim other ex-Muslims, some of whom have known him for years. They say the Saudi attacker was using the Islamic concept of taqiyya to hide his identity, and warn of a bigger conspiracy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/ex-amazon-executive-bengaluru-team-gruelling-hours-viral-post-sparks-debate-2653625-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ex-Amazon executive's post on Bengaluru tech team's gruelling hours sparks debateIn a now-viral post on LinkedIn, former Amazon executive Adam Broda sparked debate around Indian work culture, citing his experience with the company's Bengaluru tech team's gruelling work hours.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-boxing-day-test-rohit-sharma-injury-mcg-2653593-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Injury scare for Rohit Sharma after blow to knee at nets in MelbourneIndia captain Rohit Sharma and batter KL Rahul copped injury blows ahead of the Boxing Day Test match in Melbourne. While Rohit was hit on his knee, KL Rahul was spotted getting attended by the physio after an injury to his right hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pm-narendra-modi-kuwait-visit-emir-sheikh-meshal-al-sabah-arabian-gulf-cup-football-2653584-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi attends Arabian Gulf Cup opening ceremony, meets Kuwait EmirPrime Minister Narendra Modi met Kuwait's Emir Sheikh Meshal Al-Sabah during the opening ceremony of the 26th Arabian Gulf Cup, where he was the chief guest."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/blake-lively-hollywood-actress-it-ends-with-us-co-star-justin-baldoni-of-sexual-harassment-2653555-2024-12-21?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Blake Lively sues co-star Justin Baldoni, accuses him of sexual harassmentThe complaint was filed on Friday with the California Civil Rights Department, preceding a lawsuit. It names Justin Baldoni, the studio behind \"It Ends With Us\" and his publicists among the defendants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/joe-biden-sleep-air-force-one-military-family-us-president-marines-afghan-withdrawal-2653595-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Biden napped on plane while families waited hours for soldiers' bodies: ReportUS President Joe Biden is accused of sleeping during the casket reception ceremony for soldiers killed in Afghanistan, causing grieving families to wait for over three hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-sanju-samson-rajasthan-royals-13-year-old-vaibhav-suryavanshi-2653606-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sanju Samson explains why RR signed 13-yera-old Vaibhav SuryavanshiRajasthan Royals captain Sanju Samson explained the reason behind the franchise buying 13-year-old Vaibhav Suryavanshi. Samson spoke highly of the team's tradition of picking young talents and converting them into superstars."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/germany-car-attack-crash-accused-saudi-arabia-doctor-magdeburg-taleb-dead-injured-2653572-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Germany attack suspect held anti-Islam views, was angered by migrant policyPolice were puzzling over the motive of Taleb al-Abdulmohsen, the top suspect after an SUV ploughed at high speed through a dense crowd Friday, also injuring 205 people in the eastern city of Magdeburg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-2-women-marry-in-kannauj-after-one-undergoes-gender-change-surgery-2653553-2024-12-21?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Same-sex couple ties the knot after one undergoes gender-affirming surgery in UPA Kannauj woman underwent gender reassignment, spending Rs 7 lakh, to marry her partner, a beauty parlour owner. Their love story began in 2020 and gained family approval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-entertainment-business-sports-politics-439-20-12-2024?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-siblings-sent-bomb-threat-emails-to-school-to-postpone-exam-police-2653597-2024-12-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi siblings sent bomb threat emails to school to postpone exam: PoliceA Delhi Police officer said that a threatening email to Delhi's Venkateshwar Global School was sent by two siblings enrolled in the school because they wanted the exams to be postponed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/vrindavans-thakur-bankebihari-temple-asks-visitors-to-dress-modestly-no-mini-skirts-torn-jeans-2653529-2024-12-21?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vrindavan temple asks visitors to 'dress modestly': No mini skirts, torn jeansThe appeal was made through media channels and banners, put up across the city, especially roads, leading to the temple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/pm-modi-in-kuwait-singer-sings-saare-jahaan-se-accha-after-hala-modi-event-2653592-2024-12-22?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Watch: Kuwaiti singer sings 'Saare Jahaan Se Accha' after attending PM's eventKuwaiti singer Mubarak Al Rashed sings 'Saare Jahaan Se Accha' after attending PM Modi's community event #HalaModi at Shaikh Saad Al Abdullah Indoor Sports Complex in Kuwait."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-portfolio-allocation-devendra-fadnavis-ajit-pawar-eknath-shinde-2653528-2024-12-21?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Devendra Fadnavis keeps Home, Ajit Pawar gets Finance in new Maharashtra CabinetDevendra Fadnavis has kept the Home Ministry in the Maharashtra Cabinet, while his deputies, Ajit Pawar and Eknath Shinde, have been assigned the portfolios of Finance and Urban Development, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-reveals-first-look-of-two-spadex-satellites-that-will-dock-in-space-2653490-2024-12-21?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Isro reveals first look of two Spadex satellites that will dock in spaceIsro is set to launch the Space Docking Experiment (SpaDeX) mission, aiming to demonstrate autonomous docking between two spacecraft, a critical technology for future space endeavours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/germany-christmas-market-attack-accused-magdeburg-india-mea-condemns-2653556-2024-12-21?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "7 Indians injured in German Christmas market rampage, government condemns attackThe Ministry of External Affairs said that the Indian Mission in Germany has been actively coordinating with injured Indian nationals and their families, offering all possible assistance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-thunderous-welcome-game-changer-pre-release-event-us-dances-film-songs-2653624-2024-12-22",
      "headline": "Ram Charan receives thunderous welcome at Game Changer pre-release event in USActor Ram Charan received a grand welcome at the pre-release event of his film Game Changer in Dallas, US, where he entertained a massive crowd by dancing to the film's songs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-denies-blocking-ap-dhillon-my-issues-could-be-with-government-not-artists-2653614-2024-12-22",
      "headline": "Diljit Dosanjh denies blocking AP Dhillon: My issues could be with government…Diljit Dosanjh denied blocking AP Dhillon on Instagram, stating his 'issues could be with the government and not fellow artists'. The exchange occurred after Dhillon requested Dosanjh to unblock him during a concert."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/it-ends-with-us-actor-justin-baldoni-dropped-by-agency-blake-lively-controversy-2653599-2024-12-22",
      "headline": "Actor Justin Baldoni dropped by agency as feud with Blake Lively escalatesJustin Baldoni has been reportedly removed by agency WME following allegations of sexual harassment by Blake Lively. The Gossip Girl actor filed a complaint against Baldoni, claiming a campaign to tarnish her reputation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/blake-lively-hollywood-actress-it-ends-with-us-co-star-justin-baldoni-of-sexual-harassment-2653555-2024-12-21",
      "headline": "Blake Lively sues co-star Justin Baldoni, accuses him of sexual harassmentThe complaint was filed on Friday with the California Civil Rights Department, preceding a lawsuit. It names Justin Baldoni, the studio behind \"It Ends With Us\" and his publicists among the defendants."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/delhi-sg-pipers-rajkumar-pal-aiming-for-hockey-india-league-spotlight-2653638-2024-12-22",
      "headline": "Delhi SG Pipers' Rajkumar Pal aiming for Hockey India League spotlightIn an exclusive interaction with Indiatoday.in, Delhi SG Pipers' Rajkumar Pal opens up about taking the spotlight with his performances and being realistic about the chances of his side in the 2024-25 season of the Hockey India League. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-under-19-womens-asia-cup-niki-prasad-elated-win-bowlers-final-2653634-2024-12-22",
      "headline": "Bowlers did a fantastic job: Niki Prasad on historic Asia Cup triumphUnder-19 Women's Asia Cup 2024: Captain Niki Prasad praised Gongadi Trisha and the Indian bowlers for putting their best foot forward in the final on Sunday against Bangladesh in Kuala Lumpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-bgt-akash-deep-press-conference-melbourne-2653633-2024-12-22",
      "headline": "Disciplined Akash Deep credits Rohit-Kohli for massive growth-curve in AustraliaIndia pacer Akash Deep credited senior batters Virat Kohli and Rohit Sharma for the betterment of young India fast bowlers. The seamer credited the duo for helping young pacers not look like novices on their first tour of Australia.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-under-19-womens-asia-cup-india-vs-bangladesh-final-niki-prasad-2653615-2024-12-22",
      "headline": "India win Under-19 Women's Asia Cup 2024 title after beating Bangladesh Niki Prasad's India defeated Bangladesh by 41 runs in the final on Sunday, December 22, to become champions in the inaugural edition of the Under-19 Women's Asia Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-akash-deep-bgt-series-level-melbourne-test-2653613-2024-12-22",
      "headline": "India high on confidence after Gabba: Akash Deep feels series 50-50 ahead of MCGIndia seamer Akash Deep believes that the Border-Gavaskar Trophy is 50-50 going into the final two Test matches of the series. The pacer spoke to the press on Sunday and updated about the mood of the Indian camp ahead of the MCG Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-sanju-samson-rajasthan-royals-13-year-old-vaibhav-suryavanshi-2653606-2024-12-22",
      "headline": "Sanju Samson explains why RR signed 13-yera-old Vaibhav SuryavanshiRajasthan Royals captain Sanju Samson explained the reason behind the franchise buying 13-year-old Vaibhav Suryavanshi. Samson spoke highly of the team's tradition of picking young talents and converting them into superstars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-barcelona-vs-atletico-madrid-hansi-flick-reaction-laliga-points-table-2653594-2024-12-22",
      "headline": "Frustrated Flick says 'losing 9 points not normal' after tough Atletico resultFC Barcelona coach Hansi Flick was left frustrated after losing 1-2 to Atletico Madrid on Saturday, December 21. Flick said that losing 9 points was not normal.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-boxing-day-test-rohit-sharma-injury-mcg-2653593-2024-12-22",
      "headline": "Injury scare for Rohit Sharma after blow to knee at nets in MelbourneIndia captain Rohit Sharma and batter KL Rahul copped injury blows ahead of the Boxing Day Test match in Melbourne. While Rohit was hit on his knee, KL Rahul was spotted getting attended by the physio after an injury to his right hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/boxing-oleksandr-usyk-vs-tyson-fury-fight-result-highlights-2653586-2024-12-22",
      "headline": "Ukraine's Usyk beats Tyson Fury on points to retain unified heavyweight titlesUkraine's Oleksandr Usyk beat Tyson Fury in their much anticipated rematch to retain his unified world heavyweight titles. Usyk won 116-112 via an unanimous decision, much to the shock of Fury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sports-cricket-vaibhav-suryavanshi-becomes-youngest-indian-player-to-play-list-a-cricket-vijay-hazare-trophy-2653564-2024-12-21",
      "headline": "Vaibhav Suryavanshi shatters major record in Vijay Hazare Trophy after IPL dealIndia's young batting sensation Vaibhav Suryavanshi etched his name in the history books during Bihar's opening game of the Vijay Hazare Trophy 2024-25 as he became the youngest Indian player to play a List-A game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/travis-head-shares-adorable-picture-of-his-newborn-harrisons-first-smile-2653565-2024-12-21",
      "headline": "Travis Head shares adorable picture of his newborn: Harrison's first smileTravis Head shared an adorable picture of his newborn son, Harrison. The caption read, \"Harrison's first smile.\" The Aussie star will gear up for the upcoming Boxing Day Test vs India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-barcelona-vs-atletico-madrid-hansi-flick-reaction-laliga-points-table-2653594-2024-12-22",
      "headline": "Frustrated Flick says 'losing 9 points not normal' after tough Atletico resultFC Barcelona coach Hansi Flick was left frustrated after losing 1-2 to Atletico Madrid on Saturday, December 21. Flick said that losing 9 points was not normal.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-boxing-day-test-rohit-sharma-injury-mcg-2653593-2024-12-22",
      "headline": "Injury scare for Rohit Sharma after blow to knee at nets in MelbourneIndia captain Rohit Sharma and batter KL Rahul copped injury blows ahead of the Boxing Day Test match in Melbourne. While Rohit was hit on his knee, KL Rahul was spotted getting attended by the physio after an injury to his right hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/boxing-oleksandr-usyk-vs-tyson-fury-fight-result-highlights-2653586-2024-12-22",
      "headline": "Ukraine's Usyk beats Tyson Fury on points to retain unified heavyweight titlesUkraine's Oleksandr Usyk beat Tyson Fury in their much anticipated rematch to retain his unified world heavyweight titles. Usyk won 116-112 via an unanimous decision, much to the shock of Fury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sports-cricket-vaibhav-suryavanshi-becomes-youngest-indian-player-to-play-list-a-cricket-vijay-hazare-trophy-2653564-2024-12-21",
      "headline": "Vaibhav Suryavanshi shatters major record in Vijay Hazare Trophy after IPL dealIndia's young batting sensation Vaibhav Suryavanshi etched his name in the history books during Bihar's opening game of the Vijay Hazare Trophy 2024-25 as he became the youngest Indian player to play a List-A game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/travis-head-shares-adorable-picture-of-his-newborn-harrisons-first-smile-2653565-2024-12-21",
      "headline": "Travis Head shares adorable picture of his newborn: Harrison's first smileTravis Head shared an adorable picture of his newborn son, Harrison. The caption read, \"Harrison's first smile.\" The Aussie star will gear up for the upcoming Boxing Day Test vs India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sam-konstas-ready-with-plans-to-face-jasprit-bumrah-aus-vs-ind-border-gavaskar-trophy-2653547-2024-12-21",
      "headline": "Sam Konstas ready to face Bumrah? Australia batter opens up on his preparationYoung Australia batter Sam Konstas revealed that he's ready with plans to face Indian bowlers in the upcoming fourth Test against India in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/amol-mazumdar-gives-update-on-harmanpreet-kaurs-injury-ahead-of-odi-series-2653548-2024-12-21",
      "headline": "Amol Mazumdar gives update on Harmanpreet Kaur's injury ahead of ODI seriesAmol Mazumdar provided an update on Harmanpreet Kaur's injury ahead of the 3-match ODI series between India and West Indies women. The Indian team, under Smriti Mandhana, has already clinched the 3-match T20I series 2-1 vs West Indies.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kl-rahul-looks-ever-so-stylish-on-coffee-date-with-wife-athiya-shetty-in-melbourne-2653543-2024-12-21",
      "headline": "KL Rahul looks ever-so-stylish on coffee date with wife Athiya in MelbourneKL Rahul was out and about in Melbourne with wife Athiya Shetty as the couple spent quality time over a cup of coffee. The Indian batter will feature in the Boxing Day Test vs Australia at the MCG. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-2653538-2024-12-21",
      "headline": "R Ashwin was frustrated by being overlooked in overseas conditions: Aakash ChopraFormer India cricketer turned commentator Aakash Chopra feels that Ravichandran Ashwin was frustrated with being continuously overlooked in the overseas conditions, which triggered his retirement decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/liron-jaden-wears-the-overall-crown-of-jk-tyre-novice-cup-momentum-motorsport-2653533-2024-12-21",
      "headline": "Liron Jaden wears the overall crown of JK Tyre Novice Cup Momentum MotorsportLiron Jaden Samuels clinched the JK Tyre Novice Cup title after a thrilling finale at the Kari Motor Speedway. Despite Aditya Patnaik's triple win, a penalty cost him the crown. Momentum Motorsports secured the team championship with 63 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sanjay-bangar-rohit-sharma-aus-vs-ind-border-gavaskar-trophy-2024-25-2653527-2024-12-21",
      "headline": "Sanjay Bangar's advice to struggling Rohit Sharma: Can he come to bat at no 3?Former India cricketer and batting coach Sanjay Manjrekar has come up with batting advice for India captain Rohit Sharma amid his poor form in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/robin-uthappa-breaks-silence-after-arrest-warrant-over-pf-fraud-allegation-2653526-2024-12-21",
      "headline": "Robin Uthappa breaks silence after arrest warrant over PF fraud allegationRobin Uthappa clarifies his non-involvement in day-to-day operations of companies linked to PF fraud allegations, emphasising his role was limited to financial contributions. He vows to resolve the matter legally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-and-western-bulldogs-teams-exchanged-their-jerseys-at-mcg-2653516-2024-12-21",
      "headline": "Watch: Jasprit Bumrah and Western Bulldogs teams exchange their jerseys at MCGJasprit Bumrah's love for football shines as he exchanges jerseys with the Western Bulldogs at the MCG. The Indian pacer, a Manchester United fan, continues to bridge sports boundaries ahead of the highly anticipated Boxing Day Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/liron-jaden-wears-the-overall-crown-of-jk-tyre-novice-cup-momentum-motorsport-2653533-2024-12-21",
      "headline": "Liron Jaden wears the overall crown of JK Tyre Novice Cup Momentum MotorsportLiron Jaden Samuels clinched the JK Tyre Novice Cup title after a thrilling finale at the Kari Motor Speedway. Despite Aditya Patnaik's triple win, a penalty cost him the crown. Momentum Motorsports secured the team championship with 63 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sanjay-bangar-rohit-sharma-aus-vs-ind-border-gavaskar-trophy-2024-25-2653527-2024-12-21",
      "headline": "Sanjay Bangar's advice to struggling Rohit Sharma: Can he come to bat at no 3?Former India cricketer and batting coach Sanjay Manjrekar has come up with batting advice for India captain Rohit Sharma amid his poor form in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/robin-uthappa-breaks-silence-after-arrest-warrant-over-pf-fraud-allegation-2653526-2024-12-21",
      "headline": "Robin Uthappa breaks silence after arrest warrant over PF fraud allegationRobin Uthappa clarifies his non-involvement in day-to-day operations of companies linked to PF fraud allegations, emphasising his role was limited to financial contributions. He vows to resolve the matter legally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-and-western-bulldogs-teams-exchanged-their-jerseys-at-mcg-2653516-2024-12-21",
      "headline": "Watch: Jasprit Bumrah and Western Bulldogs teams exchange their jerseys at MCGJasprit Bumrah's love for football shines as he exchanges jerseys with the Western Bulldogs at the MCG. The Indian pacer, a Manchester United fan, continues to bridge sports boundaries ahead of the highly anticipated Boxing Day Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-chetan-sharma-aus-vs-ind-border-gavaskar-trophy-2024-25-2653509-2024-12-21",
      "headline": "Virat Kohli will score 2 more centuries in next two matches: Chetan SharmaFormer India cricketer and chief selector Chetan Sharma has backed star India batter Virat Kohli to score two more centuries in the ongoing series against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-ravi-shastri-travis-head-balms-2653505-2024-12-21",
      "headline": "They are looking for balms in India: Shastri on Head'ache'IND vs AUS: Ravi Shastri spoke about how Travis Head has upped his game and has transformed himself into a force to be reckoned with. The southpaw is the top run-scorer in the ongoing five-match Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/afghanistan-clinch-series-win-vs-zimbabwe-with-8-wicket-triumph-in-3rd-odi-2653500-2024-12-21",
      "headline": "Afghanistan clinch series win vs Zimbabwe with 8-wicket triumph in 3rd ODIAfghanistan clinched the 3-match ODI series 2-0 vs Zimbabwe. Allah Ghazanfar led the visitors to an 8-wicket win in the final ODI vs Zimbabwe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-record-kapil-dev-border-gavaskar-trophy-2653499-2024-12-21",
      "headline": "Jasprit Bumrah targets multiple Kapil Dev records in Boxing Day TestIND vs AUS: Jasprit Bumrah has been in stupendous form as he has already taken 21 wickets from three Tests with a couple of five-wicket hauls. Bumrah is on the verge of a few records going into the Melbourne Test. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}