{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-lifted-171-million-people-extreme-poverty-2012-to-2022-world-bank-data-2715692-2025-04-27",
      "headline": "India lifted 171 million people from extreme poverty from 2012 to 2022: World BankRural extreme poverty dropped from 18.4 per cent to 2.8 per cent, and urban from 10.7 per cent to 1.1 per cent, narrowing the rural-urban gap from 7.7 to 1.7 percentage points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-simplifies-online-pf-transfers-form-13-job-change-uan-2715484-2025-04-26",
      "headline": "Changing jobs? Check this EPFO update on PF transfersEffective January 2025, the requirement for employer approval in most transfer cases has been eliminated. Previously, PF balance transfers required coordination between source and destination EPFO offices, often causing delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/e-commerce-crops-data-storage-top-india-us-trade-deal-negotiations-report-2715475-2025-04-26",
      "headline": "E-commerce, crops, data storage top India-US trade deal negotiations: ReportDiscussions will now begin on issues such as market access for US farm goods, India's data localisation rules, and the role of big tech in e-commerce—areas that have previously proved politically sensitive in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-airlines-may-face-turbulence-as-pakistan-closes-its-skies-pahalgam-terror-attack-2715193-2025-04-25",
      "headline": "Indian airlines may face turbulence as Pakistan closes its skiesPakistan has announced shutting its airspace to Indian carriers as tensions rise between the two neighbours following a deadly militant attack in Indian Kashmir earlier this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-to-invest-rs-1000-crore-in-tamil-nadu-plant-report-2715130-2025-04-25",
      "headline": "Samsung to invest Rs 1,000 crore in Tamil Nadu plant: ReportSamsung's Tamil Nadu factory currently employs over 2,000 people. In 2022–23, the plant contributed one-fifth of Samsung's Rs 1 lakh crore sales in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-589-points-lower-nifty-sustains-24000-level-adani-ports-ends-4-percent-lower-2715111-2025-04-25",
      "headline": "Sensex, Nifty close lower as rising India-Pakistan tension spooks investorsThe S&P BSE Sensex lost 588.80 points to end at 79,212.53, while the NSE Nifty50 was down 207.35 points to end at 24,039.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kashmir-economy-impact-tourism-sector-slowdown-pahalgam-terror-attack-india-pakistan-tension-2715110-2025-04-25",
      "headline": "Pahalgam terror attack casts big shadow on Kashmir's booming tourism economyKashmir was slowly rebuilding its image as a peaceful tourist destination after years of conflict, especially after the abrogation of Article 370 in August 2019. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-revises-cut-off-timings-for-overnight-mutual-fund-redemptions-details-here-2715063-2025-04-25",
      "headline": "Sebi revises cut-off timings for overnight mutual fund redemptions. Details hereSebi aims to make sure stock brokers and clearing members use client funds wisely by investing in secure overnight mutual fund schemes (MFOS). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-may-buy-10-boeing-planes-turned-down-by-china-report-trump-tariff-announcement-us-china-trade-war-2715010-2025-04-25",
      "headline": "Air India may buy 10 Boeing planes turned down by China: ReportThe ongoing trade tensions between the US and China, marked by steep duties above 100%, have impacted various sectors, even the aviation industry has taken a hit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-stock-exchange-website-portal-crash-psx-down-india-tension-kashmir-attack-2714960-2025-04-25",
      "headline": "Pakistan Stock Exchange portal crashes amid rising geopolitical heatThe online portal of PSX showed a message saying \"We'll be back soon,\" indicating that the website was temporarily unavailable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bengaluru-resident-shares-costly-homebuying-mistake-dont-fall-for-fomo-reddit-post-high-property-prices-2714958-2025-04-25",
      "headline": "Bengaluru resident shares costly homebuying mistake: 'Don't fall for FOMO'A social media user from Bengaluru shared that he has been living in Bengaluru for the past six years. Like many others, he moved to the city for better career opportunities. Despite being financially stable, he chose to rent rather than buy a flat. But the trouble started soon after."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-crash-top-losers-sensex-nifty-india-pakistan-tension-kashmir-terror-attack-nse-bse-2714926-2025-04-25",
      "headline": "Sensex, Nifty tank: Indo-Pak tensions trigger market crash. Check top losersSensex plunged over 1,000 points, while Nifty tanked over 300 points, falling below 24,000 as uncertainty prevailed over geopolitical tensions."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fleeing-romania-to-being-an-oscar-nominee-why-sebastian-stan-is-truly-a-star-2713501-2025-04-27",
      "headline": "Fleeing Romania to being an Oscar nominee: Why Sebastian Stan is truly a starActor Sebastian Stan's journey from Romania to ruling the roost in Hollywood is anything but typical. From a childhood under a strict regime to becoming a celebrated actor, Stan's story is one of resilience and talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ground-zero-box-office-collection-day-2-emraan-hashmi-film-collects-rs-3-crorw-2715878-2025-04-27",
      "headline": "Ground Zero box office Day 2: Emraan Hashmi film picks pace, collects Rs 3 croreEmraan Hashmi's military drama 'Ground Zero' is witnessing growth at the box office despite facing competition from other Bollywood films. The film chronicles the story of BSF officer Narendra Nath Dhar Dubey's operation against terrorist mastermind Ghazi Baba."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-diplomat-ott-release-when-where-to-watch-john-abrahams-political-thriller-2715868-2025-04-27",
      "headline": "The Diplomat OTT release: When, where to watch John Abraham's political thriller'The Diplomat', starring John Abraham, is reportedly set to premiere on Netflix on May 9, 2025. The film delves into the intricacies of diplomacy and personal conflicts, inspired by the true story of Indian diplomat JP Singh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sinners-production-designer-hannah-bleacher-reveals-hidden-tribute-to-chadwick-boseman-2715827-2025-04-27",
      "headline": "Sinners production designer reveals hidden tribute to Chadwick BosemanIn a recent interview, 'Sinners' production designer Hannah Bleacher unveiled a subtle tribute to Chadwick Boseman embedded in the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-pahalgam-terror-attack-reaction-kesari-chapter-2-screening-2715836-2025-04-27",
      "headline": "Woh gussa fir se jaaga hai: Akshay Kumar on Pahalgam attack at Kesari 2 screeningAkshay Kumar attended a screening of Kesari Chapter 2 and addressed the audience about the Pahalgam terror attack, expressing anger. He said that the anger Indians had after Jallianwala Bagh incident has been rekindled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-biebers-grandfather-bruce-dale-dies-at-80-singer-wife-hailey-pay-tribute-2715804-2025-04-27",
      "headline": "Justin Bieber's grandfather dies at 80. Singer, wife Hailey pay tributePop icon Justin Bieber mourns the loss of his grandfather, Bruce Dale, who died at 80. The singer shared a loving tribute on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-chapter-2-box-office-collection-day-9-akshay-kumar-r-madhavan-2715785-2025-04-27",
      "headline": "Kesari Chapter 2 box office Day 9: Akshay Kumar film sees jump, earns Rs 57 croreKesari 2, starring Akshay Kumar, R Madhavan, and Ananya Panday, is maintaining a good momentum at the box office. The film has already crossed Rs 50 crore mark and also witnessed a jump in numbers on Day 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/khalid-rahman-ashraf-hamza-arrested-possession-of-hybrid-ganja-2715763-2025-04-27",
      "headline": "Directors Khalid Rahman, Ashraf Hamza arrested for possession of hybrid ganjaDirector Khalid Rahman, who directed the recently-released film 'Alapuzzha Gymkhana' and director Ashraf Hamza, along with one other, were arrested for the possession of hybrid ganja by the Excise department of Kochi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/madhuri-dixit-husband-sriram-nene-parents-not-happy-when-he-quit-job-as-doctor-moved-to-india-2715757-2025-04-27",
      "headline": "Madhuri Dixit's in-laws 'weren't happy' when husband Shriram Nene moved to IndiaMadhuri Dixit and her husband Dr Shriram Nene relocated to India after years in the USA, where Dr Nene had a successful medical career. Despite initial resistance from his parents, Dr Nene transitioned from being a heart surgeon to a medical-tech entrepreneur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/waqt-yash-chopra-sunil-dutt-sharmila-tagore-sadhana-shivdasani-shashi-kapoor-raaj-kapoor-2715641-2025-04-27",
      "headline": "Waqt: An absurd masterpiece of earthquakes, epiphanies and Raaj Kumar at his best'Waqt', the 1965 blockbuster directed by Yash Chopra, is a quintessential masala film that blends drama, music, and a star-studded cast. Known for its engaging narrative and memorable performances, it remains a beloved classic in Hindi cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karthik-subbaraj-on-why-romance-is-the-soul-of-retro-with-suriya-pooja-hegde-2715653-2025-04-26",
      "headline": "Karthik Subbaraj on why romance is the soul of Suriya's RetroDirector Karthik Subbaraj, known for films like 'Pizza' and 'Jigarthanda', is shifting focus to romance in his latest venture 'Retro'. Starring Suriya, the film delves into love's transformative power against a vintage gangster backdrop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/ar-rahman-ponniyin-selvan-2-makers-face-rs-2-crore-fine-in-copyright-case-2715630-2025-04-26",
      "headline": "AR Rahman, Ponniyin Selvan 2 makers face Rs 2 crore fine in copyright caseThe Delhi High Court has intervened in a copyright dispute involving composer A R Rahman and the film 'Ponniyin Selvan 2'. The court found Rahman's song identical to the Junior Dagar Brothers' Shiv Stuti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/content-creator-misha-agarwal-dies-two-days-before-25th-birthday-2715616-2025-04-26",
      "headline": "Content creator Misha Agarwal dies two days before 25th birthdayInfluencer Misha Agarwal has passed away just days before her 25th birthday, leaving her followers and family in shock. The cause of her death is yet to be revealed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashley-rebello-styling-raveena-tandon-yeh-raat-aur-yeh-doori-song-karisma-kapoor-spy-her-look-2715615-2025-04-26",
      "headline": "Karisma sent people to spy on Raveena's look: Andaz Apna Apna designer AshleyThe beloved cult classic 'Andaz Apna Apna' returns to cinemas, bringing back memories for costume designer Ashley Rebello, who reminisces about creating iconic looks for the film's stars. He recounted a behind-the-scene anecdote before the shoot of the song 'Yeh Raat Aur Yeh Doori'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dan-da-dan-season-2-new-trailer-okarun-vs-jiji-momo-turbo-granny-july-3-streaming-2715606-2025-04-26",
      "headline": "Dan Da Dan S2 trailer promises more full-throttle action, quirk. WatchThe new trailer for Dan Da Dan's second season delves into the intense battle between Okarun and the possessed Jiji, promising an action-packed continuation. With familiar faces returning to the creative team, the series is set to stream from July 3 on Netflix and Crunchyroll."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/emraan-hasmi-ground-zero-day-1-box-office-collection-rs-1-crore-slow-start-2715575-2025-04-26",
      "headline": "Ground Zero Day 1: Emraan Hashmi film starts slow at Rs 1 croreGround Zero, starring Emraan Hashmi, had a slow start at the box office with a collection of Rs 1 crore on its opening day. The film, produced by Excel Entertainment, chronicles the story of BSF officer Narendra Nath Dhar Dubey's operation against terrorist mastermind Ghazi Baba."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/martin-scorsese-glad-to-join-neeraj-ghaywans-homebound-as-executive-producer-2715571-2025-04-26",
      "headline": "Martin Scorsese 'glad' to join Neeraj Ghaywan's Homebound as executive producerFilmmaker Martin Scorsese has joined Neeraj Ghaywan's 'Homebound' as an executive producer. The film will premiere at the 2025 Cannes Film Festival in the Un Certain Regard section."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-members-jin-namjoon-enjoy-coldplay-concert-in-seoul-hint-at-bts-reunion-2715547-2025-04-26",
      "headline": "BTS members Jin, Namjoon enjoy Coldplay concert in Seoul, hint at BTS reunionBTS members Jin and Namjoon attended Coldplay's concert in Seoul on April 25, creating a buzz on social media. The duo hinted at a BTS reunion, delighting fans worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-flies-economy-class-fans-call-him-ever-humble-superstar-2715539-2025-04-26",
      "headline": "Rajinikanth flies economy class, fans call him 'ever-humble superstar'Actor Rajinikanth took fans by surprise when he boarded an IndiGo flight in economy class, sparking excitement among passengers. The superstar greeted fans warmly, leading to a viral moment captured on video."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-terrorists-trekked-22-hours-through-rough-terrain-say-sources-2715858-2025-04-27",
      "headline": "Terrorists trekked 22 hours through rough terrain for Pahalgam attack: SourcesTwo mobile phones - one belonging to a local resident and the other to a tourist - were snatched by the terrorists during the Pahalgam attack, sources said. Four attackers were involved in the carnage: three foreign terrorists and one local militant, Adil Thokar, sources added. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-pakistan-girl-girl-leaves-mother-behind-in-india-amid-expulsion-2715854-2025-04-27",
      "headline": "Heart-broken: Teary-eyed Pak girl leaves Indian mother behind amid expulsionZainab, 11, and Zenish, 8, arrived in India with their mother, who holds an Indian passport, to meet their grandmother in Delhi last month. Little did they know that within a month, the situation between the countries would hit an all-time low."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/car-rams-crowd-lapu-lapu-festival-canada-vancouver-people-killed-injured-driver-arrested-2715779-2025-04-27",
      "headline": "Terror attack or accident? Car rams crowd at Vancouver festival, several killedThe police are yet to confirm the number of casualties. Videos that have emerged on social media from the scene show several bodies strewn across the street. A black SUV, which reportedly drove into the crowd, was seen beside a blue truck with a crushed bonnet, next to the crime scene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-minister-hanif-abbasis-open-threat-to-india-as-tensions-flare-130-nukes-aimed-at-you-2715738-2025-04-27",
      "headline": "130 nukes aimed at you: Pak minister's open threat to India as tensions flareHanif Abbasi said if India dares to halt Pakistan's water supply by suspending the Indus Waters Treaty, it should \"prepare for a full-scale war\". He declared that Pakistan's nuclear weapons are not for display, and their locations are hidden across the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/indian-navy-showcases-combat-readiness-with-anti-ship-missile-firings-ytvd-2715784-2025-04-27",
      "headline": "Video: Indian Navy warships fire missiles, display 'combat-ready' strike powerThe Indian Navy has conducted multiple mission exercises involving anti-ship firings of various missile systems. The exercise included the firing of Brahmos, one of the deadliest long-range missiles, along with medium and short-range missile systems. This demonstration of naval firepower comes in the wake of the Pahalgam attack, sending a strong message about India's combat readiness to safeguard its interests anywhere, anytime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-baisaran-valley-jammu-and-kashmir-video-nia-probe-2715876-2025-04-27",
      "headline": "Tree-top video, Army officer's statement critical to Pahalgam terror probeThe NIA has launched a detailed probe into the Pahalgam terror attack, with a crucial video evidence from a local photographer and eyewitness testimony from an army officer to reconstruct how Pak-based terrorists brutally killed 26 people in the Baisaran Valley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-mumbai-indians-vs-lucknow-super-giants-updates-today-match-2715848-2025-04-27",
      "headline": "MI vs LSG, Live: Hardik joins Surya after Tilak fallsIPL 2025, Mumbai Indians (MI) vs Lucknow Super Giants (LSG): Tilak Varma's woes continued in the Indian Premier League, as the batter fell for just 6 runs against Ravi Bishnoi. Hardik Pandya has joined Suryakumar in the middle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-more-surgical-strikes-reclaim-pok-trinamool-congress-abhishek-banerjee-pm-modi-2715870-2025-04-27",
      "headline": "No more surgical strikes, reclaim POK: Trinamool's Abhishek Banerjee to PMTrinamool Congress leader and MP Abhishek Banerjee asserted that it is time to teach Pakistan a lesson and reclaim the portion of Kashmir occupied by the neighbouring country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/forget-ipl-contracts-ispl-gully-cricket-tennis-ball-revolution-earn-big-money-contract-sachin-tendulkar-jio-amitabh-bacchan-2715673-2025-04-27",
      "headline": "Forget IPL contracts, gully cricket can help earn big money and fameFame and money in cricket isn't just in IPL or internationals. Even without playing professional cricket, scores of Indians are emerging as stars due to gully cricket. The Indian Street Premier League (ISPL), with an IPL-like model, revolutionised tennis-ball cricket. Not just ISPL, scores of tournaments in several states are attracting prominent organisers and sponsors, and promising big money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-pok-flood-alert-after-pakistan-accuses-india-of-jhelum-water-release-report-2715754-2025-04-27",
      "headline": "POK flood alert after Pakistan accuses India of Jhelum water release: ReportThe allegations came after India decided to suspend the 1960 Indus Waters Treaty, in response to the deadly terror attack in Pahalgam carried out by Pakistan-based terrorists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/woman-stripped-naked-pooped-on-seat-in-chicago-philadelphia-flight-southwest-airlines-united-states-of-america-2715824-2025-04-27",
      "headline": "Chicago-bound flight turns messy as woman strips naked, defecates on seatA woman stripped naked and defecated on her seat during a Southwest Airlines flight from Philadelphia to Chicago, prompting an emergency response and thorough aircraft cleaning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kashmir-was-seeing-progress-but-terrorists-want-to-destroy-it-again-pm-on-pahalgam-attack-in-mann-ki-baat-2715786-2025-04-27",
      "headline": "Kashmir saw progress, but terrorists want to destroy it: PM on Pahalgam attackSpeaking during the 121st episode of his radio programme 'Mann Ki Baat', PM Modi said Kashmir had witnessed unprecedented growth in recent years, with booming tourism, vibrant schools and colleges and a surge in opportunities for the youth, but terrorists want to derail the region's progress. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/ego-scrolling-a-troubling-trend-on-dating-apps-2715822-2025-04-27",
      "headline": "Ego scrolling, a troubling trend on dating apps?Though it may seem harmless, indulging in ego-scrolling can negatively impact others, causing them to doubt themselves and contributing to dating app fatigue."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/in-pahalgam-attack-mani-shankar-aiyar-draws-link-to-partition-1971-war-2715778-2025-04-27",
      "headline": "In Pahalgam attack, Mani Shankar Aiyar draws link to Partition, 1971 warMani Shankar Aiyar reflected on how, despite efforts to prevent Partition, it was ultimately caused by \"differences in value systems and assessments of the nature of India's nationhood and its civilisational inheritance\" between leaders like Gandhi, Nehru, Jinnah, and others."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-shahid-rajaei-port-fire-explosion-missile-fuel-chemical-2715844-2025-04-27",
      "headline": "25 killed, 800 injured in Iran port blast tied to missile propellant shipmentA massive explosion at Iran's Shahid Rajaei port, linked to missile fuel chemicals, killed 25 and injured around 800, just as Iran and the US held nuclear talks in Oman. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/after-indus-treaty-freeze-bjp-mp-nishikant-dubey-calls-for-no-water-to-bangladesh-2715829-2025-04-27",
      "headline": "After Indus treaty freeze, BJP MP calls for no water to BangladeshNishikant Dubey also expressed concern over security along India's borders with both Pakistan and Bangladesh. He referred to reports of Lashkar-e-Taiba terrorists being in constant contact with Bangladesh's interim government.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-pope-francis-funeral-bule-suit-embarrassing-disrespectful-2715775-2025-04-27",
      "headline": "In sea of black, Trump's blue suit at Pope Francis's funeral raises eyebrowsThe other global leaders, including French President Emmanuel Macron of France, British Prime Minister Keir Starmer, President Javier Milei of Argentina and Italian Prime Minister Giorgia Meloni were all in black as they stood together in St Peter's Square to pay their final respects to Pope Francis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-478-25-04-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-pahalgam-terror-attack-reaction-kesari-chapter-2-screening-2715836-2025-04-27",
      "headline": "Woh gussa fir se jaaga hai: Akshay Kumar on Pahalgam attack at Kesari 2 screeningAkshay Kumar attended a screening of Kesari Chapter 2 and addressed the audience about the Pahalgam terror attack, expressing anger. He said that the anger Indians had after Jallianwala Bagh incident has been rekindled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-must-manage-jasprit-bumrah-workload-during-england-tests-ravi-shastri-2715821-2025-04-27",
      "headline": "India must manage Jasprit Bumrah's workload during England Tests: Ravi ShastriFormer India coach Ravi Shastri said the Indian team management must manage the workload of star pacer Jasprit Bumrah during the Test series in England.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/waqt-yash-chopra-sunil-dutt-sharmila-tagore-sadhana-shivdasani-shashi-kapoor-raaj-kapoor-2715641-2025-04-27",
      "headline": "Waqt: An absurd masterpiece of earthquakes, epiphanies and Raaj Kumar at his best'Waqt', the 1965 blockbuster directed by Yash Chopra, is a quintessential masala film that blends drama, music, and a star-studded cast. Known for its engaging narrative and memorable performances, it remains a beloved classic in Hindi cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lashkar-terrorists-house-blown-up-by-security-forces-eighth-such-action-after-pahalgam-attack-2715722-2025-04-27",
      "headline": "Two more terrorists' houses blown up as India steps up Pahalgam crackdown Live UpdatesThe house of another Lashkar-e-Taiba terrorist, Jameel Ahmed, was blown up by security forces in Jammu and Kashmir's Bandipora as India intensified its crackdown on the attackers in Pahalgam, where 26 people, mostly tourists, were killed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gunmen-shoot-at-43-year-old-man-near-his-home-in-jammu-and-kashmirs-kupwara-2715690-2025-04-27",
      "headline": "Social activist, 45, dies after gunmen shoot at him in J&K's KupwaraThe civilian, identified as Gh Rasool Magray killed after a gunman shot at him. The victim received bullet injuries to his abdomen and left wrist. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/japanese-man-hide-father-dead-body-wardrobe-high-funeral-cost-arrested-tokyo-2715777-2025-04-27",
      "headline": "Japan man hides father's body in closet for 2 years to dodge funeral fees, arrestedA Tokyo restaurant owner hid his father's body in a wardrobe for two years to avoid expensive funeral costs. Police arrested him and are investigating possible pension embezzlement.\r\n\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-lsg-rishabh-pant-trust-lucknow-eoin-morgan-2715892-2025-04-27",
      "headline": "LSG not trusting Rishabh Pant? Eoin Morgan urges captain to embrace big momentsIPL 2025, MI vs LSG: Former England captain said Rishabh Pant should embrace big moments instead of holding himself back. Pant batted at No. 7 in their limp loss to Delhi Capitals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mayank-yadav-injury-return-mi-vs-lsg-2715867-2025-04-27",
      "headline": "Mayank Yadav returns from injury layoff, returns for clash vs MITearaway fast bowler Mayank Yadav made his return to professional cricket in Lucknow Super Giants match vs Mumbai Indians. Mayank has been out of action since India's T20I match vs Bangladesh in October 2024."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/indian-womens-cricket-team-sport-black-armbands-for-pahalgam-terror-attack-victims-2715861-2025-04-27",
      "headline": "Indian women's team sport black armbands to pay homage to Pahalgam attack victimsThe Indian women's cricket team was seen wearing black armbands during the opening match of the tri-nation series against Sri Lanka to pay homage to the victims of the Pahalgam terror attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-mumbai-indians-vs-lucknow-super-giants-updates-today-match-2715848-2025-04-27",
      "headline": "MI vs LSG, Live: Suryakumar, Tilak navigate middle oversIPL 2025, Mumbai Indians (MI) vs Lucknow Super Giants (LSG): Suryakumar Yadav and Tilak Varma are navigating the middle overs after the dismissals of Ryan Rickelton and Will Jacks. Mumbai are scoring at a good clip and are certainly targetting a 220+ total."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-anil-kumble-suggests-changing-venkatesh-iyers-batting-position-2715837-2025-04-27",
      "headline": "Kumble suggests changing Venkatesh Iyer's batting position to bring change in formLegendary India cricketer Anil Kumble has suggested changing Venkatesh Iyer's batting position to bring a change in his form in the ongoing Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-real-madrid-el-clasico-antonio-rudiger-referee-fight-video-2715831-2025-04-27",
      "headline": "Watch: Antonio Rudiger attacks referee, gets red card in Copa finalReal Madrid defender Antonio Rudiger saw a late red card in the Copa del Rey final clash vs Barcelona. In the match, Rudiger attacked the match referee, and chucked a bag of ice pack towards him.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-must-manage-jasprit-bumrah-workload-during-england-tests-ravi-shastri-2715821-2025-04-27",
      "headline": "India must manage Jasprit Bumrah's workload during England Tests: Ravi ShastriFormer India coach Ravi Shastri said the Indian team management must manage the workload of star pacer Jasprit Bumrah during the Test series in England.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/china-are-serious-about-winning-gold-in-cricket-at-la-2028-olympics-steve-waugh-2715820-2025-04-27",
      "headline": "China are serious about winning gold in cricket at LA 2028 Olympics: Steve WaughLegendary Australia cricketer Steve Waugh revealed that China is serious about winning gold in cricket at the Los Angeles 2028 Olympic Games. Cricket will mark its return at the Games after a whopping 128 years.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-prediction-today-match-dc-vs-rcb-team-news-delhi-conditions-2715795-2025-04-27",
      "headline": "RCB eye top-spot and revenge vs DC at Virat Kohli's homeground in DelhiRoyal Challengers Bengaluru (RCB) will be up for revenge against Delhi Capitals (DC) in Match 46 of the Indian Premier League 2025 (IPL 2025) at Arun Jaitley Stadium in Delhi. Both teams have a chance to claim the top spot with a win in the fixture. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-nicholas-pooran-rishabh-pant-accident-lsg-vs-mi-2715794-2025-04-27",
      "headline": "Pooran on relationship with Pant: We connect through shared traumaLucknow Super Giants' Nicholas Pooran has talked about his shared trauma with Rishabh Pant. Just like Pant, Pooran also had faced career-threatening injuries after a road accident.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-must-manage-jasprit-bumrah-workload-during-england-tests-ravi-shastri-2715821-2025-04-27",
      "headline": "India must manage Jasprit Bumrah's workload during England Tests: Ravi ShastriFormer India coach Ravi Shastri said the Indian team management must manage the workload of star pacer Jasprit Bumrah during the Test series in England.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/china-are-serious-about-winning-gold-in-cricket-at-la-2028-olympics-steve-waugh-2715820-2025-04-27",
      "headline": "China are serious about winning gold in cricket at LA 2028 Olympics: Steve WaughLegendary Australia cricketer Steve Waugh revealed that China is serious about winning gold in cricket at the Los Angeles 2028 Olympic Games. Cricket will mark its return at the Games after a whopping 128 years.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-prediction-today-match-dc-vs-rcb-team-news-delhi-conditions-2715795-2025-04-27",
      "headline": "RCB eye top-spot and revenge vs DC at Virat Kohli's homeground in DelhiRoyal Challengers Bengaluru (RCB) will be up for revenge against Delhi Capitals (DC) in Match 46 of the Indian Premier League 2025 (IPL 2025) at Arun Jaitley Stadium in Delhi. Both teams have a chance to claim the top spot with a win in the fixture. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-nicholas-pooran-rishabh-pant-accident-lsg-vs-mi-2715794-2025-04-27",
      "headline": "Pooran on relationship with Pant: We connect through shared traumaLucknow Super Giants' Nicholas Pooran has talked about his shared trauma with Rishabh Pant. Just like Pant, Pooran also had faced career-threatening injuries after a road accident.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}