{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/citigroup-employees-typo-nearly-led-to-81-trillion-blunder-details-here-2687054-2025-02-28",
      "headline": "Citigroup employee's typo nearly led to $81 trillion blunder. Details hereThe payment was initially overlooked by two employees before a third employee caught it. Citi later reported the incident as a 'near miss' to the Federal Reserve and the Office of the Comptroller of the Currency (OCC)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dont-miss-these-money-deadlines-in-march-2025-special-fds-itr-and-more-2687028-2025-02-28",
      "headline": "Don't miss these money deadlines in March 2025: Special FDs, ITR, and more In case you have missed reporting income or made an error in your ITR, you can still fix it. The final deadline for filing an  updated return (ITR-U) is March 31, 2025.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-ends-1400-points-lower-global-trade-war-fears-rs-9-lakh-crore-gone-2687039-2025-02-28",
      "headline": "Sensex falls 1,400 points as trade war fears rattle D-Street, Rs 9 lakh crore goneStock market crash: During today's trading session, information technology stocks got hammered, with Nifty IT crashing 6.5% after Nvidia's stock tanked overnight in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gdp-grows-q3-2024-25-up-from-q2-figures-2687031-2025-02-28",
      "headline": "GDP grows at 6.2% in Q3 2024-25, up from 5.6% in Q2For the financial year 2023-24, India recorded a real GDP growth rate of 9.2%, marking the highest annual growth in the past 12 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-news-nifty-on-track-for-longest-losing-streak-in-29-years-rs-85-lakh-crore-wiped-out-2687016-2025-02-28",
      "headline": "Nifty posts longest monthly losing streak in 29 years, over Rs 90 lakh crore goneForeign outflows, weak earnings and global uncertainty have wiped out over Rs 90 lakh crore in investor wealth from  since September 2024, when Nifty hit an all-time high of 26,277.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/technicolor-india-shuts-down-over-3000-employees-affected-2687013-2025-02-28",
      "headline": "Technicolor India shuts down, over 3,000 employees affected The company currently employs 3,200 people across India, with nearly 3,000 in Bengaluru alone. The sudden move has left several employees in shock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupay-debit-select-card-check-new-features-benefits-effective-from-april-1-2686969-2025-02-28",
      "headline": "RuPay Debit Select Card: Check new features effective from April 1, 2025RuPay Debit Select Cardholders can enjoy one complimentary domestic airport lounge visit each quarter and two international lounge visits a year at participating lounges (conditions apply)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-bank-report-economic-memorandum-india-needs-tariff-cuts-reforms-to-boost-investments-2686940-2025-02-28",
      "headline": "India needs tariff cuts, reforms to boost investments: World Bank The World Bank report titled 'Economic Memorandum India' also highlights that for India to become a high-income country by 2047, its per capita income must grow nearly eight times current levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/whats-your-best-asset-in-20s-not-stocks-or-trading-says-radhika-gupta-edelweiss-mutual-fund-ceo-2686933-2025-02-28",
      "headline": "What's your best asset in 20s? Not stocks or trading, says Radhika GuptaRadhika Gupta cautioned that young professionals might be focusing on passive income too early. She believes that the best investment in your 20s is not stocks or trading but your talent and time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/smallcap-midcap-indices-set-for-worst-month-in-5-years-more-correction-ahead-2686926-2025-02-28",
      "headline": "Smallcap, midcap indices set for worst month in 5 years. More pain ahead?In 2025 so far, mid-cap stocks have fallen 16%, while small-cap stocks have slumped 21%. In comparison, the benchmark Nifty 50 is down 6.7%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/npci-introduces-transfer-out-feature-upi-lite-all-details-here-2686897-2025-02-28",
      "headline": "NPCI introduces UPI Lite's 'Transfer Out' feature. All details hereAll issuer banks and UPI Apps must implement the required changes by March 31, 2025, as mentioned in NPCI's circular dated February 21, 2025"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-825-per-cent-interest-rate-employees-provident-fund-deposits-for-2024-25-financial-year-2686898-2025-02-28",
      "headline": "EPFO retains 8.25% interest rate on provident fund deposits for 2024-25In February 2024, the Employees' Provident Fund Organisation (EPFO) had increased the interest rate on EPF marginally to 8.25 per cent for 2023-24, from 8.15 per cent in 2022-23."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/palash-sen-diljit-dosanjh-concert-culture-remark-euphoria-20-remixes-2687019-2025-02-28",
      "headline": "Singer Palash Sen on Diljit's concert culture remark, Euphoria 2.0 and remixesEuphoria's lead vocalist Palash Sen opened up about Diljit Dosanjh's controversial concert culture remark, the rebranding of the band and more in an exclusive interaction with India Today Digital. Sen recently collaborated with Bollywood star Akshay Kumar on the song, Mahakal Chalo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lisa-blackpink-album-alter-ego-review-confident-versatile-powerful-2686930-2025-02-28",
      "headline": "Alter Ego review: Blackpink's Lisa's album is versatile and powerfulLisa of Blackpink releases her solo album Alter Ego. With a total of 15 songs and several collaborations, the album has a lot to take away from, but Lisa shines the brightest in her solo elements. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ek-badnaam-aashram-3-part-2-review-bobby-deol-aaditi-pohankar-prakash-jha-chandan-roy-sanyal-2686921-2025-02-28",
      "headline": "Ek Badnaam Aashram 3 part 2 review: Baba Nirala's journey meets a dramatic endReleased-Thu Feb 27, 2025Prakash Jha's most anticipated series, Aashram Season 3 Part 2, is currently streaming on MX Player. The series focusses on Baba Nirala's fate and how his entire kingdom crashes down because of Pammi's quest for revenge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dabba-cartel-review-shabana-azmi-and-gang-will-make-your-jaws-drop-with-boredom-2686950-2025-02-28",
      "headline": "Dabba Cartel review: Shabana Azmi is a silent lioness in a challenging storyReleased-Fri Feb 28, 2025'Dabba Cartel' is supposed to be a powerful story of five women who team up to run a cartel in Mumbai. But, the Netflix series ends up becoming a mushy pie. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/g-dragon-ubermensch-album-is-out-a-long-overdue-masterpiece-2686904-2025-02-28",
      "headline": "G-Dragon's Übermensch album is out: A long-overdue masterpieceK-pop King G-Dragon is back with a new album after over a decade. Titled Übermensch, the album is a long-overdue masterpiece the fans deserved. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/japanese-woman-summoned-for-kissing-bts-jin-without-consent-2686884-2025-02-28",
      "headline": "Japanese woman summoned for kissing BTS' Jin without consentA Japanese woman has been summoned by the South Korean police after she kissed BTS member Jin without his consent during a fan event held last summer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suzhal-the-vortex-2-review-pushkar-gayathri-crime-drama-is-trapped-in-the-vortex-of-cliches-aishwarya-rajesh-kathir-2686874-2025-02-28",
      "headline": "Suzhal The Vortex 2 review: This crime-drama is trapped in the vortex of clichesReleased-Fri Feb 28, 2025Suzhal - The Vortex 2 review: Created by Pushkar and Gayatri, Suzhal - The Vortex 2 is a crime drama that suffers from overstuffed ideas. The show has interesting ideas, but it gets lost in the overstretched screenplay.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/meghan-markle-discusses-food-music-and-korea-in-new-glimpse-of-with-love-meghan-2686840-2025-02-28",
      "headline": "Meghan Markle discusses food, music and Korea in new glimpse of 'With Love, Meghan'Meghan Markle and chef Roy Choi bond over food and the culture of South Korea as they discuss Karoake bars and music in the new promo for her Netflix show, 'With Love, Meghan'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/composer-pritam-thanks-mumbai-police-for-arresting-studio-theft-culprit-2686604-2025-02-27",
      "headline": "Composer Pritam thanks Mumbai Police for arresting studio theft culpritMusic composer Pritam expressed gratitude towards the Mumbai Police for capturing the suspect involved in a Rs 40 lakh theft from his studio. He praised their efforts in a heartfelt Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-boys-5-supernatural-actors-jensen-ackles-jared-padalecki-misha-collins-to-reunite-2686488-2025-02-27",
      "headline": "The Boys 5: Supernatural actors Jensen Ackles, Jared Padalecki to reuniteThe Boys Season 5 will be an exciting reunion as Soldier Boy Jensen Ackles will be joined by his Supernatural co-stars Jared Padalecki and Misha Collins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-review-sass-swag-and-secrets-in-a-soggy-spin-off-2686399-2025-02-27",
      "headline": "Suits LA review: Sass, swag and secrets in a soggy spin-offReleased-Mon Feb 24, 2025'Suits LA' has the flavour of the original 'Suits', but Teddy Black is no Harvey Spector, and you will be reminded of it, despite all the pizazz in the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/oscar-nominated-savan-kotecha-to-find-indias-first-global-boy-band-2686383-2025-02-27",
      "headline": "Oscar-nominated Savan Kotecha to find India's first global boy bandSavan Kotecha is launching a nationwide hunt for India's first global boy band. Partnering with Universal Music, he aims to build a teen pop economy and create Indian stars for the world stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/undercover-high-school-review-korean-main-hoon-na-with-more-thrills-2686314-2025-02-27",
      "headline": "Undercover High School review: Korean 'Main Hoon Na' with more thrillsReleased-Fri Feb 21, 2025Undercover High School review: It is a thrilling Korean series blending action and comedy, reminiscent of 'Main Hoon Na', where a disgraced spy navigates high school challenges while on a mission to find missing gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/o-saathi-re-new-netflix-show-imtiaz-ali-aditi-rao-hydari-avinash-tiwary-arjun-rampal-2686276-2025-02-27",
      "headline": "O Saathi Re: Imtiaz Ali's Netflix series is a modern story with a vintage heartNetflix has released the first look of its new series O Saathi Re, starring Avinash Tiwary, Aditi Rao Hydari, and Arjun Rampal. The series, directed by Arif Ali, will be an 'ode to vintage love in modern times'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-hilarious-dance-mere-husband-mujhko-piyar-nahi-karte-at-sangeet-watch-2686265-2025-02-27",
      "headline": "Prajakta Koli hilariously dances to 'Mere Husband Mujhko Piyar…' at sangeet. WatchPrajakta Koli danced to Mere Husband Mujhko Piyar Nahin Karte at her sangeet, leaving guests in splits. She married Vrishank Khanal in Karjat on February 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kj-yesudas-hospitalised-chennai-old-age-2686238-2025-02-27",
      "headline": "Vijay Yesudas reacts to fake news about father Yesudas's hospitalisationReports were rife that playback singer Yesudas was hospitalised in Chennai due to age-related illness. His son and playback singer Vijay Yesudas exclusively spoke to India Today and shut down the rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sex-education-actor-alexander-westwood-jailed-for-15-years-for-multiple-sex-offenses-2685969-2025-02-26",
      "headline": "Sex Education actor Alexander Westwood jailed for 15 years for sex offencesSex Education actor Alexander Westwood received a 15-year prison sentence for multiple sex offenses. The case has captured widespread media attention due to Westwood's role in the popular Netflix show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aashram-3-part-1-ending-explained-pammi-aaditi-pohankar-revenge-baba-nirala-bobby-deol-prakash-jha-2685961-2025-02-26",
      "headline": "Aashram 3 Part 1 ending explained: Will Pammi's revenge end Baba Nirala's reign?With Aashram Season 3 Part 2 releasing on February 27, let us take a look at how the season ended on a cliffhanger with Baba Nirala's misuse of power and a change in dynamics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-jasleen-royal-criticism-coldplay-opening-one-bad-act-wont-damage-reputation-of-indian-2685917-2025-02-26",
      "headline": "Amit Trivedi says Jasleen Royal's opening act for Coldplay was 'unfortunate'Amit Trivedi, in an interview with India Today Digital, discussed the controversy over Jasleen Royal's opening act for Coldplay's India tour and whether it would impact on the image of Indian artists."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-kanye-west-trying-to-save-marriage-with-bianca-censori-report-2685911-2025-02-26",
      "headline": "Rapper Kanye West trying to save marriage with Bianca Censori: ReportKanye West is reportedly trying to prevent his marriage with Bianca Censori from ending. An insider reveals that Bianca is considering divorce, and Kanye is panicking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/euphoria-palash-sen-akshay-kumar-bollywood-mahakal-chalo-mahashivratri-2685899-2025-02-26",
      "headline": "Singer Palash Sen on working with Akshay Kumar, not being 'accepted' by BollywoodEuphoria's lead vocalist Palash Sen spoke to India Today Digital about collaborating with Bollywood star Akshay Kumar on the song Mahakal Chalo, work opportunities in the Hindi film industry, and more in an exclusive interaction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aman-verma-vandana-lalwani-separate-9-years-of-marriage-2685910-2025-02-26",
      "headline": "Actors Aman Verma and Vandana Lalwani to separate after 9 years of marriageActors Aman Verma and Vandana Lalvani are separating after nine-years of marriage. Amid growing speculation, Aman has addressed the rumours about their relationship. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/baalveer-actor-dev-joshi-marries-girlfriend-aarti-first-pics-out-2685838-2025-02-26",
      "headline": "Baalveer actor Dev Joshi marries girlfriend Aarti, first pics outBaalveer actor Dev Joshi married his girlfriend Aarti in a beautiful ceremony. The wedding festivities, including haldi and mehndi, were spectacular and captured in stunning photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/be-happy-abhishek-bachchan-inayat-verma-prime-video-series-release-date-2685817-2025-02-26",
      "headline": "Be Happy: Abhishek Bachchan, Inayat Verma series to stream in MarchThe streaming date of Abhishek Bachchan and Inayat Verma-starrer Be Happy is out. It promises to be a touching film about a single father's journey to support his daughter's dream of performing on a dance reality show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/a-man-on-the-inside-review-ted-danson-netflix-charming-comedy-2685801-2025-02-26",
      "headline": "A Man on the Inside: Ted Danson's charming comedy deserves more loveA Man on the Inside is a warm and witty series which tackles multiple subjects, including loss, new beginnings and, well, crime. The Ted Danson-starrer is currently streaming on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshal-chikni-chameli-embarrassed-when-5-year-old-girls-sing-it-2685777-2025-02-26",
      "headline": "Shreya Ghoshal on Chikni Chameli: Embarrassed when 5-year-old girls sing itShreya Ghoshal says she feels embarrassed when young girls sing Chikni Chameli, stressing that lyrics should be written more thoughtfully, as music and films have a deep impact on society."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-updates-fans-about-cancer-treatment-my-chemo-and-surgery-are-over-2685753-2025-02-26",
      "headline": "Hina Khan updates fans about cancer treatment: My chemo and surgery are overHina Khan recently gave an update about her cancer treatment. The actor mentioned that her chemotherapy and surgery are over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tanmay-bhat-jokes-about-ranveer-allahbadia-ignoring-his-texts-2685715-2025-02-26",
      "headline": "Tanmay Bhat jokes about Ranveer Allahbadia ignoring his textsTanmay Bhat hilariously addressed the India's Got Latent controversy, joking about Ranveer Allahbadia ignoring his texts. The reaction video left fellow comedians laughing and also \"triggered\" them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/singer-udit-narayan-visits-maha-kumbh-mela-with-wife-expresses-gratitude-2685597-2025-02-25",
      "headline": "Singer Udit Narayan visits Maha Kumbh Mela with wife, expresses gratitude Singer Udit Narayan was among the latest celebrities to visit the holy city of Prayagraj for Maha Kumbh 2025. In an interview with ANI, he expressed his gratitude and congratulated Chief Minister Yogi Adityanath for the well-organised and efficient arrangements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/my-dearest-nemesis-review-moon-ga-young-choi-hyun-wook-2685507-2025-02-25",
      "headline": "My Dearest Nemesis review: Chaotic chemistry makes even familiar trope workMy Dearest Nemesis features K-drama stars Moon Ga young and Choi Hyun-wook in the lead. It is available to stream on Viki. Here's our take on the romantic drama. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/internet-calls-farah-khan-insensitive-for-mocking-gaurav-khannas-colour-blindness-celebrity-masterchef-2685266-2025-02-25",
      "headline": "Internet calls Farah Khan 'insensitive' for mocking Gaurav Khanna's colour blindnessCelebrity MasterChef judge Farah Khan mocked TV actor Gaurav Khanna's colour blindness on the show. Following the same, the internet is outraged by her comments, criticising the filmmaker and calling her 'insensitive'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/parineeti-chopra-gears-up-for-her-first-netflix-yet-to-be-titled-thriller-series-2685151-2025-02-25",
      "headline": "Parineeti Chopra gears up for her first Netflix yet-to-be-titled thriller seriesActor Parineeti Chopra is set to make her series OTT debut with a Netflix project. The actor shared a post and informed about sharing screen space with Nimrit Kaur, Soni Razdan, and others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tanmay-bhat-x-account-hacked-comedian-warns-followers-2685118-2025-02-25",
      "headline": "Tanmay Bhat's X account hacked, comedian warns followersTanmay Bhat's X account recently got hacked, leading to fraudulent messages being posted online. The comedian shared a post on his Instagram and warned his followers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-vrishank-khanal-haldi-pics-pre-wedding-festivties-wedding-karjat-2685070-2025-02-25",
      "headline": "Prajakta Koli-Vrishank Khanal can't take their eyes off each other in haldi picsActor Prajakta Koli is set to marry longtime boyfriend Vrishank Khanan on February 25. Ahead of the grand day, the actor shared pictures from her haldi function. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/anupam-mittal-on-india-got-latent-backlash-not-lost-episode-of-satyamev-jayate-2685071-2025-02-25",
      "headline": "Anupam Mittal on India's Got Latent backlash: Not a lost episode of Satyamev JayateAnupam Mittal weighs in on the India's Got Latent row, arguing that YouTube should also be held accountable. He calls Big Tech the real culprit, criticising digital platforms for fueling outrage-driven content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bobby-deol-says-aashram-helped-him-break-industry-image-explore-new-roles-2685062-2025-02-25",
      "headline": "Bobby Deol says Aashram helped him break industry image, explore new rolesActor Bobby Deol is all set to return as Baba Nirala in Prakash Jha's series, Aashram 3 part 2. The actor confessed that he wanted to step out of his comfort zone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-waking-of-a-nation-trailer-taaruk-raina-fights-to-prove-jallianwala-act-was-planned-2684901-2025-02-24",
      "headline": "Waking of Nation trailer: Taaruk Raina fights to prove Jallianwala Bagh was plannedA new show that explores the events surrounding the Jallianwala Bagh massacre is set to premiere on Sony LIV on March 8. Starring Taaruk Raina in the lead role, the series is titled The Waking of a Nation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-responds-to-rumours-of-drug-use-2684862-2025-02-24",
      "headline": "Singer Justin Bieber responds to rumours of drug useJustin Bieber's representative has reacted to the reports of the singer's drug use and called them false. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/ranveer-allahbadia-runs-to-car-after-recording-statement-in-latent-probe-2684803-2025-02-24",
      "headline": "Ranveer Allahbadia runs to car after recording statement in Latent probeRanveer Allahbadia was clicked in a hurried state, running towards his car as the paparazzi tried to capture his pictures on Monday. The YouTuber visited the Maharashtra Cyber office in Mahape after recording his statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kaushaljis-vs-kaushal-review-a-simple-yet-complex-tale-of-second-chance-in-love-2684706-2025-02-24",
      "headline": "Kaushaljis vs Kaushal review: A simple yet complex tale of second chance in loveReleased-Fri Feb 21, 2025Kaushaljis vs Kaushal movie review: This film is a heartfelt exploration of second chances in love, focusing on a middle-aged couple navigating the complexities of separation and familial expectations. Set in the relatable backdrop of Kannauj, the film captivates with its simplicity and stellar performances."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/avalanche-uttarakhands-badrinath-chamoli-workers-feared-trapped-rescue-operations-snowfall-weather-2686942-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "32 rescued after avalanche hits Badrinath, over 25 still trappedRescue teams are racing against time in Uttarakhand's Badrinath after an avalanche buried an Army camp near Mana, trapping 57 workers. Harsh weather has complicated evacuation efforts, with 32 men pulled out so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gdp-grows-q3-2024-25-up-from-q2-figures-2687031-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "GDP grows at 6.2% in Q3 2024-25, up from 5.6% in Q2For the financial year 2023-24, India recorded a real GDP growth rate of 9.2%, marking the highest annual growth in the past 12 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/omar-abdullah-kashmir-security-situation-normalcy-forced-organic-article-370-2686958-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Normalcy in Kashmir forced, not organic: Omar Abdullah jabs CentreOmar Abdullah said the security situation in Kashmir was far from 'normal' as indicated by the closure of Jamia Masjid in Srinagar on Shab-e-Baraat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-ends-1400-points-lower-global-trade-war-fears-rs-9-lakh-crore-gone-2687039-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex falls 1,400 points as trade war fears rattle D-Street, Rs 9 lakh crore goneStock market crash: During today's trading session, information technology stocks got hammered, with Nifty IT crashing 6.5% after Nvidia's stock tanked overnight in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/russian-chess-grandmaster-ussr-boris-spassky-1972-world-chess-championship-cold-war-usa-bobby-fischer-pawn-sacrifice-2686932-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Match of the Century: When the Cold War was fought on 64 squaresThe 1972 showdown between Russian chess grandmaster Boris Spassky and American grandmaster Bobby Fischer, which was dubbed the 'Match of the Century', and was played at the peak of the Cold War. Spassky, who fought the Cold War for the Soviets against the American Fischer on the 64-square board, died on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-vs-australia-live-score-lahore-weather-rashid-smith-2686931-2025-02-28#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "AFG vs AUS Live: Australia eye strong start to 274-run chaseChampions Trophy, Afghanistan (AFG) vs Australia (AUS) Updates: Australia have begun on a high with Travis Head and Matt Short looking to put Afghanistan bowlers under pressure. The world champions will be looking to get off to a good start in their chase of 274. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/agra-it-firm-manager-dies-by-suicide-accuses-wife-of-harassment-in-video-2686854-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Agra man dies by suicide, accuses wife of affair in video: Don't touch my parentsThe victim's father has filed a complaint against his daughter-in-law. No arrests have been made yet. The incident has drawn comparisons to the recent suicide case of Atul Subhash in Bengaluru."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/news/story/english-hindi-compulsory-subjects-in-cbse-class-10-board-exam-draft-raises-questions-2687079-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "English, Hindi compulsory subjects in CBSE Class 10 exam? Draft raises questionsThe recently released CBSE draft policy for holding two Class 10 board exams a year raises questions on the language papers. Is the board considering both English and Hindi as compulsory language papers for Class 10 students across India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kiara-advani-sidharth-malhotra-expecting-first-child-2686946-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actors Kiara Advani, Sidharth Malhotra announce pregnancy: Greatest gift of our livesActors and celebrity couple, Kiara Advani and Sidharth Malhotra, are expecting their first child. The happy news was shared by Advani on her social media handle on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-gold-card-work-for-indians-us-visa-eb-5-how-foreign-investment-ivy-league-college-students-2686375-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will Trump's Gold Card Visa get Indians hired by US companies?US President Donald Trump announced the Gold Card visa, which will provide permanent residency and fast-track citizenship, for $5 million. Trump also said that American companies could use the scheme to hire foreign students and talent, including Indians. Will that make business sense for American companies and benefit Indians?  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-records-warmest-february-average-temperature-above-22-degrees-celsius-2687084-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Warmest February in India since 1901, average temperature above 22 degrees CelsiusFor the first time, the average minimum temperature across the country was recorded at over 15 degrees Celsius, which is the warmest recorded ever."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fahad-ahmed-swara-bhaskar-husband-appointed-as-ncp-youth-wing-chief-sharad-pawar-2687062-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fahad Ahmad, husband of Swara Bhaskar, appointed as NCP (SP) youth wing chiefFahad Ahmad, leader of NCP (Sharadchandra Pawar) and husband of actor Swara Bhaskar, has been appointed national president of the party's youth wing, months after his Maharashtra Assembly election defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/bridging-borders-with-fashion-courtesy-hania-aamir-and-tara-sutaria-2686957-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bridging borders with fashion, courtesy Hania Aamir and Tara SutariaThis time, yet again, fashion has managed to bridge borders, and at the forefront of it this time are none other than Hania Aamir and Tara Sutaria."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bombing-mosque-northwest-pakistan-ahead-of-ramadan-deaths-injured-2687011-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "5 killed, dozens wounded in bombing at mosque in northwest Pakistan The blast took place at a mosque in Akkora Khattak district of northwestern Pakistan's Khyber Pakhtunkhwa province."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-5-things-investors-should-know-as-sensex-plunges-1000-points-2686837-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stock market crash: 5 things investors should know as Sensex plunges 1,400 pointsStock market crash: Retail investors, already grappling with losses, are left wondering whether this correction will continue or if a recovery is on the horizon. Here are 5 things investors need to know"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pune-rape-accused-dattatray-ramdas-gade-how-police-caught-manhunt-villagers-dog-squads-drones-2686883-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "500 cops, dog squads, drones: How Pune rape accused was caughtPune rape accused Dattatray Ramdas Gade was caught following a three-day manhunt after a man at whose house the former went to seek water tipped him off to the police. He was hiding at a farm in Shirur at the time of arrest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/three-years-on-what-the-world-can-learn-from-india-uae-trade-agreement-2686974-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Three years on: What the world can learn from India-UAE trade agreementIndia is the UAE's second-largest trading partner, with exports of over $48 billion in FY2023-24."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/himachal-pradesh-government-seeking-temple-funds-welfare-schemes-bjp-sukhvinder-sukhu-2687042-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP claims Himachal seeking funds from temple trusts, Chief Minister reactsChief Minister Sukhvinder Singh Sukhu, countering the BJP, said the contribution was voluntary, and it was for building facilities for orphans under the Sukh Ashray scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-reinstates-service-women-judges-madhya-pradesh-2686993-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Supreme Court reinstates 2 women judges: Termination was stigmatic in natureNoting that one of the judges had to be hospitalised due to Covid-19 and then suffered a miscarriage, the Supreme Court said the High Court should have been more sensitive to the situation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dabba-cartel-review-shabana-azmi-and-gang-will-make-your-jaws-drop-with-boredom-2686950-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dabba Cartel review: Shabana Azmi is a silent lioness in a challenging storyReleased-Fri Feb 28, 2025'Dabba Cartel' is supposed to be a powerful story of five women who team up to run a cartel in Mumbai. But, the Netflix series ends up becoming a mushy pie. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/preity-zinta-on-joining-politics-parties-offered-me-tickets-but-i-declined-2686776-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Preity Zinta responds to question on filing defamation case against Rahul GandhiActor Preity Zinta recently conducted an AskMe session on X where she responded to some of the questions posed by her fans. During the chat, she replied to a fan who asked her about filing a defamation case against Rahul Gandhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-expresses-disinclination-to-quash-proceedings-initiated-at-prithvi-shaws-behest-2686747-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Prithvi Shaw's allegations have substance: Court on influencer's plea in car attack caseThe Bombay High Court observed that the allegations by cricketer Prithvi Shaw against influencer Sapna Gill have substance, while hearing her petition to cancel the FIR over attacking the cricketer's car for denying selfies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-gwalior-rape-5-year-old-police-case-juvenile-accused-arrest-injuries-2686741-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "28 stitches in private parts: Girl, 5, battles for life after rape in GwaliorThe 5-year-old girl was hospitalised with extensive wounds, and her private parts sustained severe damage. She underwent major surgery, which required 28 stitches to her genital area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gene-hackman-wife-betsy-arakawa-death-mystery-911-audio-police-statement-mummification-pills-2686798-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gene Hackman-wife's death mystery: 911 audio, police statement, all that happened The 911 call details of Gene Hackman and his wife Betsy Arakawa's death have been released. Police in their statement revealed that the manner and cause of death have not been determined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-bhatia-breaks-silence-on-cryptocurrency-fraud-calls-rumours-misleading-2687103-2025-02-28",
      "headline": "Tamannaah Bhatia breaks silence on cryptocurrency fraud, calls rumours misleadingBollywood actor Tamannaah Bhatia has strongly denied any involvement in a Rs 2.4 crore cryptocurrency scam. She is set to take appropriate legal action against these false claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/aghathiyaa-review-interesting-concepts-in-jiiva-and-arjun-sarjas-film-bogged-down-by-melodrama-2687099-2025-02-28",
      "headline": "Aghathiyaa review: Interesting concepts in Jiiva's film bogged down by melodramaReleased-Fri Feb 28, 2025Aghathiyaa film review: Directed by Pa. Vijay, the supernatural mystery film starring Jiiva, Arjun Sarja and Raashi Khanna fails with its execution. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/madhu-chopra-recalls-priyanka-chopra-struggles-on-dostana-set-director-tarun-manshukhani-scary-2687058-2025-02-28",
      "headline": "Madhu Chopra recalls Priyanka's struggles on Dostana set, says director was 'scary'Priyanka Chopra's mother Madhu recalled the challenges faced by her daughter on Dostana sets. The 2017 movie was directed by Tarun Manshukhani and produced by Karan Johar. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-was-held-at-gunpoint-in-us-after-911-attack-2687057-2025-02-28",
      "headline": "Suniel Shetty was held at gunpoint in US after 9/11: They said, down or we shootSuniel Shetty recalls being held at gunpoint in the US after 9/11 while shooting Kaante. Suspected due to his beard, he was handcuffed until his team clarified he was an actor. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-south-africa-vs-england-press-conference-rob-walter-2687129-2025-02-28",
      "headline": "SA vs ENG: Heinrich Klaasen fit for match vs England, says coach Rob WalterSouth Africa head coach Rob Walter has said that wicketkeeper batter Heinrich Klaasen will return to the side for their group-stage match against England. Klaasen missed the first match against Afghanistan due to an elbow injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-south-africa-vs-england-pre-match-press-conference-2687114-2025-02-28",
      "headline": "Worrying about India's advantages not our job: South Africa coach Rob WalterSouth Africa coach Rob Walter refused to entertain questions about India's alleged advantage in the Champions Trophy 2025. Walter, speaking ahead of their match against England, said that he did not want to spend energy thinking about the Indian team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ranji-trophy-final-vidarbha-kerala-sachin-baby-2687094-2025-02-28",
      "headline": "Vidarbha take crucial lead vs Kerala despite Sachin Baby's 98 Ranji Trophy 2024-25: Sachin Baby scored 98 runs, but Kerala conceded a lead of 37 runs at the end of the first innings against Vidarbha at the VCA Stadium in Nagpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-jasprit-bumrah-jemimah-rodrigues-2687063-2025-02-28",
      "headline": "Jasprit Bumrah catches up with Jemimah in heartfelt interactionWPL 2025: Jemimah Rodrigues had the chance to interact with Jasprit Bumrah. Jemimah has had her ups and downs in the ongoing tournament with three single-figure scores to her name. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-r-ashwin-csk-ipl-2025-2687021-2025-02-28",
      "headline": "Feels odd: R Ashwin delighted to return to Chennai Super KingsIPL 2025: R Ashwin said that he 'felt odd' after returning to the Chennai Super Kings after nine wickets. CSK bought Ashwin for Rs 9.75 crore in the auction for the upcoming season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-new-zealand-shubman-gill-practice-dubai-2687012-2025-02-28",
      "headline": "Shubman Gill ends injury speculation, trains for 2 hours ahead of IND vs NZ clashShubman Gill ended speculation around his participation in the India vs New Zealand clash as he trained for 2 hours in Dubai on Thursday, February 27. Gill was the only one to miss the practice session on February 26, and he decided to spend some time in the nets on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-sachin-tendulkar-new-zealand-2686988-2025-02-28",
      "headline": "Virat Kohli eyes multiple Sachin Tendulkar records in New Zealand clashChampions Trophy 2025: Virat Kohli will be nearing a couple of records of Sachin Tendulkar when India lock horns with New Zealand in the last Group A match on February 28 at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-virat-kohli-batting-technique-sanjay-bangar-2686939-2025-02-28",
      "headline": "Virat Kohli's return to form: What changes did batter make to his techniqueFormer India batting coach Sanjay Bangar revealed how Virat Kohli was able to work on his batting technique after the Australia tour. Kohli scored a hundred during India's match against Pakistan in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-vs-australia-live-score-lahore-weather-rashid-smith-2686931-2025-02-28",
      "headline": "AFG vs AUS Live: Australia eye strong start to 274-run chaseChampions Trophy, Afghanistan (AFG) vs Australia (AUS) Updates: Australia have begun on a high with Travis Head and Matt Short looking to put Afghanistan bowlers under pressure. The world champions will be looking to get off to a good start in their chase of 274. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/psl-2025-schedule-ipl-clash-islamabad-united-2686902-2025-02-28",
      "headline": "PCB announces PSL 2025 schedule, clashes with IPL 2025PSL 2025: The Pakistan Super League 2025 will take place from April 11 to May 18, clashing with the Indian Premier League to be staged from March 22 to May 25. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-shubman-gill-practice-february-27-dubai-2686889-2025-02-28",
      "headline": "IND vs NZ: Shubman Gill trains on off day before New Zealand clashShubman Gill decided to step up his preparations for the New Zealand game by training on an official off day. There was speculation about Gill's availability after he missed India's practice session on February 26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-sachin-tendulkar-new-zealand-2686988-2025-02-28",
      "headline": "Virat Kohli eyes multiple Sachin Tendulkar records in New Zealand clashChampions Trophy 2025: Virat Kohli will be nearing a couple of records of Sachin Tendulkar when India lock horns with New Zealand in the last Group A match on February 28 at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-virat-kohli-batting-technique-sanjay-bangar-2686939-2025-02-28",
      "headline": "Virat Kohli's return to form: What changes did batter make to his techniqueFormer India batting coach Sanjay Bangar revealed how Virat Kohli was able to work on his batting technique after the Australia tour. Kohli scored a hundred during India's match against Pakistan in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-vs-australia-live-score-lahore-weather-rashid-smith-2686931-2025-02-28",
      "headline": "AFG vs AUS Live: Australia eye strong start to 274-run chaseChampions Trophy, Afghanistan (AFG) vs Australia (AUS) Updates: Australia have begun on a high with Travis Head and Matt Short looking to put Afghanistan bowlers under pressure. The world champions will be looking to get off to a good start in their chase of 274. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/psl-2025-schedule-ipl-clash-islamabad-united-2686902-2025-02-28",
      "headline": "PCB announces PSL 2025 schedule, clashes with IPL 2025PSL 2025: The Pakistan Super League 2025 will take place from April 11 to May 18, clashing with the Indian Premier League to be staged from March 22 to May 25. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-shubman-gill-practice-february-27-dubai-2686889-2025-02-28",
      "headline": "IND vs NZ: Shubman Gill trains on off day before New Zealand clashShubman Gill decided to step up his preparations for the New Zealand game by training on an official off day. There was speculation about Gill's availability after he missed India's practice session on February 26. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}