{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-is-trumps-big-deal-claim-a-pressure-tactic-experts-weigh-in-2747356-2025-06-27",
      "headline": "India-US trade deal: Is Trump's 'big deal' claim a pressure tactic? Experts weigh inUS President Donald Trump on Thursday announced a trade deal with China on rare earths and hinted at a 'very big' trade agreement with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-rallies-nasdaq-sp-500-record-highs-ai-stocks-fed-policy-recession-fears-ease-2747331-2025-06-27",
      "headline": "Wall Street rallies to record highs as AI stocks soar, recession fears easeUS stock markets hit all-time highs on Friday thanks to an AI boom and Fed hints at looser policy ahead. Trade deals with the UK and China have also fuelled market hopes that a global recession could be avoided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-slashes-fd-and-savings-rates-again-in-june-details-here-2747224-2025-06-27",
      "headline": "HDFC Bank slashes FD and savings rates again in June. Details hereHDFC Bank's latest changes signal that deposit rates could remain soft if the RBI continues its rate-cutting cycle. Depositors should review their plans, stay updated with rate changes, and make informed decisions before booking new FDs or RDs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-may-soon-allow-direct-epf-withdrawals-via-atms-and-upi-2747195-2025-06-27",
      "headline": "EPFO may soon allow direct EPF withdrawals via ATMs and UPIThe EPFO recently increased the auto-settlement limit from Rs 1 lakh to Rs 5 lakh. This means members can get up to Rs 5 lakh cleared automatically within three days for things like medical expenses, education, housing, or marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-300-points-higher-nifty-above-25600-jio-financial-shares-jump-4-2747184-2025-06-27",
      "headline": "Sensex ends 300 points higher, Nifty above 25,600; Jio Financial shares jump 4%The S&P BSE Sensex ended 303.03 points higher at 84,058.90, while the NSE Nifty50 rose 88.80 to settle at 25,637.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/switched-jobs-this-year-here-is-how-to-file-your-itr-right-got-salary-from-two-employers-2747138-2025-06-27",
      "headline": "Switched jobs this year? Here's how to file your ITR rightIf you worked for more than one employer in the same year, make sure to report each salary and related deductions separately in the ITR form. Don't mix them up; each employer's income should be shown in its own section. This helps avoid overlaps and mistakes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-indias-ultra-rich-families-investing-in-2025-2747127-2025-06-27",
      "headline": "Where are India's ultra-rich families investing in 2025?A new EY–Julius Baer report, The Indian Family Office Playbook, reveals that many family offices are moving away from traditional wealth preservation and diving into global markets, private credit, and real assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-45-lakh-for-raising-a-child-why-parenting-feels-like-a-luxury-now-2747066-2025-06-27",
      "headline": "Rs 45 lakh for raising a child? Why parenting feels like a luxury nowRising everyday expenses, pricey education and costly healthcare are forcing many young couples to think twice about kids. According to a startup founder, starting a family is personal, but money has become a key factor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-hc-supports-sbi-decision-cancelling-circle-based-officer-appointment-over-cibil-report-anomalies-bad-credit-score-2747020-2025-06-27",
      "headline": "Madras High Court backs bank appointment cancellation over adverse CIBIL reportThe Madras High Court upheld SBI's decision to cancel a candidate's appointment due to adverse credit history, stressing that financial discipline is essential for roles involving public money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-guarantees-in-mutual-funds-investment-adviser-warns-against-risky-pf-advice-2747011-2025-06-27",
      "headline": "No guarantees in mutual funds: Investment adviser warns against risky PF adviceAn investment adviser explains why PF money should not be used for risky bets like mutual funds with \"guaranteed returns.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-saving-30-percent-of-your-income-is-not-always-possible-ca-explains-2746968-2025-06-27",
      "headline": "Why saving 30% of your income isn't always possible, CA explainsFor those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, explains CA Abhishek Walia. For those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, he says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-in-july-will-sensex-nifty-hit-record-high-explained-2746951-2025-06-27",
      "headline": "Will Sensex and Nifty hit record highs in July? Here's all you need to knowWith domestic flows steady and global risks fading, July could be the moment markets break through resistance. But with key events ahead, will momentum hold or falter?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jsw-paints-to-acquire-majority-stake-in-akzo-nobel-india-2746932-2025-06-27",
      "headline": "JSW Paints to acquire majority stake in Akzo Nobel IndiaWith this move, JSW Paints will take sole control of Akzo Nobel India, which operates under the Dulux brand, and emerge as the fourth-largest player in the decorative paints segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-140-points-higher-nifty-above-25600-it-stocks-gain-2746923-2025-06-27",
      "headline": "Sensex, Nifty open higher for 4th straight session as global cues aid momentumThe BSE Sensex opened with a gain of over 140 points and was trading 89.06 points higher at 83,844.93 around 9:22 am. The NSE Nifty50 breached the 25,600-mark at the open before paring some gains to trade 25.35 points up at 25,574.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/online-job-portals-careerbuilder-monster-file-for-bankruptcy-2746877-2025-06-27",
      "headline": "Once-dominant online job boards CareerBuilder, Monster go bankruptCreated through the September merger of CareerBuilder and Monster, the Chicago-based company said it agreed to sell its job board operations, its most recognisable business, to JobGet, which has an app for so-called gig workers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filed-the-wrong-itr-form-penalties-missed-refunds-and-what-to-do-next-2746644-2025-06-26",
      "headline": "Filed the wrong ITR form? Penalties, missed refunds and what to do nextWhether you're a salaried professional, freelancer, or a business owner, choosing the right ITR (Income Tax Return) form is important. Getting it wrong might mean missed refunds, penalties, or worse, your return being treated as invalid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-2025-high-sensex-ends-1000-points-higher-nifty-above-25500-tata-steel-gains-3-percent-2746581-2025-06-26",
      "headline": "Sensex ends 1,000 points higher, Nifty above 25,500; Tata Steel gains 3%The S&P BSE Sensex jumped 1,000.36 points to end at 83,755.87, while the NSE Nifty50 gained 304.25 points to close at 25,549.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-phones-to-partners-8-money-lessons-to-learn-before-30-2746518-2025-06-26",
      "headline": "From phones to partners: 8 money lessons to learn before 30Managing money isn't just about making budgets, it's about making better choices, every single day. CA Nitin Kaushik shares eight crucial money lessons that everyone should grasp by the age of 30."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saving-money-ppf-nsc-rate-cut-government-review-june-30-investors-tip-2746530-2025-06-26",
      "headline": "Are your savings at risk? Government may slash PPF, NSC rates next weekSo far this year, interest rates for schemes such as Sukanya Samriddhi Yojana (SSY), Senior Citizens Savings Scheme (SCSS), and Post Office term deposits have remained unchanged. However, this may not continue in the next quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/housing-sales-india-quarter-2025-trends-high-prices-buyers-wait-2746520-2025-06-26",
      "headline": "Housing sales drop 20% across top 7 cities in Q2 2025 as prices stay highA sluggish Q2 masked early signs of recovery in India's housing market, with rising prices, cautious buyers, and skewed supply dampening sales—but softening rates and easing tensions may turn the tide.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hiding-income-or-making-wrong-claims-your-itr-could-attract-a-200-percent-penalty-2746447-2025-06-26",
      "headline": "Hiding income or making wrong claims? Your ITR could attract a 200% penaltyThe recent changes in Income Tax Return (ITR) regulations highlight stricter penalties for incorrect filings, including a potential 200% penalty on false claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/affordable-housing-crisis-india-sharp-decline-rising-property-costs-2746134-2025-06-26",
      "headline": "Roti, kapda, but no makaan? The disappearing dream of affordable housingAffordable housing is vanishing from India's cities, and the crisis runs deeper than shrinking supply. In this deep dive, we explore how rising costs, fading supply, and policy gaps are shutting the door on millions chasing the ownership dream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-expensive-a-house-should-you-buy-investment-banker-shares-these-6-rules-2746421-2025-06-26",
      "headline": "How expensive a house should you buy? Investment banker shares these 6 rulesAn investment banker lays down six clear, conservative rules for home buying to help first-time buyers avoid the trap of overleveraged homeownership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/received-form-16-do-not-file-your-itr-without-checking-these-points-2746414-2025-06-26",
      "headline": "Received Form 16? Don't file your ITR without checking these pointsForm 16 is a certificate your employer gives you every year. It shows how much salary you earned in the financial year and how much tax was deducted from it. This tax is called TDS (Tax Deducted at Source)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/world-most-valuable-company-nvidia-market-cap-ai-chip-maker-share-price-microsoft-apple-tesla-us-aramco-2746366-2025-06-26",
      "headline": "Nvidia overtakes Microsoft as world's most valuable company after 4% surgeNvidia's shares touched a new record high of $154.10, after climbing 4.33% during the trading session. This rally followed a positive report from Loop Capital, which raised its price target for Nvidia from $175 to $250. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-rally-dalal-street-optimism-israel-iran-ceasefire-domestic-factors-stock-market-rising-today-2746359-2025-06-26",
      "headline": "Sensex rises over 500 points, crosses 83,000: Why is stock market rising today?By 9:59 am, the Sensex had gained 549 points to touch 83,305.06, while the Nifty rose by 172.75 points to 25,417.50. The mood across the broader market was upbeat, and volatility remained surprisingly muted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-bitcoin-reserve-signals-a-shift-an-opening-for-india-2746346-2025-06-26",
      "headline": "US Bitcoin Reserve signals a shift: An opening for IndiaIndia stands at a pivotal juncture. A measured Bitcoin strategy—perhaps a reserve pilot—could strengthen economic resilience and project modernity. As the US advances and nations like Bhutan adapt, India has a unique opportunity to lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-127-points-higher-nifty-above-25200-eternal-gains-1-percent-2746333-2025-06-26",
      "headline": "Sensex opens 127 points higher, Nifty above 25,200; Eternal gains 1%The S&P BSE Sensex was up 364.24 points to 83,119.75, while the NSE Nifty50 added 114.95 points to 25,359.70 as of 9:31 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-fine-bse-rs-25-lakh-why-reason-for-unequal-data-access-failure-in-oversight-order-trading-rights-2746330-2025-06-26",
      "headline": "Sebi penalises BSE Rs 25 lakh for unequal data access, failure in oversightSebi called the failure by BSE 'laxity and negligence' and pointed out that BSE, being a first-level regulator, has a duty to maintain a clean and fair trading environment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-june-26-trading-setup-nse-bse-rise-fall-2746310-2025-06-26",
      "headline": "Sensex, Nifty opening on June 26: Will stock market rise again today?As of 8:24 am, the Gift Nifty futures were trading at 25,287 points. This suggests that the Nifty50 could open around its previous close of 25,244.75."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-26-share-market-tips-nse-bse-trading-sbi-tata-steel-mobikwik-adani-2746300-2025-06-26",
      "headline": "Stocks to watch on June 26: SBI, Tata Steel, One Mobikwik, Adani EnterprisesStrong global signals and a steady flow of news from domestic companies helped keep investor sentiment upbeat as Sensex and Nifty gained nearly 1% in the last session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-total-gas-and-reliance-jio-bp-partner-to-expand-fuel-access-across-india-2746044-2025-06-25",
      "headline": "Adani Total Gas and Jio-bp partner to expand fuel access across IndiaThis collaboration will see Jio-bp's premium petrol and diesel sold at select Adani fuel outlets, according to ATGL's statement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-700-points-higher-nifty-above-25200-titan-up-4-mahindra-infosys-2746018-2025-06-25",
      "headline": "Sensex closes 700 points higher, Nifty above 25,200, Titan up 4%The S&P BSE Sensex added 700.40 points to end at 82,755.51, while the NSE Nifty50 gained 200.40 points to close at 25,244.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/jewellery-vs-gold-etfs-how-to-make-make-money-shine-not-just-wrists-explains-ca-2745981-2025-06-25",
      "headline": "Jewellery vs gold ETFs: How to make make money shine, not just wrists, explains CAGold jewellery may look beautiful, but it often comes with hidden costs, resale hassles, and emotional attachment that cloud financial judgement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-house-real-estate-most-affordable-houses-pune-ahmedabad-knight-frank-report-affordability-index-2745971-2025-06-25",
      "headline": "Planning to buy a house? This is India's most affordable city in 2025A report from Knight Frank India's latest Affordability Index highlights that RBI's decision to cut the repo rate by 100 basis points since February 2025 has played a key role in improving housing affordability across the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-sip-success-do-this-every-month-says-stock-market-expert-rajnish-mehan-2745946-2025-06-25",
      "headline": "Want SIP success? Do this every month, says stock market expertSIP calculators do a fine job of showing projections. However, they don't account for emotions, self-doubt, or the unpredictability of life, mentioned a stock market expert."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-56th-what-to-expect-rationalisation-tax-forms-appellate-tribunal-nirmala-sitharaman-cess-2745915-2025-06-25",
      "headline": "GST Council meeting: What to expect from upcoming meet?The previous GST Council meeting took place on December 21, 2024, in Jaisalmer. Since then, many matters have remained pending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8-key-documents-you-must-keep-ready-before-filing-your-itr-for-fy-2024-25-2745875-2025-06-25",
      "headline": "8 key documents you must keep ready before filing your ITR for FY 2024–25One of the first documents you'll need is Form 16, which your employer gives you. It shows your total salary, how much tax was deducted, and what deductions were claimed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-raises-auto-settlement-limit-to-rs-5-lakh-for-faster-fund-access-2745819-2025-06-25",
      "headline": "EPFO raises auto-settlement limit to Rs 5 lakh for faster fund accessIn the fiscal year 2024-25, the EPFO processed a record 2.34 crore advance claims through the auto-settlement process, marking a 161% increase compared to the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-rally-up-why-reason-iran-israel-ceasefire-stock-market-today-bse-nse-trading-2745804-2025-06-25",
      "headline": "Sensex jumps 700 points: Why is the stock market rising today? The S&P BSE Sensex jumped 722.55 points to 82,777.66, while the NSE Nifty50 added 209.15 points to 25,253.50 as of 2:25 pm."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-on-how-confronting-mahesh-bhatt-for-saaransh-changed-his-life-2747340-2025-06-27",
      "headline": "Exclusive: Anupam Kher on how confronting Mahesh Bhatt for Saaransh changed his lifeVeteran actor Anupam Kher reflected on a defining moment in his career when he was removed from the film 'Saaransh' just days before shooting, His upcoming film 'Metro... In Dino' highlights similar themes of speaking up and connecting with others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/huma-qureshi-rajkummar-rao-maalik-for-free-cant-take-money-from-friends-2747330-2025-06-27",
      "headline": "Huma Qureshi on doing Rajkummar Rao's Maalik song for free: Can't charge friendsHuma Qureshi has won hearts with her performance in the song 'Dil Thaam Ke' from Rajkummar Rao's film 'Maalik', which she did without charging any fee. She described the experience as a friendly collaboration filled with hard work, fun, and dedication."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/love-marriage-vikram-prabhu-film-pleasant-rom-com-that-never-achieves-its-full-potential-2747315-2025-06-27",
      "headline": "Love Marriage review: Pleasant rom-com that never achieves its full potentialReleased-Fri Jun 27, 2025Love Marriage review: Director Shanmuga Priyan's 'Love Marriage', starring Vikram Prabhu, Sushmitha Bhat and Meenakshi Dinesh, is a Tamil remake of the Telugu film, 'Ashoka Vanamlo Arjuna Kalyanam'. The pleasant romantic comedy is a perfect canvas for a laughter riot but bogged down by redundant ideas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurrana-reacts-to-oscars-academy-invitation-feels-honoured-to-represent-india-2747318-2025-06-27",
      "headline": "Ayushmann Khurrana reacts to Academy invitation, feels honoured to represent IndiaActor Ayushmann Khurrana has been invited to join the Oscars Academy, marking a significant achievement for Indian cinema. The actor reacted to the news and expressed his gratitude. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/india-is-remaking-brooklyn-nine-nine-kunal-kemmu-might-play-jake-peralta-reports-2747282-2025-06-27",
      "headline": "India is remaking Brooklyn Nine Nine, Kunal Kemmu might play Jake Peralta: Reports'Brooklyn Nine Nine' could get an Indian adaptation. The makers have reportedly discussed signing actor Kunal Kemmu to play Andy Samberg's character, Jake Perala. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-traitors-actor-purav-jha-teams-up-with-harsh-gujral-after-elnaaz-norouzis-exit-2747243-2025-06-27",
      "headline": "The Traitors: Actor Purav Jha teams up with Harsh Gujral after Elnaaz Norouzi's exitIn the new episode of 'The Traitors', actor Purav Jha teamed up with his friend Harsh Gujral. Jha appointed Gujral as the traitor after Norouzi was voted out in the circle of shaq."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-expresses-love-and-respect-for-his-love-and-war-colleagues-ranbir-kapoor-and-alia-bhatt-2747264-2025-06-27",
      "headline": "Vicky expresses love and respect for his Love & War colleagues, Ranbir and AliaVicky Kaushal opened up about how he felt working alongside Ranbir Kapoor and Alia Bhatt in 'Love & War'. The actors are once again sharing the silver screen in the Sanjay Leela Bhansali-directorial. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-gushes-over-rumoured-girlfriend-rashmika-mandanna-terrific-mysaa-poster-2747244-2025-06-27",
      "headline": "Vijay Deverakonda gushes over rumoured girlfriend Rashmika's terrific Mysaa posterActor Rashmika Mandanna shared the first look of her upcoming movie 'Mysaa'. She described her look as her fiercest avatar yet. Turns out her rumoured boyfriend, actor Vijay Devarakonda, also thinks that this is her one-of-a-kind portrayal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kpop-demon-hunters-exposes-fear-of-imperfection-2746395-2025-06-27",
      "headline": "How KPop Demon Hunters exposes our fear of imperfectionNetflix's latest anime, 'KPop Demon Hunters', showcases trendy songs and great choreography, but beneath it, is a scathing critique of societal expectations, personal shame, and the exhausting battle to be seen as you are. In this week's K-Fix, we discuss how an American film about the K-pop fandom becomes so much more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-meets-singapore-high-commissioner-simon-wong-politician-shares-pic-2747283-2025-06-27",
      "headline": "Thalapathy Vijay meets Singapore High Commissioner Simon Wong, politician shares picSimon Wong, the High Commissioner of the Republic of Singapore to India, recently met Thalapathy Vijay. Sharing a photo with the Tamil superstar, he posed an intriguing question to his followers.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/exclusive-vivek-agnihotri-on-india-soft-power-10-us-premieres-of-bengal-files-2747274-2025-06-27",
      "headline": "Exclusive: Vivek Agnihotri on India's soft power, 10 US premieres of Bengal FilesFilmmaker Vivek Agnihotri has decided to premiere his film 'The Bengali Files' in 10 US cities in a grand manner. But, what is this promotional strategy all about? He discussed it in an exclusive interview with IndiaToday.in. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-family-man-3-manoj-bajpayee-faces-new-nemesis-jaideep-ahlawat-in-spy-thriller-2747262-2025-06-27",
      "headline": "The Family Man 3: Manoj Bajpayee faces new nemesis, Jaideep Ahlawat in spy-thrillerPrime Video has released the announcement video for 'The Family Man 3', featuring new antagonists Jaideep Ahlawat and Nimrat Kaur. The third season brings intense espionage and higher stakes for Srikant Tiwari and his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/esha-deol-and-ex-bharat-takhtani-make-joint-appearance-at-mumbai-airport-2747230-2025-06-27",
      "headline": "Esha Deol and ex Bharat Takhtani make joint appearance at Mumbai airportEsha Deol and Bharat Takhtani were seen together for the first time since their 2024 divorce, as they boarded a flight in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-ravi-mohan-claim-of-living-in-rented-home-amid-divorce-sparks-backlash-2747205-2025-06-27",
      "headline": "Actor Ravi Mohan's claim of living in rented home amid divorce sparks backlashActor Ravi Mohan recently revealed that he has been living in a rented house since his split with estranged wife Aarti Ravi. His comments sparked backlash from social media users. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-celebrates-one-year-kalk-2898-ad-says-open-to-sequel-if-team-wants-him-2747231-2025-06-27",
      "headline": "Big B marks 1 year of Prabhas's Kalki, says open to sequel if team wants himAmitabh Bachchan shared a heartfelt post to celebrate one year of 'Kalki 2898 AD'. The veteran icon is looking forward to being a part of the sequel if the team ever asks him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-announces-solo-concert-with-singer-choi-ye-na-details-out-2747129-2025-06-27",
      "headline": "BTS' Jin announces solo concert with singer Choi Ye-na. Here's all about itBTS member Jin is launching his highly anticipated solo fan concert tour. The tour is scheduled to begin in South Korea. Here's everything you need to know about the tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-dropped-from-border-2-amid-row-over-casting-pakistani-actor-hania-amir-in-sardaar-ji-3-sources-2747180-2025-06-27",
      "headline": "Diljit Dosanjh likely to be replaced in Border 2 amid Sardaar Ji 3 row: SourcesActor Diljit Dosanjh is likely to be replaced by Ammy Virk in 'Border 2'. This comes amid a row surrounding his Punjabi film 'Sardaar Ji 3'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/umrao-jaan-director-calls-bhansali-heeramandi-over-the-top-too-palatial-rich-2747118-2025-06-27",
      "headline": "Umrao Jaan director calls Bhansali's Heeramandi over the top: Too palatial and richDirector Muzaffar Ali recently expressed his views on Sanjay Leela Bhansali's show 'Heeramandi'. His classic 'Umrao Jaan' featuring Rekha re-released in theatres on June 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/exclusive-park-sung-hoon-on-squid-game-3-dealing-with-hate-visiting-india-queen-of-tears-2747164-2025-06-27",
      "headline": "Exclusive: Park Sung-hoon on Squid Game 3, dealing with hate, visiting India | Queen of TearsIn an exclusive conversation with India Today's Bhavna Agarwal, Squid Game 3 star Park Sung-hoon opens up about playing Hyun-ju, a transgender woman with selfless heart in the show, playing villain roles and India. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/we-can-do-whatever-we-want-trump-says-deadline-for-reciprocal-tariffs-not-fixed-glbs-2747399-2025-06-27",
      "headline": "We can do whatever we want: Trump says deadline for reciprocal tariffs not fixedUS President Donald Trump may shift the July tariff deadline, allowing flexibility in trade talks. Officials signal deals could come by Labour Day, easing market concerns over imminent trade disruptions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-student-spurned-marriage-proposal-locked-inside-college-guard-room-and-gang-raped-later-police-2747135-2025-06-27",
      "headline": "Touched his feet but he didn't let me go: Kolkata law student's rape complaintA 24-year-old student said in her complaint that she was gang-raped inside a Kolkata law college after rejecting a marriage proposal from the main accused. She said the assault was filmed and used to blackmail and threaten her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/charade-at-paks-behest-india-rejects-court-of-arbitrations-ruling-on-jk-hydropower-project-2747313-2025-06-27",
      "headline": "Charade at Pak's behest: India on Court of Arbitration 'ruling' on J&K dam projectsIndia said it never recognised the existence in law of the so-called Court of Arbitration and that the body is in itself a violation of the Indus Waters Treaty, which is paused following the Pahalgam terror attack in April."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/shefali-jariwala-death-kaanta-laga-actor-cardiac-arrest-2747409-2025-06-28",
      "headline": "Kaanta Laga actor Shefali Jariwala dies of cardiac arrest at 42Kaanta Laga and Bigg Boss 13 fame Shefali Jariwala passed away at 42 due to a cardiac arrest late Friday night. She was rushed to the hospital by her husband Parag Tyagi but was declared brought dead.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-gaza-grind-and-iranian-gambit-will-have-a-cost-for-israel-2747190-2025-06-27",
      "headline": "The Gaza Grind and Iranian Gambit Will Have a Cost for IsraelIsrael's fan club is shrinking in the West. UK and European Parliaments are echoing public disgust with calls for ceasefire and arms embargoes. Enemies are emboldened, allies are wavering. And the Gaza grind is bleeding goodwill. Israel simply needs a new script."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/want-full-trade-barrier-dropping-trump-on-what-he-wants-from-trade-agreement-with-india-2747377-2025-06-27",
      "headline": "Unthinkable, but...: Trump wants full removal of trade barriers in India dealSpeaking about a trade deal with India, US President Donald Trump said his country was looking to get all the trade barriers removed, which, he said, was \"unthinkable\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/tejashwi-yadav-vs-nitish-kumar-what-rjd-leader-said-on-chief-ministerial-hopes-2747396-2025-06-27",
      "headline": "Tejashwi Yadav vs Nitish Kumar? What RJD leader said on chief ministerial hopesRJD leader Tejashwi Yadav said a decision on the chief ministerial face from the Mahagathbandhan (grand alliance) for the upcoming Bihar Assembly polls would be made after a decision by all opposition parties."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-college-gang-rape-case-three-arrested-including-staff-member-2747081-2025-06-27",
      "headline": "Bite marks on body of student gang-raped in Kolkata law college; 3 arrestedA 24-year-old law student in south Kolkata was allegedly gang-raped inside the college premises. Three accused were arrested in the case, including two students and a staffer - who is a Trinamool Congress student wing leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/south-africa-country-junked-nuclear-weapons-helped-non-proliferation-treaty-ben-gurion-nehru-golda-meir-iran-2746849-2025-06-27",
      "headline": "How a country that helped Israel get nuclear weapons junked its own nukesIsrael, the only undeclared nuclear power, started work on its N-weapons programme within years of the founding of the Jewish nation. One of its clandestine partners was apartheid-era South Africa. While Israel is said to be in possession of 90 warheads now, South Africa signed the NPT and junked its nukes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) SystemThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/noida/story/videos-noida-society-staff-kick-residents-beat-them-with-sticks-over-power-cut-2747314-2025-06-27",
      "headline": "Videos: Noida society residents complain of power cut, thrashed by security guardsResidents of a Greater Noida West society were thrashed, kicked and beaten with sticks by security guards and maintenance staff following a dispute over a cut in power supply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/probe-new-york-mayor-election-democratic-zohran-mamdani-citizenship-deport-demand-republicans-us-mira-nair-2747080-2025-06-27",
      "headline": "Calls for Zohran Mamdani's deportation; Trump's border czar says 'game on'Republicans are demanding a federal probe into NYC mayoral candidate Zohran Mamdani's citizenship, with some calling for his deportation. Critics accuse him of ties to extremism and the Palestinian terror group, Hamas. The backlash, by Republicans like President Donald Trump's son, includes Islamophobic rhetoric and accusations of being a Hamas sympathiser."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-indias-ultra-rich-families-investing-in-2025-2747127-2025-06-27",
      "headline": "Where are India's ultra-rich families investing in 2025?A new EY–Julius Baer report, The Indian Family Office Playbook, reveals that many family offices are moving away from traditional wealth preservation and diving into global markets, private credit, and real assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-supreme-court-curbs-judges-power-to-stop-trump-in-birthright-citizenship-order-2747336-2025-06-27",
      "headline": "US Supreme Court curbs judges' power to stop Trump in birthright citizenship orderThe US Supreme Court, in a 6-3 ruling, granted a request by the Trump administration to narrow the scope of three nationwide injunctions issued by federal judges in three states that halted enforcement of his birthright citizenship plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/two-mizoram-journalists-feature-emmys-winning-bbc-documentary-film-on-myanmar-civil-war-emmy-awards-2747334-2025-06-27",
      "headline": "Two Mizoram journalists part of BBC team that won Emmy for Myanmar docuMizoram journalists HC Vanlalruata and Isaac Zoramsanga were part of the BBC team that won an Emmy Award for a documentary on the civil war in Myanmar. The Mizo journalists provided vital on-ground support for the inputs from Myanmar's Chin state, with visits to a rebel militia headquarters and a village bombed by junta forces. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-praggnanandhaa-top-ranked-india-player-uzchess-cup-masters-2747325-2025-06-27",
      "headline": "Praggnanandhaa becomes India's top-ranked player with UzChess Cup Masters winR Praggnanandhaa reached a historic milestone when he became the No. 1-ranked Indian chess player in the live rankings. Praggnanandhaa achieved the feat by winning the UzChess Cup Masters by beating Uzbekistan's Nodirbek Abdusattorov"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/fact-check/story/why-is-the-word-parking-striking-terror-in-the-hearts-of-punjab-influencers-2747364-2025-06-27",
      "headline": "Why is the word 'parking' striking terror in the hearts of Punjab's influencers?Following the murder of a popular influencer in Punjab, the word \"parking\" is being used as a death threat for content creators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-trinamool-student-leader-accused-gang-rape-law-student-accused-pics-2747240-2025-06-27",
      "headline": "BJP claims Kolkata rape accused seen with Trinamool leaders, party says no linkThe BJP claimed that Manojit Mishra, the main accused in the Kolkata gang-rape of a law student, was seen with top Trinamool Congress leaders. However, the Trinamool Congress sought to distance itself from the accused, saying it had no links with him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/quiet-cracking-reasons-and-solution-2746990-2025-06-27",
      "headline": "Resignation mail in drafts? It could be Quiet CrackingQuiet cracking is basically a persistent sense of workplace unhappiness caused by feeling unseen, unheard, and unsupported, leading to disengagement, poor performance, and a growing urge to quit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-debate-to-drop-socialist-secular-from-preamble-of-indian-constitution-is-needless-noise-2747245-2025-06-27",
      "headline": "Why debate to drop socialist, secular from Preamble is needlessThe terms 'socialist' and 'secular' were added to the Preamble of the Constitution during the Emergency, when a legitimate Opposition was absent from the Parliament. However, a debate on whether to retain or remove the terms is needless."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kpop-demon-hunters-exposes-fear-of-imperfection-2746395-2025-06-27",
      "headline": "How KPop Demon Hunters exposes our fear of imperfectionNetflix's latest anime, 'KPop Demon Hunters', showcases trendy songs and great choreography, but beneath it, is a scathing critique of societal expectations, personal shame, and the exhausting battle to be seen as you are. In this week's K-Fix, we discuss how an American film about the K-pop fandom becomes so much more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/man-attends-gujarat-high-court-hearing-from-toilet-viral-video-2747310-2025-06-27",
      "headline": "Man attends Gujarat High Court hearing from toilet. Viral video stuns InternetA man logged into a virtual Gujarat High Court hearing from a rather unexpected location, his bathroom. A video of the incident has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/hyderabad-couple-arrested-for-live-streaming-sex-acts-for-money-2747268-2025-06-27",
      "headline": "Rs 1,000 for 5 minutes: Hyderabad couple livestreamed sex acts, arrestedA Hyderabad couple has been arrested for allegedly performing masked sexual acts on live streams for paying viewers, charging Rs 1,000 per 5-minute session and blackmailing some viewers for more money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/chief-justice-of-india-br-gavai-madras-high-court-judge-not-being-elevated-bombay-court-2747354-2025-06-27",
      "headline": "Things don't happen the way you want: Chief Justice on judge not being elevatedChief Justice of India BR Gavai said he promised to speak on the issue of appointment and elevation of judges in the Supreme Court Collegium once he retires on November 23."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-aryna-sabalenka-coco-gauff-dance-off-french-open-viral-video-2747397-2025-06-27",
      "headline": "Aryna Sabalenka and Coco Gauff dance-off French Open feud ahead of WimbledonAfter their tense French Open final, Aryna Sabalenka and Coco Gauff were spotted dancing together in a TikTok video at Wimbledon, suggesting the rivalry has softened just in time for the year's third Grand Slam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-priyank-panchal-interview-gujarat-2747391-2025-06-27",
      "headline": "Competitive Jasprit Bumrah had the spark and vibe to represent India: Priyank PanchalFormer Gujarat batter Priyank Panchal, in an exclusive interview, said that Jasprit Bumrah always had the spark and vibe to represent India from his early days. Bumrah played a big role in Gujarat's Ranji Trophy title-winning campaign in 2016-17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-u19-vs-india-u19-vaibhav-suryavanshi-runs-ayush-mhatre-hove-2747375-2025-06-27",
      "headline": "IPL star Vaibhav Suryavanshi smashes 19-balll 48 against England U-19sAt just 14, Vaibhav Suryavanshi showcased his explosive talent once again, smashing a 19-ball 48 to power India U-19 to a dominant win over England, continuing his dream run from the IPL to international youth cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/max-verstappen-mercedes-interest-red-bull-toto-wolff-2747352-2025-06-27",
      "headline": "Max Verstappen to Mercedes? Toto Wolff confirms interest in signing Red Bull starMercedes team principal Toto Wolff has confirmed that they're interested in signing Max Verstappen for next season. Verstappen has been heavily linked with an exit from Red Bull, despite having a contract until 2028. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/lalit-upadhyay-retirement-indian-mens-team-harmanpreet-singh-2747344-2025-06-27",
      "headline": "Lalit Upadhyay says he wanted to retire at peak: Didn't want to drag myselfLalit Upadhyay said that he wanted to retire at the peak of his career and didn't want to drag himself in the sport for long. Upadhyay is a two-time bronze medallist for India at the Olympics and was a vital cog in the team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-revises-two-new-balls-rule-odi-cricket-balance-reverse-swing-2747341-2025-06-27",
      "headline": "ICC revises two-ball rule in ODIs: What's the change and why is it important?The ICC has revised the two-new-balls rule in ODIs to address the imbalance favouring batters. This move aims to bring back reverse swing and enhance bowling impact in the 50-over format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-praggnanandhaa-top-ranked-india-player-uzchess-cup-masters-2747325-2025-06-27",
      "headline": "Praggnanandhaa becomes India's top-ranked player with UzChess Cup Masters winR Praggnanandhaa reached a historic milestone when he became the No. 1-ranked Indian chess player in the live rankings. Praggnanandhaa achieved the feat by winning the UzChess Cup Masters by beating Uzbekistan's Nodirbek Abdusattorov"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-south-africa-dewald-brevis-keshav-maharaj-2747317-2025-06-27",
      "headline": "Dewald Brevis set for debut in Keshav Maharaj-led new-look XIZimbabwe (ZIM) vs South Africa (SA), 1st Test: Keshav Maharaj will lead a new-look XI in the series opener against Zimbabwe. Batting stars Dewald Brevis and Lhuan-dre Pretorius are set to make their debuts on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-bangladesh-3rd-day-colombo-test-report-kamindu-mendis-2747308-2025-06-27",
      "headline": "Sri Lanka close in on series win as Bangladesh collapse under spin pressureSri Lanka's spin dominance and batting grit put them on the verge of an innings victory over Bangladesh in Colombo, with just four wickets separating them from a commanding series sweep at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-warns-fans-fakes-quotes-fact-check-verify-2747171-2025-06-27",
      "headline": "Sunil Gavaskar warns fans on fakes quotes attributed to himSunil Gavaskar has warned fans about websites and individual accounts misusing his name by attributing fake quotes. He implored that the fans always verify and fact-check such information before believing it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-praggnanandhaa-top-ranked-india-player-uzchess-cup-masters-2747325-2025-06-27",
      "headline": "Praggnanandhaa becomes India's top-ranked player with UzChess Cup Masters winR Praggnanandhaa reached a historic milestone when he became the No. 1-ranked Indian chess player in the live rankings. Praggnanandhaa achieved the feat by winning the UzChess Cup Masters by beating Uzbekistan's Nodirbek Abdusattorov"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-south-africa-dewald-brevis-keshav-maharaj-2747317-2025-06-27",
      "headline": "Dewald Brevis set for debut in Keshav Maharaj-led new-look XIZimbabwe (ZIM) vs South Africa (SA), 1st Test: Keshav Maharaj will lead a new-look XI in the series opener against Zimbabwe. Batting stars Dewald Brevis and Lhuan-dre Pretorius are set to make their debuts on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-bangladesh-3rd-day-colombo-test-report-kamindu-mendis-2747308-2025-06-27",
      "headline": "Sri Lanka close in on series win as Bangladesh collapse under spin pressureSri Lanka's spin dominance and batting grit put them on the verge of an innings victory over Bangladesh in Colombo, with just four wickets separating them from a commanding series sweep at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-warns-fans-fakes-quotes-fact-check-verify-2747171-2025-06-27",
      "headline": "Sunil Gavaskar warns fans on fakes quotes attributed to himSunil Gavaskar has warned fans about websites and individual accounts misusing his name by attributing fake quotes. He implored that the fans always verify and fact-check such information before believing it."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}