{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-17000-job-cuts-factory-strike-finances-delay-first-777x-delivery-2615682-2024-10-12",
      "headline": "Boeing to cut 17,000 jobs as losses deepen amid factory strikeThe planemaker will also delay the delivery of its first 777X jet by a year. Boeing CEO Kelly Ortberg said that the comapny must shrink its workforce \"to align with financial reality\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-richest-mukesh-ambani-gautam-adani-jindal-cross-usd-1-trillion-mark-amid-market-rally-pm-modi-win-2615476-2024-10-11",
      "headline": "Fortunes soar: India's richest cross $1 trillion mark amid market rallyForbes' analysis shows that India's 100 richest individuals now have a total net worth of $1.1 trillion, more than doubling their wealth since 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-trent-to-titan-noel-tatas-journey-to-the-top-of-tata-trust-2615449-2024-10-11",
      "headline": "From Trent to Titan: Noel Tata's journey to the top of Tata TrustNoel Tata, born to Naval Tata and Simone Tata, has been a key figure in the Tata Group for many years. He holds several senior positions within the conglomerate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nariman-point-revival-office-rents-expected-to-nearly-double-by-2030-report-2615402-2024-10-11",
      "headline": "Nariman Point's revival: Office rents expected to nearly double by 2030The report, titled 'South Mumbai – A Renaissance', attributes this expected surge to ongoing infrastructure improvements and rising demand for premium office space in the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-named-tata-trusts-chairman-carry-forward-ratan-tata-legacy-2615368-2024-10-11",
      "headline": "Noel Tata on being named Tata Trusts Chairman: Will carry on legacy of Ratan TataNoel Tata was named Tata Trusts Chairman after a board meeting held in Mumbai on October 11, where the decision was unanimously agreed upon by the trustees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/financial-crisis-likely-in-delhi-additional-expenditures-to-put-national-capital-in-revenue-deficit-this-fiscal-year-2615347-2024-10-11",
      "headline": "Financial crisis looms in Delhi as extra spending tips city into revenue deficitSeveral departments have underscored additional resource needs, which strain the budget further. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-as-foreign-investment-fizzles-tata-group-shares-gain-2615327-2024-10-11",
      "headline": "Sensex, Nifty end lower as foreign investment fizzles; Tata Group shares gainThe S&P BSE Sensex was down by 230.05 points to close at 81,381.36, while the Nifty50 declined by 34.20 points to end at 24,964.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trent-tata-chemicals-tata-investment-corporation-surge-3-percent-as-noel-tata-takes-charge-at-tata-trusts-2615300-2024-10-11",
      "headline": "Tata group stocks surge 3% as Noel Tata takes charge at Tata TrustsNoel Tata's appointment came after the death of Ratan Tata, former chairman of Tata Sons, on October 9 at the age of 86. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/noel-tata-appointed-chairman-of-tata-trusts-succeed-ratan-tata-2615252-2024-10-11",
      "headline": "Appointed Chairman of Tata Trusts, Noel Tata to succeed Ratan Tata Noel Tata has been appointed as the new Chairman of Tata Trusts, effective October 11, following the death of his half-brother Ratan Tata on October 9 at the age of 86. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-group-trust-chairman-noel-tata-succeeds-ratan-tata-2615235-2024-10-11",
      "headline": "Who is Noel Tata, new Tata Trusts Chairman and half-brother of Ratan TataNoel Tata has made significant contributions to the Tata Group's growth and success. His strategic vision, coupled with his deep understanding of the group's businesses, has enabled him to play a key role in driving innovation and expanding the group's global reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-appointed-chairman-of-tata-trusts-ratan-tata-death-successor-2615226-2024-10-11",
      "headline": "Noel Tata to succeed Ratan Tata, unanimously appointed Chairman of Tata TrustsNoel Tata has been a part of the Tata Group for over 40 years. The appointment was made during a meeting held in Mumbai and was unanimously agreed upon by the board of Tata Trusts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mehli-mistry-noel-tata-lead-race-to-become-tata-trusts-chairman-report-2615175-2024-10-11",
      "headline": "Mehli Mistry, Noel Tata lead race to become Tata Trusts chairman: ReportNoel Tata is already a trustee in the Sir Dorabji Tata Trust and the Sir Ratan Tata Trust, which together hold a 66% stake in Tata Sons, the holding company of the Tata Group. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rupee-drops-to-all-time-low-against-dollar-amid-oil-price-surge-middle-east-tension-2615146-2024-10-11",
      "headline": "Rupee falls to all-time low against dollar amid oil price surgeThe rupee weakened to 83.99 per dollar, slightly surpassing its previous all-time low of 83.9850 recorded on September 12, and down from the 83.9675 level seen in the prior trading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/garuda-construction-and-engineering-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-2615132-2024-10-11",
      "headline": "Garuda Construction and Engineering IPO allotment: Online guide to check statusGaruda Construction and Engineering IPO allotment: Investors who have bid for the IPO can check their allotment status online. They can log in to either the BSE website or the website of Link Intime India Private Ltd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-lower-as-financial-stocks-drag-markets-tata-steel-up-2-percent-2615096-2024-10-11",
      "headline": "Sensex, Nifty open lower as financial stocks drag markets; Tata Steel up 2%The S&P BSE Sensex declined 65.89 points to 81,545.52, while the NSE Nifty50 was down 1.35 points to 24,997.10"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-11-2024-precious-metals-record-hike-on-mcx-2615082-2024-10-11",
      "headline": "Gold, silver price today, October 11, 2024: Precious metals record hike on MCXGold Price Today October 11, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/who-will-inherit-ratan-tatas-legacy-in-the-tata-group-2614817-2024-10-10",
      "headline": "Who will inherit Ratan Tata's legacy in the Tata Group?Ratan Tata, a towering icon of industry and philanthropy who died on Wednesday, leaves behind a significant legacy and an empty chair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-dividend-set-at-rs-10-per-share-payout-november-5-record-date-october-18-2614783-2024-10-10",
      "headline": "TCS Q2 results: Dividend set at Rs 10 per share. Check key datesTCS Q2 results: The company reported a 5% year-on-year (YoY) rise in net profit, amounting to Rs 11,909 crore, compared to Rs 11,342 crore in the corresponding quarter of the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tata-was-a-great-human-being-very-humble-narayana-murthy-2614774-2024-10-10",
      "headline": "Ratan Tata was a great human being, very humble: Narayana MurthyIn an exclusive interview with India Today TV, Infosys co-founder Narayana Murthy paid tribute to late industrialist, Ratan Tata. Murthy lauded Ratan Tata as a 'compassionate human being who transcended financial status and official power.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tatas-legacy-as-humanitarian-bigger-than-as-industrialist-birla-group-chief-2614740-2024-10-10",
      "headline": "Ratan Tata's legacy as humanitarian bigger than as industrialist: Birla Group chiefIn an exclusive interview with India Today TV, Kumar Mangalam Birla, chairperson of the Aditya Birla Group, reflected on the life and legacy of Ratan Tata."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-doctors-mass-resignations-healthcare-crisis-bengal-government-rejects-2615877-2024-10-12",
      "headline": "Bengal government rejects doctors' mass resignation: Not legally validThe West Bengal government on Saturday said the mass resignation of doctors from state-run hospitals is not valid, and it must be submitted individually according to service rules."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/systematic-pattern-of-desecration-india-condemns-theft-goddess-kali-crown-bangladesh-temple-durga-puja-attack-2615826-2024-10-12",
      "headline": "Systematic pattern of desecration: India condemns theft at Bangladesh templeIn a statement, the Ministry of External Affairs raised concerns over the situation of minorities in Bangladesh, highlighting the attack on a Durga Puja mandap in Dhaka and theft at the revered Jeshoreshwari Kali temple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/prime-minister-narendra-modi-president-droupadi-murmu-dussehra-celebrations-red-fort-video-2615917-2024-10-12",
      "headline": "Watch: PM Modi, President Murmu attend Dussehra celebrations at Red FortPrime Minister Narendra Modi and President Droupadi Murmu on Saturday attended the Dussehra celebrations at Madhav Das Park, Red Fort in Delhi. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tamil-nadu-train-accident-nia-probes-sabotage-angle-tracks-likely-hampered-2615941-2024-10-12",
      "headline": "NIA suspects Tamil Nadu train accident due to sabotage, tracks likely hampered with hammer: SourcesNIA suspects Tamil Nadu train accident due to sabotage, tracks likely hampered with hammer: Sources"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/sahara-desert-flood-heavy-rain-lake-morocco-2615779-2024-10-12",
      "headline": "Rare rain floods Sahara Desert, dry lake filled for first time in 50 yearsSand dunes, typically barren and desolate, are now submerged beneath sheets of water. What were once parched plains are now lush green expanses. Experts attribute the unusual rainfall to a combination of factors, including climate change-induced shifts in weather patterns and the rare convergence of atmospheric conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/boris-johnson-praises-pm-modi-in-memoir-unleashed-british-india-relations-trade-2615880-2024-10-12",
      "headline": "Boris Johnson praises PM Modi in memoir: Felt his curious astral energyIn his memoir 'Unleashed', former British PM Boris Johnson credits himself for setting the course for a \"proper free-trade deal\" with India thanks to finding \"exactly the partner and friend\" in PM Modi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/workers-buried-alive-killed-construction-site-accident-gujarat-mehsana-kadi-rescue-2615815-2024-10-12",
      "headline": "7 workers killed in wall collapse at construction site in Gujarat's MehsanaSeven labourers were killed and three to four others are feared trapped after a wall collapsed on them while digging a pit for an underground tank at a construction site in Gujarat's Mehsana. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mohan-bhagwat-rss-headquarters-vijayadashami-bangladesh-rg-kar-medical-college-kashmir-israel-hamas-2615731-2024-10-12",
      "headline": "Dharma, not religion, is life and inspiration of India: RSS chief Mohan BhagwatRSS chief Mohan Bhagwat said that the 'Hindu Dharma' is not something newly discovered or created, but something recognised as belonging to all humanity, making it a religion for the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/watch-falguni-pathak-and-fans-create-picturesque-garba-memories-amid-heavy-rain-2615843-2024-10-12",
      "headline": "Watch: Falguni Pathak and fans create picturesque Garba memories amid heavy rainFalguni Pathak was present in Mumbai for a Garba concert when it started raining heavily. However, nothing could stop her and the crowd at the event from enjoying the performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/divya-khossla-kumar-alia-bhatt-jigra-accuses-makers-savi-fake-box-office-numbers-karan-johar-2615893-2024-10-12",
      "headline": "Divya Khossla accuses Alia Bhatt of rigging Jigra box office numbersActor-director Divya Khossla Kumar recently took a dig at Alia Bhatt's latest release Jigra with a post on her Instagram story. This comes amid her claims of Jigra being copied from Savi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-elections-2024-ar-rahman-record-performance-kamala-harris-campaign-2615854-2024-10-12",
      "headline": "AR Rahman records 30-minute performance to back Kamala Harris campaignThe performance will be broadcast on AAPI Victory Fund's YouTube channel on October 13 at 8 pm ET (October 14, 5:30 am IST). It will also air on major South Asian networks like AVS and TV Asia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-meerut-children-narrowly-escape-building-collapse-caught-on-cctv-2615773-2024-10-12",
      "headline": "Caught on CCTV: 2 children narrowly escape building collapse in UP's MeerutThe entire collapse was captured on CCTV, showing the children sensing the danger just in time and running to safety, narrowly avoiding a potential tragedy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-bullet-fired-ludhiana-district-president-of-congress-sanjay-talwar-car-police-probe-2615883-2024-10-12",
      "headline": "Bullet hits Ludhiana Congress leader's car, police probe if it was 'intentional'Ludhiana Congress leader Sanjay Talwar's Toyota Innova, parked outside his home, sustained damage when the bullet hit the side window of the back seat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-woman-killed-hitman-daughter-affair-etah-crime-news-2615795-2024-10-12",
      "headline": "UP woman hires hitman to kill wayward daughter. Then a twistAlka, deeply troubled by her daughter's romantic relationship, had sought Subhash's help to eliminate her daughter. Unbeknownst to her, Subhash was already involved with her daughter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/masaba-gupta-welcomes-baby-girl-husband-satyadeep-mishra-neena-gupta-2615932-2024-10-12",
      "headline": "Masaba Gupta welcomes baby girl with husband Satyadeep MishraFashion designer Masaba Gupta and husband Satyadeep Mishra welcomed their first child, a baby girl, on October 11. Masaba informed with a special post on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/alia-bhatt-jigra-the-unstoppable-force-of-bollywood-2615121-2024-10-12",
      "headline": "Alia Bhatt: The Unstoppable Force of BollywoodWhat makes Alia Bhatt one of the finest performers in India? What kind of legacy is she creating in the film industry? India Today Digital spoke to the filmmakers and actors who have worked with her to understand the phenomenon that she is. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-business-entertainment-sports-425-11-10-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ghaziabad-cop-adopts-newborn-girl-found-abandoned-bushes-2615810-2024-10-12",
      "headline": "Ghaziabad cop adopts newborn girl found abandoned in bushesA newborn baby girl, found abandoned in bushes in Ghaziabad, was rescued and later adopted by Sub-Inspector Pushpendra Singh and his wife.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-chief-mallikarjun-kharge-bjp-party-of-terrorists-after-pm-modi-urban-naxal-remark-2615781-2024-10-12",
      "headline": "BJP a party of terrorists: Congress chief Mallikarjun KhargeCongress President Mallikarjun Kharge sharply rejected Prime Minister Modi's claim that Congress is an \"urban Naxal\" party, accusing the BJP of being a party of terrorists involved in lynchings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/how-instagram-made-charms-a-bigger-flex-than-your-fancy-luxury-bag-2615360-2024-10-12",
      "headline": "How Instagram made charms a bigger flex than your fancy luxury bagExperts suggest that bag charms provide an accessible entry into the world of luxury, as many choose these accessories to add a touch of high-end style to their bags without the hefty price tag."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/parsis-india-sugar-in-milk-story-persia-gujarat-sanjan-hindu-king-ratan-tata-2615043-2024-10-11",
      "headline": "A tale of sugar and milk: How Parsis found a home in IndiaIn the 8th century, a group of Zoroastrians, fleeing persecution in Persia (modern-day Iran), arrived at the coast of Gujarat, seeking refuge. The Indian King of Sanjan allowed the strangers to stay on his land. The migrants promised to blend in, like sugar in milk, which has been the hallmark of their relationship with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-year-end-number-one-ranking-italian-history-shanghai-masters-2615887-2024-10-12",
      "headline": "Jannik Sinner scripts history for Italy, secures year-end No. 1 rank for first timeJannik Sinner scripted history on Saturday, October 12, becoming the first Italian player to secure the year-end No. 1 spot in singles tennis. Sinner reached the final of the Shanghai Masters, beating Tomas Machac in straight sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ajay-jadeja-jam-saheb-nawanagar-jamnagar-shatrusalyasinhji-jamnagar-royal-throne-new-heir-2615736-2024-10-12",
      "headline": "Former cricketer Ajay Jadeja named heir to Jamnagar royal throneFormer cricketer Ajay Jadeja has been named the next Jam Saheb of Jamnagar. Incumbent Jam Saheb Shatrusalyasinhji expressed joy, calling it a blessing for Jamnagar's people. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dussehra-2024-akshay-kumar-priyanka-chopra-kareena-kapoor-shahid-kapoor-celebs-wishes-2615938-2024-10-12",
      "headline": "Dussehra 2024: Akshay Kumar to Priyanka Chopra, celebs extend wishes Akshay Kumar, Priyanka Chopra, Kareena Kapoor and others extended their best wishes on Dussehra. Take a look at their wishes here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/masaba-gupta-welcomes-baby-girl-husband-satyadeep-mishra-neena-gupta-2615932-2024-10-12",
      "headline": "Masaba Gupta welcomes baby girl with husband Satyadeep MishraFashion designer Masaba Gupta and husband Satyadeep Mishra welcomed their first child, a baby girl, on October 11. Masaba informed with a special post on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pics-boney-kapoor-daughter-khushi-inaugurate-sridevi-chowk-in-mumbai-2615930-2024-10-12",
      "headline": "Pics: Boney Kapoor, daughter Khushi inaugurate Sridevi Chowk in Mumbai Boney Kapoor and daughter Khushi Kapoor gave a tribute to late actor Sridevi by launching a road junction in her name. The pictures from the inauguration are now going viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-krushna-abhishek-moved-salman-khan-cooks-feeds-him-bharti-singh-sudesh-lahiri-laughter-chefs-weekend-ka-vaar-2615921-2024-10-12",
      "headline": "BB 18: Krushna Abhishek is moved as Salman Khan cooks food and feeds himIn the first Weekend Ka Vaar episode of Bigg Boss 18, the Laughter Chefs team, featuring Krushna Abhishek, Bharti Singh, and Sudesh Lehri, will engage in a fun task with host Salman Khan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-iphone-15-is-now-available-for-with-rs-27000-discount-but-only-for-limited-time-2615422-2024-10-11",
      "headline": "Apple iPhone 15 is now available for with Rs 27,000 discount, but only for limited time Apple is offering significant discounts on iPhone 15 and iPhone 15 Plus. With offers extending up to Rs 27,000 off. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musks-tesla-humanoid-optimus-says-hardest-part-of-being-a-robot-is-trying-to-be-human-2615330-2024-10-11",
      "headline": "Elon Musk's Tesla humanoid Optimus reveals hardest part of being a robotElon Musk unveiled the latest generation of Tesla's humanoid Optimus at the We, Robot event. While according to Musk, the robots can now do anything, Optimus reveals that the hardest part of being a robot is learning how to be human. Read on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/star-health-insurance-hack-led-to-personal-data-of-31-million-customers-being-compromised-story-in-5-points-2615354-2024-10-11",
      "headline": "Star Health hack led to data leak of 31 million customers: Story in 5 pointsIndia's popular health insurers, Star Health insurance, faced a massive data leak this week, which may have led to the data of 31 million customers being compromised. Here is everything that has happened in the case so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/video/video/how-to-get-new-siri-with-apple-intelligence-in-india-first-look-at-ios-181-more-features-2615301-2024-10-11",
      "headline": "How to get new Siri with Apple Intelligence in India? First look at iOS 18.1 & more featuresApple has released the latest developer Beta for iOS 18.1, showcasing some new features like the new Siri, Writing Tools and more. Watch the video to know more. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aleem-dar-doesnt-deserve-to-be-in-pakistan-selection-committee-basit-ali-2615923-2024-10-12",
      "headline": "Aleem Dar 'doesn't deserve' to be in Pakistan Selection Committee: Basit AliFormer Pakistan cricketer Basit Ali has expressed his disappointment after Aleem Dar's appointment in the Pakistan Cricket Board (PCB) in Selection Committee. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-1-1-vietnam-international-friendly-faruk-choudhary-goal-2615931-2024-10-12",
      "headline": "India hold Vietnam to 1-1 draw after Farukh Choudhary shines on comeback Farouk Choudhary returned to the Indian team after three years and made his comeback count, scoring the equaliser against Vietnam. Manolo Marquez's men recovered from an early mistake to seal a 1-1 draw away from home in the international friendly match on Saturday, October 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-3rd-t20i-harshit-rana-ravi-bishnoi-arshdeep-singh-suryakumar-yadav-2615928-2024-10-12",
      "headline": "IND vs BAN: Viral infection ends Harshit Rana's hopes for India debut in 3rd T20IYoung India seamer Harshit Rana missed out on his India debut as he got infected with a viral infection ahead of the third T20I against Bangladesh in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-sri-lanka-amelia-kerr-sophie-devine-report-sharjah-2615920-2024-10-12",
      "headline": "New Zealand hammer Sri Lanka, pile up pressure on India in semis raceWomen's T20 World Cup 2024: Sophie Devine's New Zealand took a step closer to a berth in the semi-final after beating Chamari Athapaththu's Sri Lanka by eight wickets on Saturday in Sharjah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-year-end-number-one-ranking-italian-history-shanghai-masters-2615887-2024-10-12",
      "headline": "Jannik Sinner scripts history for Italy, secures year-end No. 1 rank for first timeJannik Sinner scripted history on Saturday, October 12, becoming the first Italian player to secure the year-end No. 1 spot in singles tennis. Sinner reached the final of the Shanghai Masters, beating Tomas Machac in straight sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-has-got-shots-of-both-joe-root-and-kevin-pietersen-says-james-anderson-2615884-2024-10-12",
      "headline": "Harry Brook has got shots of both Joe Root and Kevin Pietersen: James AndersonFormer England fast bowler James Anderson feels England youngster Harry Brook is the perfect mix of Joe Root and Kevin Pietersen. Brook recently became the sixth England batter to score a triple hundred in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-alyssa-healy-tayla-vlaeminck-press-conference-2615878-2024-10-12",
      "headline": "Alyssa Healy to miss India clash? Australia coach updates on captain's injuryWomen's T20 World Cup 2024: Australia head coach Shelley Nitschke shared an update on Alyssa Healy and Tayla Vlaeminck after the duo suffered injuries before the clash against India on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-performance-locality-team-criticism-kamran-akmal-england-loss-personal-milestones-2615874-2024-10-12",
      "headline": "Pakistan played like a locality team: Kamran Akmal says after England lossKamran Akmal lambasted Pakistan's Test side after their crushing defeat to England in Multan, comparing their performance to a \"locality team\" and accusing players of prioritizing personal glory over the team's success."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-shreyas-iyer-failure-mumbai-baroda-jagadeesan-tamil-nadu-saurashtra-2615869-2024-10-12",
      "headline": "Shreyas Iyer fails vs Baroda, N Jagadeesan hits hundred vs SaurashtraRanjI Trophy 2024-25: Shreyas Iyer began his season on a poor note, getting out for 0 in Mumbai's first innings against Baroda. Narayan Jagadeesan led Tamil Nadu's strong show against Saurashtra. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-year-end-number-one-ranking-italian-history-shanghai-masters-2615887-2024-10-12",
      "headline": "Jannik Sinner scripts history for Italy, secures year-end No. 1 rank for first timeJannik Sinner scripted history on Saturday, October 12, becoming the first Italian player to secure the year-end No. 1 spot in singles tennis. Sinner reached the final of the Shanghai Masters, beating Tomas Machac in straight sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-has-got-shots-of-both-joe-root-and-kevin-pietersen-says-james-anderson-2615884-2024-10-12",
      "headline": "Harry Brook has got shots of both Joe Root and Kevin Pietersen: James AndersonFormer England fast bowler James Anderson feels England youngster Harry Brook is the perfect mix of Joe Root and Kevin Pietersen. Brook recently became the sixth England batter to score a triple hundred in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-alyssa-healy-tayla-vlaeminck-press-conference-2615878-2024-10-12",
      "headline": "Alyssa Healy to miss India clash? Australia coach updates on captain's injuryWomen's T20 World Cup 2024: Australia head coach Shelley Nitschke shared an update on Alyssa Healy and Tayla Vlaeminck after the duo suffered injuries before the clash against India on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-performance-locality-team-criticism-kamran-akmal-england-loss-personal-milestones-2615874-2024-10-12",
      "headline": "Pakistan played like a locality team: Kamran Akmal says after England lossKamran Akmal lambasted Pakistan's Test side after their crushing defeat to England in Multan, comparing their performance to a \"locality team\" and accusing players of prioritizing personal glory over the team's success."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-shreyas-iyer-failure-mumbai-baroda-jagadeesan-tamil-nadu-saurashtra-2615869-2024-10-12",
      "headline": "Shreyas Iyer fails vs Baroda, N Jagadeesan hits hundred vs SaurashtraRanjI Trophy 2024-25: Shreyas Iyer began his season on a poor note, getting out for 0 in Mumbai's first innings against Baroda. Narayan Jagadeesan led Tamil Nadu's strong show against Saurashtra. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-and-rohit-sharma-are-not-in-their-prime-says-sanjay-manjrekar-2615863-2024-10-12",
      "headline": "Virat Kohli and Rohit Sharma are not in their prime: Sanjay ManjrekarFormer India cricketer Sanjay Manjrekar feels Indian batting stars Rohit Sharma and Virat Kohli have past their prime in Test cricket. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-sinalo-jafta-alcoholism-arrogant-selfish-2615852-2024-10-12",
      "headline": "I was arrogant and selfish: South Africa's Jafta on fighting alcoholismWomen's T20 World Cup 2024: South African wicketkeeper Sinalo Jafta recalled the times when she was an alcoholic and had joined a rehab centre in 2022 to recover. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkars-test-cricket-most-runs-joe-roots-mind-2615845-2024-10-12",
      "headline": "Sachin Tendulkar's Test record on Joe Root's mind? Batter respondsEngland batter Joe Root is steadily rising the ladder of most runs scored in Test cricket. Root was asked if Sachin Tendulkar's record was in his mind, Root replied he had no idea how many runs he was off Tendulkar, but said that he knew it was quite far away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-auction-players-announcement-harmanpreet-singh-manpreet-singh-2615840-2024-10-12",
      "headline": "550 Indian players to be auctioned for Hockey India League's new seasonThe much-anticipated return of the Hockey India League is set to begin with the Men's Auction, featuring 400 domestic and 150 overseas players, promising thrilling competition as franchises build their squads with a Rs 4 crore budget each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-dsp-telangana-revanth-reddy-2615836-2024-10-12",
      "headline": "Cricketer Mohammed Siraj assumes charge as DSP in TelanganaIndia cricketer Mohammed Siraj assumed the role of the Deputy Superintendent of Police in Telangana on Saturday, October 12.  Telangana Chief Minister Revanth Reddy had promised that the fast bowler would be granted a Group-I government position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-vietnam-football-friendly-livestreaming-telecast-tv-channel-2615799-2024-10-12",
      "headline": "India vs Vietnam live-streaming: When and where to watch the matchIndia and Vietnam, both winless this season, face a crucial clash on October 12, hoping to salvage their dismal 2024 campaigns and break their respective losing streaks in a match that's more than just a friendly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-india-vs-australia-sharjah-dessert-storm-knock-sachin-tendulkar-2615794-2024-10-12",
      "headline": "India draw inspiration from Sachin's 'dessert storm knock'The Indian women's team is drawing inspiration from Sachin Tendulkar's 'Dessert Storm' knock. India are in a tough position and need to beat Australia to stay in the hunt for the semi-final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-dsp-telangana-revanth-reddy-2615836-2024-10-12",
      "headline": "Cricketer Mohammed Siraj assumes charge as DSP in TelanganaIndia cricketer Mohammed Siraj assumed the role of the Deputy Superintendent of Police in Telangana on Saturday, October 12.  Telangana Chief Minister Revanth Reddy had promised that the fast bowler would be granted a Group-I government position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-vietnam-football-friendly-livestreaming-telecast-tv-channel-2615799-2024-10-12",
      "headline": "India vs Vietnam live-streaming: When and where to watch the matchIndia and Vietnam, both winless this season, face a crucial clash on October 12, hoping to salvage their dismal 2024 campaigns and break their respective losing streaks in a match that's more than just a friendly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-india-vs-australia-sharjah-dessert-storm-knock-sachin-tendulkar-2615794-2024-10-12",
      "headline": "India draw inspiration from Sachin's 'dessert storm knock'The Indian women's team is drawing inspiration from Sachin Tendulkar's 'Dessert Storm' knock. India are in a tough position and need to beat Australia to stay in the hunt for the semi-final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manu-bhaker-lakme-fashion-week-ramp-walk-air-gun-pose-watch-viral-video-2615778-2024-10-12",
      "headline": "Watch: Manu Bhaker walks the ramp at Lakme Fashion Week, hits air-gun poseOlympic medallist Manu Bhaker stunned at Lakme Fashion Week in Delhi, captivating audiences with her stylish walk for Marks & Spencer while embracing her sports identity through a viral air-gun pose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/olympiad-gold-medallist-vantika-now-aims-for-grandmaster-title-2615777-2024-10-12",
      "headline": "Olympiad gold-medallist Vantika now aims for Grandmaster titleChess Olympiad gold medallist Vantika Agrawal has set her next goal. Speaking to PTI, Vantika said that her aim is to become a Grand Master."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ajay-jadeja-jam-saheb-nawanagar-jamnagar-shatrusalyasinhji-jamnagar-royal-throne-new-heir-2615736-2024-10-12",
      "headline": "Former cricketer Ajay Jadeja named heir to Jamnagar royal throneFormer cricketer Ajay Jadeja has been named the next Jam Saheb of Jamnagar. Incumbent Jam Saheb Shatrusalyasinhji expressed joy, calling it a blessing for Jamnagar's people. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-new-hairstyle-side-fade-long-hair-goodbye-aleem-hakim-2615764-2024-10-12",
      "headline": "MS Dhoni bids goodbye to long hair with new side-fade hairstyleMS Dhoni's new side-fade hairstyle has once again captivated his massive fanbase, as celebrity stylist Aalim Hakim revealed the look online, bringing excitement to fans who recently saw Dhoni revisit his long-hair look in IPL 2024."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}