{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-may-replace-compensation-cess-with-new-levies-july-meeting-2743163-2025-06-19",
      "headline": "GST Council may replace compensation cess with 2 new levies: ReportIf approved, the dual cess structure could redefine how India funds health and green goals, but only if the Centre and states agree on who pays, who gains, and who decides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-gold-loan-rules-cash-flow-assessment-nbfc-challenges-stricter-ltv-norms-2743130-2025-06-19",
      "headline": "Explained: How India's new gold loan rules will impact lendersThe RBI's directive requires a move towards cash flow-based credit assessments. This means lenders must go beyond just considering the gold's value as collateral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-ends-83-points-lower-nifty-below-24800-adani-ports-down-3-percent-titan-mahindra-2743129-2025-06-19",
      "headline": "Sensex ends 83 points lower, Nifty below 24,800; Adani Ports down 3%The S&P BSE Sensex was down by 82.79 points to end at 81,361.87, while the NSE Nifty50 lost 18.80 points to close at 24,793.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rice-prices-india-rise-global-demand-weaker-rupee-boost-exports-2743123-2025-06-19",
      "headline": "India's rice exports gain edge as Vietnam, Thailand face subdued markets: ReportIndia's rice supply remains strong, with government reserves reported at 59.5 million metric tonnes as of June 1. This figure is over four times the official target for July, highlighting the country's substantial rice stockpile. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/oswal-pumps-ipo-oversubscribed-strong-listing-gains-expected-stock-market-debut-latest-gmp-2743119-2025-06-19",
      "headline": "Oswal Pumps IPO listing: Will it make a bumper debut? Check latest GMPOswal Pumps is set to debut on Dalal Street on June 19 with high investor expectations. The IPO of Oswal Pumps was oversubscribed by more than 34 times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karnataka-it-sector-techies-12-hour-working-shifts-state-government-andhra-report-2743077-2025-06-19",
      "headline": "Karnataka plans 10-hour days for tech sector employees: ReportAt present, Section 7 of the Karnataka Shops and Commercial Establishments Act, 1961, limits working hours to nine per day, and allows a maximum of 10 hours of overtime in three months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/savings-accounts-fixed-deposits-lose-value-inflation-outpaces-interest-india-2743044-2025-06-19",
      "headline": "Your savings account is quietly robbing you, says financial advisorFinancial advisor Lovish Anand has issued a sharp reality check for Indian savers in a recent LinkedIn post titled: \"Your Savings Account Is Quietly Robbing You.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/insurance-claim-rejection-india-policyholders-agony-18-percent-gst-premium-rising-health-term-life-hospitals-2742586-2025-06-19",
      "headline": "Insured, but at what cost?Hospitals are turning into battlegrounds over pending claims, with policyholders watching their premiums shoot up faster than their salaries. Insurance is no longer the comforting shield it once was."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-70-lakh-salary-no-longer-guarantees-financial-comfort-in-indian-metros-2742911-2025-06-19",
      "headline": "Is Rs 70 lakh per annum the new middle class? Investment banker explainsAre urban professionals struggling even with Rs 70 lakh income per year? A Gurugram-based investment banker breaks down where the money really goes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-flat-nifty-below-24800-tech-mahindra-shares-down-1-2742909-2025-06-19",
      "headline": "Sensex opens flat, Nifty below 24,800; Tech Mahindra shares down 1%The S&P BSE Sensex was down by 225.26 points to 81,219.40, while the NSE Nifty50 lost 56.75 points to 24,755.30 as of 9:21 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-june-19-crash-us-fed-rate-cut-stable-iran-israel-conflict-2742895-2025-06-19",
      "headline": "Stock market opening: Will Sensex, Nifty crash today over US Fed rate cut news?Gift Nifty futures were trading at 24,782 as of 8:23 am, which suggests that Nifty50 might open below Tuesday's closing level of 24,812.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-layoffs-tech-giant-cut-thousands-jobs-sales-ai-workforce-reduction-report-2742884-2025-06-19",
      "headline": "Microsoft to cut thousands of jobs in sales: ReportThe latest round of layoffs follows Microsoft's earlier job cuts in May, which impacted around 6,000 workers across various departments."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-kareena-kapoor-saif-ali-khan-sunjay-kapur-funeral-in-delhi-2743269-2025-06-19",
      "headline": "Karisma Kapoor, Kareena-Saif at Sunjay Kapur's funeral in DelhiKarisma Kapoor, along with sister Kareena and Saif Ali Khan, were clicked at Lodhi crematorium in New Delhi for Sunjay Kapur's funeral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-avoid-paps-at-mumbai-airport-2743249-2025-06-19",
      "headline": "Vijay Deverakonda, Rashmika avoid paps as they arrive together at airport. WatchActors Vijay Deverakonda and Rashmika Mandanna avoided paparazzi as they returned to Mumbai on June 19. A video of the two exiting airport has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sonali-bendre-says-pati-patni-aur-panga-is-like-a-page-of-my-marriage-2743242-2025-06-19",
      "headline": "Host Sonali Bendre says Pati, Patni Aur Panga is like a page of my marriageSonali Bendre is making a comeback as a TV host for the upcoming reality show 'Pati, Patni Aur Panga', featuring real-life celebrity couples in fun relationship challenges. Calling it a reflection of her own marriage, she said the show celebrates everyday moments that make love real."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-on-working-equation-with-husband-ajay-devgn-we-are-not-civilised-2743203-2025-06-19",
      "headline": "Kajol on working equation with husband Ajay Devgn: We are not civilisedKajol opened up about working with husband Ajay Devgn, sharing how they openly call each other out on set but never cross boundaries. She also said she keeps a polite and professional attitude while shooting to maintain a comfortable work environment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-to-reunite-with-hi-nanna-director-shouryuv-for-pan-india-rom-com-2743180-2025-06-19",
      "headline": "Nani to reunite with Hi Nanna director Shouryuv for pan-India rom-com: ReportNani is set to reunite with 'Hi Nanna' director Shouryuv for a light-hearted romantic comedy. The shooting for the film is expected to begin in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/justin-baldoni-acquires-rights-blake-lively-and-taylor-swift-chats-2743142-2025-06-19",
      "headline": "Justin Baldoni acquires rights to read Blake Lively-Taylor Swift's private chatsIn a recent development in the 'It Ends With Us' row, actor-filmmaker Justin Baldoni acquired the rights to access messages between actor Blake Lively and her singer friend Taylor Swift. Here's what it means.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/dna-movie-review-atharvaa-nimisha-sajayan-nelson-venkatesan-film-neat-thriller-with-few-unwanted-detours-2743173-2025-06-19",
      "headline": "DNA review: Atharvaa-Nimisha's film is a smart thriller with few unwanted detoursReleased-Fri Jun 20, 2025DNA movie review: Director Nelson Venkatesan's film, starring Atharvaa and Nimisha Sajayan, is a neatly crafted thriller about organised crime. The film boasts enough thrills with a few unwanted detours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-calls-hyderabads-ramoji-film-city-haunted-leaves-internet-divided-2743178-2025-06-19",
      "headline": "Kajol calls Hyderabad's Ramoji Film City haunted, leaves internet dividedKajol's remarks about Ramoji Film City being haunted have stirred controversy among Hyderabadis and internet users. While some dismiss it as superstition, others recall similar spooky experiences at the iconic film studio."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/madonna-reacts-to-ties-with-pope-leo-xiv-jolie-bieber-also-among-his-relatives-2743070-2025-06-19",
      "headline": "Madonna reacts to ties with Pope Leo XIV; Jolie, Bieber also among his relativesSinger-songwriter Madonna responded to a recent report suggesting she is related to Pope Leo XIV. The report also mentioned that several other celebrities have ties to the Vatican."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ahmed-khan-cites-pahalgam-attack-kashmir-schedule-for-welcome-to-the-jungle-delay-2743166-2025-06-19",
      "headline": "Ahmed Khan cites Pahalgam attack, Kashmir schedule for Welcome to the Jungle delay'Welcome to The Jungle' director Ahmed Khan clarified that they were scheduled to shoot in Kashmir this month, but had to let go of the location in the aftermath of the Pahalgam attack. His statement came when several reports suggested financial issues as the reason behind the delay in the film's shooting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-praises-meiyazhagan-emotional-drama-favourite-film-decade-2743136-2025-06-19",
      "headline": "Nani calls Meiyazhagan absolute beauty, one of his favourite films of the decadeActor Nani calls 'Meiyazhagan' an absolute beauty and one of his favourite films of the decade. The film's emotional depth and personal storytelling have left a lasting impact on him amidst big-budget cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mannara-chopra-pays-final-respect-to-her-father-holds-his-photo-close-at-prayer-meet-2743140-2025-06-19",
      "headline": "Mannara Chopra pays final respect to her father, holds his photo close at prayer meetThe prayer meet for Mannara Chopra's father was held on Thursday. The actor appeared heartbroken as she held his photo close while the family visited a Gurudwara for the ceremony.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-i-knew-thugs-of-hindostan-would-fail-but-aditya-chopra-didnt-agree-2743139-2025-06-19",
      "headline": "I knew Thugs of Hindostan would fail but Aditya Chopra didn't agree: Aamir KhanAamir Khan recalls telling Aditya Chopra that their film 'Thugs of Hindostan' needed changes for it to work for the audience, but none of them agreed with his feedback. The actor explains what went wrong with the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rukmini-vasanth-tiger-tiger-burning-brightcaption-sparks-jr-ntr-neel-collab-rumours-2743098-2025-06-19",
      "headline": "Actor Rukmini Vasanth's \"Tiger Tiger...\" caption sparks collab rumours with Jr NTRDirector Prashanth Neel's upcoming film, tentatively titled 'NTR-Neel', starring Jr NTR is yet to reveal the rest of the cast. Ahead of this, an Instagram post by actor Rukmini Vasanth has gone viral for its caption, \"Tiger Tiger Burning Bright\", sparking rumours of her casting in the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/multiplex-owners-call-aamir-khan-visionary-theatre-only-release-sitaare-zameen-par-2743074-2025-06-19",
      "headline": "Multiplex owners call Aamir visionary for theatre-only release of Sitaare Zameen ParActor Aamir Khan was praised by the Multiplex Association of India (MAI) for the theatre-only release of 'Sitaare Zameen Par'. The multiplex owners emphasised Aamir's bold move and his belief in the magic of cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-rajkummar-rao-play-ujjwal-nikam-film-2611-report-2743086-2025-06-19",
      "headline": "Not Aamir Khan, Rajkummar Rao to play Ujjwal Nikam in film on 26/11: ReportMaddock Films is not producing a biopic on public prosecutor Ujjwal Nikam. Rajkummar Rao has been roped in to play the lead in the upcoming project. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-cant-take-his-eyes-off-wife-sobhita-as-she-enjoys-dosa-2743106-2025-06-19",
      "headline": "Naga Chaitanya can't take his eyes off wife Sobhita as she enjoys dosaA video of Naga Chaitanya and Sobhita Dhulipala from Akhil Akkineni's wedding is going viral on social media. In the clip, Sobhita is seen enjoying the delicacies, while her husband looks completely smitten."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-on-his-father-tough-love-his-ring-left-marks-on-our-faces-2743094-2025-06-19",
      "headline": "Aamir Khan on his father's tough love: His ring left marks on our facesAamir Khan opened up about his relationship with his parents, sharing that while his mother was always loving and calm, his bond with his father was more complex. However, he added that with time, they found peace before his father's death in 2010."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saira-banu-remembers-mother-naseem-banu-on-her-death-anniversary-2743066-2025-06-19",
      "headline": "Saira Banu remembers mother Naseem Banu on her death anniversaryVeteran actor Saira Banu paid an emotional tribute to her late mother, Naseem Banu, calling her the first female superstar and a guiding force in her life. She remembered her mother's strength, timeless beauty, and the deep cultural values she instilled in the family."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/justice-yashwant-varma-unnatural-conduct-staff-cash-residence-inquiry-panel-report-2743152-2025-06-19",
      "headline": "Cash row: These 'unnatural' behaviours of judge caught probe panel's attentionThe inquiry committee has found serious misconduct on the part of Justice Yashwant Varma, from whose residence a huge cash pile was found when a fire broke out there on March 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-not-invited-campaign-nilambur-bypoll-differences-congress-leadership-downplays-rift-2743122-2025-06-19",
      "headline": "Shashi Tharoor admits differences with Congress leadership amid campaign snubSenior Congress leader Shashi Tharoor said that while there are occasional differences with the party leadership, these issues should be resolved internally. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-black-box-ahmedabad-london-decoding-location-decision-soon-2743229-2025-06-19",
      "headline": "Location for decoding crashed Air India plane's black box to be decided: GovernmentThe government said it would take a call on the location regarding the decoding of the black box of the doomed Air India plane in Ahmedabad after a thorough assessment from all angles by the AAIB."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-updates-tehran-under-attack-operation-rising-lion-tel-aviv-missile-attack-donald-trump-ceasefire-nuclear-deal-2742822-2025-06-19",
      "headline": "Live: Netanyahu doesn't rule out Khamenei's elimination, says all options openIsrael-Iran Conflict Live Updates: Israel and Iran continued to launch several missiles at each other for the seventh consecutive day. In a live address, Iran's Supreme Leader Ali Khamenei declared that the nation remains united and will not bow to external pressure. Responding to US President Donald Trump's call for Iran to surrender, Khamenei issued a stern warning that any American military strike would lead to \"serious irreparable consequences\". Trump, on whether the US will attack Iran, said, \"I may do it, I may not do it. I mean, nobody knows what I'm going to do.\" Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/this-gulf-war-will-boomerang-iran-israel-conflict-trump-pakistan-army-chief-asim-munir-2743254-2025-06-19",
      "headline": "This Gulf War will BoomerangThe new Gulf war is a boomerang with worse aim than a drunk dart player and, like every misadventure from Kabul to Baghdad, is a masterclass in shooting your own foot while aiming for the moon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-must-grin-and-bear-trump-us-is-bigger-than-one-mans-ego-2743207-2025-06-19",
      "headline": "India must grin and bear Trump, US is bigger than one man's egoTrump has once again proved he is deaf to facts and blind to reality in claiming US credit for the India-Pakistan ceasefire. He seemingly twisted the knife with his 'I love Pakistan' comment soon after meeting Asim Munir. It's a red flag for Indian diplomacy, and for now, India must swallow this bitter pill. Because Trump is temporary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/after-bengaluru-stadium-stampede-karnataka-proposes-crowd-law-jail-term-fine-2743205-2025-06-19",
      "headline": "3-year jail term, Rs 5,000 fine: Karnataka proposes crowd control lawIn the wake of the tragic stampede during the RCB victory celebrations that claimed 11 lives, the Karnataka government has proposed a new legislation, Karnataka Crowd Control Bill, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/what-price-is-pakistan-field-marshal-munir-paying-for-free-lunch-with-trump-2743072-2025-06-19",
      "headline": "What price is Pakistan's Field Marshal Munir paying for free lunch with Trump?Asim Munir wasn't the only one doing the signalling post-Operation Sindoor. PM Modi also ended weeks of avoiding a showdown with Trump, who had been taking credit for the ceasefire between India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anderson-tendulkar-trophy-india-england-test-series-unvelied-photos-2743198-2025-06-19",
      "headline": "Anderson-Tendulkar Trophy unveiled as legends pose with new silverwareSachin Tendulkar and James Anderson unveiled the new 'Anderson-Tendulkar Trophy' for the India-England Test series. The trophy replaces the Pataudi Trophy, marking a new era in the cricket rivalry between the two nations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/jagan-mohan-reddy-faces-backlash-for-supporting-violent-pushpa-2-dialogue-by-ysrcp-supporter-andhra-cm-slams-remarks-2743234-2025-06-19",
      "headline": "Jagan Reddy under fire for backing party supporter's violent Pushpa 2 dialogueFormer Andhra Pradesh chief minister YS Jagan Mohan Reddy's comment referencing a supporter's violent metaphor from the film Pushpa 2 has sparked political backlash. Chief Minister Chandrababu Naidu called it a dangerous precedent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindhu-after-iran-india-to-evacuate-nationals-from-israel-amid-escalating-middle-east-tensions-2743238-2025-06-19",
      "headline": "Operation Sindhu: After Iran, India begins evacuation of nationals from IsraelAfter Iran, the government, under Operation Sindhu, will now begin the evacuation of Indian nationals from Israel amid escalating tensions in the Middle East."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/is-chatgpt-making-us-dumb-mit-study-says-students-are-using-their-brains-less-2743250-2025-06-19",
      "headline": "Is ChatGPT making us dumb? MIT study says students are using their brains lessA new study suggests that AI tools like ChatGPT can gradually impact our ability to learn and quickly analyse information. This is because they essentially allow humans to do certain tasks without using a lot of their brain power or thinking. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/justin-baldoni-acquires-rights-blake-lively-and-taylor-swift-chats-2743142-2025-06-19",
      "headline": "Justin Baldoni acquires rights to read Blake Lively-Taylor Swift's private chatsIn a recent development in the 'It Ends With Us' row, actor-filmmaker Justin Baldoni acquired the rights to access messages between actor Blake Lively and her singer friend Taylor Swift. Here's what it means.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sharad-pawar-ajit-pawar-malegaon-sugar-factory-baramati-election-prestige-battle-2743183-2025-06-19",
      "headline": "Sharad Pawar and Ajit to lock horns in sugar mill poll, make it prestige battleAjit Pawar, who is contesting a cooperative sugar mill election after 40 years, has declared that he would become the chairperson if he won the Malegaon Co-operative Sugar Factory poll."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-defence-minister-israel-katz-threatens-iran-supreme-leadre-ayatollah-ali-khamenei-cannot-exist-hospital-attack-2743177-2025-06-19",
      "headline": "Khamenei can't be allowed to exist, Israeli minister fumes after fresh strikesIsrael's Defence Minister threatened Iran's Supreme Leader after missile strikes injured civilians and hit a major hospital. In retaliation, Israel targeted Iran's nuclear facilities, escalating regional tensions.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/dimona-israel-iran-nuclear-power-strikes-attack-khamenei-benjamin-netanyahu-negev-nuclear-research-centre-2742708-2025-06-19",
      "headline": "Inside Dimona: The secretive core of Israel's nuclear powerEven as Israel keeps its own nuclear arsenal shrouded in secrecy, it is actively striking targets linked to Iran, citing Tehran's advancing nuclear research as justification. Meanwhile, satellite imagery over the past five years has revealed major construction at Israel's Dimona facility, with experts suggesting upgrades or even the possible building of a new reactor to boost plutonium production."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/chilli-oil-is-the-pantrys-new-it-girl-and-achaar-might-be-jealous-2742940-2025-06-19",
      "headline": "Chilli Oil is the pantry's new 'it girl', and achaar might be jealousFrom our favourite Asian restaurants to our home kitchens, there's a new condiment quickly becoming indispensable: chilli oil.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/asim-munir-trump-lunch-pakistan-zia-ul-had-musharraf-us-dictators-2742855-2025-06-19",
      "headline": "Zia-Musharraf-Munir: Why the US needs Pakistan's dictatorsA 1947 British war memo shows why Pakistan, not India, suited post-imperial interests — creating a pliant state on Soviet, Iranian, and Arabian frontiers. In 2025, that logic still holds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hope-munir-got-food-for-thought-us-doesnt-forget-bin-laden-episode-says-shashi-tharoor-on-pak-general-meeting-donald-trump-2743175-2025-06-19",
      "headline": "Hope he got some food for thought too: Tharoor on Pak's Munir meeting TrumpCongress MP Shashi Tharoor took a dig at Pakistan Army chief Asim Munir's meeting with US President Trump, urging the US to remember Pakistan's terror links and the Osama bin Laden episode. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/dna-movie-review-atharvaa-nimisha-sajayan-nelson-venkatesan-film-neat-thriller-with-few-unwanted-detours-2743173-2025-06-19",
      "headline": "DNA review: Atharvaa-Nimisha's film is a smart thriller with few unwanted detoursReleased-Fri Jun 20, 2025DNA movie review: Director Nelson Venkatesan's film, starring Atharvaa and Nimisha Sajayan, is a neatly crafted thriller about organised crime. The film boasts enough thrills with a few unwanted detours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/sorry-dad-science-says-mom-is-the-smart-one-2743067-2025-06-19",
      "headline": "Sorry Dad, science says mom is the smart oneScience shows moms pass on more than just good looks - they pass on intelligence, too"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/just-a-scratch-elon-musk-after-starship-blast-rocks-spacex-base-2743204-2025-06-19",
      "headline": "Elon Musk reacts after SpaceX's Starship goes up in flamesVideo footage captured by observers showed a massive fireball erupting from the test stand, with debris scattering across the site. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-canada-thaw-ties-pm-modi-donald-trump-pakistan-army-chief-asim-munir-meeting-2742990-2025-06-19",
      "headline": "For India, Canada looks friendlier than the US at this pointIndia-Canada-US ties: PM Modi's decision to subtly decline Donald Trump's invite was not only strategically significant but also emblematic of the widening trust deficit between the nations. It came as India and Canada quietly signalled a thaw in their two-year-long diplomatic freeze."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-films-are-school-of-perfectionism-one-lesson-at-a-time-sitaare-zameen-par-release-2742006-2025-06-19",
      "headline": "How Aamir Khan's films are school of perfectionism, one lesson at a timeWith the release of 'Sitaare Zameen Par' on June 20, Aamir Khan returns as Bollywood's beloved moral science teacher. His films are known for blending entertainment with meaningful life lessons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-kareena-kapoor-saif-ali-khan-sunjay-kapur-funeral-in-delhi-2743269-2025-06-19",
      "headline": "Karisma Kapoor, Kareena-Saif at Sunjay Kapur's funeral in DelhiKarisma Kapoor, along with sister Kareena and Saif Ali Khan, were clicked at Lodhi crematorium in New Delhi for Sunjay Kapur's funeral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-avoid-paps-at-mumbai-airport-2743249-2025-06-19",
      "headline": "Vijay Deverakonda, Rashmika avoid paps as they arrive together at airport. WatchActors Vijay Deverakonda and Rashmika Mandanna avoided paparazzi as they returned to Mumbai on June 19. A video of the two exiting airport has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-on-working-equation-with-husband-ajay-devgn-we-are-not-civilised-2743203-2025-06-19",
      "headline": "Kajol on working equation with husband Ajay Devgn: We are not civilisedKajol opened up about working with husband Ajay Devgn, sharing how they openly call each other out on set but never cross boundaries. She also said she keeps a polite and professional attitude while shooting to maintain a comfortable work environment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-to-reunite-with-hi-nanna-director-shouryuv-for-pan-india-rom-com-2743180-2025-06-19",
      "headline": "Nani to reunite with Hi Nanna director Shouryuv for pan-India rom-com: ReportNani is set to reunite with 'Hi Nanna' director Shouryuv for a light-hearted romantic comedy. The shooting for the film is expected to begin in 2026."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-captaincy-sachin-tendulkar-2743272-2025-06-19",
      "headline": "Don't worry about outside noise: Tendulkar tells India captain GillSachin Tendulkar told Shubman Gill to forget about outside noise and back the decisions he would make ahead of his first Test match as the captain of the Indian team. Gill will start his tenure with the Headingley Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-shubman-gill-press-leeds-ipl-trophy-bigger-2743251-2025-06-19",
      "headline": "Winning Test series in England bigger than lifting IPL trophy: Shubman GillIndia tour of England: Newly-appointed captain Shubman Gill stressed the importance of Test cricket, adding that his job will be to create a secure and positive dressing room. Gill remained guarded, not willing to reveal the team's combination on the eve of the first Test at Headingley, Leeds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-virat-kohli-rohit-sharma-advice-headingley-2743233-2025-06-19",
      "headline": "Gill reveals advice from Kohli and Rohit for England Test challengeShubman Gill said that he had chats with Virat Kohli and Rohit Sharma during the IPL to get ready for the England tour. Gill is set to lead India in the new era after Rohit and Kohli's retirement from Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/nico-williams-fc-barcelona-verbal-agreement-transfer-salary-cap-2743226-2025-06-19",
      "headline": "Nico Williams and Barcelona reach verbal deal, salary talks remain: ReportsBarcelona have reportedly secured a six-year agreement with Nico Williams, signaling a major summer coup. The Spain international is now expected to form a lethal wide pairing with Lamine Yamal under new manager Hansi Flick."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-sachin-tendulkar-shubman-gill-headingley-2743218-2025-06-19",
      "headline": "Sachin Tendulkar's 3-point advice to Indian team before start of England seriesSachin Tendulkar gave some advice to the Indian team and pointed out the three key factors they should keep in mind ahead of the first Test against England, starting from Friday, June 20. India are set to start a new era under Shubman Gill's captaincy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-ben-stokes-still-trouble-without-virat-kohli-rohit-sharma-2743214-2025-06-19",
      "headline": "India a tough challenge without even Virat Kohli and Rohit Sharma: Ben StokesEngland captain Ben Stokes downplayed the absence of India's senior stars, warning that the visitors remain a strong side ahead of the five-Test series under new skipper Shubman Gill, with Jasprit Bumrah leading the bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anderson-tendulkar-trophy-india-england-test-series-unvelied-photos-2743198-2025-06-19",
      "headline": "Anderson-Tendulkar Trophy unveiled as legends pose with new silverwareSachin Tendulkar and James Anderson unveiled the new 'Anderson-Tendulkar Trophy' for the India-England Test series. The trophy replaces the Pataudi Trophy, marking a new era in the cricket rivalry between the two nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-ollie-pope-jacob-bethell-ben-stokes-press-conference-2743188-2025-06-19",
      "headline": "What gave Ollie Pope the edge over Jacob Bethell in No.3 race? Ben Stokes revealsEngland captain Ben Stokes explained the key factor that gave Ollie Pope the edge over Jacob Bethell in the race for the No.3 spot for the first Test against India. Pope scored 171 in his last knock against Zimbabwe during the one-off Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-shubman-gill-captaincy-ravi-shastri-headingley-2743159-2025-06-19",
      "headline": "Take your time: Gill gets advice from Shastri ahead of captaincy bowFormer India coach Ravi Shastri had some key advice for Shubman Gill ahead of his first match as the captain of the Indian Test team. Gill is taking over from Rohit Sharma as the skipper of the Indian Test team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-pataudi-trophy-india-england-series-test-2743132-2025-06-19",
      "headline": "Pataudi legacy must live on: Sachin Tendulkar on renaming IND vs ENG trophyIndia and England have contested the 'Pataudi Trophy' since 2007. However, starting from the 2025 series, the trophy has been rebranded as the 'Anderson–Tendulkar Trophy'. The batting great has responded to the name change, which has sparked debate within the cricketing community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-final-rcb-vs-pbks-most-watched-t20-match-ever-jiohotstar-2743134-2025-06-19",
      "headline": "RCB's maiden title win makes IPL 2025 final most-watched T20 matchThe IPL 2025 final between RCB and Punjab Kings made history, becoming the most-watched T20 match ever as Royal Challengers Bengaluru lifted their first title after 18 years, setting massive records across TV and digital platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anderson-tendulkar-trophy-india-england-test-series-unvelied-photos-2743198-2025-06-19",
      "headline": "Anderson-Tendulkar Trophy unveiled as legends pose with new silverwareSachin Tendulkar and James Anderson unveiled the new 'Anderson-Tendulkar Trophy' for the India-England Test series. The trophy replaces the Pataudi Trophy, marking a new era in the cricket rivalry between the two nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-ollie-pope-jacob-bethell-ben-stokes-press-conference-2743188-2025-06-19",
      "headline": "What gave Ollie Pope the edge over Jacob Bethell in No.3 race? Ben Stokes revealsEngland captain Ben Stokes explained the key factor that gave Ollie Pope the edge over Jacob Bethell in the race for the No.3 spot for the first Test against India. Pope scored 171 in his last knock against Zimbabwe during the one-off Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-shubman-gill-captaincy-ravi-shastri-headingley-2743159-2025-06-19",
      "headline": "Take your time: Gill gets advice from Shastri ahead of captaincy bowFormer India coach Ravi Shastri had some key advice for Shubman Gill ahead of his first match as the captain of the Indian Test team. Gill is taking over from Rohit Sharma as the skipper of the Indian Test team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-pataudi-trophy-india-england-series-test-2743132-2025-06-19",
      "headline": "Pataudi legacy must live on: Sachin Tendulkar on renaming IND vs ENG trophyIndia and England have contested the 'Pataudi Trophy' since 2007. However, starting from the 2025 series, the trophy has been rebranded as the 'Anderson–Tendulkar Trophy'. The batting great has responded to the name change, which has sparked debate within the cricketing community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-final-rcb-vs-pbks-most-watched-t20-match-ever-jiohotstar-2743134-2025-06-19",
      "headline": "RCB's maiden title win makes IPL 2025 final most-watched T20 matchThe IPL 2025 final between RCB and Punjab Kings made history, becoming the most-watched T20 match ever as Royal Challengers Bengaluru lifted their first title after 18 years, setting massive records across TV and digital platforms."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}