{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-record-rs-122-lakh-per-10-grams-what-should-investors-do-now-gold-prices-2799637-2025-10-08",
      "headline": "Gold hits record Rs 1.22 lakh per 10 grams. What should investors do now?Gold prices surged past Rs 1.22 lakh per 10 grams on Wednesday, driven by global uncertainty, a weak dollar, and expectations of US interest rate cuts. Investors are now wondering whether to buy, sell, or stay put."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-nithin-kamath-calls-for-smarter-ways-to-unlock-indias-3-trillion-gold-treasure-2799599-2025-10-08",
      "headline": "Nithin Kamath calls for smarter ways to unlock India's $3 trillion gold treasureIndia's homes hold an estimated $3 trillion worth of gold, a treasure that mostly lies untouched. Zerodha's Nithin Kamath believes it's time to put this idle wealth to work through smarter financial ideas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/titan-shares-jump-over-4-percent-today-key-factors-behind-the-rally-2799594-2025-10-08",
      "headline": "Titan shares jump over 4% today: What's driving the rally?At around 11:02 am, Titan's stock was trading 4.26% higher at Rs 3,562 on the Bombay Stock Exchange (BSE). The rally came after the company announced that its domestic jewellery segment grew 19% year-on-year during the July–September quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-trust-news-government-asks-restore-stability-amit-shah-meeting-noel-tata-report-2799554-2025-10-08",
      "headline": "Trouble in Tata Group? Government asks leadership to restore stability, says reportThe meeting was aimed at maintaining calm within the Tata Trusts, which holds a controlling stake in Tata Sons, the holding company of India's largest conglomerate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-to-invest-10-billion-in-visakhapatnam-data-hub-its-biggest-bet-on-india-yet-2799552-2025-10-08",
      "headline": "Google to invest $10 billion in Visakhapatnam data hub: ReportThe project will include the construction of three high-capacity submarine cables, dedicated cable landing stations, metro fibre networks, and advanced telecommunications infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-gain-for-5th-straight-session-tata-group-shares-in-focus-2799549-2025-10-08",
      "headline": "Sensex, Nifty rally for 5th straight session; Tata Group shares in focusThe S&P BSE Sensex opened firm and was trading 159.69 points higher at 82,086.44 around 9:22 am, while the NSE Nifty50 advanced 39.15 points to 25,147.45. Broader market indices also mirrored the positive sentiment, with most trading in the green."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-ipo-closes-today-tata-group-past-listings-profit-multibagger-allotment-2799544-2025-10-08",
      "headline": "Tata Capital IPO: Will it reward investors like other Tata Group listings?While Tata Capital enjoys strong brand credibility and steady growth, early subscription data and grey market trends indicate a modest response so far for the public listing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-chandrasekaran-meeting-amit-shah-sitharaman-trust-governance-issue-vijay-singh-2799527-2025-10-08",
      "headline": "Noel Tata, Chandrasekaran meet Amit Shah amid Tata Trust governance row: ReportNoel Tata was joined by Venu Srinivasan, chairman emeritus of TVS Motor Company, and senior lawyer Darius Khambata for the meeting, which took place at Amit Shah's residence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pf-claim-maze-unlocked-how-solutions-and-reforms-can-restore-faith-2799266-2025-10-07",
      "headline": "PF claim maze unlocked: How solutions and reforms can restore faithMillions of salaried Indians rely on the Employees' Provident Fund for financial security, yet claiming it remains a maze. Experts propose steps and technological fixes to make the process smoother and hassle-free."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pulse-daal-crisis-msp-low-despite-high-demand-low-production-trouble-farmer-report-2799193-2025-10-07",
      "headline": "Pulse crisis: Why are prices crashing below MSP despite high demand?Despite this rising import bill, instead of expansion, the area under pulses cultivation has shrunk. Over the past four years, the area under pulses has declined by nearly 3.1 million hectares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-gain-for-4th-straight-session-as-investors-expect-strong-q2-earnings-2799173-2025-10-07",
      "headline": "Sensex, Nifty gain for 4th straight session as investors expect strong Q2 earningsThe S&P BSE Sensex slipped 136.63 points to close at 81,926.75, while the NSE Nifty50 ended 30.65 points higher at 25,108.30. Broader market indices also ended the session largely positive, supported by easing volatility and sustained optimism around the upcoming quarterly earnings season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/wework-india-ipo-ingovern-flags-financial-issue-transparency-2-days-before-listing-gmp-2799158-2025-10-07",
      "headline": "WeWork India IPO hit by InGovern's concerns over finances days before listingInGovern pointed out that the company has reported negative cash flows for several financial years, suggesting that its operations have yet to generate consistent income."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-2-benefit-not-reaching-you-what-to-do-tips-faqs-complaints-explained-2799148-2025-10-07",
      "headline": "Not getting benefit of lower prices under GST 2.0? Here's what to doA recent LocalCircles survey that received over 78,000 responses from more than 27,000 people across 332 districts suggested that the benefits of GST 2.0 are reaching consumers unevenly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/world-bank-india-growth-fy26-and-fy27-domestic-consumption-better-performance-2799105-2025-10-07",
      "headline": "World Bank sees India growth at 6.5% for FY26, 6.3% for FY27In its latest South Asia Development Update, the World Bank highlighted that South Asia's overall growth is expected to slow to 5.8% in 2026, down from 6.6% in 2025, with trade disruptions and emerging technologies, including Artificial Intelligence (AI), creating fresh uncertainties for the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-the-50-30-20-budget-rule-doesnt-work-for-everyone-explains-expert-2799098-2025-10-07",
      "headline": "Why the 50-30-20 budget rule doesn't work for everyone, explains expertThe popular 50-30-20 budgeting rule has guided millions of people for decades. But personal finance expert says it often overlooks individual goals and may leave you short of what you actually need."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/salary-hike-private-employees-2026-it-auto-tech-9-percent-report-2799088-2025-10-07",
      "headline": "Here's how much salary hike employees can expect in 2026According to Aon's Annual Salary Increase and Turnover Survey 2025-26 for India, employees can expect an average salary hike of 9% next year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-airport-drives-up-real-estate-prices-in-navi-mumbai-2799080-2025-10-07",
      "headline": "New airport drives up real estate prices in Navi MumbaiThe development has already pushed property prices in surrounding areas such as Panvel, Ulwe, and Kharghar, as investors and developers rush to capitalise on the opportunities the airport promises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-to-introduce-facial-and-fingerprint-authentication-soon-report-2799062-2025-10-07",
      "headline": "UPI to introduce facial and fingerprint authentication soon: ReportUPI is set to allow users to authenticate transactions using facial recognition and fingerprints, according to sources. This new feature is expected to go live soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pension-hike-after-11-years-all-important-epfo-meeting-to-decide-soon-2799038-2025-10-07",
      "headline": "Pension hike after 11 years? All-important EPFO meeting to decide soonAfter more than a decade, pensioners may finally get some relief. The EPFO is set to discuss raising the minimum pension under EPS-95 during its upcoming board meeting in Bengaluru on October 10–11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-ipo-gmp-hints-at-strong-listing-but-is-it-really-a-good-bet-2799039-2025-10-07",
      "headline": "LG Electronics IPO: GMP hints at strong listing, but is it really a good bet?Early signals from the market suggest strong demand. The Grey Market Premium, for instance, is reported at Rs 318, implying a potential listing price of around Rs 1,458 per share, roughly 28% above the upper end of the price band. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shweta-tripathi-returns-as-golu-in-mirzapur-the-film-starts-shooting-in-benaras-2799609-2025-10-08",
      "headline": "Shweta Tripathi returns as Golu in Mirzapur The Film, starts shooting in Benaras Actor Shweta Tripathi has started shooting for 'Mirzapur: The Film' in Benaras, reprising her iconic role of Golu Gupta. This marks a significant step as the character transitions from web series to the big screen with a fresh narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-opens-up-on-kannada-ban-rumours-2799602-2025-10-08",
      "headline": "Rashmika Mandanna opens up on Kannada ban rumours: What people say doesn't matter Rashmika Mandanna has dismissed rumours of being banned from Kannada cinema, saying they are baseless and that people don't always know what happens behind the scenes. She also confirmed she watched 'Kantara' and shared her feedback with the team, putting speculation about her distancing from the industry to rest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-jisoo-zayn-malik-first-duet-eyes-closed-october-10-2799628-2025-10-08",
      "headline": "Blackpink's Jisoo confirms collaboration with Zayn Malik, Eyes Closed out soon Jisoo of Blackpink and Zayn Malik announce collaborative single 'Eyes Closed'. An audio teaser and poster shared on social media reveal the chorus and highlight the duet's unique blend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-reacts-to-the-life-of-a-showgirl-criticism-i-embrace-the-chaos-2799613-2025-10-08",
      "headline": "I embrace the chaos: Taylor Swift reacts to The Life of a Showgirl criticism Taylor Swift responded to the mixed reactions to her new album 'The Life of a Showgirl'. Taking the chatter in stride, she said, \"I welcome the chaos.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-in-talks-to-star-with-silambarasan-in-vetri-maarans-arasan-2799620-2025-10-08",
      "headline": "Actor Samantha and composer Anirudh to join Simbu-Vetri Maaran's Arasan. Details Actor Samantha Ruth Prabhu is in talks to star alongside Silambarasan in 'Arasan', directed by Vetri Maaran. Composer Anirudh Ravichander has been roped in to compose music for the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hd-kumaraswamy-hails-rishab-shettys-kantara-chapter-1-as-a-masterpiece-2799614-2025-10-08",
      "headline": "HD Kumaraswamy hails Rishab Shetty's Kantara Chapter 1 as a masterpiece Former Chief Minister of Karnataka and current Union Minister HD Kumaraswamy showered praise on Rishab Shetty's 'Kantara: Chapter 1' after watching the film in Delhi on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-praises-zakir-khan-for-creativity-kindness-after-lunch-in-new-york-2799630-2025-10-08",
      "headline": "Priyanka Chopra praises Zakir Khan for creativity, kindness after lunch in New York Priyanka Chopra expressed her admiration for comedian Zakir Khan after an informal lunch in New York, praising his creativity, humour, and kindness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/days-after-road-accident-punjabi-singer-rajvir-jawanda-dies-while-under-treatment-2799610-2025-10-08",
      "headline": "Punjabi singer Rajvir Jawanda dies 11 days after road accident Punjabi singer Rajvir Jawanda died 11 days after a road accident in Himachal Pradesh. The 'Munda Like Me' singer was hospitalised in a critical condition on September 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/exclusive-rishab-shetty-discusses-8-hour-shift-for-women-equality-on-film-sets-2799596-2025-10-08",
      "headline": "Exclusive: Rishab Shetty discusses 8-hour shift for women, equality on film sets In an exclusive interview with IndiaToday.in, 'Kantara' director and actor Rishab Shetty reflected on the 8-hour shift debate for women, sharing how empathy and equality guide his film sets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sara-khan-marries-krish-pathak-interfaith-wedding-blending-cultures-2799606-2025-10-08",
      "headline": "Bidaai actor Sara Khan marries actor Krish Pathak: Two faiths, one script Actor Sara Khan married her boyfriend Krish Pathak on October 6. Their interfaith wedding celebrates the union of two cultures. The couple plan a grand wedding in December. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/one-piece-2-first-look-of-laboon-the-whale-from-the-live-action-manga-adaptation-2799588-2025-10-08",
      "headline": "One Piece 2: First look of Laboon the whale from the live-action manga adaptation The new look of 'One Piece Season 2' unveils Laboon the whale as the crew sails into the Grand Line. This season promises fiercer adversaries and new fan favourites, setting the stage for an epic adventure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ismail-darbar-talks-about-the-fallout-with-sanjay-leela-bhansali-2799557-2025-10-08",
      "headline": "Ismail Darbar on fallout with Sanjay Leela Bhansali Ismail Darbar opened up about his fallout with Sanjay Leela Bhansali, revealing how creative differences and misunderstandings during 'Heeramandi' ended their long-standing collaboration. He also emphasised that he was the \"backbone\" of iconic films like 'Hum Dil De Chuke Sanam' and 'Devdas' and has no plans to work with Bhansali again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/indias-got-talent-italian-singers-giulia-laura-silvia-marathi-song-wajle-ki-bara-2799573-2025-10-08",
      "headline": "Italian trio impresses with Marathi song on India's Got Talent An Italian trio impressed judges on 'India's Got Talent' with their soulful Marathi rendition of 'Wajle Ki Bara'. Their performance, which had earlier gone viral online, captured the hearts of viewers and judges alike."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/yuzvendra-chahal-breaks-silence-on-dhanashree-verama-cheating-allegations-on-rise-and-fall-reality-show-2799569-2025-10-08",
      "headline": "Yuzvendra Chahal refutes cheating claims Dhanashree Verma made on Rise & Fall Yuzvendra Chahal denied cheating allegations made by ex-wife Dhanashree Verma on the reality show 'Rise & Fall'. Chahal stated he has moved on from the past and is now focused on his cricket career. The couple's divorce was finalised earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-sanskari-ki-tulsi-kumari-box-office-varun-dhawan-janhvi-kapoor-film-struggles-yet-to-cross-rs-40-crore-2799560-2025-10-08",
      "headline": "Sunny Sanskari box office Day 6: Varun-Janhvi film struggles, yet to cross Rs 40 crore Varun Dhawan and Janhvi Kapoor's 'Sunny Sanskari Ki Tulsi Kumari' has been struggling at the box office. In just three days, the film has managed to earn Rs 36 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-shikhar-enjoy-luxury-shopping-spree-in-paris-together-watch-2799533-2025-10-08",
      "headline": "Janhvi Kapoor, Shikhar Pahariya enjoy luxury shopping spree in Paris. Watch Janhvi Kapoor and rumoured boyfriend Shikhar Pahariya painted Paris streets red with their chemistry as they stepped out for an outing together. The actor was in the French Quarter to attend Paris Fashion Week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/soha-ali-khan-shares-how-sharmila-tagore-ditched-car-and-took-lifts-to-beat-delhi-traffic-2799539-2025-10-08",
      "headline": "Soha Ali shares how Sharmila Tagore ditched car and took lifts to beat traffic Soha Ali Khan said how Sharmila Tagore, living on her own in Delhi, ditched her car and took lifts from strangers to reach a book launch at the age of 80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-daiva-rituals-controversy-fans-imitate-sacred-worship-rishab-shetty-appeals-2799523-2025-10-08",
      "headline": "Explained: Why imitating Kantara's Daiva acts hurt Rishab Shetty, Tulu community 'Kantara: Chapter 1' fans have sparked controversy by imitating sacred Daiva rituals at theatres. Rishab Shetty and the producers appealed to fans urging them to respect the spiritual traditions and stop trivialising the practices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurrana-on-films-with-sooraj-barjatya-dharma-productions-talks-about-hybrid-cinema-2799525-2025-10-08",
      "headline": "Ayushmann Khurrana on films with Sooraj Barjatya, Dharma; talks about hybrid cinema At FICCI Frames 2025, Ayushmann Khurrana spoke about his love for hybrid films that blend entertainment with meaningful themes, calling it an extension of his theatre roots. He also confirmed his upcoming collaborations with Sooraj Barjatya, promising to continue taking creative risks."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-trust-news-government-asks-restore-stability-amit-shah-meeting-noel-tata-report-2799554-2025-10-08",
      "headline": "Trouble in Tata Group? Government asks leadership to restore stability, says reportThe meeting was aimed at maintaining calm within the Tata Trusts, which holds a controlling stake in Tata Sons, the holding company of India's largest conglomerate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/assam-cop-sandipan-garg-zubeen-gargs-cousin-arrested-in-connection-with-singers-death-2799617-2025-10-08",
      "headline": "Zubeen Garg's cop cousin arrested, was at Singapore yacht party where singer diedZubeen Garg's cousin Sandipan Garg, who is an Assam Police Services officer, has been arrested in connection with the singer's mysterious death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/behind-kantara-chapter-1-fire-rishab-shetty-pragathi-shetty-story-of-faith-sacrifice-cinema-exclusive-interview-2799497-2025-10-08",
      "headline": "Behind Kantara's fire: Rishab-Pragathi Shetty's story of faith, sacrifice, cinemaIn an exclusive interview with IndiaToday.in, Rishab Shetty and wife Pragathi Shetty open up about the making of 'Kantara Chapter 1', balancing family with filmmaking, and how faith, hard work, and passion shaped the cinematic phenomenon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/this-is-your-pm-in-the-cockpit-keir-starmer-leads-uks-biggest-trade-mission-to-india-glbs-2799493-2025-10-08",
      "headline": "This is your PM in the cockpit: Starmer leads UK's biggest trade mission to India  Live UpdatesUK Prime Minister Keir Starmer kicked off Britain's largest-ever trade mission to India with a witty in-flight address from the cockpit, ahead of talks with PM Modi to boost bilateral trade and investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/prashant-kishor-jan-suraaj-bihar-assembly-elections-2025-game-changer-vote-cutter-survey-latest-pk-tejashwi-2799445-2025-10-08",
      "headline": "Will politician PK beat strategist PK in Bihar election?After months of suspense, poll strategist-turned-politician Prashant Kishor (PK) has revealed that he will be contesting the Bihar Assembly election. He said his \"political startup\", Jan Suraaj party, would either come first or last in the polls. Will Jan Suraaj prove to be a game-changer or vote cutter? What do pre-poll surveys say?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-high-court-summons-netflix-srk-red-chillies-sameer-wankhede-bads-of-bollywood-defamation-trolling-relief-2799604-2025-10-08",
      "headline": "Court summons Netflix in Sameer Wankhede's Ba***ds of Bollywood defamation suitIn 2021, ex-Narcotics Control Bureau (NCB) officer Sameer Wankhede made news for arresting Bollywood superstar Shah Rukh Khan's son Aryan for alleged possession, consumption and trafficking of drugs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-hikaru-vs-gukesh-checkmate-tournament-controversy-2799624-2025-10-08",
      "headline": "Hikaru throwing Gukesh's king was rehearsed: BTS video goes viralThe chess world was taken by storm after Hikaru Nakamura threw away D Gukesh's king after checkmating him. A BTS video now shows that the move was probably rehearsed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/maharashtra/story/prime-minister-inaugurates-navi-mumbai-international-airport-phase-1-2799495-2025-10-08",
      "headline": "Navi Mumbai airport takes off, PM to unveil city's 2nd international hub todayPrime Minister will inaugurate the first phase of Navi Mumbai International Airport today, a Rs. 19,650 crore project. The new airport is expected to ease congestion and drive economic growth in the Mumbai Metropolitan Region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-daiva-rituals-controversy-fans-imitate-sacred-worship-rishab-shetty-appeals-2799523-2025-10-08",
      "headline": "Explained: Why imitating Kantara's Daiva acts hurt Rishab Shetty, Tulu community'Kantara: Chapter 1' fans have sparked controversy by imitating sacred Daiva rituals at theatres. Rishab Shetty and the producers appealed to fans urging them to respect the spiritual traditions and stop trivialising the practices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hd-kumaraswamy-hails-rishab-shettys-kantara-chapter-1-as-a-masterpiece-2799614-2025-10-08",
      "headline": "HD Kumaraswamy hails Rishab Shetty's Kantara Chapter 1 as a masterpieceFormer Chief Minister of Karnataka and current Union Minister HD Kumaraswamy showered praise on Rishab Shetty's 'Kantara: Chapter 1' after watching the film in Delhi on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/eli-lilly-mounjaro-second-highest-selling-drug-india-diabetes-obesity-treatment-whats-driving-its-rise-2799644-2025-10-08",
      "headline": "Mounjaro becomes India's second-highest selling drug: What's driving its rise?Mounjaro clocked in Rs 80 crore in sales in September, becoming India's second-highest selling drug within six months of launch. Its rise highlights growing demand amid the country's obesity and diabetes challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-record-rs-122-lakh-per-10-grams-what-should-investors-do-now-gold-prices-2799637-2025-10-08",
      "headline": "Gold hits record Rs 1.22 lakh per 10 grams. What should investors do now?Gold prices surged past Rs 1.22 lakh per 10 grams on Wednesday, driven by global uncertainty, a weak dollar, and expectations of US interest rate cuts. Investors are now wondering whether to buy, sell, or stay put."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/india-thali-driving-diabetes-obesity-crisis-ideal-indian-food-plate-carbohydrate-white-rice-wheat-roti-icmr-indiab-study-2799074-2025-10-07",
      "headline": "Is India's thali driving diabetes, obesity? What an ideal Indian plate should beIndia is facing a diabetes and obesity crisis. But is the country's national food plate or the 'thali', a high-carbohydrate meal, a surge in these lifestyle and metabolic diseases?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-amraam-missiles-us-air-to-air-weapon-defence-deal-trump-us-asim-munir-2799507-2025-10-08",
      "headline": "Pak to get air-to-air missiles from US as ties warm after Trump-Asim Munir meetPakistan's inclusion in the latest US missile contract signalled a reset in military ties between Islamabad and Washington, weeks after President Donald Trump met Shehbaz Sharif and Asim Munir at the Oval Office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indian-man-fighting-for-russian-military-surrenders-to-ukrainian-forces-glbs-2799477-2025-10-08",
      "headline": "Indian man fighting for Russian military surrenders to Ukrainian forcesA 22-year-old Indian from Gujarat has reportedly surrendered to Ukrainian forces after fighting for Russia. He claims he joined to avoid a prison sentence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/days-after-road-accident-punjabi-singer-rajvir-jawanda-dies-while-under-treatment-2799610-2025-10-08",
      "headline": "Punjabi singer Rajvir Jawanda dies 11 days after road accidentPunjabi singer Rajvir Jawanda died 11 days after a road accident in Himachal Pradesh. The 'Munda Like Me' singer was hospitalised in a critical condition on September 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/how-indias-lifestyle-choices-are-increasing-the-risk-of-blindness-2798965-2025-10-08",
      "headline": "How India's lifestyle choices are increasing the risk of blindnessDespite many lifestyle diseases being preventable, many people skip regular eye check-ups, leading to late diagnoses of vision loss or blindness. India already has one-third of the world's visually impaired population, making it especially vulnerable to diabetic eye disease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/soft-skills-gap-indian-engineering-graduates-employability-2799643-2025-10-08",
      "headline": "India's employability crisis: Why soft skills are the hardest to learnDespite rising degrees, only half of India's graduates are job-ready. Recruiters say poor communication, teamwork, and adaptability are keeping them out of work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/dhravya-shah-leaves-iit-prep-to-launch-ai-startup-raises-3-million-and-gets-o-1-extraordinary-visa-2799015-2025-10-07",
      "headline": "Dhravya Shah leaves IIT prep to launch AI startup, raises $3 million19-year-old Mumbai-born Dhravya Shah has turned heads in Silicon Valley after his AI startup, Supermemory, secured $3 million in seed funding from Google executives. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-fake-drug-racket-exposed-cough-syrup-deaths-fake-antibiotics-painkillers-2799550-2025-10-08",
      "headline": "How fake antibiotics, painkillers have flooded RajasthanA statewide probe in Rajasthan has uncovered massive lapses in drug regulation, revealing that substandard and fake medicines were sold in bulk before authorities acted, putting thousands of lives at risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/one-third-of-silicon-valley-is-indian-thats-not-flex-its-an-escape-iit-education-nep-jee-advanced-2798990-2025-10-07",
      "headline": "One-third of Silicon Valley is Indian. That's not a flex, it's an escapeBragging that one-third of Silicon Valley tech workers are Indian is no longer impressive. With record placement failures at IITs and a decaying syllabus, it's time we stopped hiding behind diaspora success. Here are six reasons why we strongly believe so."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/deoria-medical-college-dead-body-water-tank-up-police-students-drink-principal-suspended-2799579-2025-10-08",
      "headline": "UP college horror: Students drank water from tank that had dead body for 10 daysWater from a fifth-floor tank at a medical college in Deoria, containing a 10-day-old decomposed body, was supplied to OPD and ward buildings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/karur-stampede-vijay-tvk-challenge-madras-high-court-sit-probe-order-supreme-court-prejudicial-probe-2799559-2025-10-08",
      "headline": "SIT biased: Vijay's party goes to Supreme Court for independent stampede probeTVK has approached the Supreme Court, seeking an independent probe into the Karur stampede. The party claimed the SIT investigation ordered by Madras High Court is prejudiced. TVK also alleged a possible pre-planned conspiracy at its rally and questioned the High Court's inquiry.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-governor-anandiben-patel-live-in-relationships-visit-an-orphanage-to-see-consequence-2799546-2025-10-08",
      "headline": "Visit an orphanage, see consequence: UP Governor's shocker on live-in relationshipsAddressing the 7th convocation of Jananayak Chandrashekhar University in Ballia, the UP Governor said, \"If you want to see the consequences of live-in relationships, visit an orphanage. Fifteen to 20-year-old girls are standing in line, each with a one-year-old child.\""
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-world-cup-selection-2027-aakash-chopra-2799658-2025-10-08",
      "headline": "Indispensable no more? Rohit and Virat will be judged on ODI form, says ex-opener Former India opener Aakash Chopra said Rohit Sharma and Virat Kohli will come under scrutiny for their performances, adding that consistency will be key to retaining their places in the ODI squad in the lead-up to the 2027 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-hikaru-vs-gukesh-checkmate-tournament-controversy-2799624-2025-10-08",
      "headline": "Hikaru throwing Gukesh's king was rehearsed: BTS video goes viral The chess world was taken by storm after Hikaru Nakamura threw away D Gukesh's king after checkmating him. A BTS video now shows that the move was probably rehearsed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-omitted-india-odi-squad-champions-trophy-success-2799603-2025-10-08",
      "headline": "Varun Chakravarthy addresses ODI selection snub: I expect to be in every team Despite his standout performances in the Champions Trophy and Asia Cup, Varun Chakravarthy was not included in India's ODI squad for the Australia tour. The spinner discussed his omission and conversations with head coach Gautam Gambhir. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-pat-cummins-back-injury-miss-test-australia-vs-england-2799564-2025-10-08",
      "headline": "Pat Cummins could miss entire Ashes Test series due to injury: Report Pat Cummins is set to miss the start of the Ashes and could be sidelined for the full series against England due to a back injury, with Steve Smith likely to step in as captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-lean-look-ceat-cricket-awards-fitness-comeback-2799558-2025-10-08",
      "headline": "Fitman: Rohit Sharma stuns fans with sleek look at award show ahead of ODI comeback Rohit Sharma wowed fans with his slim and fit look at the CEAT Cricket Rating Awards in Mumbai, having reportedly shed 10 kg while training with former India assistant coach Abhishek Nayar ahead of his ODI comeback in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-ruben-amorim-premier-league-michael-owen-exclusive-2799489-2025-10-08",
      "headline": "Manchester United will win Premier League: Michael Owen's hope coded with warning Michael Owen told India Today that Manchester United's struggles go beyond Ruben Amorim. Structural flaws, inconsistency, and lack of cohesion persist, but with patience the Red Devils will return to glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-ceat-awards-champions-trophy-win-dravid-gambhir-2799530-2025-10-08",
      "headline": "Dravid's philosophies helped India win Champions Trophy 2025: Rohit Sharma India captain Rohit Sharma credited former coach Rahul Dravid's vision for their 2025 Champions Trophy success. Sharma said that the processes set by Dravid helped the team even after the coach left."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-delhi-pitch-report-2799524-2025-10-08",
      "headline": "IND vs WI: Batting pitch likely in Delhi after woeful Windies show in Ahmedabad The second Test match in Delhi is likely to have a batting-friendly pitch that slowly turns into a spinning track. This comes in stark difference to the track that was dished out in the 2023 Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-celebration-varun-arshdeep-singh-ceat-awards-2799504-2025-10-08",
      "headline": "India's Asia Cup celebration without trophy was Arshdeep's idea: Varun India mimicked their celebrations at the Asia Cup after being denied the trophy or the medals. Varun Chakravarthy reveals that the mock celebrations were the idea of Arshdeep Singh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-new-odi-captain-replaces-rohit-sharma-2027-world-cup-2799458-2025-10-08",
      "headline": "Is Shubman Gill being hurried into all-format captaincy? Star Indian batter Shubman Gill has been appointed as India's new ODI captain, replacing Rohit Sharma. So far, Gill has captained in only 11 international matches and has never led in ODIs. His rapid rise to multi-format captaincy could come with its own set of challenges. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/wfi-suspends-aman-sehrawat-for-weight-failure-wrestling-2799446-2025-10-07",
      "headline": "WFI suspends Aman Sehrawat for missing weight for World Championships The Wrestling Federation of India has suspended Aman Sehrawat for one year after he failed to make weight at the Senior World Championships. This suspension highlights concerns over discipline and professionalism within Indian wrestling's top ranks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-ceat-awards-champions-trophy-win-dravid-gambhir-2799530-2025-10-08",
      "headline": "Dravid's philosophies helped India win Champions Trophy 2025: Rohit Sharma India captain Rohit Sharma credited former coach Rahul Dravid's vision for their 2025 Champions Trophy success. Sharma said that the processes set by Dravid helped the team even after the coach left."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-delhi-pitch-report-2799524-2025-10-08",
      "headline": "IND vs WI: Batting pitch likely in Delhi after woeful Windies show in Ahmedabad The second Test match in Delhi is likely to have a batting-friendly pitch that slowly turns into a spinning track. This comes in stark difference to the track that was dished out in the 2023 Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-celebration-varun-arshdeep-singh-ceat-awards-2799504-2025-10-08",
      "headline": "India's Asia Cup celebration without trophy was Arshdeep's idea: Varun India mimicked their celebrations at the Asia Cup after being denied the trophy or the medals. Varun Chakravarthy reveals that the mock celebrations were the idea of Arshdeep Singh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-new-odi-captain-replaces-rohit-sharma-2027-world-cup-2799458-2025-10-08",
      "headline": "Is Shubman Gill being hurried into all-format captaincy? Star Indian batter Shubman Gill has been appointed as India's new ODI captain, replacing Rohit Sharma. So far, Gill has captained in only 11 international matches and has never led in ODIs. His rapid rise to multi-format captaincy could come with its own set of challenges. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/wfi-suspends-aman-sehrawat-for-weight-failure-wrestling-2799446-2025-10-07",
      "headline": "WFI suspends Aman Sehrawat for missing weight for World Championships The Wrestling Federation of India has suspended Aman Sehrawat for one year after he failed to make weight at the Senior World Championships. This suspension highlights concerns over discipline and professionalism within Indian wrestling's top ranks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brian-lara-urges-west-indies-players-to-reignite-passion-for-test-cricket-revival-2799443-2025-10-07",
      "headline": "Brian Lara urges West Indies to revive the spirit to play Test cricket: Find a wayBrian Lara has urged West Indies cricketers to bring back passion and pride for Test cricket. He stressed that attitude and dedication are more crucial than facilities for the game's revival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-aus-w-vs-pak-w-ellyse-perry-full-pre-match-press-conference-2799432-2025-10-07",
      "headline": "Really enjoy Fatima Sana's passion and energy on the field: Ellyse PerryStar Australia all-rounder Ellyse Perry showered praise on Pakistan captain Fatima Sana ahead of their third fixture of the Women's World Cup 2025 in Colombo. She also praised her leadership skills, calling her a perfect team person."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-leadership-team-first-approach-praised-kane-williamson-india-cricket-2799429-2025-10-07",
      "headline": "Relentless commitment, contagious attitude: Williamson on what makes Siraj specialKane Williamson has praised Mohammed Siraj for his leadership and team-first approach. His rise from IPL talent to a key India bowler highlights his growing influence in cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-wins-ceat-t20i-batter-award-three-centuries-opener-2799428-2025-10-07",
      "headline": "Sanju Samson named CEAT T20I batter of the year, dedicates award to wife CharuSanju Samson won the CEAT men's T20I batter of the year award after a remarkable run as an opener in the past 12 months. He slammed three centuries in 12 innings after being promoted to open the innings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-players-refuse-iran-travel-acl2-fan-confrontation-2799413-2025-10-07",
      "headline": "Watch: Mohun Bagan players confronted by fans for refusing to travel to Iran for ACL2Mohun Bagan players refused to travel to Iran for the AFC Champions League 2 fixture against Sepahan FC. This decision sparked fan confrontations and highlighted safety concerns due to international travel advisories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/heather-knight-england-vs-bangladesh-icc-womens-cricket-world-cup-2025-thrilling-chase-guwahati-2799391-2025-10-07",
      "headline": "England survive Bangladesh scare as Heather Knight steers home in tricky chaseEngland registered their second successive win of the Women's World Cup 2025, defeating Bangladesh by four wickets. Heather Knight took her team over the line with an unbeaten innings of 79* (111) after surviving three close calls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-spartan-mentality-varun-chakravarthy-asia-cup-2799381-2025-10-07",
      "headline": "Gautam Gambhir instils Spartan mentality in Team India: Varun ChakravarthyVarun Chakravarthy lauded head coach Gautam Gambhir for bringing a Spartan mentality to Team India, saying there is no room for mediocrity. He emphasised that Gambhir's approach pushes players to give their absolute best in every game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-pakistan-sidra-amin-responsibility-australia-colombo-clash-2799377-2025-10-07",
      "headline": "Pakistan's Sidra Amin aims to take responsibility in leading the charge vs AustraliaPakistan's Sidra Amin is ready to lead from the front against Australia, embracing her role as the team's \"backbone.\" Focused on patience and responsibility, she aims to anchor Pakistan's innings and turn belief into performance in Colombo."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-players-refuse-iran-travel-acl2-fan-confrontation-2799413-2025-10-07",
      "headline": "Watch: Mohun Bagan players confronted by fans for refusing to travel to Iran for ACL2Mohun Bagan players refused to travel to Iran for the AFC Champions League 2 fixture against Sepahan FC. This decision sparked fan confrontations and highlighted safety concerns due to international travel advisories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/heather-knight-england-vs-bangladesh-icc-womens-cricket-world-cup-2025-thrilling-chase-guwahati-2799391-2025-10-07",
      "headline": "England survive Bangladesh scare as Heather Knight steers home in tricky chaseEngland registered their second successive win of the Women's World Cup 2025, defeating Bangladesh by four wickets. Heather Knight took her team over the line with an unbeaten innings of 79* (111) after surviving three close calls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-spartan-mentality-varun-chakravarthy-asia-cup-2799381-2025-10-07",
      "headline": "Gautam Gambhir instils Spartan mentality in Team India: Varun ChakravarthyVarun Chakravarthy lauded head coach Gautam Gambhir for bringing a Spartan mentality to Team India, saying there is no room for mediocrity. He emphasised that Gambhir's approach pushes players to give their absolute best in every game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-pakistan-sidra-amin-responsibility-australia-colombo-clash-2799377-2025-10-07",
      "headline": "Pakistan's Sidra Amin aims to take responsibility in leading the charge vs AustraliaPakistan's Sidra Amin is ready to lead from the front against Australia, embracing her role as the team's \"backbone.\" Focused on patience and responsibility, she aims to anchor Pakistan's innings and turn belief into performance in Colombo."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/pakistans-bowlers-could-give-us-the-edge-to-take-down-australia-sidra-amin-2799362-2025-10-07",
      "headline": "Pakistan's bowlers could give us the edge to take down Australia: Sidra AminPakistan's Sidra Amin believes that their bowling unit could give them an edge as they gear up to face the defending champions, Australia in the group-stages of the Women's World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/emma-raducanu-retires-wuhan-open-heat-exhaustion-ann-li-advances-2799357-2025-10-07",
      "headline": "Wuhan Open: Emma Raducanu forced to retire after medical time-out as heat takes tollEmma Raducanu retired from her first-round match at the Wuhan Open due to heat exhaustion. The extreme weather conditions continue to affect players and impact tournament outcomes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ellyse-perry-positive-batting-strategy-colombo-slow-pitch-pakistan-womens-world-cup-2025-2799350-2025-10-07",
      "headline": "Australia focused on playing positively on Colombo's slow track: Ellyse PerryAustralia all-rounder Ellyse Perry says the team will bat positively on Colombo's slow pitch against Pakistan. Australia will take on Pakistan in their third fixture of the Women's World Cup 2025 after having their second match washed out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/hyderabad-fc-sporting-club-delhi-rebranding-isl-return-capital-jindal-group-2799348-2025-10-07",
      "headline": "Hyderabad FC now Sporting Club Delhi: Everything to know about ISL's capital returnDelhi is finally back on India's top-tier football map as Hyderabad FC relocates and rebrands as Sporting Club Delhi. The capital gets its first permanent ISL club in over five years, aiming to revive a forgotten footballing legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-ms-dhoni-advice-ipl-criticism-mental-resilience-2799287-2025-10-07",
      "headline": "Mohammed Siraj credits MS Dhoni's wisdom for helping him rise above criticismMohammed Siraj has revealed how MS Dhoni's advice helped him to withstand hostile online attacks during his challenging early years in the IPL. Siraj rose to the limelight after being bought for Rs 2.2 Crore by the Royal Challengers Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-south-africa-tazmin-brits-cricket-journey-resilience-record-centuries-2799298-2025-10-07",
      "headline": "Olympic hopes, a tragic crash, and redemption: Tazmin Brits' road to World Cup dreamTazmin Brits overcame a life-threatening car accident to emerge as a top South African cricketer. Her inspiring journey highlights resilience and aims to raise road safety awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-rodrygo-tough-season-personal-problems-carlo-ancelotti-thanks-fc-barcelona-2799296-2025-10-07",
      "headline": "Rodrygo opens up on personally tough 2024-25 season at Real Madrid: Ancelotti helpedAfter a turbulent end to last season, Real Madrid's Rodrygo Goes opened up about his personal struggles. He revealed how Carlo Ancelotti played a vital role in helping him regain balance, motivation, and confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-181-runs-heated-clash-with-former-mumbai-teammates-maharashtra-warm-up-2799270-2025-10-07",
      "headline": "Watch: Prithvi Shaw flings his bat at ex-Mumbai teammates in heated exchangePrithvi Shaw was seen involved in a heated verbal exchange following his dismissal when playing against his former team, Mumbai in the warm-up clash."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}