{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-flipkart-competition-laws-cci-favour-2600861-2024-09-16",
      "headline": "Amazon, Flipkart violated competition laws by favouring certain sellers: ReportThe investigation was triggered by a complaint from the Delhi Vyapar Mahasangh, which is an affiliate of the country's biggest trade body, Confederation of All India Traders (CAIT), that represents 80 million retailers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-cut-can-it-steer-economy-toward-soft-landing-report-2600804-2024-09-16",
      "headline": "US Fed poised to cut rates: Can it steer economy toward soft landing?After months of elevated interest rates, the Fed is likely to lower its benchmark rate, potentially giving a much-needed break to the economy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-close-slightly-higher-bajaj-housing-finance-shines-on-debut-2600658-2024-09-16",
      "headline": "Sensex, Nifty close slightly higher; Bajaj Housing Finance shines on debutThe S&P BSE Sensex ended the trading session 97.84 points higher at 82,988.78, while the NSE Nifty50 rose 27.25 points to settle at 25,383.75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-withdraws-external-influence-claims-after-talks-with-employees-madhabi-puri-buch-2600643-2024-09-16",
      "headline": "Sebi withdraws statement blaming external elements for staff protestsJust under two weeks ago, Sebi had issued a statement suggesting that external forces were behind the unrest among its staff, which was seen as an attempt to discredit the organisation and its leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-listing-bonanza-missed-alternate-options-experts-explained-2600641-2024-09-16",
      "headline": "Missed Bajaj Housing Finance listing day rally? Check these alternate optionsBajaj Housing Finance bumper listing: By the end of the trading session, the company's stock price stood at Rs 164.99, marking a significant increase over its IPO issue price. But for those who missed out on the listing day windfall, what are the next steps?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oberoi-inheritance-war-siblings-clash-over-late-prs-oberois-will-vikramjit-natasha-arjun-anastasia-2600606-2024-09-16",
      "headline": "Oberoi inheritance war: Siblings clash over late PRS Oberoi's willOn one side are Vikramjit Oberoi, Natasha Oberoi, and Arjun Oberoi. On the other side is Anastasia Oberoi, PRS Oberoi's daughter from his second marriage to Mirjana Jojic Oberoi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-shares-upper-circuit-bumper-listing-what-next-investor-trading-strategy-2600532-2024-09-16",
      "headline": "Bajaj Housing Finance shares hit upper circuit after bumper listing: What's next?Bajaj Housing Finance listing: By midday, the shares hit an upper circuit at Rs 164.99, representing an overall premium of 135.70% over the IPO price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/edelweiss-mf-radhika-gupta-ceo-does-not-own-luxury-cars-depreciating-asset-owns-innova-2600494-2024-09-16",
      "headline": "'Can afford, but won't buy': Edelweiss MF CEO on not owning luxury carsEdelweiss MF Radhika Gupta CEO currently owns an Innova, which is known for its practicality and reliability rather than for being a luxury car."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/branch-manager-to-ceo-how-atul-jain-transformed-bajaj-housing-finance-2600465-2024-09-16",
      "headline": "From branch manager to CEO: How Atul Jain transformed Bajaj Housing FinanceAtul Jain, now 52, has been with the Bajaj Group for over two decades. He began his career in investment banking, working as a project executive at PNB Capital Services Limited and later at Prudential Capital Markets Limited. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-bumper-listing-multibagger-gains-gmp-what-should-investors-do-2600452-2024-09-16",
      "headline": "Bajaj Housing Finance shares list at 114% premium. What should investors do? With Bajaj Housing Finance shares debuting at a staggering 114% premium, investors face a pivotal choice: lock in profits now or stay the course for potential long-term rewards. Find out what experts suggest for your next move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kross-shares-list-flat-on-dalal-street-rs-240-book-profit-or-hold-expert-view-2600424-2024-09-16",
      "headline": "Kross shares list flat on D-Street: Should you book profit or hold? Kross listing: Shares of Kross made a flat debut opening at Rs 240 on NSE and BSE, the same as its IPO price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-market-listing-blockbuster-debut-114-percent-premium-book-profit-or-hold-2600411-2024-09-16",
      "headline": "Bajaj Housing Finance turns multibagger on listing: Book profits or hold?Bajaj Housing Finance IPO listing: With this blockbuster entry on Dalal Street, the key dilemma for investors is now whether to book profits immediately or hold onto their positions for long-term gains.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-rally-as-fed-rate-cut-looms-markets-stay-bullish-bajaj-housing-finance-debut-2600405-2024-09-16",
      "headline": "Sensex, Nifty rally as Fed rate cut looms; markets stay bullishThe S&P BSE Sensex added 169.53 points to 83,060.47, while the NSE Nifty50 gained 62.55 points to 25,419.05"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-shares-list-at-114-premium-over-ipo-price-at-rs-150-2600399-2024-09-16",
      "headline": "Bajaj Housing Finance makes bumper debut as shares list at 114% premiumBajaj Housing Finance listing: The shares were allocated to successful bidders on September 13, and the listing gains of Rs 80 per share slightly exceeded the grey market premium (GMP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-september-16-2024-precious-metals-record-hike-on-mcx-2600384-2024-09-16",
      "headline": "Gold, silver price today, September 16, 2024: Precious metals record hike on MCXGold Price Today September 16, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Monday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-flipkart-and-major-smartphone-brands-samsung-xiaomi-motorola-face-antitrust-heat-report-2600139-2024-09-15",
      "headline": "Amazon, Flipkart and major smartphone brands face antitrust heat: ReportThe Competition Commission of India (CCI) has found that these companies have been involved in exclusive product launches on their platforms, which may have restricted competition and harmed smaller businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rent-vs-buy-expert-views-smarter-financial-move-for-you-2599981-2024-09-15",
      "headline": "Rent vs buy: What's the smarter financial move for you?Renting offers the freedom to move, explore career opportunities, and invest in other ventures. Buying a home, on the other hand, offers long-term security, a sense of ownership, and equity building. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/centre-approves-madhya-pradeshs-request-for-soybean-procurement-at-msp-2599830-2024-09-14",
      "headline": "Centre approves Madhya Pradesh's request for soybean procurement at MSPUnion Agriculture and Farmer Welfare Minister Shivraj Singh Chouhan confirmed that the proposal from the Madhya Pradesh government was received and approved late Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/minimum-export-price-limit-basmati-rice-onion-outbound-shipments-and-enhance-farmers-income-2599748-2024-09-14",
      "headline": "Centre lifts minimum export price cap on onion, basmati riceThe $950 per tonne minimum export price for basmati rice has been removed while the export duty on onion has been cut to 20 per cent from 40 per cent, in effect from September 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-expected-listing-gains-double-investors-wealth-latest-gmp-2599745-2024-09-14",
      "headline": "Bajaj Housing Finance IPO: Will it double investors' wealth on market debut?Bajaj Housing Finance IPO listing: With the GMP indicating a significant upside, all eyes are now on whether the shares will live up to the hype and deliver the bumper listing gains many expect."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-protesting-doctors-demand-kolkata-police-commissioner-vineet-goyal-to-be-removed-2600968-2024-09-17",
      "headline": "Mamata Banerjee agrees to doctors' demand, Kolkata top cop to be removedMamata Banerjee announced the removal of Kolkata Police Commissioner Vineet Goyal and the Deputy Commissioner (North), who faced bribery allegations from the family of the trainee doctor who was raped and killed in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-iranian-supreme-leader-ayatollah-khamenei-suffering-of-muslims-remark-2600920-2024-09-16",
      "headline": "India condemns Khamenei's 'suffering of Muslims' remark: Look at your recordIndia condemned remarks by Iran's Supreme Leader Ayatollah Khamenei on the \"suffering of Muslims,\" calling them \"misinformed\" and urging nations to assess their own record. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/engineer-rashid-exclusive-awami-ittehad-party-alliance-jamaat-e-islami-jammu-kashmir-election-2600966-2024-09-16",
      "headline": "Engineer Rashid explains why he joined hands with Jamaat for J&K pollsSpeaking exclusively with India Today TV, Engineer Rashid said that Jamaat-e-Islami participating in the electoral process should be welcomed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-sushil-kumar-shinde-congress-lal-chowk-jammu-kashmir-article-370-terrorism-2600724-2024-09-16",
      "headline": "Rahul baba can eat ice cream, ride bike because we made Kashmir safe: Amit ShahHome Minister Amit Shah said the NDA government has made Jammu and Kashmir safe by abrogating Article 370, which was not possible during the Congress government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hijabs-death-anniversary-second-anniversary-mahsa-amini-hair-open-streets-of-tehran-ayatollah-ali-khamenei-2600777-2024-09-16",
      "headline": "Iran women ditch hijab, go on hunger strike on Mahsa Amini's death anniversaryOn September 16, 2022, Mahsa Amini died in the custody of Iran's moral police after she was arrested for not following a strict Islamic dress code. Her death led to an outrage and now, two years later, 34 Iranian women prisoners have gone on a hunger strike and dozens are flouting the hijab rule to mark her death anniversary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-mission-vandalism-of-new-york-baps-swaminarayan-temple-us-2600965-2024-09-16",
      "headline": "India raises vandalism of New York's Swaminarayan Temple with US: UnacceptableThe Indian Mission in the US condemned the vandalism of the BAPS Swaminarayan Temple in New York, urging law enforcement to take swift action against the perpetrators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manish-sisodia-arvind-kejriwal-meeting-residence-today-resignation-announcement-next-delhi-chief-minister-buzz-2600409-2024-09-16",
      "headline": "Arvind Kejriwal to resign tomorrow, holds one-on-ones with leaders for feedbackArvind Kejriwal dropped a bombshell on Sunday, announcing that he would resign as the Delhi Chief Minister in the next two days. His announcement came days after he was granted bail by the Supreme Court in liquor policy case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russian-sex-at-work-vladimir-putin-moscow-birth-rate-decline-kremlin-ukraine-war-2600847-2024-09-16",
      "headline": "Putin wants Russians to have sex during work breaks to boost populationRussia's leadership has advised people to have sex during work breaks to boost the nation's dwindling birth rate amid ongoing population decline exacerbated by the Ukraine war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/video-bjp-mla-falls-on-tracks-during-vande-bharat-flagging-off-amid-rush-chaos-2600931-2024-09-16",
      "headline": "Video: BJP MLA falls on tracks during Vande Bharat flagging off amid rush, chaosEtawah BJP MLA Sarita Bhadoria fell on railway tracks amid a rush while flagging off a Vande Bharat Express at the Etawah Railway Station on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-opposition-attacks-nda-government-third-term-ahmedabad-rally-development-projects-2600735-2024-09-16",
      "headline": "Endured Opposition's insult, worked on government agenda: PM on NDA 3.0's 100 daysPrime Minister Narendra Modi slammed the opposition parties, accusing them of making fun of him in the first 100 days of NDA 3.0 and said he instead focused on completing the government's agenda during the period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-kamala-harris-joe-biden-donald-trump-assassination-attempt-backlash-post-2600692-2024-09-16",
      "headline": "Elon Musk deletes 'no one trying to assassinate Biden/Kamala' post after backlashElon Musk deleted a controversial post on why there were \"no\" attempts to kill US President Joe Biden and Vice President Kamala Harris after a row over President Donald Trump's 'second assassination attempt'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-resignation-delhi-cm-news-political-sixer-five-big-reasons-aam-aadmi-party-aap-delhi-assembly-election-2600535-2024-09-16",
      "headline": "Kejriwal's move to resign is a political sixer. 5 big reasons whyArvind Kejriwal's decision to resign as the Chief Minister of Delhi is a calculated political move. From removing the corruption taint to beating anti-incumbency to gaining from the anti-BJP momentum in the Opposition camp, here are five big reasons why this is Kejriwal's political sixer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditi-rao-hydari-shares-new-wedding-photos-with-husband-siddharth-from-house-library-2600519-2024-09-16",
      "headline": "Aditi Rao Hydari-Siddharth's new wedding photos exude old school romanceActors Aditi Rao Hydari and Siddharth tied the knot at a temple recently. After announcing their wedding in a social media post, the couple shared a set of new photos highlighting their beautiful chemistry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/ios-18-now-rolling-out-for-select-iphones-how-to-download-new-features-and-more-2600627-2024-09-16",
      "headline": "iOS 18 now rolling out for select iPhones: How to download, new features and more Apple has begun rolling out iOS 18 in India, bringing a host of new features and improvements to select iPhone models."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-gujarat-filled-with-hate-not-leaving-chance-defame-india-rahul-gandhi-2600921-2024-09-16",
      "headline": "People filled with hate trying to defame India: PM's veiled dig at Rahul GandhiAddressing a gathering in Ahmedabad, PM Modi, without taking names, said they (Opposition) can cross any limits for appeasement politics.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/bihar-woman-lands-rs-60-lakh-job-offer-from-google-she-isnt-from-iit-iim-2600860-2024-09-16",
      "headline": "Bihar woman lands Rs 60 lakh job offer from Google. She isn't from IIT, IIMAlankrita Sakshi, a BTech graduate from Jharkhand, secured a Rs 60 LPA job at Google as a security analyst, proving that success doesn't always come from prestigious institutions like IITs or IIMs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/indian-student-reclaims-guinness-record-with-worlds-smallest-vacuum-cleaner-2600822-2024-09-16",
      "headline": "Indian student reclaims Guinness record with world's smallest vacuum cleanerIndian student Tapala Nadamuni broke the Guinness World Record for creating the smallest vacuum cleaner, measuring just 0.65 cm, after spending two years redesigning and perfecting the device.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/speeding-thar-car-hits-woman-scooter-parked-car-saharanpur-up-cctv-footage-2600830-2024-09-16",
      "headline": "Video: Thar rams scooter and car, then hits woman in UP's SaharanpurA speeding Thar rammed into a parked scooter and a car before it hit a woman, who was injured in the incident. The police took note of the CCTV footage and began taking action to catch the driver."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/kasturba-gandhi-silent-sacrifice-satyagraha-movement-in-south-africa-against-ending-polygamy-2600740-2024-09-16",
      "headline": "How Kasturba Gandhi began Satyagraha in South Africa against ending polygamyKasturba Gandhi's quiet defiance and enduring sacrifice in 1913 were crucial in advancing South Africa's satyagraha movement, where she advocated for the rights of Indian women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-india-4-1-south-korea-semifinal-harmanpreet-singh-2600704-2024-09-16",
      "headline": "Asian Champions Trophy hockey: Dominant India beat Korea to set up final vs ChinaAsian Champions Trophy: A brace from Harmanpreet Singh and goals from Uttam Singh and Jermanpreet Singh helped India hammer South Korea 4-1 in the semi-final. The four-time champions will take on hosts China in the big final on Tuesday, September 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/emily-in-paris-renewed-for-season-5-marcello-gabriel-netflix-2600811-2024-09-16",
      "headline": "Emily in Paris renewed for season 5: What's next for Emily, Marcello and Gabriel?Emily in Paris is renewed for a fifth season. Lily Collins announced it on Instagram, sparking fan excitement about Emily and Marcello's romance. Creator Darren Star hints at continued drama and romance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/hyderabad-student-drowns-toronto-lake-swimming-brother-birthday-friends-canada-police-2600651-2024-09-16",
      "headline": "Hyderabad student drowns in Canada lake during brother's birthday celebrationA Master's student from Hyderabad drowned in a lake while swimming when he was celebrating his brother's birthday with his friends in Toronto."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shiv-sena-mla-sanjay-gaikwad-rs-11-lakh-rahul-gandhi-tongue-reservation-2600694-2024-09-16",
      "headline": "Shinde Sena MLA announces bounty to 'chop off Rahul Gandhi's tongue', sparks rowSanjay Gaikwad, who is a member of the Eknath Shinde-led Shiv Sena faction, said he would reward Rs 11 lakh to whoever chops off Rahul Gandhi's tongue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-elections-donald-trump-assassination-attempt-secret-service-ryan-wesley-routh-2600575-2024-09-16",
      "headline": "Donald Trump was about to putt when Secret Service noticed muzzle of rifleAs Trump lined up his shot at his West Palm Beach club on Monday, the Secret Service caught something unusual: the muzzle of a rifle barrel poking through the bushes near the fence line."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/bridgerton-season-4-begins-production-with-yerin-ha-luke-thompson-see-pics-2600916-2024-09-16",
      "headline": "Bridgerton season 4 begins production with Yerin Ha, Luke Thompson. See picsBridgerton Season 4 is officially in production. The makers have shared pictures of actors Yerin Ha and Luke Thompson from the set of the show."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-issues-statement-about-fake-us-tour-tickets-2600899-2024-09-16",
      "headline": "Salman Khan issues statement about alleged US tour: No shows planned for 2024Salman Khan's team warns fans not to buy tickets for any US tours in 2024, stating that he has no plans to travel to the US. The actor is currently filming Sikandar and will return to Bigg Boss soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/meet-actor-mokksha-whose-street-dance-at-kolkata-protest-has-gone-viral-2600864-2024-09-16",
      "headline": "Meet actor Mokksha whose street dance at Kolkata protest has gone viralActor Mokksha Sengupta's street dance at a Kolkata protest against the RG Kar incident has gone viral. The Bengali actor, active in South Indian cinema, used her art to voice her outrage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/masaba-gupta-says-she-was-catcalled-bodyshamed-by-boys-at-school-2600832-2024-09-16",
      "headline": "Masaba Gupta says she was called 'bas** child' at school, catcalled by boysMasaba Gupta discussed being catcalled and called a \"bas**** child\" at school. She shared how she faced discrimination and preferred staying in a bubble during her school days."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajinkya-rahane-county-stint-leicestershire-ends-niggles-2600964-2024-09-16",
      "headline": "Rahane's county stint for Leicestershire ends after 'niggles'Ajinkya Rahane's county season with Leicestershire ended after he suffered a \"couple of niggles\". He will miss the matches against Derbyshire and Northamptonshire. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/luke-shaw-set-to-miss-manchester-uniteds-league-cup-game-vs-barnsley-2600963-2024-09-16",
      "headline": "Luke Shaw set to miss Manchester United's League Cup game vs BarnsleyManchester United are set to miss left back Luke Shaw in their League Cup game against Barnsley. Manager Erik Ten Hag was not able to give a timeline for the player's return.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-south-africa-1st-t20i-aliya-riaz-marizanne-kapp-multan-report-2600947-2024-09-16",
      "headline": "Aliya Riaz's 52 in vain as Kapp, Brits blow away Pakistan in 1st T20IPAK vs SA: Aliya Riaz's late surge wasn't enough as South Africa beat Pakistan by 10 runs to take a 1-0 lead in the three-match Women's T20I series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-training-session-jasprit-bumrah-yashasvi-jaiswal-virat-kohli-2600946-2024-09-16",
      "headline": "Jasprit Bumrah vs Yashasvi Jaiswal: Pacer wins duel in Chennai netsIndia opener Yashasvi Jaiswal found it difficult to play Jasprit Bumrah in the nets of India training, PTI reported on Monday, September 16. Yashasvi and Virat Kohli batted against the pacer in Chepauk and saw contrasting fortunes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-ban-charged-up-bangladesh-sweat-it-out-in-chennai-before-india-tests-2600930-2024-09-16",
      "headline": "Charged-up Bangladesh sweat it out in Chennai before India TestsIND vs BAN: Najmul Hossain Shanto's Bangladesh started training at the Chepauk before facing Rohit Sharma's mighty India in the opening Test, starting September 17 at the Chepauk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-pakistan-vs-korea-squads-live-streaming-2600924-2024-09-16",
      "headline": "Pakistan vs Korea Asian Champions Trophy: When and where to watch liveAsian Champions Trophy 2024: Pakistan and Korea will cross swords in the third-place playoff match on Tuesday after losing their respective semi-finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/glasgow-set-to-be-announced-as-host-city-for-2026-common-wealth-games-report-2600926-2024-09-16",
      "headline": "Glasgow set to be announced as host city for 2026 Common Wealth Games: ReportThe Scottish capital of Glasgow is set to be announced as the host city of a \"scaled down\" Commonwealth Games in 2026, a year after Australian state Victoria pulled out due to ballooning costs, reported PTI on Monday, September 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sakshee-malikkh-geeta-phogat-announce-wrestling-champions-super-league-2600923-2024-09-16",
      "headline": "Sakshee Malikkh, Geeta Phogat announce Wrestling Champions Super LeagueWrestlers Sakshee Malikkh and Geeta Phogat have announced that they are planning to launch Wrestling Champions Super League to help budding wrestlers in India. Phogat said that she and Sakshee had been planning for this for a long time.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-ban-team-india-start-intense-training-before-chepauk-test-2600908-2024-09-16",
      "headline": "Team India start intense training before Chepauk TestIND vs BAN: Rohit Sharma's India have started training hard before their opening Test against Bangladesh gets underway on Thursday, September 19 at the MA Chidambaram Stadium in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-ravichandran-ashwin-ma-chidambaram-stadium-chennai-2600659-2024-09-16",
      "headline": "India vs Bangladesh: R Ashwin looks to continue love affair with ChepaukStar India off spinner Ravichandran Ashwin will return to his home ground at the MA Chidambaram Stadium in Chennai as India restart their home Test season with the Bangladesh series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arjun-tendulkar-shines-with-9-wicket-haul-for-goa-in-ksca-invitational-2600905-2024-09-16",
      "headline": "Arjun Tendulkar shines with 9-wicket haul in KSCA InvitationalArjun Tendulkar took nine wickets while playing for Goa in their match against Karnataka in the KSCA Invitational. He helped his team win the match by 189 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/glasgow-set-to-be-announced-as-host-city-for-2026-common-wealth-games-report-2600926-2024-09-16",
      "headline": "Glasgow set to be announced as host city for 2026 Common Wealth Games: ReportThe Scottish capital of Glasgow is set to be announced as the host city of a \"scaled down\" Commonwealth Games in 2026, a year after Australian state Victoria pulled out due to ballooning costs, reported PTI on Monday, September 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sakshee-malikkh-geeta-phogat-announce-wrestling-champions-super-league-2600923-2024-09-16",
      "headline": "Sakshee Malikkh, Geeta Phogat announce Wrestling Champions Super LeagueWrestlers Sakshee Malikkh and Geeta Phogat have announced that they are planning to launch Wrestling Champions Super League to help budding wrestlers in India. Phogat said that she and Sakshee had been planning for this for a long time.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-ban-team-india-start-intense-training-before-chepauk-test-2600908-2024-09-16",
      "headline": "Team India start intense training before Chepauk TestIND vs BAN: Rohit Sharma's India have started training hard before their opening Test against Bangladesh gets underway on Thursday, September 19 at the MA Chidambaram Stadium in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-ravichandran-ashwin-ma-chidambaram-stadium-chennai-2600659-2024-09-16",
      "headline": "India vs Bangladesh: R Ashwin looks to continue love affair with ChepaukStar India off spinner Ravichandran Ashwin will return to his home ground at the MA Chidambaram Stadium in Chennai as India restart their home Test season with the Bangladesh series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arjun-tendulkar-shines-with-9-wicket-haul-for-goa-in-ksca-invitational-2600905-2024-09-16",
      "headline": "Arjun Tendulkar shines with 9-wicket haul in KSCA InvitationalArjun Tendulkar took nine wickets while playing for Goa in their match against Karnataka in the KSCA Invitational. He helped his team win the match by 189 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-training-chennai-rohit-sharma-virat-kohli-t-dilip-bcci-2600869-2024-09-16",
      "headline": "Virat Kohli's team wins fielding competition in Chennai trainingIndia's fielding coach T Dilip organised mini-competitions during the team's fielding training on Monday, September 16. Dilip revealed that Virat Kohli's team emerged as the winner after a high-intensity session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-china-asian-champions-trophy-2024-final-when-and-where-to-watch-live-2600865-2024-09-16",
      "headline": "India vs China Asian Champions Trophy 2024 final: When and where to watch liveThe defending champions India will face first-time finalists China in the summit clash of the  Asian Champions Trophy 2024. Find out all the live-streaming details of the much-anticipated final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-mahli-beardman-u19-world-cup-final-star-rewarded-with-australia-call-up-2600838-2024-09-16",
      "headline": "Who is Mahli Beardman? U19 World Cup final star rewarded with Australia call-upENG vs AUS: Fast bowler Mahli Beardman has earned his maiden call-up for the Australian national team for the ODI series against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kohlis-passion-is-unmatched-sarfaraz-recalls-rcb-days-before-bangladesh-tests-2600829-2024-09-16",
      "headline": "Kohli's passion is unmatched: Sarfaraz recalls RCB days before Bangladesh TestsSarfaraz Khan recalled his RCB days with Virat Kohli and said that the star batter's spirit and  passion is unmatched. Sarfaraz and Kohli reunite and this time for the Indian Test team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/olympics/story/international-olympic-committee-election-7-candidates-sebastian-coe-thomas-bach-2600827-2024-09-16",
      "headline": "Olympic champions, a multi-millionaire among 7 candidates for IOC presidencyThe head of World Athletics, Sebastian Coe, Prince Feisal al Hussein of Jordan, and  Kirsty Coventry, a two-time Olympic gold medallist in swimming from Zimbabwe, are amongst the seven candidates who will be in the race for the International Olympic Committee president role. Thomas Bach will vacate the prestigious position in 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-novak-djokovic-ex-coaches-clean-chit-doping-saga-2600815-2024-09-16",
      "headline": "Sinner hires Djokovic's ex-coaches after clean chit in doping saga Jannik Sinner roped in Marco Panichi and Ulises Badio after parting ways with Giacomo Naldi and Umberto Ferrara. The World No.1 recently won the US Open after beating Taylor Fritz in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-rohit-set-to-surpass-sehwag-for-most-sixes-by-an-indian-in-tests-2600805-2024-09-16",
      "headline": "IND vs BAN: Rohit set to surpass Sehwag for most sixes by an Indian in TestsRohit Sharma nears many crucial milestones as the Indian team is set to take on Bangladesh in a two-match Test series. The MA Chidambaram Stadium will host the Test opener on September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-bangladesh-team-hits-the-nets-in-their-first-practice-session-at-chepauk-2600765-2024-09-16",
      "headline": "Watch: Bangladesh team hits the nets in their first practice session at ChepaukThe Bangladesh team hit the nets as they had their first practice session at Chepauk Stadium on Monday. Bangladesh will face India in the first match of the Test series on September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/olympics/story/international-olympic-committee-election-7-candidates-sebastian-coe-thomas-bach-2600827-2024-09-16",
      "headline": "Olympic champions, a multi-millionaire among 7 candidates for IOC presidencyThe head of World Athletics, Sebastian Coe, Prince Feisal al Hussein of Jordan, and  Kirsty Coventry, a two-time Olympic gold medallist in swimming from Zimbabwe, are amongst the seven candidates who will be in the race for the International Olympic Committee president role. Thomas Bach will vacate the prestigious position in 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-novak-djokovic-ex-coaches-clean-chit-doping-saga-2600815-2024-09-16",
      "headline": "Sinner hires Djokovic's ex-coaches after clean chit in doping saga Jannik Sinner roped in Marco Panichi and Ulises Badio after parting ways with Giacomo Naldi and Umberto Ferrara. The World No.1 recently won the US Open after beating Taylor Fritz in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-rohit-set-to-surpass-sehwag-for-most-sixes-by-an-indian-in-tests-2600805-2024-09-16",
      "headline": "IND vs BAN: Rohit set to surpass Sehwag for most sixes by an Indian in TestsRohit Sharma nears many crucial milestones as the Indian team is set to take on Bangladesh in a two-match Test series. The MA Chidambaram Stadium will host the Test opener on September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-bangladesh-team-hits-the-nets-in-their-first-practice-session-at-chepauk-2600765-2024-09-16",
      "headline": "Watch: Bangladesh team hits the nets in their first practice session at ChepaukThe Bangladesh team hit the nets as they had their first practice session at Chepauk Stadium on Monday. Bangladesh will face India in the first match of the Test series on September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-girona-dani-olmo-injury-2600766-2024-09-16",
      "headline": "Barcelona suffer massive Dani Olmo setback ahead of Champions League openerFC Barcelona forward Dani Olmo has been ruled out for at least 4-5 weeks due to a hamstring injury sustained against Girona. The club confirmed the development on Monday, a day after the game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-mental-strength-women-t20-world-cup-harmanpreet-kaur-2600749-2024-09-16",
      "headline": "India focusing on mental strength ahead of T20 World Cup: HarmanpreetIndia women's team captain Harmanpreet Kaur said that the team was focusing on building their mental strength ahead of the T20 World Cup, set to be played in October. Harmanpreet believed that mentally strong teams win matches in crunch moments.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-pokes-fun-lucky-australia-3rd-t20i-abandoned-manchester-2600736-2024-09-16",
      "headline": "Ben Stokes pokes fun at 'lucky' Australia, as 3rd T20I gets abandoned  ENG vs AUS: Ben Stokes trolled Australia and called them lucky as the final T20I at the Old Trafford in Manchester was abadnoned without a ball being bowled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-asia-cup-harshitha-samarawickrama-icc-womens-player-of-the-month-award-2600711-2024-09-16",
      "headline": "Sri Lanka's Asia Cup hero wins ICC Women's Player of the Month award Sri Lanka's Harshitha Samarawickrama won the ICC Women's Player of the Month award for August after beating Ireland's Orla Prendergast and Gaby Lewis. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}