{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/gst-council-issues-key-guidelines-sale-used-vehicles-2654994-2024-12-25",
      "headline": "Understanding GST on used cars: Rules, examples, and exemptionsThe GST Council clarified rules for old vehicle sales, setting an 18 per cent tax on seller margins, exempting private sales and negative margins, and simplifying taxation for used and electric vehicles, ensuring fair application of GST across transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-bulletin-india-gdp-growth-economy-inflation-reserve-bank-of-india-2654906-2024-12-24",
      "headline": "Economy rebounds in Q3 with boost from festivals and rural demand: RBIAn article on the 'State of the Economy' in the December bulletin noted that the global economy continues to exhibit resilience with steady growth and moderating inflation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-lower-in-a-choppy-session-it-metal-stocks-weigh-2654640-2024-12-24",
      "headline": "Sensex, Nifty close lower in a choppy session; IT and metal stocks weighThe S&P BSE Sensex was down by 67.30 points to close at 78,472.87, while the NSE Nifty50 lost 23.35 points to end at 23,730.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/18-percent-gst-on-used-cars-finance-minister-nirmala-sitharaman-leave-you-paying-more-amit-malviya-2654625-2024-12-24",
      "headline": "18% GST on used cars: Do you have to pay tax on selling your car?The decision has sparked debates as it comes at a time when India's used car market is poised for growth. Many believe the move aims to tap into the rapidly expanding sector to boost government revenue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-capital-ipo-usd-2-billion-kotak-investment-banking-all-you-need-to-know-2654599-2024-12-24",
      "headline": "Tata Capital IPO buzz? All you need to knowIf the IPO goes through, it will be the Tata Group's second public offering in two decades. The last one was Tata Technologies' IPO in November last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/aakash-chaudhry-sparkl-edventure-funding-usd-4-million-zomato-zerodha-founders-nithin-kamath-deepinder-goyal-stmp-2654552-2024-12-24",
      "headline": "Who is Aakash Chaudhry? Zerodha, Zomato founders bet on Sparkl EdventureInvestors include Zomato founder Deepinder Goyal and Zerodha founder Nithin Kamath, who have backed the platform that aims to transform personalised learning for students."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanathan-textiles-ipo-allotment-check-step-by-step-guide-to-check-status-2654543-2024-12-24",
      "headline": "Sanathan Textiles IPO allotment: Check step-by-step guide to check statusSanathan Textiles IPO: Investors can verify their allotment status through two platforms: the Bombay Stock Exchange (BSE) website and the KFin Technologies portal. Here's a step-by-step guide:"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-nears-4-trillion-dollar-market-valuation-amid-ai-push-and-iphone-upgrade-hopes-2654536-2024-12-24",
      "headline": "Apple nears $4 trillion valuation amid AI push and iPhone upgrade hopesApple's strategic push into AI and its resilience in navigating market challenges have positioned the tech giant as a leader in the sector. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/greaves-cotton-stock-price-gains-over-10-percent-today-whats-behind-the-rally-2654529-2024-12-24",
      "headline": "Greaves Cotton share price gains over 10% today. What's behind the rally? Greaves Cotton stock price: The company's shares were trading 10.25% higher at Rs 252.70 on the BSE at 12:18 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-investment-share-price-jumps-12-percent-today-ipo-buzz-tata-capital-stmp-2654512-2024-12-24",
      "headline": "Explained: Why Tata Investment share price jumped 12% todayTata Investment stock price: At 11:53 am, shares of the company were up 11.51% to Rs 7,284 on the Bombay Stock Exchange (BSE). The surge followed reports that Tata Capital is gearing up for an initial public offering (IPO) worth Rs 15,000 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-markets-nse-bse-closed-on-december-25-christmas-2024-check-full-2025-holiday-schedule-2654493-2024-12-24",
      "headline": "Are stock markets closed on December 25? Check the full 2025 holiday scheduleOn regular weekdays, the stock market operates from 9:15 AM to 3:30 PM. A pre-opening session takes place from 9:00 AM to 9:15 AM to set the tone for the trading day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/irdai-report-indian-best-insurance-company-india-policies-medical-vehicle-claim-rejection-rate-data-2654475-2024-12-24",
      "headline": "Which insurance companies reject claims the least? Report reveals truthPeople don't just put in money but trust when they buy insurance policies to cover for medical emergencies or motor accidents. A report by the Insurance Brokers Association of India reveals how many such claims have been accepted or rejected by insurance companies in 2022-23."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/carraro-india-ipo-check-gmp-price-band-and-subscription-status-stmp-2654487-2024-12-24",
      "headline": "Carraro India IPO: Check GMP, price band and subscription statusCarraro India IPO is a Rs 1,250 crore offer for sale (OFS) consisting of 1.77 crore shares. As this is a pure OFS, the entire proceeds will go to the selling shareholders, and the company will not raise fresh capital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/senores-pharmaceuticals-ipo-latest-subscription-status-gmp-allotment-listing-date-stmp-2654473-2024-12-24",
      "headline": "Senores Pharmaceuticals IPO: Latest subscription status, GMP; listing dateSenores Pharmaceuticals IPO: The IPO comprises a fresh issue of shares worth Rs 500 crore and an offer-for-sale (OFS) of up to 21,00,000 equity shares by promoters and existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sagility-india-share-price-rises-5-percent-to-hit-upper-circuit-today-explained-stmp-2654468-2024-12-24",
      "headline": "Sagility India share price rises 5% to hit upper circuit today. Here's why Sagility India debuted on the stock market with an issue price of Rs 30 per share. At its current level, the stock has surged over 63% from the IPO price, underscoring strong investor interest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ventive-hospitality-ipo-check-subscription-latest-gmp-last-day-for-bidding-allotment-date-listing-stmp-2654463-2024-12-24",
      "headline": "Ventive Hospitality IPO: Check GMP as listing enters last day for biddingRetail investors must apply for a minimum of 23 shares per lot, which requires a minimum investment of Rs 14,789 for retail applicants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-as-market-rally-loses-steam-tcs-gains-1-percent-2654445-2024-12-24",
      "headline": "Sensex, Nifty open flat as market rally loses steam; TCS gains 1% The S&P BSE Sensex was up 47.25 points to 78,587.42, while the NSE Nifty50 was up by 10.80 points to 23,764.25 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-advisors-ipo-allotment-status-online-guide-gmp-today-listing-date-bse-nse-2654441-2024-12-24",
      "headline": "DAM Capital Advisors IPO allotment: Step-by-step guide to check statusDAM Capital Advisors IPO allotment: The allotment status can be checked by investors through the websites of either the Bombay Stock Exchange (BSE) or Link Intime India Private Ltd, the registrar for the issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mamata-machinery-ipo-allotment-status-step-by-step-guide-latest-gmp-listing-date-market-debut-2654435-2024-12-24",
      "headline": " Mamata Machinery IPO: Check allotment status, latest GMP and listing date Mamata Machinery IPO allotment: Investors who have bid can check their allotment status online by logging in to either the Bombay Stock Exchange (BSE) website or the website of Link Intime India Private Ltd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-market-opening-wipro-vedanta-adani-enterprises-tvs-motor-2654428-2024-12-24",
      "headline": "Stocks to watch today: Wipro, Vedanta, Adani Enterprises, TVS Motor Several companies are expected to remain in focus due to recent developments. Among them are Vedanta, Prestige Estates, Wipro, Adani Enterprises, and TVS Motor."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/former-home-secretary-ajay-kumar-bhalla-appointed-manipur-governor-2654907-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ex-bureaucrat Ajay Bhalla appointed Manipur Governor, Arif Khan moved to BiharAjay Kumar Bhalla will replace Lakshman Prasad Acharya, who assumed the office on July 31 this year, as Manipur Governor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/army-vehicle-plunges-into-gorge-in-jammu-kashmir-poonch-mendhar-2654799-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "5 soldiers dead after Army vehicle plunges into 350-foot gorge in J&K's PoonchA vehicle carrying 10 Army personnel lost control and fell into a 350-feet-deep gorge in Jammu and Kashmir's Poonch district, leaving five soldiers dead and many others injured. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-on-february-23-as-icc-announces-full-schedule-2654722-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Champions Trophy: India vs Pakistan on February 23 as ICC announces full scheduleChampions Trophy: The ICC announced the full schedule of the Champions Trophy on Tuesday, December 24. The India vs Pakistan group stage game is set to be played on February 23. In case India qualify for the final, the match will be played in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-second-list-delhi-election-farhad-suri-fielded-from-jangpura-mukesh-sharma-from-uttam-nagar-2654973-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress releases 2nd list for Delhi polls, two AAP turncoats get ticketsThe Congress party fielded two AAP turncoats, Asim Ahmed Khan and Devinder Sehrawat from Matia Mahal and Bijwasan seats, respectively, for the upcoming Delhi Assembly elections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/himachal-pradesh/photo/shimla-himachal-pradesh-snowfall-winter-december-weather-tourists-travel-trip-2654546-2024-12-24?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Pics: Shimla transforms into white wonderland, tourists enjoy fresh snowfallNestled in the serene hills of Himachal Pradesh, Shimla has turned into a postcard-perfect destination following the recent snowfall. Blanketed in pristine white, the Queen of Hills has come alive with the joy of tourists savouring the chill, walking on the white snow, and sipping hot tea amidst the picturesque landscapes. From Mall Road to Kufri, every corner is a visual delight. This photo gallery captures the essence of Shimla's snowy charm and the smiles it has brought to all."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/allu-arjun-questioned-pushpa-2-screening-stampede-case-hyderabad-police-home-barricades-2654472-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Allu Arjun questioned for 4 hours, said knew about death next day: SourcesAllu Arjun was questioned by the Hyderabad Police for four hours over the death of a 36-year-old woman in a stampede at Sandhya theatre during Pushpa 2's premiere on December 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/manu-bhaker-breaks-silence-on-khel-ratna-snub-awards-not-my-goal-2654653-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Manu Bhaker breaks silence on Khel Ratna snub: Believe there's been a lapseManu Bhaker remained undeterred despite being left out of the Khel Ratna nominations. The shooter emphasised her commitment to winning medals for India, stating that while awards motivate her, they are not the ultimate goal of her journey."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/story/delhi-crime-body-of-missing-8-year-old-girl-found-dumped-in-army-cantonment-area-2654918-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "8-year-old girl found dead in Army quarters in Delhi, teen arrested for murderAn eight-year-old girl was found murdered in Delhi's Army cantonment after being allegedly strangled by her 19-year-old neighbour. The accused was arrested within hours of committing the crime. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pv-sindhu-wedding-pictures-husband-venkatta-datta-sai-udaipur-grand-ceremony-2654801-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PV Sindhu shares dreamy wedding pictures with husband Venkatta Datta SaiPV Sindhu celebrated her grand wedding with Venkata Datta Sai in a traditional Telugu ceremony in Udaipur, surrounded by family and friends. The badminton icon shared the first proper images of her wedding via her social media handle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-song-dammunte-pattukora-viral-allu-arjun-legal-trouble-2654863-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pushpa 2 song Dammunte Pattukora lyrics go viral amid Allu Arjun's legal woesReleased during Allu Arjun's ongoing police investigation, the new song from Pushpa 2: The Rule has sparked mixed reactions for its timing and lyrics, igniting online debates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/christmas-goa-caught-beef-cow-vigilantism-quraishi-meat-traders-association-strike-december-23-2654719-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Beef crisis in Goa this Christmas as Quraishi traders go on strike over cow vigilantesGoa is facing a beef supply crisis this Christmas due to a strike by traders over the alleged rise in instances of cow vigilantism. The Quraishi Meat Traders Association began the protest on December 23, timing it with Christmas. It has vowed to continue the strike until the government guarantees the safety of traders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-is-bengaluru-because-of-north-indians-woman-remarks-viral-video-sparks-debate-2654785-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Bengaluru is Bengaluru because...': Woman's 'North Indian' remark sparks debateA video of a woman claiming that 'Bengaluru is Bengaluru because of North Indians' has gone viral on social media, sparking a fierce debate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/alcohol-curb-surat-gujrat-thailand-bangkok-flight-air-india-express-airline-limit-passengers-post-x-2654511-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Alcohol khatam, farsaan baaki: Did Gujarat-Thailand flyers hit booze limit?People on the first Air India flight from Surat to Bangkok claimed that they had polished off the entire alcohol stock on the plane. Air India Express officials refuted the claim, saying it was well-stocked. Did the passengers hit an unofficial limit on alcohol servings? Who takes such a call mid-air?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/vinod-kambli-develops-fever-in-hospital-condition-stable-2654988-2024-12-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vinod Kambli develops fever in hospital, condition stableVinod Kambli, battling a severe urinary infection and brain clots, is stable in ICU. Maharashtra Deputy CM Eknath Shinde and MP Shrikant Shinde have extended financial aid and support, ensuring the former cricketer receives top-notch medical care."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-rains-ncr-weather-update-christmas-temperature-national-capital-aqi-pollution-2654874-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rain lashes parts of Delhi on Christmas Eve, temperature dips below 10 degreesLight rain and cold waves gripped Delhi and its adjoining areas on Tuesday evening, with temperatures dropping to 9.9 degrees. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/18-percent-gst-on-used-cars-finance-minister-nirmala-sitharaman-leave-you-paying-more-amit-malviya-2654625-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "18% GST on used cars: Do you have to pay tax on selling your car?The decision has sparked debates as it comes at a time when India's used car market is poised for growth. Many believe the move aims to tap into the rapidly expanding sector to boost government revenue."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-bad-habits-drink-all-night-indiscipline-smoke-pipe-2654832-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I would drink all night: Aamir Khan reflects on his bad habitsAamir Khan, in a candid conversation with Nana Patekar, revealed his struggles with indiscipline and bad habits but shared how filmmaking keeps him grounded. He plans to release one film every year to stay disciplined.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/american-airlines-grounds-all-us-flights-due-to-technical-glitch-2654747-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Christmas travel scare in US as American Airlines briefly grounds all flightsAmerican Airlines posted on X that they are trying to fix the problem as soon as possible, but they cannot give a timeframe as to how long it exactly would take them to restore services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-frees-ex-bnp-minister-abdus-salam-pintu-harkat-ul-jihad-al-islami-huji-terrorism-india-pok-recruitment-arms-2654605-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bangladesh frees ex-minister who funded POK terrorists to bleed IndiaA Bangladesh court has freed former BNP minister Abdus Salam Pintu who helped in the recruitment and training of terrorists from Pakistan-Occupied Kashmir (POK). Pintu was in jail for 17 years after being convicted in the 2004 plot to assassinate Sheikh Hasina. He helped terror outfit HuJI with funds to procure arms and train recruits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/irdai-report-indian-best-insurance-company-india-policies-medical-vehicle-claim-rejection-rate-data-2654475-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Which insurance companies reject claims the least? Report reveals truthPeople don't just put in money but trust when they buy insurance policies to cover for medical emergencies or motor accidents. A report by the Insurance Brokers Association of India reveals how many such claims have been accepted or rejected by insurance companies in 2022-23."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/tripura-cancer-survivor-madhurima-baidya-clears-neet-in-first-attempt-success-story-2654808-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tripura cancer survivor Madhurima defies odds, clears NEET in first attemptMadhurima Baidya, a stage 4 cancer survivor from Tripura, cracked NEET 2024 and secured an MBBS seat on her first attempt. She spoke to us about her inspiring journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-1996-shyam-benegal-the-man-who-mainstreamed-parallel-cinema-2654750-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Archives (1996) | Shyam Benegal: The man who mainstreamed parallel cinemaThe legendary filmmaker, who died just as he turned 90, has left behind a rich bouquet of memorable movies. We celebrate a few"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/iceland-yule-book-flood-christmas-eve-unique-christmas-tradition-book-gifting-jolabokaflod-2654742-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How World War 2 scarcity birthed Iceland's Yule Book Flood on Christmas EveIceland's Jólabókaflóð, or 'Yule Book Flood', celebrates Christmas Eve with book gifting, creating a cosy night of reading and family bonding steeped in the country's rich literary tradition. Here's how this unique Christmas tradition began."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/auto/cars/story/kia-syros-htk-is-it-best-base-variant-among-compact-suvs-package-does-not-lie-2654739-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kia Syros HTK: Is it best base variant among compact SUVs? Package does not lieIn the Syros, Kia has introduced a model that offers a plethora of features, even in the base variant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/k-pop-stars-newjeans-promise-festive-cheer-in-exclusive-holiday-performance-glbs-2654990-2024-12-25",
      "headline": " K-Pop Stars NewJeans promise festive cheer in exclusive holiday performanceNewJeans will perform a Christmas mini-concert on Kim Hyun Jung's News Show, despite ongoing legal disputes with ADOR. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farida-jalal-remembers-shyam-benegal-2654914-2024-12-24",
      "headline": "Different from the rest: Farida Jalal remembers Shyam BenegalVeteran actor Farida Jalal recalls her memorable experience working with filmmaker Shyam Benegal, who died on Monday at the age of 90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-song-dammunte-pattukora-viral-allu-arjun-legal-trouble-2654863-2024-12-24",
      "headline": "Pushpa 2 song Dammunte Pattukora lyrics go viral amid Allu Arjun's legal woesReleased during Allu Arjun's ongoing police investigation, the new song from Pushpa 2: The Rule has sparked mixed reactions for its timing and lyrics, igniting online debates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/mahesh-bhatt-christmas-dinner-alia-bhatt-ranbir-kapoor-raha-neetu-2654879-2024-12-24",
      "headline": "Little Raha joins Alia and Ranbir at Mahesh Bhatt's Christmas dinnerMahesh Bhatt hosted a Christmas dinner on Tuesday. It was attended by Alia Bhatt, Ranbir Kapoor, Neetu Kapoor, and Pooja Bhatt. The family celebrated in style, with Raha making a sweet appearance."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/vinod-kambli-develops-fever-in-hospital-condition-stable-2654988-2024-12-25",
      "headline": "Vinod Kambli develops fever in hospital, condition stableVinod Kambli, battling a severe urinary infection and brain clots, is stable in ICU. Maharashtra Deputy CM Eknath Shinde and MP Shrikant Shinde have extended financial aid and support, ensuring the former cricketer receives top-notch medical care."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/australia-vs-india-another-pacer-harshit-rana-prasidh-krishna-boxing-day-test-melbourne-2654986-2024-12-25",
      "headline": "Harshit or Prasidh Krishna? Pujara says India need another pacer for MCG TestCheteshwar Pujara stressed the importance of adding an extra pacer for India's Boxing Day Test against Australia, even at the cost of a batter, as concerns grow over India's bowling depth despite Jasprit Bumrah's stellar performances in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/hockey-india-leauge-amit-rohidas-exclusive-platform-comeback-paris-olympics-2654912-2024-12-24",
      "headline": "HIL gave me a platform to make a comeback in the India team: Amit RohidasAmit Rohidas highlighted how the Hockey India League reignited his career, offering young players a vital platform to gain exposure and return stronger. With its revival, the league is poised to foster talent and bolster Indian hockey's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/herculean-harleen-fires-india-to-odi-series-win-vs-hapless-west-indies-2654901-2024-12-24",
      "headline": "Herculean Harleen fires India to ODI series win vs hapless West IndiesIndia sealed a commanding 115-run victory over West Indies in the second ODI, driven by Harleen Deol's maiden century and disciplined bowling. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/naman-ojhas-father-vinay-gets-7-years-of-imprisonment-in-bank-embezzlement-case-2654883-2024-12-24",
      "headline": " Naman Ojha's father Vinay gets 7-year jail term in embezzlement caseFormer India cricketer Naman Ojha's father, Vinay Ojha, was sentenced to 7 years in a Rs 1.25 crore bank embezzlement case from 2013. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/chelsea-not-part-of-title-race-enzo-maresca-premier-league-fulham-2654880-2024-12-24",
      "headline": "Chelsea boss Maresca says Chelsea' not part of Premier League title race'Enzo Maresca dismissed Chelsea's Premier League title chances, emphasising satisfaction with their remarkable progress despite a shaky start. Chelsea's resurgence under his guidance is notable, but Maresca believes they still lack the consistency to challenge Liverpool's dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/travis-head-treated-jasprit-bumrah-like-any-regular-bowler-greg-chapell-2654854-2024-12-24",
      "headline": "Travis Head treated Jasprit Bumrah like any regular bowler: Greg ChapellGreg Chappell opened about how Travis Head has managed to nullify the Jasprit Bumrah threat and treat him like any regular bowler"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/harvinder-singh-paralympics-khel-ratna-discrimination-tokyo-paris-games-controversy-2654826-2024-12-24",
      "headline": "Paralympics gold-medalist Harvinder adds to burning Khel Ratna controversyHarvinder Singh, Paris Paralympics gold medallist, criticised the exclusion of Paralympians from the Khel Ratna Award nominations, sparking concerns about recognition disparities in India's highest sporting honours compared to achievements celebrated after Tokyo 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-axar-first-child-wife-meha-name-haksh-patel-2654809-2024-12-24",
      "headline": "Axar Patel, wife Meha blessed with baby boy, reveal child's nameIndia all-rounder Axar Patel and his wife Meha announced the birth of their first child. The parents of the newborn baby revealed the child's name on Instagram.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-announce-playing-xi-for-boxing-day-test-vs-pakistan-named-debutant-2654805-2024-12-24",
      "headline": "South Africa announce playing XI for Boxing Day Test vs Pakistan, named debutantSouth Africa announced their playing XI for the Boxing Day Test vs Pakistan.  Corbin Bosch is all set to make his debut in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pv-sindhu-wedding-pictures-husband-venkatta-datta-sai-udaipur-grand-ceremony-2654801-2024-12-24",
      "headline": "PV Sindhu shares dreamy wedding pictures with husband Venkatta Datta SaiPV Sindhu celebrated her grand wedding with Venkata Datta Sai in a traditional Telugu ceremony in Udaipur, surrounded by family and friends. The badminton icon shared the first proper images of her wedding via her social media handle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/travis-head-treated-jasprit-bumrah-like-any-regular-bowler-greg-chapell-2654854-2024-12-24",
      "headline": "Travis Head treated Jasprit Bumrah like any regular bowler: Greg ChapellGreg Chappell opened about how Travis Head has managed to nullify the Jasprit Bumrah threat and treat him like any regular bowler"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/harvinder-singh-paralympics-khel-ratna-discrimination-tokyo-paris-games-controversy-2654826-2024-12-24",
      "headline": "Paralympics gold-medalist Harvinder adds to burning Khel Ratna controversyHarvinder Singh, Paris Paralympics gold medallist, criticised the exclusion of Paralympians from the Khel Ratna Award nominations, sparking concerns about recognition disparities in India's highest sporting honours compared to achievements celebrated after Tokyo 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-axar-first-child-wife-meha-name-haksh-patel-2654809-2024-12-24",
      "headline": "Axar Patel, wife Meha blessed with baby boy, reveal child's nameIndia all-rounder Axar Patel and his wife Meha announced the birth of their first child. The parents of the newborn baby revealed the child's name on Instagram.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-announce-playing-xi-for-boxing-day-test-vs-pakistan-named-debutant-2654805-2024-12-24",
      "headline": "South Africa announce playing XI for Boxing Day Test vs Pakistan, named debutantSouth Africa announced their playing XI for the Boxing Day Test vs Pakistan.  Corbin Bosch is all set to make his debut in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pv-sindhu-wedding-pictures-husband-venkatta-datta-sai-udaipur-grand-ceremony-2654801-2024-12-24",
      "headline": "PV Sindhu shares dreamy wedding pictures with husband Venkatta Datta SaiPV Sindhu celebrated her grand wedding with Venkata Datta Sai in a traditional Telugu ceremony in Udaipur, surrounded by family and friends. The badminton icon shared the first proper images of her wedding via her social media handle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-schedule-format-final-options-reserve-days-hybrid-model-2654752-2024-12-24",
      "headline": "Explained: Why Champions Trophy final in Dubai and not Pakistan if India qualifyChampions Trophy 2025: India will play all their matches in Dubai. If India don't reach the final, then the Gaddafi Stadium in Lahore will host the title match. Pakistan will host 11 out of the 15 matches in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-mohammed-shami-snub-cannot-be-gruged-aakash-chopra-injury-2654748-2024-12-24",
      "headline": "Cannot grudge Shami snub vs Australia: Aakash Chopra on pacer's injuryAakash Chopra supported BCCI's decision to exclude Mohammed Shami from the Border-Gavaskar Trophy squad, citing the pacer's ongoing knee injury recovery and emphasizing the importance of not rushing him back into high-pressure international cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/indias-full-schedule-for-champions-trophy-2025-all-you-need-to-know-2654745-2024-12-24",
      "headline": "India's full schedule for Champions Trophy 2025. All you need to knowCheckout India's full schedule for Champions Trophy 2025, including fixtures, dates and venues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-on-february-23-as-icc-announces-full-schedule-2654722-2024-12-24",
      "headline": "Champions Trophy: India vs Pakistan on February 23 as ICC announces full scheduleChampions Trophy: The ICC announced the full schedule of the Champions Trophy on Tuesday, December 24. The India vs Pakistan group stage game is set to be played on February 23. In case India qualify for the final, the match will be played in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shooting-manu-bhaker-khel-ratna-snub-coach-jaspal-rana-reaction-2654715-2024-12-24",
      "headline": "Khel Ratna snub 'humilation' might affect Manu Bhaker's progress: Coach RanaManu Bhaker's coach lashed out at the national sports bodies over the omission of Manu Bhaker's name from the list of nominees for Major Dhyan Chand Khel Ratna award. Manu won two bronze medals in shooting at the Paris Olympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/west-indies-test-team-to-tour-pakistan-for-1st-time-since-2006-announce-squad-2654705-2024-12-24",
      "headline": "West Indies Test team to tour Pakistan for 1st time since 2006, announce squadAmir Jangoo earns his maiden Test call-up, while Gudakesh Motie returns as West Indies prepare for their first Test series in Pakistan since 2006. Kraigg Brathwaite leads a 15-member squad, aiming for a strong finish to the WTC cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-west-indies-women-harleen-deol-maiden-odi-century-vadodara-2654701-2024-12-24",
      "headline": "Harleen hits maiden ODI century in India's fiery batting-show vs West IndiesHarleen Deol dazzled with her maiden ODI century, leading India to their highest ODI total against West Indies. Her composed yet aggressive innings placed her alongside legends, showcasing India's batting brilliance in a dominant series display."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/smriti-mandhana-jumps-to-2nd-spot-in-odi-and-t20i-batting-rankings-2654681-2024-12-24",
      "headline": "Smriti Mandhana jumps to 2nd spot in ODI and T20I batting rankingsSmriti Mandhana's stellar performances catapulted her to the 2nd spot in the ODI and T20I batting rankings, highlighting her consistency with five consecutive 50-plus scores. Her dominance cements her as a crucial asset in India's batting lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shooting-manu-bhaker-khel-ratna-snub-coach-jaspal-rana-reaction-2654715-2024-12-24",
      "headline": "Khel Ratna snub 'humilation' might affect Manu Bhaker's progress: Coach RanaManu Bhaker's coach lashed out at the national sports bodies over the omission of Manu Bhaker's name from the list of nominees for Major Dhyan Chand Khel Ratna award. Manu won two bronze medals in shooting at the Paris Olympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/west-indies-test-team-to-tour-pakistan-for-1st-time-since-2006-announce-squad-2654705-2024-12-24",
      "headline": "West Indies Test team to tour Pakistan for 1st time since 2006, announce squadAmir Jangoo earns his maiden Test call-up, while Gudakesh Motie returns as West Indies prepare for their first Test series in Pakistan since 2006. Kraigg Brathwaite leads a 15-member squad, aiming for a strong finish to the WTC cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-west-indies-women-harleen-deol-maiden-odi-century-vadodara-2654701-2024-12-24",
      "headline": "Harleen hits maiden ODI century in India's fiery batting-show vs West IndiesHarleen Deol dazzled with her maiden ODI century, leading India to their highest ODI total against West Indies. Her composed yet aggressive innings placed her alongside legends, showcasing India's batting brilliance in a dominant series display."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/smriti-mandhana-jumps-to-2nd-spot-in-odi-and-t20i-batting-rankings-2654681-2024-12-24",
      "headline": "Smriti Mandhana jumps to 2nd spot in ODI and T20I batting rankingsSmriti Mandhana's stellar performances catapulted her to the 2nd spot in the ODI and T20I batting rankings, highlighting her consistency with five consecutive 50-plus scores. Her dominance cements her as a crucial asset in India's batting lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-bowling-viral-video-melbourne-test-flaunts-ball-grip-2654671-2024-12-24",
      "headline": "Watch: Rohit to bowl in Melbourne Test? India skipper flaunts grip in netsRohit Sharma's viral ball-grip moment fuelled speculation about his potential role as a bowler in India's Boxing Day Test against Australia, raising excitement as the skipper aims to navigate mounting criticism over his form and leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/manu-bhaker-breaks-silence-on-khel-ratna-snub-awards-not-my-goal-2654653-2024-12-24",
      "headline": "Manu Bhaker breaks silence on Khel Ratna snub: Believe there's been a lapseManu Bhaker remained undeterred despite being left out of the Khel Ratna nominations. The shooter emphasised her commitment to winning medals for India, stating that while awards motivate her, they are not the ultimate goal of her journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/manu-bhaker-khel-ratna-award-snub-controversy-paris-olympics-india-medals-2654610-2024-12-24",
      "headline": "Should have made Manu Bhaker a cricketer, not shooter: Father on Khel Ratna snubDouble Olympic medallist Manu Bhaker was reportedly snubbed from the Khel Ratna nominees list. Manu's father reacted to the reports and said that he should have made his daughter a cricketer and not a shooter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-vinod-kambli-thane-hospital-health-update-bed-song-we-are-champions-2654575-2024-12-24",
      "headline": "Watch: Vinod Kambli sings from hospital bed, shares positive health updateFormer India cricketer Vinod Kambli appeared emotional as he spoke to the media from a private hospital in Thane on Tuesday. The member of 1996 World Cup team was hospitalised on Saturday after his health deteriorated. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}