{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-gst-rates-from-september-22-cheaper-costlier-list-of-products-list-2790847-2025-09-21",
      "headline": "GST 2.0 from tomorrow: Your guide to what's getting cheaper and what's costlierFor households, GST 2.0 brings savings on groceries, dairy, and appliances, while many luxury and sin goods will become more expensive starting tomorrow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-refund-delay-under-processin-how-to-check-status-and-what-to-do-next-2790817-2025-09-21",
      "headline": "ITR refund under processing? Here's how to check status and what to do nextIf your refund remains under processing, first ensure your ITR has been e-verified, as refunds cannot be processed without this step. You can also check Form 26AS to verify if the refund has already been credited to your account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-grocery-runs-to-gym-sessions-what-today-homebuyers-really-want-2790798-2025-09-21",
      "headline": "From grocery runs to gym sessions: What today's homebuyers really wantToday's urban buyers want more than a home, they seek a lifestyle where comfort, convenience, and community come together, and daily needs, work, and wellness coexist effortlessly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-leads-indian-delegation-us-trade-talks-september-22-2025-2790679-2025-09-20",
      "headline": "Piyush Goyal to visit US for trade talks on September 22 amid tariff, H-1B tensionsThe minister will visit New York and will be accompanied by special secretary in the ministry Rajesh Agrawal and other officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-h1b-visa-fee-hike-100000-panic-indian-professionals-travel-disruption-diwali-2790663-2025-09-20",
      "headline": "H-1B visa holders cancel trips to India for weddings, Diwali amid new fee hikeWhile many cancelled plans to travel at the last minute while waiting to board flights to India, several others already in India are scrambling to return amid lack of clarity after Trump on Friday signed a proclamation to raise the H-1B visa fees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amul-cuts-prices-of-700-products-ghee-cheaper-by-rs-40-per-litre-from-september-22-mother-dairy-gst-rate-cuts-2790620-2025-09-20",
      "headline": "Amul cuts prices of 700 products, ghee cheaper by Rs 40 per litre from Sept 22Amul, marketed by the Gujarat Cooperative Milk Marketing Federation (GCMMF), on Saturday announced a price reduction for over 700 products, including ghee, butter, ice cream, cheese, and frozen snacks. The move comes after a GST rate cut, with the company passing the benefits to consumers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nasscom-warns-us-100000-h1b-visa-fee-impact-indian-it-firms-2790579-2025-09-20",
      "headline": "H-1B visa fee hike will disrupt Indian tech ops, 1-day deadline concerning: NasscomNasscom cautioned that Indian nationals employed on H-1B visas will be directly impacted, while technology companies will face disruption in ongoing client projects requiring onshore deployment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-your-itr-refund-delayed-heres-why-the-process-is-taking-longer-this-year-2790516-2025-09-20",
      "headline": "ITR refund delayed? Here's why the process may take longer this yearTax refunds this year are taking longer than usual, leaving many taxpayers waiting and prompting questions about delays, processing times, and what to expect in the weeks ahead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-trap-india-mis-selling-policies-irdai-agent-rbm-commissions-bank-targets-financial-illiteracy-2790046-2025-09-20",
      "headline": "Why India's insurance market has become a breeding ground for mis-sellingFrom loans tied to unwanted policies to agents chasing fat commissions, insurance policies that were meant to shield families have instead become a trap for many. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cryptocurrency-a-bigger-challenge-to-dollar-than-brics-currency-says-wef-president-2790312-2025-09-19",
      "headline": "Cryptocurrency a bigger challenge to dollar than BRICS currency, says WEF PresidentSpeaking in an exclusive conversation with India Today TV, Brende said de-dollarisation is unlikely in the near term. He added that cryptocurrency is a bigger challenge to the dollar than a potential BRICS currency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-powers-18-percent-of-global-growth-wef-president-borge-brende-sees-tariff-row-with-us-easing-soon-2790284-2025-09-19",
      "headline": "India powers 18% of global growth, WEF chief sees tariff row with US easing soonIn an exclusive interaction with India Today TV, WEF President Borge Brende described India's rapid expansion as a source of \"exported prosperity\" to the world. \"Just imagine what it means for global prosperity. So, you are exporting prosperity by growing so fast,\" he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/a-widow-wait-a-worker-fight-the-human-struggle-behind-pf-claims-2790021-2025-09-19",
      "headline": "A widow's wait, a worker's fight: The human struggle behind PF claimsIn Part 2 of our series on the PF claim crisis, we look at why, for so many Indians, withdrawing their own savings has turned into a struggle, forcing them to fight for money that is rightfully theirs."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-box-office-day-2-akshay-arshad-film-earns-rs-32-crore-in-two-days-2790815-2025-09-21",
      "headline": "Jolly LLB 3 box office Day 2: Akshay, Arshad's film earns Rs 32 crore in two days'Jolly LLB 3', featuring actors Akshay Kumar and Arshad Warsi, collected Rs 32 crore in two days. The comedy-drama has benefitted from word-of-mouth, which is reflected in its second day earnings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-weekend-ka-vaar-gaurav-khanna-criticised-for-inactivity-awez-darbar-neelam-giri-clash-2790797-2025-09-21",
      "headline": "Bigg Boss 19 Weekend Ka Vaar: Gaurav criticised for inactivity, Awez-Neelam clashActor Salman Khan confronted 'Bigg Boss 19' contestant Gaurav Khanna over his laidback approach on 'Weekend Ka Vaar'. This criticism came after Gaurav was also called out by housemates during the 'Thumbnail' task. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/zubeen-gargs-body-reaches-guwahati-fans-bid-farewell-to-singer-2790764-2025-09-21",
      "headline": "Zubeen Garg's body reaches Guwahati, fans bid farewell to singerSinger Zubin Garg has passed away following a swimming accident in Singapore. His mortal remains have reached Guwahati, after being received in Delhi by Assam Chief Minister Himanta Biswa Sarma. Large crowds of fans have gathered at the singer's residence, with many waiting overnight to pay their respects. A reporter at the scene stated, \"the entire Guwahati as well as Assam has shut down itself to pay tribute to the legend Dubinderg.\" The widespread public grief is being compared to that seen after the death of Bhupen Hazarika in 2011. Garg's body will be taken from his residence to Sorosadhai Stadium in Guwahati, where the public can pay their final tributes. Prime Minister Narendra Modi and other artists have also expressed their condolences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/idli-kadai-trailer-dhanush-returns-to-his-roots-to-save-family-legacy-2790804-2025-09-21",
      "headline": "Idli Kadai trailer: Dhanush returns to his roots to save family legacyThe trailer of actor-director Dhanush's 'Idli Kadai' depicts a son's struggle to protect his family legacy. The film explores tradition versus modernity amid personal betrayal and reconciliation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-honours-helmet-man-of-india-on-kbc-17-praises-his-selfless-work-2790781-2025-09-21",
      "headline": "Amitabh Bachchan honours Helmet Man of India on KBC 17, praises his selfless workActor Amitabh Bachchan honoured Raghvendra Kumar, known as the Helmet Man of India, for his selfless efforts in promoting helmet safety among bike riders. The veteran praised Kumar for his contribution towards social awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-garg-body-kept-at-guwahati-stadium-himanta-biswa-sarma-pays-tribute-2790762-2025-09-21",
      "headline": "Zubeen Garg's body kept at Guwahati stadium, Himanta Biswa Sarma pays tributeThe body of Assamese singer Zubeen Garg is placed at Sarusajai Stadium in Guwahati. The state mourns his tragic death and pays tribute to the cultural icon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vicky-kaushal-honoured-as-aamir-khan-picks-him-as-bhuvan-for-lagaan-remake-2790718-2025-09-21",
      "headline": "Vicky Kaushal honoured as Aamir Khan picks him as Bhuvan for Lagaan remakeActor Vicky Kaushal reacted to Aamir Khan calling him Bhuvan if 'Lagaan' was remade today. The 'Chhaava' actor expressed gratitude to Khan for the comparison."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammooty-khushboo-sundar-celebs-congratulate-mohanlal-dadasaheb-phalke-award-2790627-2025-09-20",
      "headline": "Mammootty to Khushboo, celebs congratulate Mohanlal for Dadasaheb Phalke AwardActors Mammootty and Khushboo Sundar, amongst others, extended their best wishes to Mohanlal. On Saturday, it was announced that the actor will be honoured with the Dadasaheb Phalke Award at the 71st National Film Awards. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/assam-three-day-mourning-singer-zubeen-garg-death-2790617-2025-09-20",
      "headline": "Assam declares three-day mourning over singer Zubeen Garg's deathAssam Chief Minister Himanta Biswa Sarma has directed a state mourning over late singer Zubeen Garg's death. All official entertainment and celebrations have been put on hold during the mourning. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/malayalam-superstar-mohanlal-to-get-dadasaheb-phalke-award-2023-for-contribution-to-indian-cinema-2790610-2025-09-20",
      "headline": "Mohanlal to receive Dadasaheb Phalke Award for contribution to Indian cinemaMalayalam superstar Mohanlal is set to receive the Dadasaheb Phalke Award for contribution to Indian Cinema. The award will be presented to him at the 71st National Film Awards on September 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-aniston-the-morning-show-season-4-reese-witherspoon-want-to-come-to-india-2790599-2025-09-20",
      "headline": "Exclusive: Jennifer Aniston wants to come for silent retreat and meditation to IndiaHollywood star Jennifer Aniston shared in an exclusive interview that she wants her next visit to India to be centred on spirituality. She hopes to take part in a silent retreat and experience meditation in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-salman-khan-schools-gaurav-mridul-over-inactivity-playing-safe-2790573-2025-09-20",
      "headline": "Bigg Boss 19: Salman Khan schools Gaurav, Mridul over inactivity, playing safeActor Salman Khan returned to Bigg Boss 19 after missing last week's episode. He schooled contestant Mridul Tiwari for playing too safe inside the reality series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-aneet-padda-ahaan-panday-dating-in-real-life-what-we-know-so-far-2790563-2025-09-20",
      "headline": "Are Saiyaara's Aneet and Ahaan dating in real life? Here's what we knowActors Aneet Padda and Ahaan Panday, the lead pair from 'Saiyaara', are reportedly dating in real life. However, they have been advised to keep their relationship private for now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-diplomat-season-3-trailer-keri-russell-lands-in-unexpected-political-storm-2790280-2025-09-20",
      "headline": "The Diplomat Season 3 trailer: Keri Russell lands in unexpected political stormThe first trailer for 'The Diplomat Season 3', featuring actors Keri Russell and Bradley Whitford was recently released. The new season promises intense political drama following the death of the president and rising tensions within the British government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/homebound-oscars-kareena-kapoor-khan-arjun-kapoor-ananya-panday-extend-wishes-2790557-2025-09-20",
      "headline": "Homebound picked for Oscars: Kareena, Arjun, Ananya and others extend wishesActors Kareena Kapoor, Arjun Kapoor, Ananya Panday, among other celebrities have congratulated the team behind 'Homebound.' The film has been selected as India's official entry for the 2026 Oscars. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kapil-sharma-netflix-show-faces-firoz-nadiadwala-rs-25-crore-suit-baburao-character-2790544-2025-09-20",
      "headline": "Kapil Sharma's Netflix show faces Rs 25 crore lawsuit over Baburao characterProducer Firoz Nadiadwala has issued a legal notice against Netflix for unauthorised use of the Baburao character. The lawsuit highlights serious copyright and trademark violations, demanding removal and apology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-jennifer-aniston-reese-witherspoon-discuss-ai-say-it-is-frightening-2790504-2025-09-20",
      "headline": "Exclusive: Jennifer Aniston, Reese Witherspoon discuss AI, say it's frighteningActors Jennifer Aniston and Reese Witherspoon discussed AI's impact, labelling it as 'frightening', in an exclusive interview with India Today. Their fourth season of their series 'The Morning Show', addresses AI, deepfakes, and media challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/manoj-bajpayee-the-family-man-season-3-update-raj-and-dk-prime-video-series-2790511-2025-09-20",
      "headline": "Manoj Bajpayee marks 6 years of The Family Man, shares Season 3 updateAs 'The Family Man' marked six years of release, actor Manoj Bajpayee shared an update on its third season. Directors Raj and DK also expressed gratitude to fans for the success of the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/akshay-kumar-stuntmen-the-great-indian-kapil-sharma-show-season-3-final-episode-2790493-2025-09-20",
      "headline": "Akshay Kumar credits career to stuntmen on The Great Indian Kapil ShowActor Akshay Kumar credited his career's success to stuntmen on 'The Great Indian Kapil Show season 3' finale. He also shared a light-hearted banter with the show's host Kapil Sharma and the rest of the cast as he engaged in playful activities. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-address-nation-5-pm-today-gst-reform-trump-tariffs-h-1b-festive-season-2790796-2025-09-21",
      "headline": "PM Modi to address nation at 5 pmPrime Minister Narendra Modi's address will come on the eve of Navratri, the day from when the GST rate cuts will kick in, with the prices of several products set to come down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-gaali-row-returns-bjp-claims-pms-mother-abused-at-tejashwi-yadav-rally-2790782-2025-09-21",
      "headline": "Bihar 'gaali' row returns, BJP claims PM's mother abused at Tejashwi Yadav rallyOn the other hand, RJD MLA from the Mahua constituency, Mukesh Roushan, smelt a conspiracy, claiming that the viral video had been doctored by the BJP to defame Tejashwi and the party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/h1b-visa-flight-fares-surge-india-us-4chan-blocks-bookings-trump-order-2790740-2025-09-21",
      "headline": "4Chan, MAGAs unite in 'clog the toilet' op to block H-1B workers flying backUS-India airfares spiked after Trump's H-1B visa order, as 4Chan users ran 'Operation Clog the Toilet' to inflate prices, disrupting H-1B holders' travel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/white-house-defends-100000-h1b-visa-fee-protect-us-workers-2790774-2025-09-21",
      "headline": "Firm got 25,075 H-1Bs, axed 27,000 US jobs: White House 'factsheet' on visa moveA White House 'factsheet' justified President Donald Trump's measure to impose a USD 100,000 (over Rs 88 lakh) on new H-1B visa applications, asserting that companies were hiring foreign workers while laying off thousands of American employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/india-land-of-kama-sutra-cannot-kiss-kamasutra-indian-society-superman-kissing-scene-censor-board-censorship-2790585-2025-09-21",
      "headline": "Why the land of Kama Sutra can't kissIndians find it difficult to kiss, and in India even Superman can't kiss in public. A simple Google search shows Indians trying to learn the art of the lip-lock. While India is referred to as the land of Kama Sutra on anything intimate or erotic, kissing was never part of the culture. But why has India, which has adopted and adapted both cultures and behaviours, failed to embrace the kiss?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-2025-super-4s-preview-team-news-playing-xis-dubai-2790742-2025-09-21",
      "headline": "Asia Cup, Super 4: Drama off-field, India look to repeat Pakistan routThe India–Pakistan rivalry returns to Dubai, with Sunday's Super 4s clash carrying extra spice. After the handshake controversy from their last meeting, the rematch promises fresh drama alongside the cricketing battles that matter most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/new-us-h-1b-visa-fee-of-usd-100000-will-apply-only-to-new-applications-not-to-existing-holders-reports-2790693-2025-09-20",
      "headline": "One-time $100K H-1B visa fee only for fresh applicants, not current holders: USThe White House clarified its new USD 100,000 H-1B fee applies only to fresh applicants, not current holders, easing panic among Indian tech workers after President Donald Trump's visa overhaul sparked fears of mass disruption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/americas-loss-indian-and-us-figures-shred-trump-over-discriminatory-h1-b-move-2790745-2025-09-21",
      "headline": "America's loss: Indian and US figures shred Trump over 'discriminatory' H-1B moveSeveral Indian and American figures lashed out at the Donald Trump administration's clampdown on the H-1B programme, asserting that the move was discriminatory and would create ripples in the US economy, while offering young Indian professionals a chance to return home to build their futures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/breakup-bob-the-summer-i-turned-pretty-trend-2790806-2025-09-21",
      "headline": "Move on... get a breakup bobMove over breakup bangs. Belly in 'The Summer I Turned Pretty' brings back breakup bob. Read on to know why it is the boldest post-breakup move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-80-gap-why-most-indians-are-underinsured-and-why-its-time-to-act-2787740-2025-09-15",
      "headline": "The 80% gap: Why most Indians are underinsured and why it's time to actThe solution lies in choosing a comprehensive life cover that reflects modern realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-where-careers-begin-with-confidence-2788009-2025-09-16",
      "headline": "University of Bath School of Management: Where Careers Begin With ConfidenceWith students from over 160 countries and a strong alumni network spanning 130 nations, the School creates a community that feels global in reach yet personal in experience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/lalu-prasad-yadav-family-rift-rohini-acharya-sanjay-yadav-influence-tejashwi-bihar-elections-2790583-2025-09-20",
      "headline": "Cryptic posts by Lalu Yadav's daughter spark fresh rift rumours in familyA fresh dispute has surfaced in the family of Lalu Prasad Yadav after his daughter Rohini Acharya expressed discontent over the growing influence of Sanjay Yadav, a close aide of Tejashwi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-2025-handshake-row-gill-redemption-super-4s-clash-2790749-2025-09-21",
      "headline": "Handshake row 2.0, Shubman Gill redemption? Key things to watch in IND vs PAK clashThe India–Pakistan rivalry returns to Dubai, with Sunday's Super 4s clash carrying extra spice. After the handshake controversy from their last meeting, the rematch promises fresh drama alongside the cricketing battles that matter most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-gst-rates-from-september-22-cheaper-costlier-list-of-products-list-2790847-2025-09-21",
      "headline": "GST 2.0 from tomorrow: Your guide to what's getting cheaper and what's costlierFor households, GST 2.0 brings savings on groceries, dairy, and appliances, while many luxury and sin goods will become more expensive starting tomorrow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-rivalry-drama-asia-cup-2025-dubai-2790748-2025-09-21",
      "headline": "India vs Pakistan: Will off-field drama be rivalry's saving grace again?India and Pakistan meet once again on Sunday, September 21. Will the off-field drama be enough to mask what has turned into to be a dud contest?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-honours-helmet-man-of-india-on-kbc-17-praises-his-selfless-work-2790781-2025-09-21",
      "headline": "Amitabh Bachchan honours Helmet Man of India on KBC 17, praises his selfless workActor Amitabh Bachchan honoured Raghvendra Kumar, known as the Helmet Man of India, for his selfless efforts in promoting helmet safety among bike riders. The veteran praised Kumar for his contribution towards social awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/indian-engineers-win-ig-nobel-prize-for-uv-lamp-shoe-racks-that-fight-bad-odour-2790814-2025-09-21",
      "headline": "Smelly shoes land Indian engineer duo the Nobel Prize of weird scienceTwo Indian engineers have won the 2025 Ig Nobel Prize, a quirky science prize, for creating shoe-racks fitted with UV lamps to fight foul odour. Their award-winning design turned a common hostel problem into global recognition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-524-19-09-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ulips-mutual-funds-why-you-need-both-for-a-balanced-portfolio-2789465-2025-09-19",
      "headline": "ULIPs & Mutual Funds: Why you need both for a balanced portfolioULIPs give you protection and discipline for the long haul, while mutual funds give you liquidity and flexibility for the near term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/fasting-benefits-natural-detox-fat-burning-autophagy-health-science-2790079-2025-09-21",
      "headline": "Less food, more power: The fasting playbookFasting is an ancient practice that supports natural detox and body repair. It combines traditional wisdom with modern science to promote health and wellness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/partial-solar-eclipse-2025-last-eclipse-of-the-year-to-eerily-dim-the-sun-today-2790655-2025-09-21",
      "headline": "Partial solar eclipse 2025 to eerily dim the Sun today: How to watch itPartial solar eclipses are more frequent than total ones, but each occurrence is unique in its path and visibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/zubeen-gargs-body-reaches-guwahati-fans-bid-farewell-to-singer-2790764-2025-09-21",
      "headline": "Zubeen Garg's body reaches Guwahati, fans bid farewell to singerSinger Zubin Garg has passed away following a swimming accident in Singapore. His mortal remains have reached Guwahati, after being received in Delhi by Assam Chief Minister Himanta Biswa Sarma. Large crowds of fans have gathered at the singer's residence, with many waiting overnight to pay their respects. A reporter at the scene stated, \"the entire Guwahati as well as Assam has shut down itself to pay tribute to the legend Dubinderg.\" The widespread public grief is being compared to that seen after the death of Bhupen Hazarika in 2011. Garg's body will be taken from his residence to Sorosadhai Stadium in Guwahati, where the public can pay their final tributes. Prime Minister Narendra Modi and other artists have also expressed their condolences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/h1b-rules-salaries-of-coders-mean-it-might-be-more-economical-for-us-tech-firms-to-open-offices-outside-2790775-2025-09-21",
      "headline": "H-1B fee hike may push US tech firms to open more offices abroadUS President Donald Trump has introduced a one-time $100,000 fee on new H-1B visa petitions. This move could reshape global tech hiring and prompt Indian firms to reconsider their US operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-grocery-runs-to-gym-sessions-what-today-homebuyers-really-want-2790798-2025-09-21",
      "headline": "From grocery runs to gym sessions: What today's homebuyers really wantToday's urban buyers want more than a home, they seek a lifestyle where comfort, convenience, and community come together, and daily needs, work, and wellness coexist effortlessly."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/anandkumar-velkumar-second-gold-world-speed-skating-championships-india-2790822-2025-09-21",
      "headline": "Anandkumar Velkumar wins 42km marathon, becomes India's first double World Skating champAnandkumar Velkumar won his second gold at the World Speed Skating Championships. His historic performance is set to boost speed skating's profile in India and inspire future athletes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/saif-hassan-bangladesh-asia-cup-2025-final-confidence-2790827-2025-09-21",
      "headline": "Bangladesh confident of reaching Asia Cup 2025 final: Saif Hassan after SL winBangladesh opener Saif Hassan has said that the team is confident that they will reach the final of the Asia Cup 2025. Hassan was the star of the show as Bangladesh defeated Sri Lanka to start their Super 4s stage on a high. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-backs-match-referee-pycroft-icc-rejects-pcb-removal-asia-cup-2025-2790808-2025-09-21",
      "headline": "Andy Pycroft not a schoolteacher or principal: Ashwin slams Pakistan anticsRavichandran Ashwin has supported match referee Andy Pycroft amid criticism from PCB over the Asia Cup handshake controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-death-bowling-concerns-pakistan-super-4-ind-vs-pak-2790707-2025-09-21",
      "headline": "Second seamer a must? India face tough questions after death overs strugglesAsia Cup 2025: India have been clinical in their Asia Cup campaign so far with resounding wins against UAE, Pakistan and Oman. However, their death bowling woes have been exposed in the last two fixtures, which could backfire going ahead into the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-india-vs-pakistan-after-off-field-drama-focus-on-cricketing-battle-of-unequals-in-super-4-2790800-2025-09-21",
      "headline": "IND vs PAK: After off-field drama, focus on battle of unequals in Super 4A rivalry once seen as the best in the world, India vs Pakistan has become a one-sided affair in recent times. Will Suryakumar Yadav and his men continue their dominance or will Pakistan cause an upset in Dubai during the Super 4s of the Asia Cup 2025?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indw-vs-ausw-smriti-mandhana-praise-indias-fightback-australia-delhi-2790792-2025-09-21",
      "headline": "We wanted to chase 414 to show the character of this team: Smriti MandhanaSmriti Mandhana praised India's fighting spirit during the thrilling chase of 414 runs against Australia. The team's belief and maturity signal growing confidence ahead of the World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-abhishek-sharma-statement-wounded-pakistan-super-4-2790606-2025-09-21",
      "headline": "Asia Cup: Time for Abhishek Sharma to make statement against wounded PakistanAsia Cup 2025: India and Pakistan are set to clash in the Asia Cup 2025 Super 4 stage in Dubai. Abhishek Sharma's performance could define the intense cricket rivalry amid political tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mithun-manhas-bcci-president-career-ipl-coaching-journey-2790783-2025-09-21",
      "headline": "Who is Mithun Manhas? Virat Kohli's 1st Delhi captain tipped for BCCI top jobA stalwart in the Indian domestic circuit during his playing days, Mithun Manhas is the favourite to become the new BCCI president. Here's a look at his playing and coaching career, his connection with Virat Kohli and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/yuki-bhambri-interview-tennis-us-open-michael-venus-2790778-2025-09-21",
      "headline": "Trading Tests for T20s, Yuki Bhambri chases glory in tennis second inningsAfter years in the Test match grind of singles, Yuki Bhambri is embracing his T20 phase in doubles. With New Zealand's Michael Venus by his side, he's turning experience into momentum, proving he can still leave a mark on Indian tennis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-2025-handshake-row-gill-redemption-super-4s-clash-2790749-2025-09-21",
      "headline": "Handshake row 2.0, Shubman Gill redemption? Key things to watch in IND vs PAK clashThe India–Pakistan rivalry returns to Dubai, with Sunday's Super 4s clash carrying extra spice. After the handshake controversy from their last meeting, the rematch promises fresh drama alongside the cricketing battles that matter most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ashwin-suryakumar-yadav-ind-vs-pak-hype-press-conference-2790772-2025-09-21",
      "headline": "India haven't played down IND vs PAK hype, they just shared the truth: AshwinRavichandran Ashwin says India have acknowledged reality ahead of the Asia Cup 2025 Super 4 match against Pakistan. The Indian team's confidence contrasts with Pakistan's recent inconsistencies and off-field issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-abhishek-sharma-statement-wounded-pakistan-super-4-2790606-2025-09-21",
      "headline": "Asia Cup: Time for Abhishek Sharma to make statement against wounded PakistanAsia Cup 2025: India and Pakistan are set to clash in the Asia Cup 2025 Super 4 stage in Dubai. Abhishek Sharma's performance could define the intense cricket rivalry amid political tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mithun-manhas-bcci-president-career-ipl-coaching-journey-2790783-2025-09-21",
      "headline": "Who is Mithun Manhas? Virat Kohli's 1st Delhi captain tipped for BCCI top jobA stalwart in the Indian domestic circuit during his playing days, Mithun Manhas is the favourite to become the new BCCI president. Here's a look at his playing and coaching career, his connection with Virat Kohli and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/yuki-bhambri-interview-tennis-us-open-michael-venus-2790778-2025-09-21",
      "headline": "Trading Tests for T20s, Yuki Bhambri chases glory in tennis second inningsAfter years in the Test match grind of singles, Yuki Bhambri is embracing his T20 phase in doubles. With New Zealand's Michael Venus by his side, he's turning experience into momentum, proving he can still leave a mark on Indian tennis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-2025-handshake-row-gill-redemption-super-4s-clash-2790749-2025-09-21",
      "headline": "Handshake row 2.0, Shubman Gill redemption? Key things to watch in IND vs PAK clashThe India–Pakistan rivalry returns to Dubai, with Sunday's Super 4s clash carrying extra spice. After the handshake controversy from their last meeting, the rematch promises fresh drama alongside the cricketing battles that matter most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ashwin-suryakumar-yadav-ind-vs-pak-hype-press-conference-2790772-2025-09-21",
      "headline": "India haven't played down IND vs PAK hype, they just shared the truth: AshwinRavichandran Ashwin says India have acknowledged reality ahead of the Asia Cup 2025 Super 4 match against Pakistan. The Indian team's confidence contrasts with Pakistan's recent inconsistencies and off-field issues."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}