{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-to-speed-up-higher-pension-applications-payouts-likely-by-year-end-report-2721644-2025-05-08",
      "headline": "EPFO to speed up higher pension applications, payouts likely by year-end: ReportThe EPFO has received about 1.75 million applications from pensioners who want to get a higher pension based on their actual wages, out of a total of 7.8 million pensioners. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-why-sensex-nifty-fell-sharply-before-today-market-closing-explained-2721626-2025-05-08",
      "headline": "Explained: Why Sensex, Nifty fell sharply moments before stock market closingBy market close, the BSE Sensex had dropped 411.97 points to 80,334.81, while the Nifty 50 fell 140.60 points to 24,273.80. The India VIX, often seen as the market's fear gauge, spiked over 10 per cent to cross the 21 mark—its highest since early April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-withdraws-operation-sindoor-trademark-says-it-was-filed-inadvertently-2721608-2025-05-08",
      "headline": "Reliance withdraws 'Operation Sindoor' trademark, says it was filed inadvertentlyOn May 7, four different applications were made to trademark the phrase 'Operation Sindoor' under Class 41 of the Nice Classification. This category includes services like films, shows, online content, education, cultural events and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/kamikaze-suicide-drone-makers-stock-jumps-after-operation-sindoor-details-here-2721607-2025-05-08",
      "headline": "Kamikaze 'suicide' drone maker's stock jumps after 'Operation Sindoor'. Details hereListed on the NASDAQ under the ticker ESLT, Elbit's stock rose 3.62% over two sessions, jumping from $400.00 on May 6 to $414.47 by May 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-falls-412-points-nifty-below-24300-as-indo-pak-tensions-hit-dalal-street-2721578-2025-05-08",
      "headline": "Sensex, Nifty end in red as panic grows over India-Pak tensionsThe S&P BSE Sensex had fallen over 700 points just a few minutes before closing. However, it bounced back to end 412 points lower at 80,334.81, while the NSE Nifty50 lost 140.60 points to close at 24,273.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-stock-exchange-trading-halted-after-7-per-cent-crash-post-operation-sindoor-2721546-2025-05-08",
      "headline": "Pakistan's Karachi Stock Exchange crashes 7%, trading haltedAccording to the official notification from the exchange, trading was paused after the benchmark index plunged 6.3% in a short period. The sharp fall triggered automatic circuit breakers to stop further decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-what-is-itr-form-3-check-eligibility-documents-and-deadlines-all-details-explained-2721527-2025-05-08",
      "headline": "ITR Filing 2025: What is ITR Form 3, check eliigibility, documents and deadlinesYou should file ITR-3 if you run a business or work as a self-employed professional, regardless of whether a tax audit is needed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/avic-chengdu-aircraft-co-ltd-share-price-india-pak-tensions-chinese-jet-maker-j-17-stock-by-36-percent-in-2-days-2721520-2025-05-08",
      "headline": "India-Pak tensions lift Chinese jet maker's stock by 36% in 2 daysAs of Thursday, the company's share price rose by 16.37% to reach 80.68 yuan. This was after a 17% jump on Wednesday. In total, the stock has gained 36.21% in two days and has gone up 44% in the past one month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retirement-age-is-moving-from-60-to-45-an-investment-banker-sarthak-ahuja-explains-why-2721482-2025-05-08",
      "headline": "'Retirement age is moving from 60 to 45': An investment banker explains whyUnlike lawyers or doctors, where experience adds value, senior professionals in corporate roles like sales, marketing, operations, product, and tech, are seen as costly and sometimes out of touch, said the investment banker."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-india-pakistan-tension-should-investors-on-dalal-street-panic-2721478-2025-05-08",
      "headline": "Why stock market investors shouldn't panic amid rising Indo-Pak tensionsWhile 'Operation Sindoor' led to worries about increased market volatility and losses, the main indices on Dalal Street actually managed to end in green in the previous session. Even today, the stock markets are trading in positive territory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-economy-going-down-forex-reserve-overflight-fees-airspace-ban-india-border-tension-2721445-2025-05-08",
      "headline": "Pakistan's forex is slipping fast. More trouble ahead for already debt-ridden economy?A bailout by the International Monetary Fund (IMF), including a loan of $2 billion in March this year, gave Pakistan some breathing room. But the current situation could undo much of that progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/you-can-now-automate-strategies-zerodha-founder-and-ceo-nithin-kamath-on-nse-new-algo-rules-2721437-2025-05-08",
      "headline": "'You can now automate strategies': Zerodha's Nithin Kamath on NSE's new algo rulesZerodha's founder and CEO, Nithin Kamath, hailed NSE's new rules to ease algo trading for retail users and explained the main update in simple terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-pakistan-rising-tension-war-impact-on-economy-foreign-investments-2721404-2025-05-08",
      "headline": "Will rising Indo-Pak tensions dent foreign investment inflows to India?India's economy, which recently crossed the $4 trillion mark, has minimal direct trade with Pakistan. As a result, cross-border missile strikes carried out by India had limited immediate impact on domestic equities, currencies, or bonds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-layoffs-cuts-200-jobs-in-latest-round-of-restructuring-2721392-2025-05-08",
      "headline": "Google cuts 200 jobs in latest round of restructuring: ReportGoogle described the changes as \"small\" adjustments meant to foster \"greater collaboration\" and improve how quickly teams can serve customers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-opens-80-points-higher-nifty-above-24400-tata-motors-up-2-percent-india-pakistan-tension-war-2721383-2025-05-08",
      "headline": "Sensex, Nifty erase early gains as market reacts to India-Pakistan tensionThe S&P BSE Sensex was trading down by 56.88 points to 80,689.90, while the NSE Nifty50 lost 32.25 points to 24,382.15 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-opening-dalal-street-to-go-down-amid-india-pakistan-tension-sindoor-2721374-2025-05-08",
      "headline": "Sensex, Nifty opening: Stock market to go down amid India-Pakistan tension?At 8:40 am, Gift Nifty futures were trading at 24,451. This suggests that the Nifty50 index may open marginally higher or close to Wednesday's closing level of 24,414.4 as investors are expected to be cautious. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-may-8-shares-in-focus-titan-dabur-lt-asian-paints-pnb-2721366-2025-05-08",
      "headline": "Stocks to watch on May 8: Titan, Dabur, L&T, Asian Paints, PNBStocks to watch on Thursday, May 8, include several well-known companies such as Titan, Dabur, L&T, Asian Paints and PNB. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-letter-of-intent-elon-musks-satellite-internet-venture-starlink-2721230-2025-05-07",
      "headline": "Government issues Letter of Intent to Musk's satellite internet venture StarlinkPrior to this, the government had issued licences to Eutelsat OneWeb and Jio Satellite Communications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ulips-mutual-funds-or-stocks-what-is-the-best-for-long-term-wealth-creation-2721078-2025-05-07",
      "headline": "ULIPs, mutual funds or stocks: What's the best for long-term wealth creation?Mutual funds, ULIPs, and stocks offer different paths to wealth. While ULIPs mix insurance with investment, mutual funds offer flexibility and professional management. Stocks offer high returns but carry more risk and demand expertise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-nps-rules-how-to-close-your-account-after-renouncing-indian-citizenship-2721011-2025-05-07",
      "headline": "New NPS rules: How to close your account after renouncing Indian citizenshipAny Indian citizen aged between 18 and 70 years can open an NPS account. Additionally, Non-Resident Indians (NRIs) and Overseas Citizens of India (OCIs) can also open an NPS account, as long as they meet the necessary requirements set by the PFRDA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-106-points-higher-nifty-above-24400-tata-motors-jumps-5-2720999-2025-05-07",
      "headline": "Sensex ends 106 points higher, Nifty above 24,400; Tata Motors jumps 5%The BSE Sensex was up 105.71 points higher to 80,746.78 at the closing bell, while the NSE Nifty50 rose 34.80 points to settle at 24,414.40. Most of the broader market indices also recovered after falling in early trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hdfc-bank-trims-these-lending-rates-mclr-from-may-7-will-your-emis-go-down-2720970-2025-05-07",
      "headline": "HDFC Bank trims these lending rates from May 7. Will your EMIs go down?This move comes shortly after the Reserve Bank of India (RBI) cut the repo rate by 25 bps in April, taking the total cut to 50 bps since February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/operation-sindoor-how-will-stock-markets-react-to-rising-indo-pak-tensions-2720948-2025-05-07",
      "headline": "Operation Sindoor: Should Dalal Street investors worry about what's next?There was no sell-off, no bloodbath, just a bit of volatility. For many retail investors, the calm felt unusual — shouldn't a military flare-up between nuclear neighbours spook the markets? But past data suggests otherwise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/taking-a-personal-loan-for-wedding-here-are-6-key-tips-to-keep-in-mind-2720932-2025-05-07",
      "headline": "Taking a personal loan for a wedding? Here are 6 key tips to keep in mindWeddings can tempt us to go overboard, but it's best to plan a realistic budget. See where you can cut costs or use your savings first. Borrow just the amount you really need, don't take a bigger loan just because you're eligible for it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-heres-how-to-choose-the-right-tax-regime-old-tax-regime-new-tax-regime-standard-deduction-2720891-2025-05-07",
      "headline": "Filing ITR? Here's how to choose the right tax regimeWhile the new regime offers reduced tax slabs, it doesn't let you claim the usual deductions available under the old regime. It's lower rates, but with fewer tax-saving options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-benefits-impact-goods-cheaper-costlier-decoded-2720888-2025-05-07",
      "headline": "Whisky, cars, and jobs: Inside India's game-changing UK free trade pactThe India-UK trade deal holds significance in a world drifting back toward trade barriers and tariff wars. With Trump-era protectionism rearing its head again, the timing of this pact couldn't be better."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pwc-to-lay-off-2-percent-of-us-workforce-report-2720852-2025-05-07",
      "headline": "PwC to cut 1,500 jobs in the US: ReportLast year, PwC was in the news for possibly cutting half of its auditing staff in China's financial services sector. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pakistan-karachi-stock-exchange-crashes-nearly-6-percent-operation-sindoor-military-strike-impact-2720824-2025-05-07",
      "headline": "Pakistan's Karachi Stock Exchange crashes nearly 6% after 'Operation Sindoor'The Karachi Stock Exchange 100 index (KSE-100) plunged 6,272 points in early trade, sliding to 107,296.64 — a sharp drop from Tuesday's close of 113,568.51."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/info-edge-share-price-down-80-percent-bse-trading-apps-reason-explained-2720820-2025-05-07",
      "headline": "Explained: Why Info Edge shares look like they've crashed 80% todayInfo Edge shares traded ex-split today after the company carried out a 1:5 stock split, its first since its 2006 listing. As a result, each share with a face value of Rs 10 has been subdivided into five shares of Rs 2 each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-foreign-portfolio-investors-are-buying-indian-financial-stocks-explained-2720810-2025-05-07",
      "headline": "Explained: Why foreign portfolio investors are buying Indian financial stocksData from the National Securities Depository shows FPIs bought Rs 18,409 crore ($2.18 billion) worth of shares in the sector last month, propelling the Nifty Financial Services index to a 4.1% gain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/scotch-whisky-prices-set-to-drop-after-india-uk-trade-deal-details-here-2720803-2025-05-07",
      "headline": "Scotch whisky prices set to drop after India-UK trade deal. Details hereThe reduction is expected to bring premium and mid-range Scotch whiskies within reach of a larger section of Indian consumers. A bottle that typically costs Rs 5,000 could soon be priced between Rs 3,500 and Rs 4,000 following the initial tariff cut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-why-didnt-markets-crash-after-operation-sindoor-2720786-2025-05-07",
      "headline": "Sensex, Nifty today: Why stock market didn't crash after 'Operation Sindoor'While markets remain extremely volatile, swinging between green and red, there was no major crash. Here are three reasons why Dalal Street remained calm after 'Operation Sindoor'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-lower-as-dalal-street-investors-react-to-operation-sindoor-2720768-2025-05-07",
      "headline": "Sensex, Nifty rebound as markets stay calm after 'Operation Sindoor'The Sensex fell sharply in pre-opening, but recovered as soon as the markets opened at 9:15 am. At around 9:30 am, Sensex was trading 143.08 points higher at 80,784.15, while the NSE Nifty50 rose 56.60 points to trade at 24,432."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-nears-full-profitability-revenue-grows-to-rs-1911-crore-2720453-2025-05-06",
      "headline": "Paytm nears full profitability; revenue grows to Rs 1,911 crorePaytm's revenue increased by 5% quarter-on-quarter, reaching Rs 1,911 crore, reflecting the company's steady performance and continued momentum in its core businesses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/need-a-personal-loan-unlock-rs-5-lakh-instantly-using-just-your-pan-card-2720405-2025-05-06",
      "headline": "Need a personal loan? Unlock Rs 5 lakh instantly using just your PAN cardTo apply online, you simply visit the bank or lender's website and fill out the application form. You'll need to provide your name, date of birth, mobile number, and PAN number."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-156-points-lower-nifty-below-24400-adani-enterprises-falls-4-2720369-2025-05-06",
      "headline": "Sensex ends 156 points lower, Nifty below 24,400; Adani Enterprises falls 4%The BSE Sensex ended 155.77 points lower at 80,641.07, while the NSE Nifty50 fell 81.55 points to settle at 24,379.60. Most of the broader market indices also declined during the trading session due to high selling pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-denies-reports-of-stake-sale-to-japans-smbc-calls-it-speculative-2720360-2025-05-06",
      "headline": "Yes Bank denies reports of stake sale to Japan's SMBC, calls it 'speculative'The private sector lender clarified that while it regularly explores business opportunities, there is nothing material to disclose under current regulatory norms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saying-yes-to-a-joint-loan-here-is-how-it-can-affect-your-credit-score-2720344-2025-05-06",
      "headline": "Saying yes to a joint loan? Here's how it can affect your credit scoreEvery time an EMI is paid on time, it reflects positively on both borrowers' credit profiles. Over time, this builds your credit score. If you were added as a co-applicant to help someone get a loan because your own score was low, this is your chance to improve it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-5-common-mistakes-you-must-avoid-while-filing-your-tax-returns-2720287-2025-05-06",
      "headline": "ITR filing 2025: 5 common mistakes you must avoid while filing your tax returnsUsing the wrong ITR form can delay your tax processing or, worse, your return may get rejected. Also, filing your ITR is not the final step, you must also verify it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/is-the-global-economy-breathing-easier-as-trump-eases-up-on-tariffs-2720249-2025-05-06",
      "headline": "Is the worst over for global economy as Trump eases stance on tariffs?Even as Trump suggests deals are near with countries like India, Japan, and South Korea, and China reviews a fresh proposal from Washington, the global economy isn't breathing easy yet."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonu-nigam-and-arijit-singh-to-recreate-song-sandese-aate-hai-for-border-2-2721779-2025-05-08",
      "headline": "Sonu Nigam, Arijit Singh to recreate Sandese Aate Hai song  for Border 2: ReportSonu Nigam and Arijit Singh will recreate the patriotic song 'Sandese Aate Hai' for 'Border 2.' T-Series has acquired the rights of the iconic song for Rs 10 crore, making it the most expensive Bollywood song remake to date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ameesha-patel-calls-pay-disparity-justified-but-wants-less-gap-exclusive-2721778-2025-05-08",
      "headline": "Ameesha Patel: Pay disparity is justified, but there shouldn't be a wide gapAmeesha Patel candidly addresses key issues in Bollywood, including pay disparity, ageism, and rising film budgets, emphasising the need for balance and fairness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/satyajit-rays-aranyer-din-ratri-to-be-screened-at-cannes-film-festival-2025-2721731-2025-05-08",
      "headline": "Satyajit Ray's Aranyer Din Ratri to be screened at Cannes Film Festival 2025Satyajit Ray's classic 'Aranyer Din Ratri' will be screened at the Cannes Film Festival 2025 in the classic section. The film's screening will be attended by veteran actor Sharmila Tagore and filmmaker Wes Anderson, among other presenters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/virat-kohli-brother-vikas-kohli-slams-rahul-vaidyas-comments-avneet-kaur-2721720-2025-05-08",
      "headline": "Virat Kohli's brother slams Rahul Vaidya's comments: What a loserCricketer Virat Kohli's brother, Vikas Kohli, has reacted to Rahul Vaidya's comments where he called him a 'joker'. Vikas, in his note, emphasised the nation's current situation and mentioned how Rahul is using the cricketer's name to gain followers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannada-director-k-ramnarayan-on-replacing-sonu-nigam-songs-saying-sorry-will-not-cut-it-2721650-2025-05-08",
      "headline": "Kannada director on replacing Sonu Nigam's songs: He must pay a priceKannada director, who replaced two Sonu Nigam songs in his upcoming film 'Kuladalli Keelyavudo' following the singer's concert controversy, said that his apology is not enough. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/1-film-every-3-years-why-are-young-telugu-directors-delaying-film-productions-2721616-2025-05-08",
      "headline": "1 film every 3 years: Why are young Telugu directors delaying film productions?Once celebrated for rapid, inventive filmmaking, new directors of the Telugu cinema now take two-three years between projects. Rising budgets, cautious OTT deals and a shrinking writing pool have forced even proven talents into lengthy pauses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-reveals-training-ranveer-singh-for-his-debut-film-2721577-2025-05-08",
      "headline": "Was Nawazuddin Siddiqui Ranveer Singh's acting coach? Costao actor revealsNawazuddin Siddiqui revealed he trained Ranveer Singh ahead of his debut in Band Baaja Baaraat, during his days as an acting workshop mentor. While he guided many aspiring actors, Siddiqui credited Ranveer's success to his own talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pawandeep-rajan-indian-idol-12-winner-out-of-icu-friend-shares-pic-from-hospital-2721611-2025-05-08",
      "headline": "Singer Pawandeep Rajan out of ICU, friend shares pic from hospitalIndian Idol 12 winner Pawandeep Rajan recently met with a serious car accident near Moradabad, has been shifted from the ICU to a private room. His friend Govind Digari shared the update. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-donates-rs-10-crore-from-retro-profits-to-agaram-foundation-2721542-2025-05-08",
      "headline": "Suriya donates Rs 10 crore from Retro profits to Agaram FoundationActor Suriya, along with Retro director Karthik Subbaraj, donated Rs 10 crore to the Agaram Foundation, funding education for underprivileged children. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-begins-kantara-2-last-schedule-after-junior-artiste-death-2721486-2025-05-08",
      "headline": "Rishab Shetty begins last schedule of Kantara 2 after death of junior artisteRishab Shetty's 'Kantara: Chapter 1', a prequel to the 2022 blockbuster film, is among the most highly-anticipated Indian films of the year. Despite several setbacks during production, the makers have now entered the final schedule of shoots for the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/munawar-faruqui-shehnaaz-gill-kubbra-sait-celebs-attend-acting-workshop-saurabh-sachdeva-2721573-2025-05-08",
      "headline": "Munawar Faruqui, Shehnaaz Gill, and celebs take acting class from Saurabh SachdevaShehnaaz Gill, Karan Veer Mehra, Munawar Faruqui, Kubbra Sait, and others participated in a workshop conducted by veteran actor Saurabh Sachdeva. Take a look at the pictures here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/reborn-rich-season-2-production-confirmed-without-song-joong-ki-2721540-2025-05-08",
      "headline": "Reborn Rich Season 2 production confirmed without Song Joong-kiThe popular 2022 K-drama 'Reborn Rich' has been officially renewed for its eagerly-awaited second season, promising a gripping tale of ambition, love, and power within a global corporation. Fans can look forward to a large-scale production that aims to connect emotionally with international audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/piku-and-its-healing-powers-how-a-film-becomes-so-much-more-2721544-2025-05-08",
      "headline": "Piku and its healing powers: How a film becomes so much more...'Piku', starring Amitabh Bachchan, Deepika Padukone, and the late legendary actor, Irrfan, completes 10 years today. While on the surface, it remains a film about a father-daughter relationship and the art of subtle romance, it is so much more than that. It, in fact, is life itself. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/filmmakers-rush-to-secure-operation-sindoor-title-15-studios-seek-registration-2721518-2025-05-08",
      "headline": "Filmmakers rush to secure Operation Sindoor title, 15 studios seek registrationFollowing India's precision strikes on terror camps, numerous Bollywood studios are rushing to register the title 'Operation Sindoor' for potential war films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-says-taimur-has-stage-fear-doesnt-want-to-perform-publicly-2721512-2025-05-08",
      "headline": "Saif Ali Khan says Taimur has stage fear, doesn't want to perform publiclyTaimur Ali Khan, son of actors Saif Ali Khan and Kareena Kapoor Khan, is not interested in acting, said his father. Saif shared that his son feels shy on stage and doesn't like performing in front of people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-opens-up-about-directors-comment-on-her-motherhood-priorities-amid-busy-schedule-2721475-2025-05-08",
      "headline": "When director told Deepika she's 'taking motherhood seriously': Is it compliment?In a recent interview, Deepika Padukone shared an incident where a director commented on her commitment to motherhood. Deepika welcomed her daughter, Dua, in September last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prateik-babbar-smita-patil-recalls-being-a-drug-addict-was-thrown-out-of-film-institute-2721517-2025-05-08",
      "headline": "Prateik Smita Patil recalls being a drug addict: Was thrown out of film instituteActor Prateik Smita Patil opened up on battling substance abuse. The 'HIT 3' and 'Sikandar' actor revealed that he regrets being in that reckless phase of life. Patil also narrated how he was 'thrown out' of a film institute due to addiction.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mandana-mandana-karimi-reacts-after-outrage-over-instagram-post-mentioning-operation-sindoor-2721510-2025-05-08",
      "headline": "Proud of India, have deep respect for government: Mandana Karimi after backlashIranian actor Mandana Karimi faced backlash after her Instagram post mentioning Operation Sindoor. Now, she had reacted to it, clarifying that she is proud of India and has deep respect for the Indian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saif-ali-khan-rani-mukerjis-hum-tum-to-re-release-on-may-16-kunal-kohli-2721505-2025-05-08",
      "headline": "Nostalgia alert! Saif Ali Khan, Rani Mukerji's Hum Tum to re-release on May 16Actors Saif Ali Khan and Rani Mukerji's 'Hum Tum' is set to re-release in theatres on May 16. The film is directed by Kunal Kohli. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-secretary-of-state-de-escalation-s-jaishankar-shezbaz-sharif-jammu-drone-attack-2721826-2025-05-08",
      "headline": "Will counter any escalation attempt: S Jaishankar to Marco Rubio amid Pak attackThe US Secretary of State called for immediate de-escalation amid India-Pakistan tensions in calls with S Jaishankar, Pakistan Prime Minister Shehbaz Sharif."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-tensions-blackout-in-several-jk-punjab-cities-as-pak-fires-missiles-2721817-2025-05-08",
      "headline": "Blackout in several J&K, Punjab cities as Pak fires missiles: Full listDifferent cities across border states, including Jammu and Kashmir, Punjab and Rajasthan, were under complete blackout on Thursday night as Pakistan fired missiles amid ongoing tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pak-f-16-down-drone-swarm-attack-foiled-indian-akash-mrsam-zu-23-in-action-2721828-2025-05-08",
      "headline": "Pak F-16 down, drone attack foiled: Indian Akash, MRSAM in actionThe integrated grid, activated across 1,800 km of airspace, intercepted swarms of drones and missiles targeting 15 military installations, including bases in Jammu, Srinagar, Pathankot, and Bhuj."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/new-pope-elected-sistine-chapel-vatican-city-francis-2721819-2025-05-08",
      "headline": "Bells ring, white smoke appears from Sistine Chapel signalling new Pope electedBells ring, white smoke appears from Sistine Chapel at the Vatican, indicating new Pope elected"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-downs-pakistan-f-16-jammu-attacks-drone-missiles-pahalgam-op-sindoor-2721810-2025-05-08",
      "headline": "Pakistani F-16 jet, 2 JF-17s downed by Indian air defence: SourcesIn a major escalation, Pakistan launched missile and drone attacks at multiple locations in India which were swiftly intercepted by the air defence system. India shot down Pakistan's F-16 and JF-17 aircrafts, sources said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-original-escalation-operation-sindoor-pakistan-india-defence-systems-2721766-2025-05-08",
      "headline": "Pahalgam original escalation: After terror camps, India destroys false Pak narrativeEver since the deadly Pahalgam terror attack killed 26 tourists, India vowed a strong response, and delivered on the promise with the killings of 100 terrorists in Pakistan and Pakistan-occupied Kashmir under 'Operation Sindoor'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-dc-special-train-dharamshala-delhi-bcci-2721827-2025-05-08",
      "headline": "IPL 2025: Special train arranged to get PBKS, DC players from Dharamshala to DelhiA special train has been arranged by the BCCI to get the Punjab Kings and Delhi Capitals players and staff from Dharamshala to Delhi after the match between the two teams in the city was cancelled after attacks from Pakistan in various parts of India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rocket-fired-jammu-air-raid-sirens-airport-blackout-mock-drill-pakistan-op-sindoor-2721795-2025-05-08",
      "headline": "Pakistan drone hits Jammu airport, S-400 defence system intercepts 8 missilesIn a major escalation following India's strikes on terror camps, eight rockets launched from Pakistan targeted multiple locations in Jammu on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/s-400-vs-shaheen-3-missile-power-in-focus-as-india-pak-tensions-rise-operation-sindoor-2721665-2025-05-08",
      "headline": "S-400 vs Shaheen-3: Missile power in focus after Operation SindoorIndia's S-400 Triumf, dubbed \"Sudarshan Chakra\" in IAF service, is one of the world's most advanced air defence systems. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-dc-clash-called-off-dharamsala-pakistan-attack-2721831-2025-05-08",
      "headline": "When was the PBKS vs DC clash in Dharamsala called off?IPL 2025: The Punjab Kings vs Delhi Capitals clash at the HPCA Stadium in Dharamsala was called off amid Pakistan attacking several locations in Jammu, including the airport. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-attack-state-funeral-terrorists-pakistan-army-civilians-killed-claims-pahalgam-attack-2721710-2025-05-08",
      "headline": "State funerals for terrorists in Pakistan: India rejects 'civilians killed' chargeIndia on Thursday strongly rejected claims of civilian casualties in Tuesday's strikes on terror camps in Pakistan and condemned Islamabad for allegedly according state funerals to the terrorists killed in the operation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pak-deliberately-killed-sikhs-in-india-targeted-gurdwara-government-on-deaths-in-shelling-in-jks-poonch-2721713-2025-05-08",
      "headline": "Pak deliberately killed Sikhs, targeted gurdwara in J&K: India on LoC shellingForeign Secretary Vikram Misri said that Pakistan is using religion to indoctrinate people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-foiled-pakistan-missile-drone-attack-night-awantipora-bhuj-rajasthan-integrated-counter-uas-grid-air-defence-2721593-2025-05-08",
      "headline": "How India foiled Pak's attack, turned its missiles, drones into dudsIndia's shield of sensors, missiles, and jammers snapped into action across 1,800 km of Indian airspace, as Pakistan fired a swarm of drones and missiles after Operation Sindoor. From the heights of Awantipora to the salt flats of Bhuj, every incoming threat was hunted down by India's Integrated Counter-UAS Grid and Air Defence systems. What exactly are they and how do these systems work? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-pakistans-islamist-army-chief-asim-munir-is-such-a-dangerous-foe-2721637-2025-05-08",
      "headline": "Why Pakistan's Islamist army chief Asim Munir is such a dangerous foeMunir emerged as one of the most powerful army chiefs of Pakistan without having to topple the civilian dispensation but overplayed his hand with the Pahalgam attack\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/agra/story/taj-mahal-high-alert-yellow-zone-operation-sindoor-india-pak-tensions-2721667-2025-05-08",
      "headline": "Taj Mahal on high alert as India-Pak tensions escalate after Op SindoorA high alert has been issued in the yellow zone of the Taj Mahal after tension between India and Pakistan escalated following Operation Sindoor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-air-defence-systems-lahore-thwarts-attack-military-installations-operation-sindoor-2721683-2025-05-08",
      "headline": "Op Sindoor not over yet as India makes Pak pay for drone attack. 10-point recapIndia on Thursday destroyed an air defence system at Lahore after Pakistan attempted to strike a number of military targets in Northern and Western India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-leaves-lahore-defenceless-hits-china-made-hq-9-missile-shield-hq-9p-air-defence-system-pakistan-2721592-2025-05-08",
      "headline": "India destroys China-made missile shield in Lahore. What are Pak's HQ-9, HQ-16?India countered an aerial attack by Pakistan on the night of May 7 and hit its air defence system. India's strike destroyed the HQ-9P and HQ-16 missile defence systems, built by China and customised for Pakistan. China uses the HQ-9 system, with a longer range of surface-to-air missiles, for its defence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-dismisses-claims-attack-on-dam-near-neelum-jhelum-project-in-pok-operation-sindoor-2721703-2025-05-08",
      "headline": "Blatant lie: India on claims of attack on dam near Neelum-Jhelum project in POKPakistan on Wednesday alleged that India had \"deliberately targeted\" the Neelum-Jhelum hydropower project, calling it \"violation of international conventions\". India today thoroughly junked the allegations, calling them \"an absolute and complete fabrication.\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/cash-row-delhi-high-court-judge-home-justice-yashwant-varma-refuses-resign-process-remove-start-soon-2721761-2025-05-08",
      "headline": "Justice Yashwant Varma refuses to resign, impeachment process to start soon: SourcesJustice Yashwant Varma has refused to resign from the Delhi High Court despite a Supreme Court-appointed panel confirming a large cash recovery from his residence. The process to impeach him is set to start soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/is-reduced-sexual-desire-a-common-long-term-side-effect-of-cancer-treatment-2721634-2025-05-08",
      "headline": "How cancer treatment affects sex, desire, and connectionReduced libido after cancer treatment isn't just about hormones or physical scars (that's a part too), but it's also a layered experience of emotional trauma, body image shifts, and persistent side effects."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/stop-pakistani-content-immediately-national-security-centre-otts-media-streaming-platforms-advisory-operation-sindoor-2721662-2025-05-08",
      "headline": "Stop Pakistani content immediately: Centre to OTTs, media streaming platformsCiting national security concerns after the April 22 Pahalgam terror attack, the Indian government on Thursday ordered all OTT and streaming platforms to immediately remove Pakistan-origin content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-and-pakistan-national-security-advisors-in-touch-foreign-secretary-vikram-misri-operation-sindoor-2721745-2025-05-08",
      "headline": "No information: Foreign Secretary on reports of India, Pak NSAs being in touchForeign Secretary Vikram Misri, in the latest media briefing on Operation Sindoor, informed that he had no information to share regarding contact between the NSAs of India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/rawalpindi-cricket-stadium-damaged-after-being-hit-by-drones-2721584-2025-05-08",
      "headline": "Drone hits Rawalpindi stadium hours before Pakistan Super League match: SourcesA match between Peshawar Zalmi and Karachi Kings was scheduled for 8 pm today, but a drone strike has damaged parts of the stadium."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bcci-secretary-devajit-saikia-issues-statement-on-dc-vs-pbks-cancellation-2721834-2025-05-08",
      "headline": "BCCI issues statement on DC vs PBKS cancellation: Everyone's safety is our priorityThe Board of Control for Cricket in India (BCCI) secretary Devajit Saikia has issued a statement following the cancellation of Delhi Capitals vs Punjab Kings Match 58 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-dc-clash-called-off-dharamsala-pakistan-attack-2721831-2025-05-08",
      "headline": "When was the PBKS vs DC clash in Dharamsala called off?IPL 2025: The Punjab Kings vs Delhi Capitals clash at the HPCA Stadium in Dharamsala was called off amid Pakistan attacking several locations in Jammu, including the airport. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-dc-special-train-dharamshala-delhi-bcci-2721827-2025-05-08",
      "headline": "IPL 2025: Special train arranged to get PBKS, DC players from Dharamshala to DelhiA special train has been arranged by the BCCI to get the Punjab Kings and Delhi Capitals players and staff from Dharamshala to Delhi after the match between the two teams in the city was cancelled after attacks from Pakistan in various parts of India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dharamshala-stadium-ipl-match-cancelled-pak-attack-match-cancelled-2721816-2025-05-08",
      "headline": "IPL match called off in Dharamsala amid Pak attack, players rushed outThe IPL 2025 match between Punjab Kings and Delhi Capitals has been called off in Dharamshala amidst Pakistan's attack in various parts of India. Players and spectators were rushed out of the HImachal Pradesh Cricket ASsociation Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-vs-dc-delhi-bring-in-madhav-tiwari-in-place-of-vipraj-nigam-for-must-win-clash-2721786-2025-05-08",
      "headline": "PBKS vs DC: Delhi bring in Madhav Tiwari in place of Vipraj Nigam for must win clashDelhi Capitals (DC) rested Vipraj Nigam to bring in Madhav Tiwari for Match 58 of the Indian Premier League 2025 (IPL 2025) against Punjab Kings (PBKS) in Dharamsala. The management also dropped Karun Nair for the fixture. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/knew-rohit-sharma-would-be-a-great-captain-when-i-was-in-bcci-sourav-ganguly-2721770-2025-05-08",
      "headline": "Knew Rohit Sharma would be a great captain when I was in BCCI: Sourav GangulyFormer India captain Sourav Ganguly recently said that he always knew that Rohit Sharma would turn out to be a great captain when he was the President of the BCCI (Board of Control for Cricket in India)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-shifted-ahmedabad-narendra-modi-stadium-dharamshala-2721746-2025-05-08",
      "headline": "IPL 2025: PBKS vs MI match on May 11 shifted from Dharamshala to AhmedabadThe match between Punjab Kings and Mumbai Indians on May 11 has been officially shifted from Dharamshala to Ahmedabad. The match will start at its scheduled time of 3:30 pm IST on Sunday at the Narendra Modi stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-postpones-psl-fixture-amid-rising-tensions-with-india-2721724-2025-05-08",
      "headline": "Pakistan postpones PSL match in Rawalpindi Stadium after India's counter-strikesThe Pakistan Cricket Board confirmed the postponement of Thursday's PSL 2025 match after a drone struck the Rawalpindi Cricket Stadium. The future of PSL is in doubt amid the rising tensions between India and Pakistan. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-kishore-chennai-super-kings-ms-dhoni-gujarat-titans-2721717-2025-05-08",
      "headline": "CSK stint felt like an internship: GT's Sai Kishore on time with 5-time IPL championsGT spinner Sai Kishore said that his time with CSK felt like an internship for him and helped him shape the way he sees the game. Kishore spent two years with CSK before joining GT during the IPL 2022 auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-punjab-kings-vs-delhi-capitals-updates-today-match-2721702-2025-05-08",
      "headline": "PBKS vs DC Live: Punjab Kings vs Delhi Capitals match called offIPL 2025, PBKS vs DC Live Updates: Punjab Kings are dominating things in Dharamshala as Priyansh Arya gets to his fifty off just 25 balls. Prabhsimran Singh is playing a solid hand at the moment at the other end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gills-tribute-to-rohit-sharma-after-test-retirement-2721695-2025-05-08",
      "headline": "Shubman Gill's fitting tribute to Rohit Sharma: Will remember your learnings foreverStar India batter Shubman Gill paid tribute to Rohit Sharma following his retirement from Tests on May 7. Rohit scored 4301 runs in the longest format and also captained the team in 24 games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-shifted-ahmedabad-narendra-modi-stadium-dharamshala-2721746-2025-05-08",
      "headline": "IPL 2025: PBKS vs MI match on May 11 shifted from Dharamshala to AhmedabadThe match between Punjab Kings and Mumbai Indians on May 11 has been officially shifted from Dharamshala to Ahmedabad. The match will start at its scheduled time of 3:30 pm IST on Sunday at the Narendra Modi stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-postpones-psl-fixture-amid-rising-tensions-with-india-2721724-2025-05-08",
      "headline": "Pakistan postpones PSL match in Rawalpindi Stadium after India's counter-strikesThe Pakistan Cricket Board confirmed the postponement of Thursday's PSL 2025 match after a drone struck the Rawalpindi Cricket Stadium. The future of PSL is in doubt amid the rising tensions between India and Pakistan. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-kishore-chennai-super-kings-ms-dhoni-gujarat-titans-2721717-2025-05-08",
      "headline": "CSK stint felt like an internship: GT's Sai Kishore on time with 5-time IPL championsGT spinner Sai Kishore said that his time with CSK felt like an internship for him and helped him shape the way he sees the game. Kishore spent two years with CSK before joining GT during the IPL 2022 auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-punjab-kings-vs-delhi-capitals-updates-today-match-2721702-2025-05-08",
      "headline": "PBKS vs DC Live: Punjab Kings vs Delhi Capitals match called offIPL 2025, PBKS vs DC Live Updates: Punjab Kings are dominating things in Dharamshala as Priyansh Arya gets to his fifty off just 25 balls. Prabhsimran Singh is playing a solid hand at the moment at the other end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gills-tribute-to-rohit-sharma-after-test-retirement-2721695-2025-05-08",
      "headline": "Shubman Gill's fitting tribute to Rohit Sharma: Will remember your learnings foreverStar India batter Shubman Gill paid tribute to Rohit Sharma following his retirement from Tests on May 7. Rohit scored 4301 runs in the longest format and also captained the team in 24 games. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}