{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/papa-johns-pizza-returns-to-india-with-first-outlet-in-bengaluru-plans-650-stores-by-2035-2777192-2025-08-26",
      "headline": "Papa John's to return to India with Bengaluru outlet, plans 650 stores by 2035US-based Papa John's will re-enter India this October, opening its first store in Bengaluru and targeting 650 outlets by 2035. The pizza chain, which exited in 2017 due to poor performance, has partnered with Pulsar Capital and UAE's PJP Investments Group as master franchisees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-appoints-amit-kapur-to-lead-new-ai-and-services-transformation-unit-2777191-2025-08-26",
      "headline": "TCS appoints Amit Kapur to lead new AI and services transformation unitIn a bid to deepen its AI capabilities, TCS has named Amit Kapur as the head of its newly formed AI and services transformation unit, effective September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-credit-history-how-lenders-are-opening-doors-for-new-borrowers-2777127-2025-08-26",
      "headline": "No credit history? How lenders are opening doors for new borrowersFor decades, a blank credit history meant a closed door to loans. Now, fintechs and banks are rewriting the rules—using digital footprints and alternative data to bring first-time borrowers into the fold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pmo-holds-high-level-meet-on-us-tariff-impact-explores-relief-for-exporters-2777081-2025-08-26",
      "headline": "PM holds high-level meet on US tariff impact, explores relief for exportersThe PMO on Tuesday held a high-level meeting with senior ministers and officials from the Finance and Commerce Ministries to frame India's response to the US decision to double tariffs on Indian goods to 50% from Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-acts-password-override-privacy-threat-or-necessary-power-2777086-2025-08-26",
      "headline": "New Income Tax Act's password override: Privacy threat or necessary power?India's new tax law brings a digital twist; officials can now override passwords during raids. Supporters say it's just enforcement in the digital age, but privacy advocates worry about unchecked surveillance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-us-tariff-sensex-loses-849-points-nifty-below-24750-tata-steel-down-3-percent-2777012-2025-08-26",
      "headline": "Sensex slumps 849 points, Nifty below 24,750; Tata Steel down 3%The S&P BSE Sensex tanked 849.37 points to close at 80,786.54, while the NSE Nifty50 lost 255.70 points to end at 24,712.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-notice-rs-258-crore-recuced-to-zero-money-saving-section-54-land-sell-property-buy-2776992-2025-08-26",
      "headline": "Woman got tax notice of Rs 2.58 crore. Here's how she reduced it to Rs 0Seema found herself staring at a tax notice of Rs 2.58 crore after selling a piece of land in Patna. The confusion arose due to a simple error in her tax return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-25-percent-august-27-impact-economy-export-pmo-meeting-modi-government-textile-gems-pharma-2776931-2025-08-26",
      "headline": "Trump's 50% tariff takes effect tomorrow: Who wins, who losesThe United States government has issued a draft notification confirming the step, which will be applied through a supplementary 25% duty on top of existing tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-india-really-needs-to-become-viksit-bharat-by-2047-2776887-2025-08-26",
      "headline": "What India really needs to become 'Viksit Bharat' by 2047IndiaToday.in reached out to leading economists to understand what India must do over the next two decades to achieve its 'Viksit Bharat' vision. Here's what they had to say."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdfc-bank-shares-crash-over-50-percent-why-bonus-issue-did-it-really-fall-2776872-2025-08-26",
      "headline": "HDFC Bank share crash explained: Did it actually fall over 50%?HDFC Bank's shares appeared to have tanked over 50% compared to the previous close on Dalal Street in early trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/switching-from-ups-unified-pension-scheme-to-nps-national-pension-scheme-here-is-what-employees-must-know-2776864-2025-08-26",
      "headline": "Switching from UPS to NPS? Here's what employees must knowCentral government employees now have a one-time chance to switch from the Unified Pension Scheme (UPS) to the National Pension System (NPS). But the move comes with strict rules, deadlines, and conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/simplified-new-tax-rules-and-formswhat-you-need-to-know-2776823-2025-08-26",
      "headline": "Simplified, new tax rules and forms: What you need to knowThe Income Tax department is working on new rules and forms under the Income-tax Act, 2025, which will be notified by December-end to ensure a smoother, simpler process for taxpayers."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-feeds-underprivileged-children-outside-noida-metro-station-viral-video-2777245-2025-08-26",
      "headline": "Honey Singh feeds underprivileged children at Noida metro station, video goes viralRapper Yo Yo Honey Singh was seen sharing food with children outside Noida metro station. The compassionate act has touched many hearts and sparked widespread social media appreciation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/odum-kuthira-chaadum-kuthira-onam-release-fahadh-faasil-kalyani-priyadarshan-viral-reel-2777213-2025-08-26",
      "headline": "Fahadh Faasil, Kalyani Priyadarshan recreate iconic comedy sceneFahadh Faasil and Kalyani Priyadarshan star in 'Odum Kuthira Chaadum Kuthira', a film set for Onam release, featuring a blend of comedy and fantasy. The star cast of the film recreated a viral scene from 'Mookkilla Rajyathu', with Kalyani Priyadarshan calling it their acting workshop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/internet-praises-amit-sadh-humility-after-content-creators-fail-recognise-him-2777229-2025-08-26",
      "headline": "Internet praises Amit Sadh's humility after content creators fail to recognise himContent creators known as therealstreets fail to recognise actor Amit Sadh during a chance encounter, later photographing him. Here's what happened and where you've seen him before.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-launches-production-studio-keneeshaa-francis-an-ordinary-man-2777198-2025-08-26",
      "headline": "Actor Ravi Mohan calls Keneesha god-sent gift, leaves her teary-eyedActor Ravi Mohan, who launched his new production banner, Ravi Mohan Studios, in a grand fashion, had a few heartfelt things to say about his 'companion' Keneeshaa Francis. She was visibly emotional upon hearing his speech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ntr-x-neel-jr-ntr-begin-film-2nd-schedule-with-director-prashanth-neel-2777194-2025-08-26",
      "headline": "NTR x Neel: Jr NTR to soon begin film's 2nd schedule with director Prashanth NeelActor Jr NTR is set to begin the second schedule of the much-awaited film NTR x Neel in September 2025. The collaboration with director Prashanth Neel is speculated to be a major pan-India film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-candid-in-flight-moment-goes-viral-amid-love-and-war-shoot-2777204-2025-08-26",
      "headline": "Ranbir Kapoor's candid in-flight moment goes viral amid Love and War shootRanbir Kapoor's candid off-screen moment during a flight went viral, showing his relatable side to fans. Meanwhile, his much-anticipated film 'Love and War', featuring a star-studded cast and high-octane action, is currently under production. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/king-conqueror-director-says-james-norton-nikolaj-fantastic-2777168-2025-08-26",
      "headline": "King & Conqueror director says James Norton and Nikolaj were fantasticKing & Conqueror explores the legendary clash between Harold Godwinson and William of Normandy. The series blends history and drama with powerful performances, premiering soon on JioHotstar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lil-nas-x-pleads-not-guilty-amid-charges-of-assaulting-police-roaming-in-underwear-2777132-2025-08-26",
      "headline": "Lil Nas X pleads not guilty amid charges of assaulting police, roaming in underwearAmercian rapper Lil Nas X pleaded not guilty to charges after allegedly assaulting police officers in Los Angeles. The case highlights the legal and personal challenges facing the Grammy-winning rapper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aneez-bazmee-salman-khan-anil-kapoor-no-entry-sequel-2777174-2025-08-26",
      "headline": "Aneez Bazmee on not having Salman and Anil in No Entry sequel: Pain remainsFilmmaker Aneez Bazmee talked about the pain of not having actors Salman Khan and Anil Kapoor in the sequel to 'No Entry' in a recent interview. He also expressed his hesitation over Bipasha Basu's character in the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/harry-styles-and-zoe-kravitz-dating-rome-walk-2777019-2025-08-26",
      "headline": "Are Harry Styles and Zoe Kravitz dating? Their Rome walk has fans guessingSinger Harry Styles and actor Zoe Kravitz were seen holding hands in Rome, setting off dating rumours after a paparazzi video made the rounds on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-the-epic-teaser-ss-rajamouli-prabhas-rana-daggubati-anushka-shetty-tamannaah-bhatia-2777108-2025-08-26",
      "headline": "Baahubali The Epic teaser: Prabhas-starrer is a trip down memory laneThe teaser for 'Baahubali: The Epic', starring Prabhas, Rana Daggubati, Anushka Shetty and Tamannaah Bhatia, was released on Tuesday. Directed by SS Rajamouli, the film is set for a release on October 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hridayapoorvam-trailer-mohanlal-next-is-a-festive-mix-of-comedy-love-and-emotion-2777146-2025-08-26",
      "headline": "Hridayapoorvam trailer: Mohanlal's next is a festive mix of comedy, love and emotionMohanlal's latest film 'Hridayapoorvam' promises a feel-good narrative, releasing on August 28 during Onam festivities. The trailer hints at a humorous yet touching journey post heart surgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-bollywood-couples-arent-waiting-too-long-to-start-families-anymore-2777010-2025-08-26",
      "headline": "Why Bollywood couples aren't waiting too long to start families anymoreParineeti Chopra-Raghav Chadha joining the new wave of Bollywood couples embracing early parenthood reflects a broader shift in attitudes towards balancing career and family life. This change, influenced by evolving societal norms and post-pandemic perspectives, celebrates openness and the choice to prioritise love and legacy without delay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonam-bajwa-akeli-laila-baaghi-4-song-tiger-shroff-2777009-2025-08-26",
      "headline": "Sonam Bajwa is Bollywood's Akeli Laila in Baaghi 4 dance number. WatchActor Sonam Bajwa featured in the latest song of 'Baaghi 4' titled 'Akeli Laila', which released on Tuesday. The dance number also gives a glimpse into the action sequences of Tiger Shroff. 'Baaghi 4' is scheduled for a theatrical release on September 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sophie-turner-defends-game-of-thrones-controversial-rape-scene-on-women-struggles-patriarchy-trigger-warnings-2777038-2025-08-26",
      "headline": "Sophie Turner says Game of Thrones rape scene was triggering, highlighted patriarchySophie Turner reflected on the controversial rape scene in 'Game of Thrones'. She supported the show's portrayal of women's struggles, and suggested adding trigger warnings if released today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-anniversary-wish-for-kirron-has-outlander-twist-2776958-2025-08-26",
      "headline": "Anupam Kher's loving anniversary wish for Kirron has Outlander twist. WatchAnupam Kher and Kirron Kher celebrated their 40th wedding anniversary with Instagram posts, recalling cherished memories and their journey together. Anupam shared a special Outlander video that once uplifted Kirron, while she called him her best friend and life partner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-shares-note-on-privacy-photos-of-under-construction-home-go-viral-2777079-2025-08-26",
      "headline": "Alia Bhatt shares note on privacy as pics of her under construction home go viralActor Alia Bhatt shared a note on privacy and consent after photos of her under-construction home went viral. She called out the paparazzi with regard to a serious privacy and security breach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/farrhana-bhatt-bigg-boss-19-kashmir-image-change-2777061-2025-08-26",
      "headline": "Farrhana Bhatt hopes Bigg Boss 19 changes Kashmir's perceptionFarrhana Bhatt joins 'Bigg Boss 19' to represent Kashmir and its unique culture. In an exclusive chat with India Today, Bhatt said that she aims to change the state's image while embracing the show's political theme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rima-kallingal-kerala-film-critics-award-theatre-the-myth-of-reality-media-focus-amma-2777022-2025-08-26",
      "headline": "Rima Kallingal slams media focus on Malayalam film body: I'm an artist firstMalayalam actor Rima Kallingal has voiced her frustration at the media for overlooking her Kerala Film Critics Award win for 'Theatre: The Myth of Reality'. Despite her acclaimed performance, questions centred on AMMA's internal matters."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/amit-shah-claimed-bjp-will-stay-in-power-for-50-years-as-it-does-vote-chori-rahul-gandhi-sharpens-attack-2777212-2025-08-26",
      "headline": "Amit Shah talks about 50 years of BJP rule because of 'vote chori': Rahul GandhiCongress leaders Rahul Gandhi and Priyanka Gandhi Vadra on Tuesday sharpened their attack on the BJP, accusing them of \"stealing votes\" to stay in power."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/5-killed-14-injured-due-to-landslides-on-vaishno-devi-yatra-route-amid-heavy-rain-in-jk-2777128-2025-08-26",
      "headline": "10 killed in J&K, including 6 on Vaishno Devi Yatra route, amid rain and landslidesA heavy downpour triggered a landslide on the route to the Mata Vaishno Devi shrine atop Jammu and Kashmir's Trikuta hills, leaving at least six dead and 14 injured."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-refused-donald-trump-calls-four-times-in-recent-weeks-german-newspaper-frankfurter-allgemeine-faz-2777026-2025-08-26",
      "headline": "Modi refused Trump's calls 4 times in recent weeks: German newspaperUS President Donald Trump tried to talk to Indian Prime Minister Narendra Modi four times in recent weeks amid a raging trade dispute, but the Indian leader refused to talk, according to German newspaper Frankfurter Allgemeine. This demonstrates the anger and caution in New Delhi, suggests the Mainz-based newspaper of record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-set-to-seal-1-billion-deal-for-113-engines-to-power-lca-tejas-fleet-2777236-2025-08-26",
      "headline": "India, US set to seal $1 billion jet engine deal amid Trump tariff rowIndia and the United States are close to finalising a defence deal worth over USD 1 billion for 113 GE-404 engines to power 97 LCA Mark 1A jets, ensuring timely delivery of the aircraft to the armed forces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-cleric-engineer-muhammad-ali-mirza-arrested-controversial-remarks-prophet-muhammad-blasphemy-controversy-2777149-2025-08-26",
      "headline": "Pak arrests cleric Engineer Mirza. Here's why his remarks sparked outragePopular Pakistani cleric Engineer Muhammad Ali Mirza was arrested over alleged blasphemous remarks. His controversial reference to Prophet Muhammad in his videos triggered an outrage, and ultimately led to his arrest after a religious group filed complaints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mohan-bhagwat-rss-100-year-celebration-purpose-bharat-vishwaguru-2777261-2025-08-26",
      "headline": "RSS's purpose is Bharat, significance lies in India as vishwaguru: Mohan BhagwatAt an event celebrating the RSS's century-long journey, Mohan Bhagwat said the essence of the organisation lies in the concluding line of its daily prayer, Bharat Mata ki Jai."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/army-officer-ritesh-kumar-singh-who-assaulted-spicejet-staff-at-srinagar-airport-put-on-no-fly-list-2777278-2025-08-26",
      "headline": "Army officer put on 5-year no-fly list month after assault on SpiceJet staffArmy officer Lt Col Ritesh Kumar Singh has been put on the no-fly list weeks after he violently assaulted SpiceJet staff at Srinagar airport over excess baggage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2013-made-in-india-unmade-by-trump-2777225-2025-08-26",
      "headline": "From the India Today archives (2013) | Made in India, unmade by Trump?With the additional 25 per cent US tariffs on Indian goods kicking in, the country's manufacturing sector faces new challenges"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/africa-india-map-distortion-global-south-europe-correcting-mercator-equal-earth-projection-campaign-explained-2776606-2025-08-26",
      "headline": "What's wrong with Africa's map? Does it concern India too?The African Union has intensified a campaign for the use of the \"right map of Africa\". In the widely used Mercator map, Africa appears smaller than it is. In a bid to depict the continent's relative size accurately, African leaders are challenging the outdated colonial perspectives for fairer perceptions in education, media, and policy. Should India, which is also depicted smaller than it is, take it up?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-collegium-patna-high-court-vm-pancholi-elevation-justice-nagarathna-dissent-regional-seniority-2776981-2025-08-26",
      "headline": "Collegium split over top court pick, dissenting judge cites 'regional imbalance'The Supreme Court Collegium's decision recommending the elevation of Patna High Court Chief Justice VM Pancholi to the top court was reportedly not unanimous, with one of the five members dissenting on grounds of regional representation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/samay-raina-apology-india-got-latent-supreme-court-case-disability-2777163-2025-08-26",
      "headline": "No intent to offend: Samay Raina says sorry in Supreme Court for mocking disabledSamay Raina apologised and clarified that his intent was never to ridicule but to promote inclusivity, while pledging greater care in future performances and shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/why-donald-trump-silently-switched-laws-in-india-tariff-case-ieepa-us-court-ruling-tax-rate-duties-russia-war-oil-2768888-2025-08-26",
      "headline": "Why Trump was forced to silently switch laws in India tariff caseIn April, US President Trump used a national emergency law from 1977 to impose tariffs against India and other countries. However, a legal challenge, which is ongoing, forced him to silently switch to a 1962 law to enforce the tariffs. Can the case against the use of the 1977 law have bearings on Trump's tariffs?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/foreign-nationals-clean-gurugram-drains-and-roads-viral-video-sparks-outrage-2777184-2025-08-26",
      "headline": "Foreign nationals clean Gurugram drains and roads, video sparks outrageResidents from countries including Serbia and France took part in a cleanliness drive across parts of Gurugram on August 24.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/4-dead-vaishno-devi-yatra-suspended-as-heavy-rains-landslides-hit-india-2777109-2025-08-26",
      "headline": "Floods ravage Himachal, landslides in J&K, Arunachal amid heavy rain; 10 dead Over the past 48 hours, nature's fury has been particularly unforgiving in the hill states of Jammu & Kashmir and Himachal Pradesh, where rivers have surged past danger marks, homes have been swept away, roads washed out, and entire communities cut off. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-interview-ipl-test-specialist-advice-youngsters-2777260-2025-08-26",
      "headline": "Wouldn't tell youngsters to focus on just Test cricket: Cheteshwar PujaraCheteshwar Pujara, speaking to India Today, said Test selections are now increasingly influenced by both red-ball performances and white-ball exploits, urging youngsters to equip themselves to excel across all three formats. The batting great admitted he missed out on IPL deals after being labelled a Test specialist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/stevia-monk-fruit-jaggery-sugar-sucrose-which-sweetener-belongs-in-your-diet-2777029-2025-08-26",
      "headline": "Stevia, monk fruit, jaggery: Which sugar belongs in your diet?The first thing to understand is that there's no such thing as \"healthy\" sugar. Honey and jaggery are still considered free sugars, which your body processes just like table sugar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-bollywood-couples-arent-waiting-too-long-to-start-families-anymore-2777010-2025-08-26",
      "headline": "Why Bollywood couples aren't waiting too long to start families anymoreParineeti Chopra-Raghav Chadha joining the new wave of Bollywood couples embracing early parenthood reflects a broader shift in attitudes towards balancing career and family life. This change, influenced by evolving societal norms and post-pandemic perspectives, celebrates openness and the choice to prioritise love and legacy without delay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/shrekking-problematic-dating-trend-relationship-experts-warn-2777152-2025-08-26",
      "headline": "Shrekking: The problematic dating trend you should stay away fromShrekking, a new dating term, refers to dating someone less attractive than you in the hope of being treated better in the relationship."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/up-auraiya-monkey-snatches-bag-containing-rs-80000-rains-money-from-tree-viral-video-2777202-2025-08-26",
      "headline": "Monkey snatches bag containing Rs 80,000, rains money from tree in UP. Watch videoWitnesses said the monkey began tearing and tossing the currency, creating a \"rain of money\" in the compound. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/rss-red-flag-harassment-of-bengali-migrants-a-self-goal-against-mamata-2777138-2025-08-26",
      "headline": "RSS red-flag: Harassment of Bengali migrants a self-goal against MamataFor the RSS, in the run-up to Bengal polls, it is as important to reinforce its ideology on Bangladeshi infiltration as to project sensitivity towards Bengali cultural pride"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/new-world-screwworm-flesh-eating-parasite-infection-first-human-case-confirmed-in-us-from-el-salvador-travel-2777072-2025-08-26",
      "headline": "First human case of flesh-eating parasite confirmed in US: What is it?The US has confirmed its first human case of New World screwworm parasite infestation. Authorities warn of potential livestock risks and advise travellers to take precautions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/long-before-the-silk-road-indias-golden-road-to-china-2775857-2025-08-26",
      "headline": "Cholas and Pallavas traded with China centuries ago, coins tell the storyCoins found in the territories of the Cholas (Thanjavur, Thallikottai) recall an age when the Bay of Bengal was a maritime highway, carrying silk and spices, and connecting the Tamil shores with China. The maritime route not only flourished with trade but also carried cultural influence across Southeast Asia. This route may well be described as the 'Golden Road' that transformed the world."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/noida-dowry-death-accused-husband-vipin-had-an-affair-hit-lover-after-wife-nikki-caught-them-2776804-2025-08-26",
      "headline": "Noida dowry death: Accused husband had an affair, hit lover after wife caught themIn her complaint, the woman alleged that Vipin and his friend Tushar called her outside her village, forced her into their vehicle, and drove away. She further claimed that they physically assaulted her, verbally abused her, and snatched her phone. She also stated that Vipin and his friend threatened to kill her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-goa-india-host-schedule-2777165-2025-08-26",
      "headline": "Goa to host Chess World Cup as showpiece event returns to India after 23 yearsThe Chess World Cup has returned to India after 23 years with Goa set to host the upcoming event later this year from October 30 to November 27. 206 participants are set to battle for a massive USD 2,000,000 prize money. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-sony-sports-promo-virender-sehwag-criticism-2777224-2025-08-26",
      "headline": "Asia Cup promo sparks debate for India vs Pakistan focus amid tensionsThe official promo for the Asia Cup, with special focus on the India vs Pakistan clash on September 14, has sparked online backlash, with fans citing the Pahalgam terror attack and Virender Sehwag's involvement as key points of contention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-interview-ipl-test-specialist-advice-youngsters-2777260-2025-08-26",
      "headline": "Wouldn't tell youngsters to focus on just Test cricket: Cheteshwar PujaraCheteshwar Pujara, speaking to India Today, said Test selections are now increasingly influenced by both red-ball performances and white-ball exploits, urging youngsters to equip themselves to excel across all three formats. The batting great admitted he missed out on IPL deals after being labelled a Test specialist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ruben-amorim-manchester-united-european-football-not-ready-building-foundations-2777253-2025-08-26",
      "headline": "Manchester United need time to build before competing in Europe: Ruben AmorimManchester United manager, Ruben Amorim, admitted that his side was not ready for European football and wants to focus on building the foundations first before competing on all fronts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-sunil-gavaskar-foreign-pundits-india-bcci-squad-selection-remarks-2777240-2025-08-26",
      "headline": "Asia Cup 2025: Sunil Gavaskar slams foreign pundits over India squad remarksFormer India captain Sunil Gavaskar said that foreign cricketers should have no business around India's squad selection. He adds that pundits comment negatively to gain more followers from India on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-message-cheteshwar-pujara-retirement-2777230-2025-08-26",
      "headline": "Puji, thanks for making my job easier: Virat Kohli's Insta note for ex-teammateVirat Kohli penned an emotional message for Cheteshwar Pujara after he retired from Indian cricket. Pujara, who retired on August 24, ended his career with 7,195 Test runs in 103 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sl-brendon-taylor-returns-zimbabwe-odi-squad-sri-lanka-series-2777222-2025-08-26",
      "headline": "Brendon Taylor set for ODI comeback, named in Zimbabwe's squad for Sri Lanka seriesBrendon Taylor could make his return to ODI cricket since his last in 2021 as he was named for the two-match series against Sri Lanka set to be held in Harare, later in August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-3-updates-iga-swiatek-jannik-sinner-coco-gauff-2777216-2025-08-26",
      "headline": "Day 3 LIVE: Swiatek takes dominant win, Sinner in action nextUS Open 2025 Day 3 Live Updates: Iga Swiatek picked up a dominant win over Colombia's Emiliana Arango on Centre Court while Lorenzo Musetti is currently up against France's Giovanni Mpetshi Perricard. Later in the day, Jannik Sinner, Alexander Zverev and Coco Gauff will be in action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/hs-prannoy-bwf-world-championships-2025-joakim-oldorff-win-2777217-2025-08-26",
      "headline": "BWF World Championships: HS Prannoy makes solid start with straight games winIndia's HS Prannoy defeated Finland's Joakim Oldorff 21-18, 21-15 in the BWF World Championships 2025 opener. He now faces 2nd seed Anders Antonsen in the next round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/cheteshwar-pujara-says-ultimate-goal-was-to-play-for-india-again-wanted-the-comeback-2777201-2025-08-26",
      "headline": "Pujara says ultimate goal was to play for India again: Wanted the comebackCheteshwar Pujara revealed, in an exclusive interview with India Today's Consulting Editor Rajdeep Sardesai and Sports Consulting Editor Nikhil Naz, that his ultimate goal was to play for India again as he was eager to make a comeback to the Test team. Pujara announced his retirement from Indian cricket on August 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hanuma-vihari-andhra-tripura-india-domestic-season-2777196-2025-08-26",
      "headline": "Good enough to play all three formats: Hanuma Vihari joins TripuraAfter leaving Andhra, veteran India batter Hanuma Vihari has joined Tripura for the 2025-26 season, saying that he's still good enough to play all three formats of the game. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-buchi-babu-back-to-back-centuries-india-selectors-comeback-2777172-2025-08-26",
      "headline": "Sarfaraz sends message to India selectors with successive Buchi Babu 100s\fBack-to-back centuries in the Buchi Babu Tournament have reignited Sarfaraz Khan's push for an India Test comeback. The Mumbai batter is seizing opportunities amid middle-order vacancies ahead of the home series against the West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-3-updates-iga-swiatek-jannik-sinner-coco-gauff-2777216-2025-08-26",
      "headline": "Day 3 LIVE: Swiatek takes dominant win, Sinner in action nextUS Open 2025 Day 3 Live Updates: Iga Swiatek picked up a dominant win over Colombia's Emiliana Arango on Centre Court while Lorenzo Musetti is currently up against France's Giovanni Mpetshi Perricard. Later in the day, Jannik Sinner, Alexander Zverev and Coco Gauff will be in action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/hs-prannoy-bwf-world-championships-2025-joakim-oldorff-win-2777217-2025-08-26",
      "headline": "BWF World Championships: HS Prannoy makes solid start with straight games winIndia's HS Prannoy defeated Finland's Joakim Oldorff 21-18, 21-15 in the BWF World Championships 2025 opener. He now faces 2nd seed Anders Antonsen in the next round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/cheteshwar-pujara-says-ultimate-goal-was-to-play-for-india-again-wanted-the-comeback-2777201-2025-08-26",
      "headline": "Pujara says ultimate goal was to play for India again: Wanted the comebackCheteshwar Pujara revealed, in an exclusive interview with India Today's Consulting Editor Rajdeep Sardesai and Sports Consulting Editor Nikhil Naz, that his ultimate goal was to play for India again as he was eager to make a comeback to the Test team. Pujara announced his retirement from Indian cricket on August 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hanuma-vihari-andhra-tripura-india-domestic-season-2777196-2025-08-26",
      "headline": "Good enough to play all three formats: Hanuma Vihari joins TripuraAfter leaving Andhra, veteran India batter Hanuma Vihari has joined Tripura for the 2025-26 season, saying that he's still good enough to play all three formats of the game. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-buchi-babu-back-to-back-centuries-india-selectors-comeback-2777172-2025-08-26",
      "headline": "Sarfaraz sends message to India selectors with successive Buchi Babu 100s\fBack-to-back centuries in the Buchi Babu Tournament have reignited Sarfaraz Khan's push for an India Test comeback. The Mumbai batter is seizing opportunities amid middle-order vacancies ahead of the home series against the West Indies."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}