{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cigarette-prices-set-to-rise-government-may-hike-gst-on-tobacco-products-cess-tax-2682653-2025-02-20",
      "headline": "Cigarette prices set to rise? Government may hike GST on tobacco productsCurrently, cigarettes and other tobacco products attract a GST of 28% along with various other levies, taking the total tax burden to 53%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-ahead-outlook-dalal-streets-losing-streak-why-the-market-fall-may-not-end-soon-nse-bse-2682632-2025-02-20",
      "headline": "Dalal Street's losing streak: Why the market fall may not end soonStock Market: The earnings growth of Nifty50 companies was 5% in the October-December quarter, marking the third straight quarter of single-digit growth, which is a sharp contrast to the double-digit profit growth seen in the previous two years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-end-flat-in-volatile-session-small-and-midcaps-gain-2682344-2025-02-19",
      "headline": "Sensex, Nifty end marginally lower in volatile session; small and midcaps gainThe S&P BSE Sensex ended 28.21 points lower at 75,939.18, while the NSE Nifty50 settled 12.40 points lower at 22,932.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fiis-fpis-continue-to-dump-indian-stocks-what-it-means-for-your-investment-portfolio-2682292-2025-02-19",
      "headline": "FIIs continue to dump Indian stocks: What it means for your investment portfolioWith FIIs selling aggressively, smallcaps and midcaps bleeding, and China attracting inflows, here's what retail investors should do. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-likely-to-set-up-manufacturing-hub-india-maharashtra-gujarat-2682262-2025-02-19",
      "headline": "Tesla likely to set up shop in India, may invest $3-5 billion: Sources During their visit, Tesla executives are expected to hold meetings with officials from the Prime Minister's Office (PMO) and other key ministries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/small-sip-big-returns-investment-tip-check-how-rs-250-a-month-can-grow-to-rs-17-lakh-sbi-jannivesh-2682243-2025-02-19",
      "headline": "Small SIP, big returns: Check how Rs 250 a month can grow to Rs 17 lakhSBI Mutual Fund's new JanNivesh SIP is making investing more accessible, letting anyone start with as little as Rs 250 a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-is-indias-most-valuable-company-check-other-firms-in-top-10-2682232-2025-02-19",
      "headline": "Reliance is India's most valuable company. Check top 10 firms in Hurun India 500The 2024 Burgundy Private Hurun India 500 report values Reliance at Rs 17.5 lakh crore. TCS comes in second at Rs 16.1 lakh crore, and HDFC Bank takes third place with Rs 14.2 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dr-reddys-aurobindo-phrama-why-pharma-stocks-fell-in-early-trade-today-2682211-2025-02-19",
      "headline": "Dr Reddy's, Aurobindo Pharma: Why pharma stocks fell in early trade today?The Nifty Pharma index dropped as much as 2% in early trade. Sun Pharma fell nearly 2%, Dr Reddy's dropped as much as 4%, and Aurobindo Pharma sank almost 6%. Cipla shares also fell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-get-boost-after-clsa-upgrade-check-target-price-2682190-2025-02-19",
      "headline": "Tata Motors shares get boost after CLSA upgrade. Check target priceTata Motors share price: At around 11:04 am, shares of Tata Motors were trading 0.34% higher at Rs 683.90 on the Bombay Stock Exchange (BSE). It was up over 1% in early trade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hexaware-technologies-shares-debut-at-5-premium-over-ipo-price-2682180-2025-02-19",
      "headline": "Hexaware Technologies shares debut at 5% premium over IPO priceHexaware Technologies IPO listing: The listing was largely in line with expectations, as the grey market premium (GMP) had disappeared ahead of the debut, indicating weak demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-lower-as-it-pharma-stocks-drag-markets-2682149-2025-02-19",
      "headline": "Sensex, Nifty open lower as IT, pharma stocks drag marketsThe S&P BSE Sensex shed 291.20 points to 75,676.19, while the NSE Nifty50 lost 88.65 points to 22,856.65 as of 9:25 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quality-power-ipo-allotment-status-online-guide-latest-gmp-listing-date-allotment-date-2682131-2025-02-19",
      "headline": "Quality Power IPO: Check allotment status, latest GMP and listing date Quality Power IPO allotment status: Investors who applied for the Quality Power IPO can check their allotment status through the BSE website or the registrar's website (Link Intime India Private Ltd)."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aashram-3-part-2-trailer-bobby-deol-is-back-as-the-menacing-baba-nirala-2682511-2025-02-19",
      "headline": "Aashram 3 part 2 trailer: Bobby Deol is back as the menacing Baba NiralaAshram Season 3, Part 2 trailer: The much-awaited Aashram returns with Part 2 of Season 3, directed by Prakash Jha. The new season delves into themes of power, betrayal, and revenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/melo-movie-review-slow-burn-netflix-drama-choi-wooshik-park-boyoung-kim-jaewook-2682347-2025-02-19",
      "headline": "Melo Movie review: A slow-burn, mature drama that will stay with youReleased-Fri Feb 14, 2025Melo Movie released in Netflix on February 14. Starring Choi Woo-shik and Park Bo-young, the 10-episode-show deals with love, loss, and grief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/new-matthew-perry-documentary-promises-to-dig-deep-into-the-hollywood-tragedy-2682494-2025-02-19",
      "headline": "New Matthew Perry documentary promises to dig deep into the Hollywood tragedyA new Matthew Perry documentary called Matthew Perry: A Hollywood Tragedy will be out later this month, wherein the makers will investigate the untimely death of the Friends star. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-first-frost-review-love-trauma-longing-new-chinese-drama-delivers-it-all-2682428-2025-02-19",
      "headline": "The First Frost review: Love, trauma, longing - new Chinese drama delivers it all Released-Thu Feb 20, 2025The First Frost review: This Chinese drama delves into the complexities of love, trauma, and longing, offering a poignant narrative that diverges from typical romance tropes. With its melancholic visuals and dual perspectives, it explores the tangled history between its protagonists, making it a compelling watch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javed-mother-on-her-bold-fashion-was-shocked-at-first-but-i-support-her-2682289-2025-02-19",
      "headline": "Uorfi Javed's mother on her bold fashion: Was shocked at first, but I support herUorfi Javed revealed her mother was the first in their family to try Botox. Her mother also recalled her reaction when she saw Uorfi's \"new style\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suzhal-the-vortex-season-2-trailer-kathir-takes-on-gripping-murder-mystery-with-aishwarya-rajesh-2682271-2025-02-19",
      "headline": "Suzhal 2 trailer: Kathir takes on gripping murder mystery with Aishwarya RajeshThe official trailer of the highly-anticipated second season of the Tamil crime thriller Suzhal - The Vortex was released on Wednesday. Starring Kathir and Aishwarya Rajesh in lead roles, the series will premiere on Prime Video on February 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rihanna-thankful-humbled-after-aap-rocky-found-not-guilty-in-shooting-case-2682140-2025-02-19",
      "headline": "Rihanna 'thankful, humbled' after A$AP Rocky found not guilty in shooting caseA$AP Rocky was declared not guilty in a felony assault trial, leading to an emotional embrace with Rihanna in court. After the verdict, the singer issued her first statement, expressing relief. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papons-valentines-day-special-show-retro-hits-to-soulful-music-moh-moh-ke-dhaage-to-bulleya-2681678-2025-02-18",
      "headline": "Retro hits to soulful music: Magical evening at Papon's Valentine's Day special showPapon's concert in Delhi, hosted by TV9, was an unforgettable night filled with soulful music. Held at Major Dhyan Chand National Stadium, the event was part of the World Travel and Tourism Festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-picks-fathers-video-call-during-live-concert-2681893-2025-02-18",
      "headline": "Watch: Arijit Singh attends father's video call during live concertArijit Singh's live concert in Chandigarh was made memorable by a surprise video call from his father during his performance. The singer shared heartfelt moments from the event on Instagram, expressing gratitude to his fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/baarishein-singer-anuv-jain-married-shares-photos-with-wife-2681838-2025-02-18",
      "headline": "Pics: Singer Anuv Jain married, shares photos with wifeSinger Anuv Jain, popular for songs like Baarishein, is now married. He shared photos from the wedding and pre-wedding festivities on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-akhil-sachdeva-on-diljit-dosanjh-infrastructure-remark-2681792-2025-02-18",
      "headline": "Singer Akhil Sachdeva on Diljit Dosanjh's infrastructure remark: I feel it's amazingSinger Akhil Sachdeva discusses the rise of concerts in India, film vs indie music, ticket prices, and Diljit Dosanjh's comments on concert infrastructure. He also stresses the importance of crediting technicians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/k-drama-2025-when-life-gives-you-tangerine-to-wife-of-a-21st-century-prince-full-list-from-kakao-entertainment-2681749-2025-02-18",
      "headline": "K-slate 2025: When Life Gives You Tangerine to Wife of a 21st Century PrinceKakao Entertainment is set to make 2025 a landmark year for K-dramas and films, with a rich array of releases across various genres. From gripping thrillers to heartwarming romances, the lineup promises stellar performances and captivating stories."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-donald-trump-hints-at-us-poll-meddling-in-india-they-were-trying-to-get-someone-elected-2682615-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump hints at US poll meddling over USAID fund: Have to tell Indian governmentDonald Trump's latest remarks come as he continues to defend the Elon Musk-led Department of Government Efficiency's move to cut the $21 million funding for India, while questioning why the country needs it despite its strong economic position. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/delhi/story/delhi-chief-minister-bjp-mla-rekha-gupta-mega-oath-taking-ceremony-ramlila-maidan-2682609-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rekha Gupta's oath as Delhi's 4th woman Chief Minister at mega ceremony today   Live UpdatesRekha Gupta won the Delhi Assembly polls from Shalimar Bagh defeating AAP candidate Bandana Kumari by over 29,000 votes. She is set to become the fourth woman Chief Minister of Delhi after Sushma Swara, Sheila Dikshit and Atishi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-volodymyr-zelenskyy-ukraine-riyadh-talks-russia-dictator-without-elections-2682551-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Move fast or you won't have country left: Trump's message to 'dictator' ZelenskyyDonald Trump launched a scathing attack on Volodymyr Zelenskyy, calling him a \"dictator without elections\" and blaming him for the Russia-Ukraine war, amid raising tensions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/punjab/story/punjab-man-navdeep-singh-list-deportees-from-us-not-returned-no-contact-with-family-2682649-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Punjab man on list of deportees from US, yet to return; no contact with familySince February 5, at least 332 illegal Indian immigrants have returned to the country onboard US military aircraft. The deportation drive is part of President Donald Trump's massive crackdown against undocumented aliens in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/iphone-16e-launched-in-india-price-full-specs-2678409-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "iPhone 16e launched in India: Price, full specsApple has officially launched the iPhone 16e in India. The device comes with a starting price of Rs 59,900. Here are full specs, features, design and India price details."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rekha-gupta-taking-oath-as-delhi-chief-minister-reflects-pm-modi-vision-women-empowerment-2682625-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Reflects PM's vision: Rekha Gupta ahead of taking oath as Delhi Chief MinisterRekha Gupta spoke to India Today's sister website, AajTak, hours before her swearing-in ceremony and said that her taking the oath as Delhi Chief Minister reflects PM Modi's vision of women empowerment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-india-vs-bangladesh-match-preview-2682603-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Litmus test for Rohit Sharma, Gautam Gambhir as India seek Champions Trophy gloryIndia begin their Champions Trophy 2025 campaign on Thursday, February 20 against Bangladesh. Captain Rohit Sharma has already confirmed that the Men in Blue will be backing their spinners at the Dubai International Stadium."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-police-files-cases-photos-women-bathing-maha-kumbh-sold-online-telegram-2682584-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India Today impact: UP cops crack down on sale of Kumbh bathing photosAn India Today expose revealed how photos and videos of women taking a ritual bath at Maha Kumbh were being shared online through social media accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapooor-alia-bhatt-kareena-kapoor-karisma-kapoor-dance-to-tare-gin-gin-at-cousin-adaars-mehndi-2682640-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Ranbir-Alia, Kareena-Karisma dance to Tare Gin Gin at cousin Aadar's mehndiAn inside video of Aadar Jain and Alekha Advani's grand mehndi surfaced online featuring Ranbir Kapoor, Alia Bhatt, Kareena Kapoor and Karisma Kapoor, among others. The cousins can be seen grooving to the chartbuster Tare Gin Gin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parvesh-verma-kapil-mishra-likely-cabinet-ministers-delhi-sources-2682562-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi cabinet: Parvesh Verma, Kapil Mishra among six to take oath as ministersDelhi New Cabinet Ministers List 2025: Parvesh Verma, Kapil Mishra and four other BJP leaders will take oath as Delhi cabinet ministers today during Rekha Gupta's swearing-in as Chief Minister of the national capital."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/woman-detained-beating-up-boy-objects-dog-entry-lift-greater-noida-gaur-city-2-society-2682617-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Woman drags boy, 8, out of society lift after he objects to dog's entryAfter a video of the incident went viral on social media, angry residents held a protest against the woman outside the gate of society and demanded strict action against her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/iisc-tops-the-world-reputation-rankings-2025-iit-bombay-drops-out-2682346-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Only 4 Indian institutes in global reputation rankings, IISc tops in IndiaIISc, IIT Delhi, and IIT Madras have slipped in THE World Reputation Rankings 2025, while IIT Bombay has dropped out. Harvard remains number one globally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-bangladesh-varun-chakravarthy-experiment-india-fans-pressure-2682616-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Varun Chakravarthy experiment 2.0: Why India fans need to cool downIndia vs Bangladesh: India fans are hyped about Varun Chakravarthy's potential impact in the Champions Trophy, but with his inexperience in ODIs and India's spin depth, it's important to temper expectations and avoid putting undue pressure on the mystery spinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/jet-set-go-where-will-india-pick-f-35-or-indigenous-stealth-fighter-2682468-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jet, set, go where? Will India pick F-35 or indigenous stealth fighter?With Rs 15,000 crore already committed to the indigenous Advanced Medium Combat Aircraft programme, will India take Donald Trump's F-35 bait or stay the course?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-new-cm-who-is-rekha-gupta-chief-minister-why-bjp-chose-shalimar-bagh-mla-2682531-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Rekha Gupta, and why BJP chose her Delhi CMThe BJP has picked Rekha Gupta, a three-time councillor, as the Chief Minister of Delhi. In picking Gupta, who started her political career with the Delhi University Students Union elections, the BJP has tried to cement a legacy and convey a message to its women voter base. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-donald-trump-considers-distributing-20-of-doge-savings-to-american-citizens-2682607-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump considers distributing 20% of DOGE savings to American citizensPresident Donald Trump said his administration may return 20% of savings from Elon Musk's Department of Government Efficiency (DOGE) to Americans, with another 20% going toward federal debt reduction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-bangladesh-rishabh-pant-over-kl-rahul-wicketkeeper-2682619-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Champions Trophy 2025: India should take the punt with Pant over KL RahulChampions Trophy 2025: The Indian team management maybe backing KL Rahul as the No.1 wicketkeeper at the moment but the champions trophy could be the right platform to take the punt with Rishabh Pant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-vicky-kaushal-tax-free-madhya-pradesh-chhatrapati-sambhaji-maharaj-2682618-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vicky Kaushal's Chhaava is now tax-free in Madhya PradeshVicky Kaushal and Akshaye Khanna-starrer Chhaava has been made tax-free in Madhya Pradesh. Chief Minister Mohan Yadav announced the news on his official X page."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-atishi-react-after-bjp-picks-rekha-gupta-as-next-chief-minister-2682546-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hope she fulfils promises: Arvind Kejriwal after Rekha Gupta picked Chief MinisterAAP chief Arvind Kejriwal and outgoing Chief Minister Atishi said they hoped Rekha Gupta would fulfill all the promises BJP had made to the Delhi residents.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/arizona-plane-crash-2-dead-after-two-small-planes-collide-in-us-2682606-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2 dead after two small planes collide midair in Arizona A midair collision between two small planes near Marana Regional Airport in southern Arizona killed at least two people Wednesday, authorities said. One plane landed safely, while the other crashed near a runway and caught fire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/usaid-usd-21-million-voter-turnout-india-irony-contrast-india-expenditure-lok-sabha-election-us-presidential-election-2682424-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The $21-million USAID joke, and it isn't on IndiaUSAID used $21 million of American taxpayer money to boost voter turnout in India, according to Elon Musk's DOGE. India has been spending more on elections than the US and sees a better voter turnout too. That's the $21-million joke. On a serious note, the money could have been used to interfere in India's electoral process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-senator-goes-after-musk-over-doge-internet-brings-up-tesla-ceos-paypal-role-2682500-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US Senator goes after Musk over DOGE, internet hits back with PayPal referenceUS Senator John Fetterman shared a news report about DOGE allegedly trying to access private taxpayer data. Elon Musk and other people on the internet were quick to fire back at Fetterman and brought up the Tesla CEO's past role at PayPal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/car-crash-injures-3-of-family-leads-to-discovery-of-3-bodies-at-home-in-kolkata-2682563-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Car crash injures 3 of family, leads to discovery of 3 bodies at home in KolkataCar crash in Kolkata: Three members of a family were found dead at their home while three other members were involved in a road accident in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/maha-kumbh-water-quality-sangam-river-faecal-bacteria-uttar-pradesh-green-tribunal-pollution-control-board-2682523-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Wasting time? Tribunal slams UP body for Sangam report based on old samplesThe National Green Tribunal reprimanded Uttar Pradesh Pollution Control Board for submitting an affidavit on Sangam river water quality based on old samples. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thandel-ott-release-netfix-march-naga-chaitanya-and-sai-pallavi-2682651-2025-02-20",
      "headline": "Thandel OTT release: When and where to watch Naga Chaitanya and Sai Pallavi's filmNaga Chaitanya and Sai Pallavi's recently released film, Thandel, grossed over Rs 100 crore worldwide. The film is now gearing up for its OTT release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-box-office-collection-day-6-vicky-kaushal-rs-200-crore-2682652-2025-02-20",
      "headline": "Chhaava box office: Film surpasses Day 1 numbers, eyes Rs 200 crore clubChhaava box office collection: Vicky Kaushal's film saw a holiday boost, earning Rs 32 crore on Day 6, taking its total to Rs 197.75 crore. The film is set to cross Rs 200 crore today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishwak-sen-bumpy-career-journey-of-risks-setbacks-and-redemption-laila-mechanic-rocky-funky-2682014-2025-02-20",
      "headline": "Viswak Sen's bumpy career: A journey of risks, setbacks and redemptionVishwak Sen's rise in Telugu cinema was meteoric, but recent missteps have placed him at a pivotal point in his career. With a mix of bold choices and setbacks, the actor's future now hinges on the right scripts and performances.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapooor-alia-bhatt-kareena-kapoor-karisma-kapoor-dance-to-tare-gin-gin-at-cousin-adaars-mehndi-2682640-2025-02-20",
      "headline": "Watch: Ranbir-Alia, Kareena-Karisma dance to Tare Gin Gin at cousin Aadar's mehndiAn inside video of Aadar Jain and Alekha Advani's grand mehndi surfaced online featuring Ranbir Kapoor, Alia Bhatt, Kareena Kapoor and Karisma Kapoor, among others. The cousins can be seen grooving to the chartbuster Tare Gin Gin. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-pakistan-airforce-karachi-stadium-airshow-watch-video-2682657-2025-02-20",
      "headline": "Watch: Pakistan Air Force fly past Karachi stadium on Champions Trophy openerThe Pakistan Air Force held a spectacular airshow over Karachi National Stadium ahead of the Champions Trophy opener between hosts Pakistan and New Zealand. The breathtaking display left both the crowd and players in awe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-record-runs-india-vs-bangladesh-dubai-2682633-2025-02-20",
      "headline": "Champions Trophy: Rohit needs 12 runs vs Bangladesh to achieve historic featRohit Sharma is just 12 runs away from reaching 11,000 ODI runs, a milestone he could achieve in India's Champions Trophy opener against Bangladesh, making him the second-fastest batter to achieve this historic feat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-bangladesh-rishabh-pant-over-kl-rahul-wicketkeeper-2682619-2025-02-20",
      "headline": "Champions Trophy 2025: India should take the punt with Pant over KL RahulChampions Trophy 2025: The Indian team management maybe backing KL Rahul as the No.1 wicketkeeper at the moment but the champions trophy could be the right platform to take the punt with Rishabh Pant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-new-zealand-semi-final-scenario-2682581-2025-02-20",
      "headline": "Can Pakistan qualify for semi-final after loss vs New Zealand?Champions Trophy 2025: After losing to New Zealand by 60 runs on Wednesday, Pakistan are in a must-win position for their remainder of their group games to qualify for the semi-final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-bangladesh-varun-chakravarthy-experiment-india-fans-pressure-2682616-2025-02-20",
      "headline": "Varun Chakravarthy experiment 2.0: Why India fans need to cool downIndia fans are hyped about Varun Chakravarthy's potential impact in the Champions Trophy, but with his inexperience in ODIs and India's spin depth, it's important to temper expectations and avoid putting undue pressure on the mystery spinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-record-titles-finals-apperances-most-runs-wickets-2682450-2025-02-20",
      "headline": "Champions Trophy 2025: How have India fared at mini-World Cup in the pastIndia have been one of the most successful sides in the history of the Champions Trophy. India will enter this year's competition as favourites to win the title once again under the leadership of Rohit Sharma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-india-vs-bangladesh-match-preview-2682603-2025-02-20",
      "headline": "Litmus test for Rohit Sharma, Gautam Gambhir as India seek Champions Trophy gloryIndia begin their Champions Trophy 2025 campaign on Thursday, February 20 against Bangladesh. Captain Rohit Sharma has already confirmed that the Men in Blue will be backing their spinners at the Dubai International Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-vs-new-zealand-champions-trophy-2025-mohammad-rizwan-2682574-2025-02-19",
      "headline": "Champions Trophy: Who said what as Pakistan capitulate against New Zealand in KarachiChampions Trophy: New Zealand beat Pakistan by 60 runs in the opening game of the ICC Champions Trophy 2025 as the hosts got their title defence off to a disastrous start. Captain Mohammad Rizwan reflected on his team's performance after the massive loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-delhi-capitals-up-warriorz-lanning-2682571-2025-02-19",
      "headline": "Sutherland, Lanning star as Delhi Capitals beat UP Warriorz in thriller WPL 2025: Annabel Sutherland's all-round performance and Meg Lanning's 69-run knock guided Delhi Capitals through to a seven-wicket win over UP Warriorz on Wednesday at the Kotambi Stadium in Vadodara. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-new-zealand-beat-pakistan-champions-trophy-2025-2682547-2025-02-19",
      "headline": "Champions Trophy: Hapless Pakistan's title defence off to woeful start at homeNew Zealand beat Pakistan by 60 runs in the opening game of the ICC Champions Trophy 2025, as the hosts got their tournament off to a disastrous start. Will Young (107) and Tom Latham (118) starred with centuries for New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azam-new-zealand-pakistan-reactions-2682543-2025-02-19",
      "headline": "Fans slam slow Babar Azam in Champions Trophy opener Champions Trophy: Babar Azam racked up an 81-ball fifty against New Zealand at the National Stadium in Karachi, but faced criticism for not being able to accelerate with Pakistan chasing 321."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-india-vs-bangladesh-match-preview-2682603-2025-02-20",
      "headline": "Litmus test for Rohit Sharma, Gautam Gambhir as India seek Champions Trophy gloryIndia begin their Champions Trophy 2025 campaign on Thursday, February 20 against Bangladesh. Captain Rohit Sharma has already confirmed that the Men in Blue will be backing their spinners at the Dubai International Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-vs-new-zealand-champions-trophy-2025-mohammad-rizwan-2682574-2025-02-19",
      "headline": "Champions Trophy: Who said what as Pakistan capitulate against New Zealand in KarachiChampions Trophy: New Zealand beat Pakistan by 60 runs in the opening game of the ICC Champions Trophy 2025 as the hosts got their title defence off to a disastrous start. Captain Mohammad Rizwan reflected on his team's performance after the massive loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-delhi-capitals-up-warriorz-lanning-2682571-2025-02-19",
      "headline": "Sutherland, Lanning star as Delhi Capitals beat UP Warriorz in thriller WPL 2025: Annabel Sutherland's all-round performance and Meg Lanning's 69-run knock guided Delhi Capitals through to a seven-wicket win over UP Warriorz on Wednesday at the Kotambi Stadium in Vadodara. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-new-zealand-beat-pakistan-champions-trophy-2025-2682547-2025-02-19",
      "headline": "Champions Trophy: Hapless Pakistan's title defence off to woeful start at homeNew Zealand beat Pakistan by 60 runs in the opening game of the ICC Champions Trophy 2025, as the hosts got their tournament off to a disastrous start. Will Young (107) and Tom Latham (118) starred with centuries for New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azam-new-zealand-pakistan-reactions-2682543-2025-02-19",
      "headline": "Fans slam slow Babar Azam in Champions Trophy opener Champions Trophy: Babar Azam racked up an 81-ball fifty against New Zealand at the National Stadium in Karachi, but faced criticism for not being able to accelerate with Pakistan chasing 321."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-bangladesh-dubai-shanto-rohit-sharma-2682515-2025-02-19",
      "headline": "India vs Bangladesh: Champions Trophy clash complete guideIND vs BAN, Champions Trophy 2025: Rohit Sharma and India would be looking to get off to a winning start when they face Najmul Hossain Shanto's Bangladesh on Thursday at the Dubai International Cricket Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-fakhar-zaman-open-law-explained-pakistan-2682535-2025-02-19",
      "headline": "Explained: Why Fakhar Zaman didn't open against New Zealand Champions Trophy: Fakhar Zaman came out to bat at No.4 in Pakistan's clash against New Zealand at the National Stadium in Karachi. The left-handed batter sustained an injury in the very first over of the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-icc-champions-trophy-2025-indias-record-in-dubai-india-vs-bangladesh-2682518-2025-02-19",
      "headline": "Champions Trophy 2025: What is India's record in Dubai?India are all set to start their campaign in the ICC Champions Trophy 2025 against Bangladesh. Here's a look at their record while playing in Dubai ahead of the all-important tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-press-conference-india-vs-bangladesh-2682508-2025-02-19",
      "headline": "We only have 2 spinners: Rohit Sharma hits back at criticism over squad selectionIndia opting to carry 5 spinners in their Champions Trophy squad has attracted criticism. One day before their opener vs Bangladesh, captain Rohit Sharma has hit back at the critics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-pakistan-exclusive-fans-obstacles-babar-azam-virat-kohli-2682475-2025-02-19",
      "headline": "Pakistan fans happily welcome Champions Trophy after 'countless obstacles' In an exclusive chat with India Today Digital, Pakistan fans Kisa Zahra, Abdul Rahman Shahbaz and Talha Hayat spoke about the return of the Champions Trophy to Pakistan. They spoke about the challenges faced by Pakistan cricket after the bus attack on the Sri Lankan team in 2009 which had led to international cricket coming to a halt in the Asian country.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-will-young-scores-century-champions-trophy-2025-pakistan-vs-new-zealand-2682437-2025-02-19",
      "headline": "Will Young dazzles on Champions Trophy debut with remarkable hundred vs PakistanNew Zealand batter Will Young scored a magnificent century in the first match of the ICC Champions Trophy 2025 against Pakistan in Karachi to rescue his team from a precarious position. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-bangladesh-shanto-press-conference-india-2682434-2025-02-19",
      "headline": "Bangladesh can beat any team in the Champions Trophy: ShantoChampions Trophy 2025: In the press conference prior to the clash against Rohit Sharma's India, Najmul Hossain Shanto said that Bangladesh have the potential to get the better of any team in the ongoing tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-pakistan-exclusive-fans-obstacles-babar-azam-virat-kohli-2682475-2025-02-19",
      "headline": "Pakistan fans happily welcome Champions Trophy after 'countless obstacles' In an exclusive chat with India Today Digital, Pakistan fans Kisa Zahra, Abdul Rahman Shahbaz and Talha Hayat spoke about the return of the Champions Trophy to Pakistan. They spoke about the challenges faced by Pakistan cricket after the bus attack on the Sri Lankan team in 2009 which had led to international cricket coming to a halt in the Asian country.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-will-young-scores-century-champions-trophy-2025-pakistan-vs-new-zealand-2682437-2025-02-19",
      "headline": "Will Young dazzles on Champions Trophy debut with remarkable hundred vs PakistanNew Zealand batter Will Young scored a magnificent century in the first match of the ICC Champions Trophy 2025 against Pakistan in Karachi to rescue his team from a precarious position. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-bangladesh-shanto-press-conference-india-2682434-2025-02-19",
      "headline": "Bangladesh can beat any team in the Champions Trophy: ShantoChampions Trophy 2025: In the press conference prior to the clash against Rohit Sharma's India, Najmul Hossain Shanto said that Bangladesh have the potential to get the better of any team in the ongoing tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/saqlain-mushtaq-bcci-comments-india-vs-pakistan-match-2682398-2025-02-19",
      "headline": "BCCI should be taught a lesson: Ex-spinner before India vs Pakistan matchFormer Pakistan spinner Saqlain Mushtaq has slammed the Indian Cricket Board ahead of the Champions Trophy. Speaking on a Pakistan TV channel, Mushtaq has complained about BCCI over multiple issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-shakib-al-hasan-najmul-shanto-bangladesh-india-2682383-2025-02-19",
      "headline": "Will Shakib Al Hasan's absence affect Bangladesh? Shanto gives blunt responseChampions Trophy 2025: Skipper Najmul Hossain Shanto gave a one-word response after being asked if Shakib Al Hasan's absence would affect Bangladesh in the tournament. The Tigers will start their campaign on February 20 against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-new-zealand-karachi-national-stadium-less-crowd-michael-vaughan-2682382-2025-02-19",
      "headline": "Where is the crowd? Vaughan, fans react to empty seats for Champions Trophy openerMichael Vaughan and fans were left stunned as the turnout for the first match of the Champions Trophy 2025 between Pakistan and New Zealand was poor. Empty seats have been visible during the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/former-mumbai-captain-and-selector-milind-rege-dies-at-76-2682353-2025-02-19",
      "headline": "Former Mumbai captain and selector Milind Rege dies at 76Former Mumbai team captain and selector Milind Rege died at the age of 76 on Wednesday, February 19. Rege suffered a heart attack on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-indian-flag-karachi-pakistan-new-zealand-2682349-2025-02-19",
      "headline": "Indian flag spotted flying high at National Stadium in KarachiChampions Trophy 2025: The Indian flag was seen flying high during the opening game of the tournament on Wednesday, February 19 between New Zealand and Pakistan at the National Stadium in Karachi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-new-zealand-fakhar-zaman-injury-fielding-karachi-2682324-2025-02-19",
      "headline": "Champions Trophy 2025: Pakistan dealt blow as Fakhar Zaman suffers injury in openerChampions Trophy: Pakistan have been dealt a big blow as opener Fakhar Zaman got injured while fielding in the opening match of the Champions Trophy 2025. Fakhar is a key player for Pakistan in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-shubman-gill-icc-odi-batter-rankings-babar-azam-2682287-2025-02-19",
      "headline": "ICC ODI Rankings: Shubman Gill overtakes Babar Azam to become No. 1 batterICC ODI Rankings: India batter Shubman Gill overtook Babar Azam to become the world No.1 batter in the ICC ODI rankings. Shubman became the top ranked batter after a sensational 3-match series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/lewis-hamilton-toto-wolff-ferrari-mercedes-jack-whitehall-video-2682277-2025-02-19",
      "headline": "Watch: Jack Whitehall trolls Mercedes boss Toto Wolff over Lewis HamiltonComedian Jack Whitehall decided to troll Mercedes boss Toto Wolff because of Lewis Hamilton's move to Ferrari ahead of the new F1 2025 season. Hamilton spent 12 years with Mercedes before his move to Ferrari. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-matt-kuhnemann-bowling-action-test-icc-decision-2682258-2025-02-19",
      "headline": "Australia's Matt Kuhnemann undergoes bowling action test, result next weekAustralia's Matt Kuhnemann has undergone the test by the ICC after being reported for a suspect bowling action during the tour of Sri Lanka. Kuhnemann underwent the test under the watchful eyes of ICC experts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-new-zealand-live-score-updates-group-a-today-match-karachi-2682247-2025-02-19",
      "headline": "PAK vs NZ Highlights: New Zealand beat Pakistan by 60 runs in KarachiPakistan vs New Zealand, Champions Trophy Highlights: New Zealand beat Pakistan by 60 runs in Group A at the National Stadium in Karachi. Khushdil Shah scored 69, but Pakistan could only manage to score 260 in 47.2 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-new-zealand-babar-azam-opening-lahore-2682196-2025-02-19",
      "headline": "Pakistan has no pressure: Babar Azam ahead of Champions Trophy opener vs NZChampions Trophy: Star batter Babar Azam has claimed that Pakistan are under no pressure ahead of their Champions Trophy opening match against New Zealand on Wednesday, February 19. Babar was part of Pakistan's Champions Trophy winning squad in 2017. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}