{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-on-track-to-become-2nd-largest-economy-by-2038-report-2778125-2025-08-28",
      "headline": "India on track to become 2nd largest economy by 2038: ReportWith a combination of a young population, rising domestic consumption, fiscal discipline, and structural reforms, India appears well-positioned to climb the global economic ladder in the coming decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dont-miss-this-step-after-filing-itr-here-what-to-do-2778053-2025-08-28",
      "headline": "Don't miss this step after filing ITR: Here's what to doSimply filing your ITR is not enough. You must verify it within 30 days, else, missing this important step could mean delays, penalties, and even your return being declared invalid."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/raghuram-rajan-explains-trump-using-tariff-as-weapon-india-powerplay-russia-oil-buying-2778050-2025-08-28",
      "headline": "Why is Trump targeting India with tariffs? Raghuram Rajan explainsFormer RBI Governor Raghuram Rajan said that US President Donald Trump's decision to impose steep tariffs, including a 50% duty on Indian goods, is part of a wider strategy that goes beyond trade economics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-rate-cut-textile-fertiliser-us-tariff-rate-rationalisation-low-cost-tax-free-nil-slab-festive-season-2778026-2025-08-28",
      "headline": "GST 2.0 boost for textile, fertiliser sectors as Trump's 50% tariff kicks inThe textile and fertiliser industries are expected to be among the biggest beneficiaries of the upcoming GST 2.0 rationalisation amid US President Donald Trump's 50% tariff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dividend-mismatch-with-ais-here-is-how-taxpayers-should-report-it-2778019-2025-08-28",
      "headline": "Dividend mismatch with AIS? Here's how taxpayers should report itFiling ITR often becomes confusing when dividend income in your personal records doesn't match what appears in AIS. Here's how to handle it while filing ITR."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-tax-cuts-updates-milk-chocolates-textiles-fertilizers-2778009-2025-08-28",
      "headline": "Cheaper milk, chocolates, clothes and more: How GST 2.0 could slash your billsThe proposed changes, to be discussed at the Council's meeting on September 3–4 in New Delhi, focus on widening the nil rate, scrapping the 12% slab, and reducing rates on selected 18% goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-down-sensex-tanks-600-points-nifty-falls-us-tariff-50-percent-2777990-2025-08-28",
      "headline": "Sensex tanks 600 points: Why is stock market falling today?The S&P BSE Sensex was down by 605.97 points to 80,180.57, while the NSE Nifty50 lost 173.50 points to 24,538.55, as both the indices continued their downward movement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-nearly-500-points-nifty-below-24600-as-us-tariffs-hit-markets-2777962-2025-08-28",
      "headline": "Sensex nosedives 600 points, Nifty tumbles as US tariffs hit marketsThe Sensex shed 600 points to close at 81,074, while the Nifty ended below the 24,600 mark after slipping into bearish territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/high-end-electric-vehicles-likely-to-attract-18-gst-2777884-2025-08-28",
      "headline": "High-end electric vehicles likely to attract 18% GSTAccording to the proposals, GST on four-wheeled EVs priced between Rs 20 lakh and Rs 40 lakh will be raised from 5 per cent to 18 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chocolates-with-cocoa-pastries-ice-cream-likely-to-be-taxed-at-5-percent-gst-2777835-2025-08-27",
      "headline": "Chocolates with cocoa, pastries, ice cream likely to be taxed at 5% instead of 18%The proposed rationalisation stems from the Council's broader push to simplify the GST framework."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/condensed-milk-dates-jams-mushrooms-namkeens-to-get-cheaper-under-gst-2-0-2777830-2025-08-27",
      "headline": "Condensed milk, dates, jams, mushrooms, namkeens to get cheaper under GST 2.0The fitment committee has proposed that products such as butter, condensed milk, jams, mushrooms, dates, nuts, and namkeens move from the current 12 per cent GST slab to just 5 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-svanidhi-scheme-extended-till-2030-higher-loans-and-credit-cards-for-vendors-2777686-2025-08-27",
      "headline": "PM SVANidhi scheme extended till 2030, higher loans and credit cards for vendorsThe move is expected to benefit 1.15 crore street vendors, including 50 lakh new beneficiaries. The scheme will continue to be implemented jointly by the Ministry of Housing & Urban Affairs (MoHUA) and the Department of Financial Services (DFS)."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/monster-the-ed-gein-story-release-date-out-charlie-hunnam-new-face-of-evil-2778147-2025-08-28",
      "headline": "Monster: The Ed Gein Story release date out, Charlie Hunnam is the new face of evilHere's everything you need to know about the forthcoming third series of 'Monster', which will centre on the life and crimes of Ed Gein. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-clean-shaven-band-baaja-baraat-deepika-padukone-ganpati-darshan-watch-dua-2778139-2025-08-28",
      "headline": "Ranveer Singh goes clean-shaven, joins Deepika Padukone for Ganpati darshan. WatchDeepika Padukone and Ranveer Singh recently participated in Ganpati celebrations hosted by the Ambanis. A video of the couple offering prayers has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/archana-puran-singh-on-rough-marriage-patch-with-husband-parmeet-sethi-2778129-2025-08-28",
      "headline": "Archana Puran Singh on rough marriage patch with Parmeet Sethi: Ego got in the wayArchana Puran Singh shared that her marriage with Parmeet Sethi once went through a rough patch due to ego clashes, but meditation helped them rediscover their love. She shared that despite frequent fights, they cannot live without each other and remain strong partners after over three decades together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/special-ops-2-director-neeraj-pandey-prefers-subtle-patriotism-to-chest-thumping-2778066-2025-08-28",
      "headline": "Special Ops 2 director Neeraj Pandey prefers subtle patriotism to chest thumpingDirector Neeraj Pandey spoke about his subtle approach to patriotism in films and his experience making 'Special Ops'. In an exclusive with India Today, he also highlighted the importance of clarity in storytelling."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/r-madhavan-stuck-leh-amid-rains-recalls-similar-ordeal-3-idiots-shoot-2778102-2025-08-28",
      "headline": "R Madhavan stuck in Leh amid rains, recalls similar ordeal during 3 Idiots shootR Madhavan shared a view from his hotel room window, capturing snow-clad mountain peaks under cloudy skies, while also speaking about the weather."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kriti-sanon-do-patti-raanjhan-song-plagiarism-claims-kmkz-t-series-2778083-2025-08-28",
      "headline": "Kriti Sanon's Do Patti song Raanjhan faces plagiarism rowKriti Sanon's song 'Raanjhan' from the film Do Patti, which enjoyed immense popularity, is now embroiled in a plagiarism controversy involving an international music producer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lavanya-tripathi-flaunts-baby-bump-ganesh-chaturthi-varun-tej-2778065-2025-08-28",
      "headline": "Actor Lavanya Tripathi flaunts baby bump at Ganpati celebrations with Varun TejTelugu actors Varun Tej and Lavanya Tripathi, who are soon to be parents shared photos of themselves offering prayers to Lord Ganesha, and fans were quick to respond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-completes-the-raja-saab-by-october-starts-spirit-2778052-2025-08-28",
      "headline": "Prabhas to wrap The Raja Saab by October end before starting SpiritPrabhas aims to finish shooting 'The Raja Saab' by the end of October 2025. The actor will then focus on his next project 'Spirit', marking a busy schedule ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shamita-shetty-on-breakup-with-raqesh-bapat-2778025-2025-08-28",
      "headline": "Shamita Shetty on breakup with Raqesh Bapat: An erased chapter in my lifeShamita Shetty opened up about her breakup with Raqesh Bapat, calling it an \"erased chapter\" from her life and stressing that their bond was limited to the 'Bigg Boss' house. She added that as an independent woman, she values peace over companionship and won't compromise until she finds someone who truly respects her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/enrique-iglesias-and-tennis-star-anna-kournikova-to-welcome-fourth-child-2777960-2025-08-28",
      "headline": "Singer Enrique Iglesias and tennis star Anna Kournikova to welcome fourth childSinger Enrique Iglesias and Anna Kournikova are expecting their fourth child, with the former tennis star already halfway through her pregnancy and doing well. The couple, who share three children, will soon expand their family while continuing life together in Miami."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-netflix-this-weekend-2777864-2025-08-28",
      "headline": "Top films and shows to watch on Netflix this weekendThis weekend, Netflix has unveiled a diverse collection of new content spanning romance, drama, comedies and documentaries. Here's a glimpse at the latest shows and films for you to add to your binge-watch list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-4-gaurav-khanna-zeeshan-qadri-clash-over-food-captaincy-race-begins-2778010-2025-08-28",
      "headline": "Bigg Boss 19 episode 4: Gaurav-Zeeshan clash over food, captaincy race begins'Bigg Boss 19' saw high drama in episode 4 as Gaurav Khanna and Zeeshan Qadri clashed over food, with housemates accusing Gaurav of eating extra dal. The episode also featured the season's first captaincy task. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-bihar-contestant-fails-to-answer-rs-50-lakh-question-on-red-fort-can-you-2778015-2025-08-28",
      "headline": "KBC 17: Bihar contestant fails to answer Rs 50 lakh question on Red Fort. Can you?In the latest episode of 'Kaun Banega Crorepati 17', a contestant from Bihar failed to answer a Rs 50 lakh question on Delhi's Red Fort. He walked off with Rs 25 lakh from the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ssunita-ahuja-denies-comparing-yash-and-ahaan-panday-2778000-2025-08-28",
      "headline": "Ssunita Ahuja denies comparing Yash and Ahaan Panday, says don't spread rumoursSsunita Ahuja clarified that she never compared her son Yash's debut with Ahaan Panday's 'Saiyaara', praising the young actor and urging fans not to spread rumours. She also wished success to all newcomers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-sidharth-malhotra-visit-shirdi-param-sundari-release-watch-2777999-2025-08-28",
      "headline": "Janhvi Kapoor, Sidharth Malhotra visit Shirdi ahead of Param Sundari release. WatchAhead of 'Param Sundari' release, Janhvi Kapoor and Sidharth Malhotra offered prayers at Shirdi. Video of the two stars seeking blessings has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sushmita-sen-celebrates-daughter-alisah-sweet-16-birthday-with-emotional-note-2777941-2025-08-28",
      "headline": "Proud Maa Sushmita Sen rings in daughter Alisah's sweet 16 with emotional noteSushmita Sen celebrated her younger daughter Alisah's 16th birthday with a heartfelt Instagram post, sharing pictures and a loving note. She called herself a proud mother in the post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-performs-aarti-ganesh-chaturthi-celebration-family-parents-salim-khan-salma-khan-arpita-khan-sharma-2777939-2025-08-28",
      "headline": "Video: 3 generations of Khan-daan come together for Ganesh aartiSalman Khan and his family celebrated Ganesh Chaturthi 2025 with devotion at Arpita Khan Sharma's Mumbai residence. Joined by parents Salim and Salma Khan, the actor performed the aarti, and the video has gone viral. \r\n "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mrbeast-slammed-for-mocking-rolling-stone-list-after-caleb-hearon-outranks-him-glbs-2777898-2025-08-28",
      "headline": "MrBeast slammed for mocking Rolling Stone list after Caleb Hearon outranks himMrBeast faced backlash after mocking Rolling Stone's creator rankings, where Caleb Hearon ranked higher. Critics said he reduced influence to follower counts, while fans defended his unmatched reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ekta-kapoor-cautions-actors-against-fake-audition-calls-balaji-telefilms-casting-director-scam-2777808-2025-08-27",
      "headline": "Ekta Kapoor cautions actors against fake audition calls for Balaji TelefilmsProducer Ekta Kapoor issued an official statement through the social media handle of Balaji Telefilms warning actors against fraudulent casting directors impersonating their staff. The alert aims to protect aspiring actors from scams and misuse of the company's name."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-meet-chinese-president-xi-jinping-on-august-31-on-sidelines-of-sco-summit-in-china-2778082-2025-08-28",
      "headline": "PM Modi set for key huddles with Xi, Putin in China amid Trump tariff rowPrime Minister Narendra Modi will meet Chinese President Xi Jinping and Russian President Vladimir Putin in Tianjin during the SCO summit, his first visit to China in over seven years. The talks come as India faces US President Donald Trump's tariff hikes on key exports amid mounting American pressure to curb purchases of Russian oil."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/pm-narendra-modi-mother-abused-rahul-gandhi-bihar-rally-bjp-apology-2778056-2025-08-28",
      "headline": "PM Modi, mother abused during Rahul Gandhi's Bihar rally, BJP seeks apologyThe video shows Congress workers using derogatory language against PM Modi from the stage that was set up for the 'Voter Adhikar Yatra'. However, Rahul Gandhi was not present during the incident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/raghuram-rajan-explains-trump-using-tariff-as-weapon-india-powerplay-russia-oil-buying-2778050-2025-08-28",
      "headline": "Why is Trump targeting India with tariffs? Raghuram Rajan explainsFormer RBI Governor Raghuram Rajan said that US President Donald Trump's decision to impose steep tariffs, including a 50% duty on Indian goods, is part of a wider strategy that goes beyond trade economics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/greater-noida-dowry-death-case-nikki-bhati-dying-declaration-cylinder-blast-2778003-2025-08-28",
      "headline": "'Nikki said cylinder blast caused burns': Noida dowry death probe takes new turnThe new revelation marks a shift from earlier allegations that Nikki, 26, was set on fire by her husband Vipin Bhati and his family over dowry demands."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/himachal-floods-chandigarh-manali-highway-blocked-beas-river-landslides-cloudbursts-2778119-2025-08-28",
      "headline": "Ground report: Key highway to Manali blocked, flood waters pass through toll boothIncessant rain has submerged the Kullu toll plaza, washed away over 200 meters of the Chandigarh-Manali Highway, and left hundreds stranded as landslides, flash floods, and cloudbursts batter Himachal Pradesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-on-track-to-become-2nd-largest-economy-by-2038-report-2778125-2025-08-28",
      "headline": "India on track to become 2nd largest economy by 2038: ReportWith a combination of a young population, rising domestic consumption, fiscal discipline, and structural reforms, India appears well-positioned to climb the global economic ladder in the coming decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gaming-company-challenges-law-banning-online-money-games-in-karnataka-high-court-hearing-on-aug-30-2778144-2025-08-28",
      "headline": "Online gaming bill faces legal challenge, hearing in Karnataka High Court on Aug 30The Karnataka High Court on August 30 will hear a petition by online gaming company A23 challenging the new law banning all forms of online money gaming across India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/mexican-senate-erupts-into-violence-punching-pushing-and-shouting-video-surfaces-2778134-2025-08-28",
      "headline": "Punching, pushing and shouting: Mexican Senate erupts into violence. Video The confrontation broke out when Alejandro 'Alito' Moreno, head of the opposition Institutional Revolutionary Party (PRI), confronted Senate president Gerardo Fernandez Norona of the ruling Morena party as the day's session was ending."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/minnesota-catholic-school-shooting-suspect-wrote-nuke-india-mashallah-on-guns-robin-westman-2777913-2025-08-28",
      "headline": "Minneapolis shooter scrawled 'Nuke India', 'Mashallah' on guns used in attackThe Minneapolis school shooting left two children dead and 17 injured, with authorities confirming the gunman's weapons carried antisemitic, anti-India and anti-Israel slogans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-administration-h1b-student-visa-green-card-new-front-against-india-howard-lutnick-governor-ron-desantis-2778078-2025-08-28",
      "headline": "Is Trump now targeting India's soft exports with H-1B, student visa crackdown?The H-1B visa, which has got the US some of its top engineers and CEOs, is now being branded a \"scam\" by the Trump administration. After the 50% tariffs on Indian products, is President Donald Trump now targeting India's soft exports with a crackdown on H-1B, student visas and Green Cards?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/grooming-gangs-uk-ruper-lowe-private-investigation-pakistani-rape-gangs-children-abuse-negligence-2778027-2025-08-28",
      "headline": "Pakistani rape gangs exploited children in 85 areas in UK, MP's probe findsA British MP-led probe has uncovered child sexual exploitation by grooming gangs made up mostly of Pakistani men in 85 UK areas. The investigation alleges decades of targeted abuse and calls out official failures to protect victims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-aide-warns-india-on-china-russia-amid-tariff-tensions-getting-in-bed-with-authoritarians-2778020-2025-08-28",
      "headline": "Indians are so arrogant: US tariff hawk Peter Navarro as New Delhi stands firmThe outburst came on Wednesday, just hours after the United States imposed sweeping 50 per cent tariffs on Indian goods. Peter Navarro said India's continued purchase of discounted Russian crude was directly fuelling Moscow's war in Ukraine, which he repeatedly labelled \"Modi's war\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/dubai-princess-sheikha-mahra-engaged-to-rapper-french-montana-instagram-divorce-post-2778101-2025-08-28",
      "headline": "Dubai princess, who divorced husband on Instagram, engaged to rapper French MontanaDubai princess Sheikha Mahra Mohammed Rashed Al Maktoum is engaged to Moroccan-American rapper French Montana. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-air-force-f35-crash-frozen-hydraulics-water-contamination-alaska-2778120-2025-08-28",
      "headline": "F-35 pilot's 50-minute call with engineers mid-air. Then jet fell out of the skyThe F-35 pilot spent nearly an hour on a conference call with engineers from Lockheed Martin to troubleshoot the issue with the jet. But they were unable to rectify the issue, and the aircraft went into freefall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-singling-out-india-china-buying-larger-amounts-of-russian-oil-democrats-on-us-house-panel-slam-tariffs-2777927-2025-08-28",
      "headline": "Seems like it's not about Ukraine: Democrats blast Trump for singling out IndiaThe criticism came a day after Donald Trump's revised tariff policy on India came into effect. The president had initially announced 25 per cent \"reciprocal tariffs\" on Indian goods but later doubled the figure to 50 per cent, calling it a penalty for New Delhi's continued oil imports from Russia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bihar-police-high-alert-pakistan-jaish-terrorists-enter-india-nepal-border-2778002-2025-08-28",
      "headline": "Intel warns of 3 Jaish terrorists entering Bihar via Nepal, state on high alertThe Bihar Police Headquarters said three suspected members of the Pakistan-based terror outfit Jaish-e-Mohammed infiltrated Bihar through the Nepal border."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-performs-aarti-ganesh-chaturthi-celebration-family-parents-salim-khan-salma-khan-arpita-khan-sharma-2777939-2025-08-28",
      "headline": "Video: 3 generations of Khan-daan come together for Ganesh aartiSalman Khan and his family celebrated Ganesh Chaturthi 2025 with devotion at Arpita Khan Sharma's Mumbai residence. Joined by parents Salim and Salma Khan, the actor performed the aarti, and the video has gone viral. \r\n "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/gaganyaan-mission/story/code-that-defined-shubhanshu-shukla-p-balakrishnan-nair-ax-4-space-training-2778057-2025-08-28",
      "headline": "Indian astronaut shares the athlete-scientist-diplomat codeGp. Capt. P Balakrishnan Nair said that the Ax-4 training program was both \"rigorous and fun,\" offering a steep yet rewarding curve for those stepping into the demanding world of spaceflight preparation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/climate-change-reshaping-indian-rivers-biodiversity-loss-cloudbursts-flash-floods-2777118-2025-08-28",
      "headline": "How climate change is quietly reshaping Indian riversFlooding and rising river water temperatures have been exacerbated due to climate change, threatening lives, livelihoods, and biodiversity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-diamond-league-final-zurich-indian-title-world-championship-showdown-2778067-2025-08-28",
      "headline": "Ever-improving Neeraj eyes Diamond Trophy before World Championship showdownIndia's javelin ace Neeraj Chopra returns to the Diamond League Final in Zurich, chasing a second Diamond Trophy. With Julian Weber and Anderson Peters in the fray, the meet serves as the perfect prelude to next month's World Championships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/government-jobs-preferred-indian-marriage-market-startups-stability-respect-2778047-2025-08-28",
      "headline": "Why parents still prefer a 'sarkari damad' over a startup CEOIndian parents continue to prefer government jobs for marriage proposals despite startup success. The pandemic reinforced the value of job security and social respect in matrimonial choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-india-sprung-back-after-us-sanctions-atal-bihari-vajpayee-trump-modi-nuclear-test-tariffs-2777642-2025-08-28",
      "headline": "How India sprung back after US sanctions 27 years agoFrom economic sanctions to reciprocal tariffs, the US has many a time tried to pressurise India through aid cuts, blocking international loans, and bans on technology transfers. Yet, deft Indian diplomacy and indigenous growth not only ensured the rollback of these punitive actions but also resulted in stronger bilateral ties. Here's how India, over 25 years ago, shrugged off American sanctions and emerged stronger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lucknow-100-year-old-held-in-digital-arrest-for-6-days-son-pays-rs-129-crore-to-cybercriminals-2778042-2025-08-28",
      "headline": "100-year-old held in 'digital arrest' for 6 days in Lucknow, son pays Rs 1.29 crFraudsters posing as CBI officers trapped a 100-year-old man in a six-day \"digital arrest\" in Lucknow, forcing his son, a retired Merchant Navy officer, to transfer Rs 1.29 crore into multiple accounts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-us-president-nobel-peace-prize-cabinet-powerful-world-pressing-norway-october-announced-steve-witkoff-2777628-2025-08-28",
      "headline": "Blatant, brazen: How Trump Cabinet is on the warpath for Peace NobelWhat earlier seemed to be Donald Trump's lone pursuit has now become a task for his Cabinet. All the President's men and women are singing his praise, which is unabashedly being broadcast, with the goal of cornering the Nobel Peace Prize for Trump. The brazen and unabashed lobbying comes at a time the Norwegian Nobel Committee must be working hard to pick a winner for an announcement in October."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-bcci-india-broadcasting-backlash-reactions-2778163-2025-08-28",
      "headline": "Outrageous: BCCI draws backlash for not broadcasting Duleep Trophy quarterfinalThe BCCI has faced widespread criticism for not broadcasting the 2025 Duleep Trophy quarterfinals. Fans have expressed frustration over the lack of live coverage, with uncertainty still surrounding the semi-finals and final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/royal-challengers-bangalore-breaks-silence-on-bengaluru-stampede-chinnaswamy-stadium-2778106-2025-08-28",
      "headline": "RCB breaks silence on Bengaluru stampede: We were grievingRoyal Challengers Bangalore (RCB) has ended its silence following the deadly stampede in Bengaluru on the 4th of June. The incident occurred during the team's victory celebrations at Chinnaswamy Stadium. In its first communication on the matter, which came after a period of silence that led to speculation, the franchise issued an emotional appeal to fans. Stating why the organisation had not commented earlier, an official statement said, \"we were grieving.\" RCB also announced a new initiative called 'RCB Cares'. This new program is intended to support people, especially during times of emergency. The team has asked people to wait for more details on the new plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-dismisses-retirement-rumours-asia-cup-2025-2778138-2025-08-28",
      "headline": "Why do you want me to retire? Shami says fire burning despite selection snubsMohammed Shami has dismissed retirement rumours, reaffirming his commitment to competitive cricket. The 34-year-old fast bowler returned to action for the first time since the IPL 2025, representing East Zone in the Duleep Trophy quarter-final, which began on 28 August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wanindu-hasaranga-zimbabwe-vs-sri-lanka-t20is-asia-cup-2778127-2025-08-28",
      "headline": "Wanindu Hasaranga out of Zimbabwe T20Is, Sri Lanka face injury scare before Asia CupSri Lanka's Asia Cup preparations have been hit with Wanindu Hasaranga sidelined due to a hamstring injury, ruling him out of the Zimbabwe T20I series. With key fixtures in Harare from August 29 to September 7, the team will rely on youngsters to fill the all-rounder's void.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-quarter-finals-captains-dhruv-jurel-abhimanyu-easwaran-miss-matches-2778108-2025-08-28",
      "headline": "Dhruv Jurel, Abhimanyu Easwaran miss Duleep ties with fever and groin injuryCentral Zone captain Dhruv Jurel and East Zone skipper Abhimanyu Easwaran missed the Duleep Trophy quarterfinals, which began on Thursday, due to a fever and a groin niggle, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-diamond-league-final-zurich-indian-title-world-championship-showdown-2778067-2025-08-28",
      "headline": "Ever-improving Neeraj eyes Diamond Trophy before World Championship showdownIndia's javelin ace Neeraj Chopra returns to the Diamond League Final in Zurich, chasing a second Diamond Trophy. With Julian Weber and Anderson Peters in the fray, the meet serves as the perfect prelude to next month's World Championships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/englands-batting-line-up-will-be-unbelievable-in-ashes-josh-hazlewood-2778062-2025-08-28",
      "headline": "England's batting line-up will be unbelievable in Ashes: Josh HazlewoodAustralian fast bowler Josh Hazlewood has described the upcoming Ashes series as one of the biggest tests of his career, as he prepares to take on what he calls a strong England batting line-up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-day-5-schedule-iga-swiatek-jannik-sinner-coco-gauff-2778060-2025-08-28",
      "headline": "US Open 2025, Day 5, Order of Play: Swiatek, Sinner, Gauff aim for Round 3 berthsUS Open 2025: Day 5 promises high-intensity action with top seeds Iga Swiatek, Jannik Sinner, Coco Gauff, and Alexander Zverev headlining the singles schedule. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-inter-miami-leagues-cup-final-win-orlando-city-2778040-2025-08-28",
      "headline": "Lionel Messi powers Inter Miami past Orlando City to Leagues Cup finalLionel Messi delivered another masterclass as Inter Miami stormed into the Leagues Cup final with a 3-1 victory over 10-man Orlando City in Fort Lauderdale on Wednesday night. The Argentine superstar struck twice and provided an assist in a decisive 15-minute spell that turned the semi-final on its head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-emma-raducanu-carlos-alcaraz-haircut-verdict-2778023-2025-08-28",
      "headline": "Watch: Emma Raducanu gives her verdict on Carlos Alcaraz's special buzzcutEmma Raducanu defended Carlos Alcaraz's new buzzcut at the US Open, saying his confidence makes the style work despite mixed reactions. The Brit also stormed into the third round with a dominant win over Janice Tjen, setting up a clash with Elena Rybakina.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-emotional-letter-fans-rcb-cares-breaks-social-media-silence-2778013-2025-08-28",
      "headline": "RCB's first post in 3 months after Bengaluru stampede: The silence was griefRoyal Challengers Bengaluru (RCB) on Thursday ended their three-month silence on social media following the horrific stampede that marred their maiden Indian Premier League (IPL) title celebrations in June."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/englands-batting-line-up-will-be-unbelievable-in-ashes-josh-hazlewood-2778062-2025-08-28",
      "headline": "England's batting line-up will be unbelievable in Ashes: Josh HazlewoodAustralian fast bowler Josh Hazlewood has described the upcoming Ashes series as one of the biggest tests of his career, as he prepares to take on what he calls a strong England batting line-up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-day-5-schedule-iga-swiatek-jannik-sinner-coco-gauff-2778060-2025-08-28",
      "headline": "US Open 2025, Day 5, Order of Play: Swiatek, Sinner, Gauff aim for Round 3 berthsUS Open 2025: Day 5 promises high-intensity action with top seeds Iga Swiatek, Jannik Sinner, Coco Gauff, and Alexander Zverev headlining the singles schedule. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-inter-miami-leagues-cup-final-win-orlando-city-2778040-2025-08-28",
      "headline": "Lionel Messi powers Inter Miami past Orlando City to Leagues Cup finalLionel Messi delivered another masterclass as Inter Miami stormed into the Leagues Cup final with a 3-1 victory over 10-man Orlando City in Fort Lauderdale on Wednesday night. The Argentine superstar struck twice and provided an assist in a decisive 15-minute spell that turned the semi-final on its head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-emma-raducanu-carlos-alcaraz-haircut-verdict-2778023-2025-08-28",
      "headline": "Watch: Emma Raducanu gives her verdict on Carlos Alcaraz's special buzzcutEmma Raducanu defended Carlos Alcaraz's new buzzcut at the US Open, saying his confidence makes the style work despite mixed reactions. The Brit also stormed into the third round with a dominant win over Janice Tjen, setting up a clash with Elena Rybakina.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-emotional-letter-fans-rcb-cares-breaks-social-media-silence-2778013-2025-08-28",
      "headline": "RCB's first post in 3 months after Bengaluru stampede: The silence was griefRoyal Challengers Bengaluru (RCB) on Thursday ended their three-month silence on social media following the horrific stampede that marred their maiden Indian Premier League (IPL) title celebrations in June."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}