{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-to-buy-gold-the-right-way-this-festive-season-2792466-2025-09-24",
      "headline": "How to buy gold the right way this festive seasonGold shopping is a festive tradition for many Indian families, but with rising prices and endless options, making the right choice can feel tricky. Here's how you can buy gold the right way this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-fall-us-h1b-visa-fee-hike-trump-tariff-remittance-money-send-india-2792464-2025-09-24",
      "headline": "H-1B crackdown cracks the rupee. Know why INR hit an all-time lowEconomists estimate that remittances, the money Indians abroad send back, could drop by around $400 million. For a country that relies on foreign money flowing in, that's significant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-around-the-corner-union-cabinet-likely-to-approve-bonus-for-railways-employees-government-sources-2792463-2025-09-24",
      "headline": "Union Cabinet likely to clear bonus for railway staff soon: Government sourcesThe bonus, usually extended to non-gazetted railway employees, is meant to recognise their contribution to the efficiency and performance of one of India's most crucial transport networks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-audit-2025-deadlines-rules-and-penalties-you-must-know-2792436-2025-09-24",
      "headline": "Income tax audit 2025: Deadlines, rules and penalties you must knowThe clock is ticking for taxpayers who fall under the audit bracket. With the income tax audit deadline for FY 2024–25 just around the corner, here's a quick look at key dates, rules, and penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/confused-between-swiggy-and-eternal-stock-heres-what-experts-suggest-2792404-2025-09-24",
      "headline": "Confused between Swiggy and Eternal stock? Here's what experts suggestMarket experts say the two companies are in very different positions when it comes to earnings visibility and investor confidence. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/overcharged-after-gst-rate-cut-heres-how-you-can-take-action-2792393-2025-09-24",
      "headline": "Overcharged after GST rate cut? Here's how you can take actionExperts say that raising a complaint not only helps individual consumers reclaim their rightful benefit but also strengthens overall market accountability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sbi-shares-state-bank-of-india-stock-price-rise-hit-record-52-week-high-should-you-buy-2792379-2025-09-24",
      "headline": "SBI shares gain 1% to hit 52-week high. Should you buy?SBI shares have seen an uptick in the past few days. This has been a reaction to the country's largest lender completing the sale of a part of its stake in YES Bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-200-points-nifty-below-25100-sbi-gains-1-2792371-2025-09-24",
      "headline": "Sensex falls 300 points, Nifty below 25,100 as profit booking continuesAt 9:22 am, the S&P BSE Sensex declined 309 points to 81,792.86, and the NSE Nifty50 slipped 100 points to 25,069.45. Broader market indices also witnessed early losses, led by persistent selling pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/epack-prefab-bmw-ventures-jain-resource-recycling-ipo-highest-returns-gmp-listing-gains-2792361-2025-09-24",
      "headline": "Epack Prefab, BMW Ventures, Jain Resource IPOs open today: Where should you bet?Three IPOs will open for bidding today. Epack Prefab Technologies, BMW Ventures, and Jain Resource Recycling begin their public subscriptions today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-or-silver-better-investment-sips-etf-festive-season-buying-stock-market-yellow-metal-price-2792347-2025-09-24",
      "headline": "What is silver SIP and is it better than gold this festive season?With gold already at peak levels, many investors are asking whether silver, especially through systematic investment plans (SIPs) in exchange traded funds (ETFs), could be a smarter choice this festive season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-buying-bonanza-kicks-off-cars-lead-the-way-2792113-2025-09-23",
      "headline": "GST buying bonanza kicks off, cars lead the wayPM Narendra Modi described GST 2.0 as \"a reform dedicated to the people of India,\" and for many, the benefits were felt immediately. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-your-income-tax-refund-less-than-rs-10000-here-is-why-it-might-reach-you-faster-2792027-2025-09-23",
      "headline": "Is your income tax refund less than Rs 10,000? Here's why it might reach you fasterMany taxpayers are frustrated with refund delays. But here's the catch, simpler refunds tend to move more quickly through the system than bigger claims.\r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rani-mukerji-elated-after-national-award-win-dedicates-it-to-late-father-motherhood-2792474-2025-09-24",
      "headline": "Rani Mukerji elated after National Award win, dedicates it to late father, motherhoodActor Rani Mukerji is overwhelmed to receive her first National Award. In her statement, she dedicated her award to her late father, all the mothers around the world, for their strength and courage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-hug-with-mohanlal-becomes-the-moment-of-the-night-fans-call-it-historic-2792462-2025-09-24",
      "headline": "SRK's hug with Mohanlal becomes the highlight of National Film AwardsAt the National Film Awards in Delhi, the warm embrace between Shah Rukh Khan and Mohanlal, with Rani Mukerji smiling beside them, captured the hearts of fans across India. This iconic moment has been widely shared on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-birthday-tribute-mother-tanuja-emotional-instagram-celebrity-wishes-2792449-2025-09-24",
      "headline": "Maa Durga, Maa Kali rolled into one: Kajol's note for mother Tanuja on birthdayActor Kajol celebrated her mother Tanuja's birthday with a special social media post, sharing photos and videos from the celebrations. Her tribute drew warm wishes from several celebrities, like Karan Johar, Renuka Shahane and Farah Khan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-on-national-award-win-emotional-full-circle-moment-27-years-rocky-aur-rani-kii-prem-kahani-2792443-2025-09-24",
      "headline": "KJo accepts National Award in Rocky Randhawa style, calls it emotional full circleKaran Johar shared a post on Instagram and expressed his gratitude to his team after winning the National Award in the Wholesome Entertainment category. The director even recalled the moment as an emotional full circle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anya-singh-rubbishes-claims-of-aryan-khan-not-directing-the-bas-of-bollywood-2792432-2025-09-24",
      "headline": "Anya Singh rubbishes claims of Aryan Khan not directing The Ba***s of BollywoodAcor Anya Singh addressed criticism and rumours around Aryan Khan's directorial debut 'The Ba***s of Bollywood'. She commended Aryan's decision to work with young talent and his steadfast vision. The actor also opened up on the shocking climax of the Netflix series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-box-office-collection-day-5-detailed-report-bigger-tuesday-than-monday-rs-100-crore-doable-2792409-2025-09-24",
      "headline": "Jolly LLB 3 box office Day 5: Bigger Tuesday than Monday, Rs 100 crore doable Akshay Kumar and Arshad Warsi's 'Jolly LLB 3' showed growth of Rs 6.5 crore on Tuesday, taking its total to Rs 65.5 crore. The Subhash Kapoor film is set to cross Rs 100 crore in India soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/assam-government-distributes-zubeen-garg-ashes-online-memorials-kamarkuchi-jorhat-2792358-2025-09-24",
      "headline": "Zubeen Garg's ashes to be distributed via online portal, memorials in AssamThe Assam government plans to provide Zubeen Garg's funeral ashes through a new online portal. Memorials to be established at Kamarkuchi and Jorhat, with site security enhancements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-alpha-first-action-film-online-debate-jigra-heart-of-stone-milan-fashion-2792373-2025-09-24",
      "headline": "Alia calls Alpha her first action film, fans remind her of Jigra, Heart of StoneActor Alia Bhatt recently reoffered to 'Alpha' as her first action film, sparking reactions online. Many Social media users debate her statement, referencing previous films 'Jigra' and 'Heart of Stone'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kj-yesudas-honoured-with-ms-subbulakshmi-award-sai-pallavi-anirudh-ravichander-sj-suryah-and-others-kalaimamani-tamil-nadu-government-2792384-2025-09-24",
      "headline": "KJ Yesudas honoured with MS Subbulakshmi award, Sai Pallavi, Anirudh get KalaimamaniThe Tamil Nadu government announced the Kalaimamani and MS Subbulakshmi awards for the years 2021, 2022 and 2023. Sai Pallavi, SJ Suryah, Anirudh Ravichander and several others have been bestowed with Kalaimamani, highest civilian honour by the state government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-fixes-rani-mukerji-hair-saree-at-national-awards-fans-call-it-rahul-tina-moment-2792362-2025-09-24",
      "headline": "SRK fixes Rani's hair, saree at National Awards, fans call it Rahul-Tina momentShah Rukh Khan and Rani Mukerji received National Awards in New Delhi for their films 'Jawan' and 'Mrs Chatterjee vs Norway'. Amid all the viral videos from the ceremony, a clip of SRK helping Rani with her hair and saree has caught the attention of all. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-alpha-film-release-milan-fashion-week-female-led-yrf-spy-thriller-2792336-2025-09-24",
      "headline": "Alia Bhatt, in a fur coat, makes striking appearance at Milan Fashion Week. PicsActor Alia Bhatt made a striking appearance at Milan Fashion Week 2025. She dazzled in a fur coat and stockings. Bhatt also spoke about her upcoming film, 'Alpha'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-viral-struggle-wear-national-award-medal-71st-national-film-awards-2792316-2025-09-24",
      "headline": "SRK's struggle to wear National Award medal goes viral. Rani-Vikrant come to rescueShah Rukh Khan struggled to wear his medal at the 71st National Film Awards 2025. The cute moment was captured on video and quickly went viral among fans online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/how-pawan-singhs-participation-in-rise-fall-was-a-missed-opportunity-2791858-2025-09-24",
      "headline": "How Pawan Singh's participation in Rise & Fall was a missed opportunityBhojpuri actor Pawan Singh's exit from 'Rise & Fall' was announced by the show's host Ashneer Grover on Sunday. Despite being called 'TRP king' by his fans, his stint on the reality show was far from impressive. Here's why. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-national-film-award-best-actor-jawan-suhana-khan-message-2792190-2025-09-23",
      "headline": "This silver is gold: Suhana, Aryan's sweet note for papa SRK's National Award winSuhana Khan and Aryan Khan posted a sweet message for their father Shah Rukh Khan after he received the National Film Award for Best Actor for 'Jawan'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-security-officer-duped-rs-42-lakh-domestic-help-family-chennai-scam-2792171-2025-09-23",
      "headline": "Actor Suriya's security officer duped of Rs 42 lakh by his domestic help's familyActor Suriya's PSO was cheated of Rs 42 lakh by his domestic help's family. The scam has wider implications as police uncover a Rs 2 crore fraud racket in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vidhu-vinod-chopra-on-12th-fails-national-award-win-real-fear-is-within-2792175-2025-09-23",
      "headline": "Real fear is within: Vidhu Vinod Chopra on 12th Fail's National Award winDirector Vidhu Vinod Chopra's film '12th Fail', depicting Manoj Kumar Sharma's inspiring rise from poverty to the IPS, won a National Award in New Delhi. The filmmaker, in an exclusive interview with AajTak, emphasised that his cinema is about truth and inner conviction, hoping audiences engage deeply with his work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/poonam-pandey-removed-from-mandodari-role-in-delhi-ramlila-amid-objections-2792087-2025-09-23",
      "headline": "Poonam Pandey removed from Mandodari role in Delhi Ramlila amid objectionsThe Luv Kush Ramlila Committee has removed actor Poonam Pandey from playing Mandodari at Delhi's Red Fort after facing objections from political and religious groups. The committee said the decision was made to ensure the event's core purpose of spreading Lord Ram's message is upheld."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rani-mukerji-wears-necklace-with-daughter-adira-initials-at-national-awards-2792160-2025-09-23",
      "headline": "Rani Mukerji wears necklace with daughter Adira's initials at National Awards. PicRani Mukerji won the Best Actress award at the 71st National Film Awards for 'Mrs Chatterjee vs Norway' and added a personal touch to her look with a gold chain featuring her daughter Adira's initials. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-oscar-selection-sparks-rule-debate-ffi-chairman-responds-2792151-2025-09-23",
      "headline": "Exclusive: Homebound Oscar selection sparks rule debate, FFI chairman responds'Homebound' has been selected as India's official entry for the Oscars 2026. The decision sparked debate over the film's theatrical release and screening timeline compliance."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/story/delhi-ashram-chief-accused-molestation-women-on-the-run-2792394-2025-09-24",
      "headline": "Scandal rocks Delhi ashram, Swami accused of molesting women with help of staffOut of 32 women, 17 alleged abusive language, obscene WhatsApp and text messages, as well as unwanted physical contact by the accused. The ashram has removed him from his post as director due to his \"illegal acts\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-diplomat-kshitij-tyagi-blasts-pakistan-at-un-accuses-it-of-exporting-terror-glbs-2792307-2025-09-24",
      "headline": "Bombing own people: India mocks Pak at UN over Khyber Pakhtunkhwa strikesIndian diplomat Kshitij Tyagi slammed Pakistan at UNHRC, accusing it of exporting terror, illegally occupying J&K, and \"bombing their own people\", after deadly airstrikes killed civilians in Khyber Pakhtunkhwa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-textbook-india-war-operation-sindoor-victory-false-narrative-airbases-destroyed-asim-munir-2792453-2025-09-24",
      "headline": "Delulu 101: Pakistan's new curriculum on four-day war with IndiaAs in past wars with India, Pakistan's establishment is still playing make-believe by trumpeting fake wins, but staying silent on real losses. By baking false narratives into school curriculum, it is ensuring that generations grow up swallowing propaganda as history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zelensky-ukraine-russia-war-india-donald-trump-address-to-united-nation-general-assembly-china-funding-2792454-2025-09-24",
      "headline": "India with us: Zelenskyy fact-checks Trump on Russia warUkrainian President Volodymyr Zelenskyy said \"India is mostly with Ukraine\", differing with his American counterpart, Donald Trump, who blamed New Delhi for \"funding Russia\". Zelenskyy also called for Europe's stronger ties with India to wean it off Russian energy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-donald-trump-us-china-xi-jinping-cpec-balochistan-will-islamabad-trun-into-battlefield-experts-explained-2792093-2025-09-24",
      "headline": "Is Pakistan inviting disaster by two-timing China and US?China's \"iron-brother\" Pakistan's warm embrace of Donald Trump's US, from deals on cryptocurrency, minerals, to nominating him for the Nobel Peace Prize, has made the Chinese wary of Islamabad's calculated posture. China, which has poured billions into Pakistan through the CPEC projects, sees this as a double game. Pakistan might emerge as the next flashpoint in the US-China rivalry, warn experts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/not-my-intention-to-make-light-of-young-mans-murder-teary-eyed-jimmy-kimmel-returns-to-us-late-night-tv-2792392-2025-09-24",
      "headline": "Jimmy Kimmel returns with emotional monologue: Trump, Charlie Kirk and moreJimmy Kimmel returned to TV after a week-long suspension and in a lengthy monologue, replete with puns and sarcasm, spoke on the shooting of Trump aide Charlie Kirk and Trump himself."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/overcharged-after-gst-rate-cut-heres-how-you-can-take-action-2792393-2025-09-24",
      "headline": "Overcharged after GST rate cut? Here's how you can take actionExperts say that raising a complaint not only helps individual consumers reclaim their rightful benefit but also strengthens overall market accountability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/not-one-call-shashi-tharoor-slams-diaspora-over-silence-on-india-us-setbacks-glbs-2792305-2025-09-24",
      "headline": "Not one call: Shashi Tharoor slams diaspora over silence on India-US setbacksCongress MP Shashi Tharoor urged Indian-Americans to push US lawmakers on India policy, noting diaspora silence on H-1B fees, tariffs, and trade issues as a Democratic delegation reaffirmed bipartisan support for ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/gurugram-founder-reaction-to-colleague-refusing-9pm-work-call-for-household-chores-viral-work-culture-empathy-2792407-2025-09-24",
      "headline": "Gurugram founder's reaction to colleague refusing 9pm work call for chores is viralIn her post, Krittika Marwaha addressed how the relentless drive to build a company often pushes leaders to expect the same level of sacrifice from their teams.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ulips-mutual-funds-why-you-need-both-for-a-balanced-portfolio-2789465-2025-09-19",
      "headline": "ULIPs & Mutual Funds: Why you need both for a balanced portfolioULIPs give you protection and discipline for the long haul, while mutual funds give you liquidity and flexibility for the near term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/case-against-hairstylist-jawed-habib-for-cheating-over-150-people-in-crypto-scam-2792388-2025-09-24",
      "headline": "Case against hairstylist Jawed Habib for cheating over 150 people in crypto scamAccording to police, Javed Habib and his son lured investors with the promise of 50% to 75% profit through FLC (Follicile Global Company). People were persuaded to invest in Bitcoins and Binance Coins, with their money being transferred to the company's accounts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangkok-sinkhole-swallows-cars-power-poles-near-hospital-caught-on-cctv-2792467-2025-09-24",
      "headline": "Watch: Massive sinkhole opens near Bangkok hospital, swallows cars, power polesThe incident, which took place in the Thai capital's Samsen Road area, has been linked to the construction of a nearby railway station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/silent-retreats-in-india-wellness-tourism-jennifer-aniston-2792116-2025-09-24",
      "headline": "Want to experience a silent retreat like Jennifer Aniston? India has plenty to offerIn Jennifer Aniston's latest interview with India Today, the actress revealed a deep interest in attending a silent retreat and exploring meditation on her next trip to India. If you haven't heard of one, here's your quick loop-in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musk-is-hiring-wants-humans-to-build-his-new-ai-only-microsoft-rival-company-2792461-2025-09-24",
      "headline": "Elon Musk is hiring, wants humans to build his AI-only Microsoft rival companyElon Musk's xAI is stepping up its efforts for encouraging human talent to join Macrohard. Macrohard is supposed to be a Microsoft rival software company seemingly run fully by AI.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aisa-cup-india-vs-bangladesh-super-4-preview-qualification-2792346-2025-09-24",
      "headline": "Asia Cup Super 4: India, a win away from final berth, face upbeat BangladeshAsia Cup IND vs BAN, Super 4 preview: The numbers are heavily in favour of India, but Suryakumar Yadav and his men are likely to face their sternest test of the tournament on Wednesday. Bangladesh, on the back of a morale-boosting win against Sri Lanka, will be keen on testing themselves against the best team in the world. Can Litton Das and his men produce an upset? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/earth-has-a-giant-halo-around-it-nasa-wants-to-picture-the-invisible-crown-2792143-2025-09-24",
      "headline": "Earth has a giant halo around it. Nasa is launching a probe to picture itThe halo was first glimpsed in 1972 when Apollo 16 astronauts placed an ultraviolet camera developed by Dr. George Carruthers on the Moon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anya-singh-rubbishes-claims-of-aryan-khan-not-directing-the-bas-of-bollywood-2792432-2025-09-24",
      "headline": "Anya Singh rubbishes claims of Aryan Khan not directing The Ba***s of BollywoodAcor Anya Singh addressed criticism and rumours around Aryan Khan's directorial debut 'The Ba***s of Bollywood'. She commended Aryan's decision to work with young talent and his steadfast vision. The actor also opened up on the shocking climax of the Netflix series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-around-the-corner-union-cabinet-likely-to-approve-bonus-for-railways-employees-government-sources-2792463-2025-09-24",
      "headline": "Union Cabinet likely to clear bonus for railway staff soon: Government sourcesThe bonus, usually extended to non-gazetted railway employees, is meant to recognise their contribution to the efficiency and performance of one of India's most crucial transport networks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/india-us-trade-talks-off-to-encouraging-start-in-new-york-quad-summit-on-horizon-glbs-2792312-2025-09-24",
      "headline": "Quad summit on horizon after 'encouraging' India-US trade talks in New YorkIndia and US trade talks in New York show fresh momentum after tariff setbacks. Sources say discussions are constructive, with the possibility of a Quad summit before year's end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indonesia-president-prabowo-subianto-signs-off-un-general-assembly-speech-om-shanti-shalom-2792367-2025-09-24",
      "headline": "Watch: Indonesia President signs off UN General Assembly speech with Om ShantiThe Indonesian President concluded his 19-minute speech at the 80th UN General Assembly with the Sanskrit mantra \"Om Shanti, Shanti Om\", invoking a message of harmony amid global uncertainties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/white-house-demands-probe-after-trump-melania-stuck-on-un-escalator-ride-glbs-2792309-2025-09-24",
      "headline": "Melania, Trump step on escalator, it stops. Fuming White House demands probeA stalled UN escalator carrying President Trump and First Lady Melania sparked White House outrage, with Press Secretary Karoline Leavitt demanding an investigation amid suspicions staff intentionally triggered the mishap."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/kolkata/story/kolkata-reels-from-record-rain-in-40-years-more-in-store-as-durga-puja-nears-2792335-2025-09-24",
      "headline": "Kolkata reels from record rain in 40 years, more in store as Durga Puja nearsThe wet spell that submerged Kolkata on Monday and Tuesday is expected to persist till September 25, clouding the run-up to Durga Puja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/germany-invites-skilled-indian-workers-us-h1b-visa-fee-hike-2792328-2025-09-24",
      "headline": "Skilled Indians welcome in Germany, says envoy after US's H-1B visa shake-upIn a subtle jab at the Trump administration's abrupt overhaul of the H-1B visa system, Dr Philipp Ackermann, German Ambassador to India, highlighted Germany's stable and rewarding immigration policies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/allow-limited-vehicle-movement-through-bengaluru-wipro-campus-to-ease-congestion-siddaramaiah-to-azim-premji-2791925-2025-09-23",
      "headline": "Karnataka CM to Azim Premji: Lend me a road, I've a traffic problem to solveKarnataka Chief Minister Siddaramaiah wrote to Wipro founder Azim Premji to allow limited vehicular movement through the campus, aiming to ease traffic on Bengaluru's Outer Ring Road. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-struggles-batting-position-after-shubman-gill-return-t20is-2792192-2025-09-24",
      "headline": "Sanju Samson battles middle-order blues after Shubman Gill's T20I returnSanju Samson has found it tough to adjust to new batting roles after Shubman Gill's return to the top. The wicketkeeper batter is being made to strive hard to seal his place in the T20I side, despite having proven his worth as an opener in the lead-up to Asia Cup 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-squad-announcement-live-dubai-jasprit-bumrah-shubman-gill-2792471-2025-09-24",
      "headline": "IND vs WI Test squad announcement live updates: Bumrah in, Karun Nair dropped?IND vs WI Test squad announcement live updates: India's senior selection committee, led by Ajit Agarkar, will meet on 24 September to pick the squad for the upcoming two-Test series against West Indies, starting in Ahmedabad on 2 October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-focus-fitness-ishant-sharma-resilience-cricket-career-2792457-2025-09-24",
      "headline": "Virat Kohli was always focused, nothing affected his game, says Ishant SharmaIshant Sharma reveals how Virat Kohli had laser-like focus when on the field and nothing came in his way, including matters off the field when it came down to performing for the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/phil-salt-ipl-2025-final-child-birth-wife-decision-royal-challengers-bengaluru-kkr-2792459-2025-09-24",
      "headline": "Phil Salt on becoming a father and playing IPL final: Wife made the decisionPhil Salt returned to play the IPL 2025 Final immediately after becoming a father, thanks to his wife's push. He scored, took a brilliant catch, and helped RCB win their first-ever title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-test-series-squad-announcement-shubman-gill-bumrah-rishabh-pant-2792398-2025-09-24",
      "headline": "India vs West Indies: What to expect from Test squad for season's first home seriesIndia vs West Indies: India's squad for the two-Test series, starting on 2 October, will be announced on Wednesday. While Jasprit Bumrah is expected to make the cut, attention will be on Karun Nair as he bids to retain his place after a subdued comeback in England. It also remains to be seen whether Axar Patel will earn a recall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-joins-sydney-thunder-big-bash-league-debut-2792395-2025-09-24",
      "headline": "Ravichandran Ashwin set to play for Sydney Thunder in Big Bash League: ReportRavichandran Ashwin is reportedly set to join Sydney Thunder for his first Big Bash League stint. This move marks a significant moment as he becomes the first major Indian male cricketer to play in Australia's premier franchise tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/commonwealth-games-2030-india-proposal-delegation-ahmedabad-2792386-2025-09-24",
      "headline": "Indian delegation presents proposal to host 2030 Commonwealth Games in AhmedabadIndia has formally submitted Ahmedabad's bid to host the 2030 Commonwealth Games. The proposal emphasises affordability, sustainability, inclusivity, and a lasting legacy for athletes and communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-bangladesh-super-4-litton-das-upset-shakib-al-hasan-2792380-2025-09-24",
      "headline": "Asia Cup 2025: Why India should be wary of underdogs Bangladesh in Super 4 clashAsia Cup 2025: India enter the Super 4 clash as clear favourites, but Bangladesh's history of upsets - from the 2007 World Cup to consecutive bilateral wins in 2015 and nail-biting finishes in Asia Cup finals - proves they can make even the giants sweat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-bangladesh-should-perform-well-super-4-aakash-chopra-2792374-2025-09-24",
      "headline": "Bangladesh should perform well vs India, they deserve better: Chopra on Super 4 clashBangladesh's resurgence in the Asia Cup 2025 sets up a fascinating Super 4 showdown against unbeaten India. With Aakash Chopra and coach Phil Simmons backing them, Litton Das's men enter the clash with renewed confidence and passionate support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nashra-sandhu-6-gesture-haris-rauf-controversy-explained-2792370-2025-09-24",
      "headline": "Did another Pakistan bowler, Nashra Sandhu copy Haris Rauf's 6-0 gesture: ExplainedPakistan spinner Nashra Sandhu celebrated her six-wicket haul and 100th ODI wicket with a six-finger gesture. The pose has sparked debate about whether it was a celebratory act or a political statement amid India-Pakistan tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aisa-cup-india-vs-bangladesh-super-4-preview-qualification-2792346-2025-09-24",
      "headline": "Asia Cup Super 4: India, a win away from final berth, face upbeat BangladeshAsia Cup IND vs BAN, Super 4 preview: The numbers are heavily in favour of India, but Suryakumar Yadav and his men are likely to face their sternest test of the tournament on Wednesday. Bangladesh, on the back of a morale-boosting win against Sri Lanka, will be keen on testing themselves against the best team in the world. Can Litton Das and his men produce an upset? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/commonwealth-games-2030-india-proposal-delegation-ahmedabad-2792386-2025-09-24",
      "headline": "Indian delegation presents proposal to host 2030 Commonwealth Games in AhmedabadIndia has formally submitted Ahmedabad's bid to host the 2030 Commonwealth Games. The proposal emphasises affordability, sustainability, inclusivity, and a lasting legacy for athletes and communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-bangladesh-super-4-litton-das-upset-shakib-al-hasan-2792380-2025-09-24",
      "headline": "Asia Cup 2025: Why India should be wary of underdogs Bangladesh in Super 4 clashAsia Cup 2025: India enter the Super 4 clash as clear favourites, but Bangladesh's history of upsets - from the 2007 World Cup to consecutive bilateral wins in 2015 and nail-biting finishes in Asia Cup finals - proves they can make even the giants sweat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-bangladesh-should-perform-well-super-4-aakash-chopra-2792374-2025-09-24",
      "headline": "Bangladesh should perform well vs India, they deserve better: Chopra on Super 4 clashBangladesh's resurgence in the Asia Cup 2025 sets up a fascinating Super 4 showdown against unbeaten India. With Aakash Chopra and coach Phil Simmons backing them, Litton Das's men enter the clash with renewed confidence and passionate support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nashra-sandhu-6-gesture-haris-rauf-controversy-explained-2792370-2025-09-24",
      "headline": "Did another Pakistan bowler, Nashra Sandhu copy Haris Rauf's 6-0 gesture: ExplainedPakistan spinner Nashra Sandhu celebrated her six-wicket haul and 100th ODI wicket with a six-finger gesture. The pose has sparked debate about whether it was a celebratory act or a political statement amid India-Pakistan tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aisa-cup-india-vs-bangladesh-super-4-preview-qualification-2792346-2025-09-24",
      "headline": "Asia Cup Super 4: India, a win away from final berth, face upbeat BangladeshAsia Cup IND vs BAN, Super 4 preview: The numbers are heavily in favour of India, but Suryakumar Yadav and his men are likely to face their sternest test of the tournament on Wednesday. Bangladesh, on the back of a morale-boosting win against Sri Lanka, will be keen on testing themselves against the best team in the world. Can Litton Das and his men produce an upset? "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}