{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/isha-ambani-is-harpers-bazaar-icon-of-the-year-dedicates-award-to-mother-daughter-2619809-2024-10-19",
      "headline": "Isha Ambani is Harper's Bazaar Icon of the Year, dedicates award to mother, daughterIsha Ambani dedicated the award to her mother, Nita Ambani, the Chairperson of Reliance Foundation. Isha said her mother is her role model who has \"paved the way for me\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-packaged-water-and-bicycles-senior-citizens-health-insurance-2619791-2024-10-19",
      "headline": "Centre recommends reducing GST on packaged water and bicycles below Rs 10,000The Group of Ministers (GoM) to decide on GST on health and life insurance premiums in its meeting on Saturday decided to exempt GST on premiums paid by individuals, other than senior citizens, for health insurance with coverage of up to Rs 5 lakh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/vasundhra-oswal-detailed-uganda-india-businessman-oswal-group-2619747-2024-10-19",
      "headline": "Who is Vasundhara Oswal, daughter of Indian billionaire, detained in Uganda?Vasundhara Oswal was reportedly seized by a group of 20 armed men at the family's extra neutral alcohol (ENA) plant. Local officials have connected her arrest to an ongoing investigation into the case of a missing person."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-q2-financial-results-net-profit-rises-5-percent-to-rs-16820-crore-2619683-2024-10-19",
      "headline": "HDFC Bank Q2 results: Net profit rises 5% to Rs 16,820 croreHDFC Bank's net interest income (NII), a key measure of profitability, came in at Rs 30,114 crore, reflecting a 10% year-on-year increase, although slightly below the market expectation of Rs 30,306 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karnataka-impose-cess-zomato-swiggy-uber-oia-payments-support-gig-workers-bill-passed-december-2619633-2024-10-19",
      "headline": "Karnataka to impose cess on Zomato, Uber, payments to support gig workersKarnataka Labour Minister Santosh Lad said that the charge would be levied only on transport and not on the purchase of products. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/disney-reliance-joint-venture-to-stream-live-sports-ipl-pkl-exclusively-on-hotstar-report-2619309-2024-10-18",
      "headline": "Disney-Reliance venture to stream live sports exclusively on Hotstar: ReportWhile Reliance's JioCinema currently streams IPL cricket, Hotstar holds rights to other prestigious events like the International Cricket Council (ICC) tournaments, the English Premier League, and the Pro Kabaddi League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ashneer-grover-withdraws-mismanagement-plea-against-bharatpe-from-nclt-2619292-2024-10-18",
      "headline": "Ashneer Grover withdraws mismanagement plea against BharatPe from NCLTThe plea alleged mismanagement and oppressive conduct by the fintech company's board. The withdrawal of the plea follows a settlement reached between Grover and BharatPe on September 30, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-to-impose-laptop-import-restrictions-to-boost-local-manufacturing-report-2619238-2024-10-18",
      "headline": "India to impose laptop import restrictions to boost local manufacturing: ReportThe planned restrictions, if enforced, could impact the country's IT hardware market, which is currently valued at between $8 billion and $10 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-close-in-green-as-banking-metal-stocks-lift-market-2619201-2024-10-18",
      "headline": "Sensex, Nifty close in green as banking, metal stocks lift marketThe S&P BSE Sensex added 218.14 points to close at, while the NSE Nifty50 gained 104.20 points to end at 24,854.05."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/da-hiked-by-3-percent-check-new-salary-arrear-calculations-for-central-govt-employees-pensioners-2619195-2024-10-18",
      "headline": "DA hike by 3%: Check new salary, arrear calculations for employees, pensionersThe DA hike increase is effective from July 1, 2024, and was confirmed during a Cabinet meeting chaired by Prime Minister Narendra Modi on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-growth-rate-shines-bright-in-global-economy-says-ajay-banga-world-bank-president-2619181-2024-10-18",
      "headline": "India's growth rate shines bright in global economy, says Ajay Banga A lot of that growth is in India, is driven by the domestic market as well, which actually is a healthy sign, in some ways, said Ajay Banga, World Bank president. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/igl-mgl-shares-plunge-up-to-15-percent-today-heres-why-new-guidelines-ministry-of-petroleum-and-natural-gas-2619141-2024-10-18",
      "headline": "IGL, MGL shares plunge up to 15% today. Here's why MGL's stock plummeted 11%, reaching a low of Rs 1,568.30, while IGL experienced a 10% drop, closing at Rs 453.70 on the Bombay Stock Exchange as of latest update. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vistata-new-ai-2-code-after-merger-with-air-india-retire-uk-2619127-2024-10-18",
      "headline": "Vistara to operate with 'AI 2' code after merger with Air IndiaVistara, a joint venture between the Tata Group and Singapore Airlines Limited (SIA), is set to formally merge with Air India on November 12, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-allotment-latest-gmp-discounted-listing-october-22-can-it-defy-expectations-2619092-2024-10-18",
      "headline": "Hyundai IPO: GMP signals discounted listing, but can it pull off a surprise?Hyundai IPO listing: Despite the buzz around the automaker's stock market debut, analysts and investors are divided on whether the stock will exceed expectations or struggle, given current market signals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-infosys-shares-fell-5-percent-after-q2-results-missed-targets-analyst-review-2619080-2024-10-18",
      "headline": " Explained: Why Infosys shares fell 5% after Q2 results Infosys share price: Infosys reported a profit after tax (PAT) of Rs 6,506 crore for the second quarter (Q2) ending in September 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wipro-shares-gain-4-percent-post-q2-results-bonus-issue-news-time-to-buy-review-stock-tips-2619053-2024-10-18",
      "headline": " Wipro shares gain 4% post Q2 results, bonus issue news. Time to buy? The rally came after Wipro announced its second-quarter (Q2) results for the fiscal year 2025 (FY25), posting a 21.3% year-on-year (YoY) jump in net profit to Rs 3,209 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-aws-ceo-matt-garman-warns-staff-return-to-office-or-resign-2619036-2024-10-18",
      "headline": "Amazon AWS CEO warns staff: Return to office or resignAmazon AWS CEO Matt Garman defended the decision to implement a five-day in-office work week starting in January 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/european-central-bank-ecb-interest-rates-inflation-lowest-3-years-explained-2619020-2024-10-18",
      "headline": "Explained: Why European Central Bank cut interest rates againECB cuts interest rates: This marks the first time the ECB has implemented back-to-back rate cuts since it began its current cycle of easing in response to falling inflation rates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-regulatory-action-nbfc-asirvad-micro-finance-navi-finserv-dmi-finance-arohan-financial-explained-impact-on-customers-2619007-2024-10-18",
      "headline": "RBI action against Navi Finserv, 3 other NBFCs: What it means for customersRBI's regulatory action comes in response to concerns over their loan pricing policies and other regulatory violations, sparking questions about the implications for customers."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/vikash-yadav-arrest-delhi-police-lawrence-bishnoi-gurpatwant-pannun-murder-plot-2619718-2024-10-19",
      "headline": "Vikash Yadav, wanted by US over Pannun murder plot, arrested for extortionThe arrest came weeks after Vikash Yadav was mentioned by the US Department of Justice as a co-conspirator in the alleged Gurpatwant Pannun murder plot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aviation-safety-panel-bcas-ceos-of-airlines-hoax-bomb-threats-flights-india-sources-2619771-2024-10-19",
      "headline": "Aviation safety panel meets CEOs of airlines amid hoax bomb threatsZulfiquar Hasan, the Director General of BCAS, met the CEOs of domestic airlines and assured them that all security protocols were being followed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/changing-culture-kalli-purie-on-harpers-bazaars-journey-2619832-2024-10-20",
      "headline": "Men now trying to be more like women: Kalli Purie at Bazaar Women of the Year AwardsKalli Purie, Vice-Chairperson and Executive Editor-in-Chief, India Today Group, gave the keynote address at Harper's Bazaar Women of the Year Awards 2024. Here's the full text."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/benjamin-netanyahu-video-message-house-drone-attack-hamas-lebanon-hezbollah-2619773-2024-10-19",
      "headline": "Netanyahu's strong message after drone attack on residence: Won't deter meThe rare video statement by Benjamin Netanyahu, released on Shabbat, the Jewish day of rest, came in the wake of a drone attack that targeted his residence in Caesarea. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/avani-lekhara-harpers-woman-of-the-year-award-paralympics-gold-medalist-air-shooting-2619801-2024-10-19",
      "headline": "Paralympics star Avani Lekhara wins Harper's Bazaar Sportswoman of the Year Avani Lekhara won the inaugural Harper's Bazaar Women of the Year Award for sports on Saturday in Mumbai. She was honoured for her inspiring success at the Paralympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-elections-2024-arvind-kejriwal-aap-mandal-model-bjp-2619814-2024-10-20",
      "headline": "What is AAP's plan for Delhi elections 2025? Arvind Kejriwal shares insights  Addressing a gathering of the party workers in Pitampura, Kejriwal introduced the \"AAP Mandal Model,\" which includes appointing one \"Mandal Prabhari\" to oversee five booths. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-pakistan-a-emerging-asia-cup-ramandeep-singh-one-hand-catch-yasir-khan-2619830-2024-10-20",
      "headline": "Watch: Ramandeep takes stunning one-handed catch in India A vs Pakistan ARamandeep Singh's spectacular diving catch dismissed Pakistan A's Yasir Khan and turned the tide in India A's Emerging Asia Cup clash. The catch, combined with stellar bowling, helped India A secure a dominant victory in their defense of 183 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jharkhand-assembly-election-bjp-candidate-list-champai-soren-babulal-marandi-sita-soren-2619765-2024-10-19",
      "headline": "Champai Soren, Babulal Marandi, Sita Soren in BJP's first list for JharkhandAs per the list, Babulal Marandi will be contesting polls from Dhanwar seat, while Champai Soren is set to represent Saraikela. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/isha-ambani-is-harpers-bazaar-icon-of-the-year-dedicates-award-to-mother-daughter-2619809-2024-10-19",
      "headline": "Isha Ambani is Harper's Bazaar Icon of the Year, dedicates award to mother, daughterIsha Ambani dedicated the award to her mother, Nita Ambani, the Chairperson of Reliance Foundation. Isha said her mother is her role model who has \"paved the way for me\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/iit-delhis-technology-ai-leadership-programme-shaping-the-future-of-tech-leadership-2616457-2024-10-14",
      "headline": "IIT Delhi's Technology & AI Leadership Programme: Shaping the Future of Tech LeadershipAdvance your career with IIT Delhi's Technology & AI Leadership Programme. Designed for aspiring tech leaders, this programme offers cutting-edge insights, practical experience, and strategic acumen to navigate the digital era. Gain the skills to drive innovation, lead digital transformations, and position yourself as a visionary in technology leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/rajasthan-the-royal-canvas-for-dream-weddings-2615738-2024-10-12",
      "headline": "Rajasthan: The Royal Canvas for Dream WeddingsWhether it's the grandeur of a palace wedding in Udaipur, the mystique of a desert wedding in Jaisalmer, or the creativity of a themed wedding in Jaipur, Rajasthan offers a wedding experience that is truly out of the ordinary."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-israeli-airstrikes-death-injured-northern-gaza-beit-lahiya-jabalia-palestinians-2619835-2024-10-20",
      "headline": "73 killed in Israeli strikes in Gaza, communication blackout hits rescue opsIsraeli airstrikes struck multiple residences in Beit Lahiya town in northern Gaza Strip on Saturday. According to a senior health ministry official, dozens were injured and reported missing in the attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-wins-spotlight-actor-at-bazaar-women-of-the-year-awards-2024-2619807-2024-10-19",
      "headline": "Ananya Panday wins Spotlight Actor at Bazaar Women of the Year Awards 2024Actor Ananya Panday talked about the opportunities that are available for women in the film industry today, as she won the Spotlight Actor of the Year award at the Harper's Bazaar's Women of the Year Awards 2024."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/shrikant-pangarkar-accused-gauri-lankesh-murder-case-eknath-shinde-shiv-sena-maharashtra-elections-2619808-2024-10-19",
      "headline": "Accused in journalist Gauri Lankesh murder case joins Eknath Shinde-led Shiv SenaShrikant Pangarkar joined the Eknath Shinde-led Shiv Sena on Friday in the presence of party leader and former state minister Arjun Khotkar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/lok-sabha-wayanad-by-elections-who-is-bjp-candidate-navya-haridas-priyanka-gandhi-vadra-congress-2619790-2024-10-19",
      "headline": "Meet Navya Haridas, BJP candidate for Wayanad bypoll against Priyanka GandhiNavya Haridas, 39, is a two-time councillor in Kozhikode Corporation and BJP parliamentary party leader in the corporation. She also serves as the state General Secretary of BJP Mahila Morcha."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-3-minor-boys-rape-five-year-old-daughter-of-landlord-in-ballia-district-2619796-2024-10-20",
      "headline": "3 minor boys rape five-year-old daughter of landlord in Uttar PradeshThe three accused boys -- aged 6, 13 and 16, -- have been detained by police and are being interrogated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gauri-khan-wins-best-interior-designer-at-bazaar-women-of-the-year-awards-2024-2619815-2024-10-19",
      "headline": "Gauri Khan wins Best Interior Designer at Bazaar Women of the Year Awards 2024Gauri Khan, a renowned interior designer and wife of Bollywood superstar Shah Rukh Khan, was awarded the Interior Designer of the Year award at Harper's Bazaar Women of the Year Awards 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-sports-entertainment-business-426-18-10-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chhattisgarhs-narayanpur-abujhmad-naxal-maoist-attack-itbp-tibetan-border-force-injured-2619654-2024-10-19",
      "headline": "Two Border Police jawans killed, 2 other injured in Naxal attack in ChhattisgarhTwo Indo-Tibetan Border Police (ITBP) jawans were injured in an IED blast while returning from an anti-Naxal operation in Chhattisgarh on Saturday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/vasundhra-oswal-detailed-uganda-india-businessman-oswal-group-2619747-2024-10-19",
      "headline": "Who is Vasundhara Oswal, daughter of Indian billionaire, detained in Uganda?Vasundhara Oswal was reportedly seized by a group of 20 armed men at the family's extra neutral alcohol (ENA) plant. Local officials have connected her arrest to an ongoing investigation into the case of a missing person."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/payal-kapadia-wins-best-director-at-bazaar-women-of-the-year-awards-feels-powerful-2619802-2024-10-19",
      "headline": "Payal Kapadia wins Best Director at Bazaar Women of the Year AwardsFilmmaker Payal Kapadia has been honoured with the Best Director award at the Harper's Bazaar's Women of the Year Awards 2024 for her film, All We Imagine As Light. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jharkhand-assembly-polls-hemant-soren-party-jmm-jharkhand-mukti-morcha-congress-contest-seats-jharkhand-polls-2619723-2024-10-19",
      "headline": "Hemant Soren's party, Congress to contest 70 of 81 seats in Jharkhand pollsHemant Soren on Saturday said that the INDIA bloc partners, consisting of Congress, Rashtriya Janata Dal (RJD), Jharkhand Mukti Morcha (JMM), and the Left parties, will contest the upcoming assembly polls together and the Congress and the JMM will field candidates in 70 of 81 seats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-sarfaraz-khan-jumping-run-out-rishabh-pant-reason-knee-injury-bengaluru-test-2619775-2024-10-19",
      "headline": "Thank God Pant survived run-out: Sarfaraz on his viral jumping momentSarfaraz Khan's animated reaction to save Rishabh Pant from a run-out during Day 4 of India's first Test against New Zealand went viral. Sarfaraz later revealed his concern about Pant's knee injury, adding depth to the heartwarming moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/union-minister-bandi-sanjay-kumar-detained-hyderabad-telangana-group-1-services-aspirants-protest-2619742-2024-10-19",
      "headline": "Union Minister detained for staging protest with government job aspirantsThe candidates protested at Ashok Nagar, the hub of coaching institutions for civil services and other competitive exams in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-wins-best-actor-at-bazaar-women-of-the-year-award-women-can-do-it-all-2619803-2024-10-19",
      "headline": "Kriti Sanon wins Best Actor at Bazaar Women of the Year Awards: Women can do it allActor Kriti Sanon was felicitated with the Best Actor honour at the Harper's Bazaar's Women of the Year Awards 2024, which happened in Mumbai on Saturday. The actor dedicated the award to her fellow women. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gauri-khan-wins-best-interior-designer-at-bazaar-women-of-the-year-awards-2024-2619815-2024-10-19",
      "headline": "Gauri Khan wins Best Interior Designer at Bazaar Women of the Year Awards 2024Gauri Khan, a renowned interior designer and wife of Bollywood superstar Shah Rukh Khan, was awarded the Interior Designer of the Year award at Harper's Bazaar Women of the Year Awards 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-wins-spotlight-actor-at-bazaar-women-of-the-year-awards-2024-2619807-2024-10-19",
      "headline": "Ananya Panday wins Spotlight Actor at Bazaar Women of the Year Awards 2024Actor Ananya Panday talked about the opportunities that are available for women in the film industry today, as she won the Spotlight Actor of the Year award at the Harper's Bazaar's Women of the Year Awards 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/payal-kapadia-wins-best-director-at-bazaar-women-of-the-year-awards-feels-powerful-2619802-2024-10-19",
      "headline": "Payal Kapadia wins Best Director at Bazaar Women of the Year AwardsFilmmaker Payal Kapadia has been honoured with the Best Director award at the Harper's Bazaar's Women of the Year Awards 2024 for her film, All We Imagine As Light. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-pakistan-a-emerging-asia-cup-ramandeep-singh-one-hand-catch-yasir-khan-2619830-2024-10-20",
      "headline": "Watch: Ramandeep takes stunning one-handed catch in India A vs Pakistan ARamandeep Singh's spectacular diving catch dismissed Pakistan A's Yasir Khan and turned the tide in India A's Emerging Asia Cup clash. The catch, combined with stellar bowling, helped India A secure a dominant victory in their defense of 183 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-beat-rafael-nadal-six-kings-slam-riyadh-2619828-2024-10-20",
      "headline": "Djokovic beats Rafael Nadal in 'One Last Dance' at Six Kings SlamSix Kings Slam: Novak Djokovic defeated Rafael Nadal in straight sets in the third-place playoff-match on Saturday. Djokovic won the match 6-2, 7-6 (7-5). The duo faced each other on the tour 60 times since 2006 but won't be meeting anymore as Nadal will retire from professional tennis after the Davis Cup tie against Netherlands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-vs-brentford-alejandro-garnacho-rasmus-hojlund-erik-ten-hag-2619825-2024-10-19",
      "headline": "Manchester United beat Brentford 2-1 to claim first win in four matchesManchester United ended their winless Premier League run with a 2-1 comeback victory over Brentford. Goals from Alejandro Garnacho and Rasmus Højlund secured three crucial points, easing pressure on Erik ten Hag after a challenging start to the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rishabh-pant-sarfaraz-khan-new-zealand-william-orourke-bengaluru-test-2619823-2024-10-19",
      "headline": "Pant, Sarfaraz batted very well, but New Zealand made use of the second new ball: O'Rourke IND vs NZ, 1st Test: Fast bowler William O'Rourke admitted that Sarfaraz Khan and Rishabh Pant made life tough for the New Zealand bowlers, but also said that the Black Caps made a comeback by making good use of the second new ball. The Kiwis need 107 runs to win the Bengaluru Test and take a 1-0 lead in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-mohunbagan-dominance-kolkata-derby-east-bengal-jamie-mclaren-petratos-2619817-2024-10-19",
      "headline": "Mohunbagan continue Kolkata derby dominance with 2-0 win over East BengalMohun Bagan Super Giants continued their dominance in the Kolkata derby with a 2-0 win over East Bengal FC. Despite a balanced start, goals from Jamie McLaren and Dimitri Petratos sealed their eighth consecutive ISL victory over their rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/emerging-asia-cup-india-vs-pakistan-tilak-varma-mohammad-haris-2619816-2024-10-19",
      "headline": "India A edge past Pakistan A in last-over thriller to make winning start Emerging Asia Cup: Tilak Varma's India beat Mohammad Haris' Pakistan by seven runs in a thriller in Al Amerat on Sunday. With the win, India moved to second in the table with a net run rate o +0.350. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/avani-lekhara-harpers-woman-of-the-year-award-paralympics-gold-medalist-air-shooting-2619801-2024-10-19",
      "headline": "Paralympics star Avani Lekhara wins Harper's Bazaar Sportswoman of the Year Avani Lekhara won the inaugural Harper's Bazaar Women of the Year Award for sports on Saturday in Mumbai. She was honoured for her inspiring success at the Paralympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-sarfaraz-khan-australia-bowlers-migraine-playing-xi-century-bengaluru-2619806-2024-10-19",
      "headline": "Sarfaraz will give migraines to Australia bowlers: Sanjay ManjrekarSanjay Manjrekar lauded Sarfaraz Khan's stellar 150-run knock during India's first Test against New Zealand, emphasizing that the young batter's performance shows why he could be pivotal in India's upcoming tour of Australia, especially against their strong pace attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-bengaluru-test-weather-forecast-2619793-2024-10-19",
      "headline": "IND vs NZ, Sunday Weather Forecast: Will rain force a draw?IND vs NZ, 1st Test: Tom Latham's New Zealand need 107 runs to win the opening Test at the M Chinnaswamy Stadium in Bengaluru, but weather could end play a big factor on Day 5. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-tamil-nadu-pile-mammoth-score-delhi-washington-sundar-2619786-2024-10-19",
      "headline": "Ranji Trophy: Washington shines as Tamil Nadu pile mammoth 674 over DelhiWashington Sundar and Pradosh Ranjan Paul dominated Delhi's spin attack, piling on centuries as Tamil Nadu amassed 674/6, seizing control of their Ranji Trophy Group D clash. Delhi struggled both on-field and with injuries, setting up a tough contest ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/emerging-asia-cup-india-a-vs-pakistan-a-abhishek-sharma-sufiyan-muqeem-sufiyan-muqeem-2619783-2024-10-19",
      "headline": "Watch: Abhishek, Sufiyan in heated exchange in India A vs Pakistan A clash Men's Emerging Asia Cup 2024: Abhishek Sharma, Sufiyan Muqeem got involved in a heated exchange after the Pakistani spinner gave Abhishek a send off. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/avani-lekhara-harpers-woman-of-the-year-award-paralympics-gold-medalist-air-shooting-2619801-2024-10-19",
      "headline": "Paralympics star Avani Lekhara wins Harper's Bazaar Sportswoman of the Year Avani Lekhara won the inaugural Harper's Bazaar Women of the Year Award for sports on Saturday in Mumbai. She was honoured for her inspiring success at the Paralympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-sarfaraz-khan-australia-bowlers-migraine-playing-xi-century-bengaluru-2619806-2024-10-19",
      "headline": "Sarfaraz will give migraines to Australia bowlers: Sanjay ManjrekarSanjay Manjrekar lauded Sarfaraz Khan's stellar 150-run knock during India's first Test against New Zealand, emphasizing that the young batter's performance shows why he could be pivotal in India's upcoming tour of Australia, especially against their strong pace attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-bengaluru-test-weather-forecast-2619793-2024-10-19",
      "headline": "IND vs NZ, Sunday Weather Forecast: Will rain force a draw?IND vs NZ, 1st Test: Tom Latham's New Zealand need 107 runs to win the opening Test at the M Chinnaswamy Stadium in Bengaluru, but weather could end play a big factor on Day 5. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-tamil-nadu-pile-mammoth-score-delhi-washington-sundar-2619786-2024-10-19",
      "headline": "Ranji Trophy: Washington shines as Tamil Nadu pile mammoth 674 over DelhiWashington Sundar and Pradosh Ranjan Paul dominated Delhi's spin attack, piling on centuries as Tamil Nadu amassed 674/6, seizing control of their Ranji Trophy Group D clash. Delhi struggled both on-field and with injuries, setting up a tough contest ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/emerging-asia-cup-india-a-vs-pakistan-a-abhishek-sharma-sufiyan-muqeem-sufiyan-muqeem-2619783-2024-10-19",
      "headline": "Watch: Abhishek, Sufiyan in heated exchange in India A vs Pakistan A clash Men's Emerging Asia Cup 2024: Abhishek Sharma, Sufiyan Muqeem got involved in a heated exchange after the Pakistani spinner gave Abhishek a send off. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-sarfaraz-khan-jumping-run-out-rishabh-pant-reason-knee-injury-bengaluru-test-2619775-2024-10-19",
      "headline": "Thank God Pant survived run-out: Sarfaraz on his viral jumping momentSarfaraz Khan's animated reaction to save Rishabh Pant from a run-out during Day 4 of India's first Test against New Zealand went viral. Sarfaraz later revealed his concern about Pant's knee injury, adding depth to the heartwarming moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-new-zealand-sarfaraz-khan-father-motivation-century-bengaluru-2619774-2024-10-19",
      "headline": "I keep talking to my father for motivation: Sarfaraz Khan IND vs NZ, 1st Test: Sarfaraz Khan scored his maiden Test hundred in Bengaluru and helped India recover in the second innings. Sarafraz scored 150 off 195 balls before Tim Southee accounted for his wicket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-william-orourke-india-bengaluru-test-2619769-2024-10-19",
      "headline": "Not going to be easy win: William O'Rourke wary of 'world class' IndiaIND vs NZ: William O'Rourke said that New Zealand would not have it easy chasing the target of 105 on Day 5 of the opening Test against India at the M Chinnaswamy Stadium in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-sarfaraz-khan-rishabh-pant-duleep-trophy-mindset-attack-partnership-bengaluru-test-2619761-2024-10-19",
      "headline": "Let's repeat Duleep Trophy: Sarfaraz reveals chat with Pant during Day 4Sarfaraz Khan revealed a vital conversation with Rishabh Pant that ignited their aggressive partnership on Day 4 of the Bengaluru Test. Recalling their Duleep Trophy experience, the duo's attacking approach led to India's commanding 462-run total against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-bengaluru-test-sarfaraz-khan-107-host-win-chance-2619759-2024-10-19",
      "headline": "New Zealand won't have it easy: Sarfaraz backs India to defend 107-run target Sarfaraz Khan suggested that New Zealand might find it challenging to chase the modest target of 107 runs on the final day at Chinnaswamy Stadium, especially if India can claim early wickets as the pitch begins to deteriorate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/japan-womens-open-eva-lys-insulting-online-trolls-2619756-2024-10-19",
      "headline": "German tennis star Eva Lys calls out troll for 'insulting' herGerman tennis star Eva Lys called out online trolls after facing abuse following her defeat in the Japan Women's Open 2024 quarterfinal on Friday. Eva lost to Japan's Aoi Ito in three sets in the quarters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-maharashtra-vs-mumbai-report-ruturaj-gaikwad-shreyas-iyer-2619753-2024-10-19",
      "headline": "Gaikwad leads Maharashtra response after Shreyas hundred lifts MumbaiMaharashtra skipper Ruturaj Gaikwad's unbeaten 80 led to a determined response against Mumbai on the second day of their Ranji Trophy Group A clash. However, Maharashtra still trail by 173 runs. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-arguing-umpire-rain-stops-play-virat-kohli-bengaluru-test-2619730-2024-10-19",
      "headline": "Rohit argues with umpire before heavy rain in dramatic Bengaluru scenesIndia captain Rohit Sharma was seen arguing with umpire Michael Gough on Day 4 of the first Test against New Zealand, urging him not to halt play due to bad light. The match was later interrupted by heavy rain, adding drama to India's defense.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-bengaluru-test-sarfaraz-khan-107-host-win-chance-2619759-2024-10-19",
      "headline": "New Zealand won't have it easy: Sarfaraz backs India to defend 107-run target Sarfaraz Khan suggested that New Zealand might find it challenging to chase the modest target of 107 runs on the final day at Chinnaswamy Stadium, especially if India can claim early wickets as the pitch begins to deteriorate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/japan-womens-open-eva-lys-insulting-online-trolls-2619756-2024-10-19",
      "headline": "German tennis star Eva Lys calls out troll for 'insulting' herGerman tennis star Eva Lys called out online trolls after facing abuse following her defeat in the Japan Women's Open 2024 quarterfinal on Friday. Eva lost to Japan's Aoi Ito in three sets in the quarters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-maharashtra-vs-mumbai-report-ruturaj-gaikwad-shreyas-iyer-2619753-2024-10-19",
      "headline": "Gaikwad leads Maharashtra response after Shreyas hundred lifts MumbaiMaharashtra skipper Ruturaj Gaikwad's unbeaten 80 led to a determined response against Mumbai on the second day of their Ranji Trophy Group A clash. However, Maharashtra still trail by 173 runs. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-arguing-umpire-rain-stops-play-virat-kohli-bengaluru-test-2619730-2024-10-19",
      "headline": "Rohit argues with umpire before heavy rain in dramatic Bengaluru scenesIndia captain Rohit Sharma was seen arguing with umpire Michael Gough on Day 4 of the first Test against New Zealand, urging him not to halt play due to bad light. The match was later interrupted by heavy rain, adding drama to India's defense.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-bengaluru-test-stats-records-rohit-sharma-2619727-2024-10-19",
      "headline": "Can India defend 107 in Bengaluru Test? Here's what history says IND vs NZ: Rohit Sharma's India need to defend 107 runs against Tom Latham's New Zealand to win the Bengaluru Test and take a 1-0 lead in the three-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-1st-test-day-4-report-sarfaraz-pant-orourke-bengaluru-2619722-2024-10-19",
      "headline": "Bengaluru Test: India on sticky wicket despite Sarfaraz-Pant heroicsIndia vs New Zealand, 1st Test: Sarfaraz Khan's superb 150 and Rishabh Pant's quickfire 99 propelled India to 462 in their second innings, setting New Zealand a target of 107 on day four of the first Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-should-be-dropped-fans-upset-with-bengalurus-local-boy-as-he-fails-india-vs-bangalore-2619714-2024-10-19",
      "headline": "'KL Rahul should be dropped': Fans upset after Bengaluru Test flop showA certain section of fans was upset on social media about KL Rahul's performance in the Bengaluru Test vs New Zealand. They asked Rahul to be dropped from the next Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-neeraj-chopra-pranks-his-parting-coach-while-doing-viral-instagram-trend-2619699-2024-10-19",
      "headline": "Watch: Neeraj Chopra pranks his parting coach while doing viral Instagram trendNeeraj Chopra pranked his parting coach Bartonietz in a viral Instagram post. Neeraj Chopra and his coach Klaus Bartonietz are ending their five-year partnership. Bartonietz, citing age and family commitments, has decided to part ways with Chopra."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}