{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tesla-shares-fall-as-trump-musk-rift-sparks-investor-jitters-glbs-2736458-2025-06-06",
      "headline": "Tesla shares fall as Trump-Musk rift sparks investor jittersTesla stock plunged 9 per cent after Elon Musk criticized Trump's tax bill, straining their alliance. Investors fear political fallout could damage Tesla's business, especially amid threats to key EV subsidies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-could-become-third-largest-economy-in-the-world-this-year-borge-brende-2736444-2025-06-05",
      "headline": "India could become third largest economy in the world this year: Borge BrendeIn an exclusive interview with India Today, World Economic Forum President and CEO Borge Brende talked about India's strong economic performance and projected it could become the world's third-largest economy this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tariffs-wars-ai-wef-ceo-breaks-down-whats-next-for-global-economy-2736451-2025-06-05",
      "headline": "Tariffs, wars, AI: WEF chief breaks down what's next for global economyFrom rising tariffs and geopolitical risks to AI-driven productivity leaps, WEF CEO Borge Brende reveals how resilience, innovation, and cautious optimism could shape the future of the global economy beyond 2025"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-is-the-global-bright-spot-set-to-overtake-japan-wef-ceo-borge-brende-2736441-2025-06-05",
      "headline": "India is world's bright spot, set to overtake Japan: WEF chief Borge BrendeWEF CEO Borge Brende said India is the world's bright spot but added that to stay ahead, it must double down on reforms, infrastructure, and coordination across states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-airport-gives-seed-balls-to-flyers-merges-green-goals-with-social-impact-2736399-2025-06-05",
      "headline": "Delhi Airport gives seed balls to flyers, merges green goals with social impactLed by GMR Aero's Delhi International Airport Limited (DIAL), the campaign invites passengers to plant seed balls containing species like Lemon, Tamarind, Gooseberry, Neem, and Peepal, all chosen for their ecological and medicinal value. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-kyc-norms-credit-card-email-update-india-2736273-2025-06-05",
      "headline": "Want to update your credit card email? Follow these stepsA guide to updating your registered email address for credit cards in India, highlighting the new RBI KYC norms and simplification by banks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-hands-over-iphone-macbook-repairs-to-tata-in-india-report-2736220-2025-06-05",
      "headline": "Tata to handle iPhone and MacBook repairs in India for Apple: ReportAs the US tech giant continues to diversify its manufacturing footprint beyond China, Tata has emerged as a key ally. The group already assembles iPhones at three facilities in southern India, with one also manufacturing certain components."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/energy-electrons-currency-zerodha-nikhil-kamath-ai-data-centres-india-2736212-2025-06-05",
      "headline": "Will energy replace currency? Zerodha's Nikhil Kamath thinks soNikhil Kamath believes energy could replace money in the next decade. Here's why he thinks so."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-ends-over-400-points-higher-nifty-above-24700-eternal-gains-5-percent-2736178-2025-06-05",
      "headline": "Sensex ends over 400 points higher, Nifty above 24,700; Eternal gains 5%The S&P BSE Sensex was up by 443.79 points to end at 81,442.04, while the NSE Nifty50 gained 130.70 points to close at 24,750.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-eli-scheme-benefits-make-sure-your-uan-and-aadhaar-are-linked-by-this-date-2736138-2025-06-05",
      "headline": "Want ELI scheme benefits? Make sure your UAN and Aadhaar are linked by this dateThe Employees' Provident Fund Organisation has extended the deadline for UAN activation and Aadhaar linking to bank accounts under the ELI scheme until 30 June 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-you-a-freelancer-5-things-to-know-while-filing-your-itr-without-form-15-explains-tax-expert-2736113-2025-06-05",
      "headline": "Are you a freelancer? 5 things to know while filing your ITRFreelancers can claim deductions for expenses directly related to their work. These include internet bills, rent for a co-working space, cost of software tools, professional fees, marketing and advertising costs, and travel expenses related to business, etc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-may-remove-12-percent-slab-shift-items-to-5-and-18-percent-2736092-2025-06-05",
      "headline": "GST Council may remove 12% slab, shift items to 5% and 18% tax ratesThe GST Council is considering eliminating the 12% tax slab as part of efforts to streamline the tax structure, potentially moving these items to either the 5% or 18% brackets."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayat-season-4-release-date-arrive-early-manju-devi-vs-kranti-devi-promo-suggests-so-2736353-2025-06-05",
      "headline": "Panchayat Season 4 to arrive early? Manju Devi vs Kranti Devi promo suggests soThe rivalry between Manju Devi and Kranti Devi takes a new twist in the rally cry song of 'Panchayat Season 4'. The video hints at the show releasing ahead of the July 2 launch date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ayushmann-khurrana-sooraj-barjatya-next-film-to-go-on-floors-in-november-2736296-2025-06-05",
      "headline": "Ayushmann Khurrana's next with Sooraj Barjatya to go on floors in November: ReportAyushmann Khurrana will play the lead role of 'Prem' in Sooraj Barjatya's next family drama, which begins shooting in November 2025. The film, also starring Sharvari, is expected to release in the second half of 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/farah-khan-cook-dilip-first-international-trip-2736359-2025-06-05",
      "headline": "Farah Khan's cook Dilip shares chocolates with paps before first foreign trip. WatchFarah Khan's in-house cook Dilip is now a social media sensation. He was seen at the airport ahead of his first international trip.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranjeet-shares-birthday-fun-from-housefull-5-sets-2736346-2025-06-05",
      "headline": "Ranjeet shares birthday fun from Housefull 5 sets: Can't stop missing these momentsVeteran actor Ranjeet recently shared a throwback clip of his birthday celebrations from the sets of Housefull 5. Akshay Kumar, Riteish Deshmukh, Abhishek Bachchan, and others were seen celebrating with him.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-not-first-choice-jaanwar-suneel-darshan-2736265-2025-06-05",
      "headline": "Akshay Kumar wasn't the first choice for Jaanwar: Suneel DarshanFilmmaker Suneel Darshan revealed that Akshay Kumar was not the original lead for Jaanwar. The director had initially considered two other Bollywood actors before casting Akshay during a low point in his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-confirms-superhero-film-with-director-lokesh-kanagaraj-details-2736337-2025-06-05",
      "headline": "Aamir Khan confirms superhero film with director Lokesh Kanagaraj. DetailsAamir Khan is set to work with Tamil director Lokesh Kanagaraj for his next superhero film. The actor confirmed the development and the film will go on the floors somewhere in the second half of 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ishaan-khatter-addresses-rift-the-royals-makers-shirtless-scenes-2736302-2025-06-05",
      "headline": "Ishaan Khatter addresses rift with The Royals makers over shirtless scenesActor Ishaan Khatter recently opened up about his rift with 'The Royals' makers over his shirtless scenes. Khatter said that he resisted certain scenes, however, they persisted. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/muzammil-ibrahim-deepika-padukone-relationship-in-past-2736323-2025-06-05",
      "headline": "Muzammil Ibrahim says he was in a relationship with Deepika Padukone for 2 yearsActor Muzammil Ibrahim recently revealed he dated Deepika Padukone for two years during their early modelling days in Mumbai. He shared fond memories of their time together, including rickshaw dates and birthday surprises, and expressed admiration for her success today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/barun-sobti-confirms-asur-3-in-works-2736300-2025-06-05",
      "headline": "Actor Barun Sobti confirms Asur 3 in worksActor Barun Sobti created strong buzz among fans after he gave an update on his popular series 'Asur'. He stated that the third part of the franchise is in the works. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pankaj-tripathi-aditi-rao-hydari-parivarik-manuranjan-filming-begins-in-lucknow-2736235-2025-06-05",
      "headline": "Pankaj Tripathi, Aditi Rao Hydari team up for Parivarik ManuRanjanActors Pankaj Tripathi and Aditi Rao Hydari are set to share the screen space for the first time in Parivarik ManuRanjan. The shooting of the film has begun in Lucknow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-is-playful-coach-in-fun-slice-of-life-title-track-sitaare-zameen-par-2736142-2025-06-05",
      "headline": "Sitaare Zameen Par: Aamir Khan is a playful coach in fun, slice-of-life title trackThe 'Sitaare Zameen Par' title track was released on June 5. Aamir Khan plays a caring and playful basketball coach in the slice-of-life song celebrating team-spirit and human resilience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-muzammil-ibrahim-accuses-pooja-bhatt-of-abusing-him-on-movie-set-18-years-ago-2736180-2025-06-05",
      "headline": "Actor Muzammil Ibrahim accuses Pooja Bhatt of abuse on Dhokha set 18 years agoActor Muzammil Ibrahim recently recalled his unpleasant experience of working under actor-filmmaker Pooja Bhatt's direction. He alleged that due to Pooja's abusive behaviour, he decided not to work with her in the near future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-fans-thug-life-ban-in-karnataka-travel-hosur-tamil-nadu-2736170-2025-06-05",
      "headline": "Kamal Haasan fans defy Thug Life ban in Karnataka, travel 42 km to watch the filmActor Kamal Haasan's 'Thug Life' was banned in Karnataka following his controversial comment about the Kannada language. However, fans from Bengaluru travelled to Hosur, Tamil Nadu, to watch the film and show their support.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/k-pop-group-xin-interview-indian-star-aria-teaches-her-members-hindi-talk-defend-myself-2736229-2025-06-05",
      "headline": "K-pop group X:IN Interview: Indian star Aria teaches her members Hindi, talk Defend MyselfK-pop girl group X:IN sits down with India Today's Bhavna Agarwal for a hilariously unfiltered chat! From opening up about their fierce comeback Defend Myself, to teasing each other, this is unmissable. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/housefull-5-director-tarun-mansukhani-reacts-to-the-demand-of-8-hour-shifts-for-bollywood-moms-2736173-2025-06-05",
      "headline": "8-hour shifts for Bollywood moms? Housefull 5 director Tarun Mansukhani reactsIn an exclusive interview with India Today, Housefull 5 director Tarun Mansukhani said he has no problem with new mothers in Bollywood wanting to do an eight-hour shift, but the demand has to come with prior information. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/housefull-5-director-tarun-mansukhani-chhoti-bachi-hai-kya-line-happened-on-the-spot-2736191-2025-06-05",
      "headline": "Chhoti bachi hai kya? in Housefull 5 was spontaneous: Director Tarun MansukhaniDirector Tarun Mansukhani has revealed the dialogue 'Chhoti bachi hai kya' dialogue happened on the spot and wasn't in the script. Housefull 5 will be released on June 6, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/surveen-chawla-challenging-roles-criminal-justice-season-4-big-film-rejection-2736100-2025-06-05",
      "headline": "Surveen Chawla on joining Criminal Justice 4 and turning down a big filmSurveen Chawla joins Criminal Justice Season 4, sharing insights on her role choices and experiences. She also reveals turning down a major film to avoid repeating herself as an actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/thug-life-review-kamal-haasan-silambarasan-mani-ratnam-haphazard-screenplay-hollow-2736118-2025-06-05",
      "headline": "Thug Life review: Kamal Haasan, Silambarasan's gangster drama soars, then sinksReleased-Thu Jun 05, 2025Thug Life movie review: Directed by Mani Ratnam, 'Thug Life', starring Kamal Haasan and Silambarasan, is a gangster drama with emotional beats. While the film had a great set-up pre-interval, it falls into a deep pit in the second half and there is no turning back – even for a legend like Mani Ratnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arbaaz-khans-request-to-paps-sparks-pregnancy-buzz-about-wife-sshura-2736090-2025-06-05",
      "headline": "Samjha karo: Arbaaz Khan's request to paps sparks pregnancy buzz about wife SshuraArbaaz Khan and wife Sshura Khan were spotted during a family outing in Mumbai, sparking pregnancy rumours. Arbaaz's request for privacy from paparazzi further hinted at the couple expecting their first child together.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/siddaramaiah-government-suspends-bengaluru-police-commissioner-top-officials-over-rcb-event-stampede-2736401-2025-06-05",
      "headline": "Bengaluru top cop, officials suspended: Siddaramaiah's big action after stampedeKarnataka Chief Minister Siddaramaiah said the Bengaluru Police Commissioner and other top officials were suspended after 11 people died in a stampede during RCB's maiden IPL victory celebrations outside a cricket stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-is-the-global-bright-spot-set-to-overtake-japan-wef-ceo-borge-brende-2736441-2025-06-05",
      "headline": "India is world's bright spot, set to overtake Japan: WEF chief Borge BrendeWEF CEO Borge Brende said India is the world's bright spot but added that to stay ahead, it must double down on reforms, infrastructure, and coordination across states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/japan-ispace-resilience-spacecraft-moon-landing-live-updates-2736352-2025-06-05",
      "headline": "LIVE: Japan's Resilience spacecraft to land on the Moon shortlyJapan ispace's Resilience spacecraft Landing Live Updates: Resilience spacecraft is targetting to land in Moon's Mare Frigoris region. It is a vast, dark basaltic plain in the Moon's Northern Hemisphere, stretching over 1,400 kilometres in diameter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-says-hes-disappointed-with-musk-unsure-about-their-great-relationship-musk-responds-with-whatever-2736417-2025-06-05",
      "headline": "Trump says he's disappointed with Musk, unsure about their 'great relationship'Donald Trump suggested that Elon Musk's opposition to the 'One Big Beautiful Bill' stemmed from the bill's plan to phase out federal consumer tax credits for EVs, a measure that would directly impact Tesla."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/bengaluru-rcb-victory-parade-stampede-m-chinnaswamy-tragedy-waiting-to-happen-explained-five-points-details-2736295-2025-06-05",
      "headline": "Killer factors behind the avoidable Bengaluru stampede. Explained in 5 pointsA celebration meant to honour Royal Challengers Bengaluru's historic win in IPL 2025 turned into a tragedy. The stampede in Bengaluru was a result of a series of ignored warnings and mismanagement. From conflicting announcements to crowd-control failures, these are the five big reasons behind the chaos that led to the tragedy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nations-sympathise-with-pakitanss-poverty-but-see-it-as-problem-child-bjps-jay-panda-2736396-2025-06-05",
      "headline": "Nations sympathise with Pak's poverty but see it as problem child: BJP's Jay PandaSpeaking after the delegation's return, Jay Panda highlighted the warm reception accorded to the Indian MPs and claimed that the countries they visited made a clear distinction between India and Pakistan.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/bengaluru-stampede-fir-police-warned-organisers-stampede-still-happened-2736357-2025-06-05",
      "headline": "Bengaluru Police pinning blame of stampede on RCB, organiser, reveal FIR detailsAs per the FIR filed by the Bengaluru police, RCB, organising firm DNA Entertainment and the Karnataka State Cricket Association have been named as key accused in the stampede at Chinnaswamy Stadium that killed 11 and injured many. The FIR blames organisers for negligence and poor crowd control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-coco-gauff-vs-lois-bosson-aryna-sabalenka-iga-swiatek-2736452-2025-06-05",
      "headline": "Gauff ends French wildcard's fairytale, sets up final vs Swiatek-slayer SabalenkaWorld No. 2 Coco Gauff brought an end to French wildcard Lois Bosson's dream run with a commanding win in their women's singles semi-final on Thursday. Earlier in the day in Paris, Aryna Sabalenka stunned Iga Swiatek, snapping the Polish star's 26-match unbeaten streak on the red clay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/thug-life-review-kamal-haasan-silambarasan-mani-ratnam-haphazard-screenplay-hollow-2736118-2025-06-05",
      "headline": "Thug Life review: Kamal Haasan, Silambarasan's gangster drama soars, then sinksReleased-Thu Jun 05, 2025Thug Life movie review: Directed by Mani Ratnam, 'Thug Life', starring Kamal Haasan and Silambarasan, is a gangster drama with emotional beats. While the film had a great set-up pre-interval, it falls into a deep pit in the second half and there is no turning back – even for a legend like Mani Ratnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/watch-live-japans-resilience-spacecraft-attempts-daring-moon-landing-2736331-2025-06-05",
      "headline": "Watch LIVE: Japan's Resilience spacecraft attempts daring Moon landingIspace's Resilience spacecraft will fire its main engine to begin the descent from its 100-kilometre lunar orbit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-quips-after-sons-curveball-on-operation-sindoor-he-does-this-to-his-dad-2736430-2025-06-05",
      "headline": "He does this to his dad, Shashi Tharoor quips after son's curveball on Op SindoorThe question from Shashi Tharoor's son, both timely and probing, was whether any country had asked the Indian delegation for evidence of Pakistan's involvement in the Pahalgam attack, given Pakistan's repeated denials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-inaugurate-chenab-anji-rail-bridges-omar-abdullah-shares-pics-videos-views-2736222-2025-06-05",
      "headline": "Record-setting Chenab Bridge opens tomorrow, Omar Abdullah shares stunning picsPrime Minister Narendra Modi will inaugurate the engineering marvels - Chenab Bridge and Anji Bridge - during his visit to Jammu and Kashmir on Friday. Ahead of his visit, Chief Minister Omar Abdullah shared stunning photos and videos of the two rail bridges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/bengaluru-stampede-the-price-fans-pay-for-manufactured-loyalty-2736175-2025-06-05",
      "headline": "Bengaluru stampede, the price fans pay for manufactured loyaltyThe tragic Bengaluru stampede, claiming 11 lives, was not just a failure of crowd control, but a symptom of fan irrationality fuelled by the IPL's corporate exploitation. The catastrophe reveals how corporate greed exploits human psychology, transforming fan loyalty into a tragic loss of reason and lives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/seemanth-kumar-singh-is-the-new-bengaluru-police-commissioner-after-siddaramaiahs-action-over-stampede-2736446-2025-06-05",
      "headline": "Seemanth Singh is new Bengaluru top cop after Siddaramaiah's action over stampedeHours after the Karnataka government suspended Bengaluru Police Commissioner B Dayananda over the stampede during RCB's victory celebrations, IPS officer Seemanth Kumar Singh has been named as the new top cop of the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-india-doesnt-call-out-trumps-ceasefire-claim-india-pakistan-shashi-tharoor-answered-operation-sindoor-2736033-2025-06-05",
      "headline": "How Tharoor hit Trump, Rahul Gandhi with a single stone on ceasefireTrump's claim of brokering a ceasefire between India and Pakistan has been used by the Congress and its leaders, including Rahul Gandhi, to attack PM Narendra Modi. But why hasn't India vociferously rejected Trump's claim? Congress MP Shashi Tharoor revealed why the Indian government has been diplomatic in rejecting Trump's claims, and destroyed Rahul's arguments too."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-congresss-fresh-narender-surrender-salvo-at-pm-modi-features-trumps-red-maga-cap-2736281-2025-06-05",
      "headline": "Congress's fresh 'Narender surrender' salvo at PM features Trump's red MAGA cap The fresh salvo came in the form of a social media post featuring US President Donald Trump's iconic red 'Make America Great Again' cap, emblazoned with the words 'Narender Surrender' - a pointed reference to Gandhi's allegation that PM Modi agreed to a ceasefire with Pakistan following a call from Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/reverse-catfishing-gen-zs-new-dating-strategy-for-finding-real-love-2736361-2025-06-05",
      "headline": "Reverse Catfishing: Gen Z's new dating strategy for finding real love'Reverse catfishing' is a dating strategy where users intentionally put up unfiltered, raw, and even flawed pictures with purposefully toned-down achievements to find the most genuine match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-aryna-sabalenka-semi-final-french-open-2736397-2025-06-05",
      "headline": "Aryna Sabalenka ends Iga Swiatek's dream run, through to maiden finalFrench Open 2025: Aryna Sabalenka stormed into the final of the clay-court major after beating four-time champion Iga Swiatek in three sets on Thursday on Centre Court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/reviews/story/oneplus-pad-3-review-android-tablet-that-is-big-on-performance-2736282-2025-06-05",
      "headline": "OnePlus Pad 3 review: Android tablet that is big on performanceThe Android tablet market can be rather confusing. The OnePlus Pad 3 aims to simplify it all by offering top and high-end hardware and features at a more affordable price. It largely succeeds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rafale-fighter-jet-parts-to-be-made-in-india-soon-for-the-first-time-outside-france-2736154-2025-06-05",
      "headline": "Big boost to Make in India: Rafale makers, Tata partner for fuselage manufacturingA dedicated facility will be established in Hyderabad to manufacture key structural sections of the aircraft, including the central fuselage, rear section, lateral rear shells and front section. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/ais-invisible-carbon-footprint-what-powering-smart-machines-is-costing-the-planet-2736392-2025-06-05",
      "headline": "AI's dirty secret: How your chatbot is draining Earth's water and energyArtificial Intelligence might feel like magic, but it's powered by very real, very energy-hungry machines. Training a single large AI model like GPT-4 can emit as much CO₂ as five cars over their lifetime. Behind every chatbot answer or AI-generated image lies massive server farms, often powered by non-renewable energy sources."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/assam-born-doctor-arrested-in-us-over-140-million-scam-has-troubled-history-sovereign-health-group-2736298-2025-06-05",
      "headline": "Assam-born doctor arrested in US over $150-million scam has troubled historyTonmoy Sharma, a 61-year-old doctor from Guwahati has been arrested in the US over an alleged $149-million healthcare fraud. Sharma moved to the US and founded the Sovereign Health Group after his medical licence was revoked in the UK in 2007 due to research misconduct."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/programme/democratic-newsroom/video/bengaluru-stampede-deaths-who-is-to-blame-democratic-newsroom-debates-2736358-2025-06-05",
      "headline": "Bengaluru stampede blame game: Where does the buck stop? Democratic Newsroom debatesThe big focus of this episode of Democratic Newsroom is the tragic stampede outside M Chinnaswamy Stadium in Bengaluru on Wednesday during Royal Challengers Bengaluru (RCB) team's victory parade after their maiden Indian Premier League (IPL) title win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trinamool-mp-mahua-moitra-marries-former-bjd-mp-pinaki-mishra-in-ceremony-abroad-2736117-2025-06-05",
      "headline": "So grateful: Trinamool's Mahua Moitra marries ex-BJD MP Pinaki Misra in GermanyMahua Moitra and BJD leader Pinaki Misra, both sitting Lok Sabha members, have reportedly married in a quiet overseas ceremony. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-coco-gauff-vs-lois-bosson-aryna-sabalenka-iga-swiatek-2736452-2025-06-05",
      "headline": "Gauff ends French wildcard's fairytale, sets up final vs Swiatek-slayer SabalenkaWorld No. 2 Coco Gauff brought an end to French wildcard Lois Bosson's dream run with a commanding win in their women's singles semi-final on Thursday. Earlier in the day in Paris, Aryna Sabalenka stunned Iga Swiatek, snapping the Polish star's 26-match unbeaten streak on the red clay."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-pacer-brydon-carse-reveals-he-considered-toe-amputation-amid-injury-woes-2736453-2025-06-05",
      "headline": "England pacer Brydon Carse reveals he considered toe amputation amid injury woesEngland pacer Brydon Carse has said he contemplated amputating a toe to overcome a persistent and painful injury that kept him out of action for months.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-reaction-sabalenka-loss-french-open-semi-final-2736437-2025-06-05",
      "headline": "Swiatek fortunate for dominant French Open run after rare loss vs SabalenkaIga Swiatek's 26-match winning streak at the French Open came to a screeching halt as her title defence ended on Thursday, but the Pole said she was happy to have enjoyed a glorious run at the claycourt Grand Slam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-test-captaincy-style-england-bazball-challenge-2736429-2025-06-05",
      "headline": "Not fazed by Bazball, Shubman Gill aims to craft own Test captaincy styleSpeaking in Mumbai on the eve of India's departure to England, new Test captain Shubman Gill said he will be focussed on maintaining clairty and comfort in the dressing room. Gill will lead India in a five-Test series, starting June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-novak-djokovic-vs-jannik-sinner-semifinal-live-streaming-2736340-2025-06-05",
      "headline": "Novak Djokovic vs Jannik Sinner: When and where to watch semifinalFrench Open 2025: 24-time Grand Slam champion Novak Djokovic and World No.1 Jannik Sinner will lock horns in the second men's singles semi-finals on Friday, June 6 at Court Philippe-Chatrier. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-luke-wright-england-vs-india-leeds-test-2736415-2025-06-05",
      "headline": "Jofra Archer could return for second Test vs India: Luke WrightENG vs IND: England national selector Luke Wright said that Jofra Archer is gradually recovering from his thumb injury and could be available for the Edgbaston Test against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-aryna-sabalenka-semi-final-french-open-2736397-2025-06-05",
      "headline": "Aryna Sabalenka ends Iga Swiatek's dream run, through to maiden finalFrench Open 2025: Aryna Sabalenka stormed into the final of the clay-court major after beating four-time champion Iga Swiatek in three sets on Thursday on Centre Court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pataudi-trophy-renamed-tendulkar-anderson-trophy-for-india-vs-england-tests-report-2736395-2025-06-05",
      "headline": "Pataudi Trophy renamed Tendulkar-Anderson Trophy for India vs England Tests: ReportThe India and England Test series will reportedly be played for a new trophy named after two cricketing legends, Sachin Tendulkar and James Anderson. Earlier, the winner of the bilateral Test series between India and England was awarded the Pataudi Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-jasprit-bumrah-test-series-gambhir-gambhir-no-4-batting-spot-2736385-2025-06-05",
      "headline": "Haven't yet decided on No. 4, Bumrah's workload in England Tests: Gautam GambhirIndia head coach Gautam Gambhir said that no final decision has been made yet regarding Jasprit Bumrah's workload or the No. 4 batting position for the upcoming five-match Test series against England, which begins on June 20.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/atiqa-mir-akcel-gp-10-year-old-indian-racing-prodigy-2736388-2025-06-05",
      "headline": "After F1, 10-year-old Indian racing prodigy gets backing from UAE-based AKCEL GP10-year-old racing prodigy, Atiqa Mir, received a big boost in her fast-growing racing career. AKCEL GP is a high-performance motorsport squad competing in FIA F4 and Formula Regional Middle East Championship besides FIA F3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-karun-nair-gautam-gambhir-press-conference-2736381-2025-06-05",
      "headline": "Gautam Gambhir hints at Karun Nair's Test return on England tour with extended runGautam Gambhir has hinted at Karun Nair's return to the Indian Test side during the England tour. Karun hit a double hundred while playing for India A against England Lions in a four-day practice game in Canterbury in June.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-aryna-sabalenka-semi-final-french-open-2736397-2025-06-05",
      "headline": "Aryna Sabalenka ends Iga Swiatek's dream run, through to maiden finalFrench Open 2025: Aryna Sabalenka stormed into the final of the clay-court major after beating four-time champion Iga Swiatek in three sets on Thursday on Centre Court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pataudi-trophy-renamed-tendulkar-anderson-trophy-for-india-vs-england-tests-report-2736395-2025-06-05",
      "headline": "Pataudi Trophy renamed Tendulkar-Anderson Trophy for India vs England Tests: ReportThe India and England Test series will reportedly be played for a new trophy named after two cricketing legends, Sachin Tendulkar and James Anderson. Earlier, the winner of the bilateral Test series between India and England was awarded the Pataudi Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-jasprit-bumrah-test-series-gambhir-gambhir-no-4-batting-spot-2736385-2025-06-05",
      "headline": "Haven't yet decided on No. 4, Bumrah's workload in England Tests: Gautam GambhirIndia head coach Gautam Gambhir said that no final decision has been made yet regarding Jasprit Bumrah's workload or the No. 4 batting position for the upcoming five-match Test series against England, which begins on June 20.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/atiqa-mir-akcel-gp-10-year-old-indian-racing-prodigy-2736388-2025-06-05",
      "headline": "After F1, 10-year-old Indian racing prodigy gets backing from UAE-based AKCEL GP10-year-old racing prodigy, Atiqa Mir, received a big boost in her fast-growing racing career. AKCEL GP is a high-performance motorsport squad competing in FIA F4 and Formula Regional Middle East Championship besides FIA F3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-karun-nair-gautam-gambhir-press-conference-2736381-2025-06-05",
      "headline": "Gautam Gambhir hints at Karun Nair's Test return on England tour with extended runGautam Gambhir has hinted at Karun Nair's return to the Indian Test side during the England tour. Karun hit a double hundred while playing for India A against England Lions in a four-day practice game in Canterbury in June.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-on-bengaluru-stampede-rcb-victory-parade-2736362-2025-06-05",
      "headline": "Gambhir on Bengaluru stampede: Never believed we needed roadshows to celebrateIndia head coach Gautam Gambhir called the Bengaluru stampede, which claimed 11 lives and injured nearly 50, a tragic event and said he has always believed that such open-road celebrations are unnecessary.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kapil-dev-bengaluru-stampede-rcb-ipl-bash-celebration-2736319-2025-06-05",
      "headline": "Kapil Dev on stampede during RCB IPL bash: Lives more important than celebrationFormer India captain Kapil Dev said both organisers and the public should exercise caution, urging them to prioritise safety over celebration. Eleven were killed and over 40 were injured in a stampede outside the M Chinnaswamy Stadium on Wednesday, June 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-rankireddy-chirag-shetty-indonesia-open-pv-sindhu-loss-2736315-2025-06-05",
      "headline": "Satwik and Chirag storm into Indonesia Open quarters as Sindhu exitsSatwiksairaj Rankireddy and Chirag Shetty kept India's hopes alive at the Indonesia Open with a gritty comeback win, entering the quarterfinals. However, it was a mixed day for the contingent, as PV Sindhu suffered a second-round exit following a hard-fought three-game loss in Jakarta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-semifinals-aryna-sabalenka-iga-swiatek-coco-gauff-live-updates-2736305-2025-06-05",
      "headline": "Semi-finals Highlights: Gauff ends Boisson dream, sets up Sabalenka finalFrench Open 2025 Live Updates: It's all over for Iga Swiatek. The four-time champion has lost a match at Roland Garros for the first time since 2021. She has been beaten in three sets by World No. 1 Aryna Sabalenka. Coco Gauff is currently taking on Lois Boisson, the wildcard, in the second semi-final.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-test-captaincy-england-series-ricky-ponting-reaction-2736293-2025-06-05",
      "headline": "Shubman Gill won't find Test captaincy easy, needs to work on batting: PontingAustralian great Ricky Ponting believes Shubman Gill still has work to do on his Test batting and, with the added responsibility of leading India on the upcoming tour of England, he would be better off moving down to number four in the batting order.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/firooza-amiri-afghanistan-women-cricket-exclusive-interview-taliban-2736248-2025-06-05",
      "headline": "From fear to fight: Firooza Amiri stands tall for Afghan women's cricketIn an exclusive interview, Firooza Amiri opened up on the challenges faced by the Afghanistan women's cricketers after the Taliban takeover in 2021 and how they fled their motherland and took exile in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-determined-to-take-rajasthan-royals-into-ipl-final-next-season-2736193-2025-06-05",
      "headline": "Vaibhav Suryavanshi determined to take Rajasthan into IPL final next seasonRajasthan Royals' (RR) teenage batting sensation Vaibhav Suryavanshi has vowed to double down his efforts for the next Indian Premier League (IPL) season to help the Rajasthan Royals (RR) qualify for the final."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bengaluru-stampede-rcb-compensation-rupees-10-lakh-2736198-2025-06-05",
      "headline": "RCB announces Rs 10 lakh each for stampede victims' families, fund for injuredRCB has announced a compensation of Rs. 10 Lakh for the familes of the victims of the stampede. The IPL 2025 champions also announced a support fund for the people who were injured during the tragedy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-test-captaincy-england-series-ricky-ponting-reaction-2736293-2025-06-05",
      "headline": "Shubman Gill won't find Test captaincy easy, needs to work on batting: PontingAustralian great Ricky Ponting believes Shubman Gill still has work to do on his Test batting and, with the added responsibility of leading India on the upcoming tour of England, he would be better off moving down to number four in the batting order.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/firooza-amiri-afghanistan-women-cricket-exclusive-interview-taliban-2736248-2025-06-05",
      "headline": "From fear to fight: Firooza Amiri stands tall for Afghan women's cricketIn an exclusive interview, Firooza Amiri opened up on the challenges faced by the Afghanistan women's cricketers after the Taliban takeover in 2021 and how they fled their motherland and took exile in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-determined-to-take-rajasthan-royals-into-ipl-final-next-season-2736193-2025-06-05",
      "headline": "Vaibhav Suryavanshi determined to take Rajasthan into IPL final next seasonRajasthan Royals' (RR) teenage batting sensation Vaibhav Suryavanshi has vowed to double down his efforts for the next Indian Premier League (IPL) season to help the Rajasthan Royals (RR) qualify for the final."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bengaluru-stampede-rcb-compensation-rupees-10-lakh-2736198-2025-06-05",
      "headline": "RCB announces Rs 10 lakh each for stampede victims' families, fund for injuredRCB has announced a compensation of Rs. 10 Lakh for the familes of the victims of the stampede. The IPL 2025 champions also announced a support fund for the people who were injured during the tragedy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachithra-senanayake-match-fixing-lanka-premier-league-2736197-2025-06-05",
      "headline": "Former KKR spinner indicted for match-fixing in Lanka Premier LeagueFormer Sri Lanka off-spinner Sachithra Senanayake, who was part of the Kolkata Knight Riders in IPL 2013, has been indicted for attempting to lure a fellow player into match-fixing during the 2020 edition of the Lanka Premier League (LPL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-wpl-womens-cricket-revenues-2736174-2025-06-05",
      "headline": "Support for WPL shows that women's cricket can generate revenues: Smriti MandhanaSmriti Mandhana said the growth of the Women's Premier League (WPL) shows that women's cricket has progressed and people are now willing to invest in the women's game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-pep-guardiola-third-place-finish-2736162-2025-06-05",
      "headline": "Manchester City's 3rd place finish in 2024/25 better than title win: Pep GuardiolaPep Guardiola has dismissed the notion that the 2024-25 season was disastrous and said the third-place finish was better than his last title win. City failed to win a trophy last season and barely got into the Champions League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-waited-for-only-18-years-sachin-tendulkars-wait-was-even-longer-sehwag-2736144-2025-06-05",
      "headline": "Kohli waited for only 18 years, Sachin Tendulkar's wait was even longer: SehwagFormer India cricketer Virender Sehwag has compared Virat Kohli's wait for an IPL title with Sachin Tendulkar's World Cup wait saying that the latter had to wait even longer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-squad-india-tests-jamie-overton-squad-2736124-2025-06-05",
      "headline": "England name squad for 1st India Test, all-rounder returns after 3 yearsChris Woakes, Jamie Overton and Jamie Overton made their comebacks as England named their squad for the opening Test against India to be held from June 20 at Headingley in Leeds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/eng-vs-ind-press-conference-live-gautam-gambhir-shubman-gill-2736120-2025-06-05",
      "headline": "England tour presser Highlights: Gambhir says no to roadshows after Bengaluru stampedeIndia tour of England pre-departure press conference highlights: India's new Test captain Shubman Gill says that India will definitely miss Rohit Sharma and Virat Kohli on the England tour but the squad has a good mix of experience and youth to challenge the hosts in the five-match Test series. Coach Gautam Gambhir says that Indian team management has not decided which three Test matches Jasprit Bumrah will be playing in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-smriti-mandhana-rcb-bengaluru-stampede-2736110-2025-06-05",
      "headline": "Bengaluru stampede: Mandhana heartbroken as chaos unfolds after IPL finalIndian women's cricketer Smriti Mandhana reacted to the tragic stampede outside the M Chinnaswamy Stadium in Bengaluru, which took place after Royal Challengers Bengaluru (RCB) won their maiden Indian Premier League (IPL) title by defeating Punjab Kings in the final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-strike-rate-rcb-title-win-cheteshwar-pujara-2736109-2025-06-05",
      "headline": "Evolved batter Virat Kohli shut down strike-rate critics in IPL 2025: Cheteshwar PujaraCheteshwar Pujara feels that Virat Kohli evolved as a batter during the IPL 2025 season and shut down his strike-rate critics with his performance. Kohli played a starring role as RCB won the IPL title for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/madan-lal-blasts-rcb-over-chaotic-planning-of-ipl-victory-celebrations-2736054-2025-06-05",
      "headline": "Madan Lal blasts RCB over chaotic planning of IPL victory celebrationsFormer India cricketer and 1983 World Cup winner Madan Lal has slammed Royal Challengers Bengaluru (RCB) for their poor planning of the IPL victory celebrations in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-virat-kohli-rcb-rajat-patidar-bengaluru-2736056-2025-06-05",
      "headline": "IPL final: Undoubtedly Virat Kohli's night, but RCB mates deserved moreVirat Kohli was undoubtedly the main man on the night of RCB's ultimate triumph. But there were others who deserved recognition as well. Kohli seemed to sense the stories left untold even in the haze of victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-champions-league-rcb-psg-virat-kohli-luis-enrique-2736028-2025-06-05",
      "headline": "RCB win IPL 2025, PSG clinch Champions League: Two iconic triumphs, one blueprintIn a year when glitter gave way to grit, RCB and PSG finally ended their painful waits. By trading star power for structure, both sides found glory, not through individuals, but as a team."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-magnus-carlsen-angry-d-gukesh-viswanathan-anand-2736006-2025-06-05",
      "headline": "Magnus Carlsen wanted to draw line in sand by beating D Gukesh: Viswanathan AnandViswanathan Anand feels that Magnus Carlsen wanted to draw a line in the sand by beating D Gukesh and that was the reason behind his outburst during the Norway Chess. Carlsen produced an angry reaction after he was beaten by Gukesh recently in the tournament. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}