{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/crorepati-on-paper-cash-poor-in-reality-ca-explains-why-liquidity-matters-more-than-net-worth-2772767-2025-08-18",
      "headline": "Crorepati on paper, cash-poor in reality? CA explains why liquidity matters moreA high net worth can be misleading if most of your wealth is tied up in property or long-term investments. An expert believes that true financial security comes from having liquid assets that can be accessed at short notice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-cut-tax-slabs-low-reforms-rationalisation-insurance-everyday-item-cars-appliance-tv-money-2772777-2025-08-18",
      "headline": "GST cut before Diwali? These items likely to cost you less this festive seasonPrime Minister Narendra Modi gave the first indication of GST reforms in his Independence Day address from the Red Fort, calling it a \"Diwali Bonanza.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/sunjay-kapurs-sister-raises-concern-over-treatment-of-family-claims-being-sidelined-2772711-2025-08-18",
      "headline": "Exclusive: Sunjay Kapur's sister raises concern over treatment of familyMandhira Kapur Smith, sister of late Sona Comstar Chairperson Sunjay Kapur, has raised concerns over her family's treatment by the automotive firm founded by their late father. She said her 80-year-old mother Rani Kapur has been sidelined, claiming the family has been treated \"like strangers\" and excluded from obituaries and public acknowledgments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/big-gst-cuts-ahead-will-small-cars-insurance-get-cheaper-2772687-2025-08-18",
      "headline": "Big GST cuts ahead: Will small cars, insurance get cheaper?The proposal to reduce GST on insurance premiums could make health and life cover more affordable. Industry experts say this would be a welcome change and could help improve insurance penetration across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-6-excel-utility-now-live-who-is-eligible-to-file-2772650-2025-08-18",
      "headline": "ITR-6 excel utility now live: Who is eligible to file?The Income Tax Department has rolled out the excel utility for ITR-6 for AY 2025-26. But this form isn't meant for everyone — here's who is required to use it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/regaal-resources-ipo-allotment-out-today-status-online-guide-gmp-listing-gains-stock-market-debut-date-2772642-2025-08-18",
      "headline": "Regaal Resources IPO allotment today: Check status, GMP & listing dateInvestors who applied for the IPO can check their allotment status either through the BSE website or the registrar's platform, MUFG Intime India Private Limited (previously known as Link Intime India Pvt Ltd)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-up-1000-points-nifty-jump-stock-market-rally-auto-maruti-suzuki-mahindra-tata-motors-bajaj-gst-reform-diwali-2772619-2025-08-18",
      "headline": "Maruti Suzuki rallies 8%: Why GST relief is driving auto stocks higherEarly trade clearly showed strong buying in auto and financial stocks, while IT and pharma names dragged at the bottom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-sensex-jumps-1000-points-simpler-gst-regime-credit-rating-boost-2772615-2025-08-18",
      "headline": "Sensex jumps 1,000 points: Why is stock market rising today?At 9:24 am, the S&P BSE Sensex was up 950.18 points at 81,547.84, while the NSE Nifty50 jumped 310 points to 24,941.90. Broader market indices also gained as investors cheered the prospects of a simplified GST regime and an upgrade in India's sovereign credit rating by S&P."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-rallies-893-points-nifty-above-24900-maruti-suzuki-share-price-jumps-6-percent-2772611-2025-08-18",
      "headline": "Sensex, Nifty surge as PM hints at GST reforms by Diwali; Maruti jumps 7%The S&P BSE Sensex was up 1,062.91 points to 81,659.75, while the NSE Nifty50 jumped 356 points to 24,987.30 as of 9:32 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mandhira-kapur-family-excluded-sona-comstar-after-sunjay-kapur-death-2772541-2025-08-17",
      "headline": "Treated like strangers: Sunjay Kapur's sister alleges family sidelined by companyMandhira Kapur Smith alleged that the family has been treated as strangers and everyone's forgotten the legacy, forgotten that her mother's still alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/should-you-let-ai-analyse-your-online-spending-habits-ai-and-spending-habits-ai-for-budgeting-ai-personal-finance-tools-2772315-2025-08-17",
      "headline": "Should you let AI analyse your online spending habits?Artificial intelligence is gradually slipping into our wallets. From tracking what we buy to predicting our next expense, AI-based tools are becoming popular. But should you really let AI analyse your online spending habits?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/trade-deal-talks-hit-roadblock-as-us-delegations-india-visit-could-be-delayed-2772307-2025-08-17",
      "headline": "Trade deal talks hit roadblock as US delegation's India visit could be delayedThe India-US trade deal talks face a potential roadblock as the US delegation may delay its August 25 visit to India. This postponement impacts scheduled negotiations that were crucial for preventing additional tariffs. A 50% tariff on Indian goods is set to take effect from August 27. Currently, a 25% tariff is already in place, impacting exporters. The deferment of the meeting does not signify cancellation, but rather a delay. Reasons for the delay could be operational or related to geopolitical outcomes. \"A 50% tariff will be imposed on us from August 27 in totality.\" The BTA deal is anticipated by the end of September or October, with expectations for a meeting by the end of August, contingent on geopolitical developments."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-bengal-files-shows-gopal-mukherjee-as-a-hero-vivek-agnihotri-hits-back-at-fir-2772822-2025-08-18",
      "headline": "The Bengal Files shows Gopal Mukherjee as a hero: Vivek Agnihotri hits back at FIRVivek Agnihotri set the record straight at a press conference in Delhi. The director of 'The Bengal Files' clarified that his film doesn't insult Gopal Mukherjee, but celebrates his legacy. His response came after Mukherjee's grandson filed an FIR against him in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-guzaara-song-tiger-shroff-harnaaz-sandhu-recreate-punjabi-song-tera-bina-na-guzaara-e-2772706-2025-08-18",
      "headline": "Baaghi 4 song Guzaara: Tiger Shroff, Harnaaz Sandhu recreate a Punjabi hit'Guzaara', the first song from 'Baaghi 4', was released on Monday. Featuring actor Tiger Shroff with debutant Harnaaz Sandhu, the song is a Hindi version of a hit Punjabi song. 'Baaghi 4' is scheduled for a theatrical release on September 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-bengal-files-trailer-launch-controversy-pallavi-joshi-mamata-banerjee-government-action-unconstitutional-2772791-2025-08-18",
      "headline": "Unconstitutional: Pallavi Joshi slams police action at Bengal Files trailer launchActor-producer Pallavi Joshi criticised the West Bengal government and police for stopping the trailer launch of 'The Bengal Files' in Kolkata on August 16. While recalling the incident at a press conference in Delhi, she called it arbitrary and unconstitutional. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/hanumankind-says-his-viral-track-big-dawgs-was-a-byproduct-of-effort-not-luck-2772774-2025-08-18",
      "headline": "Hanumankind says his viral track Big Dawgs was a byproduct of effort, not luckRapper Hanumankind, known for his hit 'Big Dawgs', reflected on his musical journey as one of persistence and evolution rather than sudden fame. His latest project 'Monsoon Season' captures a range of emotions tied to personal memories. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-praises-s-jaishankar-on-kbc-independence-day-special-episode-2772732-2025-08-18",
      "headline": "Amitabh Bachchan praises S Jaishankar on KBC Independence Day special episodeOn the 'Kaun Banega Crorepati' Independence Day special, Amitabh Bachchan praised External Affairs Minister S Jaishankar, comparing his strong diplomatic style to that of an Army officer. The episode also featured three women officers from the armed forces who played key roles in Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-bengal-files-controversy-explained-vivek-agnihotri-kolkata-1946-riots-2772718-2025-08-18",
      "headline": "The Bengal Files row explained: Why Vivek Agnihotri's film is facing backlashVivek Agnihotri's film 'The Bengal Files' has stirred controversy over its portrayal of 1946 riots. The movie faces backlash over historical accuracy and portrayal of key figures, with legal notices and public debates intensifying ahead of its September release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ali-fazal-new-crime-thriller-raakh-announced-first-look-out-2772727-2025-08-18",
      "headline": "Ali Fazal dons the khaki in Prime Video's new series Raakh. See first-look posterPrime Video is set to premiere 'Raakh', a gripping Indian investigative crime thriller starring Ali Fazal, Sonali Bendre, and Aamir Bashir, in 2026. The series is directed by Anusha Nandakumar and Sandeep Saket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-2026-return-classic-hindi-cinema-vacation-photo-2772672-2025-08-18",
      "headline": "It's in my DNA: Karan Johar promises 2026 return with classic Hindi cinemaFilmmaker Karan Johar has planned to return to film sets in 2026. He now has his eyes set on classic old-school Hindi cinema. Sharing photos from his latest holiday, Johar described this as his true calling and passion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-box-office-collection-day-4-detailed-report-hrithik-roshan-jr-ntr-film-faces-drop-on-1st-sunday-2772722-2025-08-18",
      "headline": "War 2 box office Day 4: Hrithik-Jr NTR's film faces expected drop on 1st Sunday'War 2' has begun its journey towards a box office slump. The film has collected Rs 173 crore, but business has been dropping since Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rao-bahadur-teaser-satyadev-avatar-impresses-in-venkatesh-mahas-mystical-drama-2772703-2025-08-18",
      "headline": "Rao Bahadur teaser: Satyadev's avatar impresses in Venkatesh Maha's mystical dramaThe teaser of 'Rao Bahadur', directed by Venkatesh Maha and presented by Mahesh Babu, has been released. Set for release in summer 2026, the film aims to redefine Pan-India cinema with Satya Dev's bold performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rapper-vedan-sexual-assault-complaint-two-more-women-2772719-2025-08-18",
      "headline": "Two more women file sexual assault complaints against rapper VedanTwo additional women have come forward accusing rapper Vedan of sexual assault, with complaints sent to Kerala Chief Minister Pinarayi Vijayan. Vedan remains absconding as police continue investigations following earlier allegations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-tamannaah-bhatia-arrive-in-style-at-mumbai-airport-click-pics-with-fans-2772698-2025-08-18",
      "headline": "Janhvi Kapoor, Tamannaah arrive in style at Mumbai airport, click pics with fansTamannaah Bhatia and Janhvi Kapoor were clicked together at Mumbai airport, delighting fans with their friendly camaraderie and stylish appearances. Both actors shared warm moments and smiles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farhan-akhtar-on-naseeruddin-shah-criticism-of-his-acting-2772697-2025-08-18",
      "headline": "Farhan Akhtar on Naseeruddin's criticism of his acting: Why should I reach outFarhan Akhtar has responded to Naseeruddin Shah's past criticism of his films and acting, explaining why he chose not to reach out. He said the remarks lacked respect and constructive intent, and emphasised that feedback should come from a place of care and love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-box-office-collection-day-4-rajinikanth-2772686-2025-08-18",
      "headline": "Coolie box office Day 4: Rajinikanth's film eyes Rs 200 crore, crucial Monday aheadSuperstar Rajinikanth's 'Coolie' has been witnessing a dip in collection ever since it hit theatres. However, the film is just days away from hitting the Rs 200 crore-mark nett in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kbc-17-uttarakhands-aditya-kumar-becomes-season-1st-crorepati-eyes-rs-7-crore-2772657-2025-08-18",
      "headline": "KBC 17: Uttarakhand's Aditya Kumar becomes season's 1st crorepati, eyes Rs 7 croreUttarakhand's Aditya Kumar becomes the first contestant this season to win Rs 1 crore on Kaun Banega Crorepati and attempts the Rs 7 crore question."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/got7jackson-wang-rushed-hospital-fan-signing-event-cancelled-2772635-2025-08-18",
      "headline": "GOT7's Jackson Wang hospitalised due to illness, cancels scheduled fan meetingK-pop group GOT7 member Jackson Wang was admitted to the hospital due to food poisoning and has been advised to rest. It led to the cancellation of his planned fan signing event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-marks-robert-de-niro-birthday-with-emotional-instagram-post-2772629-2025-08-18",
      "headline": "Anupam Kher shares nostalgic pics, moving note on friend Robert De Niro's birthdayAnupam Kher shared a heartfelt birthday tribute to Hollywood legend Robert De Niro, highlighting their friendship and De Niro's global influence on actors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/leonardo-dicaprio-vittoria-ceretti-yacht-trip-formentera-balearic-islands-2772607-2025-08-18",
      "headline": "Leonardo DiCaprio-Vittoria Ceretti soak up the sun on yacht during Spain getawayLeonardo DiCaprio and Vittoria Ceretti enjoyed a public display of affection during a yacht trip, marking a rare public appearance of their relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanika-kapoor-says-singers-earn-rs-101-for-songs-india-2772614-2025-08-18",
      "headline": "Singer Kanika Kapoor says singers earn just Rs 101 for songs in IndiaPopular singer Kanika Kapoor has opened up about the financial hardships faced by vocalists in the Indian music industry. She revealed that many singers receive minimal payments and rely mainly on live shows for income."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-never-seen-before-images-show-how-pak-retreated-during-2772726-2025-08-18",
      "headline": "Exclusive: As Op Sindoor peaked, Pak Navy took a backseat, satellite imagery showsNew commercial satellite imagery analysed by India Today's OSINT team shows Pak Navy warships dispersed to commercial docks while others took refuge at its western port of Gwadar, close to the Iranian border."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/imd-weather-mumbai-rain-red-alert-maharashtra-red-alert-heavy-downpour-2772648-2025-08-18",
      "headline": "Avoid outdoors: Mumbai hit with heavy rain, schools, colleges shut  Live UpdatesAmid the alert, the Greater Mumbai Police Chief advised caution, saying, \"As heavy rainfall continues under the Orange Alert, incidents of waterlogging and reduced visibility are being reported from multiple areas.\" He further warned people against unnecessary travel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/parliament-honours-shubhanshu-shuklas-space-feat-amid-oppositions-uproar-2772812-2025-08-18",
      "headline": "Parliament honours Shubhanshu Shukla amid Opposition's uproarThe special discussion, held just a day after Shukla's celebrated homecoming to New Delhi, was marked by accolades and a palpable mood of national pride, despite a boycott by opposition parties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-zelenskyy-rematch-europe-backs-kyivs-gamble-in-high-stakes-white-house-test-2772613-2025-08-18",
      "headline": "Trump–Zelenskyy Take 2: Europe joins Kyiv's White House gambleThis is no routine summit. It is a test of balance, of language, and of restraint. Volodymyr Zelenskyy must argue Ukraine's case without provoking Donald Trump, who has made clear his conditions for \"peace\" may come at Kyiv's expense. Both sides know they cannot afford another collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/cp-radhakrishnan-nda-vice-president-nominee-bjp-south-politics-tamil-nadu-2772689-2025-08-18",
      "headline": "The subtle wooing of Tamil Nadu and what Radhakrishnan brings to the Veep tableFrom Coimbatore to Delhi's power corridors, CP Radhakrishnan's rise as NDA's Vice-President nominee blends strategy, symbolism, and subtle wooing of Tamil Nadu, all aimed at shaping the BJP's political narrative in the south."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/opposition-may-move-impeachment-motion-against-chief-election-commissioner-amid-vote-chori-row-sources-2772656-2025-08-18",
      "headline": "Opposition may seek impeachment of poll body chief over 'vote chori': SourcesMeanwhile, CEC Gyanesh Kumar on Sunday strongly countered allegations of electoral fraud levelled by the Congress and its leader Rahul Gandhi, defending the integrity of India's voting process."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/vladimir-putin-donald-trump-bodyguards-poop-suitcases-health-secrets-hide-alaska-meeting-2772773-2025-08-18",
      "headline": "Putin's bodyguards carried 'poop suitcase' to Alaska meet with Trump: ReportMembers of the Russian President's Federal Protection Service (FPS) collect Russian President Vladimir Putin's waste, including his poop, store it in special bags and bring it back to Moscow in dedicated suitcases, a report by The Express US, which cited investigative journalists Mikhail Rubin and Regis Gente in French publication Paris Match, said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saswata-chatterjee-delhi-files-to-bengal-files-not-in-my-hands-2772598-2025-08-18",
      "headline": "Not a historian: Bengal Files actor Saswata Chatterjee distances himself from rowDisassociating himself with the 'The Bengali Files' controversy, Bengali actor Saswata Chatterjee said the Vivek Agnihotri film was initially titled 'The Delhi Files'. He said he wasn't aware of the film's story or the reason behind its title change at the last minute. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/are-weightloss-drugs-for-me-5-things-to-consider-anti-obesity-india-2772571-2025-08-18",
      "headline": "Are weightloss drugs for me? 5 things to considerAnti-obesity drugs like GLP-1 are quite popular now. But, do you really need it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/om-birla-lok-sabha-public-destroy-government-property-sloganeering-opposition-bihar-sir-vote-theft-election-commission-2772690-2025-08-18",
      "headline": "Public didn't elect you to wreck property: Om Birla to sloganeering Opposition MPsLok Sabha Speaker Om Birla rebuked Opposition MPs as they fiercely sloganeered in the well of the House soon after the proceedings resumed on Monday, warning them with strict action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-tariff-india-russian-oil-china-putin-alska-meet-marco-rubio-2772578-2025-08-18",
      "headline": "Spare China but hit India: US Secretary of State defends Russian oil hypocrisySpeaking to Fox News on August 17, Marco Rubio cautioned that targeting Chinese refiners would have disruptive consequences for the global oil market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-t20-squad-selection-key-player-debates-sky-gill-bumrah-2772667-2025-08-18",
      "headline": "Asia Cup squad selection buzz: Big calls, bold omissions awaitAsia Cup 2025 squad selection: The selectors and team management face a tough task of picking 15 from India's vast pool of T20 talent. Will Test captain Shubman Gill make the cut? Will Jasprit Bumrah play? What about Rinku Singh? All will be revealed on Tuesday, August 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/first-order-thinking-pitfalls-of-jugaad-and-why-india-fails-to-fix-roads-2772693-2025-08-18",
      "headline": "First-order thinking, pitfalls of jugaad, and why India fails to fix roadsEvery day it seems that problems in India are endless with no solutions in sight. Are we doomed to live with these problems, even the recurring problems like waterlogged roads, forever? Maybe not but definitely until we keep relying on jugaad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/get-affiliated-with-state-education-board-before-july-1-or-face-closure-uttarakhands-order-for-all-madrasas-2772733-2025-08-18",
      "headline": "Get state board affiliation by July 1 or face closure: Uttarakhand to madrassasThe Uttarakhand government stated that only after madrassas apply to the Uttarakhand State Minority Education Authority will they be able to seek recognition as minority educational institutions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-donald-trump-balochistan-bla-terror-tag-leverage-against-india-asim-munir-pakistan-india-relations-explained-2772516-2025-08-18",
      "headline": "Will Trump use this Pakistani tool as leverage against India?Pakistan has already started using the US State Department's 'foreign terror organisation' tag on the Balochistan Liberation Army and the Majeed Brigade against India. Will the Trump White House try to use the tag and Pakistan's claims as leverage against India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-live-updates-voter-roll-veep-election-in-focus-as-houses-to-reconvene-after-6-day-break-2772641-2025-08-18",
      "headline": "Live: Lok Sabha adjourned as Opposition sloganeers during Shubhanshu Shukla discussionThe Monsoon Session, which has witnessed multiple adjournments since its start, resumed today. The Opposition MPs have been protesting against the Special Intensive Revision (SIR) in Bihar and their demand for a debate on the same has repeatedly been turned down by the Centre. Today, there will be a special discussion on India's first astronaut aboard the International Space Station and the critical role of the space programme in achieving a Viksit Bharat by 2047. Also scheduled is the introduction of the Jan Vishwas (Amendment) Bill, 2025, aimed at decriminalising minor offences to improve the ease of living and doing business. Union Commerce and Industry Minister Piyush Goyal will pilot the Bill in the Lower House. Both Houses, which were adjourned on August 12 after a week-long standoff. Stay tuned to indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-cut-tax-slabs-low-reforms-rationalisation-insurance-everyday-item-cars-appliance-tv-money-2772777-2025-08-18",
      "headline": "GST cut before Diwali? These items likely to cost you less this festive seasonPrime Minister Narendra Modi gave the first indication of GST reforms in his Independence Day address from the Red Fort, calling it a \"Diwali Bonanza.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manisha-murder-case-haryana-bhiwani-singhani-19-playschool-teacher-protests-nayab-singh-saini-selja-2772746-2025-08-18",
      "headline": "All about Manisha case: Protests in Haryana as teacher, 19, found with slit throatThe murder of 19-year-old teacher Manisha in Bhiwani's Singhani village has triggered massive protests, with villagers blocking roads and holding mahapanchayats. Her family, alleging police inaction, have refused to hold a funeral. The NHRC has sought a report, and opposition parties are attacking the Haryana government. Here's all about the Manisha case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/story/volvo-ex30-review-small-car-big-statement-2772601-2025-08-18",
      "headline": "Volvo EX30 Review: Small Car, Big StatementThe Volvo EX30 isn't trying to be everything to everyone—it's a small, stylish EV that knows exactly where it stands. The trick will be in delivering just enough of everything you actually need and not charging you for the extra. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/no-nato-zelenskyy-can-end-war-with-russia-immediately-trump-ahead-of-meeting-with-ukrainian-president-2772576-2025-08-18",
      "headline": "'Forget Nato, Crimea': Is Trump throwing Zelenskyy under the bus for Russia deal?Surprisingly, Trump's remarks ahead of his meeting with Zelenskyy came even after his special envoy, Steve Witkoff, said that Moscow was willing to let the US and its European allies provide Nato-style security guarantees to Kyiv as part of a potential peace deal, describing the development as \"game-changing.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-bengal-files-controversy-explained-vivek-agnihotri-kolkata-1946-riots-2772718-2025-08-18",
      "headline": "The Bengal Files row explained: Why Vivek Agnihotri's film is facing backlashVivek Agnihotri's film 'The Bengal Files' has stirred controversy over its portrayal of 1946 riots. The movie faces backlash over historical accuracy and portrayal of key figures, with legal notices and public debates intensifying ahead of its September release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/big-gst-cuts-ahead-will-small-cars-insurance-get-cheaper-2772687-2025-08-18",
      "headline": "Big GST cuts ahead: Will small cars, insurance get cheaper?The proposal to reduce GST on insurance premiums could make health and life cover more affordable. Industry experts say this would be a welcome change and could help improve insurance penetration across the country."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/watchmaker-swatch-under-fire-asian-model-slanted-eye-pose-omega-tissot-campaign-revenue-2772666-2025-08-18",
      "headline": "Why model's slanted-eye ad sparked backlash, made Swatch apologiseWatchmaker Swatch was forced to pull an ad and apologise after an Asian model's \"slanted eye\" gesture sparked outrage in China. The ad was condemned as racist and triggered boycott calls. The backlash follows a pattern of consumer-led boycotts in China against global brands over cultural insensitivity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/ap-tdp-mla-d-venkateswara-prasad-faces-protests-over-jr-ntr-audio-denies-insulting-him-after-audio-clip-goes-viral-2772651-2025-08-18",
      "headline": "TDP legislator denies insulting actor Jr NTR after viral audio clip sparks protestsAn alleged audio clip of TDP MLA D Venkateswara Prasad insulting Jr NTR went viral in Andhra Pradesh's Anantapur, prompting fans to protest, though the legislator denied the remarks and offered regret."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-bengal-files-shows-gopal-mukherjee-as-a-hero-vivek-agnihotri-hits-back-at-fir-2772822-2025-08-18",
      "headline": "The Bengal Files shows Gopal Mukherjee as a hero: Vivek Agnihotri hits back at FIRVivek Agnihotri set the record straight at a press conference in Delhi. The director of 'The Bengal Files' clarified that his film doesn't insult Gopal Mukherjee, but celebrates his legacy. His response came after Mukherjee's grandson filed an FIR against him in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-guzaara-song-tiger-shroff-harnaaz-sandhu-recreate-punjabi-song-tera-bina-na-guzaara-e-2772706-2025-08-18",
      "headline": "Baaghi 4 song Guzaara: Tiger Shroff, Harnaaz Sandhu recreate a Punjabi hit'Guzaara', the first song from 'Baaghi 4', was released on Monday. Featuring actor Tiger Shroff with debutant Harnaaz Sandhu, the song is a Hindi version of a hit Punjabi song. 'Baaghi 4' is scheduled for a theatrical release on September 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-bengal-files-trailer-launch-controversy-pallavi-joshi-mamata-banerjee-government-action-unconstitutional-2772791-2025-08-18",
      "headline": "Unconstitutional: Pallavi Joshi slams police action at Bengal Files trailer launchActor-producer Pallavi Joshi criticised the West Bengal government and police for stopping the trailer launch of 'The Bengal Files' in Kolkata on August 16. While recalling the incident at a press conference in Delhi, she called it arbitrary and unconstitutional. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-bengal-files-controversy-explained-vivek-agnihotri-kolkata-1946-riots-2772718-2025-08-18",
      "headline": "The Bengal Files row explained: Why Vivek Agnihotri's film is facing backlashVivek Agnihotri's film 'The Bengal Files' has stirred controversy over its portrayal of 1946 riots. The movie faces backlash over historical accuracy and portrayal of key figures, with legal notices and public debates intensifying ahead of its September release."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rajeev-ram-cincinnati-open-vivek-ramaswamy-doubles-2772804-2025-08-18",
      "headline": "Rajeev Ram wins Cincinnati Open, USA star recalls playing with 41-year-oldAmerican politician and entrepreneur Vivek Ramaswamy congratulated 41-year-old Rajeev Ram on winning the men's doubles crown at the 2025 Cincinnati Open, praising his resilience and decorated career. Ram and partner Nikola Mektic beat Italians Lorenzo Sonego and Lorenzo Musetti in the final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-squad-selection-vaibhav-suryavanshi-kris-srikkanth-2772793-2025-08-18",
      "headline": "Don't wait on Vaibhav Suryavanshi: Ex-captain urges 14-year-old's Asia Cup call-upAsia Cup 2025: Former India captain Kris Srikkanth has urged selectors to include 14-year-old Vaibhav Suryavanshi in the Asia Cup squad. India will announce their squad on Tuesday, August 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-south-africa-dewald-brevis-odi-debut-temba-bavuma-2772789-2025-08-18",
      "headline": "AUS vs SA: Brevis ODI debut hint dropped by South Africa captain BavumaSouth Africa captain Temba Bavuma has hinted that Dewald Brevis is in line to make his ODI debut for the Proteas during the upcoming series against Australia. Brevis produced a stunning performance during the T20I series against the Aussies.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/washington-sundar-praises-young-indian-cricket-team-unity-england-tour-2772752-2025-08-18",
      "headline": "Individuals stepped up to win matches: Sundar reflects on India's fight in EnglandAll-rounder Washington Sundar praised the young Indian squad that toured England during the recently concluded Anderson-Tendulkar Trophy, saying it was full of energy and a strong sense of togetherness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pkl-2025-haryana-steelers-squad-jaideep-dahiya-captain-rahul-sethpal-2772740-2025-08-18",
      "headline": "PKL: Haryana Steelers announce Jaideep Dahiya as captain ahead of season 12Haryana Steelers have named Jaideep Dahiya as captain and Rahul Sethpal as vice-captain for PKL 2025 Season 12. The Steelers are aiming to retain their PKL crown. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sonny-baker-hat-trick-hundred-manchester-originals-england-call-up-2772723-2025-08-18",
      "headline": "After maiden England call-up, Sonny Baker shines with hat-trick in HundredSonny Baker lit up The Hundred with a stunning hat-trick that fired Manchester Originals to a 57-run win, just days after receiving his maiden England call-up. Baker's rise has been fuelled by raw pace, swing, and standout domestic performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/atletico-madrid-la-liga-opener-espanyol-diego-simeone-reaction-2772705-2025-08-18",
      "headline": "Diego Simeone optimistic despite Atletico's season-opening loss to EspanyolAtletico Madrid manager Diego Simeone remained optimistic despite his team starting their La Liga campaign with a 2–1 defeat to Espanyol. This marks Atletico's first opening-day loss under Simeone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-carlos-alcaraz-us-open-cincinnati-open-final-2772694-2025-08-18",
      "headline": "Sinner, Alcaraz brace for yet another final before US Open festivalJannik Sinner and Carlos Alcaraz are set for another blockbuster final at the Cincinnati Open, their fourth title clash of 2025 and 14th meeting overall. With Alcaraz leading the rivalry 8-5 but Sinner riding the high of his historic Wimbledon triumph, Monday's showdown promises to be a gripping prelude to the US Open.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/neymar-cries-santos-6-0-loss-vasco-slams-team-attitude-2772685-2025-08-18",
      "headline": "Watch: Neymar Jr. breaks down in tears after Santos get thrashed 0-6 by VascoNeymar broke down in tears after Santos' 6-0 loss to Vasco da Gama. The star slammed the team's \"terrible attitude\" as Santos sacked coach Cleber Xavier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-t20-squad-selection-key-player-debates-sky-gill-bumrah-2772667-2025-08-18",
      "headline": "Asia Cup squad selection buzz: Big calls, bold omissions awaitAsia Cup 2025 squad selection: The selectors and team management face a tough task of picking 15 from India's vast pool of T20 talent. Will Test captain Shubman Gill make the cut? Will Jasprit Bumrah play? What about Rinku Singh? All will be revealed on Tuesday, August 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-cincinnati-open-wta-finals-2772655-2025-08-18",
      "headline": "Swiatek qualifies for WTA Finals with final berth in Cincinnati OpenIga Swiatek has secured her spot in the 2025 WTA Finals, marking her fifth consecutive appearance at the season-ending event. She reached the final of the Cincinnati Masters, where she'll face Italy's Jasmine Paolini, after defeating Elena Rybakina in the semifinals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/atletico-madrid-la-liga-opener-espanyol-diego-simeone-reaction-2772705-2025-08-18",
      "headline": "Diego Simeone optimistic despite Atletico's season-opening loss to EspanyolAtletico Madrid manager Diego Simeone remained optimistic despite his team starting their La Liga campaign with a 2–1 defeat to Espanyol. This marks Atletico's first opening-day loss under Simeone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-carlos-alcaraz-us-open-cincinnati-open-final-2772694-2025-08-18",
      "headline": "Sinner, Alcaraz brace for yet another final before US Open festivalJannik Sinner and Carlos Alcaraz are set for another blockbuster final at the Cincinnati Open, their fourth title clash of 2025 and 14th meeting overall. With Alcaraz leading the rivalry 8-5 but Sinner riding the high of his historic Wimbledon triumph, Monday's showdown promises to be a gripping prelude to the US Open.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/neymar-cries-santos-6-0-loss-vasco-slams-team-attitude-2772685-2025-08-18",
      "headline": "Watch: Neymar Jr. breaks down in tears after Santos get thrashed 0-6 by VascoNeymar broke down in tears after Santos' 6-0 loss to Vasco da Gama. The star slammed the team's \"terrible attitude\" as Santos sacked coach Cleber Xavier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-t20-squad-selection-key-player-debates-sky-gill-bumrah-2772667-2025-08-18",
      "headline": "Asia Cup squad selection buzz: Big calls, bold omissions awaitAsia Cup 2025 squad selection: The selectors and team management face a tough task of picking 15 from India's vast pool of T20 talent. Will Test captain Shubman Gill make the cut? Will Jasprit Bumrah play? What about Rinku Singh? All will be revealed on Tuesday, August 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-cincinnati-open-wta-finals-2772655-2025-08-18",
      "headline": "Swiatek qualifies for WTA Finals with final berth in Cincinnati OpenIga Swiatek has secured her spot in the 2025 WTA Finals, marking her fifth consecutive appearance at the season-ending event. She reached the final of the Cincinnati Masters, where she'll face Italy's Jasmine Paolini, after defeating Elena Rybakina in the semifinals."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}