{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-nbfc-stocks-may-offer-stability-in-choppy-markets-bajaj-finance-bajaj-finserv-cholamandalam-holdings-2686391-2025-02-27",
      "headline": "Explained: Why NBFC stocks may offer stability in choppy marketsThe RBI's decision to ease certain loan rules and delay stricter regulations on capital requirements has improved sentiment in the financial sector. This has made NBFC stocks attractive options for investors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-drops-over-10-percent-this-week-5-reasons-behind-this-fall-2686345-2025-02-27",
      "headline": "Bitcoin sees 10% drop this week: 5 reasons behind the fallThe largest crypto has witnessed a decline of more than 10% over the last seven days. This downward trend comes amid US President Donald Trump's aggressive trade policies and EU tariff threats."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-seeks-to-cut-states-share-of-central-taxes-explained-check-impact-2686346-2025-02-27",
      "headline": "Government seeks to cut states' share of central taxes: ReportBased on the expected tax collections for the ongoing financial year, a 1% swing in the states' share of tax revenue could give the central government about Rs 3,500 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-tumble-4-percent-this-month-should-share-market-investors-be-worried-2686334-2025-02-27",
      "headline": "Sensex, Nifty tumble 4% this month: Should share market investors be worried? Brokerage firm Emkay Global said falling prices make market investors nervous, but there are good signs too. The RBI lowering risk for NBFCs and micro-borrowers helps, and Nifty is now priced better at around 22,500."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-trainees-complain-to-pm-office-over-forceful-layoffs-mysuru-campus-report-2686326-2025-02-27",
      "headline": "Infosys trainees complain to PM's Office over 'forceful' layoffs: ReportThe employees have sought intervention to be reinstated in their jobs and to prevent similar terminations in the future. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-golden-visa-trump-gold-card-visa-5-key-things-you-need-to-know-about-5-million-path-to-us-citizenship-2686297-2025-02-27",
      "headline": "Trump Gold Card Visa: 5 key things you need to knowUS President Donald Trump believes the new visa will attract wealthy individuals to the US who will spend large sums, pay high taxes, and boost the economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-nuvama-cut-spicejet-share-price-target-despite-profit-in-q3-2686307-2025-02-27",
      "headline": "Explained: Why Nuvama cut Spicejet share price target despite profit in Q3SpiceJet attributed its Q3 performance to strong passenger demand, better efficiency, and smarter pricing. In the third quarter, the company's revenue jumped 35% to Rs 1,651 crore, and occupancy stayed at 87%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-partners-with-perplexity-for-ai-powered-search-feature-on-app-2686295-2025-02-27",
      "headline": "Paytm partners with Perplexity for AI-powered search feature on appPaytm says this move is to keep up with growing digital demand. The AI search will work in local languages, making it easier for people to use."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ultratech-cement-shares-price-fall-6-percent-why-reason-polycab-india-havells-india-kei-industries-rr-kabel-2686284-2025-02-27",
      "headline": "Explained: Why UltraTech Cement shares fell 6% todayUltraTech Cement Ltd shares fell 6%. The stock opened at Rs 10,796.15 after having closed at Rs 10,968.45 in the previous session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-rbi-bank-bandhan-bank-au-small-finance-bank-shares-are-rising-today-2686275-2025-02-27",
      "headline": "Why RBI Bank, Bandhan Bank, AU Small Finance Bank shares are rising today? Shares of RBL Bank, Bandhan Bank, AU Small Finance Bank, IDFC First Bank, and IndusInd Bank gained up to 7%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/multiple-uans-here-how-to-consolidate-them-effective-epf-management-2686271-2025-02-27",
      "headline": "Do you have multiple UANs? Here's how to merge them Every time you join a new company, give your employer the existing UAN so they don't create another. If they've already made a new one, you need to merge it with your old one."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-stake-sale-in-five-psu-banks-up-to-20-percent-ofs-qip-report-2686251-2025-02-27",
      "headline": "5 PSU banks may see government stake sale of up to 20%: ReportThe government is working on a plan in consultation with the Department of Investment and Public Asset Management (DIPAM), the Department of Financial Services (DFS), and state-run banks. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/oscar-nominated-savan-kotecha-to-find-indias-first-global-boy-band-2686383-2025-02-27",
      "headline": "Oscar-nominated Savan Kotecha to find India's first global boy bandSavan Kotecha is launching a nationwide hunt for India's first global boy band. Partnering with Universal Music, he aims to build a teen pop economy and create Indian stars for the world stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/undercover-high-school-review-korean-main-hoon-na-with-more-thrills-2686314-2025-02-27",
      "headline": "Undercover High School review: Korean 'Main Hoon Na' with more thrillsReleased-Fri Feb 21, 2025Undercover High School review: It is a thrilling Korean series blending action and comedy, reminiscent of 'Main Hoon Na', where a disgraced spy navigates high school challenges while on a mission to find missing gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/o-saathi-re-new-netflix-show-imtiaz-ali-aditi-rao-hydari-avinash-tiwary-arjun-rampal-2686276-2025-02-27",
      "headline": "O Saathi Re: Imtiaz Ali's Netflix series is a modern story with a vintage heartNetflix has released the first look of its new series O Saathi Re, starring Avinash Tiwary, Aditi Rao Hydari, and Arjun Rampal. The series, directed by Arif Ali, will be an 'ode to vintage love in modern times'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-hilarious-dance-mere-husband-mujhko-piyar-nahi-karte-at-sangeet-watch-2686265-2025-02-27",
      "headline": "Prajakta Koli hilariously dances to 'Mere Husband Mujhko Piyar…' at sangeet. WatchPrajakta Koli danced to Mere Husband Mujhko Piyar Nahin Karte at her sangeet, leaving guests in splits. She married Vrishank Khanal in Karjat on February 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kj-yesudas-hospitalised-chennai-old-age-2686238-2025-02-27",
      "headline": "Vijay Yesudas reacts to fake news about father Yesudas's hospitalisationReports were rife that playback singer Yesudas was hospitalised in Chennai due to age-related illness. His son and playback singer Vijay Yesudas exclusively spoke to India Today and shut down the rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sex-education-actor-alexander-westwood-jailed-for-15-years-for-multiple-sex-offenses-2685969-2025-02-26",
      "headline": "Sex Education actor Alexander Westwood jailed for 15 years for sex offencesSex Education actor Alexander Westwood received a 15-year prison sentence for multiple sex offenses. The case has captured widespread media attention due to Westwood's role in the popular Netflix show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aashram-3-part-1-ending-explained-pammi-aaditi-pohankar-revenge-baba-nirala-bobby-deol-prakash-jha-2685961-2025-02-26",
      "headline": "Aashram 3 Part 1 ending explained: Will Pammi's revenge end Baba Nirala's reign?With Aashram Season 3 Part 2 releasing on February 27, let us take a look at how the season ended on a cliffhanger with Baba Nirala's misuse of power and a change in dynamics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-jasleen-royal-criticism-coldplay-opening-one-bad-act-wont-damage-reputation-of-indian-2685917-2025-02-26",
      "headline": "Amit Trivedi says Jasleen Royal's opening act for Coldplay was 'unfortunate'Amit Trivedi, in an interview with India Today Digital, discussed the controversy over Jasleen Royal's opening act for Coldplay's India tour and whether it would impact on the image of Indian artists."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-kanye-west-trying-to-save-marriage-with-bianca-censori-report-2685911-2025-02-26",
      "headline": "Rapper Kanye West trying to save marriage with Bianca Censori: ReportKanye West is reportedly trying to prevent his marriage with Bianca Censori from ending. An insider reveals that Bianca is considering divorce, and Kanye is panicking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/euphoria-palash-sen-akshay-kumar-bollywood-mahakal-chalo-mahashivratri-2685899-2025-02-26",
      "headline": "Singer Palash Sen on working with Akshay Kumar, not being 'accepted' by BollywoodEuphoria's lead vocalist Palash Sen spoke to India Today Digital about collaborating with Bollywood star Akshay Kumar on the song Mahakal Chalo, work opportunities in the Hindi film industry, and more in an exclusive interaction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aman-verma-vandana-lalwani-separate-9-years-of-marriage-2685910-2025-02-26",
      "headline": "Actors Aman Verma and Vandana Lalwani to separate after 9 years of marriageActors Aman Verma and Vandana Lalvani are separating after nine-years of marriage. Amid growing speculation, Aman has addressed the rumours about their relationship. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/baalveer-actor-dev-joshi-marries-girlfriend-aarti-first-pics-out-2685838-2025-02-26",
      "headline": "Baalveer actor Dev Joshi marries girlfriend Aarti, first pics outBaalveer actor Dev Joshi married his girlfriend Aarti in a beautiful ceremony. The wedding festivities, including haldi and mehndi, were spectacular and captured in stunning photos."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajasthan-beawar-sexual-exploitation-charges-schoolgirls-minors-11-arrested-tensions-extortion-2686344-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rajasthan's Beawar tense after charges of sexual exploitation of schoolgirlsCommunal tension has gripped areas of Rajasthan's Beawar after charges that several schoolgirls were sexually exploited and blackmailed, and attempts were made at religious conversion. Markets were shut down in several areas and rallies taken out, demanding justice. Police have detained 11 accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-uddhav-thackeray-skip-maha-kumbh-visit-bjp-2686395-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "As Rahul Gandhi skips Maha Kumbh visit, BJP finds stick to beat Congress withWhile Maharashtra Deputy Chief Minister Eknath Shinde slammed Rahul Gandhi and Uddhav Thackeray for calling themselves 'Hindutvavadis', the Congress said politics should not be done over Kumbh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-not-happy-with-dk-shivakumar-thanking-sadhguru-2686280-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shivakumar faces Congress heat over Sadhguru invite: Aligns with RSS narrativeA Congress leader questioned DK Shivakumar's loyalties after the latter posted a thank you note to Sadhguru. Shivakumar was thanking Sadhguru for his invitation to celebrate Mahashivratri at Sadhguru's Isha Yoga Center in Coimbatore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-satara-woman-neelam-shinde-accident-us-family-seeks-visa-2686269-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre requests emergency US visa for family of injured Indian student: SourcesAs a result of the accident on February 14, Neelam Shinde suffered serious injuries to her head, hands, legs and chest. She also had to undergo immediate surgery and is currently in critical condition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/blue-ghost-sends-clearest-visuals-of-moon-giant-craters-await-underneath-2686336-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Blue Ghost sends clearest visuals of Moon, giant craters await underneathThe stunning footage, taken during the spacecraft's orbit around the Moon, provides a detailed view of the lunar terrain, showcasing its rugged and cratered landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-delimitation-makes-south-india-nervous-2686324-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why are southern states wary of delimitation? Understanding the exerciseThe sceptre of delimitation has once again shrouded Tamil Nadu, and other southern states. But why are they so nervous? It has much to do with the reduction in their representation in Parliament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/bonnie-and-clyde-the-french-connection-hollywood-actor-gene-hackman-wife-betsy-dog-found-dead-inside-new-mexico-home-2686360-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Oscar-winning actor Gene Hackman, wife Betsy and dog found dead at home: ReportTwo-time Oscar winner, actor Gene Hackman, was found dead at his New Mexico home on Thursday along with his wife, Betsy, and their dog. The police didn't suspect any foul play. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sri-sri-ravi-shankar-interview-maha-kumbh-faith-stampede-ganga-water-faecal-bacteria-2686247-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sri Sri Ravi Shankar on Kumbh water row: Ganga doesn't allow bacterial growthSpiritual leader Sri Sri Ravi Shankar, in an exclusive interview with India Today, said the Maha Kumbh, which ended on Wednesday, showcased the rich diversity and the spiritual wealth of India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/two-men-publicly-flogged-in-indonesia-for-gay-sex-dozens-watch-2686357-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Two men publicly flogged in Indonesia for gay sex, dozens watchWhile gay sex is not illegal elsewhere in Indonesia -- the world's most populous Muslim-majority nation -- it is outlawed in Aceh, which imposes a version of sharia, the Islamic legal code."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/west-coast-temperatures-soaring-as-indias-tryst-with-heatwaves-begin-2686393-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "West Coast temperatures soaring as India's tryst with heatwaves beginTypically, heatwaves occur between March and June, but this year, the West Coast has been dealing with unusually high temperatures since late February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/andrew-tate-rape-trafficking-charges-romania-leaves-for-us-travel-ban-lifted-2686390-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Andrew Tate, who faces rape and trafficking charges in Romania, leaves for USIt is not clear under what conditions Andrew Tate and his brother — who are keen supporters of US President Donald Trump and boast millions of online followers — were allowed to leave Romania."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-slams-build-first-regularise-later-approach-rejects-plea-against-demolition-2686188-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Court slams 'build first, regularise later' approach, rejects plea over demolitionThe Bombay High Court dismissed a petition challenging the demolition of an illegal structure, warning against the widespread belief that unauthorised constructions can be regularised later. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-techie-compares-work-culture-in-india-and-the-uk-after-moving-to-london-2686305-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru techie compares work culture in India and the UK after moving to LondonReflecting on his experiences, Arnav Gupta observed a stark contrast in the work culture between India and the UK. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-firms-can-now-hire-indian-graduates-under-trumps-gold-card-citizenship-plan-2686197-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US firms can now hire Indian graduates under 'gold card' citizenship plan: TrumpUS President Donald Trump announced that American companies can now hire Indian graduates from US universities under the new 'gold card' citizenship plan. Trump emphasised that the current system has forced top Indian talent to leave the US, missing key opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/where-is-arvind-kejriwal-aap-chief-punjab-election-strategy-2686332-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "As AAP firefights BJP in Delhi, where is Arvind Kejriwal?Arvind Kejriwal, who was defeated by the BJP's Parvesh Verma, was last seen publicly on February 23 at the AAP legislative party meeting where Atishi was announced as leader of the opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-trainees-complain-to-pm-office-over-forceful-layoffs-mysuru-campus-report-2686326-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Infosys trainees complain to PM's Office over 'forceful' layoffs: ReportThe employees have sought intervention to be reinstated in their jobs and to prevent similar terminations in the future. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/what-is-mono-diet-and-is-it-even-practical-2686223-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What is mono diet, and is it even practical?The mono diet may seem like a quick fix for your weight loss woes, but it might not be as sustainable or practical as it appears."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-vs-afghanistan-hasmatullah-shahidi-2686242-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Afghanistan winning is no shock: Cricket's elite have ambitious new rivalsAfghanistan's latest victory over England in the Champions Trophy 2025 reaffirms their place amongst cricket's elite, proving their success is no longer an underdog story. Overcoming war, instability, and infrastructural challenges, the Afghan men's team has written its success story in 2X speed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/two-cbse-class-10-board-exams-from-2026-draft-proposal-explained-2686315-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Two CBSE Class 10 board exams from 2026: Draft proposal explainedCBSE's proposal to introduce two board exams for Class 10 has sparked discussions among students, parents, and educators. The new system, expected to be implemented in 2026, aims to provide flexibility by allowing students to appear for either of the two exams or both. Here are the highlights of the CBSE draft proposal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aaps-big-charge-mlas-not-being-allowed-to-enter-delhi-assembly-2686246-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Suspended AAP MLAs blocked from Delhi Assembly in new showdown with BJPAAP leaders claimed they were blocked from entering the Delhi Assembly on Thursday, alleging barricades were placed on the entry road to stop them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/katrina-kaif-peaceful-austrian-escape-2686329-2025-02-27#?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Katrina Kaif's peaceful Austrian escape: Time comes to a standstillKatrina Kaif shared breathtaking glimpses from her serene Austria vacation, enjoying snow-clad mountain walks and tranquil lake views. She called the trip a \"perfect reset.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/mk-stalin-slams-hindi-push-says-regional-languages-are-disappearing-2686337-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "MK Stalin says Hindi erased 25 regional languages, many gasping for survivalTamil Nadu MK Stalin accused Hindi of swallowing regional languages and erasing diversity. He reiterated Tamil Nadu's opposition to the Centre's three-language policy, insisting on Tamil and English. Several regional tongues that he claimed were 'gasping for survival', he said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-girl-rape-blackmail-multiple-times-tuition-teacher-threat-mental-harassment-2686293-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi teen repeatedly raped, blackmailed by tuition teacher for 3 yearsIn her complaint, the girl, a resident of the Chittaranjan Park area in South Delhi, said she had been attending classes at the tuition centre for the past three years from 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/no-class-10-pass-without-punjabi-punjab-government-strict-order-to-schools-after-cbse-draft-2686199-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Punjabi must to pass Class 10: State government's strict order after CBSE draftThe Punjab government has made Punjabi mandatory for Class 10, requiring all schools to teach it as a primary subject. Schools failing to comply will face action under the Punjab Learning of Punjabi and Other Languages Act, 2008."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jyotika-reacts-to-troll-saying-vijay-is-better-than-your-husband-deletes-later-2686400-2025-02-27",
      "headline": "Jyotika reacts to troll saying, 'Vijay is better than your husband', deletes laterActor Jyotika recently replied to a troll who said that actor-politician Vijay is better than her husband, Suriya. However, she later deleted her response. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-varun-dhawan-missed-his-co-star-prajakta-koli-wedding-2686381-2025-02-27",
      "headline": "Why Varun Dhawan missed his co-star Prajakta Koli's weddingActor Varun Dhawan was unable to attend the wedding festivities of his Jugjugg Jeeyo co-star Prajakta Koli. Prajakta got married to her longtime partner Vrishank Khanal recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiyaan-vikram-dhruva-natchathiram-may-1-release-date-2686372-2025-02-27",
      "headline": "Chiyaan Vikram's long-pending Dhruva Natchathiram gets new release date in MayChiyaan Vikram and director Gautham Vasudev Menon's Dhruva Natchathiram has gone through many delays. A new release date has been finalised, according to reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/oscar-nominated-savan-kotecha-to-find-indias-first-global-boy-band-2686383-2025-02-27",
      "headline": "Oscar-nominated Savan Kotecha to find India's first global boy bandSavan Kotecha is launching a nationwide hunt for India's first global boy band. Partnering with Universal Music, he aims to build a teen pop economy and create Indian stars for the world stage."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kevin-pietersen-mentor-delhi-capitals-new-season-2686387-2025-02-27",
      "headline": "Kevin Pietersen returns to Delhi Capitals, named mentor for IPL 2025Former England captain Kevin Pietersen returned to Delhi Capitals. The franchise announced him as their new mentor for the Indian Premier League 2025 season, starting March 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-dubai-training-rohit-sharma-skips-virat-kohli-spin-2686373-2025-02-27",
      "headline": "IND vs NZ: Rohit Sharma skips batting practice, Virat Kohli focusses more on spinChampions Trophy 2025: Rohit Sharma skipped batting training, but kept a close eye on India's session under the lights in Dubai on Wednesday. India will take on New Zealand in their final Group A match in Dubai on Sunday, March 02. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-pakistan-new-head-coach-yograj-singh-suggestion-aaqib-javed-2686365-2025-02-27",
      "headline": "Clash of Champions: Pakistan's new coach? Yograj Singh has a bold suggestionPakistan's turbulent run, capped by an early Champions Trophy exit, has reignited talks of another coaching change. If PCB moves on from Aaqib Javed, Yograj Singh has made a bold and unexpected suggestion for Pakistan's next head coach."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-england-vs-afghanistan-hasmatullah-shahidi-press-conference-semi-final-qualification-2686355-2025-02-27",
      "headline": "Afghanistan won't put pressure on themselves thinking of semis: ShahidiAfghanistan captain Hasmatullah Shahidi has claimed that his side won't pressure on themselves too much by thinking about qualifying into the semi-finals of the Champions Trophy. Afghanistan defeated England by 8 runs to retain hope of making it to the final four rounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-vs-afghanistan-jonathan-trott-press-conference-lahore-2686341-2025-02-27",
      "headline": "Self-belief in Afghanistan squad is quite infectious: coach Jonathan TrottAfghanistan coach Jonathan Trott has claimed that the self-belief within the squad is quite infectious. Afghanistan defeated England to remain in the hunt for a spot in the Champions Trophy semi-finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-bangladesh-live-score-rawalpindi-weather-rizwan-shanto-2686330-2025-02-27",
      "headline": "PAK vs BAN Champions Trophy Live: Toss delayed due to rain in RawalpindiChampions Trophy, Pakistan (PAK) vs Bangladesh (BAN) Updates: The toss for the clash between Pakistan and Bangladesh has been delayed due to consistent rain at Rawalpindi. The two sides are playing for pride as both teams are out of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-vs-england-nasser-hussain-michael-atherton-jos-buttler-captaincy-move-on-2686320-2025-02-27",
      "headline": "England legends urge team to move on from captain Jos Buttler: He is doneMichael Atherton and Nasser Hussain believe Jos Buttler's England captaincy has run its course after their Champions Trophy exit. With mounting criticism, England may soon consider a leadership change following a string of poor performances under Buttler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rajasthan-wushu-player-dies-of-heart-attack-during-match-at-chandigarh-university-2686316-2025-02-27",
      "headline": "Rajasthan Wushu player dies of heart attack during match at Chandigarh UniversityMohit, a 21-year-old Wushu player from Rajasthan, suffered a fatal heart attack during a championship match at Chandigarh University on Monday, February 24. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/rajasthans-wushu-player-dies-due-to-heart-attack-while-competing-in-chandigarh-2686313-2025-02-27",
      "headline": "Rajasthan's Wushu player dies due to heart attack while competing in ChandigarhMohit Sharma, a Wushu player from Rajasthan University, collapsed due to a heart attack in the ring while competing at the All India Inter University Wushu Championship at Chandigarh University on Monday, February 24. Despite immediate medical assistance, he was declared dead at the hospital in Kharar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-england-vs-afghanistan-jos-buttler-captaincy-press-conference-lahore-2686292-2025-02-27",
      "headline": "Got to work out if I am part of the problem or solution for England: Jos ButtlerEngland captain Jos Buttler has admitted that he needs to work out if he is part of the problem or solution for England after their Champions Trophy 2025 exit. England have been going through a rough patch in white-ball cricket, with the loss to Afghanistan being the latest low point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-bangladesh-live-score-rawalpindi-weather-rizwan-shanto-2686330-2025-02-27",
      "headline": "PAK vs BAN Champions Trophy Live: Toss delayed due to rain in RawalpindiChampions Trophy, Pakistan (PAK) vs Bangladesh (BAN) Updates: The toss for the clash between Pakistan and Bangladesh has been delayed due to consistent rain at Rawalpindi. The two sides are playing for pride as both teams are out of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-vs-england-nasser-hussain-michael-atherton-jos-buttler-captaincy-move-on-2686320-2025-02-27",
      "headline": "England legends urge team to move on from captain Jos Buttler: He is doneMichael Atherton and Nasser Hussain believe Jos Buttler's England captaincy has run its course after their Champions Trophy exit. With mounting criticism, England may soon consider a leadership change following a string of poor performances under Buttler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rajasthan-wushu-player-dies-of-heart-attack-during-match-at-chandigarh-university-2686316-2025-02-27",
      "headline": "Rajasthan Wushu player dies of heart attack during match at Chandigarh UniversityMohit, a 21-year-old Wushu player from Rajasthan, suffered a fatal heart attack during a championship match at Chandigarh University on Monday, February 24. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/rajasthans-wushu-player-dies-due-to-heart-attack-while-competing-in-chandigarh-2686313-2025-02-27",
      "headline": "Rajasthan's Wushu player dies due to heart attack while competing in ChandigarhMohit Sharma, a Wushu player from Rajasthan University, collapsed due to a heart attack in the ring while competing at the All India Inter University Wushu Championship at Chandigarh University on Monday, February 24. Despite immediate medical assistance, he was declared dead at the hospital in Kharar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-england-vs-afghanistan-jos-buttler-captaincy-press-conference-lahore-2686292-2025-02-27",
      "headline": "Got to work out if I am part of the problem or solution for England: Jos ButtlerEngland captain Jos Buttler has admitted that he needs to work out if he is part of the problem or solution for England after their Champions Trophy 2025 exit. England have been going through a rough patch in white-ball cricket, with the loss to Afghanistan being the latest low point."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}