{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/crazy-capitalist-over-organised-socialist-ruchir-sharma-on-why-billionaires-back-donald-trump-2631143-2024-11-10",
      "headline": "Ruchir Sharma on why billionaires support 'crazy capitalist' Donald TrumpDespite his 'crazy capitalist' persona, Donald Trump's pro-business approach continues to win over America's influential elites and billionaires.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cryptocurrencies-here-to-stay-as-an-asset-class-says-ruchir-sharma-2630941-2024-11-09",
      "headline": "Cryptocurrencies here to stay as an asset class, says Ruchir SharmaIn an interview with India Today News Director Rahul Kanwal, Ruchir Sharma explained why cryptocurrencies, alongside gold, are emerging as long-term alternatives to traditional assets, particularly the US dollar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-stimulus-economic-crisis-us-deal-india-stance-interview-ruchir-sharma-2630931-2024-11-09",
      "headline": "China's stimulus may stabilise economy, but won't solve crisis: Ruchir SharmaIn an interview with India Today News Director Rahul Kanwal, Ruchir Sharma highlighted that China's growth is unlikely to exceed 2.5% annually over the next decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ruchir-sharma-foreign-investors-outflows-indian-stock-market-2630910-2024-11-09",
      "headline": "Only a weaker dollar will bring foreign investors back to India: Ruchir SharmaIn an interview with India Today News Director Rahul Kanwal, Ruchir Sharma explained that the primary factor hindering foreign capital inflows into India is the strength of the dollar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ruchir-sharma-donald-trump-india-us-trade-ties-tariff-plans-interview-2630877-2024-11-09",
      "headline": "Should India worry about Donald Trump's tariff plans? Ruchir Sharma explainsRuchir Sharma warned that under Donald Trump, India must brace for a more transactional approach, where deals could be made based on America's interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bookingcom-parent-company-booking-holdings-job-cuts-company-reorganisation-plan-2630694-2024-11-09",
      "headline": "Booking plans job cuts as part of company's reorganisation planBooking Holdings, which owns brands like Booking.com and Kayak, did not disclose how many jobs would be affected but said it expected to provide more details on timing, likely impact on employees and financials \"in due course\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-market-value-rises-electric-automaker-shares-jumped-elon-musk-donald-trump-2630662-2024-11-09",
      "headline": "Elon Musk's Tesla hits $1 trillion market value after Trump winThe electric automaker's shares jumped 8.2 per cent to $321.22, catapulting the company's valuation above the trillion-dollar mark for the first time in more than two years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/business-today-most-powerful-women-2024-awards-kalli-purie-speech-2630633-2024-11-09",
      "headline": "A woman's soulmate is another woman: Kalli Purie at Business Today MPW 2024Kalli Purie, Vice-Chairperson and Executive Editor-in-Chief, India Today Group, delivered the vote of thanks at Business Today's Most Powerful Women 2024 awards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/indias-women-achivers-honoured-at-business-todays-most-powerful-women-2024-awards-2630631-2024-11-09",
      "headline": "Watch: Trailblazers awarded at Business Today's Most Powerful Women 2024Business Today unveiled the 21st edition of its Most Powerful Women in Business list on Friday, celebrating 60 exceptional women leaders who are pioneering change, driving growth, and inspiring progress across diverse industries. This year's edition brings in 12 fresh faces and recognises four returning achievers, underscoring the dynamic nature of leadership in business. Watch the award ceremony here on India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/i-salute-the-trailblazers-kalli-purie-at-business-todays-most-powerful-women-event-2630629-2024-11-09",
      "headline": "I salute the trailblazers: Kalli Purie at Business Today's Most Powerful Women eventKalli Purie, Vice-Chairperson and Executive Editor-in-Chief, India Today Group, lauded the growing accomplishments and transformation of women leaders in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trailblazers-on-business-today-most-powerful-women-2024-list-2630545-2024-11-08",
      "headline": "Trailblazers on Business Today's Most Powerful Women 2024 listThis year's Business Today Most Powerful Women list introduces 12 new faces, four returning achievers, and 37 repeat honourees from last year. Two trailblazers entered the MPW Hall of Fame after seven-time wins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/americans-can-learn-a-lesson-or-two-from-india-piyush-goyal-on-women-representation-2630574-2024-11-08",
      "headline": "Americans can learn a lesson or two from India: Piyush Goyal on women representationUnion Minister of Commerce & Industry Piyush Goyal lauded India's approach to women's empowerment and said that Americans can learn a lesson or two from India on women representation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-india-cut-tariffs-harley-davidson-donald-trump-us-president-2630573-2024-11-08",
      "headline": "Harley-Davidson tariffs to be cut after Trump's return? Piyush Goyal respondsSpeaking at the Business Today's Most Powerful Women 2024 event, Piyush Goyal expressed India's openness to reconsidering the tariffs on the iconic motorcycles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-leaders-share-insights-on-achieving-work-life-balance-and-success-at-bt-mpw-2024-2630562-2024-11-08",
      "headline": "Women leaders share insights on achieving work-life balance and success at BT MPW 2024At the Business Today MPW 2024 session, Ritu Arora, CEO & CIO of Allianz Investment Management, Asia Pacific, Nirupa Shankar, Joint MD of Brigade Group; and Devita Saraf, Chairperson & CEO of Vu Group, shared insights on striking a fine balance between work, life, health and wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-need-to-move-from-being-savers-to-investors-radhika-gupta-2630549-2024-11-08",
      "headline": "Women need to move from being savers to investors: Radhika GuptaSpeaking at the Business Today Most Powerful Women 2024 event, Radhika Gupta, MD and CEO of Edelweiss Mutual Fund, emphasised the need for women to move beyond saving and start investing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/edelweiss-mutual-fund-radhika-gupta-on-women-phenomenal-savers-should-not-outsource-money-management-to-men-2630490-2024-11-08",
      "headline": "It's not complicated: Radhika Gupta urges women to manage their own moneySpeaking at Business Today's Most Powerful Women 2024 event, Edelweiss Mutual Fund Managing Director and CEO Radhika Gupta said that while women have been the \"chief financial officers\" of their households for generations, it's time to extend that role into the financial markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-have-always-had-a-tough-time-breaking-barriers-in-business-padmaja-ruparel-at-bt-mpw-2024-2630469-2024-11-08",
      "headline": "Women have always had a tough time breaking barriers in business: Padmaja Ruparel at BT MPW 2024Speaking at Business Today's Most Powerful Women 2024 event, Padmaja Ruparel said women always had a tough time breaking barriers in business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-swiggy-accused-of-breaching-antitrust-laws-competition-commission-of-india-2630326-2024-11-08",
      "headline": "Zomato, Swiggy accused of unfair practices in food delivery market: ReportThe investigation found these companies implemented practices that gave preferential treatment to certain restaurants on their platforms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-fii-selling-it-gains-weak-q2-earnings-2630311-2024-11-08",
      "headline": "Sensex, Nifty end in red as FII selling offsets IT gains; RVNL tanks 6%The S&P BSE Sensex dropped 55.47 points to settle at 79,486.32, while the NSE Nifty50 fell 89.95 points to 24,109.40.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shiv-nadar-billionaire-edelgive-hurun-india-philanthropy-list-2024-rs-2153-crore-fy24-2630279-2024-11-08",
      "headline": "Shiv Nadar, billionaire with a big heart, donates Rs 2,153 crore in FY24For the third time in five years, Shiv Nadar and his family have topped the EdelGive-Hurun India Philanthropy List 2024, contributing Rs 2,153 crore in the fiscal year 2024."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jawan-killed-three-commandos-encounter-terrorists-in-jammu-kashmir-kishtwar-2631229-2024-11-10",
      "headline": "Jawan killed, three other commandos injured in ongoing encounter in Jammu-Kashmir's KishtwarJawan killed, three other commandos injured in ongoing encounter in Jammu-Kashmir's Kishtwar"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/khalistani-terrorist-khalistan-tiger-force-arsh-dalla-hardeep-singh-nijjar-arrested-canada-2631200-2024-11-10",
      "headline": "Khalistani terrorist Arsh Dalla, close aide of Nijjar, arrested in Canada: SourcesAccording to Indian intelligence agencies, Arsh Dalla, who is wanted for various criminal activities in India, has been living in Canada with his wife. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ukraine-fires-drones-towards-moscow-in-biggest-strike-since-war-in-2022-2631195-2024-11-10",
      "headline": "Ukraine fires 34 drones towards Moscow in biggest strike since war in 2022Ukraine launched its largest drone attack on Moscow since the war began, diverting flights and injuring one person, while Russia intercepted 36 drones over Western regions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jharkhand-assembly-polls-pm-narendra-slams-jawahar-lal-nehru-indira-gandhi-rajiv-gandhi-obc-reservation-2631188-2024-11-10",
      "headline": "Ek rahoge toh safe rahoge: PM alleges plot to break Backward classes in JharkhandAlleging that the Congress wants to divide OBCs by pitting sub-castes against each other, Prime Minister Narendra Modi told the people that \"if they stay united, they will remain safe\" (ek rahoge toh safe rahoge)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/banarasi-is-getting-a-western-makeover-this-wedding-season-2628572-2024-11-10",
      "headline": "Banarasi is getting a Western makeover this wedding season Banarasi is undergoing a makeover through a wave of Westernisation. Think of Banarasi in modish silhouettes like corsets, tops, pantsuits, and even short dresses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/dy-chandrachud-retirement-cji-supreme-court-sajiv-khanna-bar-council-senior-lawyers-2631178-2024-11-10",
      "headline": "Transformative yet unfulfilled: Senior lawyers on Chief Justice Chandrachud's tenureAs Chief Justice DY Chandrachud retires, senior advocates reflect on his tenure, praising his digital reforms and progressive judgments while noting some missed opportunities and challenges within the judiciary."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-protest-awami-league-sheikh-hasina-interim-government-2631010-2024-11-10",
      "headline": "Bangladesh Army arrests workers of Sheikh Hasina's party ahead of Dhaka protestThe Awami League has called for a protest rally in Dhaka on Sunday. However, the interim government has said that it won't allow protests and issued a stern warning to the party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/high-commission-of-canada-protest-hindu-sikh-global-forum-activists-brampton-temple-attack-khalistan-2631132-2024-11-10",
      "headline": "Video: Big protest outside Canadian mission in Delhi, barricades toppledA large number of activists, mainly from the Hindu Sikh Global Forum, gathered outside the High Commission of Canada in Delhi on Sunday to protest against the recent attacks on Hindu temples in Canada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/humare-ram-ramayana-drama-theatre-play-ashutosh-rana-questions-on-sanatana-dharma-adipurush-ott-2630948-2024-11-10",
      "headline": "In OTT age, why a Ramayana play on Dharma and Sanatana is a superhitHumare Ram, a theatrical Ramayana retelling, is seeing full houses across the country. This theatre version of Ramayana, in which Ashutosh Rana plays Ravan, gained success while a big-budget movie based on the epic bombed. This is how Humare Ram, a play that answers questions on Sanatana and Dharma, got it right."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-elections-shiv-sena-eknath-shinde-shrikant-shinde-mahayuti-allaince-2631158-2024-11-10",
      "headline": "Maharashtra will reject fake narratives, Mahayuti will win: Eknath Shinde's sonShrikant Sinde emphasised that people would reject 'fake narratives,' as they did in Haryana. In an exclusive interview with India Today, the Shiv Sena MP highlighted the Mahayuti's focus on showcasing development achievements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-mva-maha-vikas-aghadi-manifesto-caste-census-health-agriculture-assembly-election-2631115-2024-11-10",
      "headline": "Mallikarjun Kharge slams PM over 'blank Constitution' remark, vows caste censusCongress chief Mallikarjun Kharge promised on Sunday to conduct a caste census if Maha Vikas Aghadi is elected in the upcoming assembly elections. He also announced plans to raise the state's 50 per cent reservation cap."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/donald-trump-india-visit-election-night-party-narendra-modi-us-india-relations-tariff-anshuman-mishra-exclusive-2631114-2024-11-10",
      "headline": "Banker Anshuman Mishra's insider account of Trump's Election Night, India plansIn an exclusive interview with India Today, international banker and political strategist Anshuman Mishra revealed what went on at Donald Trump's Mar-a-Lago club on the night of his election victory, and what the President-elect told him about his plans to visit India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/natasa-stankonic-move-to-serbia-divorce-hardik-pandya-son-agastya-2631219-2024-11-10",
      "headline": "Natasa Stankovic shares if she'll move to Serbia after separating from HardikNatasa Stankovic addressed rumours about moving to Serbia after separation from Hardik Pandya. She emphasised her commitment to staying in India for her son's well-being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/high-mighty-the-boardroom-beacons-2630781-2024-11-09",
      "headline": "High & Mighty: The boardroom beaconsThe most influential business leaders who featured in INDIA TODAY's High & Mighty Power List 2024\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/union-home-minister-amit-shah-releases-bjp-manifesto-maharashtra-assembly-polls-2631079-2024-11-10",
      "headline": "Amit Shah releases BJP poll manifesto for Maharashtra; farmers, women in focusUnion Home Minister Amit Shah unveiled the BJP's manifesto for the upcoming Maharashtra Assembly Elections 2024 on Sunday, November 10 in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/crazy-capitalist-over-organised-socialist-ruchir-sharma-on-why-billionaires-back-donald-trump-2631143-2024-11-10",
      "headline": "Ruchir Sharma on why billionaires support 'crazy capitalist' Donald TrumpDespite his 'crazy capitalist' persona, Donald Trump's pro-business approach continues to win over America's influential elites and billionaires.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ajay-devgn-reacts-to-his-viral-dance-meme-credits-it-to-prabhudeva-2631180-2024-11-10",
      "headline": "Ajay Devgn reacts to his viral dance meme, credits PrabhudevaBollywood star Ajay Devgn has reacted to his viral dance video from the film Action Jackson, directed by Prabhudeva. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-business-sports-entertainment-politics-430-09-11-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/woman-shares-harrowing-fake-cab-experience-at-bengaluru-airport-see-viral-x-post-2631126-2024-11-10",
      "headline": "Woman shares harrowing experience after boarding 'fake' Ola cab at Bengaluru airportA woman narrated her harrowing ordeal after she boarded a \"fake\" Ola cab from the Kempegowda International Airport in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/3rd-odi-pakistan-beat-australia-historic-series-win-down-under-2631156-2024-11-10",
      "headline": "Pakistan hammer Australia to secure first ODI series win Down Under since 2002Australia vs Pakistan, 3rd ODI: Pakistan pacers set up a comprehensive eight-wicket win in the third ODI as the Mohammad Rizwan-led side secured a historic 2-1 ODI series win over Australia in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/inside-kareena-kapoor-khan-sun-kissed-weekend-with-bright-bikinis-and-saif-ali-khan-2631077-2024-11-10",
      "headline": "Inside Kareena Kapoor's sun-kissed weekend with bright bikinis and Saif Ali KhanKareena Kapoor Khan enjoyed a quick getaway to the Maldives with her family, and shared a couple of photos from her trip online on Saturday evening. The actor looked bright and rejuvenated, posing under the Maldives sun. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-terrorist-encounter-srinagar-harwan-army-police-attack-2631070-2024-11-10",
      "headline": "Army traps terrorists who killed two J&K guards, gunfights underwayThree Army paratroopers were injured during an ongoing encounter in Jammu and Kashmir's Kishtwar, where a group of terrorists, suspected of being responsible for the murder of two Village Defence Guards, has been trapped."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/liam-payne-did-not-die-by-suicide-argentine-officials-2631104-2024-11-10",
      "headline": "Singer Liam Payne didn't die by suicide: Argentine officialsAfter a thorough investigation, Argentine officials have claimed that former One Direction member and popular singer Liam Payne did not kill himself. The artiste died on October 16 at age 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-temple-attack-hindu-devotees-protest-khalistan-justin-trudeau-arrest-2631027-2024-11-10",
      "headline": "Pro-Khalistani outfit coordinator among 4 arrested over Canada temple attackInderjeet Gosal, arrested for the pro-Khalistani attack on Hindu devotees, is the Sikh For Justice (SFJ) coordinator for Canada and a former associate of the slain Khalistani terrorist Hardeep Singh Nijjar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/soaps/story/shaktimaan-teaser-mukesh-khanna-promises-return-of-india-first-super-teacher-2631226-2024-11-10",
      "headline": "Shaktimaan teaser: Mukesh Khanna promises return of 'super teacher'Veteran actor Mukesh Khanna, best known for playing Shaktimaan in the 90s, has promised the return of the desi superhero to screens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/natasa-stankonic-move-to-serbia-divorce-hardik-pandya-son-agastya-2631219-2024-11-10",
      "headline": "Natasa Stankovic shares if she'll move to Serbia after separating from HardikNatasa Stankovic addressed rumours about moving to Serbia after separation from Hardik Pandya. She emphasised her commitment to staying in India for her son's well-being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/shah-rukh-khan-turns-on-dapper-mode-in-new-pics-2631212-2024-11-10",
      "headline": "So handsome: Shah Rukh Khan turns on dapper mode in new picsShah Rukh Khan was quite the dapper dude in a new set of pictures. Some of the photos were clicked before he went up the stage to host IIFA 2024 in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-the-rule-sreeleela-to-feature-in-song-for-allu-arjun-film-2631194-2024-11-10",
      "headline": "Pushpa 2: Actor Sreeleela to feature in song for Allu Arjun's filmSouth star Sreeleela will appear in a dance number for Allu Arjun's highly-anticipated Pushpa 2: The Rule. The news was shared by the makers on Sunday. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wbbl-2024-ellyse-perry-fan-sydney-sixers-video-2631227-2024-11-10",
      "headline": "Watch: Ellyse Perry wins hearts after playing cricket with young fan WBBL 2024: Ellyse Perry won hearts after playing cricket with a young fan. On Sunday, Perry played in the match against Sydney Thunder at the iconic Sydney Cricket Ground. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/womens-asian-champions-trophy-start-of-2026-world-cup-2028-olympics-journey-india-coach-harendra-singh-2631221-2024-11-10",
      "headline": "Asian Champions Trophy start of 2026 World Cup, 2028 Olympics journey: India coachIndia coach Harendra Singh has claimed that the women's team will use the Asian Champions Trophy 2024 and will be the base for their journey to the World Cup 2026 and the Olympics 2028. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-bangladesh-mustafizur-rahman-odi-t20i-series-2631213-2024-11-10",
      "headline": "Set to become father, Mustafizur likely to miss ODI, T20Is vs West IndiesBangladesh may not get the services of Mustafizur Rahman in their upcoming ODI and T20I series against the West Indies. Mustafizur is set to become a father later this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-ricky-ponting-jasprit-bumrah-captaincy-rohit-sharma-2631202-2024-11-10",
      "headline": "Ricky Ponting backs Jasprit Bumrah to step up as captain in Rohit's absenceBorder-Gavaskar Trophy: Australian great Ricky Ponting has backed pace spearhead Jasprit Bumrah to step up as India captain in Rohit Sharma's absence against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/dont-know-how-limited-lionel-messis-time-is-in-mls-inter-miami-boss-martino-2631205-2024-11-10",
      "headline": "Don't know how limited Lionel Messi's time is in MLS: Inter Miami boss MartinoInter Miami's head coach, Gerard Martino, has expressed uncertainty over Lionel Messi's future with the club following their exit from the MLS Cup playoffs. Messi, who joined in 2023, has had a stellar season but his contract ends in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-cooper-connolly-hand-injury-t20i-series-2631191-2024-11-10",
      "headline": "Cooper Connolly ruled out of Australia's T20I series vs PakistanAUS vs PAK: Cooper Connolly won't be a part of the upcoming T20I series against Pakistan after fracturing his left hand during the third and final ODI on Sunday in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-vs-aston-villa-trent-alexander-arnold-injury-arne-slot-2631190-2024-11-10",
      "headline": "Arne Slot concerned with Trent Alexander-Arnold's injury: Not a good signLiverpool manager Arne Slot admitted that Trent Alexander-Arnold's injury during the Aston Villa is a big concern for the team. Alexander-Arnold had to be taken off in the first half due to an injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-test-nathan-mcsweeney-reveals-head-welcome-message-2631171-2024-11-10",
      "headline": "New Australia Test opener McSweeney reveals Head's hilarious welcoming messageAustralia's newest Test opener Nathan McSweeney has revealed he has received some good-natured, humorous advice and welcome message from Travis Head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-haris-rauf-odi-series-win-2631183-2024-11-10",
      "headline": "Pakistan have been struggling a lot: Haris Rauf rejoices series win AUS vs PAK: Haris Rauf was over the moon after Pakistan beat Australia 2-1 in the ODI series after winning the Perth ODI by eight wickets on Sunday. Rauf won the Player of the Series award for picking up 10 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-fears-decline-of-bilateral-series-australia-lacked-intensity-2631174-2024-11-10",
      "headline": "Michael Vaughan fears 'decline of bilateral series': Australia lacked intensityMichael Vaughan feared the decline of bilateral series and felt that the Australian side lacked intensity. Australia suffered a 1-2 series loss against Pakistan on their own home soil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-2nd-t20i-ramandeep-singh-debut-hardik-pandya-robin-uthappa-2631172-2024-11-10",
      "headline": "Ramandeep Singh best all-round partner for Hardik Pandya? Robin Uthappa reactsRobin Uthappa has urged the Indian team management to use Ramandeep Singh more as he feels the 27-year-old could be the ideal partner for Hardik Pandya in the side. Ramandeep is all set to make his debut for India in the South Africa T20I series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-vs-aston-villa-trent-alexander-arnold-injury-arne-slot-2631190-2024-11-10",
      "headline": "Arne Slot concerned with Trent Alexander-Arnold's injury: Not a good signLiverpool manager Arne Slot admitted that Trent Alexander-Arnold's injury during the Aston Villa is a big concern for the team. Alexander-Arnold had to be taken off in the first half due to an injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-test-nathan-mcsweeney-reveals-head-welcome-message-2631171-2024-11-10",
      "headline": "New Australia Test opener McSweeney reveals Head's hilarious welcoming messageAustralia's newest Test opener Nathan McSweeney has revealed he has received some good-natured, humorous advice and welcome message from Travis Head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-haris-rauf-odi-series-win-2631183-2024-11-10",
      "headline": "Pakistan have been struggling a lot: Haris Rauf rejoices series win AUS vs PAK: Haris Rauf was over the moon after Pakistan beat Australia 2-1 in the ODI series after winning the Perth ODI by eight wickets on Sunday. Rauf won the Player of the Series award for picking up 10 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-fears-decline-of-bilateral-series-australia-lacked-intensity-2631174-2024-11-10",
      "headline": "Michael Vaughan fears 'decline of bilateral series': Australia lacked intensityMichael Vaughan feared the decline of bilateral series and felt that the Australian side lacked intensity. Australia suffered a 1-2 series loss against Pakistan on their own home soil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-2nd-t20i-ramandeep-singh-debut-hardik-pandya-robin-uthappa-2631172-2024-11-10",
      "headline": "Ramandeep Singh best all-round partner for Hardik Pandya? Robin Uthappa reactsRobin Uthappa has urged the Indian team management to use Ramandeep Singh more as he feels the 27-year-old could be the ideal partner for Hardik Pandya in the side. Ramandeep is all set to make his debut for India in the South Africa T20I series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-third-odi-mohammad-rizwan-captaincy-perth-2631165-2024-11-10",
      "headline": "Mohammad Rizwan says he is 'captain for toss, presentations' after Australia winMohammad Rizwan has claimed that he is just a captain for the 'toss and presentations' and said he always takes inputs from everyone on the field. Pakistan defeated Australia down under in the ODI series on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-on-reaction-to-indias-loss-character-assassination-shouldnt-be-done-2631159-2024-11-10",
      "headline": "R Ashwin on reaction to India's loss: Character assassination shouldn't be doneRavichandran Ashwin was unhappy with the response to India's home Test series loss after 12 years. He firmly mentioned that a player's character should not be assassinated for a loss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/3rd-odi-pakistan-beat-australia-historic-series-win-down-under-2631156-2024-11-10",
      "headline": "Pakistan hammer Australia to secure first ODI series win Down Under since 2002Australia vs Pakistan, 3rd ODI: Pakistan pacers set up a comprehensive eight-wicket win in the third ODI as the Mohammad Rizwan-led side secured a historic 2-1 ODI series win over Australia in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-eyes-career-slam-with-australian-open-win-want-a-kangaroo-tattoo-2631140-2024-11-10",
      "headline": "Carlos Alcaraz eyes career slam with Australian Open win: Want a Kangaroo tattooCarlos Alcaraz sets his eyes on a career Grand Slam as he aims to win the Australian Open in 2025. He would become only the 9th ATP player to do so. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/womens-asian-champions-trophy-2024-schedule-livestreaming-details-and-more-2631139-2024-11-10",
      "headline": "Women's Asian Champions Trophy 2024: Schedule, livestreaming details and moreThe Indian women's hockey team is set to defend their Asian Champions Trophy title at home, starting with a match against Malaysia. After a tough year, they aim to turn things around with a mix of experienced players and fresh talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-auction-james-anderson-base-price-ms-dhoni-retention-ab-de-villiers-2631124-2024-11-10",
      "headline": "James Anderson in IPL gives same feel as MS Dhoni 2025 retention: AB de VilliersAB de Villiers compares James Anderson's IPL auction entry to MS Dhoni's retention by CSK. Anderson, who has retired from international cricket, has put his name in the auction list for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/barbora-krejcikova-slams-unprofessional-comment-physical-appearance-2631119-2024-11-10",
      "headline": "Krejcikova fumes over 'unprofessional' comment on her physical appearanceCzech tennis star Barbora Krejcikova has criticized tennis journalist Jon Wertheim for making unprofessional comments about her physical appearance, calling for greater respect towards athletes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-inter-miami-stunned-by-atlanta-united-out-of-mls-cup-playoffs-2631116-2024-11-10",
      "headline": "Lionel Messi, Inter Miami stunned by Atlanta United, out of MLS Cup PlayoffsIn a dramatic MLS Cup Round 1 finale, Atlanta United's Bartosz Slisz scored a controversial header to secure a 3-2 victory over Inter Miami. The win knocked out Lionel Messi's side and helped Atlanta advance to the Eastern Conference semifinals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/womens-asian-champions-trophy-2024-schedule-livestreaming-details-and-more-2631139-2024-11-10",
      "headline": "Women's Asian Champions Trophy 2024: Schedule, livestreaming details and moreThe Indian women's hockey team is set to defend their Asian Champions Trophy title at home, starting with a match against Malaysia. After a tough year, they aim to turn things around with a mix of experienced players and fresh talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-auction-james-anderson-base-price-ms-dhoni-retention-ab-de-villiers-2631124-2024-11-10",
      "headline": "James Anderson in IPL gives same feel as MS Dhoni 2025 retention: AB de VilliersAB de Villiers compares James Anderson's IPL auction entry to MS Dhoni's retention by CSK. Anderson, who has retired from international cricket, has put his name in the auction list for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/barbora-krejcikova-slams-unprofessional-comment-physical-appearance-2631119-2024-11-10",
      "headline": "Krejcikova fumes over 'unprofessional' comment on her physical appearanceCzech tennis star Barbora Krejcikova has criticized tennis journalist Jon Wertheim for making unprofessional comments about her physical appearance, calling for greater respect towards athletes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-inter-miami-stunned-by-atlanta-united-out-of-mls-cup-playoffs-2631116-2024-11-10",
      "headline": "Lionel Messi, Inter Miami stunned by Atlanta United, out of MLS Cup PlayoffsIn a dramatic MLS Cup Round 1 finale, Atlanta United's Bartosz Slisz scored a controversial header to secure a 3-2 victory over Inter Miami. The win knocked out Lionel Messi's side and helped Atlanta advance to the Eastern Conference semifinals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/on-this-day-in-2020-mumbai-indians-beat-delhi-capitals-to-win-their-5th-ipl-title-2631111-2024-11-10",
      "headline": "OTD in 2020: Mumbai Indians beat Delhi Capitals to win their 5th IPL title On November 10, 2020, Mumbai Indians beat Delhi Capitals by 5 wickets to clinch their 5th IPL title. They became the very first team to win five IPL trophies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-third-odi-shaheen-shah-afridi-injury-babar-azam-doctor-perth-2631103-2024-11-10",
      "headline": "Dr. Babar Azam? Pakistan batter turns physio for Shaheen Afridi after injuryBabar Azam quickly became a doctor on the field and came to the rescue of his teammate Shaheen Shah Afridi, who got injured during the Perth ODI against Australia on Sunday, November 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-nathan-mcsweeney-queensland-batter-set-to-replace-david-warner-as-opener-2631099-2024-11-10",
      "headline": "Who is Nathan McSweeney? Queensland batter set to replace David Warner as openerBorn on March 8, 1999, in Brisbane, Queensland, Nathan McSweeney is all set to make his debut for Australia. He will open for Australia in the 1st test match at Perth against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-should-play-all-three-formats-for-india-ab-de-villiers-2631097-2024-11-10",
      "headline": "AB de Villiers backs Sanju Samson to play all formats for IndiaFormer South African captain AB de Villiers wants Indian wicketkeeper-batter Sanju Samson to be included in India's all formats team. Samson has been in outstanding form, recently scoring back-to-back T20I centuries."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}