{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/date-of-filing-of-income-tax-returns-extended-from-july-31-to-september-15-2731366-2025-05-27",
      "headline": "Income tax return filing deadline extended from July 31 to September 15This extension mostly helps salaried employees and other individuals whose accounts don't need to be audited. These taxpayers generally have a July 31 deadline each year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-624-points-lower-nifty-below-24900-indusind-bank-ends-3-percent-up-2731287-2025-05-27",
      "headline": "Sensex closes 624 points lower, Nifty below 24,900; IndusInd Bank ends 3% upSensex closes 624 points lower, Nifty below 24,900; IndusInd Bank ends 3% up"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retired-before-march-2025-do-not-miss-ups-benefits-for-you-or-your-spouse-2731238-2025-05-27",
      "headline": "Retired before March 2025? Don't miss UPS benefits for you or your spouseIntroduced by the Central Government on April 1, 2025, the UPS provides additional benefits to those who have completed at least 10 years of qualifying service in the Central Government and their legally wedded spouses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-loans-bailouts-imf-world-bank-economic-crisis-never-recovers-terrorism-tax-2731219-2025-05-27",
      "headline": "Pakistan's bailout addiction: Why the IMF keeps saving a sinking economyWhy does Pakistan keep turning to the IMF for rescue, but never seems to recover? What's trapping its economy in this endless bailout loop? Dive in to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gdp-means-little-if-it-hides-empty-plates-analyst-on-india-inequality-crisis-2731215-2025-05-27",
      "headline": "'GDP means little if it hides empty plates': Analyst on India's inequality crisisIndia's economy may be booming, but over half its people still can't afford three meals a day, notes an analyst. In contrast, smaller African economies like Nigeria, Kenya, and Ghana rank higher in tackling hunger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/borana-weaves-listing-today-113-percent-premium-share-price-hold-book-profit-expert-view-2731190-2025-05-27",
      "headline": "Borana Weaves lists at 13% premium: Should you hold or book profit?Borana Weaves' listing was slightly below what many in the market had expected. The grey market premium (GMP) had been showing a possible listing gain of 20-22%, with the premium standing at Rs 43-45 before the listing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/could-take-50-years-gurugram-startup-founder-on-india-matching-japans-life-2731181-2025-05-27",
      "headline": "'Could take 50 years': Gurugram startup founder on India matching Japan's lifeIndia's economic journey faces significant hurdles as inequality, agricultural dependency, and regional disparities hinder progress towards matching Japan's quality of life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/volvo-to-slash-3000-white-collar-jobs-in-restructuring-move-report-employee-layoff-2731146-2025-05-27",
      "headline": "Volvo to slash 3,000 white-collar jobs in restructuring move: ReportA major portion of the cost-cutting will come from trimming white-collar roles, which account for around 40% of the company's total staff. Globally, the company has about 29,000 employees in Europe, 10,000 in Asia, and 3,000 in the Americas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/borana-weaves-share-price-listing-today-stock-rises-13-percent-premium-2731147-2025-05-27",
      "headline": "Borana Weaves share price: Stock extends gains after listing at 13% premiumWhile the listing price was above the issue price, it was slightly lower than what many expected. In the grey market, the stock had shown a premium of Rs 43-45 ahead of the listing, which suggested possible gains of around 20-22% on debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/good-news-for-exporters-as-key-remission-of-duties-and-taxes-on-exported-products-scheme-to-return-2731143-2025-05-27",
      "headline": "Good news for exporters as key tax refund scheme to return. Details hereThe Remission of Duties and Taxes on Exported Products (RoDTEP) scheme, which reimburses levies not covered by any other government programme, had been on hold since February 5 but will now resume."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indigo-co-founder-rakesh-gangwal-sells-airline-shares-term-sheet-report-2731127-2025-05-27",
      "headline": "IndiGo co-founder sells $1.36 billion of airline's shares: ReportThe shares were sold at 5,230.5 rupees ($61.35) each, the term sheet seen by Reuters showed, representing a discount of 3.5% to the company's closing price on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sagility-india-ltd-share-price-crash-fall-5-percent-today-why-stake-sale-ofs-promoter-2731101-2025-05-27",
      "headline": "Explained: Why Sagility India Ltd shares fell 5% todaySagility India Ltd said it remains confident of steady performance through the next financial year. It expects growth supported by a strong balance sheet, a wide client base, and consistent business execution. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/triptii-dimri-rs-6-crore-paycheck-spirit-prabhas-sandeep-reddy-vanga-2731346-2025-05-27",
      "headline": "Amid Vanga-Deepika row, Triptii Dimri bags biggest pay cheque of her careerActor Triptii Dimri has secured her biggest fee of Rs 6 crore for the upcoming film 'Spirit'. The project, directed by Sandeep Reddy Vanga, features 'Baahubali' star Prabhas in the lead role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ajay-devgn-jackie-chan-karate-kid-legends-bollywood-crossover-2731173-2025-05-27",
      "headline": "Ajay Devgn, Jackie Chan on action, crossover ahead of Karate Kid: Legends releaseActors Ajay Devgn and Jackie Chan discussed their possible collaboration ahead of 'Karate Kid: Legends' release. The film marks Ajay and Yug Devgan's debut in their voiceovers for the Hindi version of the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-earns-a-whopping-salary-for-lokesh-kanagarajs-rs-350-crore-coolie-2731242-2025-05-27",
      "headline": "Rajinikanth gets staggering Rs 150 crore salary for Rs 350 crore-Coolie: ReportDirector Lokesh Kanagaraj's 'Coolie' is reportedly made on a Rs 350-crore budget with Rajinikanth earning a record salary. The film is gearing up for an August release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/simbu-silambarasan-kamal-haasan-thug-life-spirituality-2731311-2025-05-27",
      "headline": "Actor Simbu on working with Kamal Haasan: I kept getting lost in his masteryActor Silambarasan aka Simbu expressed admiration for Kamal Haasan's mastery over his craft while filming Mani Ratnam's 'Thug Life'. He also discussed his personal spiritual growth and how it shapes his outlook on life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/billie-eilish-sweeps-2025-amas-bts-rm-wins-best-kpop-artist-full-winners-list-2731248-2025-05-27",
      "headline": "Billie Eilish sweeps 2025 AMAs, BTS' RM wins Best K-pop Artist. Full winners listSinger Billie Eilish dominated the 2025 American Music Awards, taking home multiple top honours, including Artist of the Year. Meanwhile, BTS's RM made waves by winning Best K-Pop Artist, marking a major solo milestone. The night celebrated a diverse mix of global talent across genres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-breaks-silence-paresh-rawal-hera-pheri-3-exit-do-not-call-him-foolish-watch-viral-video-2731292-2025-05-27",
      "headline": "Akshay doesn't 'appreciate' anyone calling Paresh 'foolish' for leaving Hera Pheri 3Akshay Kumar reacted to the media's question about Paresh Rawal being called 'foolish' for leaving 'Hera Pheri 3'. The actor defended his co-star and refrained from commenting on the issue, which is subjudice. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-attends-bff-wedding-in-spain-in-boho-chic-look-2731229-2025-05-27",
      "headline": "Alia Bhatt attends friend's wedding in Spain, stuns in boho-chic lookBollywood actor Alia Bhatt attended her friend's wedding in Spain. The actor wore a vibrant multi-coloured lehenga paired with a bandanna and sunglasses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-trailer-akshay-kumar-film-is-mad-house-of-laughter-glamour-mystery-2731269-2025-05-27",
      "headline": "Housefull 5 trailer: Akshay Kumar's film is mad-house of laughter, glamour, mysteryThe trailer of 'Housefull 5' is full of funny one-liners and self-deprecating humour. The film is led by Akshay Kumar, Abhishek Bachchan and Riteish Deshmukh with other popular and interesting faces adding more mystery to the whodunit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/deepika-padukone-rumoured-exit-from-spirit-sandeep-reddy-vanga-billi-jibe-explained-who-is-really-in-khundak-2731249-2025-05-27",
      "headline": "Deepika's rumoured exit from Spirit, Vanga's 'billi' jibe - who's really in khundak?Actor Deepika Padukone reportedly exited Sandeep Reddy Vanga's 'Spirit', leaving the director furious. So much so that he wrote a long note on social media without naming the actor but referring to her as 'billi in khundak', meaning 'an angry cat'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-i-like-ai-but-not-sure-ai-will-like-me-2731252-2025-05-27",
      "headline": "I like AI, but not sure if AI will like me : Kamal Haasan | ExclusiveIn an exclusive interview with Kamal Haasan, actor Kamal Haasan opened up about artificial intelligence's role in cinema ahead of his new film 'Thug Life'. The movie marks a historic reunion with director Mani Ratnam after nearly four decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/woman-detained-for-entering-actor-aditya-roy-kapurs-mumbai-home-met-domestic-help-brought-gifts-2731250-2025-05-27",
      "headline": "Dubai woman detained for trespassing on actor Aditya Roy Kapur's houseA woman was detained for trespassing at Aditya Roy Kapur's residence while he was away. This was not her first such incident. Last week, she reportedly attempted to gain access to superstar Salman Khan's residence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mani-ratnam-denies-film-with-naveen-polishetty-rukmini-vasanth-2731207-2025-05-27",
      "headline": "Mani Ratnam denies film with Naveen Polishetty, Rukmini Vasanth: That's news to meDirector Mani Ratnam, in a recent interview, dismissed rumours of making a light-hearted love story with actors Naveen Polishetty and Rukmini Vasanth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sunil-grover-introduces-multiverse-of-naidus-to-rana-naidu-star-rana-daggubati-2731200-2025-05-27",
      "headline": "Sunil Grover introduces multiverse of \"Naidu\" to Rana Naidu star Rana DaggubatiThe second season of 'Baahubali' star Rana Daggubati's Netflix series, 'Rana Naidu' is scheduled to start streaming on June 13. Ahead of its release, comedian Sunil Grover brought a unique twist to the tale as Shana Naidu. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannappa-film-hard-drive-missing-hyderabad-courier-theft-security-concerns-2731201-2025-05-27",
      "headline": "Kannappa film hard drive goes missing in Hyderabad, 2 suspects abscondA hard drive containing crucial 'Kannappa' film content has gone missing in Hyderabad. The incident raises serious security concerns within the film industry amid the ongoing police investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/thudarum-ott-release-jiohotstar-mohanlal-crime-drama-shobana-malayalam-film-2731188-2025-05-27",
      "headline": "Thudarum OTT release: Mohanlal, Shobana's crime drama to stream on JioHotstarThudarum OTT release date out: Malayalam crime drama 'Thudarum', starring Mohanlal and Shobana, will stream on JioHotstar from May 30. The film's gripping mystery and drama promise to engage viewers across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hina-khan-madhu-chopravikrant-massey-visit-sri-sri-ravi-shankars-ashram-shared-pics-2731129-2025-05-27",
      "headline": "Hina Khan, Vikrant Massey visit Sri Sri Ravi Shankar's ashram, share picsActor Hina Khan shared Instagram photos featuring Vikrant Massey and Priyanka Chopra's mother, Madhu Chopra. They visited Sri Sri Ravi Shankar's aashram in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-recalls-telling-children-sharam-aani-chahiye-over-rasha-thadani-dance-video-2731164-2025-05-27",
      "headline": "Farah Khan recalls telling children 'sharam aani chahiye' over Rasha's dance videoFilmmaker Farah Khan recently recalled telling her kids to be ashamed of themselves after watching 14-year-old Rasha Thadani dancing like a dream in a video shared by Raveena Tandon. She opened up about it in her vlog with Raveena Tandon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mistry-teaser-ram-kapoor-monk-remake-ocd-detective-drama-jiohotstar-2731158-2025-05-27",
      "headline": "Ram Kapoor headlines Indian adaptation of Monk. Watch teaserJioHotstar unveils 'Mistry' teaser starring Ram Kapoor as an OCD detective. The series adapts a popular American show, promising a fresh Indian perspective on unsolved mysteries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-blasts-diet-sabya-for-cannes-staircase-jab-paid-trolls-cant-dim-my-light-2731155-2025-05-27",
      "headline": "Paid trolls can't dim my light: Urvashi blasts Diet Sabya for Cannes staircase jabActor Urvashi Rautela shared a damning note on Instagram, criticising Diet Sabya for 'falsely' claiming that she blocked the staircase at the Cannes Film Festival for her photoshoot. She called the fashion watchdog page a 'paid troll' which targets hardworking outsiders like her. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pms-make-in-india-appeal-to-block-china-dumping-ganesh-idols-2731358-2025-05-27",
      "headline": "Even Ganesh idols imported: PM's 'Make in India' appeal to check China dumpingPM Modi made a strong appeal to people to prioritise 'Made in India' products, especially during festivals like Holi, Diwali, and Ganesh Puja."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/omar-abdullah-pahalgam-terror-attack-vote-bank-politics-baisaran-road-2731354-2025-05-27",
      "headline": "If we had cut trees...: Omar Abdullah's vague reply on Baisaran road connectivityOmar Abdullah brushed off allegations that vote-bank politics was behind the tourist hub of Baisaran not having a motorable road. This factor was exploited by the terrorists as they went on a killing spree."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-panchkula-mass-suicide-victims-kin-says-they-had-rs-20-crore-debt-got-death-threats-2731145-2025-05-27",
      "headline": "Had Rs 20 crore debt, got threats: Relative of Dehradun family who died by suicideHailing from Haryana's Hisar, one of the deceased, Praveen Mittal, had shifted to Panchkula 12 years back. He owned a scrap factory in Himachal Pradesh, which was later seized by the bank due to unpaid loans, according to Praveen's cousin Sandeep Agarwal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sardar-vallabhbhai-patel-differ-with-jawaharlal-nehru-on-kashmir-pok-pm-modi-history-what-happened-facts-2731347-2025-05-27",
      "headline": "Patel differed with Nehru on Kashmir, says PM Modi. Here are the factsPrime Minister Narendra Modi recently said the Congress government under Jawaharlal Nehru did not heed the advice of then-Home Minister Sardar Vallabhbhai Patel on the Kashmir issue in 1947. What was Patel's stand on military action to reclaim Pakistan-occupied Kashmir (POK) and taking the issue to the UN? Here's a look at how Patel and Nehru diverged on Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/deepika-padukone-rumoured-exit-from-spirit-sandeep-reddy-vanga-billi-jibe-explained-who-is-really-in-khundak-2731249-2025-05-27",
      "headline": "Deepika's rumoured exit from Spirit, Vanga's 'billi' jibe - who's really in khundak?Actor Deepika Padukone reportedly exited Sandeep Reddy Vanga's 'Spirit', leaving the director furious. So much so that he wrote a long note on social media without naming the actor but referring to her as 'billi in khundak', meaning 'an angry cat'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/date-of-filing-of-income-tax-returns-extended-from-july-31-to-september-15-2731366-2025-05-27",
      "headline": "Income tax return filing deadline extended from July 31 to September 15This extension mostly helps salaried employees and other individuals whose accounts don't need to be audited. These taxpayers generally have a July 31 deadline each year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/directionless-drift-why-congress-struggles-to-lead-opposition-2731324-2025-05-27",
      "headline": "Directionless drift: Why Congress struggles to lead OppositionThe Congress has lost three national elections in a row. And if one saw some shadow of a recovery in 2024, it was despite the party and not because of it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-nationwide-teachers-protest-ordinance-civil-servants-corner-yunus-government-after-army-chief-warning-2731205-2025-05-27",
      "headline": "Yunus govt facing protests across Bangladesh, teachers now halt workThe Muhammad Yunus-led interim government, already under pressure from the army and political parties, is facing protests from multiple quarters. Primary assistant schoolteachers across Bangladesh have halted work, seeking wage hikes, even as a strike by civil servants enters its fourth day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/power-naps-at-work-science-says-yes-now-convince-your-boss-2731381-2025-05-27",
      "headline": "Power naps at work? Science says yes. Now convince your bossPower naps are useful. No, we aren't just saying it, science backs it with substantial evidence. So, what's stopping your boss from letting you snooze?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejashwi-yadav-father-newborn-tej-pratap-bade-baba-bihar-lalu-prasad-family-2731372-2025-05-27",
      "headline": "Days after ouster, 'bade papa' Tej Pratap's post for newborn nephewTej Pratap congratulated his brother on the birth of his son a day after being expelled from the Rashtriya Janata Dal (RJD) by father Lalu Prasad Yadav for \"irresponsible behaviour\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-hires-donald-trump-brain-jason-miller-lobbying-washington-dc-pakistan-his-ex-bodyguard-us-president-2730913-2025-05-27",
      "headline": "India hires Trump's brain for lobbying, Pakistan his ex-bodyguardIn what seems like a clash of brain and brawn, India has tapped Trump's senior adviser, Jason Miller, and a communication strategist, while Pakistan has recruited Keith Schiller, the US President's long-time bodyguard. Schiller has been famous for delivering both resignation letters and punches on behalf of Trump. Here's more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/jammu-and-kashmir/story/kashmir-apple-crisis-ground-report-orchard-valley-pahalgam-qul-khurram-mir-2730839-2025-05-27",
      "headline": "Entrepreneur predicted Kashmir's apple crisis decade ago. How he's scripting a turnaroundTen years ago, a Harvard Business School study on Khuram Mir's apple venture predicted structural risks that could destabilize Kashmir's apple economy. It pointed to deep-rooted inefficiencies in the region's most critical industry. A decade later, Mir is experimenting with modern farming techniques and overhauling traditional farming methods - efforts that are slowly reshaping how apples are grown, packaged, and sold in Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/above-normal-rainfall-likely-in-june-predicts-weather-department-imd-monsoon-rain-2731352-2025-05-27",
      "headline": "Above normal rainfall likely in June, predicts weather departmentThe India Meteorological Department has predicted above-normal rainfall in the month of June this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/among-first-to-know-local-guardian-mamata-banerjee-visits-tejashwi-yadav-baby-2731247-2025-05-27",
      "headline": "Among first to know: 'Local guardian' Mamata Banerjee visits Tejashwi Yadav's babyFollowing West Bengal Mamata Banerjee's visit, Tejashwi Yadav revealed that she was the baby boy's 'local guardian', adding that she was already aware of the development and had been very supportive of the family."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/andhra-tenali-police-beat-3-youths-in-public-ysrcp-alleges-brutality-chandrababu-naidu-2731377-2025-05-27",
      "headline": "Video shows Andhra cops beating men in public, Jagan's party blames TDP ruleThree youths from underprivileged communities were publicly beaten by the police in Andhra Pradesh. The arrests reportedly followed a constable's complaint which included serious charges. YSRCP alleged police brutality and demanded an inquiry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/just-joking-french-president-macron-viral-video-wife-brigitte-shoves-face-plane-vietnam-2731066-2025-05-27",
      "headline": "Just joking around: Macron plays down viral video of wife shoving him on planeSpeaking to reporters after the clip went viral, Macron clarified that the exchange with his wife was being misunderstood and blamed disinformation efforts for distorting what he called a light-hearted moment. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ruining-her-life-court-orders-release-of-student-arrested-for-operation-sindoor-post-2731235-2025-05-27",
      "headline": "Ruining her life: Court says student arrested over Op Sindoor post must be releasedThe woman's advocate had appealed for an urgent hearing, citing her ongoing semester examinations, saying the student's liberty was snatched."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/triptii-dimri-rs-6-crore-paycheck-spirit-prabhas-sandeep-reddy-vanga-2731346-2025-05-27",
      "headline": "Amid Vanga-Deepika row, Triptii Dimri bags biggest pay cheque of her careerActor Triptii Dimri has secured her biggest fee of Rs 6 crore for the upcoming film 'Spirit'. The project, directed by Sandeep Reddy Vanga, features 'Baahubali' star Prabhas in the lead role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-loans-bailouts-imf-world-bank-economic-crisis-never-recovers-terrorism-tax-2731219-2025-05-27",
      "headline": "Pakistan's bailout addiction: Why the IMF keeps saving a sinking economyWhy does Pakistan keep turning to the IMF for rescue, but never seems to recover? What's trapping its economy in this endless bailout loop? Dive in to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-breaks-silence-paresh-rawal-hera-pheri-3-exit-do-not-call-him-foolish-watch-viral-video-2731292-2025-05-27",
      "headline": "Akshay doesn't 'appreciate' anyone calling Paresh 'foolish' for leaving Hera Pheri 3Akshay Kumar reacted to the media's question about Paresh Rawal being called 'foolish' for leaving 'Hera Pheri 3'. The actor defended his co-star and refrained from commenting on the issue, which is subjudice. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/properties-of-dismissed-punjab-police-constable-amandeep-kaur-frozen-in-ndps-case-2731045-2025-05-27",
      "headline": "Rolex, plots, phones: Punjab's 'Thar wali constable' arrested, assets under scannerAssets of dismissed Punjab police constable Amandeep Kaur have been frozen after she was arrested last month with 17 grams of heroin in her Mahindra Thar car as part of the state government's ongoing anti-drug campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-plans-nuclear-upgrade-after-operation-sindoor-drubbing-full-arsenal-list-2731272-2025-05-27",
      "headline": "Pakistan plans nuke upgrade after Operation Sindoor drubbing: Full arsenal listA recent US intelligence report highlighted a growing nuclear threat from Pakistan with Islamabad modernising its nuclear arsenal this year. Current estimates indicate that Pakistan has around 170 nuclear warheads in its inventory.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/if-you-drop-out-or-skip-classes-your-visa-may-be-revoked-us-warns-indian-foreign-students-2731159-2025-05-27",
      "headline": "Skip classes, lose your visa: US's big warning to Indian, foreign studentsThe United States on Tuesday warned Indian and other foreign students against skipping classes or leaving their programs amid the ongoing mass deportation row, stating that the students might risk losing their visas or may not be able to apply for any future US visa."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vaibhav-suryavanshi-steve-waugh-sachin-tendulkar-comparison-2731396-2025-05-27",
      "headline": "Vaibhav Suryavanshi is unbelievable, but no Sachin Tendulkar: Steve WaughSteve Waugh hailed Vaibhav Suryavanshi's IPL heroics but urged patience, reminding fans not to draw early comparisons with Sachin Tendulkar's legendary career built on consistency, context, and unmatched longevity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-hs-prannoy-second-round-singapore-open-2025-2731368-2025-05-27",
      "headline": "Sindhu, Prannoy advance to second round of Singapore OpenPV Sindhu, a two-time Olympic medalist, and HS Prannoy provided rare positives for India on an otherwise poor first day of the Singapore Open Super 750 badminton competition on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-mirra-andreeva-wins-vs-cristina-bucsa-victoria-azarenk-double-bagel-2731373-2025-05-27",
      "headline": "French Open: Andreeva fights through, Azarenka makes history with double bagelFrench Open: Mirra Andreeva overcame early nerves to dispatch Cristina Bucsa in straight sets, while veteran Victoria Azarenka rolled back the years with a flawless double bagel win. Both players advanced in dominant fashion on a drama-filled Day 3 at Roland Garros."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carlo-ancelotti-brazil-squad-neymar-snub-reason-rodrygo-2731338-2025-05-27",
      "headline": "Carlo Ancelotti excplains Neymar, Rodrygo snub from first Brazil squadCarlo Ancelotti's first Brazil squad sparked debate, but the coach stood firm on prioritising fitness and form over reputation—making it clear Neymar and Rodrygo remain key, just not quite ready yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dewald-brevis-chennai-super-kings-ms-dhoni-farewell-note-2731330-2025-05-27",
      "headline": "Dewald Brevis shares emotional farewell note, hopes to return to CSK in 2026IPL 2025: Dewald Brevis penned a heartfelt farewell note to CSK following the end of their season. The 22-year-old South African star impressed after being signed as a replacement player midway through the campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fan-asks-r-ashwin-to-leave-csk-off-spinner-admits-his-powerplay-mistakes-2731315-2025-05-27",
      "headline": "Fan asks R Ashwin to leave CSK, off-spinner admits his powerplay mistakesChennai Super Kings (CSK) all-rounder Ravichandran Ashwin recently responded to a fan's request to leave his IPL team. Ashwin didn't have a memorable season in IPL 2025 as he could only scalp seven wickets from nine innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/asian-athletics-championships-2025-day-1-gulveer-singh-annu-rani-servin-2731279-2025-05-27",
      "headline": "Asian Athletics 2025: Gulveer Singh wins 10k gold, Annu Rani misses podiumIndia began their Asian Athletics Championships campaign with a gold medal in the men's 10,000m by Gulveer Singh. Earlier on Tuesday, Servin Sebastian won bronze in men's 20km race walk in Gumi, South Korea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-five-questions-srh-have-to-answer-ahead-of-next-season-2731274-2025-05-27",
      "headline": "IPL 2025: Five questions Sunrisers Hyderabad have to answer ahead of next seasonSunrisers Hyderabad (SRH) didn't have a memorable season in the Indian Premier League 2025 (IPL 2025) as they failed to qualify for the playoffs. As they move to the next season, they will need answers to several questions to improve their performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-rcb-top-two-finish-extremely-important-dinesh-karthik-2731206-2025-05-27",
      "headline": "RCB's top-2 finish extremely important: Dinesh Karthik before LSG showdownIPL 2025: RCB's clash against LSG will decide their playoff path this season, with a win securing a top-two finish and Qualifier 1 spot, while a loss sends them into the Eliminator against the Mumbai Indians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-gets-steve-waughs-backing-as-test-captain-2731170-2025-05-27",
      "headline": "Gill gets Steve Waugh's backing as Test captain: Indian cricket in good handsIndia's new Test captain Shubman Gill has got the backing of legendary Australia captain Steve Waugh as he's set to make his captaincy debut in the upcoming tour of England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-shreyas-iyer-leadership-robin-uthappa-kkr-underappreciated-2731166-2025-05-27",
      "headline": "Shreyas Iyer felt underappreciated at KKR: Robin Uthappa praises PBKS leaderIPL 2025: Robin Uthappa credited Shreyas Iyer's success with Punjab Kings to his natural leadership, stating the skipper was long undervalued at his former franchise KKR, despite guiding them to a title just last season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/asian-athletics-championships-2025-day-1-gulveer-singh-annu-rani-servin-2731279-2025-05-27",
      "headline": "Asian Athletics 2025: Gulveer Singh wins 10k gold, Annu Rani misses podiumIndia began their Asian Athletics Championships campaign with a gold medal in the men's 10,000m by Gulveer Singh. Earlier on Tuesday, Servin Sebastian won bronze in men's 20km race walk in Gumi, South Korea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-five-questions-srh-have-to-answer-ahead-of-next-season-2731274-2025-05-27",
      "headline": "IPL 2025: Five questions Sunrisers Hyderabad have to answer ahead of next seasonSunrisers Hyderabad (SRH) didn't have a memorable season in the Indian Premier League 2025 (IPL 2025) as they failed to qualify for the playoffs. As they move to the next season, they will need answers to several questions to improve their performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-rcb-top-two-finish-extremely-important-dinesh-karthik-2731206-2025-05-27",
      "headline": "RCB's top-2 finish extremely important: Dinesh Karthik before LSG showdownIPL 2025: RCB's clash against LSG will decide their playoff path this season, with a win securing a top-two finish and Qualifier 1 spot, while a loss sends them into the Eliminator against the Mumbai Indians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-gets-steve-waughs-backing-as-test-captain-2731170-2025-05-27",
      "headline": "Gill gets Steve Waugh's backing as Test captain: Indian cricket in good handsIndia's new Test captain Shubman Gill has got the backing of legendary Australia captain Steve Waugh as he's set to make his captaincy debut in the upcoming tour of England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-shreyas-iyer-leadership-robin-uthappa-kkr-underappreciated-2731166-2025-05-27",
      "headline": "Shreyas Iyer felt underappreciated at KKR: Robin Uthappa praises PBKS leaderIPL 2025: Robin Uthappa credited Shreyas Iyer's success with Punjab Kings to his natural leadership, stating the skipper was long undervalued at his former franchise KKR, despite guiding them to a title just last season."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}