{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-jeff-bezos-tesla-stock-space-x-us-electiosn-donald-trump-2638708-2024-11-23",
      "headline": "Jeff Bezos denies Musk's claim on Tesla stock advice: '100% not true'Elon Musk said on social media platform X that Bezos had advised people to sell their Tesla and SpaceX shares, predicting Donald Trump's electoral defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-founder-told-us-ally-to-flee-the-us-to-avoid-testifying-report-2637906-2024-11-22",
      "headline": "Byju's founder told US ally to flee the US to avoid testifying: ReportThe businessman, William R. Hailer, testified before US Bankruptcy Judge John T. Dorsey, alleging that Byju Raveendran offered him a lucrative job and sent him a $10,700 plane ticket to Dubai just two days before he was scheduled to testify."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-today-sensex-2000-points-nifty-above-23900-2637809-2024-11-22",
      "headline": "Sensex ends nearly 2,000 points higher, Nifty above 23,900A broad-based recovery in information technology (IT), financial, banking and energy stocks spearheaded the recovery. A sharp rebound in Adani Group stocks also added to the positive momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-surges-2000-points-key-factors-adani-shares-2637775-2024-11-22",
      "headline": "Sensex surges 2,000 points, Rs 7 lakh crore added: 4 key factors behind rallyThe Sensex was up 2039.44 points to 79,195.23 at 2:57 pm, while the NSE Nifty50 gained 587.90  to 23,938.75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-hits-record-high-within-touching-distance-of-100000-dollar-milestone-2637714-2024-11-22",
      "headline": "Bitcoin hits record high, within touching distance of $100,000 milestoneThe world's leading cryptocurrency topped $99,300, coming within striking distance of the psychological milestone that many experts had anticipated after the US election results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-jumps-1200-points-nifty-3-things-to-know-stock-market-bull-run-2637706-2024-11-22",
      "headline": "Sensex jumps 1,200 points: 3 things to know about today's stock market bull runThe BSE Sensex climbed 1,193.90 points to cross 78,340.07, while the NSE Nifty advanced 371.50 points to reach 23,721.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-rises-1000-points-nifty-rebounds-adani-stocks-in-green-2637683-2024-11-22",
      "headline": "Sensex jumps over 1,000 points as most Adani Group stocks rebound sharplyStock market today: The S&P BSE Sensex climbed 1,034.76 points to 78,190.55 by 12:42 pm, while the NSE Nifty50 gained 329.15 points to reach 23,679.05. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-accused-of-racial-discrimination-at-australian-coal-mining-unit-2637668-2024-11-22",
      "headline": "Adani Group accused of racial discrimination at Australian coal mining unitAdani Bribery Case: The Nagana Yarrbayn Wangan & Jagalingou Cultural Custodians in Queensland state filed a complaint alleging serious racial discrimination by Bravus Mining and Resources, an Adani Group unit."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-bribery-case-sp-lowers-outlook-on-3-adani-units-raises-funding-concerns-2637623-2024-11-22",
      "headline": "Adani bribery case: S&P lowers outlook on 3 Adani units, raises funding concernsGautam Adani Case: S&P expressed concerns that the accusations could erode investor confidence, impair funding access, and escalate borrowing costs for the group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zinka-logistics-listing-stock-market-debut-investors-hold-or-exit-2637602-2024-11-22",
      "headline": "Zinka Logistics makes tepid market debut: Should investors hold or exit?Zinka Logistics listing: Shares listed at Rs 280.90 on the National Stock Exchange (NSE), a 2.89% premium to the issue price of Rs 273. On the Bombay Stock Exchange (BSE), the stock opened at Rs 279.05, reflecting a 2.22% premium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-layoffs-500-employees-restructuring-drive-sales-profitability-2637591-2024-11-22",
      "headline": "Ola Electric layoffs: 500 employees likely to lose jobs amid restructuringOla Electric Layoffs News: The move aims to streamline operations, eliminate redundant roles, and enhance profitability. The restructuring process, which began months ago, is expected to conclude by December 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-november-22-2024-precious-metals-record-hike-on-mcx-2637583-2024-11-22",
      "headline": "Gold, silver price today, November 22, 2024: Precious metals record hike on MCXGold Price Today: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-fall-second-straight-day-bribery-charges-check-top-losers-2637582-2024-11-22",
      "headline": "Adani Group stocks extend slide amid bribery charges. Details hereAdani Group stocks: This marks the second consecutive session of heavy losses for the conglomerate, with Thursday's rout wiping out Rs 2.25 lakh crore from the group's market capitalisation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-sagar-adani-gautam-adani-group-bribery-case-bribe-notes-indictment-solar-energy-corruption-2637574-2024-11-22",
      "headline": "How Sagar Adani's 'bribe notes' unravelled $250 million schemeAdani Bribery Case: At the heart of the complex bribery scheme for which Gautam Adani and his associates have been indicted are the industrialist's nephew Sagar Adani and the detailed \"bribe notes\" he kept on his mobile phone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-jump-3-percent-today-after-brokerage-bernsteins-update-should-you-buy-2637570-2024-11-22",
      "headline": "Paytm shares jump 3% today after brokerage Bernstein's update. Should you buy?Paytm share price: With shares up 34% this year and 136% in six months, Paytm's growth potential continues to attract investor interest, although challenges remain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-bounce-back-despite-adani-stocks-enterprises-green-ports-triggering-sell-off-2637558-2024-11-22",
      "headline": "Sensex, Nifty bounce back; Adani Energy shares down 5%Stock Market Today: The S&P BSE Sensex was up 496.10 points to 77,651.89, while the NSE Nifty50 gained 72.25 points to 23,422.15 "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-adani-green-airtel-lti-jsw-zinka-stocks-to-watch-today-2637523-2024-11-22",
      "headline": "Adani Enterprises, Adani Green, Airtel, LTI, JSW, Zinka: Stocks to watch todayBroader market indices also faced selling pressure, with volatility surging across sectors. As trading opens today, several stocks are expected to remain in focus due to recent developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/kenya-cancels-700-million-deal-with-adani-group-after-us-charges-2637344-2024-11-21",
      "headline": "Kenya cancels $700 million deal with Adani Group after US chargesKenya has terminated a $700 million agreement with the Adani Group following a US indictment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kenya-cancels-proposed-deals-with-adani-group-after-us-indictment-over-bribery-2637298-2024-11-21",
      "headline": "Kenya cancels $730 million proposed deals with Adani Group after US indictmentKenyan President William Ruto has ordered the cancellation of several proposed deals with the Adani Group after the US indicted industrialist Gautam Adani in a bribery case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-over-400-points-lower-nifty-dips-as-adani-shares-crash-2637166-2024-11-21",
      "headline": "Sensex ends over 400 points lower, Nifty dips as Adani shares crashThe S&P BSE Sensex declined 422.59 points to close at 77,155.79, while the NSE Nifty50 shed 168.60 points to settle at 23,349."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/maharashtra-assembly-election-result-mahayuti-challenge-cm-face-eknath-shinde-or-devendra-fadnavis-2638674-2024-11-23",
      "headline": "Eknath Shinde or Devendra Fadnavis, who will Mahayuti pick as CM?The Maharashtra Assembly election results show Mahayuti sweeping the polls. The big question now is who the NDA will make the Maharashtra Chief Minister. Will it retain Eknath Shinde, who has won over the voters as CM, or make Devendra Fadnavis, who led BJP's stellar performance, the Chief Minister?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-ind-vs-aus-live-score-perth-test-day-2-reactions-bgt-jasprit-bumrah-pat-cummins-2638536-2024-11-23",
      "headline": "1st Test Day 2 Live: Rahul, Rahul, Jaiswal take India's lead to 130 at TeaAUS vs IND, 1st Test Day 2 Live Updates and Reactions: Yashasvi Jaiswal and KL Rahul have extended India's lead to 130 in the second innings. Both batters have looked at ease as the Australians have struggled to make any breakthrough despite using six bowlers, including Marnus Labuschagne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/shiv-sena-ubt-leader-sanjay-raut-questions-maharashtra-result-after-mva-drubbing-says-not-possible-maharashtra-polls-2638679-2024-11-23",
      "headline": "Not possible: Sanjay Raut questions Maharashtra result after MVA drubbingEarly trends show the Mahayuti alliance leading in 221 seats, leaving the opposition Maha Vikas Aghadi (MVA) trailing far behind with a lead in just 52 seats. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/wayanad-by-election-results-2024-live-updates-assembly-lok-sabha-bypoll-vote-counting-up-kerala-priyanka-gandhi-vadra-navya-haridas-bjp-congress-2638557-2024-11-23",
      "headline": "Live: Debutante Priyanka Gandhi leads by over 3.4 lakh votes in WayanadWayanad election result live: The by-election in Wayanad was held on November 13, 2024. In the Wayanad bypolls, Priyanka Gandhi Vadra is leading with 4,81,689 votes, while her rival Sathyan Mokeri has secured 1,62,490 votes. This gives Priyanka Gandhi a lead of 3,19,199 votes as the race continues. Both candidates focused on development and grassroots initiatives, appealing to rural and urban voters. The Wayanad election has drawn attention for its potential impact on the region's political landscape. Follow India Today for the latest updates regarding Wayanad bypolls.          \t"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-arjun-re-release-theatre-shah-rukh-khan-salman-khan-will-the-gen-z-watch-the-film-2637279-2024-11-23",
      "headline": "Mere Karan Arjun aayenge: But, will they be welcomed by Gen Z?The re-release of the iconic film Karan Arjun has generated excitement with both millennials and Gen Z eager to witness the legendary duo of Shah Rukh Khan and Salman Khan on the big screen once more. With its unforgettable dialogues and timeless appeal, the film continues to captivate audiences across generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-election-results-2024-live-updates-vote-counting-bjp-shiv-sena-ncp-mahayuti-mva-2637992-2024-11-22",
      "headline": "LIVE: Mahayuti set for landslide win in Maharashtra, ahead in over 200 seats Maharashtra Assembly Election Results 2024 Live: The Mahayuti alliance, comprising the BJP, Shiv Sena, and NCP, is set for a landslide victory in Maharashtra. All alliance partners have showcased an impressive performance, according to the trends, with their lead crossing over 200 out of the 288 seats. Meanwhile, the Maha Vikas Aghadi (MVA), which includes the Congress, Shiv Sena (UBT), and NCP (SP), is limited to just around 50-60 seats, marking a massive setback. The exit polls had predicted a close fight with a slight edge for the Mahayuti. However, the current trends indicate a resounding victory for the NDA. Stay tuned to IndiaToday.in for the latest results and updates as the counting progresses in Maharashtra."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gautam-adani-us-prosecutors-azure-whistleblowers-flagged-in-the-alleged-bribery-scandal-2638544-2024-11-23",
      "headline": "Adani row: What the Azure whistleblowers flagged in the alleged bribery scandalFormer Azure executives, along with business tycoon Gautam Adani, have been named in unsealed court documents by the US Attorney for the Eastern District of New York and the FBI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/worli-assembly-election-result-2024-live-update-milind-deora-aaditya-thackeray-shiv-sena-mns-maharashtra-2638005-2024-11-22",
      "headline": "Worli LIVE: Aaditya Thackeray takes lead again in tight fight with Milind DeoraWorli Assembly Election Results 2024 Live: Worli witnesses a three-way contest between Chief Minister Eknath Shinde-led Shiv Sena's Rajya Sabha MP Milind Deora, Shiv Sena (UBT)'s Aaditya Thackeray, and Maharashtra Navnirman Sena (MNS) candidate Sandeep Deshpande. Mahayuti candidate Deora, who quit the Congress and joined the Shinde Sena earlier this year, is hopeful of wresting the seat from MVA's Aaditya Thackeray, the son of Uddhav Thackeray and the current MLA from Worli. MNS's Deshpande is also optimistic about a surprise in this high-profile seat. Stay tuned to India Today as we bring you all the latest updates from Worli as the Maharashtra Assembly election counting progresses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/yeh-kaali-kaali-ankhein-2-review-tahir-raj-bhasin-aanchal-singh-shweta-tripathi-gurmeet-choudhary-arunoday-singh-series-leave-you-hooked-2638550-2024-11-23",
      "headline": "Yeh Kaali Kaali Ankhein 2 review: Tahir Raj Bhasin is brilliant in thrilling seriesReleased-Fri Nov 22, 2024Yeh Kaali Kaali Ankhein 2, a sequel to the popular series, continues the thrilling narrative with new twists and challenges for its characters. The show keeps viewers engaged with its intense storyline and strong performances, particularly by Tahir Raj Bhasin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/yoda-diagnostics-launches-beat-the-diabetes-campaign-to-raise-awareness-and-promote-personalized-diabetes-care-2636609-2024-11-20",
      "headline": "Yoda Diagnostics Launches 'Beat the Diabetes' Campaign to Raise Awareness and Promote Personalized Diabetes CareEmpowering Personalized Diabetes Care: Yoda Diagnostics' 'Beat the Diabetes' Campaign Promotes Genetic-Based Medication Plans"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/anushakti-nagar-results-maharashtra-swara-bhaskar-husband-fahad-ahmad-sana-malik-2638634-2024-11-23",
      "headline": "Anushakti Nagar results: Fahad Ahmad, actor Swara Bhasker's husband, leadsAnushakti Nagar results: Fahad Ahmad, husband of actor Swara Bhasker and NCP (SCP) leader, is leading in the key Maharashtra constituency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-election-results-eknath-shinde-thank-you-nda-landslide-india-bloc-ladli-behana-2638705-2024-11-23",
      "headline": "Thank you, ladli behena, kisan: Eknath Shinde after NDA landslide in MaharashtraElection Commission trends show Mahayuti is leading in 218 seats in the 288-member Assembly, with the opposition Maha Vikas Aghadi (MVA) trailing far behind with a lead in 56 seats. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/whats-behind-the-rise-of-pre-stitched-sarees-in-india-2635880-2024-11-23",
      "headline": "What's behind the rise of pre-draped sarees in IndiaWearing a saree no longer demands the patience to carefully wrap it around your body, create precise pleats, and perfectly drape the pallu before stepping out to slay - thanks to the advent of pre-draped sarees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/palakkad-assembly-bypolls-bjp-candidate-c-krishnakumar-congress-rahul-mamkootathil-2638671-2024-11-23",
      "headline": "Palakkad bypolls: Congress's Rahul Mamkootathil comes in from behind to take leadPalakkad Election Result 2024: BJP candidate C Krishnakumar, who has secured 34,210 votes in Palakkad bypolls, and is trailing by a margin of 15,299 votes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-election-results-vidarbha-mahayuti-mva-2638613-2024-11-23",
      "headline": "NDA's strong show in Vidarbha, Maharashtra gamechanger, after Lok Sabha blowMaharashtra election results 2024: The BJP-led Mahayuti has taken a massive lead in Vidarbha region, which is home to a large chunk of both large- and small-scale farmers, shows very early trends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jharkhand-assembly-election-results-2024-live-updates-vote-counting-jmm-congress-bjp-2638555-2024-11-23",
      "headline": "Live: INDIA pulls ahead in Jharkhand, comfortably over halfway mark  Jharkhand Assembly Election Results 2024 Live: As the counting of the vote is underway, Hemant Soren-led INDIA bloc has orchestrated a stunning turnaround in the Assembly polls. Defying exit poll predictions, the JMM is on the way to forming a government for a third term, with the alliance leading in nearly 50 seats, way above the halfway mark of 42. The BJP-led NDA is ahead in 30 seats. Voter turnout in Jharkhand stood at 68.45 percent. Follow India Today for the latest updates regarding Jharkhand elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-calls-alcohol-gun-censorship-film-soft-targets-dil-luminati-tour-lucknow-concert-2638645-2024-11-23",
      "headline": "Diljit Dosanjh: If you want alcohol censorship in songs, do it for cinema tooIn a new video from his Lucknow concert, singer Diljit Dosanjh highlighted the disparity in censorship rules for films and songs. He also said how singers are easily 'soft targets.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-sports-world-entertainment-science-433-23-11-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/dubai-now-requires-hotel-booking-return-ticket-for-tourist-visa-approval-2638661-2024-11-23",
      "headline": "Dubai now requires hotel booking, return ticket for tourist visa approvalPlanning a trip to Dubai? Ensure a seamless experience by booking your hotel and returning tickets in advance, as these are now mandatory for tourist visa applications. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-election-results-mva-mahayuti-congress-ncp-bjp-sena-eknath-shinde-ajit-pawar-devendra-fadnavis-uddhav-thackeray-nana-patole-2638523-2024-11-23",
      "headline": "Mahayuti takes massive lead in Maharashtra, crosses 200 seats in big battleMaharashtra Election Results: The ruling Mahayuti coalition of BJP, Eknath Shinde-led Shiv Sena and Ajit Pawar's NCP is aiming to retain power, while the MVA consisting of the Congress, Shiv Sena (UBT) and Sharad Pawar's NCP, is aiming for a comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/man-hi-tea-experience-mumbai-taj-mahal-palace-impresses-internet-viral-video-2638651-2024-11-23",
      "headline": "Man's high-tea experience at Mumbai's Taj Mahal Palace impresses Internet. VideoA video of a content creator living his dream of having tea at Mumbai's iconic Taj Mahal Palace has charmed the internet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-ind-vs-aus-jasprit-bumrah-11th-5-wicket-haul-in-tests-2638593-2024-11-23",
      "headline": "Jasprit Bumrah runs riot vs Australia with 11th 5-wicket-haul in TestsIndia captain Jasprit Bumrah continued to run riot against Australia on Saturday, 23 November. With the wicket of Alex Carey, Bumrah completed his 11th five-wicket haul in Test cricket. This was also Bumrah's 2nd 5-wicket-haul vs Australia.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/video/maharashtra-elections-congresss-supriya-shrinate-on-early-poll-trends-2638654-2024-11-23",
      "headline": "Leads are big, BJP has reason to celebrate: Congress's Supriya Shrinate Congress leader Supriya Shrinate while speaking to India Today on the early trends of Maharashtra and Jharkhand polls, said that the BJP-NDA's lead in Maharashtra is big. She said, \"If the leads are what they are, then BJP has a reason to celebrate.\"\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/bandra-east-vandre-east-election-results-2024-live-updates-vote-counting-zeeshan-siddique-varun-sardesai-mahayuti-maha-vikas-aghadi-2638580-2024-11-23",
      "headline": "Bandra East Live: Shiv Sena's (UBT) Varun Sardesai leads by 5,497 votes Bandra East Election Result 2024 Live: The Vandre East Assembly constituency, that covers Mumbai's Bandra East, is witnessing a fierce contest with Shiv Sena (UBT) candidate Varun Sardesai leading against his rival candidate and NCP leader Zeeshan Siddique. The constituency is a mix of socio-economic groups, including strongholds of the middle and lower-middle class, Muslim-majority areas like Behrampada, and affluent zones in the Bandra Kurla Complex (BKC) business district. The Shiv Sena (UBT) aims to reclaim its former bastion, home to the Thackeray family residence, 'Matoshri,' in Kalanagar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kanguva-box-office-collection-day-9-detailed-report-suriya-film-on-a-sorry-run-no-hope-left-2638720-2024-11-23",
      "headline": "Kanguva box office Day 9: Suriya's film on a sorry run, no hope leftSuriya's highly-anticipated film Kanguva saw a dismal performance at the box office. The film's second weekend collections don't seem promising, and all the hopes of its redemption at the ticket window seem baseless at this point. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brad-pitt-george-clooneys-wolfs-2-cancelled-apple-tv-plus-director-jon-watts-confirms-2638691-2024-11-23",
      "headline": "Brad Pitt, George Clooney's Wolfs 2 cancelled, director confirmsPlans for a sequel to the crime thriller Wolfs, starring Brad Pitt and George Clooney, have been cancelled by director Jon Watts. The project, previously under development with Apple, will no longer proceed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-atlee-next-reincarnation-action-drama-kamal-haasan-rajinikanth-2638702-2024-11-23",
      "headline": "Salman Khan joins Atlee's next reincarnation action drama: ReportSalman Khan has reportedly joined filmmaker Atlee for his next grand two-hero reincarnation action drama. As per reports, the film is expected to begin production in the summer of 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neelam-kothari-breaks-silence-on-affair-rumours-with-govinda-that-was-not-2638692-2024-11-23",
      "headline": "Neelam Kothari breaks silence on affair rumours with Govinda: That was not...While Govinda said in the 1990 interview that he wanted to marry Neelam Kothari once, she denied their link-up rumours in an interview recently. The Fabulous Lives vs Bollywood Wives star blamed the media for printing such gossip about stars' personal lives. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tahlia-mcgrath-to-lead-australia-side-in-women-odi-vs-india-in-healy-absence-2638709-2024-11-23",
      "headline": "Tahlia McGrath to lead Australia side in women's ODI vs India in Healy's absenceVeteran all-rounder Tahlia McGrath will lead the Australian women's side against India in regular skipper Alyssa Healy's absence in the three-match ODI series next month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tilak-varma-151-smat-record-broken-highest-indian-score-t20-3-consecutive-hundred-2638675-2024-11-23",
      "headline": "Tilak Varma scripts T20 world record with mammoth 151Hyderabad captain Tilak Varma scripted history by becoming the first batter to score three consecutive T20 centuries. The 22-year-old's record-breaking spree culminated in a jaw-dropping 151 off just 67 balls in Hyderabad's Syed Mushtaq Ali Trophy opener.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-sunil-gavaskar-calls-out-fake-blog-post-jasprit-bumrah-virat-kohli-2638672-2024-11-23",
      "headline": "Gavaskar calls out fake blog post about Bumrah, Kohli, threatens legal actionLegendary Sunil Gavaskar has threatened legal action against a website for publishing a blog under his name. The website in question had published an article titled 'A New Era in Leadership: Bumrah's Captaincy and Kohli's Leadership Revive Team India' under Gavaskar's name.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-starc-hazlewood-frustrate-india-10-wicket-test-stand-list-2638666-2024-11-23",
      "headline": "When Australian tail frustrated India: Usual suspect Starc solid in PerthMitchell Starc frustrated Indian bowlers with a gritty 26 off 112 balls, supported by Josh Hazlewood's unbeaten 7, as Australia reached 104 on day two of the Perth Test. Their crucial 25-run last-wicket stand reduced India's lead to 46.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-kumar-reddy-perth-test-2638648-2024-11-23",
      "headline": "Tiger in the jungle: Nitish Kumar Reddy on 'inspirational' tattoo AUS vs IND: Nitish Kumar Reddy opened up on the tattoo he has. The all-rounder made his debut in the Perth Test at the Optus Stadium along with Harshit Rana and Nathan McSweeney. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anushka-sharma-spotted-in-perth-cheers-for-virat-kohli-on-action-packed-day-2-2638637-2024-11-23",
      "headline": "Anushka Sharma in attendance in Perth, cheers for Kohli on action-packed Day 2India vs Australia: Bollywood actress Anushka Sharma was in attendance in the stands on Saturday, enthusiastically cheering for her husband, Virat Kohli, during the action-packed Day 2 of the Perth Test. The star-studded moment delighted fans as photos and videos of Anushka's presence quickly went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-starc-harshit-on-field-banter-day-2-perth-test-2638612-2024-11-23",
      "headline": "I bowl faster than you: Starc, Harshit's on-field banter on Day 2 of Perth TestBorder-Gavaskar Trophy: Mitchell Starc and Harshit Rana were involved in on-field banter on Day 2 of the ongoing Perth Test where the Australia great reminded the India debutant that he bowls faster than him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-ind-vs-aus-jasprit-bumrah-11th-5-wicket-haul-in-tests-2638593-2024-11-23",
      "headline": "Jasprit Bumrah runs riot vs Australia with 11th 5-wicket-haul in TestsIndia captain Jasprit Bumrah continued to run riot against Australia on Saturday, 23 November. With the wicket of Alex Carey, Bumrah completed his 11th five-wicket haul in Test cricket. This was also Bumrah's 2nd 5-wicket-haul vs Australia.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/spot-fixing-in-abu-dhabi-t10-league-uae-bowler-under-scanner-for-huge-no-ball-2638574-2024-11-23",
      "headline": "Spot fixing in Abu Dhabi T10 League? UAE bowler under scanner for huge no-ballUAE cricketer Hazrat Bilal found himself at the centre of controversy during the Abu Dhabi T10 League after delivering a massive no-ball in Samp Army's match against the New York Strikers. The incident drew widespread attention, including a reaction from Australian cricketer David Warner on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-bgt-mitchell-starc-kl-rahul-drs-wicket-controversy-2638573-2024-11-23",
      "headline": "Starc brushes off KL Rahul DRS controversy: Regulation wicketIndia vs Australia: Australia pacer Mitchell Starc has brushed off the DRS controversy from Day 1 as a regulation wicket. On Friday, KL Rahul's wicket created furore amongst cricket fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-starc-harshit-on-field-banter-day-2-perth-test-2638612-2024-11-23",
      "headline": "I bowl faster than you: Starc, Harshit's on-field banter on Day 2 of Perth TestBorder-Gavaskar Trophy: Mitchell Starc and Harshit Rana were involved in on-field banter on Day 2 of the ongoing Perth Test where the Australia great reminded the India debutant that he bowls faster than him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-ind-vs-aus-jasprit-bumrah-11th-5-wicket-haul-in-tests-2638593-2024-11-23",
      "headline": "Jasprit Bumrah runs riot vs Australia with 11th 5-wicket-haul in TestsIndia captain Jasprit Bumrah continued to run riot against Australia on Saturday, 23 November. With the wicket of Alex Carey, Bumrah completed his 11th five-wicket haul in Test cricket. This was also Bumrah's 2nd 5-wicket-haul vs Australia.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/spot-fixing-in-abu-dhabi-t10-league-uae-bowler-under-scanner-for-huge-no-ball-2638574-2024-11-23",
      "headline": "Spot fixing in Abu Dhabi T10 League? UAE bowler under scanner for huge no-ballUAE cricketer Hazrat Bilal found himself at the centre of controversy during the Abu Dhabi T10 League after delivering a massive no-ball in Samp Army's match against the New York Strikers. The incident drew widespread attention, including a reaction from Australian cricketer David Warner on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-bgt-mitchell-starc-kl-rahul-drs-wicket-controversy-2638573-2024-11-23",
      "headline": "Starc brushes off KL Rahul DRS controversy: Regulation wicketIndia vs Australia: Australia pacer Mitchell Starc has brushed off the DRS controversy from Day 1 as a regulation wicket. On Friday, KL Rahul's wicket created furore amongst cricket fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wi-vs-ban-1st-test-day-1-report-louis-athanaze-west-indies-edge-day-one-2638568-2024-11-23",
      "headline": "1st Test: Louis, Athanaze give West Indies edge on day oneMikyle Louis and Alick Athanaze fell agonizingly short of maiden centuries as the West Indies rallied from 25 for 2 to 250 for 5 against Bangladesh on the first day of the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-ind-vs-aus-live-score-perth-test-day-2-reactions-bgt-jasprit-bumrah-pat-cummins-2638536-2024-11-23",
      "headline": "1st Test Day 2 Live: Rahul, Rahul, Jaiswal take India's lead to 130 at TeaAUS vs IND, 1st Test Day 2 Live Updates and Reactions: Yashasvi Jaiswal and KL Rahul have extended India's lead to 130 in the second innings. Both batters have looked at ease as the Australians have struggled to make any breakthrough despite using six bowlers, including Marnus Labuschagne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nitish-kumar-reddy-murali-vijay-border-gavaskar-trophy-2024-25-aus-vs-ind-2638530-2024-11-23",
      "headline": "Murali Vijay hails 'cool and calm' Nitish Kumar Reddy after impressive Test debutFormer India cricketer Murali Vijay hailed all rounder Nitish Kumar Reddy for his impressive Test debut on Day 1 of the first Test against Australia in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rahul-dravid-keeps-track-rajasthan-royals-auction-planning-perth-test-watch-2638528-2024-11-22",
      "headline": "Watch: Amid intense IPL auction planning, Dravid keeps track of Perth Test scoresIndia's former head coach Rahul Dravid, now leading Rajasthan Royals in the IPL, showcased his enduring passion for Indian cricket as he keenly followed the national side's stunning Day 1 comeback in the Perth Test against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/aus-vs-ind-perth-witnesses-17-wickets-on-day-1-most-since-1952-in-australia-2638522-2024-11-22",
      "headline": "AUS vs IND: Perth witnesses 17 wickets on Day 1, most since 1952 in AustraliaThe day 1 of the first Test between India and Australia at the Optus Stadium in Perth witnessed 17 wickets falling in a day as Australia finished on 67/7 at stumps in reply to India's first innings score of 150."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-jasprit-bumrah-perth-test-captaincy-cheteshwar-pujara-perfect-start-2638518-2024-11-22",
      "headline": "'Bumrah gave India the perfect start': Pujara praises pacer's Perth captaincyIndia batter Cheteshwar Pujara heaped praise on Jasprit Bumrah for his sensational 4/17 spell, which turned the tide for India on Day 1 of the Perth Test. Bumrah's captaincy and bowling brilliance inspired a remarkable fightback after a batting collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-hardik-pandya-krunal-pandya-syed-mushtaq-ali-trophy-2024-25-baroda-2638517-2024-11-22",
      "headline": "Hardik Pandya reports to brother Krunal ahead of Syed Mushtaq Ali Trophy returnStar India all rounder Hardik Pandya reported to his brother Krunal ahead of his return in the Syed Mushtaq Ali Trophy 2024 for Baroda as he shared photographs on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-jasprit-bumrah-ten-unplayable-balls-perth-test-spell-steve-smith-duck-2638502-2024-11-22",
      "headline": "Perth Test: 10 unplayable balls in Jasprit Bumrah's spell from hellJasprit Bumrah's fiery 4/17 spell as stand-in captain salvaged India's position after a dismal batting display on Day 1 of the Perth Test, leaving Australia reeling at 67/7 and showcasing his brilliance as a leader and bowler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/aus-vs-ind-perth-witnesses-17-wickets-on-day-1-most-since-1952-in-australia-2638522-2024-11-22",
      "headline": "AUS vs IND: Perth witnesses 17 wickets on Day 1, most since 1952 in AustraliaThe day 1 of the first Test between India and Australia at the Optus Stadium in Perth witnessed 17 wickets falling in a day as Australia finished on 67/7 at stumps in reply to India's first innings score of 150."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-jasprit-bumrah-perth-test-captaincy-cheteshwar-pujara-perfect-start-2638518-2024-11-22",
      "headline": "'Bumrah gave India the perfect start': Pujara praises pacer's Perth captaincyIndia batter Cheteshwar Pujara heaped praise on Jasprit Bumrah for his sensational 4/17 spell, which turned the tide for India on Day 1 of the Perth Test. Bumrah's captaincy and bowling brilliance inspired a remarkable fightback after a batting collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-hardik-pandya-krunal-pandya-syed-mushtaq-ali-trophy-2024-25-baroda-2638517-2024-11-22",
      "headline": "Hardik Pandya reports to brother Krunal ahead of Syed Mushtaq Ali Trophy returnStar India all rounder Hardik Pandya reported to his brother Krunal ahead of his return in the Syed Mushtaq Ali Trophy 2024 for Baroda as he shared photographs on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-jasprit-bumrah-ten-unplayable-balls-perth-test-spell-steve-smith-duck-2638502-2024-11-22",
      "headline": "Perth Test: 10 unplayable balls in Jasprit Bumrah's spell from hellJasprit Bumrah's fiery 4/17 spell as stand-in captain salvaged India's position after a dismal batting display on Day 1 of the Perth Test, leaving Australia reeling at 67/7 and showcasing his brilliance as a leader and bowler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kl-rahul-sanjay-manjrekar-matthew-hayden-border-gavaskar-trophy-2024-25-2638479-2024-11-22",
      "headline": "Hayden, Manjrekar highlight major flaw in snicko meter after KL Rahul dismissalFormer cricketers Matthew Hayden and Sanjay Manjrekar highlighted major flaw in snicko meter technology after KL Rahul's controversial dismissal on Day 1 of the first Test in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-indian-batting-poor-show-jasprit-bumrah-border-gavaskar-trophy-2024-25-aus-vs-ind-2638048-2024-11-22",
      "headline": "Perth pitch too spicy? Jasprit Bumrah helps Indian batting unit save faceThe Indian batting line up continued their poor show on Day 1 of the first Test against Australia as they were bundled out for 150. However, the stand-in captain saved their face with his menacing spell. Given the tough surface in Perth, is it fair to blame Indian batters for their poor show?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-champions-trophy-emergency-meeting-venue-bcci-pcb-hybrid-model-discussion-2638041-2024-11-22",
      "headline": "Emergency ICC meeting called to discuss Champions Trophy: SourcesThe ICC is set to mediate a critical meeting on November 26 which will include top officials of both BCCI and PCB, aiming to resolve venue concerns for the 2025 Champions Trophy amid escalating tensions and disagreements over safety, hosting rights, and hybrid model proposals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-perth-test-smiling-assassin-jasprit-bumrah-shoulders-extra-burden-with-ease-2638020-2024-11-22",
      "headline": "Perth Test: Smiling assassin Jasprit Bumrah shoulders extra burden with easeBorder-Gavaskar Trophy: Jasprit Bumrah, in his second Test as captain, looked more assured. With support from Virat Kohli, the world's best pacer lead an inspiring fightback from India on a spicy pitch in Perth on Friday. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}