{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/save-up-to-rs-2-lakh-a-year-real-estate-tax-hacks-every-investor-should-know-2786345-2025-09-12",
      "headline": "Save up to Rs 2 lakh a year: Real estate tax hacks every investor should knowFor many Indians, property isn't just a place to live, it's a smart investment. But what often gets overlooked are the tax breaks that can make real estate even more rewarding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-marginally-to-207-in-august-from-155-in-july-2786334-2025-09-12",
      "headline": "Retail inflation rises marginally to 2.07% in August from 1.55% in JulyDespite edging up in August, inflation remains very low compared to recent years and well within the RBI's target range of 2–6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/markets-rally-for-8th-straight-session-all-eyes-on-crucial-sebi-board-meet-2786322-2025-09-12",
      "headline": "Sebi board meeting decisions in focus as markets rally for eighth straight sessionBut the bigger story now is what comes next from Sebi. The regulator's crucial board meeting is expected to decide on sweeping changes to futures and options trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-356-points-higher-nifty-above-25100-bel-gains-4-percent-2786308-2025-09-12",
      "headline": "Sensex closes 356 points higher, Nifty above 25,100; BEL gains 4%The S&P BSE Sensex added 356 points to close at 81,904.70, while the NSE Nifty50 gained 108.50 points to end at 25,114.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saving-money-genz-vs-millennials-spending-habit-money-tips-reports-research-2786294-2025-09-12",
      "headline": "Gen-Z vs millennial: Who is better at saving money?GenZ are painted as loud, brash spenders who splurge on gadgets, sneakers, and experiences over savings. But is that really true when it comes to accumulating savings? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-meeting-expectations-today-ipo-investment-fpis-reforms-min-amount-stock-market-dalal-street-2786234-2025-09-12",
      "headline": "Sebi meeting today: What can stock market investors expect from meeting?The Securities and Exchange Board of India (Sebi) is expected to approve a set of reforms that aim to make the market more attractive for businesses and investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/giorgio-armanis-will-outlines-gradual-sale-or-ipo-of-fashion-empire-2786214-2025-09-12",
      "headline": "Giorgio Armani's will outlines gradual sale or IPO of fashion empireThe late Giorgio Armani has left behind more than just a fashion empire. His will reveals a carefully crafted plan for the future of his company. Here's what it says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-record-highs-3-key-reasons-behind-the-rally-2786181-2025-09-12",
      "headline": "Gold hits record highs. 3 key reasons behind the rallyThe shine of gold is brighter than ever. Prices have soared to record levels, with global and domestic markets witnessing a strong rally. So, what's driving this rise? Three major factors are at play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-seniors-can-unlock-rs-15-lakh-a-month-from-their-home-explains-expert-2786140-2025-09-12",
      "headline": "How seniors can unlock Rs 1.5 lakh a month from their home, explains expertRising medical bills and everyday expenses often strain retirees who have no pension. But for those who own a house, there's a way out. An expert says reverse mortgage can turn property into a monthly pension of Rs 1.5 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-income-reporting-to-form-selection-7-key-checks-every-taxpayer-should-make-before-filing-itr-2786109-2025-09-12",
      "headline": "From income reporting to form selection: 7 must-do ITR stepsThis article outlines the key things taxpayers in India need to remember while filing their income tax return for the current assessment year, with a focus on accuracy, compliance, and timely processing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-shares-rally-2-percent-after-record-rs-18000-crore-buyback-will-investors-benefit-2786106-2025-09-12",
      "headline": "Infosys shares up 2% on record buyback plan. Will existing shareholders benefit?Infosys shares climbed over 2% after the IT firm announced a Rs 18,000 crore buyback, the largest in its history. The offer, priced at a 19% premium, could benefit existing shareholders, though experts caution on execution challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/stock-market-update-which-sectors-to-invest-auto-hotels-hospitals-fmcg-it-2786079-2025-09-12",
      "headline": "Dalal Street momentum: Top sectors to invest in todayExperts believe that from Q3 onwards, earnings should improve due to GST rationalisation and income tax cuts, which will start paying off."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-releases-new-album-play-dance-pop-track-symmetry-out-now-2786455-2025-09-12",
      "headline": "Ed Sheeran releases new album Play, dance-pop track Symmetry out nowEd Sheeran recently released his new album 'Play' featuring Indian and Persian musical influences. The album offers collaborations with producers and musicians from across the globe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/do-you-wanna-partner-review-tamannaah-bhatia-diana-penty-craft-beer-startup-2785961-2025-09-12",
      "headline": "Do You Wanna Partner review: Tamannaah-Diana's beer drama is almost brew-tifulRelease Date:Fri Sep 12, 2025Do You Wanna Partner series review: Tamannaah Bhatia stars as Shikha, a woman reinventing herself through a craft beer startup. The series explores female ambition, jugaad, and fierce competition in a male-dominated industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-sufi-motiwala-says-outdated-stereotypes-of-lgbtq-characters-fuel-societal-stigma-2786451-2025-09-12",
      "headline": "Sufi Motiwala says outdated stereotypes of LGBTQ characters fuel societal stigmaInfluencer-turned-actor Sufi Motiwala expressed that there are hardly any projects being created where LGBTQIA artistes can tell their own stories. In an exclusive chat with India Today, he also discussed his acting debut in 'Do You Wanna Partner'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/diljit-dosanjh-gets-emotional-over-kantara-1-song-making-rishab-shetty-shows-love-2786453-2025-09-12",
      "headline": "Diljit Dosanjh gets emotional over Kantara 1 song-making, Rishab Shetty shows loveDiljit Dosanjh just treated fans to a rare, behind-the-scenes peek from 'Kantara: Chapter 1', sharing a warm and heartfelt video with actor-director Rishab Shetty. Shetty, overwhelmed with love, reacted to the post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-diana-penty-recalls-deepika-padukone-calm-force-wishes-cocktail-2-team-success-2786425-2025-09-12",
      "headline": "Diana Penty recalls Deepika Padukone as calm force, wishes Cocktail 2 team successDiana Penty recalls her debut film experience with Deepika Padukone as supportive and reassuring. She looks forward to Cocktail 2 and wishes the new cast success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rgv-praises-mirai-for-hollywood-level-vfx-compared-it-to-baahubali-2786388-2025-09-12",
      "headline": "RGV praises Teja Sajja's Mirai for Hollywood-level VFX, compares it to BaahubaliDirector Ram Gopal Varma has praised Teja Sajja's fantasy-action thriller Mirai for its outstanding VFX and narrative. The film is being hailed as an industry hit, drawing comparisons to Baahubali and setting new standards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diana-penty-reflects-ageism-in-bollywood-women-playing-mothers-in-their-30s-2786340-2025-09-12",
      "headline": "Diana Penty reflects on ageism in Bollywood, women playing mothers in their 30sActor Diana Penty addressed the trend of women playing mothers in films during their 30s. She reflected on her approach to navigating the industry norms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/77th-primetime-emmy-awards-when-and-where-to-watch-nominations-and-presenters-2786379-2025-09-12",
      "headline": "77th Primetime Emmy Awards: When and where to watch, nominations and presentersGet ready to binge on awards! From star-studded presenters to binge-worthy nominations, here's everything you need to know about this year's Emmy magic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-sonu-nigam-dance-bijuria-song-sunny-sanskari-ki-tulsi-kumari-youtube-fan-fest-viral-video-2786315-2025-09-12",
      "headline": "Varun Dhawan, Sonu Nigam dance to Bijuria at YouTube fan fest. Video goes viralActor Varun Dhawan and singer Sonu Nigam performed at the YouTube Fan Fest on the song 'Bijuria' from 'Sunny Sanskari Ki Tulsi Kumari.' \r\nA video of their performance is being widely shared on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kim-namjoon-aka-rm-birthday-of-bts-a-leader-who-leads-by-example-not-domination-2786338-2025-09-12",
      "headline": "Kim Namjoon of BTS: A leader who leads by example, not dominationKim Namjoon, the leader of BTS, exemplifies true leadership with humility and emotional intelligence that resonates deeply with fans. His journey inspires many, showing how genuine reflection and growth can shape both art and people in today's world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/71st-national-film-awards-shah-rukh-khan-rani-mukerji-to-attend-ceremony-in-new-delhi-2786316-2025-09-12",
      "headline": "71st National Film Awards: SRK, Rani Mukerji to attend ceremony in New DelhiThe 71st National Film Awards are all set to roll out the red carpet for India's finest, with Shah Rukh Khan finally clinching his first National Award, and how! Alongside him, stars like Vikrant Massey and Rani Mukerji are ready to dazzle as the big night descends upon Vigyan Bhawan, New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kunickaas-old-video-on-sexual-abuse-in-film-industry-goes-viral-kumar-sanus-son-reacts-2786254-2025-09-12",
      "headline": "Kunickaa's old video on sexual abuse in industry goes viral, Kumar Sanu's son reactsSinger Kumar Sanu's son Jaan condemned 'Bigg Boss 19' contestant and actor Kunickaa Sadanand's remarks on rape in the film industry. A clip from an old interview is going viral, in which she suggested women give 'hints' to men. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/drishyam-3-director-jeethu-joseph-warns-fans-not-to-expect-mind-game-2786317-2025-09-12",
      "headline": "Drishyam 3 director Jeethu Joseph warns fans not to expect another mind gameDirector Jeethu Joseph, in a recent interview, revealed that 'Drishyam 3' script has been completed. The filmmaker cautioned viewers against anticipating a complex thriller like previous instalments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/turkish-adaptation-queen-of-tears-ask-ve-gozyasi-hande-ercel-september-2025-2786283-2025-09-12",
      "headline": "Turkish remake of Queen of Tears to premiere in SeptemberTurkish remake of 'Queen of Tears' titled 'Ask ve Gozyasi' stars Hande Ercel and Baris Arduc. The series is scheduled to premiere on ATV in September 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashneer-grover-indirectly-targets-salman-khan-bigg-boss-criticises-host-centric-reality-shows-2786306-2025-09-12",
      "headline": "Big show with superstar: Ashneer Grover's veiled jibe at Salman Khan and Bigg BossAshneer Grover calls for reality shows to prioritise contestants over hosts. His comments seemed like a veiled jibe at Salman Khan and 'Bigg Boss', which is hosted by the superstar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shah-rukh-khan-thanks-diljit-dosanjh-supporting-aryan-khan-singing-debut-the-bads-of-bollywood-tenu-ki-pata-2786318-2025-09-12",
      "headline": "Big jhappi to you: SRK thanks Diljit Dosanjh for supporting Aryan in singing debutShah Rukh Khan recently shared a heartwarming note for Diljit Dosanjh and expressed his gratitude for supporting his son Aryan Khan with his singing debut. Diljit and Aryan collaborated for the track 'Tenu Ki Pata' from 'The Ba***ds of Bollywood'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-x-reviews-teja-sajja-film-gets-thumbs-up-for-divine-cinematic-experience-2786270-2025-09-12",
      "headline": "Mirai X reviews: Teja Sajja's film gets thumbs up for divine cinematic experienceActor Teja Sajja's fantasy-action-thriller 'Mirai', received a highly positive response from viewers in their X reviews. The film was commended for its visuals, background score and divine references. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-actor-takahiro-sakurai-infinity-castle-craze-inspiring-2786278-2025-09-12",
      "headline": "Exclusive: Demon Slayer star Sakurai finds India's Infinity Castle craze inspiring'Demon Slayer: Kimetsu no Yaiba Infinity Castle' has created a cultural phenomenon in India, breaking advance booking records and thrilling fans with special midnight screenings. Voice actor Takahiro Sakurai spoke exclusively with India Today about his work. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-141-other-nations-vote-in-favour-of-un-resolution-backing-palestine-statehood-2786542-2025-09-12",
      "headline": "In big move, India votes in favour of Palestine's statehood at UNIndia's vote at the UN signals a clear shift from its earlier Gaza stance. In recent years, the Modi government had avoided backing resolutions that demanded a ceasefire in the conflict. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepals-former-chief-justice-sushika-karki-takes-charge-as-interim-pm-first-woman-to-get-top-job-2786488-2025-09-12",
      "headline": "Ex-Chief Justice Sushila Karki is Nepal's interim PM, first woman to get top jobSushila Karki held the first Cabinet meeting of her government and proposed holding fresh general elections on March 4, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/big-deal-to-impose-tariffs-on-india-causes-rift-with-them-says-trump-2786493-2025-09-12",
      "headline": "Big deal to impose tariffs on India, causes rift with them, says TrumpUS President Donald Trump said imposing a 50 percent tariff on India for buying Russian oil \"causes a rift\" between the two countries, while reiterating his claims of resolving global conflicts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/charlie-kirk-murder-suspect-named-as-tyler-robinson-22-says-fbi-2786446-2025-09-12",
      "headline": "Tyler Robinson, 22, arrested for shooting Charlie Kirk; family friend turned him in31-year-old Charlie Kirk was a staunch defender of gun rights and a key ally of Trump. He was fatally shot while addressing a crowd of over 3,000 at Utah Valley University."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/sushila-karki-nepal-first-woman-prime-minister-youth-reforms-2786514-2025-09-12",
      "headline": "Who's Sushila Karki? From Nepal's first female Chief Justice to interim PMSushila Karki's reputation as a fearless judge with an uncompromising stand against corruption has defined her career in the legal system. Karki's judicial decisions have often put her at odds with the executive. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-visit-manipur-tomorrow-first-visit-since-2022-violence-2786292-2025-09-12",
      "headline": "PM Modi to visit Manipur today, will meet victims of 2023 violenceTwo years after ethnic clashes rocked Manipur, Prime Minister Narendra Modi is all set to visit the northeastern state to inaugurate development projects. The visit will pave the way for peace, normalcy, and growth in the state, said the state Chief Secretary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepal-protest-live-updates-interim-government-gen-z-trend-social-media-ban-news-2786037-2025-09-12",
      "headline": "Live: Sushila Karki takes oath as Nepal's 1st woman PM, proposes March 4 for electionsNepal Gen Z Protest Live: As Nepal slowly returns to normalcy, after days of violent protests led by Gen Z, the discussions about who will take charge of the nation have taken the centre stage. With the Nepal Army having imposed nationwide restrictions, names such as former Chief Justice Sushila Karki, Kathmandu Mayor Balendra Shah, and former electricity board CEO Kulman Ghising are reportedly being considered to lead an interim government. \r\nIndia Today's Pankaj Das, Amit Bharadwaj and Rohit Singh are reporting from ground zero. Stay tuned to IndiaToday.in"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-vs-divya-deshmukh-draw-highlights-grand-swiss-chess-2786529-2025-09-12",
      "headline": "After hattrick of defeats, D Gukesh held to a draw by Divya Deshmukh in 6-hour battleFIDE Grand Swiss 2025: Gukesh Dommaraju was held to a draw by Divya Deshmukh after a six-hour marathon in Samarkand. The enthralling contest lasted 103 moves, as the world champion and the Women's World Cup winner fought hard, captivating chess fans on Friday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-roasted-state-sponsor-terrorism-united-nations-hillel-neuer-viral-video-2786293-2025-09-12",
      "headline": "Mic drop. Watch how lawyer destroyed Pakistan in 4 seconds at UNPakistan was called a state sponsor of terror by Hillel Neuer, a human rights lawyer, while the UN was discussing the recent Israeli attack in Qatar targeting Hamas leaders."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shots-fired-outside-actor-disha-patanis-bareilly-home-2786473-2025-09-12",
      "headline": "Shooting outside Disha Patani's UP home, Goldy Brar gang claims responsibilityFiring was reported outside Bollywood actress Disha Patani's Bareilly home, with a threatening social media post claiming responsibility and warning the film industry. Police have launched an investigation and are verifying the post's authenticity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-dominate-oman-asia-cup-2025-opener-ahead-india-clash-2786549-2025-09-12",
      "headline": "All-round Pakistan pummel Oman, build momentum for India clashAsia Cup 2025, PAK vs OMA: Riding on a well-made 66 from Mohammad Haris and an all-round bowling show, Pakistan outclassed debutants Oman by 93 runs n Dubai on Friday. The former champions will face red-hot India in a much-awaited clash on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/who-is-tyler-robinson-arrested-shooting-charlie-kirk-right-wing-activist-donald-trump-ally-shot-dead-utah-valley-university-2786474-2025-09-12",
      "headline": "Who's Tyler Robinson, arrested for shooting Charlie Kirk dead?Tyler Robinson, a 22-year-old college dropout, has been arrested for shooting Charlie Kirk dead. Tyler is the son of a former sheriff department staffer, who turned him in to law enforcement. Here's all we know about Tyler Robinson from reliable sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-india-middle-class-us-oil-petroleum-russia-war-criticism-eyewash-2786393-2025-09-12",
      "headline": "Trump wants the oil business that India is giving to Russia. War talk is pretenceTrump's India envoy pick, Sergio Gor, said the US wanted India to open its market to exports of American oil and petroleum products. It suggests that Trump means business and only business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/delhis-plan-to-microchip-stray-dogs-is-illegal-costly-and-useless-2786394-2025-09-12",
      "headline": "Delhi's plan to microchip stray dogs is illegal, costly, and uselessDelhi's stray dog microchip plan faces tough questions; global data shows 37 per cent failure, up to 70 per cent inefficiency, Rs 1,700 per dog cost vs Rs 150 vaccinations, only 26 per cent success in UK, and 10–12 per cent missed scans. Activists call it wasteful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/how-last-hindu-kingdom-fell-to-a-violent-maoist-movement-nepal-gen-z-protests-pm-kp-oli-resignation-2786269-2025-09-12",
      "headline": "How the last Hindu kingdom fell to a violent Maoist movementAfter Gen Z–led protests toppled the Oli government, Nepal once again finds itself in the grip of political turmoil and violence. Just over 15 years ago, Nepal, once the world's last Hindu kingdom, where monarchs were revered as living deities, was transformed by a Maoist-led uprising."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/gen-z-protestors-have-chosen-next-nepal-pm-via-vote-on-discord-what-is-discord-and-how-it-is-used-2786279-2025-09-12",
      "headline": "Gen Z protestors pick Nepal's next PM via Discord, what is DiscordNepal's anti-corruption protests led by Gen Z activists toppled the KP Sharma Oli government. Now, Gen Z is using the US-based social media app Discord to decide on the country's next leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-tokyo-weather-climate-change-2786504-2025-09-12",
      "headline": "Weathering the storm: World Championships opens under the shadow of climate changeAs the World Athletics Championships return to Tokyo, it's not just rivalries on the track but the rising heat off it that could decide who endures and who falls short."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/butterfly-shaped-coronal-hole-solar-wind-earth-geomagnetic-storms-2786309-2025-09-12",
      "headline": "5,00,000-km-wide butterfly-shaped hole pops up on the SunNasa's Solar Dynamics Observatory has photographed a massive butterfly-shaped coronal hole on the Sun. Solar wind from the hole is set to reach Earth by 14 September, possibly causing geomagnetic storms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/bihar-teen-adarsh-kumar-only-indian-finalist-for-global-student-prize-2025-2785827-2025-09-12",
      "headline": "Bihar teen who left home at 14 is only Indian finalist for Global Student Prize 2025From leaving home at 14 in Champaran, Bihar, to serving as a Google Youth Advisor and mentoring global competitions, Adarsh Kumar has transformed his journey into one that builds opportunities for countless students through fellowships, startups, and grassroots change. He is now the only Indian finalist (chosen from over 11,000 candidates) in the Global Student Prize 2025, the 'student Nobel Prize' which comes with Rs 87 lakh ($100,000)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/priyanka-chopra-fashion-week-in-ralph-lauren-and-dior-nick-jonas-in-nyc-2786324-2025-09-12",
      "headline": "Priyanka Chopra's week in Ralph Lauren and Dior in NYCTwo days, two fashion houses, and Priyanka Chopra at the centre of it all, slaying every look. Read more here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/akhilesh-yadav-warns-india-vote-chori-may-cause-unrest-like-nepal-protests-2786401-2025-09-12",
      "headline": "If vote chori continues..: Akhilesh Yadav warns of Nepal-like unrest in IndiaThe Samajwadi Party chief said that people may take to streets like those in Nepal if 'vote chori' did not stop in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/sunjay-kapur-inheritance-case-delhi-high-court-lawyers-heated-exchange-2786263-2025-09-12",
      "headline": "Get a taste of your own medicine: Top lawyers clash in Sunjay Kapur assets caseKarisma Kapur's children, Samaira and Kiaan, have filed a lawsuit seeking a share in their late father, Sunjay Kapur's estate, while accusing his widow Priya Sachdeva of withholding documents and critical details about his will."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/dallas-motel-murder-case-suspect-used-machete-beheaded-victim-front-family-glbs-2785981-2025-09-11",
      "headline": "Chased, beheaded, dumped: Indian man killed in front of family at US motelThe accused used a machete to fatally attack 50-year-old Chandra Mouli Nagamallaiah after an argument at the motel in Dallas. The victim was killed in front of his wife and son."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-smash-304-record-second-t20i-south-africa-2786576-2025-09-13",
      "headline": "England hit world-record 304 in T20I after Salt's 141 vs South Africa: Stat packEngland achieved a record-breaking total of 304/2 against South Africa in the second T20I at Old Trafford. This historic innings set multiple new benchmarks and stunned cricket fans worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-captain-salman-agha-warns-india-asia-cup-2025-2786573-2025-09-13",
      "headline": "Salman Agha fires warning at India: We're good enough to beat any teamPakistan captain Salman Agha issues a warning to India ahead of their Asia Cup clash. The Men in Green are confident after a strong win over Oman but face a tough challenge against arch-rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sa-phil-salt-england-fastest-t20i-century-jos-buttler-powerplay-blitz-2786560-2025-09-13",
      "headline": "Phil Salt hits England's fastest T20I century after Buttler's powerplay blitzStar England batter Phil Salt hit the fastest-ever T20I century by an English player after a blistering powerplay display from Jos Buttler against South Africa in Manchester. Salt reached his hundred in just 39 balls while Buttler hit 83 off just 30 balls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/joao-mendes-ronaldinho-son-signs-one-year-deal-hull-city-under-21s-2786550-2025-09-12",
      "headline": "Ronaldinho's son Joao Mendes joins Hull City Under-21 side on one-year contractJoao Mendes - son of Ronaldinho and a former Barcelona youth player - has signed a one-year deal with Hull City's Under-21 squad, bringing experience from Brazil, Spain, and England to the Championship club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-dominate-oman-asia-cup-2025-opener-ahead-india-clash-2786549-2025-09-12",
      "headline": "All-round Pakistan pummel Oman, build momentum for India clashAsia Cup 2025, PAK vs OMA: Riding on a well-made 66 from Mohammad Haris and an all-round bowling show, Pakistan outclassed debutants Oman by 93 runs n Dubai on Friday. The former champions will face red-hot India in a much-awaited clash on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-vs-divya-deshmukh-draw-highlights-grand-swiss-chess-2786529-2025-09-12",
      "headline": "After hattrick of defeats, D Gukesh held to a draw by Divya Deshmukh in 6-hour battleFIDE Grand Swiss 2025: Gukesh Dommaraju was held to a draw by Divya Deshmukh after a six-hour marathon in Samarkand. The enthralling contest lasted 103 moves, as the world champion and the Women's World Cup winner fought hard, captivating chess fans on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-odi-series-women-world-cup-preparation-coach-amol-muzumdar-2786515-2025-09-12",
      "headline": "Australia series key for India's World Cup preparation: Women's coach MuzumdarIndia women's head coach Amol Muzumdar on Friday called the upcoming three-match series against Australia a \"real trailblazer\" for the home side as they prepare for the Women's World Cup, starting September 30 in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sitanshu-kotak-on-outside-noise-on-india-vs-pakistan-asia-cup-2025-2786510-2025-09-12",
      "headline": "India players focused on Pakistan clash, nothing else on mind: Batting coachIndia's batting coach Sitanshu Kotak says the team remains focused on the Asia Cup clash against Pakistan despite external distractions. Both captains have promised not to tone down on aggression, amid ongoing political tensions and fan boycott talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-tokyo-weather-climate-change-2786504-2025-09-12",
      "headline": "Weathering the storm: World Championships opens under the shadow of climate changeAs the World Athletics Championships return to Tokyo, it's not just rivalries on the track but the rising heat off it that could decide who endures and who falls short."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-clubs-super-cup-afc-champions-league-2-spot-2786496-2025-09-12",
      "headline": "12 ISL clubs agree to participate in Super Cup, winner to get ACL 2 play-off spotAll Indian Super League clubs, except Odisha FC, have agreed to participate in the season-opening Super Cup. With a coveted AFC Champions League 2 play-off spot on offer, the tournament stakes are high amid the ISL's delayed start."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-vs-divya-deshmukh-draw-highlights-grand-swiss-chess-2786529-2025-09-12",
      "headline": "After hattrick of defeats, D Gukesh held to a draw by Divya Deshmukh in 6-hour battleFIDE Grand Swiss 2025: Gukesh Dommaraju was held to a draw by Divya Deshmukh after a six-hour marathon in Samarkand. The enthralling contest lasted 103 moves, as the world champion and the Women's World Cup winner fought hard, captivating chess fans on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-odi-series-women-world-cup-preparation-coach-amol-muzumdar-2786515-2025-09-12",
      "headline": "Australia series key for India's World Cup preparation: Women's coach MuzumdarIndia women's head coach Amol Muzumdar on Friday called the upcoming three-match series against Australia a \"real trailblazer\" for the home side as they prepare for the Women's World Cup, starting September 30 in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sitanshu-kotak-on-outside-noise-on-india-vs-pakistan-asia-cup-2025-2786510-2025-09-12",
      "headline": "India players focused on Pakistan clash, nothing else on mind: Batting coachIndia's batting coach Sitanshu Kotak says the team remains focused on the Asia Cup clash against Pakistan despite external distractions. Both captains have promised not to tone down on aggression, amid ongoing political tensions and fan boycott talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-tokyo-weather-climate-change-2786504-2025-09-12",
      "headline": "Weathering the storm: World Championships opens under the shadow of climate changeAs the World Athletics Championships return to Tokyo, it's not just rivalries on the track but the rising heat off it that could decide who endures and who falls short."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-clubs-super-cup-afc-champions-league-2-spot-2786496-2025-09-12",
      "headline": "12 ISL clubs agree to participate in Super Cup, winner to get ACL 2 play-off spotAll Indian Super League clubs, except Odisha FC, have agreed to participate in the season-opening Super Cup. With a coveted AFC Champions League 2 play-off spot on offer, the tournament stakes are high amid the ISL's delayed start."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}