{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/tcs-layoff-job-cut-staff-fluidity-list-it-shares-free-fall-h1b-visa-decline-orders-report-2795595-2025-09-30",
      "headline": "TCS shares slide as uncertainty grows over job cuts, staff report fluidity listTCS stock has fallen 4.65% in the past five days and 6.72% in the past month. Over the past year, it has lost nearly a third of its value, with reports of large-scale layoffs creating fresh panic among employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-post-office-savings-schemes-like-ppf-and-nsc-witness-a-rate-cut-2795557-2025-09-30",
      "headline": "Will Post Office Savings Schemes like PPF and NSC witness a rate cut?With the Finance Ministry set to review small savings rates at the end of September, many investors are wondering if schemes like PPF and NSC will see a cut. The RBI's recent repo rate reductions have only added to the speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/where-to-invest-in-psu-bank-nbfcs-analysts-pick-top-stocks-bajaj-pbn-housing-2795541-2025-09-30",
      "headline": "Where to invest in PSU banks and NBFCs? Analysts pick top stocksPSU banks remain one of the most attractive options in the current market. With the Reserve Bank of India (RBI) scheduled to meet soon, market watchers are keeping a close eye on any rate-related decisions"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-proposal-new-rules-gold-silver-loans-easy-borrowing-tighten-credit-checks-2795519-2025-09-30",
      "headline": "New RBI proposals to make borrowing easier, tighten credit checksAnnounced through seven directions and circulars on September 29, 2025, three of these changes will take effect from October 1, while four others have been released for public consultation until October 20, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-250-points-nifty-above-24500-bel-gains-1-percent-2795491-2025-09-30",
      "headline": "Sensex jumps 250 points, Nifty above 24,500; BEL gains 1%The S&P BSE Sensex was up 299.85 points to 80,664.79, while the NSE Nifty50 added 71 points to 24,705.90 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-ipo-wework-india-gmp-listing-gains-price-band-important-dates-should-you-invest-2795474-2025-09-30",
      "headline": "Tata Capital vs WeWork India: Which IPO should you invest in?Two names drawing strong attention this week are Tata Capital Ltd and WeWork India Management Ltd, both preparing to make their market debuts in October 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-new-rules-claim-settlement-of-deceased-account-holders-will-nominee-15-days-penalty-2795362-2025-09-29",
      "headline": "RBI simplifies process for claim settlement of deceased account holdersThe new framework by the Reserve Bank of India (RBI) has been introduced to remove the confusion caused by different practices followed by banks earlier."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/when-will-the-8th-pay-commission-be-implemented-here-is-what-you-should-know-2795162-2025-09-29",
      "headline": "When will the 8th Pay Commission be implemented? Here's what you should knowThe Pay Commission affects much more than basic salaries. It influences allowances, pensions, and long-term financial security. In times of rising inflation, employees and pensioners are especially keen for the Commission's work to begin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arattai-zoho-sridhar-vembu-whatsapp-alternative-piyush-goyal-radhika-gupta-2795288-2025-09-29",
      "headline": "From CEOs to ministers, support pours in for Zoho's ArattaiThe rise of Arattai has caught the attention of users, industry leaders, and public figures, many of whom have shared their support and congratulations for Zoho and its founder, Sridhar Vembu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/who-should-invest-in-tata-capital-ipo-market-expert-weighs-in-2795243-2025-09-29",
      "headline": "Who should invest in Tata Capital IPO? Market expert weighs inThe Tata Capital IPO is around the corner, and many investors are wondering whether it's the right bet. A market expert has broken down who should consider subscribing and who may want to stay cautious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-close-flat-investors-turn-cautious-us-india-trade-deal-rbi-mpc-2795219-2025-09-29",
      "headline": "Sensex, Nifty close flat as investors turn cautious over US-India trade dealThe S&P BSE Sensex closed 61.52 points lower to end at 80,364.94, while the NSE Nifty50 lost 19.80 points to close at 24,634.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/moodys-rating-india-baa3-stable-outlook-trump-tariff-us-trade-talk-credit-agency-2795201-2025-09-29",
      "headline": "Moody's keeps India's Baa3 rating unchanged with stable outlookMoody's said India's strengths include its large and fast-growing economy, a sound external position, and a stable domestic financing base for fiscal deficits. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/katrina-kaif-first-outing-pregnancy-news-sunny-kaushal-birthday-bash-2795590-2025-09-30",
      "headline": "Katrina's first outing after pregnancy news, joins Sunny Kaushal's birthday bash After sharing her pregnancy news, actor Katrina Kaif celebrated Sunny Kaushal's birthday on Monday. Mini Mathur posted a photo featuring Katrina, Sunny, Isabelle Kaif, and herself from the birthday bash on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-shankar-criticised-remarks-rukmini-vasanth-jr-ntr-film-promotion-2795568-2025-09-30",
      "headline": "Producer asks Rukmini Vasanth to match 80% of Jr NTR's performance, gets trolled Telugu producer Ravi Shankar faced criticism for comments on Rukmini Vasanth at 'Kantara: Chapter 1' pre-release event in Hyderabad. The producer's remarks, intended to highlight Jr NTR's talent, were viewed as disrespectful to Rukmini."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papon-cancels-shows-until-october-1-following-death-of-zubeen-garg-2795572-2025-09-30",
      "headline": "In honour of Zubeen Garg, Papon cancels all shows Singer-composer Papon has suspended all shows and professional commitments following the death of Zubeen Garg. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/subhash-ghais-cryptic-post-amid-misconduct-claims-scary-to-meet-unknown-guys-2795571-2025-09-30",
      "headline": "Subhash Ghai's cryptic post amid misconduct claims: Scary to meet unknown guys Veteran film-maker Subhash Ghai reacted to sexual misconduct allegations with a cryptic post on social media. This came after actor Nehal Vadoliya shared her uncomfortable experience with the director. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-clears-air-on-instagram-unfollow-rumours-with-deepika-padukone-2795582-2025-09-30",
      "headline": "Farah Khan clears air on Instagram unfollow rumours with Deepika Padukone Farah Khan has clarified that she and Deepika Padukone were never following each other on Instagram, calling out rumours of a fallout as false. She also explained her eight-hour work comment was a joke and emphasised the importance of privacy over social media speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-37-day-36-written-update-baseer-ali-nehal-chudasama-halwa-fight-2795569-2025-09-30",
      "headline": "Bigg Boss 19 episode 37: Baseer, Nehal rock house with shouting match over halwa Baseer Ali and Nehal Chudasama engaged in an intense fight over the halwa made for Tanya Mittal's birthday. Their fight became the highlight of episode 37 of 'Bigg Boss 19'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ott-releases-madharaasi-play-dirty-steve-films-shows-to-watch-online-netflix-prime-video-sonyliv-2795534-2025-09-30",
      "headline": "OTT this week: Madharaasi, Steve, Play Dirty and more: What to watch where and when This week, fans will be in for some interesting films and shows releasing on OTT. So it's time to grab your popcorn and feel comfortable while you select your favourite film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/exclusive-rukmini-vasanth-credits-rishab-shetty-for-shaping-her-kantara-journey-2795525-2025-09-30",
      "headline": "Exclusive: Rukmini Vasanth credits Rishab Shetty for shaping her Kantara journey Rukmini Vasanth, who joins 'Kantara Chapter 1' as a warrior princess, called the experience \"a huge education.\" She credited Rishab Shetty and the writers for helping her understand the film's cultural roots and push herself through intense training.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/justice-on-trial-review-well-woven-series-on-judicial-system-and-legal-challenges-2795421-2025-09-30",
      "headline": "Justice on Trial review: Well-woven series on judicial system and legal challengesRelease Date:Mon Jul 21, 2025 Justice on Trial review: 'Justice on Trial' on Prime Video uniquely presents the justice system and legal cases through re-enactments based on actual court transcripts. Judge Judy Sheindlin is present at all court hearings. Is the show worth your time? Here is our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunita-ahuja-addresses-govinda-affair-rumours-opens-up-on-marriage-struggles-2795506-2025-09-30",
      "headline": "Sunita Ahuja addresses Govinda's affair rumours, opens up on marriage struggles Sunita Ahuja has opened up about the ongoing rumours regarding her marriage with Govinda, revealing they have been living separately for 15 years but maintain a bond through their children. She also addressed family challenges and dismissed gossip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-reacts-to-old-statement-on-daughter-having-kareena-kapoor-qualities-2795522-2025-09-30",
      "headline": "Kiara Advani reacts to old statement on daughter having Kareena Kapoor's qualities Kiara Advani addressed an old interview resurfacing online, clarifying that her comment about wanting her daughter to have Kareena Kapoor's qualities was taken out of context. She recently welcomed her baby girl with Sidharth Malhotra and is gearing up for her Kannada debut with 'Toxic: A Fairy Tale for Grown Ups'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-rishab-shetty-pan-indian-film-2025-1000-crore-2795245-2025-09-30",
      "headline": "Kantara Chapter 1: The last Rs 1,000 crore hope for Indian cinema in 2025 With the success of its predecessor and a bold prequel set in the Kadamba era, Rishab Shetty's 'Kantara Chapter 1' is the most anticipated Rs 1,000 crore contender of 2025 in Indian cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/they-call-him-og-box-office-collection-day-5-pawan-kalyan-action-entertainer-sees-slight-dip-2795496-2025-09-30",
      "headline": "They Call Him OG box office Day 5: Pawan Kalyan's action film sees slight dip Pawan Kalyan's 'They Call Him OG' continues its strong box office run, earning Rs 147.70 crore nett in five days, with Day 5 collecting Rs 7.50 crore. The film, also marking Emraan Hashmi's Telugu debut, has been praised for its high-octane action and Pawan Kalyan's commanding screen presence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhanashree-verma-claims-yuzvendra-chahal-cheated-on-her-two-months-into-marriage-2795481-2025-09-30",
      "headline": "Dhanashree Verma claims Yuzvendra Chahal cheated on her two months into marriage Dhanashree Verma has opened up about her troubled marriage with cricketer Yuzvendra Chahal, claiming infidelity just two months after their wedding. The couple divorced after three years, with Dhanashree focusing on personal well-being amidst public speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jk-rowling-calls-emma-watson-ignorant-over-transgender-rights-dispute-2795457-2025-09-30",
      "headline": "Ignorant of how ignorant she is: JK Rowling slams Emma Watson amid trans rights row JK Rowling publicly responded to Emma Watson's comments on their relationship and transgender rights, calling her ignorant. The 'Harry Potter' author accused Watson of fuelling controversy during a period of personal threats and heightened security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-bachchan-stuns-at-paris-fashion-week-2025-selfie-with-actor-simone-ashley-goes-viral-2795477-2025-09-30",
      "headline": "Aishwarya Rai stuns at Paris Fashion, selfie with actor Simone Ashley goes viral Aishwarya Rai Bachchan made a dazzling comeback at Paris Fashion Week 2025, walking the ramp alongside top Hollywood stars and international supermodels. Her stunning black diamond-embellished outfit and signature red lips reaffirmed her status as a global style icon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/nicole-kidman-keith-urban-separation-nearly-20-years-marriage-2795430-2025-09-30",
      "headline": "Nicole Kidman and Keith Urban separate after nearly 20 years of marriage Nicole Kidman and Keith Urban have separated following almost two decades together. The couple share two children and have been married since 2006. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jay-kelly-trailer-george-clooney-plays-fading-movie-icon-adam-sandler-his-manager-2795364-2025-09-29",
      "headline": "Jay Kelly trailer: George Clooney plays fading movie icon, Adam Sandler his manager Actor George Clooney returns in 'Jay Kelly', a dramedy about fame and family struggles. The film explores personal reckonings and complex relationships against a Hollywood backdrop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-wishes-cutie-wife-sneha-reddy-with-vacation-pics-2795332-2025-09-29",
      "headline": "Allu Arjun wishes cutie wife Sneha Reddy with vacation pics Actor Allu Arjun celebrated wife Sneha Reddy's birthday with a heartfelt social media wish. The actor shared scenic pictures from their vacation."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cctv-doesnt-support-deliberate-ramming-of-bike-it-shows-loss-of-control-court-on-bail-to-bmw-crash-accused-2795603-2025-09-30",
      "headline": "CCTV doesn't support deliberate ramming of bike: Court on bail to BMW crash accusedThe court also flagged serious lapses by ambulance staff, who arrived within seconds but failed to assist the victim, weakening the prosecution's \"golden hour\" argument."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-p-chidambaram-mumbai-terror-attack-international-pressure-condoleeza-rice-bjp-reactions-2795429-2025-09-30",
      "headline": "US stopped us: Chidambaram's big 26/11 admission, BJP says too little, too lateAt the time of the attacks in 2008, the Congress veteran leader was the Union Home Minister. He revealed that the then US Secretary of State Condoleeza Rice had visited India to meet him and the Prime Minister, asking them not to react to the situation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/arattai-app-sridhar-vembu-tamil-nadu-entrepreneurs-learn-hindi-business-dealings-zoho-founder-language-debate-2795318-2025-09-30",
      "headline": "Simple app, difficult name? Arattai revives language debateEarlier this year, Zoho's Sridhar Vembu urged Tamils to learn Hindi for business, sparking outrage in the south. Months later, his app Arattai, named in Tamil, has sparked a debate over its \"hard to pronounce\" name for Hindi speakers. The name of the app, whose downloads are soaring, has also revived the language debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jk-rowling-calls-emma-watson-ignorant-over-transgender-rights-dispute-2795457-2025-09-30",
      "headline": "Ignorant of how ignorant she is: JK Rowling slams Emma Watson amid trans rights rowJK Rowling publicly responded to Emma Watson's comments on their relationship and transgender rights, calling her ignorant. The 'Harry Potter' author accused Watson of fuelling controversy during a period of personal threats and heightened security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/why-howard-gardner-thinks-classrooms-will-be-obsolete-by-2050-and-why-india-should-listen-2795460-2025-09-30",
      "headline": "Why classrooms may vanish by 2050, and what India must do nowAt a recent Harvard forum, Howard Gardner predicted that the traditional classroom model may become obsolete by 2050, thanks to AI. In India, where rigid exams still rule, this isn't just a prediction, it's a warning. The question is this: Will we evolve, or be left behind in this BIG education revolution?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rain-thunderstorms-in-parts-of-delhi-ncr-more-showers-may-dampen-festive-spirit-2795598-2025-09-30",
      "headline": "Heavy rain pounds Delhi-NCR, roads waterlogged, airlines issue advisoryThe showers brought much-needed relief from the sweltering heat as thousands of revellers flocked to pandals across the city for the ongoing Durga Puja festivities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/viable-pathway-to-long-term-and-sustainable-peace-pm-modi-welcomes-trumps-gaza-plan-2795483-2025-09-30",
      "headline": "Viable pathway to long-term peace: PM Modi welcomes Trump's Gaza planOn Monday, the White House released a 20-point document that called for an immediate ceasefire, an exchange of hostages held by Hamas for Palestinian prisoners held by Israel, a staged Israeli withdrawal from Gaza, Hamas disarmament and a transitional government led by an international body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/story/delhi-molestation-accused-swami-lies-questioning-airhostess-photos-found-2795549-2025-09-30",
      "headline": "Cops say Delhi molester baba not cooperating; airhostesses' pics found on phoneSwami Chaitanyananda Saraswati, the former head of a management institute in Vasant Kunj, was arrested in Agra last week after more than 15 women students accused him of molestation, blackmail and intimidation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhanashree-verma-claims-yuzvendra-chahal-cheated-on-her-two-months-into-marriage-2795481-2025-09-30",
      "headline": "Dhanashree Verma claims Yuzvendra Chahal cheated on her two months into marriageDhanashree Verma has opened up about her troubled marriage with cricketer Yuzvendra Chahal, claiming infidelity just two months after their wedding. The couple divorced after three years, with Dhanashree focusing on personal well-being amidst public speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/world-leaders-reacting-after-trump-netanyahu-agree-us-backed-gaza-plan-glbs-2795427-2025-09-30",
      "headline": "How world leaders are reacting after Trump, Netanyahu agree to US-backed Gaza planThe White House released a 20-point framework that calls for an immediate ceasefire, the release of hostages in exchange for Palestinian prisoners, and a phased Israeli withdrawal from Gaza. Here's how world leaders reacted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/sridhar-vembu-takes-aim-at-whatsapp-says-zoho-arattai-will-not-be-a-monopoly-2795580-2025-09-30",
      "headline": "Sridhar Vembu takes aim at WhatsApp, says Zoho Arattai will not be a monopolyArattai, Zoho's home-grown messaging app, is creating a buzz in India with record-breaking sign-ups. Founder and chief scientist Sridhar Vembu has taken a shot at WhatsApp, saying Zoho will never be a monopoly like Meta.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-rishab-shetty-pan-indian-film-2025-1000-crore-2795245-2025-09-30",
      "headline": "Kantara Chapter 1: The last Rs 1,000 crore hope for Indian cinema in 2025With the success of its predecessor and a bold prequel set in the Kadamba era, Rishab Shetty's 'Kantara Chapter 1' is the most anticipated Rs 1,000 crore contender of 2025 in Indian cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-elections-2025-final-voter-list-to-be-out-today-poll-schedule-likely-by-oct-6-7-2795485-2025-09-30",
      "headline": "Bihar elections: Final voter list likely by 3 pm, poll schedule by October 6-7The Assembly's current term ends on November 23. In 2020, the EC had announced results nearly 20 days before the tenure expired, and a similar timeline is expected this time as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-collapse-asia-cup-final-india-captaincy-controversy-2795294-2025-09-30",
      "headline": "Mischievous schoolboys can't win Asia Cup: Pakistan focus on theatrics, fail as prosAsia Cup 2025: Pakistan's campaign was a disaster on every level and the team prioritised antics over cricket. Until they abandon theatrics and focus on basics, Pakistan will keep humiliating themselves despite early promise."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-youtuber-felix-gerald-held-for-spreading-fake-news-on-tvk-vijay-rally-karur-stampede-2795468-2025-09-30",
      "headline": "YouTuber Felix Gerald arrested for allegedly spreading fake news on Karur stampedeTamil Nadu YouTuber Felix Gerald, who runs the RedPix channel, was arrested by Cyber Crime Police for allegedly uploading fake news linked to the Karur stampede during Vijay's Tamilaga Vettri Kazhagam rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/your-festive-fashion-fix-is-a-bejewelled-blouse-isha-ambani-janhvi-kapoor-2795344-2025-09-30",
      "headline": "Your festive fashion fix is a bejewelled blouseThis festive season, the buzz is all about the bejewelled blouse. Think of it as fashion's sassy comeback to heavy necklaces - because honestly, who needs one when your entire blouse is sparkling like jewellery itself!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-deports-100-iranians-amid-immigration-crackdown-tehran-deal-rare-cooperation-2795575-2025-09-30",
      "headline": "US deports 'planeload' of Iranians in rare cooperation with Tehran: ReportThe US has deported about 100 Iranians amid a strict immigration crackdown. This rare cooperation with Iran follows months of diplomatic talks despite recent tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/elon-musk-to-launch-starship-super-heavy-on-11th-test-flight-what-to-expect-2795531-2025-09-30",
      "headline": "SpaceX to launch Starship on 11th test flight: Here's what to expectThe mission aims to expand on data from the tenth test flight while introducing new landing techniques, reentry stress tests, and in‑space experiments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/swiggy-surprises-shashi-tharoor-with-idlis-after-his-poetic-defence-of-the-dish-2795510-2025-09-30",
      "headline": "Swiggy surprises Shashi Tharoor with idlis after his poetic defence of the dishShashi Tharoor was delighted after Swiggy delivered a surprise platter of idlis to him after his poetic defence of the dish over the weekend. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-cricket-2025-world-cup-maiden-title-challenge-harmanpreet-kaur-2794717-2025-09-30",
      "headline": "Can Harmanpreet Kaur's Team India script history at home?Women's World Cup 2025 Preview: Harmanpreet Kaur faces a challenging task as India begin their quest for a maiden ICC title against Sri Lanka on September 30 at the Barsapara Stadium in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/gandhi-statue-in-london-vandalised-indian-mission-strongly-condemns-violent-act-glbs-2795424-2025-09-30",
      "headline": "Shameful act: India after Mahatma Gandhi statue vandalised in LondonThe plinth of the iconic statue, which depicts the Father of the Nation in a seated meditative pose, was discovered daubed with some disturbing graffiti. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tvk-functionary-suicide-note-blames-dmk-minister-senthil-balaji-police-for-karur-stampede-deaths-2795517-2025-09-30",
      "headline": "TVK functionary dies by suicide, blames DMK Minister, police for Karur stampedeA TVK functionary from Villupuram district died by suicide, leaving behind a note accusing DMK Minister Senthil Balaji and the police of responsibility for the Karur stampede that killed 41 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/nicole-kidman-keith-urban-separation-nearly-20-years-marriage-2795430-2025-09-30",
      "headline": "Nicole Kidman and Keith Urban separate after nearly 20 years of marriageNicole Kidman and Keith Urban have separated following almost two decades together. The couple share two children and have been married since 2006. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/proud-kannadiga-rishab-shetty-reacts-after-kantara-row-love-kannada-respect-all-languages-2795592-2025-09-30",
      "headline": "Proud Kannadiga Rishab Shetty reacts after row: Love Kannada, respect all languagesRishab Shetty has shared that he is learning Hindi to connect with audiences across India while staying proud of his Kannada roots. He recently faced criticism for speaking Kannada at a Hyderabad event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/katrina-kaif-first-outing-pregnancy-news-sunny-kaushal-birthday-bash-2795590-2025-09-30",
      "headline": "Katrina's first outing after pregnancy news, joins Sunny Kaushal's birthday bashAfter sharing her pregnancy news, actor Katrina Kaif celebrated of her brother-in-law, actor Sunny Kaushal's birthday on Monday. Mini Mathur posted a photo featuring Katrina, Sunny, Isabelle Kaif, and herself from the birthday bash on social media. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-saim-ayub-asia-cup-test-squad-vs-south-africa-2795613-2025-09-30",
      "headline": "Pakistan punish Saim Ayub, all rounder loses place in Test squad Pakistan have pusnished Saim Ayub for his horrid run in the Asia Cup. The young all-rounder has been left out of the team's Test squad vs South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-vs-west-indies-ian-bishop-captian-rohit-paudel-presentation-ceremony-2795561-2025-09-30",
      "headline": "Watch: West Indies great inspires Nepal captain with touching words after T20I upset Former West Indies pacer Ian Bishop came up with a heartwarming gesture after Nepal's historic T20I win, pausing during the presentation to praise captain Rohit Paudel.  Nepal outclassed West Indies by 90 runs on Monday in Sharjah to win a T20I series against the former world champions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-afc-champions-league-withdraw-2795547-2025-09-30",
      "headline": "Mohun Bagan withdraw from ACL 2 as foreign players refuse to travel to Iran Indian football giant Mohun Bagan has withdrawn from the AFC Champions League 2 after six foreign players refused to travel to Iran due to safety concerns. The club has approached the Court of Arbitration for Sport seeking a fair resolution amid potential sanctions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-cricket-2025-world-cup-maiden-title-challenge-harmanpreet-kaur-2794717-2025-09-30",
      "headline": "Can Harmanpreet Kaur's Team India script history at home? Women's World Cup 2025 Preview: Harmanpreet Kaur faces a challenging task as India begin their quest for a maiden ICC title against Sri Lanka on September 30 at the Barsapara Stadium in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-collapse-asia-cup-final-india-captaincy-controversy-2795294-2025-09-30",
      "headline": "Mischievous schoolboys can't win Asia Cup: Pakistan focus on theatrics, fail as pros Asia Cup 2025: Pakistan's campaign was a disaster on every level and the team prioritised antics over cricket. Until they abandon theatrics and focus on basics, Pakistan will keep humiliating themselves despite early promise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistn-tilak-varma-shivam-dube-ms-dhoni-yuvraj-2795486-2025-09-30",
      "headline": "In Tilak Varma-Shivam Dube's epic stand, shades of MS Dhoni-Yuvraj Singh duo linger In Dubai's City of Gold, Tilak Varma and Shivam Dube shone under pressure, forging a partnership that echoed Dhoni and Yuvraj. Their calm yet explosive stand carried India past Pakistan to Asia Cup glory, thus establishing their legacy within Indian cricket history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-ind-vs-pak-syed-kirmani-politics-cricket-2795482-2025-09-30",
      "headline": "I am ashamed: World Cup winner slams politics mixing with cricket at Asia Cup Syed Kirmani has criticised the mixing of politics and sport during the Asia Cup, warning that the current era lacks the camaraderie and gentlemanly spirit of earlier times. The 1983 World Cup winner urged players to focus on cricket and play the game with sporting spirit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-maxwell-freak-inury-australia-vs-new-zealand-2795478-2025-09-30",
      "headline": "Maxwell suffers freak injury in nets, likely to miss India T20Is with broken arm Australia all-rounder Glenn Maxwell has been ruled out of the New Zealand T20Is due to a freak injury in the nets. He is likely to be ruled out of the 5-match T20I series against India as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-vs-sri-lanka-match-preview-2795443-2025-09-30",
      "headline": "IND vs SL: Harmanpreet Kaur's India eyes winning start to home Women's World Cup India vs Sri Lanka, Women's World Cup: With home support and strong form on their side, the Indian women's cricket team will look to begin their ODI World Cup campaign on a winning note when they face Sri Lanka in the opener in Guwahati on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-india-vs-sri-lanka-opening-match-guwahati-curtain-raiser-2795136-2025-09-30",
      "headline": "After 12 years, India set for Women's World Cup return in cricket's grand festival The 2025 ICC Women's World Cup is set to take place from September 30 to November 2, with matches being hosted across India and Colombo. Australia, the defending champions, have claimed the title seven times, while India will be aiming to secure their first-ever ICC Women's World Cup triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-suryakumar-yadav-hardik-receive-warm-welcome-in-mumbai-after-title-win-2795405-2025-09-29",
      "headline": "Asia Cup: Suryakumar Yadav, Hardik receive warm welcome in Mumbai after title win Team India's finest, skipper Suryakumar Yadav and star all-rounder Hardik Pandya received a rousing response as they returned to the Mumbai airport following their triumph at the Asia Cup, downing Pakistan to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-ind-vs-pak-syed-kirmani-politics-cricket-2795482-2025-09-30",
      "headline": "I am ashamed: World Cup winner slams politics mixing with cricket at Asia Cup Syed Kirmani has criticised the mixing of politics and sport during the Asia Cup, warning that the current era lacks the camaraderie and gentlemanly spirit of earlier times. The 1983 World Cup winner urged players to focus on cricket and play the game with sporting spirit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-maxwell-freak-inury-australia-vs-new-zealand-2795478-2025-09-30",
      "headline": "Maxwell suffers freak injury in nets, likely to miss India T20Is with broken arm Australia all-rounder Glenn Maxwell has been ruled out of the New Zealand T20Is due to a freak injury in the nets. He is likely to be ruled out of the 5-match T20I series against India as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-vs-sri-lanka-match-preview-2795443-2025-09-30",
      "headline": "IND vs SL: Harmanpreet Kaur's India eyes winning start to home Women's World Cup India vs Sri Lanka, Women's World Cup: With home support and strong form on their side, the Indian women's cricket team will look to begin their ODI World Cup campaign on a winning note when they face Sri Lanka in the opener in Guwahati on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-india-vs-sri-lanka-opening-match-guwahati-curtain-raiser-2795136-2025-09-30",
      "headline": "After 12 years, India set for Women's World Cup return in cricket's grand festival The 2025 ICC Women's World Cup is set to take place from September 30 to November 2, with matches being hosted across India and Colombo. Australia, the defending champions, have claimed the title seven times, while India will be aiming to secure their first-ever ICC Women's World Cup triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-suryakumar-yadav-hardik-receive-warm-welcome-in-mumbai-after-title-win-2795405-2025-09-29",
      "headline": "Asia Cup: Suryakumar Yadav, Hardik receive warm welcome in Mumbai after title win Team India's finest, skipper Suryakumar Yadav and star all-rounder Hardik Pandya received a rousing response as they returned to the Mumbai airport following their triumph at the Asia Cup, downing Pakistan to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-historic-t20i-series-win-west-indies-largest-margin-associate-team-2795402-2025-09-29",
      "headline": "2nd T20I: Nepal secure historic series win vs West Indies with 90-run victoryNepal achieved a historic milestone on Monday (September 29), securing their first-ever T20I series win over a full-member nation by dominating former world champions West Indies in the second match in Sharjah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-tilak-varma-rousing-welcome-hyderabad-asia-cup-heroics-2795395-2025-09-29",
      "headline": "Watch: Tilak Varma receives rousing welcome in Hyderabad after Asia Cup heroicsIndia's Asia Cup 2025 final hero, Tilak Varma, received a rapturous welcome from fans as he returned to Hyderabad on Monday. The 21-year-old southpaw, who scored an unbeaten 69 to seal victory against Pakistan, was greeted with thunderous cheers at Shamshabad Airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-women-world-cup-in-india-watershed-moment-cricket-sachin-tendulkar-2795389-2025-09-29",
      "headline": "Women's World Cup in India watershed moment for the game: Sachin TendulkarSachin Tendulkar believes the ICC Women's World Cup in India marks a pivotal moment for women's cricket, calling on the nation to embrace it as a catalyst for fresh aspirations and equal recognition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-praises-india-asia-cup-win-team-character-final-2795376-2025-09-29",
      "headline": "Gutted to miss final but Indian team showed character: Hardik on Asia Cup winHardik Pandya was understandably \"gutted\" to have missed the Asia Cup final against Pakistan due to a niggle, but he found comfort in the team's title triumph, saying such tight chases will stand the side in good stead for the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-2025-harmanpreet-kaur-india-under-no-pressure-title-drought-2795368-2025-09-29",
      "headline": "India are under no pressure: Harmanpreet confident of winning Women's World CupIndia women's cricket captain Harmanpreet Kaur expresses strong confidence ahead of their first ODI World Cup match at home. The team aims to leverage recent successes and fan support to make history in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/rinku-hooda-sundar-singh-gurjar-gold-silver-mens-javelin-f46-world-para-athletics-2795361-2025-09-29",
      "headline": "World Para Athletics Championships: Javelin star Rinku Hooda bags India's 2nd goldRinku Hooda and Sundar Singh Gurjar produced a historic one-two finish in the men's javelin throw F46 at the World Para Athletics Championships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-final-india-beat-pakistan-tilak-varma-shivam-dube-conversation-2795348-2025-09-29",
      "headline": "Pakistan players were saying lot of things, I wanted my bat to respond: Tilak VarmaPakistan players had \"a lot to say\" to Tilak Varma as he walked out to bat in the Asia Cup final, spurring the young Indian batter to play one of the most defining innings of his career so far in the Asia Cup final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-amir-emotional-after-pakistan-asia-cup-final-loss-india-2795346-2025-09-29",
      "headline": "Watch: Mohammad Amir nearly brought to tears after Pakistan's Asia Cup final lossMohammad Amir was nearly brought to tears after Pakistan lost the Asia Cup final to India. His reflections highlight Pakistan's batting failures and praise India's Tilak Varma's composure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-2025-harmanpreet-kaur-india-under-no-pressure-title-drought-2795368-2025-09-29",
      "headline": "India are under no pressure: Harmanpreet confident of winning Women's World CupIndia women's cricket captain Harmanpreet Kaur expresses strong confidence ahead of their first ODI World Cup match at home. The team aims to leverage recent successes and fan support to make history in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/rinku-hooda-sundar-singh-gurjar-gold-silver-mens-javelin-f46-world-para-athletics-2795361-2025-09-29",
      "headline": "World Para Athletics Championships: Javelin star Rinku Hooda bags India's 2nd goldRinku Hooda and Sundar Singh Gurjar produced a historic one-two finish in the men's javelin throw F46 at the World Para Athletics Championships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-final-india-beat-pakistan-tilak-varma-shivam-dube-conversation-2795348-2025-09-29",
      "headline": "Pakistan players were saying lot of things, I wanted my bat to respond: Tilak VarmaPakistan players had \"a lot to say\" to Tilak Varma as he walked out to bat in the Asia Cup final, spurring the young Indian batter to play one of the most defining innings of his career so far in the Asia Cup final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-amir-emotional-after-pakistan-asia-cup-final-loss-india-2795346-2025-09-29",
      "headline": "Watch: Mohammad Amir nearly brought to tears after Pakistan's Asia Cup final lossMohammad Amir was nearly brought to tears after Pakistan lost the Asia Cup final to India. His reflections highlight Pakistan's batting failures and praise India's Tilak Varma's composure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-chamari-athapaththu-womens-world-cup-asia-team-trophy-2795331-2025-09-29",
      "headline": "Hope an Asian team wins Women's World Cup this time: Sri Lanka captain ChamariSri Lanka captain Chamari Athapaththu hopes an Asian side will win the Women's World Cup as her team returns to the tournament on home soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alzarri-joseph-ruled-out-india-test-series-back-injury-west-indies-squad-update-2795319-2025-09-29",
      "headline": "IND vs WI: Alzarri Joseph ruled out of India Test series due to lower back injuryIND vs WI: Alzarri Joseph has been ruled out of the India Test series due to a lower back injury. This injury poses a significant challenge for the West Indies team ahead of the crucial matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-india-vs-pakistan-suryakumar-yadav-t20-world-cup-2795290-2025-09-29",
      "headline": "Suryakumar Yadav shifts focus to T20 World Cup after Asia Cup heistAsia Cup 2025, IND vs PAK: After beating Pakistan by five wickets on Sunday to claim the title, Suryakumar Yadav said that India would now shift their focus to the T20 World Cup to be held next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-played-great-cricket-and-played-like-champions-now-move-on-kapil-dev-2795287-2025-09-29",
      "headline": "India played great cricket and played like champions, now move on: Kapil DevFormer India captain, Kapil Dev wants cricket to move on following the controversial Asia Cup 2025 campaign, which saw many off-field matters take the spotlight as India went on to beat Pakistan in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-defeat-pak-fans-journalist-former-cricketers-blast-haris-rauf-salman-ali-agha-trophy-mohsin-naqvi-2795247-2025-09-29",
      "headline": "India humare baap hai: Pakistanis roast cricket team after Asia Cup lossFrom fans to former cricketers to journalists, Pakistanis are blasting their team and players, left, right and centre, after the team's loss to India in the Asia Cup final. There's a storm of anger, memes, and soul-searching that is laying bare the deep crisis in Pakistan cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-captain-suryakumar-yadav-exclusive-pakistans-provocative-gestures-asia-cup-final-2795263-2025-09-29",
      "headline": "Suryakumar Yadav on India-Pakistan controversy: Not okay if you cross the lineIn an interview with India Today, Indian captain Suryakumar Yadav discussed Pakistan's provocative gestures in the Asia Cup, highlighting Sahibzada Farhan gunshot celebration and Haris Rauf's planecrash act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-tilak-varma-gifts-autographed-cap-lokesh-nara-chandrababu-naidu-2795256-2025-09-29",
      "headline": "Watch: After Asia Cup win, Tilak Varma gifts signed cap to Andhra Pradesh ministerTilak Varma made a heartfelt gesture, giving away an autographed cap to the Andhra Pradesh cabinet minister, Lokesh Nara following his heroic knock at the Asia Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kapil-dev-interview-focus-on-cricket-not-politics-after-india-pakistan-asia-cup-final-2795230-2025-09-29",
      "headline": "Stick to sports: Kapil Dev opens up on India-Pakistan controversy in Asia CupIn an interview with India Today, legendary India captain Kapil Dev urged that cricket remain free from political interference after India's five-wicket win over Pakistan in the Asia Cup final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-suryakumar-yadav-hails-pm-narendra-modi-operation-sindoor-tweet-2795216-2025-09-29",
      "headline": "Suryakumar praises PM Modi's Op Sindoor post after Asia Cup win: He bats on front footIndian captain Suryakumar Yadav expressed gratitude for PM Modi's encouraging words after India's Asia Cup triumph. The praise has boosted the team's morale ahead of future challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-denied-asia-cup-trophy-mohsin-naqvi-celebration-2795157-2025-09-29",
      "headline": "Silver stolen but spirit of gold: Champions India glitter despite Mohsin Naqvi heistAfter being denied of their moment in the spotlight by a lame attempt from PCB chief Mohsin Naqvi, the Indian team showed, through humour and passion, that their spirit will not be dimmed by any underhand tactics and celebrated their Asia Cup win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shoaib-malik-india-regret-asia-cup-trophy-2025-2795120-2025-09-29",
      "headline": "Not collecting Asia Cup trophy will haunt India down the line: Shoaib MalikFormer Pakistan captain Shoaib Malik has claimed that India will regret the decision not to collect the Asia Cup trophy after winning it on Sunday, September 28. India decided not to take the trophy from ACC chief Mohsin Naqvi after beating Pakistan by five wickets. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}