{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lookout-notice-against-anil-ambani-in-alleged-rs-3000-crore-loan-fraud-case-2764939-2025-08-01",
      "headline": "Anil Ambani faces lookout notice in Rs 3,000-crore loan fraud caseAnil Ambani can now no longer travel outside India without court permission. This comes after a series of crackdowns on his business entities, allegations of fraud against his firms, and a summons issued by a federal agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vandana-vasudevan-on-how-tech-is-reshaping-daily-life-2764868-2025-08-01",
      "headline": "Vandana Vasudevan on how tech is reshaping daily lifeSpeaking with Business Today's Sakshi Batra, OTP Please author Vandana Vasudevan explains how this shift is changing daily routines."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/otp-please-the-double-edged-sword-of-digital-living-vandana-vasudevan-2764846-2025-08-01",
      "headline": "OTP Please! The double-edged sword of digital living: Vandana VasudevanSpeaking with Business Today's Sakshi Batra, OTP Please author Vandana Vasudevan tells how tech has changed how we live, making travel easier for the disabled, food more accessible, and work more flexible. But she warns of fading community bonds, unhealthy habits, and insecure gig jobs. Tech must support life, not replace human connection."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/us-tariffs-will-not-have-significant-adverse-impact-on-indian-economy-sources-2764783-2025-08-01",
      "headline": "US tariffs will not have significant adverse impact on Indian economy: SourcesThe 25% tariff announced by US President Donald Trump will not have a significant adverse impact on the Indian economy, government sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-starlink-monthly-plan-cost-spacex-telecom-satellite-launch-jyotiraditya-scindia-2764764-2025-08-01",
      "headline": "Elon Musk's Starlink to operate soon in India. Check monthly plansUnion Telecom Minister Jyotiraditya Scindia confirmed that Starlink has been awarded a Unified Licence to launch its satellite internet operations in India. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-586-points-lower-nifty-below-25600-infosys-ends-3-percent-down-2764795-2025-08-01",
      "headline": "Sensex closes 586 points lower, Nifty below 25,600; Infosys ends 3% downThe S&P BSE Sensex lost 585.67 points to close at 80,599.91, while the NSE Nifty50 was down by 203 points to end at 24,565.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fd-tips-loss-emergency-fund-mistake-insurance-fund-personal-finance-money-saving-2764639-2025-08-01",
      "headline": "CA explains why you should not use FDs as an emergency fundAccording to RBI guidelines, banks can charge up to 0.5% to 1.0% of the interest rate as a penalty if FDs are broken before their maturity period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-compromise-on-agriculture-dairy-farmers-interest-government-sources-on-us-tariff-2764724-2025-08-01",
      "headline": "Indian interests top priority, no chance of compromising due to US tariffs: SourcesAn official said that the government is closely watching the developments but sees no reason for alarm after the US imposed a 25% tariff on India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-news-probe-not-cooperating-staff-income-tax-department-books-outside-india-report-2764710-2025-08-01",
      "headline": "Jane Street not cooperating in probe with income tax department: ReportThe firm's servers are located outside India, and officials said they are unable to access them. Additionally, accounts books are also being maintained overseas, even though company law requires them to be kept in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-to-buy-a-car-without-taking-loan-heres-how-you-can-do-it-2764705-2025-08-01",
      "headline": "Planning to buy a car without taking loan? Here's how you can do itThink you need a big salary or bank loan to own a car? Think again. A thoughtful plan, regular savings, and side gigs helped one man save Rs 7.1 lakh in three years, all without borrowing a rupee. Here's how you can do it too."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/pnb-housing-finance-ltd-share-crash-18-percent-today-4-month-low-reason-md-ceo-resign-girish-kousgi-2764659-2025-08-01",
      "headline": "Explained: Why PNB Housing Finance Ltd shares crashed 18% todayPNB Housing Finance Ltd share crash: The steep fall followed days of weak performance. Over the past five days, the stock has lost 19.59%, and in the last month, it has dropped 26.53%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-tax-rules-coming-soon-how-the-income-tax-bill-2025-could-impact-you-2764621-2025-08-01",
      "headline": "New tax rules coming soon. How the Income Tax Bill 2025 could impact youThe new law aims to make income tax rules easier to understand, reduce legal disputes, and help people comply with tax rules more easily. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shah-rukh-khan-and-vikrant-massey-share-national-award-for-best-actor-rani-mukerji-wins-best-actress-2764907-2025-08-01",
      "headline": "Vikrant Massey-SRK share National Award for Best Actor, Rani Mukerji wins Best ActressVikrant Massey and Shah Rukh Khan won Best Actor for '12th Fail' and 'Jawan' respectively at the 71st National Film Awards. Rani Mukerji bagged Best Actress for her role in 'Mrs Chatterjee vs Norway'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/kathal-a-jackfruit-mystery-wins-national-film-award-for-best-hindi-feature-2764898-2025-08-01",
      "headline": "Sanya Malhotra's Kathal wins Best Hindi Feature at National Film Awards 2025'Kathal: A Jackfruit Mystery' won Best Hindi Feature at the 71st National Film Awards, announced on August 1. The film was praised for its unique storytelling, strong performances, and socially relevant message."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/janhvi-kapoor-ishaan-khatter-homebound-to-close-indian-film-festival-of-melbourne-2025-2764739-2025-08-01",
      "headline": "Janhvi Kapoor-Ishaan Khatter's Homebound to close Indian Film Festival of MelbourneAfter a successful premiere at Cannes, 'Homebound' starring Ishaan Khatter, Vishal Jethwa, and Janhvi Kapoor will close the Indian Film Festival of Melbourne (IFFM) 2025. Directed by Neeraj Ghaywan, the film explores friendship, ambition, and the emotional cost of change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/after-sikandar-failure-ar-murugadoss-says-mother-tongue-films-tap-his-potential-2764853-2025-08-01",
      "headline": "After Sikandar failure, AR Murugadoss says mother-tongue films tap his potentialDirector AR Murugadoss highlights the importance of making films in one's mother-tongue, citing challenges in translating cultural nuances and emotions when working with other languages. His statement comes after the failure of Salman Khan's 'Sikandar'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/wwe-unreal-review-cm-punk-john-cena-triple-h-netflix-documentary-2764619-2025-08-01",
      "headline": "WWE Unreal review: Netflix docuseries reveals real drama behind wrestling spectacleRelease Date:Tue Jul 29, 2025'WWE: Unreal' docuseries gives fans a sneak peek into the process, raw emotions and the life of each wrestler. The documentary hits a home run in humanising the world of pro-wrestling for its fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadak-2-x-reviews-fans-call-triptii-dimri-siddhant-chaturvedi-film-an-unworthy-remake-2764850-2025-08-01",
      "headline": "Dhadak 2 X reviews: Fans call Triptii-Siddhant's film an unworthy remake'Dhadak 2', starring Triptii Dimri and Siddhant Chaturvedi, released in theatres today and sparked mixed reactions online. While some praised its raw portrayal of caste and love, others criticised it as a weak remake of the Tamil original 'Pariyerum Perumal'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-launches-global-dance-contest-war-2-aavan-jaavan-song-2764803-2025-08-01",
      "headline": "Hrithik Roshan invites fans for Aavan Jaavan dance contest ahead of War 2 releaseActor Hrithik Roshan has launched a global dance contest for the 'War 2' song 'Aavan Jaavan'. He shared a video , inviting fans worldwide to join and win exciting prizes, ahead of the film's release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dating-aadar-jain-a-mistake-tara-sutaria-shares-details-veer-pahariya-2764733-2025-08-01",
      "headline": "Was dating Aadar Jain a mistake? Tara Sutaria shares details and new loveActor Tara Sutaria shared that she's in a happy place in life and reflected on the missteps she made in her twenties, subtly referencing a past relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kusha-kapila-slams-kaviraj-singh-over-misogynistic-remarks-on-female-influencers-2764840-2025-08-01",
      "headline": "Kusha Kapila slams Kaviraj Singh over misogynistic remarks on female influencersKusha Kapila slammed comedian Kaviraj Singh for comparing female influencers to sex workers in a viral video. She said such jokes are harmful and encourage bad behaviour towards women in real life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/ranveer-allahbadia-says-he-wanted-wife-so-bad-reflects-on-love-amid-breakup-rumours-2764833-2025-08-01",
      "headline": "Ranveer Allahbadia says he wanted wife so bad, reflects on love amid breakup rumoursYouTuber Ranveer Allahbadia speaks about being single, reflecting on past relationships amid rumours of a breakup with Nikki Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aanand-l-rai-calls-ai-version-of-raanjhanaa-a-betrayal-after-producers-statement-2764569-2025-08-01",
      "headline": "Aanand L Rai calls AI version of Raanjhanaa a betrayal after producers' statementFilmmaker Aanand L Rai stated in a long note on social media that he neither supports nor approves of the AI-modified version of 'Raanjhanaa', describing it as unauthorised. The film was originally released in 2013.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/housefull-5-ott-when-where-watch-akshay-kumar-comedy-2764657-2025-08-01",
      "headline": "Housefull 5 OTT release: When and where to watch Akshay Kumar's comedy drama 'Housefull 5', starring Akshay Kumar and Riteish Deshmukh, is now out on Prime Video. Set on a cruise, the film is full of comedy, confusion, and lots of drama as three men claim to be the same person."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-ott-this-weekend-july-28-august-3-2025-2764822-2025-08-01",
      "headline": "Top films and shows to watch on OTT this weekendOTT's new weekend lineup caters to all tastes, featuring a mix of documentaries, anime, dramas, and comedy shows. From thought-provoking political documentaries to thrilling action and heartfelt stories, there is something engaging for every viewer in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/exclusive-my-oxford-year-sofia-carson-corey-mylchreest-chemistry-bollywood-love-language-2764824-2025-08-01",
      "headline": "Exclusive: Sofia Carson, Corey Mylchreest on Bollywood, chemistry, love languageIn an exclusive interaction with India Today, 'My Oxford Year' actors Sofia Carson and Corey Mylchreest spoke about their love for Bollywood and the possibilities of exploring the new sphere. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shikhar-pahariya-praises-janhvi-kapoor-in-pardesiya-song-param-sundari-2764775-2025-08-01",
      "headline": "Shikhar Pahariya gushes over Janhvi Kapoor in Pardesiya: Best song and best girlJanhvi Kapoor and Sidharth Malhotra's romantic track 'Pardesiya' from 'Param Sundari' is winning hearts. Janhvi's boyfriend Shikhar Pahariya shared the song on Instagram and called it the best song and tagged her as his best girl. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-birthday-to-pass-without-ssmb29-teaser-heres-why-ss-rajamouli-priyanka-chopra-2764765-2025-08-01",
      "headline": "Mahesh Babu's birthday to pass without SSMB29 teaser. Here's why!Director SS Rajamouli has chosen not to release any teaser or poster on actor Mahesh Babu's birthday. The filmmaker is focusing on a global scale reveal for the ambitious action film scheduled to release in 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/liam-neeson-naked-gun-reboot-2025-comedy-detective-pamela-anderson-2764778-2025-08-01",
      "headline": "The Naked Gun review: Liam, Pamela's film is ridiculously silly,and it's a good thingRelease Date:Fri Aug 01, 2025Liam Neeson stars as the bumbling detective in The Naked Gun reboot. The film's absurd humour and nostalgic charm bring fresh life to the classic franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kothalavadi-review-oldschool-screenplay-weighs-down-an-interesting-village-drama-2764773-2025-08-01",
      "headline": "Kothalavadi review: Old-school screenplay weighs down interesting village dramaRelease Date:Fri Aug 01, 2025Kothalavadi film review: Debutant Sriraj's Kannada film stars Pruthvi Ambar and Gopalkrishna Deshpande. Produced by Yash's mother Pushpa Arunkumar, 'Kothalavadi' explores a clash between the struggling village folk and the police trying to guide them on the right path."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-sister-khushboo-clarifies-remarks-directed-at-aniruddhacharya-not-premanand-ji-2764712-2025-08-01",
      "headline": "Khushboo Patani clarifies: Remarks directed at Aniruddhacharya, not Premanand JiActor Disha Patani's sister Khusboo Patani clarified that her comments were directed at Aniruddhacharya's misogynistic views and not about spiritual leader Premanand Ji Maharaj. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lookout-notice-against-anil-ambani-in-alleged-rs-3000-crore-loan-fraud-case-2764939-2025-08-01",
      "headline": "Anil Ambani faces lookout notice in Rs 3,000-crore loan fraud caseAnil Ambani can now no longer travel outside India without court permission. This comes after a series of crackdowns on his business entities, allegations of fraud against his firms, and a summons issued by a federal agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/taken-note-of-trumps-25-tariffs-on-india-studying-them-says-new-delhi-2764827-2025-08-01",
      "headline": "No comment: New Delhi on Trump's 'Pak will soon sell oil to India' remarkStanding by its decision to purchase oil from Russia, India stated that its choices are guided by the prevailing global scenario and the best available deals in the market to secure the country's energy needs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-embassy-dublin-issues-advisory-amid-rising-attacks-indians-ireland-racist-attacks-teenagers-gang-santosh-yadav-tallaghat-2764845-2025-08-01",
      "headline": "Avoid deserted areas: Gang attack on Indians in Ireland sparks Embassy advisoryAmid a rise in racially motivated assaults on Indians in Ireland, the Indian Embassy in Dublin has issued a safety advisory urging citizens to avoid deserted areas and remain vigilant. Recent incidents include the assault of a 32-year-old Indian man who suffered a fractured cheekbone, and an Amazon employee who was attacked and stripped in Dublin. The Embassy is coordinating with Irish authorities and has provided emergency helpline numbers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-london-weather-day-2-live-score-updates-2764717-2025-08-01",
      "headline": "5th Test, Day 2 Live: Siraj gets Root and Pope to peg back EnglandIndia (IND) vs England (ENG), 5th Test, Day 2 Live Score and Weather Updates: Mohammed Siraj has got the big wicket of Joe Root. He is bowling with some venom in the second session. He got the big wicket of stand-in captain Ollie Pope too in the session. Jacob Bethell has joined Harry Brook in the middle as England have lost three wickets in this session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/story-of-the-crash-of-flight-ai-171-and-a-very-flighty-investigative-report-air-india-ahmedabad-2764682-2025-08-01",
      "headline": "Story of the crash of Flight AI 171 and a very flighty investigative reportThe Boeing 787 Dreamliner, which was on its way to London, crashed into the BJ Medical College hostel building in Ahmedabad within seconds of takeoff on June 12. The tragedy left 260 people, including 241 passengers and crew on board and 19 others on the ground, dead. Within a month of the preliminary investigation report on the crash appearing to have settled blame on the cockpit crew, a veteran pilot shattered the silence with a striking analysis that turns the investigation on its head."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/gurugram/video/sink-city-gurugram-who-is-responsible-for-millennium-citys-civic-mess-2764905-2025-08-01",
      "headline": "'Sink city' Gurugram: Who is responsible for Millennium City's civic mess?This India Today special campaign for change focusses on the civic collapse in Gurgaon, the Millennium City. Residents, who have invested significantly in luxury properties, find themselves navigating a city plagued by infrastructural failure, especially during monsoons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/jefferey-epstein-files-open-tariffs-india-donald-trump-maga-angry-h1b-resentment-immigration-anxiety-2764825-2025-08-01",
      "headline": "Epstein sexplosion behind India tariff explosion?Donald Trump promised to release the Epstein files but disappointed his MAGA crowd. This amid allegations, even by Elon Musk, that Trump's name appeared in the Epstein files that detail rapes of minor girls. Are Trump's punitive tariffs and penalties directed at India because MAGA loves to hate the country, and he wants to feed the monster?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/we-look-up-each-time-a-plane-takes-off-inside-ground-zero-of-air-india-crash-2764211-2025-07-31",
      "headline": "'We look up each time a plane takes off': Inside Ground Zero of Air India crashHow students and faculty at Ahmedabad's Byramjee Jeejeebhoy Medical College are coping with the trauma"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/air-india-dreamliner-crash-investigation-transat-236-a330-emergency-landing-glide-portugal-midair-engine-failure-2764467-2025-08-01",
      "headline": "Engines dead, pilots glided plane for 120km over ocean, saved 306 livesWhen both engines of Transat Flight 236 from Canada to Portugal died out midair over the Atlantic Ocean in 2001 due to a fuel leak, it was still 120km short of an airstrip. The pilots glided the plane to safety, creating a world record and saving 306 people onboard, in what is now known as the Miracle on the Azores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-said-that-white-house-should-be-asked-the-question-if-us-president-donald-trump-should-get-the-nobel-peace-prize-2764881-2025-08-01",
      "headline": "What India said on White House's call for Nobel Peace Prize for TrumpWhite House has claimed that the global peace deals brokered by Trump average to one per month and has reiterated the call for the Nobel Peace Prize to be awarded to the US President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-sitaare-zameen-par-premieres-on-youtube-pay-per-view-model-what-it-means-for-the-industry-2764746-2025-08-01",
      "headline": "What Sitaare Zameen Par's pay-per-view release on YouTube means for the industryAamir Khan has taken a bold step by releasing his film 'Sitaare Zameen Par' on YouTube via pay-per-view for Rs 100, marking a fresh attempt to revive TVOD in India. This move challenges traditional theatrical norms and aims to leverage YouTube's massive reach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pain-behind-kishore-kumar-madness-the-real-anand-2764603-2025-08-01",
      "headline": "The Real Anand: The Pain Behind Kishore Kumar's MadnessKishore Kumar's eccentricities revealed a paradoxical genius whose soulful voice illuminated millions, masking a life of solitude and inner turmoil."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/deve-gowda-india-donald-trump-us-india-tariff-rahul-gandhi-jds-economy-2764888-2025-08-01",
      "headline": "Ex-PM Deve Gowda slams Trump's India jibe, calls Opposition his deluded spokespersonAfter US President Donald Trump called India a \"dead economy\" and imposed hefty tariffs, former Prime Minister HD Deve Gowda slammed Trump as volatile and irresponsible. He praised the Modi government's firm response and warned Opposition leaders like Rahul Gandhi against backing Trump's views. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-peon-gives-urine-instead-of-water-to-senior-officer-arrested-gajapati-2764793-2025-08-01",
      "headline": "Odisha bureaucrat asks for drinking water, peon gives him bottle of urineA peon in Odisha was arrested for allegedly handing a bottle of urine to his senior officer instead of drinking water, leading to the officer's hospitalisation. The incident occurred in Gajapati district."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prajwal-revanna-former-jds-mp-convicted-for-rape-breaks-down-in-court-2764732-2025-08-01",
      "headline": "Ex-JDS MP Prajwal Revanna convicted for rape, verdict came in just 14 monthsA Karnataka special court has convicted former JDS MP Prajwal Revanna in a rape case filed by a domestic worker. The verdict came just 14 months after a case was filed against him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/liam-neeson-naked-gun-reboot-2025-comedy-detective-pamela-anderson-2764778-2025-08-01",
      "headline": "The Naked Gun review: Liam, Pamela's film is ridiculously silly,and it's a good thingRelease Date:Fri Aug 01, 2025Liam Neeson stars as the bumbling detective in The Naked Gun reboot. The film's absurd humour and nostalgic charm bring fresh life to the classic franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/world-lung-cancer-day-one-puff-many-scars-a-journey-inside-smoker-lungs-280-01-08-2025",
      "headline": "One puff, many scars: A journey inside smoker's lungsYou can't rewind lung damage, but you can stop fast-forwarding it. Start with awareness, and let knowledge be your breath of fresh air."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-lokayukta-seizes-rs-30-crore-assets-from-kridl-ex-clerk-earning-rs-15000-salary-2764578-2025-08-01",
      "headline": "Raids on ex-Karnataka clerk unearth Rs 30 crore in assets, including 24 housesA former clerk at Karnataka Rural Infrastructure Development Limited is under investigation after a Lokayukta raid revealed massive wealth, including houses, land and jewellery, worth over Rs 30 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-compromise-on-agriculture-dairy-farmers-interest-government-sources-on-us-tariff-2764724-2025-08-01",
      "headline": "Indian interests top priority, no chance of compromising due to US tariffs: SourcesAn official said that the government is closely watching the developments but sees no reason for alarm after the US imposed a 25% tariff on India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/happy-gilmore-2-review-adam-sandler-returns-with-a-swing-and-a-hole-lot-of-heart-2764649-2025-08-01",
      "headline": "Happy Gilmore 2 review: Adam Sandler returns with a swing and a hole lot of heartRelease Date:Fri Jul 25, 2025Happy Gilmore 2 movie review: 'Happy Gilmore 2' sees Adam Sandler return with his trademark humour. The film balances comedy, family drama, and nostalgia, making it a heartfelt and entertaining watch for audiences across"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/rats-spotted-makhan-malai-ingredient-trays-lucknow-sweet-shop-viral-video-sparks-outrage-2764813-2025-08-01",
      "headline": "Rats spotted on ingredient trays at Lucknow sweet shop, video sparks outrageThe now-viral reel shows the behind-the-scenes process of making the traditional delicacy. However, midway through the video, rats can be seen running across trays of ingredients. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-rebuts-donald-trumps-dead-economy-jibe-after-congrsss-rahul-gandhis-endorsement-2764737-2025-08-01",
      "headline": "Not the case: Shashi Tharoor differs with Rahul Gandhi's stance on Trump remarksCongress MP Shashi Tharoor rejected US President Donald Trump's remark calling India a \"dead economy,\" apparently countering fellow Congress leader Rahul Gandhi who had supported the statement a day earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-20-minute-long-lightning-spectacle-seen-from-fight-to-india-2764723-2025-08-01",
      "headline": "Video: 20-minute-long lightning spectacle seen from flight to IndiaEyewitnesses aboard the flight reported seeing near-continuous flashes of lightning outside their windows for more than 20 minutes as the plane navigated the weather system. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/71st-national-film-awards-winners-2025-who-won-best-actor-best-film-check-full-list-2764941-2025-08-01",
      "headline": "71st National Film Awards: Best Actor, Best Film and more. Full winners' list hereThe 71st National Film Awards were announced in New Delhi, honouring excellence across Indian cinema with Shah Rukh Khan and Vikrant Massey sharing Best Actor and Rani Mukerji winning Best Actress. Check out the full winners' list here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shah-rukh-khan-and-vikrant-massey-share-national-award-for-best-actor-rani-mukerji-wins-best-actress-2764907-2025-08-01",
      "headline": "Vikrant Massey-SRK share National Award for Best Actor, Rani Mukerji wins Best ActressVikrant Massey and Shah Rukh Khan won Best Actor for '12th Fail' and 'Jawan' respectively at the 71st National Film Awards. Rani Mukerji bagged Best Actress for her role in 'Mrs Chatterjee vs Norway'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/kathal-a-jackfruit-mystery-wins-national-film-award-for-best-hindi-feature-2764898-2025-08-01",
      "headline": "Sanya Malhotra's Kathal wins Best Hindi Feature at National Film Awards 2025'Kathal: A Jackfruit Mystery' won Best Hindi Feature at the 71st National Film Awards, announced on August 1. The film was praised for its unique storytelling, strong performances, and socially relevant message."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/janhvi-kapoor-ishaan-khatter-homebound-to-close-indian-film-festival-of-melbourne-2025-2764739-2025-08-01",
      "headline": "Janhvi Kapoor-Ishaan Khatter's Homebound to close Indian Film Festival of MelbourneAfter a successful premiere at Cannes, 'Homebound' starring Ishaan Khatter, Vishal Jethwa, and Janhvi Kapoor will close the Indian Film Festival of Melbourne (IFFM) 2025. Directed by Neeraj Ghaywan, the film explores friendship, ambition, and the emotional cost of change."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-prasidh-krishna-joe-root-video-fight-2764934-2025-08-01",
      "headline": "Oval Test: Nice guy Joe Root loses his cool after verbal volley with Prasidh KrishnaEngland vs India, 5th Test: Joe Root lost his cool after fast bowler Prasidh Krishna sledged him during the second session on Day 2. The Indian bowlers were fired up after being taken to the cleaners in the first session on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-aakash-deep-faces-flak-for-send-off-to-ben-duckett-in-oval-test-2764890-2025-08-01",
      "headline": "Unnecessary? Aakash Deep faces flak for send-off to Ben Duckett in Oval TestIndia fast bowler Akash Deep is facing flak for making unnecessary physical contact with England batter Ben Duckett after dismissing him on Day 2 of the fifth Test against England at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-224-batting-collapse-atkinson-5-wickets-day-2-oval-test-2764810-2025-08-01",
      "headline": "34 balls, 6 runs, 4 wickets: India's lower-order blown away on Day 2 morningEngland needed just 34 balls to dismantle the remaining four Indian wickets on a lively second morning at The Oval, bundling the visitors out for a modest 224 — the lowest first-innings total of the series so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-released-india-squad-final-test-the-oval-2764801-2025-08-01",
      "headline": "Jasprit Bumrah released from India squad during final Test at The OvalIndia's pace spearhead Jasprit Bumrah has been officially released from the squad for the fifth and final Test of the Anderson-Tendulkar Trophy against England at The Oval, as part of a pre-determined workload management plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pujara-rahane-dropped-west-zone-duleep-trophy-bcci-zonal-format-2764789-2025-08-01",
      "headline": "End of the road for Pujara, Rahane: Legends left out of Duleep Trophy squadVeteran Indian cricketers Cheteshwar Pujara and Ajinkya Rahane have been left out of the West Zone Duleep Trophy squad. This decision could turn out to be a big hit on their Test careers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-5th-test-chris-woakes-injury-update-ruled-out-2764755-2025-08-01",
      "headline": "Seamer Chris Woakes ruled out of the final Test due to shoulder injuryIndia vs England: England pacer Chris Woakes will play no further part in the 5th Test match, the team announced at the start of Day 2 of the final Test match. Woakes was injured while fielding on Day 1 at The Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-london-weather-day-2-live-score-updates-2764717-2025-08-01",
      "headline": "5th Test, Day 2 Live: Siraj gets Root and Pope to peg back EnglandIndia (IND) vs England (ENG), 5th Test, Day 2 Live Score and Weather Updates: Mohammed Siraj has got the big wicket of Joe Root. He is bowling with some venom in the second session. He got the big wicket of stand-in captain Ollie Pope too in the session. Jacob Bethell has joined Harry Brook in the middle as England have lost three wickets in this session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/who-is-khalid-jamil-indian-men-football-team-new-head-coach-2764709-2025-08-01",
      "headline": "Who is Khalid Jamil? The man trusted to lead Indian football's revivalKhalid Jamil has been appointed head coach of the Indian men's national football team, the first Indian in the role in over ten years. His task is to revive Indian football and steer the team to better performances in upcoming tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-india-assistant-coach-reaction-shubman-gill-run-out-2764703-2025-08-01",
      "headline": "India assistant coach reacts to Shubman Gill's unfortunate run outShubman Gill came under fire from fans for a careless run-out on Day 1 of the final Test, with India's assistant coach Ryan ten Doeschate also highlighting the recklessness of the dismissal during the post-match media interaction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-football-men-team-new-coach-khalid-jamil-2764669-2025-08-01",
      "headline": "Khalid Jamil announced as new head coach of Indian football teamFormer East Bengal and Mohun Bagan manager Khalid Jamil has been announced as new head coach of Indian football team. Jamil joins the Indian team after the exit of Manolo Marquez."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-5th-test-chris-woakes-injury-update-ruled-out-2764755-2025-08-01",
      "headline": "Seamer Chris Woakes ruled out of the final Test due to shoulder injuryIndia vs England: England pacer Chris Woakes will play no further part in the 5th Test match, the team announced at the start of Day 2 of the final Test match. Woakes was injured while fielding on Day 1 at The Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-london-weather-day-2-live-score-updates-2764717-2025-08-01",
      "headline": "5th Test, Day 2 Live: Siraj gets Root and Pope to peg back EnglandIndia (IND) vs England (ENG), 5th Test, Day 2 Live Score and Weather Updates: Mohammed Siraj has got the big wicket of Joe Root. He is bowling with some venom in the second session. He got the big wicket of stand-in captain Ollie Pope too in the session. Jacob Bethell has joined Harry Brook in the middle as England have lost three wickets in this session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/who-is-khalid-jamil-indian-men-football-team-new-head-coach-2764709-2025-08-01",
      "headline": "Who is Khalid Jamil? The man trusted to lead Indian football's revivalKhalid Jamil has been appointed head coach of the Indian men's national football team, the first Indian in the role in over ten years. His task is to revive Indian football and steer the team to better performances in upcoming tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-india-assistant-coach-reaction-shubman-gill-run-out-2764703-2025-08-01",
      "headline": "India assistant coach reacts to Shubman Gill's unfortunate run outShubman Gill came under fire from fans for a careless run-out on Day 1 of the final Test, with India's assistant coach Ryan ten Doeschate also highlighting the recklessness of the dismissal during the post-match media interaction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-football-men-team-new-coach-khalid-jamil-2764669-2025-08-01",
      "headline": "Khalid Jamil announced as new head coach of Indian football teamFormer East Bengal and Mohun Bagan manager Khalid Jamil has been announced as new head coach of Indian football team. Jamil joins the Indian team after the exit of Manolo Marquez."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}