{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-a-change-of-name-caused-bira-a-loss-of-rs-80-crore-check-details-2681372-2025-02-17",
      "headline": "How a change of name caused Bira a loss of Rs 80 crore. Check details Ahead of its IPO, B9 Beverages Private Ltd, the owner of Bira beer, changed its name to B9 Beverages Ltd, causing several compliance hurdles and sales disruptions.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-2025-10-faqs-you-should-know-2681326-2025-02-17",
      "headline": "New Income Tax Bill: 10 FAQs you should knowNew Income Tax Bill 2025 explained: The current income tax bill which was enacted in 1961, and came into effect in 1962, consisted of 512,535 words and 819 sections. On the contrary, the new bill consists of 259,676 words, 23 chapters and 536 sections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-gains-600-points-nifty-recover-losses-to-end-marginally-higher-amid-volatility-2681266-2025-02-17",
      "headline": "Sensex, Nifty recover losses to end marginally higher amid volatilityThe S&P BSE Sensex gained 57.65 points to close at 75,996.86, while the NSE Nifty50 added 30.25 points to end at 22,959.50. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pfrda-warns-against-nps-apy-scams-issues-guidelines-to-stay-protected-2681238-2025-02-17",
      "headline": "Regulatory body warns against rising NPS scams, issues these guidelines The Pension Fund Regulatory and Development Authority (PFRDA) has cautioned subscribers of the National Pension Scheme (NPS) and Atal Pension Yojayna (APY) regarding fraudulent calls demanding money to release pension funds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-mulls-over-setting-a-reserve-fund-for-stable-epfo-interest-rates-2681191-2025-02-17",
      "headline": "Government may set up reserve fund for stable EPFO interest rates: ReportThe labour and employment ministry is conducting an internal study to explore the creation of an interest stabilisation reserve fund under the EPFO, sources said familiar with the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-svanidhi-scheme-know-about-eligibility-and-rs-30000-credit-cards-2680106-2025-02-17",
      "headline": "PM SVANidhi scheme: Know about eligibility and Rs 30,000 credit cardsPM SVANidhi scheme eligibility: Finance Minister Nirmala Sitharaman in her Budget 2025 speech announced providing credit cards under the PM SVANidhi scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-your-money-safe-in-co-operative-banks-safe-rbi-latest-curbs-on-new-india-co-operative-bank-raise-concern-2681213-2025-02-17",
      "headline": "Is your money safe in co-operative banks safe? RBI's latest curbs raise concernConcerns over New India Co-operative Bank's financial stability and a potential Rs 122 crore scam prompted the RBI to take strict action. This incident has added to the growing list of cooperative banks facing regulatory action."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-inc-q3-results-worst-quarter-in-5-years-what-it-means-for-stock-market-views-2681211-2025-02-17",
      "headline": "India Inc sees worst quarter in 5 years: What it means for stock market? The recently concluded Q3 earnings season has been the weakest for India Inc since the first quarter of FY21, according to a report by domestic brokerage firm Motilal Oswal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/edelweiss-mutual-fund-ceo-radhika-gupta-market-advice-bad-times-do-not-last-good-investors-do-2681158-2025-02-17",
      "headline": "Radhika Gupta on market volatility: Bad times don't last. Good investors doRadhika Gupta's advice comes as stock markets continue to witness a downward trend, with the sell-off in smallcap and midcap stocks intensifying. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/senco-gold-stock-price-tumbles-32-in-2-sessions-heres-what-brokerages-say-2681155-2025-02-17",
      "headline": "Senco Gold share price tumbles 32% in 2 sessions. Here's what brokerages saySenco Gold stock price: The sell-off started on February 14 after the company reported its quarterly numbers showing profits plunged 69.3% to Rs 33.48 crore compared to Rs 109.32 crore a year ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-markets-down-volatility-up-3-factors-making-dalal-street-investors-nervous-2681132-2025-02-17",
      "headline": "Markets down, volatility up: 3 factors making Dalal Street investors nervousThe NSE Nifty50 has stumbled, dropping 3.2% in just eight trading sessions and slipping below the psychologically important 23,000 mark. The Sensex tells a similar tale of woe, falling over 3% to fall below 76,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-to-issue-hike-letters-soon-salary-raise-likely-between-4-to-8-percent-report-2681124-2025-02-17",
      "headline": "TCS to issue hike letters soon; salary raise likely between 4-8%: ReportThe annual salary hikes at leading IT firms have gradually reduced over the years. In FY24, TCS employees received an average hike of 7-9%, while in FY22, the hikes were around 10.5%."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-4-first-look-benedict-sophies-love-story-takes-centre-stage-2681436-2025-02-17",
      "headline": "Bridgerton 4 first look: Benedict-Sophie's love story takes centre stageThe fourth season of Bridgerton is set to spotlight Benedict Bridgerton's romance with Sophie Baek. New characters like Katie Leung's Lady Araminta Gun will add intrigue to the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/legends-of-shiva-amish-tripathi-get-real-about-lord-shiva-in-discovery-show-2681343-2025-02-17",
      "headline": "Legends of Shiva: Amish Tripathi gets real about Lord Shiva in his latest showAuthor and producer Amish Tripathi returns as host of Legends of Shiva with Amish, a new show on Discovery Channel, exploring Lord Shiva beyond myths. Unveiled at the New Delhi Book Fair, it promises a deep dive into mythology coinciding with Maha Kumbh 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amortage-review-jisoos-album-shakes-things-up-like-an-earthquake-2681277-2025-02-17",
      "headline": "Amortage review: Jisoo's album shakes things up like an 'earthquake'Jisoo's new EP, Amortage, released on February 14, 2025, marks her evolution as a solo artist. The EP blends pop and R&B to explore love's many facets, featuring English tracks and her own songwriting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bhabiji-writer-manoj-santoshi-battles-cancer-shilpa-shinde-takes-care-of-him-2681295-2025-02-17",
      "headline": "Bhabiji writer Manoj Santoshi battles cancer, Shilpa Shinde takes care of himActor Kavita Kaushik made an emotional post on social media, highlighting screenwriter Manoj Santoshi's struggle with liver cancer. She also mentioned actor Shilpa Shinde and thanked her for taking care of him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-witch-review-park-jinyoung-roh-jeong-eui-shine-in-slow-burning-psychological-mystery-2681258-2025-02-17",
      "headline": "The Witch review: Jinyoung, Jeong-eui shine in slow-burning psychological mysteryReleased-Sat Feb 15, 2025The Witch review: The Witch, a new K-drama starring Jinyoung and Jeong-eui, captivates with its psychological mystery and slow-burning narrative. The series, based on a popular webtoon, blends mystery, romance, and suspense, leaving viewers intrigued by the enigmatic characters and their complex interactions, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rashami-desai-on-love-hate-bond-with-sidharth-shukla-we-would-communicate-through-eyes-2681270-2025-02-17",
      "headline": "Rashami Desai on love-hate bond with Sidharth Shukla: We'd communicate through eyesActor Rashami Desai, who had worked with the late Sidharth Shukla on 'Dil Se Dil Tak' and 'Bigg Boss 13', was reminded of her relationship with him on comedian Bharti Singh's podcast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/stray-kids-felix-arm-fracture-in-car-accident-misses-fan-meet-2681229-2025-02-17",
      "headline": "Stray Kids' Felix suffers fracture after car accident, misses group's fan meetFelix, a member of the boy band Stray Kids, suffered an arm fracture in a minor car accident, causing him to miss the band's fifth fan meeting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/south-korean-actor-kim-sae-ron-suicide-comeback-to-films-2681202-2025-02-17",
      "headline": "South Korean actor Kim Sae-ron wanted to make a comeback to films, open a cafeSouth Korean actor Kim Sae-ron, who was found dead in her apartment on Sunday, had wished to make a comeback to the entertainment world, revealed a friend recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gajraj-rao-renuka-shahane-dupahiya-prime-video-teaser-2681147-2025-02-17",
      "headline": "Gajraj Rao, Renuka Shahane's Dupahiya to bring laughter and chaos to Prime VideoPrime Video's Dupahiya is set in a crime-free village where the first-ever theft of a motorbike creates chaos and drama. Starring Gajraj Rao and Renuka Shahane, the comedy series starts streaming on March 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/south-korean-actor-kim-sae-ron-found-dead-at-24-2680949-2025-02-16",
      "headline": "South Korean actor Kim Sae-ron, 24, found deadSouth Korean actor Kim Sae-ron, known for her roles in Bloodhounds and The Man from Nowhere, was found dead at her home in Seoul. She was 24. Authorities are investigating the circumstances of her death, with no signs of foul play reported yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-3-review-lisa-parker-posey-and-jason-isaacs-show-is-predictable-but-entertaining-2680925-2025-02-16",
      "headline": "The White Lotus S3 review: Predictable? Yes. Addictive? Also, yesReleased-Mon Feb 17, 2025The White Lotus Season 3 review: The White Lotus returns with a new season set in Thailand, offering a fresh cultural backdrop while retaining its biting satire on the ultra-rich. The series continues to entertain with its dark humour and ensemble cast, though its formula is starting to feel familiar. Read our full review. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-says-he-fought-5-hours-for-grammy-tickets-amid-guest-list-confusion-2680934-2025-02-16",
      "headline": "Kanye West says he fought 5 hours for Grammy tickets amid guest list confusionRapper Kanye West, in a post on X, revealed that he fought for five hours to secure Grammy tickets amid guest list chaos. This comes amid claims that Kanye arrived at the event uninvited. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gyanesh-kumar-chief-election-commissioner-jammu-and-kashmir-rajiv-kumar-election-commission-2681543-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meet new poll body chief Gyanesh Kumar: Ex-bureaucrat, key player in J&K reformsGyanesh Kumar, a 1988-batch Kerala cadre IAS officer, was appointed India's 26th Chief Election Commissioner (CEC) and his term will run till January 26, 2029."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-plane-crash-delta-airlines-plane-crashes-at-airport-several-feared-injured-2681533-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'It's upside down': Plane flips on landing at Canada airport, 18 injuredA Delta Air Lines plane flipped upside down upon landing at Canada's Toronto Pearson Airport on Monday, injuring 18 of the 80 people on board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-quiet-struggle-of-growing-up-hindu-in-america-and-why-silence-is-no-longer-an-option-2681294-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The quiet struggle of growing up Hindu in US, and why silence is no more an optionHindus in the US have long been told we are \"the good immigrants\", but it is a double-edged sword. The people who praise us as hard-working immigrants turn on us when we become too successful. The time for quiet gratitude is over. We must own our identity, and speak out when we are misrepresented. Build political and institutional power. Make it clear that we are stakeholders in America's future, and aren't going anywhere."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-woman-found-dead-in-jhansi-4-year-old-daughter-accuses-father-of-hanging-her-2681537-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Papa killed mummy, hanged her': Testimony of girl, 4, sends UP cops on manhuntA 27-year-old woman was found dead under suspicious circumstances in Jhansi, with her family accusing her husband and in-laws of murder. The woman's 4-year-old daughter accused her father of killing her mother by hanging her. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/why-elon-musk-likes-genghis-khan-mongol-conqueror-who-fathered-hundreds-of-kids-mars-chengez-khan-2681411-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Elon Musk likes Genghis Khan, the conqueror who fathered hundreds of kidsTesla and SpaceX chief Elon Musk has always tried to conquer, be it the electric car industry or space, the final frontier. Musk has also fathered a number of children. His recent admission that he likes Genghis Khan shouldn't come as a surprise. The legendary Mongol was one of the biggest conquerors who fathered hundreds of kids, and is said to have his DNA in 16 million living descendants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-first-glimpse-of-indias-jersey-out-features-pakistan-name-2681449-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Champions Trophy: First glimpse of India's jersey out, features 'Pakistan' imprintThe Indian cricket team unveiled their new jersey for the ICC Champions Trophy 2025 which interestingly has the hosts' Pakistan name printed on it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nepal-student-suicide-in-odisha-pm-kp-oli-sends-2-officers-to-counsel-students-2681399-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Oli reacts to Nepal woman student's suicide in Odisha university amid outrageNepal Prime Minister KP Sharma Oli addressed the death of Nepali student Prakriti Lamsal in Odisha. The Nepali Embassy sent officials to counsel students, offering them the choice to stay in their hostel or return home.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-exclusive-himani-mor-marriage-love-story-2681441-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Neeraj recalls love story with Himani, says marriage was no surprise to familySpeaking to India Today, Neeraj Chopra opened up about his love story with wife Himani Mor. Neeraj tied the knot with Himani, a former tennis player, in an intimate ceremony in Shimla in January. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gaurav-kapoor-jokes-about-stand-up-comedy-ranveer-allaahbadia-apology-2681555-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ranveer Allahbadia would have said 'Simon, I'm coming with you': Comic on apologyComedian Gaurav Kapoor, cashing in on the controversy, joked about Ranveer Allahbadia in his recent stand-up comedy special. He said that Ranveer's apology came just two hours after the controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/high-level-of-faecal-bacteria-in-ganga-at-prayagraj-green-court-summons-officials-2681452-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "High level of faecal bacteria in Ganga at Prayagraj as millions take Kumbh dipThe National Green Tribunal (NGT) has raised concerns about rising faecal bacteria levels in the Ganga at Prayagraj, especially during the Maha Kumbh Mela. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ludhiana-police-cracks-murder-case-aap-leader-anokh-mittal-girlfriend-contract-killer-arrest-2681478-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Punjab woman's murder solved, AAP leader husband caught for hiring killersLudhiana Police arrested AAP leader Anokh Mittal and his girlfriend, accusing them of hiring contract killers to murder Mittal's wife. According to the police, the AAP leader agreed to pay Rs 2.5 lakh for the crime, with Rs 50,000 paid in advance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/manu-bhaker-bbc-sportswoman-of-the-year-paris-olympics-khel-ratna-2681548-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Manu Bhaker named BBC Sportswoman of the YearManu Bhaker, India's shooting sensation, won the BBC Indian Sportswoman of the Year after securing two historic bronze medals at the Paris Olympics, becoming the first Indian female shooter to achieve multiple Olympic podium finishes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/disease-is-not-a-joke-what-has-a-stand-up-comic-got-to-do-with-it-2681209-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Disease is not a joke, what's a stand-up comic got to do with it?Diseases are to be discussed at a symposium sponsored by big pharmaceutical companies where doctors fly in on tickets paid for by the big pharmaceutical companies. Is that Kashmiri comic a doctor, a pharmacist, or a journalist?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-political-crisis-sheikh-hasina-muhammad-yunus-government-student-protest-deaths-2681456-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I shall return, that's why Allah kept me alive: Sheikh Hasina attacks YunusSheikh Hasina criticised the Muhammad Yunus-led interim government, vowing to return and ensure justice for victims. She denied police involvement in protester deaths, asserting post-mortems would confirm her claims. Hasina also defended police actions during the unrest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-chief-minister-devendra-fadnavis-deputy-eknath-shinde-pending-worker-dues-special-cell-power-struggle-2681472-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Eknath Shinde asks Maharashtra industry department to settle pending worker duesAmid reports of a power struggle between Maharashtra Chief Minister Devendra Fadnavis and Deputy Chief Minister Eknath Shinde, the Shiv Sena leader directed the Industry Department to prioritise pending worker dues by setting up a special cell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-high-court-grants-government-extension-for-its-stand-on-plea-to-rename-india-as-bharat-2681535-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Government granted extension for its stand on plea to rename India as 'Bharat'The Delhi High Court has allowed the Centre's counsel more time to obtain instructions regarding a plea requesting the government to decide on a representation for amending the Constitution to replace the word India with 'Bharat' or 'Hindustan'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshaye-khanna-aurangzeb-chhaava-silent-and-sinister-2681292-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Silent and sinister: How Akshaye Khanna's Aurangzeb stole ChhaavaAkshaye Khanna delivers a chilling, restrained portrayal of Mughal emperor Aurangzeb in Chhaava, standing out amid past cinematic depictions. His silent menace contrasts Vicky Kaushal's fiery energy, proving that true power doesn't always need words—just presence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-records-higher-temperatures-than-delhi-met-dept-predicts-early-summer-2681361-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru to be hotter than Delhi this year: Weather bodyBengaluru is experiencing record-breaking heat, surpassing Delhi, with a high of 35.9 degree Celsius on February 17, 2025. Warmer days ahead, suggests IMD."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fans-gush-over-hrithik-roshans-son-hridhaan-call-him-indian-timothee-chalamet-2681500-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fans gush over Hrithik Roshan's son Hridhaan, call him 'Indian Timothee Chalamet'Hrithik Roshan's son, Hridhaan, has caught the internet's attention with his good looks. The young Roshan made headlines after appearing at the celebration of The Roshans documentary series."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/american-arrested-in-moscow-on-drug-charges-freed-ahead-of-us-russia-talks-glbs-2681528-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "American arrested in Moscow on drug charges freed ahead of US-Russia talksRussia has freed U.S. citizen Kalob Byers, arrested for alleged drug smuggling, just before key U.S.-Russia talks. His release follows a recent prisoner swap, signaling potential diplomatic thawing. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-andheri-station-passenger-fell-rescued-railway-cop-video-2681391-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Man falls into gap between train and platform, rescued by alert copA Railway Protection Force personnel saved a 40-year-old passenger who slipped while boarding a moving train at Andheri station. The dramatic rescue was captured on CCTV, showing the officer pulling the man to safety.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pcb-issues-clarification-on-indian-flag-controversy-in-karachi-2681329-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Champions Trophy: Pakistan clarify Indian flag controversy after backlashThe Pakistan Cricket Board (PCB) has issued a clarification after India flag wasn't hoisted along with other nations on the the roof of the National Stadium in Karachi ahead of the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/qatar-emir-pm-modi-delhi-airport-video-2681426-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Qatar Emir in India, PM Modi receives him at Delhi airport in rare gestureBoth the leaders shared hugs and were seen chuckling as they exchanged pleasantries at the airport. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-delhi-station-stampede-details-reasons-causes-announcement-maha-kumbh-prayagraj-platform-special-train-2681227-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Five red flags Railways missed just ahead of New Delhi stampedeThe stampede at New Delhi Railway Station on Saturday claimed 18 lives. The tragedy, which occurred hours after signs of overcrowding at the station, worsened due to confusing announcements, inadequate personnel, and delays in several eastbound trains on a few platforms on the Ajmeri Gate side. These were the five red flags, if noticed and acted upon, could have saved precious lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gaurav-kapoor-jokes-about-stand-up-comedy-ranveer-allaahbadia-apology-2681555-2025-02-18",
      "headline": "Ranveer Allahbadia would have said 'Simon, I'm coming with you': Comic on apologyComedian Gaurav Kapoor, cashing in on the controversy, joked about Ranveer Allahbadia in his recent stand-up comedy special. He said that Ranveer's apology came just two hours after the controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fans-gush-over-hrithik-roshans-son-hridhaan-call-him-indian-timothee-chalamet-2681500-2025-02-17",
      "headline": "Fans gush over Hrithik Roshan's son Hridhaan, call him 'Indian Timothee Chalamet'Hrithik Roshan's son, Hridhaan, has caught the internet's attention with his good looks. The young Roshan made headlines after appearing at the celebration of The Roshans documentary series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-reveals-akshay-kumar-rejected-kannappa-role-twice-before-accepting-2681477-2025-02-17",
      "headline": "Vishnu Manchu reveals Akshay Kumar rejected Kannappa role twice before acceptingVishnu Manchu shared the challenges and triumphs of casting Akshay Kumar in the mythological film Kannappa. Despite initial rejections, Kumar joined the cast of Vishnu Manchu's film, which also features Prabhas and \r\nMohanlal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dj-aqeel-whole-world-present-at-abhishek-bachchan-aishwarya-rai-sangeet-2681442-2025-02-17",
      "headline": "DJ Aqeel says 'whole world' was present at Abhishek-Aishwarya's sangeet partyDJ Aqeel shares experiences from performing at high-profile Bollywood weddings, highlighting the contrast between Saif-Kareena and Abhishek-Aishwarya's sangeet ceremonies."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-shubman-gill-india-vice-captain-mvp-opening-batter-2681554-2025-02-18",
      "headline": "Why vice-captain Shubman Gill will be India's MVP in Champions TrophyVice-captain Shubman Gill has stepped up in ODIs for India in a big way in the past few years and could prove to be India's MVP during the upcoming Champions Trophy in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/manu-bhaker-bbc-sportswoman-of-the-year-paris-olympics-khel-ratna-2681548-2025-02-18",
      "headline": "Manu Bhaker named BBC Sportswoman of the YearManu Bhaker, India's shooting sensation, won the BBC Indian Sportswoman of the Year after securing two historic bronze medals at the Paris Olympics, becoming the first Indian female shooter to achieve multiple Olympic podium finishes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-suresh-raina-reveals-indias-masterstroke-to-win-champions-trophy-2013-2681529-2025-02-18",
      "headline": "Raina reveals masterstroke which helped India win Champions Trophy 2013Former India cricketer Suresh Raina revealed India's masterstroke which helped them emerge victorious in the ICC Champions Trophy 2013 under the leadership of MS Dhoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-smriti-mandhana-danni-wyatt-hodge-wpl-2025-rcb-w-vs-dc-w-2681497-2025-02-17",
      "headline": "Captain, star batter, and now coach: Smriti Mandhana juggles roles in WPL 2025Royal Challengers Bengaluru women opener Danielle Wyatt Hodge credited her captain Smriti Mandhana for coaching her during their match winning century partnership against Delhi Capitals (DC-W) in Women's Premier League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-rajesh-kannur-indias-homeless-cricket-hero-interview-2681474-2025-02-17",
      "headline": "Rajesh Kannur: India's homeless cricket hero dreams of a better futureRajesh Kannur, who won the Player of the Tournament award after India's triumph in the Physical Disability Champions Trophy in Sri Lanka earlier this year, spoke to India Today, calling for support. The cricketer has battled against the odds to pursue his passion and dreams of building a home for his family in a better future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-rcb-vs-delhi-capitals-score-smriti-mandhana-points-table-2681459-2025-02-17",
      "headline": "Fiery Smriti Mandhana and bowlers help RCB hammer DC, top table earlyWPL 2025, RCB vs DC: Smriti Mandhana smashed a 47-ball 81 as Royal Challengers Bengaluru chased 142 in just 16.2 overs. With two wins in as many matches, RCB are on top of the points table early in the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-mohammad-nabi-odi-retirement-son-hassan-eisakhil-2681450-2025-02-17",
      "headline": "40-year-old Afghan star dreams of playing with son, hints at extending career Champions Trophy 2025: Mohammad Nabi, who had announced last year that he would retire from ODIs after the tournament, has now hinted at extending his 50-over career. Nabi revealed that his dream is to play for Afghanistan alongside his 18-year-old son, Hassan Eisakhil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-first-glimpse-of-indias-jersey-out-features-pakistan-name-2681449-2025-02-17",
      "headline": "Champions Trophy: First glimpse of India's jersey out, features 'Pakistan' imprintThe Indian cricket team unveiled their new jersey for the ICC Champions Trophy 2025 which interestingly has the hosts' Pakistan name printed on it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-exclusive-himani-mor-marriage-love-story-2681441-2025-02-17",
      "headline": "Neeraj recalls love story with Himani, says marriage was no surprise to familySpeaking to India Today, Neeraj Chopra opened up about his love story with wife Himani Mor. Neeraj tied the knot with Himani, a former tennis player, in an intimate ceremony in Shimla in January. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/video/neeraj-chopra-interview-marriage-himani-mor-90m-dream-arshad-nadeem-2681427-2025-02-17",
      "headline": "Neeraj Chopra Exclusive: Marriage, 90m dream and Arshad Nadeem rivalrySpeaking to India Today's Nikhil Naz, javelin star Neeraj Chopra opened up about his marriage, the 90m dream and his growing rivalry with Arshad Nadeem. Neeraj also spoke about the partnership with his new coach Jan Zelezny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pcb-chief-mohsin-naqvi-sells-vip-tickets-for-pcb-funds-ind-vs-pak-2681417-2025-02-17",
      "headline": "Champions Trophy: Pakistan cricket chief sells Rs 94 lakh VIP tickets for PCB fundsPakistan Cricket Board (PCB) Chairman Mohsin Naqvi has sold his hospitality box at Dubai International Cricket Stadium to collect money for the board's funds. He will be watching the India vs Pakistan game from normal stands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-mohammad-nabi-odi-retirement-son-hassan-eisakhil-2681450-2025-02-17",
      "headline": "40-year-old Afghan star dreams of playing with son, hints at extending career Champions Trophy 2025: Mohammad Nabi, who had announced last year that he would retire from ODIs after the tournament, has now hinted at extending his 50-over career. Nabi revealed that his dream is to play for Afghanistan alongside his 18-year-old son, Hassan Eisakhil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-first-glimpse-of-indias-jersey-out-features-pakistan-name-2681449-2025-02-17",
      "headline": "Champions Trophy: First glimpse of India's jersey out, features 'Pakistan' imprintThe Indian cricket team unveiled their new jersey for the ICC Champions Trophy 2025 which interestingly has the hosts' Pakistan name printed on it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-exclusive-himani-mor-marriage-love-story-2681441-2025-02-17",
      "headline": "Neeraj recalls love story with Himani, says marriage was no surprise to familySpeaking to India Today, Neeraj Chopra opened up about his love story with wife Himani Mor. Neeraj tied the knot with Himani, a former tennis player, in an intimate ceremony in Shimla in January. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/video/neeraj-chopra-interview-marriage-himani-mor-90m-dream-arshad-nadeem-2681427-2025-02-17",
      "headline": "Neeraj Chopra Exclusive: Marriage, 90m dream and Arshad Nadeem rivalrySpeaking to India Today's Nikhil Naz, javelin star Neeraj Chopra opened up about his marriage, the 90m dream and his growing rivalry with Arshad Nadeem. Neeraj also spoke about the partnership with his new coach Jan Zelezny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pcb-chief-mohsin-naqvi-sells-vip-tickets-for-pcb-funds-ind-vs-pak-2681417-2025-02-17",
      "headline": "Champions Trophy: Pakistan cricket chief sells Rs 94 lakh VIP tickets for PCB fundsPakistan Cricket Board (PCB) Chairman Mohsin Naqvi has sold his hospitality box at Dubai International Cricket Stadium to collect money for the board's funds. He will be watching the India vs Pakistan game from normal stands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-rcb-vs-dc-niki-prasad-dropped-five-overseas-players-delhi-2681407-2025-02-17",
      "headline": "'No surprise' as Delhi drop U19 captain Niki Prasad, field 5 overseas playersWPL 2025, RCB vs DC: Delhi Capitals dropped India U19 World Cup-winning captain Niki Prasad for the second game of the tournament. Nikki won the Player of the Match award in her WPL debut against Mumbai Indians on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kane-williamson-to-make-his-debut-in-the-hundred-for-london-spirit-2681397-2025-02-17",
      "headline": "Kane Williamson to make his debut in The Hundred, set to lead London SpiritStar New Zealand batter Kane Williamson is all set to make his debut in the Hundred as he will be seen leading London Spirit in the upcoming season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-bangladesh-shakib-al-hasan-shanto-mahmudullah-2681190-2025-02-17",
      "headline": "Spirited Bangladesh face uphill task without Shakib Al HasanChampions Trophy 2025: Bangladesh are without their premier all-rounder Shakib Al Hasan, but skipper Najmul Hossain Shanto said that the Tigers would be playing with the goal of winning the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-way-better-than-virat-kohli-and-babar-abdur-rauf-khan-2681355-2025-02-17",
      "headline": "Rohit Sharma is way better than Virat Kohli and Babar: Former Pakistan bowlerFormer Pakistan bowler Abdur Rauf Khan has called India captain Rohit Sharma way better player than his teammate Virat Kohli and Pakistan star Babar Azam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pcb-issues-clarification-on-indian-flag-controversy-in-karachi-2681329-2025-02-17",
      "headline": "Champions Trophy: Pakistan clarify Indian flag controversy after backlashThe Pakistan Cricket Board (PCB) has issued a clarification after India flag wasn't hoisted along with other nations on the the roof of the National Stadium in Karachi ahead of the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-australian-arrive-in-pakistan-searching-for-1st-win-since-2009-2681299-2025-02-17",
      "headline": "Australia arrive in Pakistan searching for 1st win in Champions Trophy since 2009The Australian Cricket team landed in Pakistan for the upcoming ICC Champions Trophy 2025. They will begin their campaign on February 22 in England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mohammad-yousuf-pakistan-team-champions-trophy-2025-pcb-2681259-2025-02-17",
      "headline": "Hope Pakistan team would do justice to PCB's renovation work: Mohammad YousufFormer Pakistan cricketer Mohammad Yousuf hopes that the Pakistan cricket team will do justice to the work done by their national board to host Champions Trophy with their performances on the field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-way-better-than-virat-kohli-and-babar-abdur-rauf-khan-2681355-2025-02-17",
      "headline": "Rohit Sharma is way better than Virat Kohli and Babar: Former Pakistan bowlerFormer Pakistan bowler Abdur Rauf Khan has called India captain Rohit Sharma way better player than his teammate Virat Kohli and Pakistan star Babar Azam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pcb-issues-clarification-on-indian-flag-controversy-in-karachi-2681329-2025-02-17",
      "headline": "Champions Trophy: Pakistan clarify Indian flag controversy after backlashThe Pakistan Cricket Board (PCB) has issued a clarification after India flag wasn't hoisted along with other nations on the the roof of the National Stadium in Karachi ahead of the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-australian-arrive-in-pakistan-searching-for-1st-win-since-2009-2681299-2025-02-17",
      "headline": "Australia arrive in Pakistan searching for 1st win in Champions Trophy since 2009The Australian Cricket team landed in Pakistan for the upcoming ICC Champions Trophy 2025. They will begin their campaign on February 22 in England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mohammad-yousuf-pakistan-team-champions-trophy-2025-pcb-2681259-2025-02-17",
      "headline": "Hope Pakistan team would do justice to PCB's renovation work: Mohammad YousufFormer Pakistan cricketer Mohammad Yousuf hopes that the Pakistan cricket team will do justice to the work done by their national board to host Champions Trophy with their performances on the field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-host-icc-major-tournament-hype-infrastructure-security-2681250-2025-02-17",
      "headline": "Bad dream to new dawn: Pakistan ready to welcome major ICC event after 3 decadesChampions Trophy 2025: Pakistan is set to host a major cricket tournament after nearly three decades, marking a significant comeback for international cricket in the country. Despite India opting to play in Dubai, excitement is high, with Pakistan hoping to host a successful tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-sri-lanka-sophie-devine-2681246-2025-02-17",
      "headline": "After missing WPL, star RCB all-rounder skips Sri Lanka series WPL 2025: Sophie Devine has pulled out of New Zealand's limited-overs series against Sri Lanka. Devine, earlier, opted out of the Women's Premier League (WPL) where she represents Royal Challengers Bengaluru (RCB). \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-indian-flag-missing-national-stadium-karachi-viral-video-2681220-2025-02-17",
      "headline": "Indian flag missing from Karachi stadium before Champions Trophy, video goes viralIn a video that has gone viral on social media, the Indian flag was reportedly missing at the National stadium in Karachi ahead of the Champions Trophy 2025. At ICC events, it is common practice to have flags of all the participating nations displayed at each venue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-india-bangladesh-kayes-2681217-2025-02-17",
      "headline": "Jasprit Bumrah's absence gives Bangladesh a chance vs India: Imrul KayesChampions Trophy: Imrul Kayes said that Jasprit Bumrah's absence will give Bangladesh a decent chance in their match against India on February 20 at the Dubai International Cricket Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-jasprit-bumrah-absence-indian-team-laxmipathy-balaji-2681188-2025-02-17",
      "headline": "Mohammed Shami can carry India's attack in Bumrah's absence: Laxmipathy BalajiChampions Trophy 2025: Former pacer Laxmipathy Balaji feels that Mohammed Shami could be the leader of the Indian bowling attack during Jasprit Bumrah's absence at the Champions Trophy. Shami made his return to international cricket during the England T20I series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-mumbai-indians-jasprit-bumrah-hardik-pandya-nita-ambani-2681169-2025-02-17",
      "headline": "No money, Pandya brothers said they had Maggi for 3 years: Nita Ambani on MI findIPL 2025: Mumbai Indians owner Nita Ambani revealed how the franchise were able to land the Pandya brothers and Jasprit Bumrah and make them a vital part of the Indian cricket team. Bumrah and the Pandya brothers won multiple titles with MI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-chris-gayle-record-2681157-2025-02-17",
      "headline": "Virat Kohli eyes Universe Boss Chris Gayle's historic record Champions Trophy 2025: Virat Kohli has the chance of becoming the leading run-scorer in the tournament, going past the legendary Chris Gayle, who scored 791 runs from 17 matches. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ajinkya-rahane-indian-test-team-return-mumbai-ranji-trophy-2681135-2025-02-17",
      "headline": "My PR is my cricket: Ajinkya Rahane targets return to Indian Test teamRanji Trophy 2024-25: Ajinkya Rahane is aiming for a comeback into the Indian Test team as he feels there is cricket left in him. Rahane last played for India in Tests during the West Indies tour in 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mathh-kuhnemann-bowling-jasprit-bumrah-tim-paine-icc-2681107-2025-02-17",
      "headline": "Not dissimilar to Jasprit Bumrah: Ex-captain defends Aussie spinner's bowling actionFormer Australia captain Tim Paine jumped to the defence of Matt Kuhnemann, claiming that the spinner has a similar action to that of Jasprit Bumrah. Kuhnemann was reported for suspect action after the Sri Lanka Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-bangladesh-shakib-mahmudullah-2681106-2025-02-17",
      "headline": "When Shakib Al Hasan, Mahmudullah's heroics shocked New ZealandChampions Trophy: Back in 2017, Bangladesh recorded a famous win against New Zealand after Shakib Al Hasan and Mahmudullah's heroic 224-run partnership at the Sophia Gardens in Cardiff. Shakib and Mahmudullah's twin centuries helped the Tigers chase down 266 with 16 balls to spare. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-indian-cricket-team-michael-clarke-prediction-2681088-2025-02-17",
      "headline": "India to win Champions Trophy, Rohit Sharma highest run-getter: Michael ClarkeChampions Trophy 2025: Former Australia captain Michael Clarke feels that Rohit Sharma will be the highest run-getter in this year's Champions Trophy. Clarke also feels India will win the tournament once again with Rohit leading from the front. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-dinesh-karthik-sa20-bcci-t20s-2681071-2025-02-17",
      "headline": "Indians should be allowed to play overseas leagues only after retiring: KarthikFormer Indian wicketkeeper Dinesh Karthik said that the IPL is the 'crown jewel' of Indian cricket and the BCCI was right to bar its men's cricketers from taking part in overseas T20 leagues. \r\n\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}