{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/2025-tech-layoffs-amazon-microsoft-google-fuel-job-fears-amid-ai-push-2757700-2025-07-18",
      "headline": "2025 tech layoffs: Amazon, Microsoft, Google fuel job fears amid AI pushThe year 2025 was supposed to be a new chapter. A time when artificial intelligence promised smarter work, faster growth, and a better future. But for tens of thousands of workers across the world, it has meant sleepless nights, and uncertain futures. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/axis-bank-share-price-down-7-percent-why-sell-hold-stock-q1-results-banking-2757697-2025-07-18",
      "headline": "Axis Bank shares tank 7% today. Should you sell or hold the stock?Axis Bank shares: The stock has been on a downward trend in recent times. It has fallen 5.77% in the last five days, 9.14% in the past one month, and 15.27% over the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-retail-acquires-kelvinator-to-expand-appliance-business-2757690-2025-07-18",
      "headline": "Reliance Retail acquires Kelvinator to expand appliance businessReliance believes this move will help it grow faster in the consumer durables sector, connect more closely with customers, and open up bigger long-term opportunities in India's changing market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/wipro-share-price-4-percent-rise-q1-results-revenue-guideline-2757688-2025-07-18",
      "headline": "Explained: Why Wipro shares gained as much as 4% todayThe fourth-largest IT services company in India posted an 11% jump in net profit and a 0.8% rise in revenue—both slightly ahead of market expectations, according to estimates compiled by LSEG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-fd-or-mf-edelweiss-radhika-gupta-shares-3-golden-rules-before-you-invest-2757663-2025-07-18",
      "headline": "Stocks, FD or MF? Edelweiss' Radhika Gupta shares 3 golden rules before you investBefore you begin investing, know how saving and investing are different. Saving keeps your money handy for emergencies or short-term plans, while investing helps it grow for bigger future goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-nifty-axis-bank-results-weak-banking-shares-falls-2757662-2025-07-18",
      "headline": "Sensex tumbles over 600 points: Why is stock market falling today?The 30-share BSE Sensex tumbled 644.99 points to 81,614.25 around 12:19 pm, while the NSE Nifty 50 fell 191.30 points to 24,920.15. Losses were broad-based, with most of the major sectoral indices in the red. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-2-online-filing-live-are-you-eligible-and-what-has-changed-income-tax-2757598-2025-07-18",
      "headline": "ITR-2 online filing live: Know who can file, new changes and other detailsThis year, the ITR-2 form has a few important changes that every taxpayer should know. You now have to report your long-term capital gains separately for periods before and after July 23, 2024, as new indexation and tax rules apply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-ulips-financial-product-mis-sold-banks-insurance-companies-part-1-2757581-2025-07-18",
      "headline": "The ULIP trap: Inside India's most mis-sold financial productPart one of our story explores why ULIPs remain among the most mis-sold financial products in India. Sold as all-in-one solutions, they often fail to deliver on either insurance or investment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/who-is-andy-byron-astronomer-ceo-cheating-wife-megan-kerrigan-hr-kristin-cabot-2757559-2025-07-18",
      "headline": "Who is Astronomer CEO Andy Byron, caught on Coldplay's kiss camAndy Byron, the CEO of data-driven startup Astronomer was caught on the Coldplay concert's kiss cam with a colleague, and the clip has went viral online."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/travel-insurance-scam-entrepreneur-startup-founder-experience-flight-delay-linkedin-post-2757539-2025-07-18",
      "headline": "Startup founder calls flight travel insurance a scam, shares experienceWhat should have been a straightforward process turned into a weeks-long battle across multiple platforms and customer service calls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-100-points-lower-nifty-below-25100-wipro-jumps-3-2757536-2025-07-18",
      "headline": "Sensex opens 100 points lower, Nifty below 25,100; Wipro jumps 3%The S&P BSE Sensex lost 199 points to 82,060.24, while the NSE Nifty50 was down by 40.50 points to 25,070.95, as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-july-18-opening-sensex-nifty-today-wall-street-record-high-us-stock-market-bse-nse-trading-setup-2757520-2025-07-18",
      "headline": "Will Sensex, Nifty rally today after Wall Street closed at a record high?The US market closed at a record high as fresh data from the United States eased concerns about an economic slowdown in the world's largest economy."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/karan-tacker-special-ops-season-2-tanvi-the-great-dual-release-2757707-2025-07-18",
      "headline": "Karan Tacker on Special Ops 2, Tanvi releasing togetherKaran Tacker celebrates a milestone with two simultaneous releases today. His roles in 'Special Ops 2' and 'Tanvi The Great' show his versatility, while he shares his feelings about this unique career moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ravi-dubey-picture-ramayana-director-nitesh-tiwari-ranbir-kapoor-legends-2757730-2025-07-18",
      "headline": "Ram-Lakshman in one frame: Ravi Dubey, Ranbir Kapoor join Nitesh Tiwari for a momentRavi Dubey is living his best life as he gears up to play Lakshman in Nitesh Tiwari's 'Ramayana'. On Friday, he shared a photo with the director and his on-screen brother, Ranbir Kapoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jennifer-lopez-is-done-with-marriage-after-split-with-ben-affleck-2757696-2025-07-18",
      "headline": "Jennifer Lopez is done with marriage after split with Ben AffleckJennifer Lopez hinted she may be done with marriage after multiple attempts, including her recent divorce from Ben Affleck. Her response to a fan's proposal has sparked widespread discussion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-opens-up-on-how-his-fathers-cancer-battle-united-the-family-2757691-2025-07-18",
      "headline": "Nick Jonas opens up on how his father's cancer battle united the familySinger and actor Nick Jonas shared how his father's cancer battle in 2017 brought the Jonas family closer and made them stronger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/i-know-what-you-did-last-summer-review-2025-reboot-gen-z-horror-2757657-2025-07-18",
      "headline": "I Know What You Did Last Summer review: Gen Z-fication of slasher film is oddly funnyRelease Date:Fri Jul 18, 2025I Know What You Did Last Summer movie review: The 2025 reboot of 'I Know What You Did Last Summer' brings a Gen Z twist to the classic slasher. It mixes nostalgia with campy humour but falls short of being a genre-defining hit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vir-das-fool-volume-review-netflix-experimental-comedy-2757596-2025-07-18",
      "headline": "Vir Das Fool Volume review: Most experimental special yetRelease Date:Fri Jul 18, 2025Vir Das Fool Volume review: Vir Das returns with 'Fool Volume', his most experimental special yet, streaming on Netflix. The show blends diverse venues and tones, highlighting his mature comedic style and global outlook, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kill-bill-actor-michael-madsen-death-linked-to-multiple-health-issues-alcoholism-2757658-2025-07-18",
      "headline": "Kill Bill actor Michael Madsen's death linked to multiple health issues, alcoholismVeteran actor Michael Madsen died due to complications from cardiac arrest and chronic health issues. The latest reports revealed additional contributing factors, including coronary artery disease and chronic alcoholism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chris-hemsworth-drums-live-with-ed-sheeran-in-bucharest-for-new-docuseries-limitless-2757609-2025-07-18",
      "headline": "Chris Hemsworth drums live with Ed Sheeran in Bucharest for new docuseries LimitlessChris Hemsworth took an unexpected leap from acting to drumming as he joined Ed Sheeran on stage before 70,000 fans in Bucharest. The clip resurfaced after the trailer for the docuseries 'Limitless: Live Better Now' released on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anand-l-rai-opposes-ai-generated-raanjhanaa-re-release-unhappy-with-altered-climax-2757583-2025-07-18",
      "headline": "Aanand L Rai slams re-release of Raanjhanaa with AI-powered climaxDirector Aanand L Rai has strongly opposed the AI-generated happy ending in the re-release of 'Raanjhanaa'. He stated that he was not informed or consulted by Eros International."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ssmb-29-story-leaked-tanzania-shooting-mahesh-babu-priyanka-chopra-rajamouli-telugu-cinema-2757549-2025-07-18",
      "headline": "Mahesh Babu, Priyanka Chopra's SSMB 29 based on African classics: ReportsDirector SS Rajamouli is about to begin shooting for a new schedule of his upcoming film, tentatively titled - 'SSMB 29' in Tanzania's Serengeti. The action-adventure features Mahesh Babu and Priyanka Chopra in the lead roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-gives-her-greece-vacation-lungi-dance-twist-2757556-2025-07-18",
      "headline": "Kareena Kapoor gives her Greece vacation a lungi dance twist. PicsKareena Kapoor Khan is enjoying a sunny vacation in Greece with her family. She shared a fun 'lungi dance' post, giving a playful nod to Shah Rukh Khan's popular song."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-martin-teases-couple-after-coldplay-outs-ceo-affair-2757545-2025-07-18",
      "headline": "Are you legitimate: Chris Martin teases couple after Coldplay outs CEO's affairChris Martin jokingly asked another couple in the crowd if they were 'legitimate' after teasing a pair he suspected might be having an affair. The witty moment went viral, with fans loving his playful humour on stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra43-birthday-with-fun-beach-vacation-with-family-2757519-2025-07-18",
      "headline": "Priyanka Chopra steps into 43 with fun beach vacation with family. Watch videoPriyanka Chopra Jonas celebrated her 43rd birthday with a beach holiday along with Nick Jonas, daughter Malti and her family. She shared a sweet video on Instagram showing happy family moments from the trip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/tanvi-the-great-review-anupam-kher-soulful-acting-shubhangi-dutt-debut-soulful-bad-execution-2757301-2025-07-18",
      "headline": "Tanvi The Great review: Soulful acting bogged down by uneven pacing, flat executionRelease Date:Fri Jul 18, 2025Tanvi The Great Review: 'Tanvi: The Great' marks the acting debut of Shubhangi Dutt. Despite its ambitious emotional arc, the Anupam Kher-directorial drifts from its promising premise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/special-ops-2-review-ai-driven-cyber-warfare-espionage-himmat-singh-kay-kay-menon-2757428-2025-07-18",
      "headline": "Special Ops 2 review: Kay Kay Menon anchors ambitious but uneven spy thrillerRelease Date:Fri Jul 18, 2025Special Ops 2 series review: The second season of 'Special Ops' delves into AI-driven cyber warfare intertwined with classic spy drama. The season raises questions about technology's role in future conflicts and personal sacrifices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/velu-prabhakaran-tamil-director-cinematographer-dies-at-68-in-chennai-2757505-2025-07-18",
      "headline": "Veteran Tamil director-cinematographer Velu Prabhakaran dies at 68 in ChennaiPopular Tamil director and cinematographer Velu Prabhakaran died on Friday morning at a private hospital in Chennai. According to reports, he died due to prolonged illness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/munawar-faruqui-learnt-timeliness-from-kangana-ranaut-being-late-from-salman-khan-2757385-2025-07-17",
      "headline": "Munawar Faruqui learnt timeliness from Kangana Ranaut, being late from Salman KhanDuring a press conference on Thursday, actor-comedian Munawar Faruqui spoke about his upcoming reality show 'The Society'. He also shared what he learned from actors Kangana Ranaut and Salman Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalaivan-thalaivii-trailer-romance-meets-chaos-in-vijay-sethupathi-nithya-menen-2757369-2025-07-17",
      "headline": "Thalaivan Thalaivii trailer: Romance meets chaos in Vijay Sethupathi, Nithya's filmThe trailer for 'Thalaivan Thalaivii' featuring Vijay Sethupathi and Nithya Menen has been released, showcasing a unique love story. Anticipation builds as the film is set to release on July 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-martin-exposes-office-romance-at-coldplay-us-concert-leaves-couple-mortified-2757356-2025-07-17",
      "headline": "Chris Martin exposes Astronomer CEO's 'affair' on kiss cam at Coldplay concertColdplay's frontman Chris Martin unintentionally exposed Astronomer CEO Andy Byron's affair during a concert in Boston, leading to a viral moment filled with humour and audience laughter. This incident happened amid the band's record-breaking Music of the Spheres World Tour, which continues to draw huge crowds across the US and beyond."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chaitanya-baghel-son-of-ex-chhattisgarh-chief-minister-bhupesh-baghel-arrested-by-ed-in-liquor-scam-2757681-2025-07-18",
      "headline": "Bhupesh Baghel's son arrested on his birthday by ED in liquor 'scam'Chaitanya Baghel, son of Congress leader and former Chhattisgarh Chief Minister Bhupesh Baghel, bas been arrested by ED in connection with a money laundering case related to an alleged liquor scam. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/houses-built-in-bihar-under-pm-scheme-more-than-population-of-norway-new-zealand-singapore-pm-modi-2757699-2025-07-18",
      "headline": "Usurped land of poor before giving jobs: PM Modi's all-out attack on Lalu YadavSpeaking in Motihari, his sixth visit to poll-bound Bihar this year, PM Modi focused on the development plank while targeting the RJD and the Congress for 'looting the poor'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-student-self-immolation-letter-principal-suspension-friend-blames-bjd-congress-2757672-2025-07-18",
      "headline": "Letter seeking Odisha victim's suspension emerges, friend says bid to silenceThe letter, accessed by India Today, was written on July 1 by a group of 71 students. The fresh revelations hint at a coordinated attempt to shield the accused professor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/patna-hospital-firing-gangster-chandan-mishras-killers-knew-paras-hospital-layout-faulty-lock-helped-2757540-2025-07-18",
      "headline": "Last-minute huddle, man on watch, faulty lock: How Patna hospital murder unfoldedA six-member gang that killed murder convict Chandan Mishra inside a Patna hospital had mapped entry points, exploited a faulty door lock, and evaded security checks before shooting him dead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vir-das-fool-volume-review-netflix-experimental-comedy-2757596-2025-07-18",
      "headline": "Vir Das Fool Volume review: Most experimental special yetRelease Date:Fri Jul 18, 2025Vir Das Fool Volume review: Vir Das returns with 'Fool Volume', his most experimental special yet, streaming on Netflix. The show blends diverse venues and tones, highlighting his mature comedic style and global outlook, says our review. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/woman-two-friends-allege-assault-using-knuckleduster-by-bouncers-at-bengaluru-bar-on-brigade-road-2757687-2025-07-18",
      "headline": "Hit with knuckleduster: Woman, friends allege assault by bouncers at Bengaluru barA 21-year-old woman has alleged that she and her two male friends were physically assaulted by bouncers during a visit to a popular resto-bar on Brigade Road in central Bengaluru. The bouncers were arrested and later released on bail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-ulips-financial-product-mis-sold-banks-insurance-companies-part-1-2757581-2025-07-18",
      "headline": "The ULIP trap: Inside India's most mis-sold financial productPart one of our story explores why ULIPs remain among the most mis-sold financial products in India. Sold as all-in-one solutions, they often fail to deliver on either insurance or investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-air-india-can-give-its-revival-plan-wing-2757247-2025-07-17",
      "headline": "How Air India can give its revival plan wingThe Ahmedabad crash has cast a long shadow over the airline, exposing cracks in safety, staffing and systems and posing the challenge of rebuilding trust\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/astronomer-ceo-wife-megan-kerrigan-drop-his-surname-byron-deactivate-facebook-account-2757618-2025-07-18",
      "headline": "Did Astronomer CEO's wife drop his surname before deactivating her Facebook account?Social media users claim Megan deleted \"Byron\" from her name before deactivating her account altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/mangaluru-conman-rohan-saldanha-held-after-rs-500-crore-fraud-secret-mansion-with-chambers-found-2757627-2025-07-18",
      "headline": "Mangaluru conman arrested in Rs 500 crore loan scam, mansion hid secret chambersMangaluru Police arrested Rohan Saldanha, accused of defrauding crores through fake loan schemes. His mansion, filled with secret rooms and luxury items, exposed the scale of his Rs 500 crore operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-welcomes-uss-terror-tag-for-pak-group-behind-pahalgam-attack-2757529-2025-07-18",
      "headline": "India welcomes US's terror tag for Pak group behind Pahalgam attackNew Delhi said that Washington's decision to designate the Pakistan-based group behind the April 22 Pahalgam attack as a foreign terrorist outfit was a strong affirmation of India-US counter-terrorism cooperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/special-ops-2-review-ai-driven-cyber-warfare-espionage-himmat-singh-kay-kay-menon-2757428-2025-07-18",
      "headline": "Special Ops 2 review: Kay Kay Menon anchors ambitious but uneven spy thrillerRelease Date:Fri Jul 18, 2025Special Ops 2 series review: The second season of 'Special Ops' delves into AI-driven cyber warfare intertwined with classic spy drama. The season raises questions about technology's role in future conflicts and personal sacrifices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-on-robert-vadra-ed-chargesheet-money-laundering-congress-priyanka-gandhi-2757586-2025-07-18",
      "headline": "Hounded for 10 years: Rahul Gandhi backs Robert Vadra amid ED crackdownThe Enforcement Directorate has filed its first chargesheet naming Robert Vadra in a money laundering case linked to a Gurugram land deal, drawing sharp accusations of a \"witch hunt\" from Congress. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/i-know-what-you-did-last-summer-review-2025-reboot-gen-z-horror-2757657-2025-07-18",
      "headline": "I Know What You Did Last Summer review: Gen Z-fication of slasher film is oddly funnyRelease Date:Fri Jul 18, 2025I Know What You Did Last Summer movie review: The 2025 reboot of 'I Know What You Did Last Summer' brings a Gen Z twist to the classic slasher. It mixes nostalgia with campy humour but falls short of being a genre-defining hit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/pm-modi-bihar-visit-tejashwi-yadav-mutton-party-sawan-rjd-lalu-nitish-kumar-elections-2757577-2025-07-18",
      "headline": "Tejashwi's 'mutton party' dig at PM Modi as he visits Bihar: He's coming againTejashwi Yadav posted a sarcastic itinerary for PM Modi's Bihar visit, accusing him of honouring leaders who host mutton feasts during Sawan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/indian-railways-passenger-beaten-up-after-complaining-about-caterer-viral-video-2757673-2025-07-18",
      "headline": "Indian Railways passenger beaten up after complaining about caterer. Video goes viralA now-viral video shows a passenger being assaulted onboard a train after complaining about a caterer overcharging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ola-uber-rapido-taxi-strike-fare-demand-maharashtra-mumbai-nagpur-azad-maidan-rally-pune-nagpur-2757575-2025-07-18",
      "headline": "Uber, Ola to remain off Mumbai streets as massive Azad Maidan rally planned todayDivers of app-based cab services are set to gather at Azad Maidan in south Mumbai on Friday, as drivers demand fare rationalisation to bring app-based rates in line with traditional black-and-yellow taxis, among other issues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/who-is-andy-byron-astronomer-ceo-cheating-wife-megan-kerrigan-hr-kristin-cabot-2757559-2025-07-18",
      "headline": "Who is Astronomer CEO Andy Byron, caught on Coldplay's kiss camAndy Byron, the CEO of data-driven startup Astronomer was caught on the Coldplay concert's kiss cam with a colleague, and the clip has went viral online."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/narmada-hen-controversy-madhya-pradesh-jabalour-2757554-2025-07-18",
      "headline": "Madhya Pradesh: Hen named 'Narmada' in college advertisement, sparks controversyA complaint has been made to the collector and a demand has been made to change the name of the hen. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/rock-that-fell-on-earth-from-mars-sells-for-53-million-in-sothebys-auction-2757590-2025-07-18",
      "headline": "Rock that fell on Earth from Mars sells for $5.3 million in auctionA spirited 15-minute bidding war between online and phone participants ultimately landed the ultra-rare specimen with an anonymous buyer, far surpassing its initial estimate of $2-4 million.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/astronomer-reacts-ceo-andy-byron-apology-letter-fake-affair-video-kristin-cabot-coldplay-concert-2757606-2025-07-18",
      "headline": "Astronomer reacts as CEO Andy Byron's 'apology letter' over 'affair' video goes viralThe fabricated statement, styled like an official press release dated July 17, 2025, began making the rounds on X hours after Andy Byron and his firm's head of HR, Kristin Cabot, were caught sharing an intimate moment at Coldplay's Boston concert at Gillette Stadium.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/more-than-one-in-four-couples-in-india-are-overweight-or-obese-icmr-study-2757670-2025-07-18",
      "headline": "More than one in four couples in India are overweight or obese: ICMR studyA recent ICMR study reveals rising obesity levels among married couples in India. The findings highlight how shared habits and socioeconomic status contribute to this growing health concern."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bomb-threats-delhi-bengaluru-schools-police-investigation-threat-message-2757614-2025-07-18",
      "headline": "Over 80 Delhi, Bengaluru schools get bomb threats: What's the law to deal with itMultiple schools in Delhi have been targeted with bomb threats, prompting immediate police action. The incidents highlight the legal framework and response measures in place to address such threats, impacting school operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ravi-dubey-picture-ramayana-director-nitesh-tiwari-ranbir-kapoor-legends-2757730-2025-07-18",
      "headline": "Ram-Lakshman in one frame: Ravi Dubey, Ranbir Kapoor join Nitesh Tiwari for a momentRavi Dubey is living his best life as he gears up to play Lakshman in Nitesh Tiwari's 'Ramayana'. On Friday, he shared a photo with the director and his on-screen brother, Ranbir Kapoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-opens-up-on-how-his-fathers-cancer-battle-united-the-family-2757691-2025-07-18",
      "headline": "Nick Jonas opens up on how his father's cancer battle united the familySinger and actor Nick Jonas shared how his father's cancer battle in 2017 brought the Jonas family closer and made them stronger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/i-know-what-you-did-last-summer-review-2025-reboot-gen-z-horror-2757657-2025-07-18",
      "headline": "I Know What You Did Last Summer review: Gen Z-fication of slasher film is oddly funnyRelease Date:Fri Jul 18, 2025I Know What You Did Last Summer movie review: The 2025 reboot of 'I Know What You Did Last Summer' brings a Gen Z twist to the classic slasher. It mixes nostalgia with campy humour but falls short of being a genre-defining hit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kill-bill-actor-michael-madsen-death-linked-to-multiple-health-issues-alcoholism-2757658-2025-07-18",
      "headline": "Kill Bill actor Michael Madsen's death linked to multiple health issues, alcoholismVeteran actor Michael Madsen died due to complications from cardiac arrest and chronic health issues. The latest reports revealed additional contributing factors, including coronary artery disease and chronic alcoholism."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-dukes-ball-review-controversy-lords-test-edgbaston-gill-2757701-2025-07-18",
      "headline": "ENG vs IND: Manufacturer to review Dukes ball after rising quality concernsENG vs IND: The Dukes' ball manufacturers have confirmed that they will have a look at the match balls from the first three Tests to identify why the ball has been getting softer fairly quickly in the ongoing series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bevon-jacobs-relishes-dream-debut-for-new-zealand-on-south-africa-return-2757680-2025-07-18",
      "headline": "Bevon Jacobs relishes dream debut for New Zealand on South Africa returnBevon Jacobs relished a dream debut for New Zealand in the country of his birth, South Africa, as they defeated the Proteas in the opening game of the T20 Tri-Series in Harare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-batting-form-affected-by-heated-exchange-zak-crawley-lords-test-2757628-2025-07-18",
      "headline": "Manjrekar questions Shubman Gill's sledging battle after Lord's lossSanjay Manjrekar has suggested that Shubman Gill's fiery on-field spat with Zak Crawley during the Lord's Test may have thrown the young Indian skipper off his game and affected his performance with the bat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-in-limbo-vision-2047-aiff-fsdl-2757613-2025-07-18",
      "headline": "India's Vision 2047 can wait as football's leaky boat needs fixing firstIndia's Vision 2047 wants to take football to the stars — but right now, the engine's sputtering. With ISL stalled and the national team coachless, Indian football needs repair, not just ambition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-must-curb-aggressive-instinct-dilip-vengsarkar-2757617-2025-07-18",
      "headline": "Yashasvi Jaiswal must curb aggressive instinct after Lord's blunder: Dilip VengsarkarFormer India batter Dilip Vengsarkar has asked Yashasvi Jaiswal to curb his aggressive instinct after his twin failures in the Lord's Test which eventually led to India's 22-run loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-fight-praised-gautam-gambhir-lords-test-india-lose-2757585-2025-07-18",
      "headline": "Ravindra Jadeja's resilience in Lord's Test earns him MVP praise from Team IndiaIndia head coach Gautam Gambhir was full of praise for seasoned all-rounder Ravindra Jadeja, hailing his battling knock in the Lord's Test against England as a display of \"incredible fight\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/diogo-jota-inducted-into-wolves-hall-of-fame-after-death-2757579-2025-07-18",
      "headline": "Diogo Jota posthumously inducted into Wolves Hall of FameWolverhampton Wanderers have paid tribute to Portuguese forward Diogo Jota by posthumously inducting him into the club's Hall of Fame following his tragic death in a car accident earlier this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-2011-world-cup-performance-india-selection-gary-kirsten-2757578-2025-07-18",
      "headline": "Ex-India coach reveals Yuvraj Singh's spot wasn't guaranteed in 2011 World CupFormer India head coach Gary Kirsten recently revealed that Yuvraj Singh's selection for the 2011 World Cup was a topic of debate, with some questioning his place in the squad. However, both Kirsten and then-captain MS Dhoni firmly backed the left-handed all-rounder—and that faith paid off in the biggest way possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-must-become-a-man-manager-like-ms-dhoni-gary-kirsten-2757570-2025-07-18",
      "headline": "Shubman Gill must become a man manager like Dhoni to be great captain: KirstenFormer India head coach Gary Kirsten has suggested Shubman Gill to become a man manager like MS Dhoni to achieve captaincy greatness. Gill has been in terrific form in Tests ever since being handed over the leadership."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ajinkya-rahane-suggests-change-in-playing-xi-for-4th-test-2757550-2025-07-18",
      "headline": "ENG vs IND: Ajinkya Rahane suggests major change in playing XI after Lord's lossIndia batter Ajinkya Rahane has suggested a change in the Indian playing XI for the fourth Test against England, set to be played at Emirates Old Trafford, Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-mitchell-starc-sachin-tendulkar-test-cricket-india-vs-australia-2757548-2025-07-18",
      "headline": "How Starc's spell to Sachin Tendulkar showed he was destined for greatnessFormer Australia captain Ricky Ponting believes Mitchell Starc's spell to Sachin Tendulkar was the first indication that the left-armer had the potential to become one of Australia's great fast bowlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/diogo-jota-inducted-into-wolves-hall-of-fame-after-death-2757579-2025-07-18",
      "headline": "Diogo Jota posthumously inducted into Wolves Hall of FameWolverhampton Wanderers have paid tribute to Portuguese forward Diogo Jota by posthumously inducting him into the club's Hall of Fame following his tragic death in a car accident earlier this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-2011-world-cup-performance-india-selection-gary-kirsten-2757578-2025-07-18",
      "headline": "Ex-India coach reveals Yuvraj Singh's spot wasn't guaranteed in 2011 World CupFormer India head coach Gary Kirsten recently revealed that Yuvraj Singh's selection for the 2011 World Cup was a topic of debate, with some questioning his place in the squad. However, both Kirsten and then-captain MS Dhoni firmly backed the left-handed all-rounder—and that faith paid off in the biggest way possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-must-become-a-man-manager-like-ms-dhoni-gary-kirsten-2757570-2025-07-18",
      "headline": "Shubman Gill must become a man manager like Dhoni to be great captain: KirstenFormer India head coach Gary Kirsten has suggested Shubman Gill to become a man manager like MS Dhoni to achieve captaincy greatness. Gill has been in terrific form in Tests ever since being handed over the leadership."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ajinkya-rahane-suggests-change-in-playing-xi-for-4th-test-2757550-2025-07-18",
      "headline": "ENG vs IND: Ajinkya Rahane suggests major change in playing XI after Lord's lossIndia batter Ajinkya Rahane has suggested a change in the Indian playing XI for the fourth Test against England, set to be played at Emirates Old Trafford, Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-mitchell-starc-sachin-tendulkar-test-cricket-india-vs-australia-2757548-2025-07-18",
      "headline": "How Starc's spell to Sachin Tendulkar showed he was destined for greatnessFormer Australia captain Ricky Ponting believes Mitchell Starc's spell to Sachin Tendulkar was the first indication that the left-armer had the potential to become one of Australia's great fast bowlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ryan-ten-doeschate-on-karun-nairs-form-2757524-2025-07-18",
      "headline": "Has Karun Nair exhausted all his chances in England? Assistant coach revealsIndia's assistant coach Ryan Ten Doeschate has shared his views on Karun Nair's form in the ongoing series against England. Nair has failed to convert his starts into big scores in the series so far, which has affected India badly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/ons-jabeur-break-tennis-mental-physical-wellbeing-injury-2757521-2025-07-18",
      "headline": "Ons Jabeur announces break from tennis to rediscover joy of living, thanks fansOns Jabeur announces a break from professional tennis to prioritise her mental and physical health. Her decision highlights the importance of self-care amid challenging times in elite sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-workload-management-ryan-ten-doeschate-india-vs-england-2757516-2025-07-18",
      "headline": "Mohammed Siraj is like a lion, important to manage his workload: Assistant coachIndia's assistant coach Ryan ten Doeschate on Thursday hailed fast bowler Mohammed Siraj's lion-hearted commitment to the team's cause, stressing the importance of managing his workload to preserve his fitness and impact in the long run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/snoop-dogg-co-owner-swansea-city-luka-modric-ownership-group-2757503-2025-07-18",
      "headline": "Snoop Dogg becomes co-owner of Swansea City, joins Modric in ownership groupRapper Snoop Dogg has joined Swansea City as a co-owner and investor, acquiring a minority stake in the Championship club. Swansea launched their home kit for the 2025-26 season last weekend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-liam-dawson-england-spinner-manchester-test-shoaib-bashir-replacement-2757500-2025-07-18",
      "headline": "ENG vs IND: Is Liam Dawson a smart pick for England for Manchester Test?England vs India, Manchester Test: England have drafted Liam Dawson in as a replacement for the injured Shoaib Bashir - but will the move pay off as they look to seal the series in Manchester?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-birthday-records-india-batter-2757396-2025-07-18",
      "headline": "Smriti Mandhana celebrates 29th birthday: Top 10 records held by India batterIndian women's cricket star Smriti Mandhana turned 29 on July 18. Since her debut in 2013, the elegant left-hander has etched her name in the record books, playing a pivotal role in the rise and growing popularity of women's cricket in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/durand-cup-2025-isl-teams-halved-manipur-kolkata-co-host-prize-money-2757427-2025-07-17",
      "headline": "Durand Cup 2025: ISL presence halved, Manipur joins as new co-hostThe 2025 Durand Cup sees a sharp drop in ISL participation as just six top-tier teams sign up. Manipur debuts as a host amid uncertainty surrounding the AIFF-FSDL standoff and ISL's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-ryan-ten-doeschate-points-out-major-concern-for-india-before-4th-test-2757402-2025-07-17",
      "headline": "Ten Doeschate points out major concern for India before 4th TestENG vs IND, 4th Test: Speaking to the reporters before the Manchester Test, India assistant coach Ryan ten Doeschate said that losing wickets in clusters haven't helped India in the ongoing Test series against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-liam-dawson-england-spinner-manchester-test-shoaib-bashir-replacement-2757500-2025-07-18",
      "headline": "ENG vs IND: Is Liam Dawson a smart pick for England for Manchester Test?England vs India, Manchester Test: England have drafted Liam Dawson in as a replacement for the injured Shoaib Bashir - but will the move pay off as they look to seal the series in Manchester?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-birthday-records-india-batter-2757396-2025-07-18",
      "headline": "Smriti Mandhana celebrates 29th birthday: Top 10 records held by India batterIndian women's cricket star Smriti Mandhana turned 29 on July 18. Since her debut in 2013, the elegant left-hander has etched her name in the record books, playing a pivotal role in the rise and growing popularity of women's cricket in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/durand-cup-2025-isl-teams-halved-manipur-kolkata-co-host-prize-money-2757427-2025-07-17",
      "headline": "Durand Cup 2025: ISL presence halved, Manipur joins as new co-hostThe 2025 Durand Cup sees a sharp drop in ISL participation as just six top-tier teams sign up. Manipur debuts as a host amid uncertainty surrounding the AIFF-FSDL standoff and ISL's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-ryan-ten-doeschate-points-out-major-concern-for-india-before-4th-test-2757402-2025-07-17",
      "headline": "Ten Doeschate points out major concern for India before 4th TestENG vs IND, 4th Test: Speaking to the reporters before the Manchester Test, India assistant coach Ryan ten Doeschate said that losing wickets in clusters haven't helped India in the ongoing Test series against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-transfer-news-hugo-ekitike-alexander-isak-newcastle-united-2757390-2025-07-17",
      "headline": "Liverpool agree personal terms with Ekitike, wait on Isak stance: ReportsPremier League: Liverpool have shifted focus to Hugo Ekitike after Newcastle refused to part with Alexander Isak. With a verbal agreement in place, the Reds are pushing to seal a £70m+ deal before the transfer window closes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/is-max-verstappen-going-to-mercedes-2757383-2025-07-17",
      "headline": "Max Verstappen to Mercedes? Meeting with Toto Wolff fuels Red Bull exit rumoursRumours of Max Verstappen's exit from Red Bull are gaining traction after reports of a secret meeting with Mercedes boss Toto Wolff. This move could potentially shock the F1 world.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-ben-stokes-workload-2757366-2025-07-17",
      "headline": "Bumrah vs Stokes: Ten Doeschate shuts down workload comparison talksENG vs IND: India assistant coach Ryan ten Doeschate addressed the discussion around the workloads of England captain Ben Stokes and Indian pacer Jasprit Bumrah following the Lord's Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-vs-adam-gilchrist-test-record-india-vs-england-2757359-2025-07-17",
      "headline": "Can Rishabh Pant be the next Adam Gilchrist of Indian cricket?Rishabh Pant's cricketing journey draws comparisons with legend Adam Gilchrist. Can Rishabh Pant go beyond what Gilchrist achieved in Test cricket?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-gautam-gambhir-ajit-agarkar-workload-management-2757357-2025-07-17",
      "headline": "Gambhir-Agarkar slammed for Bumrah's workload management: Play all matchesDilip Vengsarkar is not a fan of the current workload management policies, which allows Jasprit Bumrah to pick and choose the games he participates.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-availability-wicketkeeping-manchester-test-ten-doeschate-2757350-2025-07-17",
      "headline": "Rishabh Pant unlikely to keep wickets in Manchester Test: Ryan ten DoeschateENG vs IND: Rishabh Pant is on his road to recovery, but his availability for batting and keeping duties are yet to be cleared. India will bank on his availability, considering the series now hangs in the balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-ryan-ten-doeschate-manchester-test-2757336-2025-07-17",
      "headline": "Jasprit Bumrah to play 4th Test? India to take a call in ManchesterENG vs IND: India assistant coach Ryan ten Doeschate said that the team will take a call on Jasprit Bumrah's participation in the fourth Test after reaching Manchester. India are trailing the five-match series 1-2 after losing the Lord's Test by 22 runs. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-engand-arshdeep-singh-injury-hand-bandage-manchester-test-2757329-2025-07-17",
      "headline": "Arshdeep Singh injured? India pacer arrives Manchester training with bandageAs India prepare to fight back in the Manchester Test, a fresh injury scare around Arshdeep Singh's bandaged arm could complicate their pace strategy amid growing uncertainty around Jasprit Bumrah's availability."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-camerongreen-australia-no3-2757257-2025-07-17",
      "headline": "Ponting backs Cameron Green's resilience at No 3 despite early strugglesCameron Green may have had a shaky start at No.3 but has the support of legendary Ricky Ponting. Ponting has argued that Green has shown continued improvement at the position and should be backed for the Ashes in November 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswals-poor-shot-opened-up-the-lords-test-stuart-broad-2757316-2025-07-17",
      "headline": "Yashasvi Jaiswal's poor shot opened up the Lord's Test: Stuart BroadFormer England fast bowler Stuart Broad feels India opener Yashasvi Jaiswal's poor shot on Day 4 of the third Test at Lord's opened up the game which eventually led to India's loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/litton-das-bangladesh-vs-pakistan-t20i-series-2757302-2025-07-17",
      "headline": "Won't be easy: Litton Das eyes Pakistan heist after Sri Lanka T20I winBAN vs PAK: Litton Das said Bangladesh will need to work hard in their upcoming T20I series against Pakistan. His comments came after leading the Tigers to their maiden T20I series victory over Sri Lanka on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shimron-hetmyer-hits-5-sixes-in-an-over-vs-fabian-allen-in-global-super-league-2757283-2025-07-17",
      "headline": "Shimron Hetmyer goes berserk, blasts 5 Sixes in an over in Global Super LeagueGuyana Amazon Warriors batter Shimron Hetmyer hit five sixes in an over against Guyana Amazon Warriors' Fabian Allen in the Global Super League. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}