{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-hits-record-123000-as-us-policy-hopes-boost-crypto-market-btc-price-all-time-high-2755608-2025-07-14",
      "headline": "Bitcoin hits record $123,000 as US policy hopes boost crypto marketBitcoin is up about 30% so far this year and its rise has lifted other coins too. Ether, the second-biggest token, climbed to a five-month high of $3,059. XRP and Solana also rose about 3% each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-hits-6-year-low-in-june-to-210-2755534-2025-07-14",
      "headline": "Retail inflation cools to 6-year low of 2.10% in JuneThis is the fifth month in a row that inflation has remained below the Reserve Bank of India's (RBI) medium-term target of 4%, and the eighth consecutive month it has stayed under the central bank's upper limit of 6%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-247-points-lower-nifty-below-25100-eternal-zomato-up-3-percent-2755524-2025-07-14",
      "headline": "Sensex closes 247 points lower, Nifty below 25,100; Eternal up 3%The S&P BSE Sensex was down by 247.01 points to close at 82,253.46, while the NSE Nifty50 lost 67.55 points to end at 25,082.30."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ott-dark-pattern-50-percent-find-difficult-to-unsubscribe-local-circles-report-2755499-2025-07-14",
      "headline": "Trap, click, renew: How OTT apps make it hard to cancel subscriptionsAccording to data collected by community platform LocalCircles, 50% of respondents said they have frequently had difficulty cancelling subscriptions to digital services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/edelweiss-mutual-fund-radhika-gupta-on-why-your-portfolio-should-be-yours-not-someone-else-suno-sabki-portfolio-apni-2755465-2025-07-14",
      "headline": "Edelweiss' Radhika Gupta on why your portfolio should be yours, not someone else'sBuilding your investment portfolio should match your own risk comfort, timeframe and goals. What works for your friend may not work for you, says MD and CEO of Edelweiss Mutual Fund, Radhika Gupta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-your-tax-refund-may-be-delayed-this-year-2755425-2025-07-14",
      "headline": "Why your tax refund may be delayed this yearOne big reason for the delay is that the tax filing season began late this year. Normally, people can file their returns from April onwards. But this time, the Income Tax Department released the ITR utilities quite late."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-down-crash-sensex-nifty-decline-reason-why-bse-nse-top-losers-it-stocks-2755394-2025-07-14",
      "headline": "Sensex down 400 points: Why is stock market falling todayAs of 11:50 am, the S&P BSE Sensex was down by 388.85 points to 82,111.62, while the NSE Nifty50 lost 110.85 points to 25,039.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/only-67-percent-filed-itrs-coinswitch-co-founder-ashish-singhal-on-why-indians-delay-tax-filing-2755368-2025-07-14",
      "headline": "Only 6.7% filed ITRs: CoinSwitch co-founder on why Indians delay tax filingIndia has made big progress in digital tax filing over the years. There are new portals, better forms and more ways to pay taxes online. Yet, millions still wait till the last few days to get their documents in order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-rise-5-percent-q1-results-store-close-profit-sales-number-2755365-2025-07-14",
      "headline": "Explained: Why Ola Electric shares gained 5% todayOla Electric share price: The stock touched an intraday high of Rs 43.60 before trading 5.45% higher at Rs 41.99 around 11:11 am, shortly after the electric two-wheeler maker announced its financial results for the first quarter of FY26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-all-time-high-usd-120000-why-reasons-us-policy-latest-price-crypto-ether-2755326-2025-07-14",
      "headline": "Bitcoin zooms past $120,000 to reach all-time high. Here's whyThe world's largest cryptocurrency was last seen trading at $120,700.54, up 1.32%, as investor confidence remained strong ahead of important regulatory discussions in the United States."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-95-points-lower-nifty-below-25200-hcltech-up-1-percent-hul-down-2755305-2025-07-14",
      "headline": "Sensex, Nifty start week in red as IT stocks drag markets lower againThe S&P BSE Sensex lost 266.34 points to 82,234.13, while the NSE Nifty50 was down by 67.95 points to 25,081.90 as of 9:22 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/travel-food-services-market-debut-listing-today-latest-gmp-listing-gains-2755300-2025-07-14",
      "headline": "Travel Food Services to make market debut today; here's the latest GMPTravel Food Services listing: The grey market premium (GMP), which had dropped sharply in the past week, has seen a slight rise ahead of the listing."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/richa-chadha-on-radhika-yadav-murder-world-will-recall-deepak-yadav-loser-2755685-2025-07-14",
      "headline": "Richa Chadha condemns Radhika Yadav's killing, calls her father Deepak a loserActor Richa Chadha has voiced her outrage over the shocking murder of Radhika Yadav, allegedly at the hands of her father Deepak Yadav. She blamed deep-rooted societal pressures for the horrific act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dhanashree-verma-to-join-bigg-boss-19-yuzvendra-chahal-ex-wife-2755671-2025-07-14",
      "headline": "Dhanashree Verma, Yuzvendra Chahal's ex-wife, to join Bigg Boss 19: ReportIndian cricketer Yuzvendra Chahal's ex-wife and influencer Dhanashree Verma may join 'Bigg Boss 19'. She is reportedly in final negotiations with the makers of the reality show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-kashyap-slams-t-series-underpaying-music-dev-d-gangs-of-wasseypur-bhushan-kumar-2755653-2025-07-14",
      "headline": "Anurag Kashyap on T-Series underpaying his films' music: They don't get good musicDirector Anurag Kashyap recently opened up about being underpaid by T-Series for the music of 'Dev D' (2009) and 'Gangs of Wasseypur' (2012). He criticised the music label for undervaluing quality in film music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lee-soo-hyuk-leaves-yg-after-8-years-joins-sooyoung-agency-saraam-entertainment-2755672-2025-07-14",
      "headline": "Tomorrow actor Lee Soo-hyuk leaves YG after 8 years, joins Sooyoung's agencySARAM Entertainment, which currently manages talents like Sooyoung and Park Gyu-young, is all set to welcome actor Lee Soo-hyuk to its roster. Here's all you need to know.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shanaya-kapoor-no-competition-with-bffs-ananya-suhana-family-2755647-2025-07-14",
      "headline": "Shanaya Kapoor says no competition with BFFs Ananya-Suhana: They're familyShanaya Kapoor opens up about her close friendship with Ananya Panday and Suhana Khan. She emphasises that competition does not exist among them as they consider each other family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/b-saroja-devi-dies-87-kannada-cinema-first-female-superstar-2755663-2025-07-14",
      "headline": "B Saroja Devi dies at 87: PM Modi calls her pillar of Indian cinemaVeteran actor B Saroja Devi died at 87, leaving a lasting impact on Indian cinema. Her diverse roles across languages marked her as a versatile icon, mourned by Prime Minister Narendra Modi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/varun-dhawan-janhvi-kapoor-first-look-sunny-sanskari-ki-tulsi-kumari-bollywood-film-release-date-2755621-2025-07-14",
      "headline": "Sunny Sanskari Ki Tulsi Kumari release date out. See Varun, Janhvi's first lookThe first-look posters of actors Varun Dhawan and Janhvi Kapoor from the upcoming film 'Sunny Sanskari Ki Tulsi Kumari' were unveiled on Monday.  Directed by Shashank Khaitan, the film is set for release on October 2 this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shiva-rajkumar-to-vijay-sethupathi-celebs-mourn-b-saroja-devis-death-2755648-2025-07-14",
      "headline": "Shiva Rajkumar to Vijay Sethupathi, celebs mourn B Saroja Devi's deathThe news of veteran actor B Saroja Devi's death at the age of 87 in Bengaluru has prompted an outpouring of tributes from across the South Indian film industry. Actors like Shiva Rajkumar, Sudeep, Darshan, Simran, Ramya, and Vijay Sethupathi remembered her legacy and influence, offering heartfelt condolences on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/deepak-tijori-wants-jo-jeeta-wohi-sikandar-sequel-with-aamir-khan-2755559-2025-07-14",
      "headline": "Deepak Tijori wants Jo Jeeta Wohi Sikandar sequel with Aamir Khan as rival coachDeepak Tijori expressed his wish to create a 'Jo Jeeta Wohi Sikandar' sequel featuring Aamir Khan. He believes the rivalry between their characters as coaches would make for a captivating film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/wimbledon-tribute-jana-nayagan-indian-cinema-2025-jannik-sinner-carlos-alcaraz-2755604-2025-07-14",
      "headline": "Wimbledon posts Thalapathy Vijay's Jana Nayagan style poster with Jannik SinnerWimbledon posted a picture recreating Thalapathy Vijay's 'Jana Nayagan' Republic Day poster with Tennis star Jannik Sinner, commemorating his recent victory at the grand slam event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/benny-blanco-manifest-selena-gomez-with-his-love-checklist-2755596-2025-07-14",
      "headline": "Did Benny Blanco manifest Selena Gomez with his love checklist?Selena Gomez's fiance Benny Blanco's modest checklist for his ideal partner appears to have done the trick. He's seemingly found the real deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/santhosh-kumar-footloosers-feature-back-in-limelight-through-malayalam-film-footloosers-2755605-2025-07-14",
      "headline": "Malayalam movie 'Moonwalk' puts spotlight back on Kerala's breakdance troupeMoonwalk, a new Malayalam film inspired by real-life breakdancers in Thiruvananthapuram, revisits Kerala's 1980s street dance culture. The film traces the journey of the Footloosers troupe and its founder Babu Master, celebrating their resilience, influence, and enduring passion for dance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/farhan-akhtar-bhaag-milkha-bhaag-to-re-release-in-theatres-on-july-18-2755516-2025-07-14",
      "headline": "Farhan Akhtar's Bhaag Milkha Bhaag to re-release in theatres on July 18'Bhaag Milkha Bhaag', based on the life of athlete Milkha Singh, is set for a limited re-release in theatres. Actor Farhan Akhtar, who plays Milkha Singh in the film, said he is grateful that audiences will get to experience the film once again on the big screen. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/b-saroja-devi-dies-pan-india-queen-who-ruled-cinema-for-3-decades-with-unmatched-legacy-2755514-2025-07-14",
      "headline": "B Saroja Devi: Pan-India queen who ruled cinema for 3 decades with unmatched legacyPadma Bhushan B Saroja Devi was the first female superstar of Kannada cinema, who rose to stardom not just in Kannada but also in Tamil, Telugu and Hindi industries, earning her epithets like 'Abhinaya Saraswathi' (Saraswathi of expressions), 'Kannadathu Paingili' (Kannada's Parrot), and 'Chaturbhasha Taare' (Four-language Star). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-begins-targeted-therapy-after-cancer-surgery-2755494-2025-07-14",
      "headline": "Dipika Kakar begins targeted therapy after cancer surgery, shares health updateTelevision actor Dipika Kakar, who is battling stage 2 liver cancer, has started targeted therapy and shared her health update with fans. Despite early side effects like mouth ulcers, she remains positive and is following her doctors' advice strictly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/7-best-anime-films-and-shows-for-those-who-have-no-idea-about-the-genre-2755479-2025-07-14",
      "headline": "7 best anime films and shows for those who have no idea about the genreThe world of anime can feel overwhelming at first, but you don't need to dive headfirst into hundreds of episodes. Here's a guide to kickstart your anime journey with these seven films and shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-dance-in-old-video-from-anant-ambani-radhika-merchant-2755340-2025-07-14",
      "headline": "Shah Rukh Khan's dance in old video from Anant-Radhika wedding steals hearts againA throwback video of Shah Rukh Khan dancing to 'Chaleya' at Anant Ambani and Radhika Merchant's pre-wedding in Jamnagar is going viral again. Fans are loving his energy and saying he still looks as handsome and young as ever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/south-korean-actor-kang-seo-ha-dies-at-31-2755462-2025-07-14",
      "headline": "South Korean actor Kang Seo-ha dies at 31, funeral scheduled for July 16South Korean actor Kang Seo-ha died at the age of 31 after a long battle with stomach cancer. Her funeral is scheduled for July 16 in Seoul. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/karachi-drama-group-mauj-ai-ramayana-cultural-harmony-2755432-2025-07-14",
      "headline": "Pakistani drama group stages Ramayana in KarachiA Karachi-based drama group stages 'Ramayana,' using AI enhancements. The production has been well-received by the audience."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-will-impose-very-severe-tariffs-on-russia-if-theres-no-deal-to-end-ukraine-war-in-50-days-trump-2755708-2025-07-14",
      "headline": "Trump warns very severe tariffs on Russia if it doesn't ends Ukraine war in 50 daysNato Secretary General Mark Rutte, who joined Donald Trump for talks at the White House, said that if he was Putin, he would have thought about the US President's warning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-3rd-test-lords-score-ben-stokes-ravindra-jadeja-2755697-2025-07-14",
      "headline": "Jadeja's defiance in vain as England defend 192 in fiery Lord's epicEngland vs India, 3rd Test: England raised the stakes on Day 5, successfully defending 192 at Lord's. Despite a gritty knock from Ravindra Jadeja, India fell short by 22 runs, undone by the top order's recklessness. Ben Stokes and his men now lead 2-1 in the Anderson-Tendulkar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indias-aviation-watchdog-orders-fuel-switch-checks-on-boeing-planes-covered-under-2018-us-advisory-by-july-21-2755624-2025-07-14",
      "headline": "Fuel switch checks ordered on select Boeing planes after Air India crash reportThe DGCA has directed all airline operators to complete the inspection of the engine fuel switches by July 21, 2025. The regulator has also issued mandatory modifications for aircraft, engines, and components based on airworthiness directives issued by the state of design or manufacture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/is-ulfa-still-a-thorn-in-india-side-2755557-2025-07-14",
      "headline": "Is ULFA still a thorn in India's side?The important question one needs to address, however, is how important or relevant the ULFA-I is anymore. Does it constitute a major threat to Indian security forces in the northeast? To answer this question, one needs to remember that a faction of the ULFA had already signed an agreement with the Centre and the Assam state government in December 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/wimbledon-2025-indian-celebrity-fashion-priyanka-chopra-saree-labubu-anushka-sharma-virat-kohli-2755578-2025-07-14",
      "headline": "Saree, labubu, tennis charms: Thanks to Indian celebs, Wimbledon 2025 had it allWimbledon 2025 saw several Indian celebrities serve up serious fashion moments this year.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-college-girl-self-immolation-case-principal-arrested-after-harassment-allegations-2755656-2025-07-14",
      "headline": "Odisha college principal arrested after student's self-immolation over harassmentThe arrest comes amid widespread outrage over the college administration's alleged inaction, which the student said drove her to take the extreme step."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/video-eggs-thrown-at-indians-rath-yatra-in-canada-devotee-says-no-hate-can-shake-us-2755655-2025-07-14",
      "headline": "Video shows eggs being thrown at Rath Yatra in Canada, India demands actionEggs were thrown at a Rath Yatra procession in Toronto, prompting accusations of racism and xenophobia after videos showed devotees being targeted while singing devotional songs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-mohammed-siraj-tears-ben-stokes-joe-root-2755718-2025-07-14",
      "headline": "Siraj in tears, England players console pacer after Lord's win (Watch)England players came in to console Mohammed Siraj after the pacer was the last man to be dismissed in the Lord's Test. Siraj's wicket helped England win the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/packaged-food-alert-why-india-needs-warning-labels-not-health-star-ratings-2754431-2025-07-12",
      "headline": "Packaged food alert: Why India needs warning labels, not health star ratingsExperts share how the country's draft guidelines on food labelling require more democratic dialogue in order to truly empower the consumer\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/congress-bjp-row-erupts-over-protocol-at-ktaka-sigandur-bridge-inauguration-shivamogga-2755639-2025-07-14",
      "headline": "Shouldn't I have been invited? Siddaramaiah slams Nitin Gadkari on bridge openingA row over protocol marred the inauguration of Karnataka's Rs 473 crore Sigandur bridge, with Chief Minister Siddaramaiah alleging the Centre excluded his office from prior consultation or planning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/need-to-avoid-restrictive-trade-measures-jaishankar-tells-chinas-wang-yi-2755698-2025-07-14",
      "headline": "Need to avoid restrictive trade measures, Jaishankar tells China's Wang YiIn his opening remarks at the meeting, Jaishankar said the relations between the two countries can continue to develop on a \"positive trajectory\" on the foundation that differences should not become disputes and competition should not become conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lover-revenge-plot-turned-profit-babydoll-archi-adult-entertainment-star-kendra-lust-morphed-ai-images-assam-girl-2755445-2025-07-14",
      "headline": "Ex-lover turns revenge into porn profit, morphs Assam girl into Babydoll ArchiA revenge plot turned into a source of profit when a mechanical engineer from Assam, Pratim Bora, used AI to create explicit videos and images of his former girlfriend from a single photo, creating the persona of Babydoll Archi. The Instagram handle went viral with the news that Babydoll Archi was joining the American porn industry. This is an eye-opener on the misuse of AI technology, and what you see might not always be true. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/health-warnings-on-samosas-jalebis-pakoras-to-tackle-lifestyle-diseases-india-2755456-2025-07-14",
      "headline": "Samosa and jalebi to carry cigarette-like warnings: Health MinistryIn a first-of-its-kind move, the Health Ministry is rolling out visual health warnings for high-fat and high-sugar foods like samosas and jalebis, starting with AIIMS Nagpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/singer-rahul-fazilpuriya-escapes-unhurt-after-shots-fired-at-him-in-gurugram-2755701-2025-07-14",
      "headline": "Singer Rahul Fazilpuria attacked in Gurugram, cops probing 'fire incident'The incident happened at SPR Road in Gurugram on Monday evening when unidentified assailants fired two to three rounds at the singer's vehicle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-undocks-from-space-station-ax-4-crew-begins-journey-back-home-2755551-2025-07-14",
      "headline": "Shubhanshu Shukla is coming home, Dragon spacecraft begins 22-hour journey backThe capsule is expected to splash down in the Pacific Ocean off the coast of California around 3:00 pm IST on July 15, where recovery teams will be waiting to retrieve the astronauts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/centre-appoints-high-court-chief-justices-in-madhya-pradesh-karnataka-guwahati-jharkhand-patna-2755683-2025-07-14",
      "headline": "States including Karnataka, Bihar, Madhya Pradesh get High Court Chief JusticesThe appointments were made by the President of India in consultation with the Chief Justice of India under constitutional powers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/why-shubhanshu-shuklas-return-on-dragon-spacecraft-will-take-22-hours-2755640-2025-07-14",
      "headline": "Why Shubhanshu Shukla's return on Dragon spacecraft will take 22 hours?While it might seem surprising that returning from just 400 kilometers above Earth takes nearly a full day, the extended duration is a result of complex orbital mechanics, safety protocols, and precise landing requirements."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/stranded-british-f-35-fighter-jets-completes-one-month-in-india-repair-underway-2755609-2025-07-14",
      "headline": "Stranded British F-35 fighter jet completes one month in India, repair underwayThe F-35 has remained grounded after it was diverted from the Royal Navy aircraft carrier HMS Prince of Wales due to bad weather and low fuel and landed in Kerala on June 14."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-crash-report-aaib-priyanka-chaturvedi-ahmedabad-plane-crash-pilots-2755477-2025-07-14",
      "headline": "Sena MP questions Air India crash report's hushed release, leaks to global pressPriyanka Chaturvedi has questioned how Air India flight 171's crash report was leaked abroad before India's official disclosure, calling the late-night release opaque and demanding a formal probe."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/robert-vadra-not-cooperating-failed-to-disclose-financial-link-to-uk-arms-dealer-sanjay-bhandari-ed-sources-2755675-2025-07-14",
      "headline": "Robert Vadra not cooperating, didn't disclose link to UK arms dealer: ED sourcesRobert Vadra not cooperating, failed to disclose financial link to UK arms dealer Sanjay Bhandari: ED sources"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/drone-missile-strikes-top-ulfa-leaders-killed-myanmar-border-indian-army-denies-role-assam-cm-himanta-2755459-2025-07-14",
      "headline": "Drone, missile strikes kill 3 Ulfa leaders in Myanmar, Army denies roleThree top Ulfa(I) leaders, including its lower council chief, were killed in back-to-back aerial strikes near the India-Myanmar border, claimed the Paresh Baruah-led outlawed secessionist outfit. While it blamed Indian forces for the \"drone and missile strikes\", both the Army and Assam CM Himanta Biswa Sarma denied any involvement."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/the-worry-lines-in-air-india-flight-ai171-crash-preliminary-report-2755488-2025-07-14",
      "headline": "The worry lines in Air India Flight AI171 crash preliminary reportIt's not the final verdict, yet the 15-page report on the ongoing investigation points to some telltale signs and raises troubling questions\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cargo-truck-hits-akasa-air-plane-at-mumbai-airport-2755654-2025-07-14",
      "headline": "Cargo truck hits Akasa Air plane at Mumbai airportNo injuries to any employee or passenger have been reported in the incident, an Akasa Air spokesperson said.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-modi-govts-4-rajya-sabha-picks-signal-shift-in-strategic-template-2755515-2025-07-14",
      "headline": "How Modi govt's 4 Rajya Sabha picks signal shift in strategic templateThe Upper House of Parliament, often mocked as a place for defeated politicians or ageing notables, is being reimagined as an instrument of deep influence\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/richa-chadha-on-radhika-yadav-murder-world-will-recall-deepak-yadav-loser-2755685-2025-07-14",
      "headline": "Richa Chadha condemns Radhika Yadav's killing, calls her father Deepak a loserActor Richa Chadha has voiced her outrage over the shocking murder of Radhika Yadav, allegedly at the hands of her father Deepak Yadav. She blamed deep-rooted societal pressures for the horrific act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-kashyap-slams-t-series-underpaying-music-dev-d-gangs-of-wasseypur-bhushan-kumar-2755653-2025-07-14",
      "headline": "Anurag Kashyap on T-Series underpaying his films' music: They don't get good musicDirector Anurag Kashyap recently opened up about being underpaid by T-Series for the music of 'Dev D' (2009) and 'Gangs of Wasseypur' (2012). He criticised the music label for undervaluing quality in film music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/ranbir-kapoor-alia-bhatt-daughter-raha-return-from-london-2755687-2025-07-14",
      "headline": "Video: Ranbir Kapoor, Alia Bhatt return from London with daughter RahaPopular Bollywood couple, Ranbir Kapoor and Alia Bhatt, are back from their London vacation. The couple was clicked as they returned to Mumbai with daughter Raha Kapoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shanaya-kapoor-no-competition-with-bffs-ananya-suhana-family-2755647-2025-07-14",
      "headline": "Shanaya Kapoor says no competition with BFFs Ananya-Suhana: They're familyShanaya Kapoor opens up about her close friendship with Ananya Panday and Suhana Khan. She emphasises that competition does not exist among them as they consider each other family."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-mohammed-siraj-tears-ben-stokes-joe-root-2755718-2025-07-14",
      "headline": "Siraj in tears, England players console pacer after Lord's win (Watch)England players came in to console Mohammed Siraj after the pacer was the last man to be dismissed in the Lord's Test. Siraj's wicket helped England win the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-3rd-test-lords-score-ben-stokes-ravindra-jadeja-2755697-2025-07-14",
      "headline": "Jadeja's defiance in vain as England defend 192 in fiery Lord's epicEngland vs India, 3rd Test: England raised the stakes on Day 5, successfully defending 192 at Lord's. Despite a gritty knock from Ravindra Jadeja, India fell short by 22 runs, undone by the top order's recklessness. Ben Stokes and his men now lead 2-1 in the Anderson-Tendulkar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-fourth-innings-curse-strikes-india-again-miss-golden-chance-at-lords-2755688-2025-07-14",
      "headline": "Fourth innings curse strikes India again, miss golden chance at Lord'sIndia's past horrors from the fourth innings chases came back to haunt them again as they missed a golden opportunity to take a 2-1 lead in the series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ben-stokes-riled-up-zak-crawley-drama-lords-test-2755651-2025-07-14",
      "headline": "Ben Stokes all riled up after India targeted Crawley on Day 3: Stuart BroadENG vs IND: Stuart Broad reckons that Ben Stokes may be out for revenge after the way the Indian players had targeted Zak Crawley earlier in the Lord's Test."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-r-ashwin-paul-reiffel-umpiring-2755627-2025-07-14",
      "headline": "R Ashwin slams Paul Reiffel for his controversial calls in third TestFormer cricketer R Ashwin criticised Paul Reiffel on his YouTube channel Ash Ki Baat, questioning decisions made by the umpire during the third Test between India and England at Lord's.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ravindra-jadeja-brydon-carse-engage-in-ugly-spat-mid-pitch-2755610-2025-07-14",
      "headline": "Wrestlemania at Lord's: Ravindra Jadeja, Brydon Carse engage in ugly spat mid-pitchIndia all-rounder Ravindra Jadeja and Brydon Carse engaged in an ugly spat after their mid-pitch collision on Day 5 of the third Test against England at Lord's. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/asian-champion-jyothi-yarraji-undergoes-acl-surgery-out-of-world-championships-2755599-2025-07-14",
      "headline": "Asian Champion Jyothi Yarraji undergoes ACL surgery, out of World ChampionshipsAsian Champion and national record holder Jyothi Yarraji has undergone successful surgery to repair an ACL tear. The surgery will keep Yarraji out of the World Championships in September and ended her season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-aaron-appointed-sunrisers-hyderabad-bowling-coach-ipl-2026-2755570-2025-07-14",
      "headline": "Varun Aaron replaces James Franklin as SRH's new bowling coachVarun Aaron has been appointed as the bowling coach of SunRisers Hyderabad ahead of the IPL 2026 season. His appointment marks a new chapter for SRH as they replace James Franklin with the former fast bowler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jofra-archer-gives-aggressive-send-off-to-rishabh-pant-2755565-2025-07-14",
      "headline": "Jofra Archer gives aggressive send-off to Rishabh Pant after shattering his stumpsEngland fast bowler Jofra Archer gave an aggressive send-off to Rishabh Pant after dismissing him on Day 5 of the third Test at Lord's. Archer bowled a brilliant spell in first session on Day 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-bowling-spell-lords-test-michael-vaughan-india-england-2755531-2025-07-14",
      "headline": "Vaughan lauds Bumrah's near-perfect spell at Lord's TestMichael Vaughan has praised Jasprit Bumrah for delivering a serious and impactful spell with the new ball on Day 4 of the third Test between England and India at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/asian-champion-jyothi-yarraji-undergoes-acl-surgery-out-of-world-championships-2755599-2025-07-14",
      "headline": "Asian Champion Jyothi Yarraji undergoes ACL surgery, out of World ChampionshipsAsian Champion and national record holder Jyothi Yarraji has undergone successful surgery to repair an ACL tear. The surgery will keep Yarraji out of the World Championships in September and ended her season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-aaron-appointed-sunrisers-hyderabad-bowling-coach-ipl-2026-2755570-2025-07-14",
      "headline": "Varun Aaron replaces James Franklin as SRH's new bowling coachVarun Aaron has been appointed as the bowling coach of SunRisers Hyderabad ahead of the IPL 2026 season. His appointment marks a new chapter for SRH as they replace James Franklin with the former fast bowler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jofra-archer-gives-aggressive-send-off-to-rishabh-pant-2755565-2025-07-14",
      "headline": "Jofra Archer gives aggressive send-off to Rishabh Pant after shattering his stumpsEngland fast bowler Jofra Archer gave an aggressive send-off to Rishabh Pant after dismissing him on Day 5 of the third Test at Lord's. Archer bowled a brilliant spell in first session on Day 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-bowling-spell-lords-test-michael-vaughan-india-england-2755531-2025-07-14",
      "headline": "Vaughan lauds Bumrah's near-perfect spell at Lord's TestMichael Vaughan has praised Jasprit Bumrah for delivering a serious and impactful spell with the new ball on Day 4 of the third Test between England and India at Lord's."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}