{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/7-money-myths-that-are-keeping-you-from-maximising-your-financial-worth-2769405-2025-08-11",
      "headline": "7 money-related myths decoded for stable financesFrom health insurance and tax filing to investing and retirement planning, understanding the truth behind common myths can help you make confident, well-informed decisions for your future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-5-excel-utility-opens-what-is-it-and-who-must-file-2769440-2025-08-11",
      "headline": "ITR-5 excel utility opens: What is it and who must fileIf filing physically, taxpayers must verify the return by sending the signed ITR-V form to the Centralised Processing Centre (CPC) in Bengaluru within 30 days, unless they choose to e-verify instead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/make-in-india-made-in-china-manufacturing-economics-trade-deficit-report-pm-modi-geopolitical-2769387-2025-08-11",
      "headline": "Why 'Make in India' still depends so much on 'Made in China'When Prime Minister Narendra Modi launched the 'Make in India' programme in 2014, it was meant to transform India into a global manufacturing hub, create millions of jobs, and reduce dependence on imports, especially from China. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-amd-us-china-semiconductor-chip-sales-agreement-explained-2769358-2025-08-11",
      "headline": "From ban to profit sharing: Inside US deal with Nvidia, AMD on China chip salesThe deal makes the US a direct financial beneficiary of sensitive technology sales to a geopolitical rival. This article looks into the key details of this first-of-its-kind agreement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icici-bank-new-minimum-balance-rules-faqs-charges-and-key-information-2769349-2025-08-11",
      "headline": "ICICI Bank new minimum balance rules: FAQs, charges, and key informationIn metro and urban branches, the minimum average balance will jump from Rs 10,000 to Rs 50,000. For semi-urban areas, it will increase from Rs 5,000 to Rs 25,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/borrowed-cash-from-a-friend-you-may-end-up-paying-income-tax-penalty-2768449-2025-08-11",
      "headline": "Borrowed cash from a friend? You may end up paying income tax penaltyThe income tax department is strict when it comes to large cash transactions. Whether it's taking a loan, repaying one, or even making donations, there are limits you need to follow. Go beyond those, and you could face a penalty equal to the entire amount involved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bluestone-jewellery-ipo-review-subscribe-skip-opening-date-latest-gmp-good-bad-details-2769330-2025-08-11",
      "headline": "BlueStone Jewellery IPO opens for bidding: Should you subscribe?The IPO consists of a fresh issue of 1.59 crore shares worth Rs 820 crore and an offer for sale of 1.39 crore shares worth Rs 720.65 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sbi-share-price-gain-rise-2-percent-good-q1-results-should-you-buy-price-target-review-2769314-2025-08-11",
      "headline": "SBI shares rise 2% over Q1 results. Should you buy?SBI share price: The rise came after SBI posted a standalone net profit of Rs 19,160 crore for the June quarter (Q1FY26), up from Rs 17,035 crore in the same quarter last year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/why-volatas-shares-are-down-today-q1-results-explained-2769311-2025-08-11",
      "headline": "Voltas shares slide nearly 8% after sharp Q1 profit declineAt around 9:55 am, shares of Voltas were trading 5.86% lower at Rs 1,227.35.  The company reported a steep 58% year-on-year decline in net profit to Rs 140.6 crore, weighed down by unseasonal weather and subdued summer demand, which impacted air conditioner sales."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-100-points-nifty-above-24400-grasim-gains-2-2769299-2025-08-11",
      "headline": "Sensex back above 80,000 as markets eye Trump-Putin meeting outcomeThe S&P BSE Sensex was trading 157.26 points higher at 80,015.05 at 9:26 am, while the NSE Nifty50 rose 43.60 points to trade at 24,406.90. Most of the other broader market indices were mixed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-share-price-multibagger-stock-market-gains-investors-rally-explained-2769295-2025-08-11",
      "headline": "NSDL turns into a multibagger for investors: Will it continue to gain?Issued at Rs 800, the stock opened at Rs 880 and has raced to Rs 1,300.30, minting massive gains for early institutional investors and retail shareholders alike.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-bank-hikes-minimum-balance-to-rs-50000-metro-urban-areas-penalty-charges-2768696-2025-08-09",
      "headline": "ICICI Bank hikes minimum savings balance to Rs 50,000: What it means for youThe change applies to all new accounts opened after that date, setting a new benchmark in the industry for the highest MAB requirement among domestic banks."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-craze-in-us-man-confused-over-avenger-like-popularity-of-rajini-indians-give-him-a-rajinikanth-power-class-2769499-2025-08-11",
      "headline": "US man confused over Coolie craze, Indians give him a Rajinikanth power class When a US man stumbled upon sold-out 'Coolie' shows and sky-high ticket prices, he turned to X for answers, and Rajinikanth fans happily schooled him on the superstar's God-like craze."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rm-hits-3-billion-solo-streams-joins-suga-and-j-hope-in-milestone-2769319-2025-08-11",
      "headline": "RM hits 3 billion solo streams, joins SUGA and J-Hope in milestoneBTS leader RM has achieved a remarkable milestone by crossing 3 billion solo streams on Spotify, joining fellow members SUGA and J-Hope in this elite group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-advance-booking-update-detailed-report-hrithik-jr-ntr-spy-saga-sells-over-67000-tickets-for-day-1-2769463-2025-08-11",
      "headline": "War 2 advance booking: Hrithik-Jr NTR's spy saga sells over 67,000 tickets for Day 1The advance booking for 'War 2' opened recently, and the spy saga has been performing decently so far. Starring Hrithik Roshan and Jr NTR in the lead, the film is yet to see a massive hike in its sales in Andhra Pradesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hansika-motwani-lessons-she-didnt-ask-for-birthday-post-amid-divorce-rumours-2769464-2025-08-11",
      "headline": "Hansika Motwani's cryptic birthday post hints at new lessons amid divorce rumoursOn her 34th birthday, Hansika Motwani shared a heartfelt Instagram story hinting at unforeseen challenges. In a cryptic post, she wrote about learning lessons that she didn't ask for amid growing rumours about her divorce from Sohael Khaturiya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-to-return-with-new-mini-album-this-november-reports-2769443-2025-08-11",
      "headline": "BLACKPINK to return with new mini-album this November: ReportsK-pop girl group Blackpink are rumoured to release a mini-album in November amid their ongoing 'Deadline World Tour'. Fans await official confirmation as the group continues to break records globally."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-teaser-tiger-shroff-sanjay-dutt-violence-with-side-of-trigger-alert-2769462-2025-08-11",
      "headline": "Baaghi 4 teaser: Tiger Shroff-Sanjay Dutt serve violence with side of trigger alertThe teaser of 'Baaghi 4' starring Tiger Shroff and Sanjuay Dutt is out. The video is nothing short of violence, gruesome, and vengeance served with power-packed action sequences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/boong-manipuri-film-farhan-akhtar-iffm-2025-spotlight-premiere-2769420-2025-08-11",
      "headline": "Farhan Akhtar-backed Boong selected as Spotlight film at Melbourne festival'Boong', a Manipuri film backed by Farhan Akhtar, has been chosen as the Spotlight Film at the Indian Film Festival of Melbourne 2025, highlighting its growing international acclaim and the promising debut of director Lakshmipriya Devi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ntr-beyond-rrr-from-legacy-launch-to-global-sensation-2768586-2025-08-11",
      "headline": "Jr NTR beyond RRR: From legacy launch to global sensationFrom a child artist in 'Bala Ramayanam' to an actor commanding global attention, Jr NTR's journey has been one of relentless evolution. He is now waiting for the release of 'War 2', his big Bollywood debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/john-abraham-saiyaara-success-aditya-chopra-faith-newcomers-tehran-ott-zee5-release-2769413-2025-08-11",
      "headline": "John Abraham on Saiyaara's success: Aditya Chopra's faith in newcomers workedJohn Abraham praises Aditya Chopra's faith in newcomers following Saiyaara's success. He also discusses Tehran's OTT release on Zee5 and hopes for theatres to coexist with digital platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-suhana-khan-enjoy-movie-night-with-abram-watch-2769393-2025-08-11",
      "headline": "Ananya Panday, Suhana Khan enjoy movie night with AbRam. WatchAnanya Panday and Suhana Khan recently stepped out for a movie night in Mumbai with Suhana's younger brother, AbRam. A video from their outing has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-aishwarya-rai-pose-for-fan-selfies-latest-holiday-2769350-2025-08-11",
      "headline": "Abhishek and Aishwarya Bachchan pose for selfies with fans in new videoAbhishek Bachchan and Aishwarya Rai, who recently returned from a family holiday, clicked selfies with fans at the Mumbai airport. Several fans have shared the photos online. The couple had gone on a holiday with their daughter Aaradhya. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-advance-booking-storm-rajinikanth-on-track-for-rs-100-crore-day-1-rampage-2769380-2025-08-11",
      "headline": "Coolie advance booking storm: Rajinikanth on track for Rs 100 crore Day 1 rampageRajinikanth's 'Coolie' is rewriting box office history even before release, raking in over Rs 51 crore in Day 1 pre-sales and eyeing a Rs 100 crore global opening - a record-breaking storm for Tamil cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-director-lokesh-kanagaraj-reacts-to-fan-theories-on-sci-fi-time-travel-rajinikanth-film-2766051-2025-08-11",
      "headline": "Lokesh Kanagaraj reacts to fan theories on sci-fi and time travel in CoolieWith theories around time travel and a sci-fi twist doing the rounds, director Lokesh Kanagaraj has maintained suspense around the plot of 'Coolie'. The film, which stars Rajinikanth in a mass action role, is set for release on August 14 and will clash with 'War 2' at the box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-angry-fan-interrupting-speech-war-2-event-hyderabad-2769353-2025-08-11",
      "headline": "I'll stop and leave: Jr NTR snaps at fan interrupting his speech at War 2 eventJr NTR lost his cool after a fan interrupted his speech by continuously screaming at 'War 2' event. He snapped at him and asked him to stay silent till he finished his speech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/love-war-sanjay-leela-bhansali-plans-schedule-british-era-army-base-madhya-pradesh-2769354-2025-08-11",
      "headline": "Bhansali to shoot Love & War at British-era Army base in Madhya Pradesh: SourceSanjay Leela Bhansali's 'Love & War' to begin shooting in Madhya Pradesh. A source told India Today that the 15-day schedule is expected to begin soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-warns-crowd-to-make-way-for-him-and-niece-ayat-at-event-2769345-2025-08-11",
      "headline": "Salman Khan warns crowd to make way for him and niece Ayat at event. Watch videoActor Salman Khan took on the role of a protective uncle for his niece, Ayat Sharma. He held her hand and even carried her in his arms as they attended an event together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zaheer-iqbal-surprises-sonakshi-sinha-with-new-age-ddlj-train-prank-2769344-2025-08-11",
      "headline": "Zaheer Iqbal surprises Sonakshi Sinha with new age DDLJ train prank. WatchSonakshi Sinha and husband Zaheer Iqbal shared a hilarious train prank video, with Sonakshi calling it a \"new age DDLJ\" moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-meets-fans-on-road-click-selfies-amid-saiyaara-success-aneet-padda-watch-video-2769325-2025-08-11",
      "headline": "Ahaan Panday meets fans on road, click selfies amid Saiyaara's success. WatchActor Ahaan Panday is enjoying the success of his latest hit 'Saiyaara'. Amid all the love, the actor recently met fans on the roads and even clicked selfies with them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/lara-dutta-gives-shout-out-deanne-panday-ahaan-saiyaara-success-2769301-2025-08-11",
      "headline": "Lara Dutta gives shout-out to Deanne Panday after son Ahaan's Saiyaara successActor Lara Dutta commended Deanne Panday for her steadfast support and commitment as a mother to son Ahaan Panday, emphasising her devotion to both family and friends. Ahaan debuted in Bollywood with 'Saiyaara'."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/pick-up-stray-dogs-sterilise-do-not-release-supreme-courts-no-compromise-order-for-delhi-ncr-bodies-2769396-2025-08-11",
      "headline": "Top court orders immediate capture of Delhi-NCR stray dogs, warns against interferenceThe Supreme Court ordered Delhi-NCR authorities to urgently catch, sterilise, and permanently relocate stray dogs to shelters, warning that any individual or organisation obstructing the process would face legal action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-bloc-opposition-protest-election-commission-rahul-gandhi-detained-parliament-mahua-moitra-2769438-2025-08-11",
      "headline": "Rahul Gandhi detained, Mahua Moitra faints at chaotic 'vote chori' protest  Live UpdatesNearly 300 Opposition MPs, led by Rahul Gandhi, marched to the Election Commission in Delhi on Monday over alleged electoral malpractices, but the protest was blocked by the Delhi Police, resulting in several detentions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/why-pakistan-army-chief-asim-munir-chose-us-for-nuclear-threat-india-trump-ties-operation-sindoor-south-asia-2769399-2025-08-11",
      "headline": "Why Asim Munir chose the US for his nuclear threat to half the worldPakistan Army chief Asim Munir's nuclear threat from US soil signals more than bluster. It's a calculated move to play to domestic hardliners, try to unsettle India, and leverage warming ties with Donald Trump's Washington DC, just when India-US ties have hit a rough patch. It came on the day the US dropped the atom bomb on Nagasaki, 80 years ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/chatgpt-5-hints-ai-surge-finally-slowing-but-dont-get-too-happy-humans-we-are-still-cooked-2769368-2025-08-11",
      "headline": "ChatGPT 5 hints AI surge finally slowing but humans are still cookedIf ChatGPT 5 is any indication, then it seems the era of \"transformers\" is over. What comes next in AI is not yet certain. Except that it is already smarter than humans in many aspects.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/borrowed-cash-from-a-friend-you-may-end-up-paying-income-tax-penalty-2768449-2025-08-11",
      "headline": "Borrowed cash from a friend? You may end up paying income tax penaltyThe income tax department is strict when it comes to large cash transactions. Whether it's taking a loan, repaying one, or even making donations, there are limits you need to follow. Go beyond those, and you could face a penalty equal to the entire amount involved."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/bihar/story/bihar-patna-electoral-roll-revision-rohtas-residential-certificate-cat-dog-tractor-2769320-2025-08-11",
      "headline": "Now 'Cat Kumar', son of 'Catty Boss', applies for ID proof in BiharA 'Cat Kumar', son of 'Catty Boss', applied for a residential certificate in Bihar, leading to a police case and investigation. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mob-vandalises-tomb-outside-mausoleum-in-ups-fatehpur-claiming-complex-was-built-on-top-of-temple-2769367-2025-08-11",
      "headline": "Mob vandalises tomb outside UP mausoleum, claims it is built on top of temple A group of people from a Hindu organisation vandalised a tomb outside a mausoleum in Uttar Pradesh's Fatehpur, claiming the complex was built on top of temple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/age-of-consent-for-sex-india-18-16-supreme-court-pocso-act-sexual-activity-rape-law-adolescent-romance-2768523-2025-08-11",
      "headline": "Age of consent for sex: Why a 160-year-old debate is still ragingThe government told the Supreme Court that bringing down the age of consent for sex from 18 would make girls vulnerable to predators. In 1860, the IPC criminalised sex with a girl under 10. The age of consent was increased to 14 and 16, in 1925 and 1940, respectively. Why the age of consent, set at 18 in 2013, is being debated?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-amd-us-china-semiconductor-chip-sales-agreement-explained-2769358-2025-08-11",
      "headline": "From ban to profit sharing: Inside US deal with Nvidia, AMD on China chip salesThe deal makes the US a direct financial beneficiary of sensitive technology sales to a geopolitical rival. This article looks into the key details of this first-of-its-kind agreement."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-attack-on-christian-priests-nuns-in-odisha-feeds-into-a-wider-trend-2768903-2025-08-10",
      "headline": "How attack on Christian priests, nuns in Odisha feeds into a wider trendEarlier, two Catholic nuns from Kerala were arrested in Chhattisgarh for alleged human trafficking and forced religious conversions, sparking nationwide outrage"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/make-in-india-made-in-china-manufacturing-economics-trade-deficit-report-pm-modi-geopolitical-2769387-2025-08-11",
      "headline": "Why 'Make in India' still depends so much on 'Made in China'When Prime Minister Narendra Modi launched the 'Make in India' programme in 2014, it was meant to transform India into a global manufacturing hub, create millions of jobs, and reduce dependence on imports, especially from China. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/gujarat-man-and-lion-startle-each-other-after-chance-encounter-junagadh-viral-video-2769403-2025-08-11",
      "headline": "Gujarat man and lion startle each other after chance encounter. Video goes viralA man had a rare close encounter with a lion near a cement factory in Gujarat late at night. A video of the moment has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-advance-booking-storm-rajinikanth-on-track-for-rs-100-crore-day-1-rampage-2769380-2025-08-11",
      "headline": "Coolie advance booking storm: Rajinikanth on track for Rs 100 crore Day 1 rampageRajinikanth's 'Coolie' is rewriting box office history even before release, raking in over Rs 51 crore in Day 1 pre-sales and eyeing a Rs 100 crore global opening - a record-breaking storm for Tamil cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/asim-munir-compares-india-to-mercedes-pakistan-to-dump-truck-internet-reacts-2769473-2025-08-11",
      "headline": "Asim Munir compares India to Mercedes, Pakistan to dump truck. Self-goal, says InternetAsim Munir's 'India is a Mercedes and Pakistan a dump truck' remark had the internet calling it a self-goal and questioning why Pakistan's Army Chief made such a comment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/cannot-reserve-vacancies-for-men-supreme-court-slams-arbitrary-male-female-quota-army-jag-merit-based-appointment-2769341-2025-08-11",
      "headline": "Can't reserve posts for men: Top court slams male-female quota in Army's legal branchThe Supreme Court called the 2:1 male-to-female reservation in the Army's JAG branch arbitrary and unconstitutional, ruling that recruitment must be gender-neutral and based on merit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/i-attended-a-fake-wedding-party-in-delhi-and-this-is-how-it-went-2769336-2025-08-11",
      "headline": "I attended a fake wedding party in Delhi, and this is how it wentLehengas and sarees? Check. Mehndi artist? Check. Marigolds and fairy lights? Check. An elaborate food spread? Umm… not quite. Here's a peek inside a fake wedding event in Delhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/beaten-bite-marks-on-body-video-shows-assault-on-toddler-at-noida-day-care-2769264-2025-08-11",
      "headline": "Beaten, bite marks on body: Video shows assault on toddler at Noida day careA 15-month-old girl was assaulted by a maid at a day care centre in Noida after she was crying continuously. The incident was caught on CCTV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-has-succeeded-haunting-final-message-of-gaza-journalist-killed-in-strike-2769409-2025-08-11",
      "headline": "Israel has succeeded: Haunting final message of Gaza journalist killed in strikeGaza journalist Anas al-Sharif, who was killed in an Israeli strike on Sunday, left behind a will urging the world not to abandon besieged Gaza and the Palestinian people. The will was shared on X after his death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/latest-auto-news/story/tesla-opens-new-delhi-showroom-tesla-aerocity-worldmark-3-showroom-tesla-model-y-2769310-2025-08-11",
      "headline": "First look of Tesla's new showroom in Delhi's AerocityTesla has strengthened its India presence by opening a second showroom in Delhi's Aerocity, following its Mumbai debut in July 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/why-urban-hobosexuality-is-quite-a-thing-in-india-or-at-least-becoming-one-2768431-2025-08-10",
      "headline": "Why urban hobosexuality is quite a thing in India now (or at least becoming one)Hobosexuality refers to a pattern where someone enters a romantic relationship primarily for housing or financial support, often under the guise of a deep emotional connection."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-priest-orders-veg-meal-for-family-served-chicken-on-sawans-last-day-2769318-2025-08-11",
      "headline": "UP man finds meat piece in veg meal ordered online, restaurant admits mix-upA man in Uttar Pradesh alleged that his online vegetarian meal order was mistakenly served with chicken on the last day of Sawan during Raksha Bandhan celebrations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-share-price-multibagger-stock-market-gains-investors-rally-explained-2769295-2025-08-11",
      "headline": "NSDL turns into a multibagger for investors: Will it continue to gain?Issued at Rs 800, the stock opened at Rs 880 and has raced to Rs 1,300.30, minting massive gains for early institutional investors and retail shareholders alike.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-mp-shares-harrowing-experience-after-air-india-flight-diverted-to-chennai-says-saved-by-luck-and-skill-2769236-2025-08-11",
      "headline": "Congess MP claims runway scare after Air India flight diverted, airline clarifiesCongress MP KC Venugopal said that the passengers on board AI 2455 operating from Thiruvananthapuram to Delhi were saved by sheer luck and skill of the pilots after the flight was diverted to Chennai following a reported technical glitch.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/code-of-silence-review-well-woven-crime-series-with-emotional-depth-lionsgateplay-2769414-2025-08-11",
      "headline": "Code of Silence review: Well-woven crime series with emotional depthRelease Date:Fri Aug 01, 2025Code of Silence series review: 'Code of Silence' on LionsgatePlay narrates the emotional journey of a hearing-impaired protagonist who is part of a police investigation. Is the show worth your time? Here is our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-craze-in-us-man-confused-over-avenger-like-popularity-of-rajini-indians-give-him-a-rajinikanth-power-class-2769499-2025-08-11",
      "headline": "US man confused over Coolie craze, Indians give him a Rajinikanth power class When a US man stumbled upon sold-out 'Coolie' shows and sky-high ticket prices, he turned to X for answers, and Rajinikanth fans happily schooled him on the superstar's God-like craze."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-advance-booking-update-detailed-report-hrithik-jr-ntr-spy-saga-sells-over-67000-tickets-for-day-1-2769463-2025-08-11",
      "headline": "War 2 advance booking: Hrithik-Jr NTR's spy saga sells over 67,000 tickets for Day 1The advance booking for 'War 2' opened recently, and the spy saga has been performing decently so far. Starring Hrithik Roshan and Jr NTR in the lead, the film is yet to see a massive hike in its sales in Andhra Pradesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hansika-motwani-lessons-she-didnt-ask-for-birthday-post-amid-divorce-rumours-2769464-2025-08-11",
      "headline": "Hansika Motwani's cryptic birthday post hints at new lessons amid divorce rumoursOn her 34th birthday, Hansika Motwani shared a heartfelt Instagram story hinting at unforeseen challenges. In a cryptic post, she wrote about learning lessons that she didn't ask for amid growing rumours about her divorce from Sohael Khaturiya."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-enzo-maresca-confident-chelsea-thrash-ac-milan-perfect-pre-season-2769502-2025-08-11",
      "headline": "Chelsea boss Maresca upbeat about Premier League campaign after fine pre-seasonChelsea boss Enzo Maresca is upbeat about the upcoming Premier League campaign as the Blues defeated AC Milan to cap off a fine pre-season. Chelsea defeated Milan 4-1 on Sunday, August 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-on-winning-womens-world-cup-2025-at-home-2769484-2025-08-11",
      "headline": "Harmanpreet Kaur sets sights on World Cup glory at home: Want to break barriersIndia women's cricket team captain Harmanpreet Kaur has set her sights on ending the team's ICC Trophy drought by winning the upcoming World Cup at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-dilip-vengsarkar-backs-gautam-gambhir-oval-pitch-curator-spat-hayden-2769429-2025-08-11",
      "headline": "Vengsarkar backs Gambhir in Oval curator spat, hits out at Hayden's remarkDilip Vengsarkar came in support of Gautam Gambhir for his spat with Oval pitch curator, Lee Fortis, during the England tour. Vengsarkar slammed Matthew Hayden for his remark about the spat between Gambhir and Fortis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-missing-hardik-pandya-in-tests-says-craig-mcmillan-2769453-2025-08-11",
      "headline": "India are missing a player like Hardik Pandya in Tests: Craig McMillanNew Zealand women's cricket team head coach Craig McMillan feels India are missing someone like Hardik Pandya in their Test line up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-nca-fitness-assessment-asia-cup-suryakumar-yadav-reports-2769428-2025-08-11",
      "headline": "Hardik Pandya set to undergo fitness assessment in NCA ahead of Asia CupHardik Pandya is set for a crucial fitness test at the NCA ahead of Asia Cup 2025, with selectors closely monitoring his readiness and Suryakumar Yadav's recovery to strengthen India's white-ball hopes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-dilip-vengasarkar-on-jasprit-bumrah-and-ipl-2769404-2025-08-11",
      "headline": "Wish Bumrah played all Tests, who remembers wickets taken in IPL?: VengasarkarFormer India batter and chief selector Dilip Vengasarkar said that Jasprit Bumrah should've played all the Tests in the recently concluded five-match series against England as nobody remembers IPL performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-arne-slot-community-shield-loss-crystal-palace-2769384-2025-08-11",
      "headline": "Liverpool boss Arne Slot refuses to panic after Community Shield lossLiverpool boss Arne Slot doesn't feel there is a need to panic after their penalty shootout loss to Crystal Palace in the Community Shield on Sunday, August 10. Liverpool let the lead slip twice during the game and lost 2-3 in the shoot-out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-csk-fan-knees-witty-response-ipl-2026-watch-video-2769359-2025-08-11",
      "headline": "Watch: MS Dhoni's hilarious response to fan's request to play IPL 2026MS Dhoni's witty reply to a fan's IPL 2026 request sparked laughter, while his future remains undecided. The CSK legend says he'll take time until December before making the big call."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rumesh-pathirage-sri-lanka-javelin-record-cricket-to-world-championships-neeraj-chopra-2769339-2025-08-11",
      "headline": "Cricket's loss, javelin's gain: Sri Lanka's Rumesh, the new kid on the blockIn Bhubaneswar on Sunday, Rumesh Pathirage's 86.50m throw shattered Sri Lanka's national record and confirmed his place at the World Championships. Having traded the cricket ball for the javelin, the 22-year-old is now hurtling onto the world stage as a rising force from the island nation with his eyes set on Olympic glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-call-sim-card-mix-up-chhattisgarh-man-rajat-patidar-2769315-2025-08-11",
      "headline": "Never imagined would speak to Virat Kohli: Fans recall Patidar sim mix-up experienceA Chhattisgarh man, named Manish Bisi, received calls from Virat Kohli and AB de Villiers after a SIM card mix-up with RCB captain Rajat Patidar. The surreal experience left Manish and his friend Khenraj thrilled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-u20-womens-football-afc-asian-cup-2026-qualification-reward-aiff-2769296-2025-08-11",
      "headline": "AIFF announces cash prize for U-20 women's team after Asia Cup qualificationIndia's U20 women's football team secured their first AFC U-20 Women's Asian Cup qualification since 2006, topping Group D unbeaten. The AIFF have decided to reward the team for their effort by giving a cash prize to the players. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-arne-slot-community-shield-loss-crystal-palace-2769384-2025-08-11",
      "headline": "Liverpool boss Arne Slot refuses to panic after Community Shield lossLiverpool boss Arne Slot doesn't feel there is a need to panic after their penalty shootout loss to Crystal Palace in the Community Shield on Sunday, August 10. Liverpool let the lead slip twice during the game and lost 2-3 in the shoot-out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-csk-fan-knees-witty-response-ipl-2026-watch-video-2769359-2025-08-11",
      "headline": "Watch: MS Dhoni's hilarious response to fan's request to play IPL 2026MS Dhoni's witty reply to a fan's IPL 2026 request sparked laughter, while his future remains undecided. The CSK legend says he'll take time until December before making the big call."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rumesh-pathirage-sri-lanka-javelin-record-cricket-to-world-championships-neeraj-chopra-2769339-2025-08-11",
      "headline": "Cricket's loss, javelin's gain: Sri Lanka's Rumesh, the new kid on the blockIn Bhubaneswar on Sunday, Rumesh Pathirage's 86.50m throw shattered Sri Lanka's national record and confirmed his place at the World Championships. Having traded the cricket ball for the javelin, the 22-year-old is now hurtling onto the world stage as a rising force from the island nation with his eyes set on Olympic glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-call-sim-card-mix-up-chhattisgarh-man-rajat-patidar-2769315-2025-08-11",
      "headline": "Never imagined would speak to Virat Kohli: Fans recall Patidar sim mix-up experienceA Chhattisgarh man, named Manish Bisi, received calls from Virat Kohli and AB de Villiers after a SIM card mix-up with RCB captain Rajat Patidar. The surreal experience left Manish and his friend Khenraj thrilled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-u20-womens-football-afc-asian-cup-2026-qualification-reward-aiff-2769296-2025-08-11",
      "headline": "AIFF announces cash prize for U-20 women's team after Asia Cup qualificationIndia's U20 women's football team secured their first AFC U-20 Women's Asian Cup qualification since 2006, topping Group D unbeaten. The AIFF have decided to reward the team for their effort by giving a cash prize to the players. \r\n\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}