{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-158-points-higher-nifty-settles-above-25000-adani-ports-down-3-percent-2745482-2025-06-24",
      "headline": "Sensex ends 158 points higher, Nifty settles above 25,000; Adani Ports down 3%The S&P BSE Sensex added 158.32 points to close at 82,055.11, while the NSE Nifty50 added 72.45 points to end at 25,044.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-down-why-reason-sensex-nifty-fall-iran-israel-missile-attack-us-president-donald-trump-2745451-2025-06-24",
      "headline": "Stock market down 1%: Why did Sensex, Nifty fall after early gains?The S&P BSE Sensex was up 261.25 points to 82,158.04, while the NSE Nifty50 was up 96.85 points to 25,068.75 as of 2:33 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/labubu-mania-how-a-quirky-doll-made-pop-mart-a-global-giant-ceo-wang-ning-among-china-top-10-richest-2745398-2025-06-24",
      "headline": "Labubu mania: How a quirky doll made Pop Mart a global giantAt the heart of this success is Pop Mart's 38-year-old founder Wang Ning, now one of China's top 10 richest people. As of June 2025, he's worth $22.7 billion, all thanks to Labubu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-agm-2025-gautam-adani-unveils-big-investment-plans-2745344-2025-06-24",
      "headline": "Adani AGM 2025: Gautam Adani denies US bribery charges, asserts group's clean recordAhead of its AGM, Adani Airports Holdings Limited (AAHL) on Tuesday confirmed securing $1 billion in project finance for Mumbai International Airport Ltd (MIAL), which operates the Chhatrapati Shivaji Maharaj International Airport (CSMIA)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/your-ctc-is-lying-to-you-ca-on-salary-illusions-most-people-miss-2745338-2025-06-24",
      "headline": "Your CTC is lying to you: CA points out salary details most people overlookThe post is part caution and part financial literacy reminder. It challenges employees to take ownership of their earnings and not just celebrate the illusion of a big CTC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/oil-prices-dip-after-iran-israel-ceasefire-indian-stocks-mixed-gains-rbi-rate-cut-2745313-2025-06-24",
      "headline": "Explained: Why are oil sector stocks rising today?The ceasefire announcement made by US President Donald Trump triggered a decline in oil prices, which had experienced a prior surge due to geopolitical tensions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-enviro-infra-engineers-share-price-jumped-11-in-early-trade-2745296-2025-06-24",
      "headline": "Explained: Why Enviro Infra Engineers share price jumped 11% in early tradeAt around 9:48 am, the company's stock was trading at Rs 233.50 apiece on the Bombay Stock Exchange (BSE), up 10.43% from the previous close."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-900-points-why-is-the-stock-market-rising-today-2745287-2025-06-24",
      "headline": "Sensex jumps 900 points: Why is the stock market rising today?At around 9:22 am, the S&P BSE Sensex was up 869.86 points at 82,766.65, while the NSE Nifty50 jumped 262.75 points to 25,234.65. Broader markets also mirrored the upbeat sentiment, with volatility declining across the board."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-rally-sensex-jumps-800-points-nifty-goes-past-25200-adani-ports-up-4-percent-2745277-2025-06-24",
      "headline": "Sensex jumps 800 points. Nifty goes past 25,200; Adani Ports up 4%The S&P BSE Sensex was up 576.42 points to 82,473.21, while the NSE Nifty50 gained 194.05 points to 25,165.95 as of 9:35 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-higher-iran-israel-ceasefire-oil-prices-indian-markets-2745257-2025-06-24",
      "headline": "Sensex and Nifty to open higher as Iran-Israel ceasefire eases oil pricesThe Gift Nifty futures were trading at 25,297.50 as of 8:10 a.m., indicating that the Nifty50 will open above its previous close of 24,971.9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-iran-israel-ceasefire-sensex-nifty-dixon-tech-enviro-infra-tata-motors-adani-energy-2745255-2025-06-24",
      "headline": "Stocks to watch today: Dixon Tech, Enviro Infra, Tata Motors, Adani EnergyThe benchmark indices fell over half a percent on Monday. However, reports suggesting a possible ceasefire between Iran and Israel could help bring some stability to the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/israel-iran-conflict-will-irans-threat-to-close-the-hormuz-strait-affect-india-2745114-2025-06-23",
      "headline": "Israel-Iran conflict: Will Iran's threat to close the Hormuz Strait affect India?This episode of the Super 6 programme discusses the potential impact on India if Iran closes the Strait of Hormuz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-rs-1-crore-to-rs-25-lakh-in-20-years-how-inflation-quietly-shrinks-your-wealth-2745051-2025-06-23",
      "headline": "From Rs 1 crore to Rs 25 lakh: How inflation quietly shrinks your wealthUnderstanding the impact of inflation on wealth and the necessity of strategic investing to preserve financial security over time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/90-percent-lose-in-indian-real-estate-expert-explains-what-the-top-1-percent-do-instead-2745007-2025-06-23",
      "headline": "90% lose in real estate, expert explains what the top 1% do insteadA real estate advisor explains why the majority of buyers in India are not profiting from real estate, while a select few succeed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-511-points-lower-nifty-below-25000-it-stocks-down-hcl-infosys-2744997-2025-06-23",
      "headline": "Sensex ends 511 points lower, Nifty settles below 25,000; HCLTech down 2%The S&P BSE Sensex fell by 511.38 points to close at 81,896.79, while the NSE Nifty50 lost 140.50 points to end at 24,971.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/still-earning-275-percent-in-your-savings-account-here-is-a-smarter-option-invest-in-liquid-funds-2744937-2025-06-23",
      "headline": "Still earning 2.75% in your savings account? Here's a smarter optionLiquid funds serve as the middle ground between a savings account and fixed deposits, but with more flexibility and usually better returns. Over the past one and three years, liquid funds have delivered average annualised returns of 7.3% and 7%, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/3-ipos-upcoming-june-24-open-tuesday-check-details-price-band-allotment-gmp-kalpataru-ellenbarrie-globe-civil-2744984-2025-06-23",
      "headline": "3 IPOs to open tomorrow: Check details of Kalpataru, Ellenbarrie, Globe CivilThe combined size of these IPOs stands at over Rs 2,500 crore, and all three are expected to list on the stock exchanges on July 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/explained-why-millions-of-poor-indian-households-still-rely-on-moneylenders-2744922-2025-06-23",
      "headline": "Explained: Why many low-income Indian households still rely on moneylendersDespite rising financial access, millions of Indian households still rely on informal loans. Gaps in formal credit, especially for low-income and self-employed borrowers, keep moneylenders relevant and often unavoidable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-6-lakh-in-taxes-on-a-rs-13-lakh-car-ca-reveals-the-hidden-cost-2744873-2025-06-23",
      "headline": "Rs 6 lakh in taxes on a Rs 13 lakh car? CA reveals the hidden costUpgrading or buying a new car used to be a moment of joy for many middle-class families, but today, it's overshadowed by the heavy financial pressure it brings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/strait-of-hormuz-closure-iran-parliament-israel-us-attack-crude-oil-impact-price-rise-india-world-impact-2744885-2025-06-23",
      "headline": "Will Iran close Hormuz Strait? What it means for oil prices in India and worldThe Strait of Hormuz is a narrow waterway connecting the Persian Gulf with the Arabian Sea. It is one of the most important oil transport routes in the world. Nearly 20% of all global crude oil passes through this strait."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/debt-disguised-as-achievement-financial-analyst-on-growing-emi-trap-2744876-2025-06-23",
      "headline": "Debt disguised as achievement: Financial expert on India's deepening EMI trapA rising income shouldn't come at the cost of peace of mind. Financial freedom means having choices, not just things. And that starts with avoiding EMIs that quietly chip away at your future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-5-common-errors-in-pre-filled-forms-and-how-to-fix-it-2744833-2025-06-23",
      "headline": "Filing ITR? 5 common errors in pre-filled forms and how to fix itA pre-filled Income Tax Return (ITR) form is a partially completed form provided by the Income Tax Department to make filing easier for taxpayers. These forms are automatically filled with details taken from trusted sources such as your PAN, Aadhaar, Form 16, and bank data from Form 26AS and the AIS."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/explained-how-to-vacation-without-the-financial-hangover-2744803-2025-06-23",
      "headline": "Explained: How to vacation without the financial hangoverA dream vacation should leave you with great memories, not months of financial stress. With a little planning, you can enjoy the trip and return home without breaking your budget."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-markets-slide-after-us-iran-tensions-buy-the-dip-or-wait-it-out-2744790-2025-06-23",
      "headline": "Stock markets slide amid US-Iran tensions: Buy the dip or wait it out?The Nifty 50 fell 257.25 points to 24,855.15, and the BSE Sensex was down 863.78 points to 81,544.39 as of 9:49 am. Broader indices mirrored the decline, with both mid- and small-cap indices slipping sharply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-600-points-why-is-the-stock-market-down-falling-today-2744774-2025-06-23",
      "headline": "Sensex tumbles 700 points: Why is the stock market falling today?At around 9:19 am, the BSE Sensex was down 580 points, trading at 81,828.11, while the NSE Nifty50 fell over 175 points to 24,937.25. Broader market indices mirrored the slide, and volatility indicators jumped sharply, signalling a bumpy trading session ahead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-tanks-500-points-nifty-below-25000-infosys-down-2-percent-it-stocks-fall-2744771-2025-06-23",
      "headline": "Sensex, Nifty sink in early trade as US-Iran conflict rattles investorsThe S&P BSE Sensex was down by 791.58 points to 81,616.59, while the NSE Nifty lost 244.25 points to 24,868.15 as of 9:53 am."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/arisinfra-solutions-ipo-allotment-status-out-how-to-check-latest-gmp-listing-date-bse-link-intime-india-2744763-2025-06-23",
      "headline": "Arisinfra Solutions IPO allotment out: Here's how to check status and latest GMPInvestors who took part in the public issue can check their allotment status online through the Bombay Stock Exchange (BSE) website or the official registrar for the IPO, Link Intime India Private Ltd."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-june-23-trading-setup-sensex-nifty-crash-today-us-attack-iran-nse-bse-trading-key-levels-2744747-2025-06-23",
      "headline": "Stock market opening: Sensex, Nifty to crash today after US attack on Iran?The Gift Nifty futures, as of 8:10 am, were trading at 25,015, indicating a lower opening compared to the previous close of 25,112.4. Benchmark indices rose about 1.6% last week, driven by gains in financial stocks, which provided some cushion against the geopolitical tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-23-nse-bse-trading-iran-israel-share-market-news-tcs-waree-hal-bel-makemytrip-2744743-2025-06-23",
      "headline": "Stocks to watch on June 23: TCS, Waree Renewable, HAL, BEL, MakeMyTripReports suggest the United States may have bombed a nuclear facility in Iran, triggering fresh concerns over the conflict with Israel. These developments could impact market sentiment on Dalal Street at the start of the week."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-oil-imports-strait-of-hormuz-iran-israel-conflict-us-strikes-nuclear-sites-2744663-2025-06-22",
      "headline": "Why India may not feel the heat if Iran closes Strait of HormuzIndia, which has traditionally sourced its oil from the Middle East and more recently from Russia, is unlikely to see a major impact on its energy reserves if Iran decides to shut down the vital oil corridor of the Strait of Hormuz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/digital-news-publishers-body-seeks-copyright-protection-in-ai-training-practices-2744532-2025-06-22",
      "headline": "Generative AI must pay for using copyright content, says DNPAThe Digital News Publishers Association said it \"firmly believes that utilising the content of digital news publishers, without consent, for AI training and subsequent generative AI applications, such as search assistance and information purposes, constitutes an infringement of copyright.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/two-new-gst-levies-health-and-clean-energy-may-replace-compensation-cess-but-at-what-cost-2744140-2025-06-21",
      "headline": "Two new GST levies may replace compensation cess, but at what cost?Health and Clean Energy levies may replace the Compensation Cess, but tax experts warn of rising compliance burdens and fresh coordination challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-debut-india-showroom-mumbai-july-china-made-model-y-ev-suvs-report-2743896-2025-06-20",
      "headline": "Tesla to open first showroom in Mumbai next month, sell China-made EVs: ReportTesla is set to open its first showroom in Mumbai next month and sell Model Y rear-wheel-drive SUVs shipped from Tesla's China factory as the company seeks expansion in the world's third-biggest automobile market, Bloomberg News reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-growth-lies-in-its-heartland-adani-enterprises-pranav-adani-2743714-2025-06-20",
      "headline": "India's growth lies in its heartland: Adani Enterprises Director Pranav AdaniThe remarks came as part of a broader statement of intent from the newly launched Chintan Research Foundation, which Adani said would focus on three critical areas: climate change, trade, and geopolitics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-1046-points-higher-nifty-above-25100-airtel-jumps-3-percent-2743705-2025-06-20",
      "headline": "Sensex ends 1,046 points higher, Nifty above 25,100; Bharti Airtel jumps 3%The S&P BSE Sensex jumped 1,046.30 points to end at 82,408.17, while the NSE Nifty50 added 319.50 points to close at 25,112.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-lifestyle-inflation-fuelling-debt-among-indias-middle-class-2743647-2025-06-20",
      "headline": "Is lifestyle inflation fuelling debt among India's middle class?Lifestyle inflation is no longer a silent threat. It is reshaping how India's middle class earns, spends and saves. It fuels debt, shrinks buffers and puts long-term financial goals at risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/early-retirement-age-40-savings-needed-corpus-inflation-fire-trend-financial-independence-2743639-2025-06-20",
      "headline": "Planning to retire at 40? Here's what it really takesThe idea of retiring at 40 sounds almost rebellious. Stop working just when most people are hitting their career peak, and live the rest of your life on your own terms. No bosses, no Monday blues, no waiting for the weekend. But can you do it? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/financial-clarity-money-management-wealth-mindset-abhishek-walia-2743570-2025-06-20",
      "headline": "CA explains how Rs 80,000 per month income can beat Rs 2 lakhThe CA's insights suggest that intentional financial management is key to wealth building. A clear financial purpose can transform how resources are allocated, leading to sustainable growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rbi-eases-infrastructure-financing-norms-sensex-nifty-rise-2743540-2025-06-20",
      "headline": "Sensex jumps over 1,100 points: Why is the stock market rising today?The primary catalyst for this rally was the RBI's announcement concerning infrastructure financing. The central bank has implemented new norms that relax provisioning requirements for under-construction infrastructure projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/power-finance-corporation-share-price-rise-jumps-6-percent-today-reason-why-rbi-update-project-finance-2743503-2025-06-20",
      "headline": "Power Finance Corporation share price jumps 6% today. Here's whyWhile PFC has faced some pressure in recent months, with its stock falling 9.14% in the last six months and 14.44% over the past year, Friday's gain marks a strong rebound following the regulatory update."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/fight-like-sita-but-dont-use-her-name-why-janaki-makes-censor-board-uncomfortable-2745457-2025-06-24",
      "headline": "Fight like Sita but don't use her name: Why Janaki makes censor board uncomfortable?Who gets to carry Sita's name, and who decides that? Why has a film unsettled the censor board just because the protagonist is named Janaki? As mythology, memory and modern storytelling collide, we discuss if a woman in today's India can't reclaim her story if she's named 'Janaki' - after a Goddess who herself stands as a symbol of resilience and fighting back. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/mithoon-highest-paid-label-glad-fraternity-is-opening-up-to-new-avenues-saiyaara-2745481-2025-06-24",
      "headline": "Mithoon reacts to highest-paid label: Glad fraternity is opening up to new avenuesSinger and composer Mithoon opened up about claims of demanding Rs 25 crore for an album. In an exclusive chat with India Today, the composer did not deny the claims, instead, he appreciated the industry for understanding the worth of the musicians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-babu-daughter-niharika-konidela-divorce-chaitanya-jonnalagadda-marriage-was-our-mistake-2745474-2025-06-24",
      "headline": "Actor Naga Babu discusses daughter Niharika's divorce: Her marriage was our mistakeActor Naga Babu recently opened about his daughter Niharika Konidela's divorce from Chaitanya Jonnalagadda. He said that his daughter's marriage was a mistake on their part."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-chasing-aanand-l-rai-tere-ishk-mein-finally-ticked-that-box-2745366-2025-06-24",
      "headline": "Kriti Sanon on chasing Aanand L Rai for Tere Ishk Mein: Finally ticked that boxActor Kriti Sanon recently expressed excitement about working with director Aanand L Rai in the upcoming love story 'Tere Ishk Mein' (2025). The film is considered to be a spiritual sequel to Rai's romance-drama 'Raanjhana' (2013). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-family-man-3-manoj-bajpayee-returns-srikant-tiwari-fresh-mission-raj-and-dk-2745468-2025-06-24",
      "headline": "The Family Man 3: Manoj Bajpayee returns as Srikant Tiwari with fresh missionManoj Bajpayee is set to return as Srikant Tiwari in Prime Video's popular series, 'The Family Man 3'. The makers shared the first-look poster today, June 24. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-game-changer-45-hours-long-producer-dil-raju-on-film-flopping-2745446-2025-06-24",
      "headline": "Game Changer producer blames himself for film's failure: I have 100 per cent regretTelugu producer Dil Raju opened up about the missteps behind Ram Charan's 'Game Changer'. He cited the film's extended runtime as the reason and expressed his regret over not delivering a success for Ram Charan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brad-pitt-fitness-driving-skills-f1-film-joseph-kosinski-2745430-2025-06-24",
      "headline": "What did Brad Pitt do to look fit for F1? Director Joseph Kosinski answersHollywood star Brad Pitt demonstrated exceptional fitness and driving skills for the 'F1' film. His dedication impressed director Joseph Kosinski and co-producer Lewis Hamilton, raising expectations for the movie's release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shabana-azmi-shares-pic-with-javed-akhtar-2745417-2025-06-24",
      "headline": "Shabana Azmi shares pic with Javed Akhtar, says he's oblivious to the scenic beautyShabana Azmi shared a candid photo of Javed Akhtar deeply focused on writing, playfully hinting at being the \"scenic beauty\" he missed. Fans loved the sweet moment and praised the couple's strong bond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rachel-zegler-snow-white-backlash-says-i-dont-choose-victim-mindset-2745411-2025-06-24",
      "headline": "Rachel Zegler on Snow White backlash: I don't choose victim mindset'Snow White' actor Rachel Zegler opens up about the recent online backlash, the pressures of the industry, and her stance on global humanitarian issues. She believes happiness is a choice, and chooses to focus on positivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-athiya-praises-kl-rahul-as-he-hits-century-at-headingley-2745394-2025-06-24",
      "headline": "Suniel Shetty, Athiya praises KL Rahul as he hits century at HeadingleyKL Rahul's century at Headingley earned him praise from wife Athiya Shetty and father-in-law Suniel Shetty. Both shared photos of him on their Instagram Stories along with heartfelt messages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditya-roy-kapur-surprises-fans-live-singing-metro-in-dino-album-launch-2745350-2025-06-24",
      "headline": "Aditya Roy Kapur channels Aashiqui 2 vibes at Metro In Dino album launch. WatchAditya Roy Kapur made his singing debut at the 'Metro In Dino' album launch. He performed 'Ishq Hai Ya Tharak' live on stage. The song is expected to be released soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ram-kapoor-removed-from-mistry-promotions-for-making-offensive-remarks-source-2745401-2025-06-24",
      "headline": "Ram Kapoor dropped from Mistry promotions over offensive remarks: SourceActor Ram Kapoor has been removed from all the promotional activities of his upcoming project 'Mistry'. The series will premiere on JioHostar on June 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kajol-addresses-comparisons-with-jaya-bachchan-over-paparazzi-videos-2745356-2025-06-24",
      "headline": "Kajol addresses comparisons with Jaya Bachchan over paparazzi videosActor Kajol spoke about comparisons with veteran actor Jaya Bachchan over her behaviour with the paparazzi. She said that it was okay if they think she's scary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/randeep-hooda-new-look-on-social-media-sparks-buzz-of-a-new-film-see-pic-2745378-2025-06-24",
      "headline": "Randeep Hooda's new look fuels speculation about upcoming film. See picActor Randeep Hooda grabbed attention on social media by sharing his new look. Sporting a partially bald head and an intense expression, the transformation has left fans intrigued and speculating about his next project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-amitabh-bachchan-not-like-praising-jaya-aishwarya-shweta-in-public-2745324-2025-06-24",
      "headline": "Why Amitabh Bachchan does not like praising Jaya, Aishwarya and Shweta in publicActor Amitabh Bachchan recently responded to a social media user questioning him over not praising Jaya Bachchan, Aishwarya Rai Bachchan and Shweta Bachchan Nanda in public. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/young-sheldon-montana-jordan-marries-girlfriend-jenna-weeks-see-pics-2745327-2025-06-24",
      "headline": "Young Sheldon's Montana Jordan marries Jenna Weeks in country-themed wedding. PicsYoung Sheldon actor Montana Jordan got married to Jenna Weeks in a country-themed wedding. The intimate wedding took place on June 21 in Austin, Texas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/diljit-dosanjh-stands-by-punjab-95-amid-sardaar-ji-3-backlash-shares-damning-note-titled-censored-before-release-2745352-2025-06-24",
      "headline": "Censored before release: Diljit stands by Punjab 95 amid Sardaar Ji 3 backlashDiljit Dosanjh has refused to agree to the 127 cuts suggested by the censor board to his film 'Punjab 95', which is based on the real-life human rights activist Jaswant Singh Khalra. The actor now shared a strong note criticising the board for stifling the voice asking an uncomfortable question."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-paris-fashion-week-debut-heres-all-you-need-to-know-2745347-2025-06-24",
      "headline": "Badshah gears up for Paris Fashion Week debut, here's all you need to knowIndian rapper Badshah is all set to make history as he debuts at Paris Fashion Week 2026. Invited by luxury designer Mike Amiri, he will be the only Indian artist at the exclusive event, marking a significant milestone for Indian representation in global fashion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-crushology-101-cast-roh-jeong-eui-lee-chae-min-call-india-warm-hearted-and-beautiful-2745307-2025-06-24",
      "headline": "Exclusive: Crushology 101 cast thinks India is warm hearted and beautifulCrushology 101 is a heartfelt university romance drama now streaming on Channel K in India, capturing the essence of youthful emotions and campus chaos. The cast Roh Jeong-eui, Lee Chae-min and Cho Jun-young spoke to India Today about the drama and described India the best way they could. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-says-iran-violated-ceasefire-sirens-go-off-vows-forceful-response-in-heart-of-tehran-2745421-2025-06-24",
      "headline": "Trump truce in tatters? Israel claims Iran violated truce, vows powerful strikes Live UpdatesIn response to Tel Aviv's claims that Tehran had broken the ceasefire, the Iranian state media dismissed them as 'false.' Moments back, several sirens went off across Israel as its defence forces urged the public to seek refuge in bomb shelters after several missiles were launched towards the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-ceasefire-us-military-bases-nuclear-program-india-envoy-iraj-elahi-2745412-2025-06-24",
      "headline": "No country has dared to target US army bases, we did it: Iran envoy warns TrumpThe Iranian ambassador to India, in a strongly worded interview, said Tehran had anticipated the US's entry in its conflict with Israel and had prepared accordingly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/serving-op-sindoor-wont-give-immunity-supreme-court-to-commando-accused-of-dowry-death-2745480-2025-06-24",
      "headline": "Serving Op Sindoor won't give immunity: Top court to commando accused of dowry deathWhen the bench expressed disinclination from granting an exemption, the petitioner's counsel said he had been serving in the Rashtriya Rifles for 20 years."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/israel-iran-war-strait-of-hormuz-crude-price-india-energy-security-oil-reserves-underground-rock-cavern-2745302-2025-06-24",
      "headline": "How India uses underground caves to store crude oil for crisisThere's fear that Iran might try to choke the Strait of Hormuz, through which 20% of global crude oil is traded. India, however, is said to be in a pretty comfortable position. This is how India stores crude oil in underground rock caverns in Visakhapatnam, Mangalore and Padur for emergency situations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/the-coup-that-shaped-iran-us-relations-part-2-2745413-2025-06-24",
      "headline": "The coup that shaped Iran-US Relations | Part 2In Part 1 of our series on the history of US-Iran relations, we explored the rising tensions in Tehran as Prime Minister Mohammad Mosaddegh nationalised the oil industry, challenging Western interests and the young Shah Mohammad Reza Pahlavi's rule. By 1953, the US, fearing a communist takeover, launched Operation Ajax to topple Mosaddegh. Part 2 delves into the dramatic execution of this CIA-orchestrated coup.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/dmk-lok-sabha-mp-a-raja-calls-hm-union-amit-shah-fool-on-bjp-tn-expansion-party-responds-with-idiot-2745427-2025-06-24",
      "headline": "DMK leader calls Amit Shah 'fool', BJP fires back with 'he's an idiot'DMK MP A Raja sparked a political storm after calling Union Home Minister Amit Shah a \"fool\" during a speech, prompting the BJP to retort that anyone who says so is an \"idiot\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-icc-code-of-conduct-breach-umpire-decision-dissent-eng-vs-ind-2745387-2025-06-24",
      "headline": "ICC punishes Rishabh Pant for showing dissent at umpire's decisionIndia's wicket-keeper-batter Rishabh Pant has been handed an official reprimand for breaching Level 1 of the ICC Code of Conduct during the Headingley Test.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/how-india-born-engineer-noshir-gowadia-in-b-2-bomber-project-ended-up-as-china-spy-iran-h-20-stealth-bomber-2745382-2025-06-24",
      "headline": "How India-born engineer in B-2 bomber project ended up as China spyIndia-born engineer Noshir Gowadia, who played a key role in developing the B-2 bomber's stealth propulsion system, was sentenced to 32 years in prison for leaking classified US military secrets to China and other countries. His disclosures reportedly helped China develop stealth cruise missile technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dropped-catches-leeds-test-slope-dark-stands-impact-india-england-fielding-2745363-2025-06-24",
      "headline": "Explained: Why are so many catches being dropped at Headingley?IND vs ENG 1st Test: India and England struggled with multiple dropped catches in the Leeds Test match. Former England captain Alastair Cook explained why both teams were dropping chances at slips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) System for Treatment of Severe Mitral RegurgitationThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayat-season-4-review-election-drama-underwhelms-scattered-plots-faded-charm-2745111-2025-06-24",
      "headline": "Panchayat Season 4 review: Election drama overshadows emotional warmthReleased-Tue Jun 24, 2025'Panchayat Season 4' review: The TVF series returns with a focus on village elections but lacks the emotional depth of earlier seasons. Fans may find the plot scattered and unconvincing arcs despite strong performances from some actors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-girl-death-low-neet-marks-father-beaten-arrested-police-2745380-2025-06-24",
      "headline": "Maharashtra girl beaten to death by father for low marks in NEET mock testAccused Dhondiram Bhagwan Bhosale allegedly beat his 17-year-old daughter, Sadhana, with a wooden stick in a fit of rage over her poor test performance in the NEET test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/labubu-mania-how-a-quirky-doll-made-pop-mart-a-global-giant-ceo-wang-ning-among-china-top-10-richest-2745398-2025-06-24",
      "headline": "Labubu mania: How a quirky doll made Pop Mart a global giantAt the heart of this success is Pop Mart's 38-year-old founder Wang Ning, now one of China's top 10 richest people. As of June 2025, he's worth $22.7 billion, all thanks to Labubu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-israel-conflict-live-updates-donald-trump-benjamin-netanyahu-nuclear-sites-air-strikes-in-tehran-tel-aviv-2744689-2025-06-23",
      "headline": "Live: Iran denies missile strikes after Israel claims ceasefire violationIsrael-Iran War News Live: The hostilities between Israel and Iran continued as Tel Aviv has now alleged that Tehran has violated the ceasefire, which both parties agreed upon earlier on Tuesday. The IDF said that Iran launched two ballistic missiles hours after the ceasefire deal. However, Iran denied the allegations of disrespecting the truce. Earlier too, Israel claimed that Iran launched continuous missile attacks despite US President Donald Trump announcing that the two countries had reached a ceasefire agreement early on Tuesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-mossad-covert-spy-operation-on-iran-drone-strikes-nuclear-targets-drone-weapon-smuggle-2744958-2025-06-24",
      "headline": "How Israeli spies shot down Iranian missiles from inside IranIsrael had for years prepared for this day. Just as Israel's jets hit Iran's nuclear facilities on June 13, armed drones and precision weapons smuggled into the Islamic Republic by Mossad operatives crippled Tehran's ability to detect Israeli planes and shot down missiles aimed at them from within its borders."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-ai-130-boeing-777-mumbai-london-health-scare-illness-7-passengers-fall-sick-regulator-informed-2745388-2025-06-24",
      "headline": "7 including crew on Air India flight fall sick, food poisoning suspectedDespite the health scare, the Air India flight AI-130 continued its journey and landed safely in Mumbai, where medical teams were already present."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-hundred-redemption-test-opener-leeds-2745299-2025-06-24",
      "headline": "KL Rahul takes the lead: A Headingley statement years in the makingYears of silence, shifting roles, and unanswered questions found their reckoning at Headingley. KL Rahul, India's quiet constant, didn't just score a century - he reaffirmed himself as the pillar of a Test team rediscovering its rhythm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/tesla-robotaxi-off-to-a-rocky-start-musks-driverless-cabs-not-fully-autonomous-swerves-on-wrong-side-of-road-2745465-2025-06-24",
      "headline": "Tesla Robotaxi swerves on wrong side of road, they are not fully autonomous yetTesla's driverless Robotaxis are now live in Austin, but videos reveal traffic glitches and safety concerns, raising questions about Elon Musk's bold promises of full autonomy in the near future."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-ahmedabad-black-box-probe-aaib-aviation-minister-2745442-2025-06-24",
      "headline": "Black box of crashed Air India plane still in India, being examined: MinisterEarlier, reports claimed that India was likely to send the black box to the United States for data recovery as the recorder sustained heavy external damage due to the fire following the deadly crash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/diljit-dosanjh-stands-by-punjab-95-amid-sardaar-ji-3-backlash-shares-damning-note-titled-censored-before-release-2745352-2025-06-24",
      "headline": "Censored before release: Diljit stands by Punjab 95 amid Sardaar Ji 3 backlashDiljit Dosanjh has refused to agree to the 127 cuts suggested by the censor board to his film 'Punjab 95', which is based on the real-life human rights activist Jaswant Singh Khalra. The actor now shared a strong note criticising the board for stifling the voice asking an uncomfortable question."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/tata-harrierev-vs-mahindra-xev-9e-which-electric-suv-reigns-supreme-2745383-2025-06-24",
      "headline": "Tata Harrier.ev vs Mahindra XEV 9e: Which electric SUV reigns supreme?The Tata Harrier.ev and Mahindra XEV 9e are competing head-to-head in the Indian electric SUV landscape in India with bold designs, advanced tech, and strong performance. Here's how they stack up against each other.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/never-said-govt-has-no-money-clarifies-parameshwara-after-we-have-no-money-comment-at-badami-bagalkot-2745353-2025-06-24",
      "headline": "Who said it? Karnataka Home Minister's U-turn after 'we have no money' remarkContradicting his earlier statement, Karnataka Home Minister G Parameshwara insisted he never claimed the state lacked funds. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/mk-stalin-accuses-bjp-led-centre-of-favouring-sanskrit-over-tamil-funds-2745395-2025-06-24",
      "headline": "Sanskrit gets funds, crocodile tears for Tamil: MK Stalin slams Centre for biasTamil Nadu Chief Minister MK Stalin has accused the Union government of discriminating against Tamil and other South Indian languages in language funding, saying only Sanskrit receives crores while others get ignored."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/novo-nordisk-launches-wegovy-obesity-drug-semiglutide-india-weight-management-2025-2745370-2025-06-24",
      "headline": "Wegovy, popular weight-loss drug, launched in India: Price, dosageNovo Nordisk has officially launched its anti-obesity drug Wegovy in India ahead of patent expiry. This move aims to tackle rising obesity rates while facing competition from rival drugs."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-cricket-score-1st-test-day-5-leeds-weather-updates-2745436-2025-06-24",
      "headline": "Day 5 Live: Crawley, Duckett start gingerly vs BumrahEngland (ENG) vs India (IND), 1st Test Day 5 Live Score and Updates: Zak Crawley and Ben Duckett have started gingerly against India. Jasprit Bumrah has been sensational at the start and has been bowling gun deliveries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/emma-raducanu-wimbledon-blocks-stalker-ticket-purchase-2745428-2025-06-24",
      "headline": "Emma Raducanu thanks Wimbledon for blocking stalker's ticket purchaseBriton Emma Raducanu said she felt reassured about her safety after Wimbledon organisers prevented a man who had been stalking her from purchasing tickets for the Grand Slam, which begins on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/austrian-grand-prix-2025-all-you-need-to-know-2745420-2025-06-24",
      "headline": "Austrian GP preview: Verstappen seeks redemption, as McLaren look to extend leadThe 2025 Austrian Grand Prix takes place at Red Bull Ring with McLaren leading the championship. The race could reshape the title fight as Verstappen aims for a fifth win at his favourite track."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-icc-code-of-conduct-breach-umpire-decision-dissent-eng-vs-ind-2745387-2025-06-24",
      "headline": "ICC punishes Rishabh Pant for showing dissent at umpire's decisionIndia's wicket-keeper-batter Rishabh Pant has been handed an official reprimand for breaching Level 1 of the ICC Code of Conduct during the Headingley Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dropped-catches-leeds-test-slope-dark-stands-impact-india-england-fielding-2745363-2025-06-24",
      "headline": "Explained: Why are so many catches being dropped at Headingley?IND vs ENG 1st Test: India and England struggled with multiple dropped catches in the Leeds Test match. Former England captain Alastair Cook explained why both teams were dropping chances at slips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-ostrava-golden-spike-live-streaming-all-you-need-to-know-2745351-2025-06-24",
      "headline": "Neeraj Chopra targets Ostrava win ahead of Tokyo World ChampionshipsAhead of his homecoming in Bengaluru with the Neeraj Chopra Classic on July 5, the Indian ace will look to make a mark at the Ostrava Golden Spike event as he enters as the favourite.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-on-rishabh-pant-batting-mantra-leeds-test-2745342-2025-06-24",
      "headline": "Let Pant be Pant: Rahul explains India keeper's method after twin centuriesIndia batter KL Rahul admitted on Monday that trying to understand Rishabh Pant's mindset is nearly impossible - and perhaps unnecessary. Pant became only the second wicketkeeper to hit two centuries in one Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rain-threat-headingley-test-india-england-final-day-2745333-2025-06-24",
      "headline": "Leeds weather report: Rain set to play big part in thrilling final dayLeeds weather forecast: Rain is expected to impact the final day of the 1st Test between India and England at Headingley. Both teams aim to force a result despite tricky weather and pitch conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sunil-gavaskar-wanted-backstand-rishabh-pant-hundred-leeds-2745317-2025-06-24",
      "headline": "Sunil Gavaskar reveals he wanted to do backstand after Rishabh Pant's hundredEngland vs India, Leeds Test: Former India captain Sunil Gavaskar revealed that he was planning to do a backstand following Rishabh Pant's century against England in the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-hundred-redemption-test-opener-leeds-2745299-2025-06-24",
      "headline": "KL Rahul takes the lead: A Headingley statement years in the makingYears of silence, shifting roles, and unanswered questions found their reckoning at Headingley. KL Rahul, India's quiet constant, didn't just score a century - he reaffirmed himself as the pillar of a Test team rediscovering its rhythm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-ostrava-golden-spike-live-streaming-all-you-need-to-know-2745351-2025-06-24",
      "headline": "Neeraj Chopra targets Ostrava win ahead of Tokyo World ChampionshipsAhead of his homecoming in Bengaluru with the Neeraj Chopra Classic on July 5, the Indian ace will look to make a mark at the Ostrava Golden Spike event as he enters as the favourite.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-on-rishabh-pant-batting-mantra-leeds-test-2745342-2025-06-24",
      "headline": "Let Pant be Pant: Rahul explains India keeper's method after twin centuriesIndia batter KL Rahul admitted on Monday that trying to understand Rishabh Pant's mindset is nearly impossible - and perhaps unnecessary. Pant became only the second wicketkeeper to hit two centuries in one Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rain-threat-headingley-test-india-england-final-day-2745333-2025-06-24",
      "headline": "Leeds weather report: Rain set to play big part in thrilling final dayLeeds weather forecast: Rain is expected to impact the final day of the 1st Test between India and England at Headingley. Both teams aim to force a result despite tricky weather and pitch conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sunil-gavaskar-wanted-backstand-rishabh-pant-hundred-leeds-2745317-2025-06-24",
      "headline": "Sunil Gavaskar reveals he wanted to do backstand after Rishabh Pant's hundredEngland vs India, Leeds Test: Former India captain Sunil Gavaskar revealed that he was planning to do a backstand following Rishabh Pant's century against England in the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-hundred-redemption-test-opener-leeds-2745299-2025-06-24",
      "headline": "KL Rahul takes the lead: A Headingley statement years in the makingYears of silence, shifting roles, and unanswered questions found their reckoning at Headingley. KL Rahul, India's quiet constant, didn't just score a century - he reaffirmed himself as the pillar of a Test team rediscovering its rhythm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-day-5-test-match-stuart-broad-jasprit-bumrah-2745285-2025-06-24",
      "headline": "India clear favourite going into Day 5: Stuart BroadIndia are favourites to win the first Test at Headingley after setting a 371-run target. The match's outcome hinges on India's ability to grab their catches in challenging conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/club-world-cup-inter-miami-progress-atletico-madrid-exit-palmeiras-draw-psg-top-group-2745286-2025-06-24",
      "headline": "Atletico Madrid crash out, Messi misfires in Inter Miami's drawInter Miami progressed to the knockout stages despite a late Palmeiras comeback. Atletico Madrid were eliminated early, marking a surprising exit for the European club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-1st-test-rishabh-pant-kl-rahul-headingley-leeds-2745217-2025-06-24",
      "headline": "A Song of Ice and Fire: Pant's bravado meets Rahul's composure in LeedsIndia batters Rishabh Pant and KL Rahul stitched together a marvellous partnership on Day 4 of the first Test against England at Headingley, Leeds. The duo recreated a 'song of Ice and Fire' at the crease, complementing each other beautifully as they navigated different phases of the innings with their contrasting styles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-on-test-average-england-vs-india-leeds-137-2745258-2025-06-24",
      "headline": "My Test average hurts but not chasing numbers now: Rahul after Leeds 137England vs India, Leeds Test: After scoring a majestic 137 against England, KL Rahul admitted that his low Test average still 'hurts' him, but stressed that he no longer plays with the burden of numbers on his mind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-leeds-test-kl-rahul-reaction-josh-tongue-bazball-remark-day-5-2745252-2025-06-24",
      "headline": "KL Rahul promises blockbuster finish after England's bold Day 5 predictionIndia opener KL Rahul is confident his team can claim all ten wickets needed on Day 5. England pacer Josh Tongue has declared the hosts will go for a win chasing 371 runs, setting up a thrilling final day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-kl-rahul-press-conference-leeds-test-day-4-2745239-2025-06-24",
      "headline": "KL Rahul savours hundred as Test opener vs England: Had forgotten my positionENG vs IND: KL Rahul said he was happy to return to opening for India in Tests after floating around the batting order over the past few years. His hundred helped India set a 371-run target for England in the Leeds Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-josh-tongue-warning-371-chase-leeds-test-2745214-2025-06-24",
      "headline": "England can chase 371: Josh Tongue warns India ahead of Day 5Fast bowler Josh Tongue said England will push for victory on the final day of the Leeds Test against India. Set a daunting target of 371 in the fourth innings, the hosts made a confident start, with their openers chipping away 21 runs in the six overs before stumps on Day 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/former-india-spinner-dilip-doshi-dies-at-the-age-of-77-2745216-2025-06-24",
      "headline": "Former India spinner Dilip Doshi dies at the age of 77Former India spinner Dilip Doshi has passed away at the age of 77 on Monday, June 23 in London. Doshi played 33 Tests and 15 ODIs for India and was a stalwart in the domestic circuit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-leeds-test-kl-rahul-reaction-josh-tongue-bazball-remark-day-5-2745252-2025-06-24",
      "headline": "KL Rahul promises blockbuster finish after England's bold Day 5 predictionIndia opener KL Rahul is confident his team can claim all ten wickets needed on Day 5. England pacer Josh Tongue has declared the hosts will go for a win chasing 371 runs, setting up a thrilling final day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-kl-rahul-press-conference-leeds-test-day-4-2745239-2025-06-24",
      "headline": "KL Rahul savours hundred as Test opener vs England: Had forgotten my positionENG vs IND: KL Rahul said he was happy to return to opening for India in Tests after floating around the batting order over the past few years. His hundred helped India set a 371-run target for England in the Leeds Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-josh-tongue-warning-371-chase-leeds-test-2745214-2025-06-24",
      "headline": "England can chase 371: Josh Tongue warns India ahead of Day 5Fast bowler Josh Tongue said England will push for victory on the final day of the Leeds Test against India. Set a daunting target of 371 in the fourth innings, the hosts made a confident start, with their openers chipping away 21 runs in the six overs before stumps on Day 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/former-india-spinner-dilip-doshi-dies-at-the-age-of-77-2745216-2025-06-24",
      "headline": "Former India spinner Dilip Doshi dies at the age of 77Former India spinner Dilip Doshi has passed away at the age of 77 on Monday, June 23 in London. Doshi played 33 Tests and 15 ODIs for India and was a stalwart in the domestic circuit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-kl-rahul-talks-in-tamil-kannada-hindi-leeds-2745198-2025-06-23",
      "headline": "Watch: Rahul shows off his multilingual skills during 2nd innings hundredKL Rahul showed that he is not just versatile with the bat and displayed his multilingual skills during the course of his hundred in Leeds. Rahul's hundred helped India put a target of 371 against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-rishabh-pant-day-4-match-report-late-collapse-leeds-test-2745194-2025-06-23",
      "headline": "Rahul-Pant show lights up Day 4, but collapse keeps Leeds Test poisedIND vs ENG: KL Rahul's elegance and Rishabh Pant's flair lit up Day 4 in Leeds, but India's lower-order collapse handed England a lifeline, setting up a thrilling finish to the Headingley Test on Day 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/javelin-ostrava-golden-spike-neeraj-chopra-tokyo-world-championship-2745185-2025-06-23",
      "headline": "Neeraj Chopra reveals main goal of 2025 season before Ostrava Golden SpikeNeeraj Chopra said that his main goal of the 2025 season will be the World Championships in Tokyo. Neeraj is all set to take part in the Ostrava Golden Spike meet on Tuesday, June 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-hundred-ravi-shastri-headingley-2745165-2025-06-23",
      "headline": "Rishabh Pant's batting may defy logic, but it's backed by a sharp cricket brain: ShastriRavi Shastri has said that while Rishabh Pant's batting may defy logic, it's backed by a sharp cricket brain. Pant scored his second hundred of the game on Day 4 of the first Test against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-hundred-athiya-shetty-message-leeds-2745159-2025-06-23",
      "headline": "Athiya Shetty shares special message for KL Rahul after Leeds hundredAthiya Shetty had a special message for her husband and Indian opener KL Rahul after his brilliant hundred against England on Day 4 of the first Test. Rahul's knock put India on top of proceedings in Leeds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sunil-gavaskar-rishabh-pant-summersault-celebration-twin-centuries-2745141-2025-06-23",
      "headline": "Sunil Gavaskar urges twin centurion Rishabh Pant for somersault celebrationENG vs IND: Rishabh Pant made history at Headingley with twin centuries against England, prompting Sunil Gavaskar to ask for his trademark celebratory flip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-becomes-2nd-wicketkeeper-to-score-twin-centuries-in-a-test-2745134-2025-06-23",
      "headline": "Rishabh Pant becomes 2nd wicketkeeper to score twin centuries in a TestIndia's Rishabh Pant etched his name in the record books as he became just the second wicketkeeper to score twin centuries in a Test match during Day 4 of the first Test against England in Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-kl-rahul-century-headingley-test-sunil-gavaskar-rahul-dravid-behind-2745122-2025-06-23",
      "headline": "KL Rahul leaves Dravid, Gavaskar behind with 4th Test 100 vs EnglandENG vs IND: KL Rahul delivered a masterclass at Headingley, scoring a composed century that not only steadied India's innings but also made him the Indian opener with the most Test hundreds on English soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-can-also-bat-like-cheteshwar-pujara-sanjay-manjrekar-2745118-2025-06-23",
      "headline": "Rishabh Pant can also bat like Cheteshwar Pujara: Sanjay ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar is impressed with Rishabh Pant's defensive technique in the ongoing first Test against England, saying that he can even bat like Cheteshwar Pujara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-critics-sanjana-ganesan-only-on-the-field-2745108-2025-06-23",
      "headline": "They only know Bumrah on the field: Sanjana Ganesan shuts down criticsWhile Jasprit Bumrah roared back with a five-wicket haul in the Headingley Test, his wife Sanjana Ganesan shared a graceful response to critics, reminding fans that there's more to athletes than what meets the eye."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-was-reluctant-to-become-test-captain-after-virat-kohli-sourav-ganguly-2745080-2025-06-23",
      "headline": "Rohit Sharma was reluctant to become Test captain after Virat Kohli: Sourav GangulyFormer India captain and BCCI President Sourav Ganguly has revealed that Rohit Sharma was reluctant to become the Test captain after Virat Kohli and had to be convinced by the board. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-reason-mumbai-cricket-association-noc-2745043-2025-06-23",
      "headline": "Prithvi Shaw reveals reason why he decided to leave Mumbai and ask for releasePrithvi Shaw has revealed the reason why he decided to leave Mumbai and asked for the No Objection Certificate from the Mumbai Cricket Association. Shaw was dropped from Mumbai's squad for the Ranji Trophy last season. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}