{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-today-ai-summit-550-billion-to-indian-economy-2870605-2026-02-18",
      "headline": "Can AI really add $550 billion to India's economy? Experts debateIndia is poised for significant AI-driven economic growth, with projections estimating a USD 550 billion boost by 2035. Industry leaders discuss the need for balanced optimism, innovation, and supportive policies to realise AI's potential in the country fully."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/can-india-turn-its-data-edge-into-global-ai-leadership-experts-debate-2870604-2026-02-18",
      "headline": "Can India turn its data edge into global AI leadership? Experts debateAt the India Today AI Summit, the conversation moved beyond algorithms and valuations to a more fundamental question: power. As panellists noted, artificial intelligence runs not just on data and chips but on massive, uninterrupted energy supply to fuel data centres and high-performance computing. With AI workloads rising globally, advanced economies such as the United States and parts of Europe are already grappling with grid stress and delays in expanding generation capacity. Against this backdrop, speakers argued that India's relative energy sufficiency and ongoing renewable expansion could offer a strategic edge. India has added significant power capacity in recent years and is pushing solar, wind and green hydrogen projects, positioning itself to meet rising digital infrastructure demand. If managed well, this energy readiness could help India scale domestic data centres, strengthen data sovereignty and even emerge as a competitive AI hub, turning power security into economic advantage in the global AI race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/how-infrastructure-and-innovation-are-driving-indias-ai-growth-2870557-2026-02-18",
      "headline": "How infrastructure and innovation are driving India's AI growthAt the India Today AI Summit 2026, industry leaders unpacked what truly powers AI, i.e., from advanced chips and data centres to voice tools and open-source platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/indias-ai-opportunity-is-real-says-openais-chief-economist-2870554-2026-02-18",
      "headline": "India's AI opportunity is real, says OpenAI's chief economistArtificial intelligence is not hype and it is not a bubble. That was the clear message from Dr Aaron Ronnie Chatterji, Chief Economist at OpenAI, at the India Today AI Summit 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/inside-indias-rapid-ai-rise-experts-talk-infrastructure-and-innovation-2870538-2026-02-18",
      "headline": "Inside India's rapid AI rise: Experts talk infrastructure and innovationExperts said that India is on the brink of a major AI expansion. If infrastructure, open technology and user-friendly applications grow together, AI could become part of everyday life for hundreds of millions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-today-ai-summit-2026-openai-chief-economist-dr-aaron-chatterji-opportunity-2870451-2026-02-18",
      "headline": "There's real value in AI and India has a real opportunity: OpenAI chief economistAt the India Today AI Summit, OpenAI's Chief Economist Dr Aaron Chatterji said AI is real and accelerating, and India's success will hinge on how fast it invests in skills, infrastructure and trust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-whatsapp-scam-alert-how-employees-can-stay-safe-2870402-2026-02-18",
      "headline": "8th Pay Commission WhatsApp scam alert: How employees can stay safeThe 8th Pay Commission matters to more than one crore central government employees and pensioners. It directly affects salaries, pensions and overall financial security. Scammers are exploiting this interest and curiosity to trick people into lowering their guard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-283-points-higher-nifty-above-25800-it-stocks-bleed-2870339-2026-02-18",
      "headline": "Sensex ends 283 points higher, Nifty above 25,800; IT stocks bleedThe S&P BSE Sensex added 283.29 points to close at 83,734.25, while the NSE Nifty50 was up 93.95 points to end at 25,819.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/everyone-has-a-plan-for-sips-but-do-you-know-when-to-stop-2870328-2026-02-18",
      "headline": "Everyone has a plan for SIPs, but do you know when to stop?Starting a SIP is easy; planning its end is harder. Many investors keep investing on autopilot, without asking an important question, i.e., when should you exit? The answer can shape how effectively your money supports your real-life goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-pre-existing-disease-non-disclosure-claim-rejection-irda-free-look-moratorium-rule-2870324-2026-02-18",
      "headline": "Did insurance agent tell you to hide pre-existing disease? It may cost you laterAfter a recent viral dispute over a health insurance claim, questions are being raised about what really leads to claim rejection and has once again brought attention to a common issue in India's health insurance market: non-disclosure of medical history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-meets-google-ceo-sundar-pichai-discusses-deeper-ai-collaboration-2870269-2026-02-18",
      "headline": "PM Modi meets Google CEO Sundar Pichai, discusses deeper AI collaborationPrime Minister Narendra Modi met with Google CEO Sundar Pichai on the sidelines of the India AI Impact Summit and said the discussion centred on strengthening AI cooperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-jumps-over-rs-8000-will-prices-rise-again-or-fade-soon-gold-prices-bullion-2870270-2026-02-18",
      "headline": "Silver jumps over Rs 8,000: Will prices rise again or fade soon?A strong surge in silver has put the metal back in focus. With prices climbing rapidly in a single session, the big question for investors is whether this rise signals a fresh trend or a pause ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/bubble-or-boom-experts-discuss-ais-returns-and-real-world-impact-2870250-2026-02-18",
      "headline": "Bubble or boom? Experts discuss AI's returns and real-world impactInvestment in artificial intelligence is accelerating rapidly, with billions being poured into data centres and advanced AI models. But as spending rises, one question is gaining attention: how soon will investors begin to see meaningful returns?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-the-ai-surge-a-bubble-or-a-breakthrough-experts-discuss-roi-and-impact-2870236-2026-02-18",
      "headline": "Is the AI surge a bubble or a breakthrough? Experts discuss impact and investmentMoney is pouring into artificial intelligence at an unprecedented pace, especially into data centres and large language models. Yet amid the surge in funding, investors are increasingly asking when real financial rewards will follow."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/is-ai-reinforcing-gender-inequality-more-than-we-realise-2870227-2026-02-18",
      "headline": "Is AI reinforcing gender inequality more than expected?Ivana Bartoletti, Global Chief Privacy & AI Governance Officer, Wipro, who is also the founder of Women Leading Artificial Intelligence, said the concern goes beyond participation in coding roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-down-over-21-percent-in-a-month-what-should-investors-do-2870216-2026-02-18",
      "headline": "Ola Electric share price down over 21% in a month: What should investors do?Currently trading near the Rs 28 mark, the counter is hovering close to its recent lows, leaving retail investors wondering whether this is a buying opportunity or a signal to stay away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-should-india-build-its-ai-governance-framework-ivana-bartoletti-wipro-ai-summit-2026-2870213-2026-02-18",
      "headline": "How should India build its AI governance? Wipro's AI officer answersDuring a session at India Today AI Summit, Ivana Bartoletti, Global Chief Privacy and AI Governance Officer at Wipro, said governance should not be misunderstood as heavy state control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/qualcomm-bets-big-on-indias-ai-future-with-150-million-strategic-venture-fund-2870204-2026-02-18",
      "headline": "Qualcomm bets big on India's AI future with $150 million strategic venture fundWith $150 million on the table, Qualcomm is betting that India's edge AI startups will help define the next global technology cycle, moving intelligence from distant clouds directly into everyday devices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-return-not-processed-here-is-what-could-have-gone-wrong-2870168-2026-02-18",
      "headline": "Still waiting for your income tax refund? Here's what could be holding it upIncome tax refund not credited yet? Before you panic, check the latest processing data and the common reasons that may be holding up your money this assessment season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-your-pf-interest-rate-increase-this-year-or-remain-at-825-check-here-2870134-2026-02-18",
      "headline": "Will your PF interest rate increase this year or remain at 8.25%? Check hereFor lakhs of salaried employees, the annual PF interest rate is more than just a number; it shapes long-term savings. With expectations building around this year's decision, many are wondering whether returns will rise or stay unchanged."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-wedding-rumours-decorated-residence-2870644-2026-02-18",
      "headline": "Vijay Deverakonda's home lit up for wedding with Rashmika Mandanna Decorations seen outside Vijay Deverakonda's home have sparked fresh wedding buzz with Rashmika Mandanna."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-alia-bhatt-spotted-with-daughter-raha-in-rare-family-outing-in-mumbai-2870625-2026-02-18",
      "headline": "Ranbir Kapoor cradles Raha during outing with Alia, Neetu. Watch video Ranbir Kapoor and Alia Bhatt stepped out in Mumbai with daughter Raha and Neetu Kapoor. A sweet moment between father and daughter is winning hearts online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/varanasi-film-ss-rajamouli-priyanka-chopra-jonas-2027-release-2870596-2026-02-18",
      "headline": "Priyanka Chopra calls Varanasi her career-defining film, praises SS Rajamouli Priyanka Chopra Jonas has opened up about her return to Indian cinema at a recent premiere — and her comments about SS Rajamouli's Varanasi have set expectations soaring."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chris-hemsworth-confirms-thor-5-plans-following-his-avengers-doomsday-return-2870527-2026-02-18",
      "headline": "Chris Hemsworth confirms Thor 5 plans following his Avengers: Doomsday return Chris Hemsworth confirmed he will portray Thor a 'couple more times' following Avengers: Doomsday in 2026. The actor revealed he is discussing 'unique' ideas for Thor 5 with Kevin Feige, even as director Taika Waititi confirms he will not return for the sequel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anil-sharma-expresses-concern-salim-khan-health-prays-for-his-recovery-2870579-2026-02-18",
      "headline": "Anil Sharma expresses concern over Salim Khan's health, prays for his recovery Filmmaker Anil Sharma prayed for veteran screenwriter Salim Khan's health and wished him a speedy recovery on social media. Khan was admitted to Lilavati Hospital on February 17 after reportedly suffering a blood clot. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/raye-apologises-65-fans-denied-entry-paris-concert-ticketing-error-2870525-2026-02-18",
      "headline": "British singer Raye apologises after 65 fans denied entry to Paris concert British singer Raye has issued a heartfelt apology after dozens of fans were denied entry to her Paris concert despite holding valid tickets. What went wrong at the Accor Arena?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saina-nehwal-says-shraddha-kapoor-is-still-her-top-choice-if-biopic-is-done-again-2870507-2026-02-18",
      "headline": "Saina Nehwal says Shraddha Kapoor is still her top choice if biopic is done again Badminton player Saina Nehwal shared her thoughts on Shraddha Kapoor as her preferred choice for a potential biopic remake. She clarified her rapport with Parineeti Chopra and addressed recent social media buzz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-legacy-career-growth-upcoming-film-vrushakarma-2870504-2026-02-18",
      "headline": "I don't chase comparisons: Naga Chaitanya on his father Nagarjuna's legacy Naga Chaitanya discusses balancing his father's legacy, fear of repetition, and approach to script selection as he prepares for his 25th film Vrushakarma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/galgotias-university-ai-summit-controversy-robot-dog-misrepresentation-2870450-2026-02-18",
      "headline": "Vir Das mocks Galgotias robodog row, urges fans to adopt 'indie dogs' Actor-comedian Vir Das has weighed in on the Galgotias University robot dog controversy — and his cheeky take is winning the internet. So, what exactly did Vir Das say?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/when-anurag-kashyap-refused-to-make-indian-version-of-money-heist-for-netflix-2870418-2026-02-18",
      "headline": "When Anurag Kashyap refused to make Indian version of Money Heist for Netflix Anurag Kashyap revealed he abandoned a Netflix pilot after the streamer pressured him to create an Indian version of Money Heist. The director detailed how the ensuing grief led to a heart attack, severe health complications, and a struggle with lifestyle issues.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zendaya-reveals-the-relationship-red-flags-she-never-ignores-tom-holland-2870438-2026-02-18",
      "headline": "Zendaya reveals the relationship red flags she never ignores Zendaya has opened up about the qualities she values in relationships and what she considers warning signs, drawing from her experiences both on and off-screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rana-daggubati-health-struggles-career-changes-kidney-transplant-2870371-2026-02-18",
      "headline": "Rana Daggubati reveals why he returned film advances after health scare Actor Rana Daggubati has opened up about his decision to return advances for films he signed before his health issues. He reflected on the impact his physical transformation had on his career and personal identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/akshay-kumar-admits-he-has-never-read-a-book-says-twinkle-khanna-reads-one-daily-2870380-2026-02-18",
      "headline": "Akshay Kumar admits he's never read a book, says Twinkle Khanna reads one daily Bollywood actor Akshay Kumar recently confessed that he has never read a book, even though his wife, Twinkle Khanna, reads daily. The confession came on the show Wheel of Fortune, which he hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arjun-kapoor-receives-overwhelming-support-kindness-instagram-positive-shift-2870383-2026-02-18",
      "headline": "You deserve pyaar: Fans flood Arjun Kapoor's new post with love Arjun Kapoor's latest Instagram post received widespread support and kind words from social media users, in contrast to the negativity he has faced in the past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/j-hope-hopeful-music-inspires-confidence-kindness-resilience-in-bts-fans-2870378-2026-02-18",
      "headline": "BTS J-Hope birthday: Ladies, you don't need a man, all you need is hope J-Hope celebrates his birthday by reaffirming his role as a source of warmth and hope. His music offers fans, especially women, a message of confidence and kindness in a competitive industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kochadaiiyaan-reimagined-ai-powered-visuals-soundarya-rajinikanth-directorial-debut-2870370-2026-02-18",
      "headline": "Rajinikanth's 2014 film Kochadaiyaan gets AI upgrade amid legal row Filmmaker Soundarya Rajinikanth's 2014 animated feature Kochadaiiyaan was reimagined through AI recently. The makers unveiled a new teaser on February 17."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vivek-agnihotri-confirms-big-nationalistic-project-amid-operation-sindoor-film-buzz-t-series-2870364-2026-02-18",
      "headline": "Vivek Agnihotri confirms 'big nationalistic project' amid Op Sindoor film buzz Speaking to India Today, Vivek Agnihotri broke his silence on a \"big nationalistic project\" amid reports linking him to a film on Operation Sindoor. While he refuses to confirm details, the buzz around the alleged collaboration is growing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-wedding-anniversary-family-moments-sheetal-thakur-son-vardaan-2870335-2026-02-18",
      "headline": "My A1 from Day 1: Vikrant Massey's anniversary wish for Sheetal is pure love Vikrant Massey celebrated his wedding anniversary with Sheetal Thakur on February 18 by sharing personal photos and a heartfelt message, highlighting their journey as a family and reflecting on his recent professional milestones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/margot-robbie-make-movies-for-the-people-buying-tickets-not-the-critics-2870337-2026-02-18",
      "headline": "Margot Robbie: Make movies for the people buying tickets, not the critics Margot Robbie has said that she focusses on the audience's emotional experience rather than critical approval. She emphasised that films should be made for the people buying tickets."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/galgotias-universitys-robotic-dog-ai-summit-row-government-says-exhibitors-must-not-display-items-that-arent-theirs-2870619-2026-02-18",
      "headline": "Exhibitors mustn't display items that aren't theirs: Centre on AI Summit rowGalgotias University was expelled from the AI Impact Summit 2026 for presenting a commercially available Chinese robot as their own creation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/no-reason-to-believe-india-has-changed-its-position-on-buying-russian-oil-moscow-rebuts-us-claims-2870636-2026-02-18",
      "headline": "No reason to believe India stopped buying Russian oil, Moscow rebuts US claimsRussia has dismissed US assertions that India agreed to cease purchasing Russian crude oil. The Russian Foreign Ministry said that India's energy imports support mutual benefits and global market stability.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/maga-activist-carlos-turcios-lord-hanuman-statue-texas-controversy-indian-immigrant-invasion-glbs-2870664-2026-02-19",
      "headline": "MAGA activist sparks row over Hanuman statue in Texas, calls it 3rd world invasionThe Texas-based political activist linked to the MAGA movement shared a video of the 90-foot statue at the Shri Ashtalakshmi Temple in Sugar Land, near Houston, questioning why such a monument existed in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-family-trademark-airport-services-naming-rights-brand-protection-glbs-2870648-2026-02-18",
      "headline": "Trump wants his name on US airports, his family business files trademark rightsThe Trump Organization, led by Donald Trump Jr. and Eric Trump, said the filings were not about making money but about guarding the family name against 'bad actors'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-jamaat-e-islami-ncp-pm-tarique-rahman-allegations-vote-manipulation-engineer-label-2870136-2026-02-18",
      "headline": "Why Bangladeshis are mocking Tarique Rahman, a 12th pass, as an engineerAfter the BNP's sweeping victory in Bangladesh, the Jamaat-e-Islami and its ally, the NCP, alleged poll engineering and began calling Tarique Rahman an \"engineer\". Bangladeshis have started flooding social media with memes and jokes, claiming Tarique \"engineered\" the results in the BNP's favour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/eight-of-15-skiers-caught-in-california-avalanche-near-lake-tahoe-confirmed-dead-glbs-2870671-2026-02-19",
      "headline": "Eight of 15 skiers caught in California avalanche confirmed dead, one still missingThe avalanche struck Tuesday morning in the Castle Peak area near Donner Summit, north of Interstate 80, after a massive winter storm dumped heavy snow across the region. Authorities received a 911 call reporting that as many as 15 skiers had been buried."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-iran-war-imminent-countries-brink-of-war-tehran-washington-nuclear-talks-ayatollah-khamenei-donald-trump-2870610-2026-02-18",
      "headline": "US-Iran war imminent, can go on for weeks; Israel preparing for scenario: ReportAccording to Axios, US officials believe that if military action is launched, it would not be limited or symbolic but instead a sustained, multi-week campaign. A White House official was quoted as putting the chances of a strike in the coming weeks at 90 percent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shivam-dube-t20-world-cup-2026-ind-vs-ned-beat-netherlands-unbeaten-super-8s-2870638-2026-02-18",
      "headline": "Dube delivers on Surya's wish as India beat Netherlands in AhmedabadIND vs NED, T20 World Cup 2026: Suryakumar Yadav made a wish at the toss. Shivam Dube made it come true under the Ahmedabad lights as India beat Netherlands by 17 runs to maintain their perfect record in the group stages.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indian-startup-shades-galgotias-university-as-it-flaunts-made-in-india-robot-dog-param-2870513-2026-02-18",
      "headline": "Enough of this nonsense: Startup shades Galgotias with made-in-India robodogThe emergence of robots like Param and Svan-2 reflects a broader trend in India's technology sector, where startups and research groups are moving beyond prototypes toward real-world robotic platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/galgotias-apologises-for-robodog-row-says-hod-communications-ill-informed-not-authorised-to-speak-to-press-2870444-2026-02-18",
      "headline": "Galgotias blames Comms head for robodog row: Ill-informed, not authorised to speakGalgotias University has publicly apologised for misinformation provided by an unauthorised staff member at the recent AI Summit. The university said it is commitment to transparency and has vacated the event premises following the controversy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/chhattisgarh/story/chhattisgarh-high-court-rape-case-ejaculation-without-penetration-is-not-rape-penis-on-vagina-not-rape-2870643-2026-02-18",
      "headline": "Ejaculation without penetration is not rape: High Court reduces convict's sentenceA High Court ruling has drawn a sharp legal line between preparation, attempt and the act itself -- a distinction that has now altered a decades-old conviction and sentence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/google-spending-15-billion-to-build-ai-in-india-plans-a-us-india-sea-cable-link-2870414-2026-02-18",
      "headline": "Google spending $15 billion to build AI in India, plans a US-India sea cable linkAt India AI Impact Summit, Google has announced that it will connect India with the US through new subsea cables as part of a $15 billion investment spread over five years. It will boost AI connectivity between the two nations. Alongside this, the company plans to expand data centres and cloud capacity, while also rolling out AI skilling programmes and other related initiatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/french-president-emmanuel-macron-ai-generated-photo-pm-modi-ai-impact-summit-2026-2870571-2026-02-18",
      "headline": "Macron shares AI-generated photo with PM Modi: Ready for AI Impact SummitIndia and France have already unveiled plans to establish key collaborative institutions, including the Indo-French Centre for AI in Health, the Indo-French Centre for Digital Science and Technology, and a National Centre of Excellence for Skilling in Aeronautics."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bangladesh-hindu-cop-murder-accused-detained-at-delhi-airport-deported-2870650-2026-02-18",
      "headline": "Bangladesh Hindu cop murder key accused detained at Delhi airport, deportedAhmed Raza Hasan Mehdi, a key accused in the 2024 murder of Hindu police officer Santosh Sharma in Bangladesh, was detained at Delhi airport while allegedly trying to flee to Europe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-news-bnp-tarique-rahman-cabinet-mohammad-yunus-next-president-2870307-2026-02-18",
      "headline": "Will Muhammad Yunus become Bangladesh President?Earlier, speculation about whether Bangladesh's interim administration chief, Muhammad Yunus, would become the country's next President would have been dismissed outright. But after his National Security Adviser, Khalilur Rahman, was inducted as Foreign Minister into PM Tarique Rahman's BNP Cabinet, the idea couldn't be fully discarded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-daughter-in-law-lara-trump-social-media-ban-for-teens-glbs-2870630-2026-02-18",
      "headline": "Will Donald Trump impose social media ban for teens? Daughter-in-law reveals planGlobal efforts to curb children's social media use are reaching US politics as Lara Trump says Donald Trump is open to age limits after discussing international rules. She backs regulation and a strict no-screen policy for her own children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/punjab-bride-showered-with-rs-85-crore-at-wedding-groom-family-denies-claim-tarn-taran-video-2870100-2026-02-18",
      "headline": "Punjab bride showered with Rs 8.5 crore at wedding? Groom's family denies claimA video from the ceremony in Tarn Taran, which has gone viral, shows the bride standing at the venue as currency notes are showered on her - a customary gesture at many Punjabi weddings. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/ex-isro-employee-kills-wife-at-karnataka-home-wanted-to-kill-himself-too-2870556-2026-02-18",
      "headline": "Ex-Isro employee kills wife at Karnataka home, wanted to kill himself tooA retired ISRO employee allegedly killed his wife at their residence in Bangalore, with police probing his mental health history. Authorities have registered a murder case and informed the couple's daughter in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/director-general-of-civil-aviation-proposal-ban-passengers-over-2-years-unruly-conduct-on-flights-2870645-2026-02-18",
      "headline": "Aviation watchdog proposes to ban passengers for over 2 years for unruly conductPassengers who behave in an unruly manner may face flight bans based on the severity of their misconduct. Level 1 violations can lead to a ban of up to three months, Level 2 up to six months, while Level 3 and 4 offences attract a minimum two-year ban or longer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajasthan-bjp-mla-bahadur-singh-koli-girl-boy-budget-remark-row-2870585-2026-02-18",
      "headline": "Birth to son is useful: Rajasthan BJP MLA's 'girl' budget remark sparks rowA controversy broke out in the Rajasthan Assembly after BJP MLA Bahadur Singh Koli compared the BJP government's budgets to the birth of a \"son\" and the previous Congress budget to a \"daughter,\" triggering objections from Congress MLAs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/galgotias-university-ai-summit-row-timeline-rs-350-crore-ai-bet-to-robodog-fraud-2870198-2026-02-18",
      "headline": "From Rs 350 crore AI bet to robodog row: The 12-day Galgotias AI spiralGalgotias University announced a Rs 350+ crore AI push days before the AI Impact Summit 2026. At the summit, a Chinese robodog was presented as campus-developed, triggering backlash, late-night clarifications, and reports of eviction. In less than two weeks, a flagship AI showcase turned into a credibility crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/google-launches-pixel-10a-its-most-affordable-pixel-10-series-phone-in-india-price-specs-and-more-2870535-2026-02-18",
      "headline": "Google launches Pixel 10a: Price, specs and moreGoogle has launched the Pixel 10a in India. As you can probably tell from the name, the 10a is the most affordable member of Google's Pixel 10 series, designed from ground up to bring the Pixel experience to more people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/sikh-nurse-attacked-australia-gym-racial-abuse-indian-dog-2870466-2026-02-18",
      "headline": "Indian dog, go back: Sikh nurse thrashed at Australian gym in racial attackVerbal insults, racist abuse, and a thrashing left a 22-year-old Sikh nurse with a broken nose and trauma from which he is unlikely to recover anytime soon. It comes months after anti-immigration protests swept Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/smoke-seen-explosion-heard-near-irans-tehran-amid-tension-with-us-over-nuclear-talks-local-media-2870606-2026-02-18",
      "headline": "Videos: Fire in Iranian city near Tehran, smoke covers sky; blast heard in anotherFootage circulating on social media showed a plume of dark smoke billowing into the sky, with early online reports claiming an explosion had occurred at the site. Iranian state broadcaster IRIB later said the smoke was caused by reeds catching fire near a riverbank close to the building."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-netherlands-t20-world-cup-india-full-press-conference-2870676-2026-02-19",
      "headline": "Are India's struggles against off-spin a cause for concern? Shivam Dube answers T20 World Cup 2026: India all-rounder Shivam Dube has explained why India are not batting at their usual aggressive template. Here is his complete press conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-batting-problems-gavaskar-ind-vs-ned-t20-world-cup-2870665-2026-02-19",
      "headline": "T20 World Cup: Is Abhishek Sharma being weighed down by expectations? T20 World Cup: Abhishek Sharma registered his third straight duck in the T20 World Cup. What has led to the batter's sudden loss of form?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-karnataka-vs-jammu-and-kashmir-hubballi-venue-2870655-2026-02-18",
      "headline": "Ranji Trophy final between Karnataka and J&K to be held in Hubballi: Report The Ranji Trophy final between Karnataka and Jammu and Kashmir will reportedly be held in Hubballi from February 24, as KSCA backs regional growth while Chinnaswamy undergoes security upgrades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shivam-dube-t20-world-cup-2026-ind-vs-ned-beat-netherlands-unbeaten-super-8s-2870638-2026-02-18",
      "headline": "Dube delivers on Surya's wish as India beat Netherlands in Ahmedabad IND vs NED, T20 World Cup 2026: Suryakumar Yadav made a wish at the toss. Shivam Dube made it come true under the Ahmedabad lights as India beat Netherlands by 17 runs to maintain their perfect record in the group stages.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-move-on-india-defeat-shadab-khan-2870608-2026-02-18",
      "headline": "Pakistan should move on from India loss, aim to win T20 World Cup: Shadab Khan Shadab Khan says Pakistan must move on from their loss to India and stay focused on winning the T20 World Cup, stressing that criticism and selection debates will not derail their campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-2028-india-pakistan-zimbabwe-qualify-2870594-2026-02-18",
      "headline": "India, Pakistan, Zimbabwe qualify for T20 World Cup 2028 along with six other teams India, Pakistan, and Zimbabwe are among the teams that have qualified for the ICC T20 World Cup 2028. Although Australia failed to reach the Super Eights, they will feature in the next edition as co-hosts alongside New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-tribute-jonathan-trott-afghanistan-t20-world-cup-2870591-2026-02-18",
      "headline": "Jonathan Trott leaves Afghanistan cricket, Rashid Khan pays tribute Afghanistan captain Rashid Khan paid glowing tribute to outgoing head coach Jonathan Trott, saying the former England batter played a key role in steering the team in the right direction and lifting the standards of Afghan cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-south-africa-assessed-ahmedabad-pitch-india-game-corbin-bosch-2870582-2026-02-18",
      "headline": "Corbin Bosch confident South Africa's Ahmedabad experience gives edge over India ICC Men's T20 World Cup: South Africa pacer Corbin Bosch said his side's experience of playing three group league matches in Ahmedabad has given the team valuable clarity ahead of their Super Eights fixture against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-t20-world-cup-netherlands-third-duck-equals-sanju-samson-record-2870539-2026-02-18",
      "headline": "Abhishek Sharma's nightmare T20 World Cup continues with third duck in a row T20 World Cup 2026, IND vs NED: Abhishek Sharma registered his third duck of the competition after being dismissed by off-spinner Aryan Dutt in the Group A clash on Wednesday at the Narendra Modi Stadium in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ricky-ponting-slams-australia-no-aura-shock-exit-2870499-2026-02-18",
      "headline": "Ponting slams Australia after shock exit, says they lacked past champions' aura T20 World Cup 2026: Ricky Ponting was heavily critical of the Australian side led by Mitchell Marsh following their shock group-stage exit after losses to Zimbabwe and Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ned-t20-world-cup-2026-washington-sundar-returns-axar-patel-rested-before-super-8-2870520-2026-02-18",
      "headline": "IND vs NED: Washington Sundar returns, Axar rested for final game before Super 8s T20 World Cup 2026: After winning the toss and choosing to bat first, India's captain, Suryakumar Yadav, revealed that they have made two changes to the side facing the Netherlands at the Narendra Modi stadium in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-namibia-t20-world-cup-sahibzada-farhan-century-super-8-2870484-2026-02-18",
      "headline": "Pakistan bounce back from India debacle, down Namibia to reach Super 8T20 World Cup, PAK vs NAM: Sahibzada Farhan scored his maiden T20I century as Pakistan qualified for the Super 8 after beating Namibia by 102 runs in their must-win Group A clash on Wednesday in Colombo. Usman Tariq was the pick of the bowlers for Pakistan with figures of 3.3-1-16-4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-netherlands-t20-world-cup-live-score-today-match-updates-ahmedabad-abhishek-sharma-2870479-2026-02-18",
      "headline": "IND vs NED Highlights: India beat Netherlands, reach Super 8s unbeatenIndia (IND) vs Netherlands (NED) Highlights, T20 World Cup: NAM (176/7 in 20 ov). India qualify for Super 8s unbeaten. They now have 12 T20 World Cup games in a row. The Suryakumar Yadav team beat the Netherlands by 17 runs in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-pm-inquiry-hockey-team-captain-claims-team-washed-dishes-in-australia-2870429-2026-02-18",
      "headline": "Pak PM steps in after hockey team captain claims team washed dishes in AustraliaPakistan Prime Minister Shehbaz Sharif has ordered a formal inquiry into the national hockey team's troubled Australia tour. Captain Ammad Shakeel Butt publicly criticised the national federation after videos showed the team was stranded in Sydney. The players were left without proper hotel accommodation and forced to do daily chores during a week-long tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sahibzada-farhan-becomes-second-pakistan-man-to-hit-a-hundred-in-t20-world-cup-2870408-2026-02-18",
      "headline": "Sahibzada Farhan becomes second Pakistan man to hit a hundred in T20 World CupSahibzada Farhan produced a timely and composed century to become only the second Pakistani to score a hundred in the T20 World Cup, guiding Pakistan to 199 for three against Namibia in a must-win match on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/matheesha-pathirana-ruled-out-t20-world-cup-calf-injury-sri-lanka-setback-2870392-2026-02-18",
      "headline": "Matheesha Pathirana ruled out of T20 WC, Sri Lanka name replacement before Super 8T20 World Cup, SL vs ZIM: Sri Lanka batting coach Vikram Rathour confirmed that Matheesha Pathirana has been ruled out of the mega event after sustaining a calf injury against Australia. Dilshan Madudhanka has replaced the pacer in the squad. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-drop-shaheen-afridi-for-namibia-clash-amid-social-media-criticism-2870348-2026-02-18",
      "headline": "Sad news for Namibia: Shaheen Afridi trolled after Pak drop pacer for must-win gameT20 World Cup, PAK vs NAM: Shaheen Shah Afridi faced heavy trolling after being left out of Pakistan's must-win clash against Namibia on Wednesday. The left-arm pacer was dropped following his expensive spell against India in Colombo on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-uae-t20-world-cup-aiden-markram-corbin-bosch-delhi-2870338-2026-02-18",
      "headline": "4 out of 4, India next: South Africa get ready for Super 8, breeze past UAET20 World Cup 2026: South Africa breezed past the UAE to maintain their 100 percent record in the T20 World Cup 2026 and get ready for the India clash in Ahmedabad. The Proteas won the match by six wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-t20-world-cup-exit-risks-2028-olympic-qualification-2870317-2026-02-18",
      "headline": "Australia risk missing Olympic berth after group-stage exit in T20 World CupT20 World Cup: Australia's early exit from the ongoing ICC tournament could cost them a place at the 2028 Summer Olympics in Los Angeles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jammu-and-kashmir-in-ranji-final-jk-cm-and-bcci-chief-lead-congratulatory-wishes-2870294-2026-02-18",
      "headline": "Jammu & Kashmir in Ranji final: J&K CM, BCCI chief congratulate team for historic winJammu and Kashmir entered their maiden Ranji Trophy final after defeating Bengal by six wickets in the semifinal on February 18, 2026, drawing congratulations from chief minister Omar Abdullah, BCCI president Mithun Manhas and former India all-rounder Irfan Pathan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-namibia-score-today-colombo-weather-t20-world-cup-match-updates-2870293-2026-02-18",
      "headline": "PAK vs NAM highlights: Pakistan into Super 8s with 102 run win over NamibiaPakistan (PAK) vs Namibia (NAM) highlights, T20 World Cup 2026: Usman Tariq finished with a four-wicket haul, taking Pakistan into the Super 8s with a comprehensive 102-run win over Namibia in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-jr-racism-benfica-prestianni-ucl-controversy-2870264-2026-02-18",
      "headline": "Vinicius Jr. racism row: What happened in Lisbon during Real Madrid vs BenficaThe Real Madrid-Benfica clash in the UEFA Champions League ended in controversy as Vinicius Jr. alleged that Gianluca Prestianni racially abused him after he got the decisive goal in Lisbon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-uae-sohaib-khan-story-bihar-dubai-jamia-delhi-2870205-2026-02-18",
      "headline": "Bihar to Dubai via Delhi: UAE star Sohaib Khan's long road to the T20 World CupAfter years of trying to break into India's domestic circuit, Bihar-born Sohaib Khan has finally found his stage. Now a core member of the UAE cricket team, the 27-year-old returned to Delhi and made a mark in the T20 World Cup. Here's his story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jammu-kashmir-ranji-trophy-finals-2024-nabi-nine-wickets-samad-batting-2870187-2026-02-18",
      "headline": "Ranji Trophy: Jammu and Kashmir script history, stun Bengal to reach maiden finalJammu and Kashmir reached the Ranji Trophy finals for the first time in 67 years after defeating Bengal in the semifinal. Auqib Nabi's stunning nine-wicket match haul and their IPL star Abdul Samad's fearless strokeplay ensured their passage into the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/ammnad-shakeel-butt-australia-tour-controversy-lie-protect-pakistan-2870181-2026-02-18",
      "headline": "I lied on video: Pak hockey captain spills all about team's horror in SydneyPakistan hockey captain Ammad Shakeel Butt has admitted he lied in a video where he denied the team's ordeal during their recent Australia tour. The players were left without proper hotel accommodation and forced to do daily chores due to mismanagement by the Pakistan Hockey Federation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-india-boycott-u-turn-naqvi-dissanayake-t20-world-cup-2870101-2026-02-18",
      "headline": "Mohsin Naqvi names real hero behind Pakistan's India match boycott U-turnT20 World Cup: Mohsin Naqvi said that the actual hero behind Pakistan's India match boycott U-turn was Sri Lanka president Anura Kumara Dissanayake and thanked him for his timely intervention. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sikandar-raza-zimbabwe-t20-world-cup-2026-super-8-redemption-story-2870059-2026-02-18",
      "headline": "Muqaddar ka Sikandar: How Raza turned heartbreak into happiness for ZimbabweT20 World Cup: Zimbabwe missed out on qualifying for the tournament in 2024, but this time around, Sikandar Raza's men have secured their berth in the Super 8. It was Raza, with his inspirational leadership and attitude, aims to keep his side grounded and continue their journey towards bigger goals at the T20 World Cup 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-namibia-t20-world-cup-2026-must-win-clash-colombo-2870028-2026-02-18",
      "headline": "PAK vs NAM weather forecast: Will Pakistan suffer Australia's fate?Pakistan takes on Namibia in a crucial Group A fixture at the Sinhalese Sports Club in Colombo, needing a win to stay alive in the T20 World Cup 2026. But will the weather play spoilsport during the contest?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-biopic-inspired-usman-tariq-pakistan-t20-world-cup-comeback-2870024-2026-02-18",
      "headline": "How Dhoni's Biopic sparked Usman Tariq's stunning cricket comebackT20 World Cup: Pakistan's Usman Tariq credited MS Dhoni's biopic for inspiring him to make a comeback in cricket and make his bow in the ongoing T20 World Cup 2026. Tariq has been one of Pakistan's main bowlers during the competition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-netherlands-t20-world-cup-preview-ahmedabad-pitch-report-predicted-playing-xi-2869857-2026-02-18",
      "headline": "IND vs NED: India look to enter Super Eight with a perfect group stage recordT20 World Cup, India vs Netherlands: Already through to the Super Eights, India will look to extend their unbeaten run and cap off their group-stage campaign on a high when they take on the Netherlands at the Narendra Modi Stadium in Ahmedabad on Wednesday."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}