{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-clarifies-on-google-play-alert-no-issues-with-paytm-upi-2780091-2025-09-01",
      "headline": "Paytm clarifies on Google Play alert, no issues with Paytm UPIPaytm noted that this transition is part of its migration to new UPI handles after receiving approval from the National Payments Corporation of India (NPCI) to operate as a Third Party Application Provider (TPAP). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-554-points-higher-nifty-above-24600-mahindra-gains-4-percent-2780080-2025-09-01",
      "headline": "Sensex closes 554 points higher, Nifty above 24,600; Mahindra gains 4%The S&P BSE Sensex gained 554.84 points to close at 80,364.49, while the NSE Nifty50 added 198.20 points to close at 24,625.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-india-rely-on-china-for-trade-amid-trumps-50-tariff-tsunami-2780065-2025-09-01",
      "headline": "Can India rely on China to counter Trump's 50% tariff shock?With US tariffs hitting 50% and Indian exporters scrambling, turning to China may seem tempting. But the strategic and economic risks are real. But can India really rely on China as trade tensions escalate with the US after Donald Trump's tariff tsunami?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hardeep-singh-puri-russia-oil-profit-india-us-tariff-sco-meet-pm-modi-vladimir-putin-china-2780079-2025-09-01",
      "headline": "Is India profiting from Russian oil? Union Minister Hardeep Singh Puri explainsUS President Donald Trump recently announced new tariffs on exports in an effort to discourage India's oil imports from Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-to-avoid-a-defective-itr-filing-explains-tax-expert-2780060-2025-09-01",
      "headline": "How to avoid a 'defective' ITR filing, explains tax expertFiling your income tax return is more than just declaring income and paying taxes. Missing key disclosures can make your ITR \"defective\" and even attract steep penalties, warns tax expert. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-market-rising-today-sensex-up-500-points-nifty-gain-it-stocks-rally-infosys-techm-2780042-2025-09-01",
      "headline": "Sensex gains 500 points: Why is stock market rising today?The S&P BSE Sensex was up 529.17 points to 80,338.82, while the NSE Nifty50 gained 185.20 points to 24,612.05 as of 2:15 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/looking-for-higher-fd-returns-these-small-finance-banks-offer-up-to-777-percent-2780012-2025-09-01",
      "headline": "Looking for higher FD returns? These small finance banks offer up to 7.77%If you're hunting for better fixed deposit returns, small finance banks are offering rates as high as 7.77%, outpacing larger lenders. Here's a look at some of the top options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-all-time-low-fall-speculative-bets-hedging-trump-tariff-pm-modi-2780011-2025-09-01",
      "headline": "Rupee falls to all-time low of 88.33 against US dollar amid tariff woesThe fall also came as investors reacted to the recent move by the United States to raise tariffs on goods, which has added to concerns over India's trade and fiscal outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-and-silver-soar-to-record-highs-should-you-buy-now-2779944-2025-09-01",
      "headline": "Gold and silver soar to record highs. Should you buy now?Gold and silver prices have surged to fresh record levels, supported by global uncertainty, Fed rate cut hopes, and a weaker dollar. With bullion shining brighter than ever, many investors are asking the same question, i.e., should you enter now?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/amanta-healthcare-ipo-2025-subscription-status-gmp-review-2779924-2025-09-01",
      "headline": "Amanta Healthcare IPO kicks off with 22% GMP. Should you apply?The IPO will close on September 3, 2025, with the allotment of shares expected on September 4.  The price band for the IPO has been fixed at Rs 120 to Rs 126 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/explained-why-you-should-never-invest-emergency-funds-in-stocks-mutual-funds-2779909-2025-09-01",
      "headline": "Explained: Why you should never invest emergency funds in stocks, mutual fundsEven disciplined savers can face a harsh reality if emergency funds are illiquid. Safety and immediate access are paramount and returns are secondary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-sbi-card-itr-to-lpg-price-5-big-money-rule-changes-from-september-1-2779884-2025-09-01",
      "headline": "From SBI card, ITR to LPG price: 5 big money rule changes from September 1September kicks off with fresh changes in banking, taxes, and household expenses. From SBI card rules to LPG prices and ITR deadlines, here are the five updates that could directly impact your pocket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/vikran-engineering-ipo-shares-allotment-status-out-gmp-listing-date-market-debut-2779867-2025-09-01",
      "headline": "Vikran Engineering IPO: Check allotment status, GMP and listing dateInvestors who applied for shares can check their allotment status through either the BSE website or the IPO registrar, Bigshare Services Pvt Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-china-trade-ties-tianjin-talks-pm-modi-xi-jinping-2779831-2025-09-01",
      "headline": "How India-China trade ties have evolved over the years and why it matters nowTwo decades ago, India-China trade barely existed. In the early 2000s, the numbers were so small they hardly showed up on global trade charts. India exported raw materials like iron ore, while Chinese goods rarely made it into Indian markets. Then came the boom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-250-points-nifty-above-24500-infosys-gains-over-15-2779822-2025-09-01",
      "headline": "Sensex jumps 250 points, Nifty above 24,500; Infosys gains over 2%The S&P BSE Sensex was up 368.48 points to 80,178.13, while the NSE Nifty50 added 112.65 points to 24,539.50 as of 9:35 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/online-gaming-ban-by-government-hits-industry-with-mpl-to-sack-employees-in-india-with-revenue-stopped-2779698-2025-08-31",
      "headline": "MPL to layoff 60% India staff after money-based gaming ban: ReportPrime Minister Narendra Modi's government this month banned online paid games, citing financial and addiction risks, especially among youth, leading to a shutdown of many gaming apps offering paid fantasy cricket, rummy and poker games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-september-15-tax-deadline-get-an-extension-2779540-2025-08-31",
      "headline": "Will September 15 tax deadline get an extension?As taxpayers rush to meet the September 15 ITR deadline, mounting portal issues and filing delays have raised the question – will the cut-off date be extended once again?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-rate-cut-tax-slabs-rationalisation-consumption-drive-product-categorisation-council-meet-september-2779183-2025-08-30",
      "headline": "GST rate cuts to benefit you, but categorisation will decide how muchThe GST Council, which will meet for its 56th session in New Delhi on 3–4 September, is expected to discuss widening the nil-rate slab, merging rates, and reducing GST on selected items currently taxed at 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-economy-growth-us-tariffs-downside-risk-cea-v-anantha-nageswaran-2779002-2025-08-29",
      "headline": "Economy to grow 6.3-6.8% in FY26, US tariffs pose downside risk: GovernmentChief Economic Advisor V Anantha Nageswaran said that high tariffs are expected to be \"short-lived\" as both countries are in talks for the removal of the 25 per cent penal tariff and a subsequent bilateral trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jo-hai-thama-sa-chal-niklega-vijay-shekhar-sharma-at-paytm-agm-2778822-2025-08-29",
      "headline": "Jo Hai Thama Sa, Chal Niklega: Vijay Shekhar Sharma at Paytm AGMPaytm's AGM today began not with data or charts, but with Vijay Shekhar Sharma reciting a Hindi poem by Anand Ji from Varanasi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-rs-10000-expansion-lucknow-airport-cargo-capacity-modernising-terminal-3-2778816-2025-08-29",
      "headline": "Adani Airports to invest Rs 10,000 crore in Lucknow expansionThe investment will be made in phases and will focus on increasing capacity, modernising facilities, adopting new technology, and improving cargo infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gdp-growth-accelerates-to-78-in-q1fy26-beats-estimates-2778774-2025-08-29",
      "headline": "India's GDP growth accelerates to 7.8% in Q1 FY26, beats estimatesThe latest GDP data shows that India's economy started the financial year 2025-26 on a strong note, with overall GDP growth ahead of expectations amid global headwinds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-why-shares-dropped-over-2-despite-jio-ipo-buzz-and-ai-push-2778755-2025-08-29",
      "headline": "Reliance AGM: Why shares dropped over 2% despite Jio IPO buzz and AI pushAddressing shareholders, Mukesh Ambani promised that Jio has the potential to deliver value comparable to global leaders and called the IPO an \"attractive opportunity\" for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-teams-up-with-meta-to-bring-enterprise-ai-solutions-to-india-2778751-2025-08-29",
      "headline": "Reliance teams up with Meta to bring enterprise AI solutions to IndiaThe joint venture will create AI platforms and tools based on Meta's open-source Llama models. These will be designed to help businesses improve efficiency across areas like customer service, sales, IT operations, finance, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-271-points-lower-nifty-below-24500-ril-shares-down-2-percent-2778743-2025-08-29",
      "headline": "Sensex closes 271 points lower, Nifty below 24,500; RIL down 2%The S&P BSE Sensex was down 270.92 points to close at 79,809.65, while the NSE Nifty lost 74.05 points to end at 24,426.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jio-ipo-likely-to-make-dalal-street-debut-by-1st-half-of-2026-2778717-2025-08-29",
      "headline": "Jio IPO likely to make Dalal Street debut by 1st half of 2026Jio IPO: The announcement was made by Reliance Chairman Mukesh Ambani in his address to investors at the conglomerate's 48th Annual General Meeting (AGM)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-falls-to-all-time-low-of-8797-amid-us-tariff-concerns-2778695-2025-08-29",
      "headline": "Rupee falls to all-time low of 87.97 amid US tariff concernsA weaker rupee against the yuan could offer a partial cushion for exporters hit by US tariffs, making Indian products relatively cheaper compared to Chinese rivals. It could also help narrow India's trade deficit with China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-jio-ipo-retail-public-listing-mukesh-ambani-time-ril-shares-brokerage-view-2778670-2025-08-29",
      "headline": "Reliance AGM 2025: Will Mukesh Ambani announce Jio IPO?The main talking point at the Reliance AGM will be information about the much-awaited initial public offerings (IPOs) of Jio Platforms and Reliance Retail finally get a timeline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanjeev-sanyal-hints-at-major-overhaul-in-epfo-with-30-rollout-2778669-2025-08-29",
      "headline": "Sanjeev Sanyal hints at major overhaul in EPFO with 3.0 rolloutEconomist Sanjeev Sanyal has signalled that the Employees' Provident Fund Organisation (EPFO) is gearing up for a major transformation, with the much-awaited EPFO 3.0 promising faster, simpler, and more digital-first services."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/trumps-50-percent-tariffs-could-cost-india-usd-55-60-billion-warns-jefferies-global-head-of-equity-strategy-chris-wood-2778657-2025-08-29",
      "headline": "Trump's draconian tariffs may cost India $55-60 billion, warns Jefferies' Chris WoodChris Wood argues that the US tariffs are as much political as economic. He links the steep duties to Donald Trump's \"personal pique\" at being denied a role in resolving India-Pakistan tensions after their four-day conflict in May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cash-rich-but-time-poor-why-real-wealth-is-about-balance-explains-ca-2778622-2025-08-29",
      "headline": "Cash-rich but time-poor? Why real wealth is about balance, explains CAIn today's fast-paced world, people often chase bigger salaries and titles, but an expert says money alone cannot define wealth. What matters more, he argues, is the freedom to spend time on things that truly count."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-50-percent-us-tariff-blow-dent-india-economic-growth-in-q1-2778584-2025-08-29",
      "headline": "Will 50% US tariffs hit India's economic growth in Q1 and beyond?US tariffs, slow private investment, and weak urban demand are testing India's growth. Can GST cuts, government spending, and a strong monsoon keep the economy from stalling?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-agm-today-5-things-you-need-to-know-2778573-2025-08-29",
      "headline": "Reliance AGM today: 5 things you need to knowAll eyes will be on Reliance Industries as it holds its 48th AGM today at 2 PM. From Jio and retail IPO buzz to its push into green energy and AI, investors are bracing for big announcements from Mukesh Ambani."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/former-rbi-governor-urjit-patel-appointed-imf-executive-director-2778525-2025-08-29",
      "headline": "Former RBI governor Urjit Patel appointed IMF executive directorUrjit Patel succeeds K. Subramanian and will represent India, along with neighbouring countries including Bangladesh, Bhutan, and Sri Lanka, at the Washington-based global financial institution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-over-130-points-nifty-above-24500-mm-down-2-2778520-2025-08-29",
      "headline": "Sensex, Nifty open higher after two-day sell-off amid US tariff jittersAt 9:22 am, the S&P BSE Sensex rose 112 points to 80,193.25, while the NSE Nifty50 gained 45 points to 24,545.90. Broader markets also edged higher as volatility eased slightly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-gets-another-six-month-extension-to-lease-turkish-airlines-planes-glbs-2778448-2025-08-29",
      "headline": "IndiGo gets another six-month extension to lease Turkish Airlines planesThe extension will help IndiGo cut losses caused by geopolitical restrictions, the airline said, referring to an airspace ban imposed by Pakistan on Indian airlines earlier this year that has led to longer routes and higher costs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-to-boost-russian-oil-imports-in-september-despite-us-pressure-report-2778293-2025-08-28",
      "headline": "India to boost Russian oil imports in September despite US pressure: ReportIndia has become Russia's biggest oil customer since Western sanctions forced Moscow to redirect supplies in 2022. Cheaper Russian crude has helped Indian refiners keep costs down, but the trade has also attracted criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-extends-duty-free-cotton-imports-to-shield-textile-sector-from-us-tariffs-2778283-2025-08-28",
      "headline": "India extends duty-free cotton imports to shield textile sector from US tariffsFor mills, the duty-free extension offers much-needed relief. The earlier exemption, ending in September, was too short to allow large imports, as shipments from exporting nations often take more than a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cibil-credit-score-how-to-improve-grievance-loan-approval-emis-personal-finance-2778278-2025-08-28",
      "headline": "CIBIL Decoded: How delayed credit score updates can hit your loans and ratesA delay of even a few weeks in updating information with the credit bureau can decide whether a person gets a loan, how much interest they pay, or if they are denied altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-drops-1500-points-in-two-sessions-will-us-tariffs-keep-hitting-dalal-street-2778229-2025-08-28",
      "headline": "Sensex drops 1,500 points in two sessions: Will US tariffs keep hitting D-Street?Dalal Street remains volatile as global trade tensions collide with domestic pressures. Investors face uncertainty, with heavyweights under pressure, mid- and small-caps slipping, while cautious buying emerges at key support levels."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/soni-razdan-recalls-losing-work-after-marrying-mahesh-bhatt-i-was-so-angry-2780076-2025-09-01",
      "headline": "Soni Razdan recalls losing work after marrying Mahesh Bhatt: I was so angryActor Soni Razdan reflected on the challenges she faced in the film industry, especially after marriage. She was last seen on 'Birds of Paradise', streaming on Prime Video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/your-name-the-body-swap-love-story-by-makoto-shinkai-that-changed-anime-forever-2780028-2025-09-01",
      "headline": "Your Name: The body-swap love story by Makoto Shinkai that changed anime foreverIn this week's Animania, we discuss how Makoto Shinkai's 'Your Name' became a global phenomenon, blending romance, comedy, and tragedy into the anime that turned him into a household name.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kalki-2898-ad-sequel-delay-focus-karna-ashwatthama-2780073-2025-09-01",
      "headline": "Director Nag Ashwin on Kalki 2898 AD sequel's production: Everyone is busyThe director of 2024's blockbuster film 'Kalki 2898 AD', Nag Ashwin, spoke about the timeline for the highly anticipated sequel to the Prabhas, Amitabh Bachchan and Deepika Padukone-starrer. The second part is yet to go on floors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ratna-pathak-shah-recalls-arguments-naseeruddin-shah-over-passion-for-acting-2779997-2025-09-01",
      "headline": "Ratna Pathak Shah recalls arguments with Naseeruddin over passion for actingRatna Pathak Shah shared that her view on acting is different from her husband-actor Naseeruddin Shah, who believes the skill must be an all-consuming passion. While she loves acting and takes it seriously, Ratna said it is not the only purpose of her life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-director-lokesh-kanagaraj-watches-rajinikanth-film-with-fans-in-coimbatore-2780050-2025-09-01",
      "headline": "Coolie director Lokesh Kanagaraj watches Rajinikanth film with fans in CoimbatoreDirector Lokesh Kanagaraj was seen watching 'Coolie' at a theatre in Tamil Nadu's Coimbatore. The Rajinikanth-starrer entered its fourth week in theatres."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vetri-maaran-shuts-production-house-with-bad-girl-last-film-amid-industry-struggles-2780083-2025-09-01",
      "headline": "Vetri Maaran shuts down production house with Bad Girl citing industry strugglesDirector Vetri Maaran shocked everyone by announcing the closure of his production house, Grass Root Film Company. He cited the struggles that producers face and said that 'Bad Girl' was his last film as a producer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bobby-deol-sunny-deol-birthday-wishes-mother-prakash-kaur-dharmednra-2779906-2025-09-01",
      "headline": "Deol brothers Bobby and Sunny celebrate mother Prakash Kaur's birthdayActor Bobby Deol shared a touching birthday message for his mother, Prakash Kaur, on social media. Sunny Deol also expressed his love with a short but sweet note."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/amish-tripathi-slams-bollywood-for-misrepresenting-history-says-it-misleads-viewers-2780059-2025-09-01",
      "headline": "Amish Tripathi slams Bollywood for misrepresenting history, says it misleads viewersAuthor Amish Tripathi criticised Bollywood for misrepresenting history in films like 'Padmaavat' and 'Jodhaa Akbar'. He said such portrayals distort India's history and mislead audiences about the past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/manoj-bajpayee-ram-gopal-varma-genelia-deshmukh-reunite-for-police-station-mein-bhoot-2780029-2025-09-01",
      "headline": "Manoj Bajpayee, Ram Gopal Varma reunite for Police Station Mein Bhoot, shoot beginsActor Manoj Bajpayee and director Ram Gopal Varma have reunited after 27 years for a new horror comedy titled 'Police Station Mein Bhoot', also starring Genelia D'Souza. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-hridayapoorvam-box-office-success-sathyan-anthikad-reunion-2780002-2025-09-01",
      "headline": "Mohanlal greets fans on video call during Hridayapoorvam cast's theatre visitMalayalam actor Mohanlal's Onam release 'Hridayapoorvam', which also stars Malavika Mohanan and Sangeeth Pratap, is running successfully in theatres. When Malavika and Sangeeth visited a theatre in Kerala, they surprised the fans by bringing Mohanlal on video call."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ar-rahman-discovers-musical-talents-social-media-reels-scores-hindi-silent-film-2780039-2025-09-01",
      "headline": "AR Rahman on discovering talents through reels: It's nice world is shrinkingAR Rahman, in a recent interview, said that he discovered talents through music platforms and also through reels. He highlighted the openness of cultural exchange in today's music scene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoor-triptii-dimrii-avinash-tiwary-scenic-drive-spain-video-vishal-bharadwaj-film-2779995-2025-09-01",
      "headline": "Shahid, Triptii and Avinash enjoy scenic drive in Spain. WatchShahid Kapoor, Triptii Dimrii and Avinash Tiwary recently went for a scenic drive in Spain. Avinash shared a video of the drive on social media. They recently wrapped up the shooting of an upcoming film directed by Vishal Bhardwaj."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/amaal-mallik-sexist-remark-bigg-boss-19-chudi-peheno-jibe-to-abhishek-bajaj-textbook-sexism-2780031-2025-09-01",
      "headline": "Amaal Mallik's chudi peheno remark on Bigg Boss 19 is not jibe, it's textbook sexismAmaal Mallik's \"chudi peheno\" remark to Abhishek Bajaj on 'Bigg Boss 19' may look like just another reality-show jibe, but it reflects something deeper - the casual sexism that often goes unchecked in conversations and arguments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/alladin-actor-mena-massoud-marries-emily-shah-hindu-coptic-christian-ceremonies-2780021-2025-09-01",
      "headline": "Alladdin actor Mena Massoud marries Emily Shah in Hindu, Coptic Christian ceremoniesAladdin actor Mena Massoud married Emily Shah in Hindu and Coptic Christian ceremonies. The couple announced the same with a special video on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/varun-dhawan-grooves-to-bijuria-with-sonu-nigam-childhood-song-2780020-2025-09-01",
      "headline": "Varun Dhawan grooves to Bijuria with Sonu Nigam: Mera bachpan ka gaanaVarun Dhawan grooved to the classic Sonu Nigam track 'Bijuria', which features in his upcoming film 'Sunny Sanskari Ki Tulsi Kumari'. The song, cherished since his childhood, is set to release on September 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ankita-lokhande-mourns-late-pavitra-rishta-co-star-priya-marathe-my-wedee-until-we-meet-again-2779994-2025-09-01",
      "headline": "Ankita Lokhande mourns late co-star Priya Marathe: My wedee, until we meet againActor Ankita Lokhande has paid an emotional tribute to her late friend and Pavitra Rishta co-star Priya Marathe. Priya died due to cancer at 38. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-rani-mukerji-revive-90s-charm-new-video-celebrate-national-award-win-the-bads-of-bollywood-2779988-2025-09-01",
      "headline": "SRK-Rani Mukerji add 90s twist to National Award win, promote Aryan Khan's seriesShah Rukh Khan and Rani Mukerji celebrated their National Award win beautifully. The two recreated 'The Ba***ds of Bollywood' song 'Tu Pehli Tu Akhri', leaving fans nostalgic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rukmini-vasanth-jr-ntr-prashanth-neel-film-yash-toxic-producer-nv-prasad-2779921-2025-09-01",
      "headline": "Rukmini Vasanth joins Jr NTR, Prashanth Neel's film and Yash's Toxic: ProducerActor Rukmini Vasanth of 'Sapta Sagaradache Ello' fame has been confirmed to feature in Jr NTR-Prashanth Neel's upcoming film, and also in Yash's 'Toxic'. Telugu film producer NV Prasad talked about her upcoming line-up of films at 'Madhraasi' event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nelson-dilipkumar-silent-on-simbu-vetrimaaran-photo-rumours-2779942-2025-09-01",
      "headline": "Jailer director Nelson discusses viral pic featuring him, Simbu and Vetri MaaranA leaked photo featuring Silambarasan TR aka Simbu, Vetri Maaran, and director Nelson Dilipkumar has sparked rumours about an upcoming collaboration. At a recent event, Nelson Dilipkumar was asked if he was part of Simbu and Vetri's film."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/from-qingdao-walkout-to-tianjin-win-sco-backs-india-on-pahalgam-terror-attack-2779985-2025-09-01",
      "headline": "From Qingdao walkout to Tianjin win: SCO backs India on Pahalgam terror attackTwo months after Defence Minister Rajnath Singh chose to abstain from signing the SCO joint statement due to the omission of the Pahalgam terror attack at the Defence Ministers' meeting in Qingdao, the joint declaration at the leaders' meeting in Tianjin condemned the attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ride-or-die-pm-modi-putin-make-a-statement-with-carpool-sco-summit-tianjin-aurus-car-china-india-russia-ties-donald-trump-tariffs-2779910-2025-09-01",
      "headline": "Ride or die: PM Modi, Putin make a statement with carpoolPrime Minister Narendra Modi and Russian President Vladimir Putin shared a ride in a 'made in Russia' Aurus sedan to their bilateral meeting in Tianjin, with Modi later calling the exchange \"insightful\" in a post on X. The gestures highlighted the depth of India-Russia ties ahead of their bilateral talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/enduring-friendship-us-lauds-india-ties-as-modi-putin-optics-dominate-sco-summit-tianjin-china-xi-jinping-trump-tarriffs-2779996-2025-09-01",
      "headline": "Washington cheers lndia-US ties, right before Modi-Putin meetThe US Embassy in India posted a message highlighting the \"enduring friendship\" between Washington and New Delhi just as Prime Minister Narendra Modi and Russian President Vladimir Putin held bilateral talks at the SCO summit in Tianjin. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/plane-carrying-eu-chief-targeted-by-suspected-russian-gps-jamming-probe-ordered-2780130-2025-09-01",
      "headline": "EU chief's plane targeted by suspected Russian GPS jamming, probe orderedThe plane landed safely at a Bulgarian airport, the spokesperson added, while saying that Sofia told the Commission that it was \"blatant interference\" by Russia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/donald-trump-aide-peter-pavarro-remarks-trying-chaos-india-brahmin-caste-class-divide-opposition-rahul-gandhi-ammo-2780066-2025-09-01",
      "headline": "Is Trump trying to sow chaos in India?There is a definite pattern to the terms being used by Trump administration functionaries, including Peter Navarro, to attack India and PM Modi. Trump cronies are directly addressing Indians and trying to exploit the country's caste and class fault lines. This after the US injected chaos into Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/at-least-250-killed-400-injured-in-a-60-magnitude-earthquake-in-afghanistan-news-agency-ap-citing-officials-2779877-2025-09-01",
      "headline": "Over 800 killed, 2,800 injured as strong quake devastates Afghanistan: TalibanMore than 800 people have been killed and 2,800 injured in the 6.0-magnitude earthquake that hit Afghanistan late Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/peter-navarro-india-russian-oil-purchase-brahmins-profiteering-udit-raj-congress-us-2780008-2025-09-01",
      "headline": "Factually correct: Congress leader backs Trump aide's 'Brahmin' jab on Russian oilCongress leader Udit Raj backed Trump aide Peter Navarro's claim that Indian Brahmin-run corporates profit from Russian oil, saying ordinary Indians see no benefit and Dalits, backward castes face structural barriers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-pm-modi-putin-xi-jinping-camaraderie-at-sco-summit-tianjin-shehbaz-sharif-left-on-sidelines-2779789-2025-09-01",
      "headline": "Video: PM, Putin, Xi camaraderie at SCO summit; Shehbaz Sharif left on sidelinesPrime Minister Narendra Modi, Russian President Vladimir Putin and Chinese President Xi Jinping were seen in a headline-grabbing huddle marked by handshakes and laughs. Soon after, PM Modi and Putin walked past Shehbaz Sharif who appeared to have been sidelined at the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/would-you-ever-gift-your-teen-a-sex-toy-gautami-kapoor-thinks-its-time-2779959-2025-09-01",
      "headline": "Should parents even introduce their teens to sex toys?When Gautami Kapoor said she wanted to gift a sex toy to her teenage daughter, it wouldn't be an exaggeration to say that the internet lost it. The backlash reflected not just discomfort with her remark but also India's deep unease with conversations around sex, especially when it involves teenagers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-sir-65-lakh-voters-excluded-30000-apply-2-lakh-application-delete-names-special-intensive-revision-electoral-rolls-2779989-2025-09-01",
      "headline": "Bihar SIR numbers tell a story: 65 lakh exclusions, just 30k apply to get back inDespite 65 lakh voters being excluded from Bihar's voter rolls, only around 30,000 applications have filed for inclusion during the month-long revision window. Over 2 lakh requests sought deletions instead. The Congress claimed 89 lakh complaints were ignored, even as the EC defended its process. The matter regarding the extension of the deadline for claim filing is being heard in the Supreme Court today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/one-who-can-fool-people-nitin-gadkaris-definition-of-best-leader-sparks-row-2780062-2025-09-01",
      "headline": "One who can fool is best leader: Nitin Gadkari says truth discouraged in politicsUnion minister Nitin Gadkari stirred debate with his remarks, saying the leader who can best fool people often succeeds, though he stressed that honesty, credibility and truth ultimately remain the most important values in society."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/javed-akhtar-event-kolkata-event-cancelled-mamata-banerjee-west-bengal-urdu-academy-jamiat-ulema-e-hind-wahyahin-2779879-2025-09-01",
      "headline": "Mamata govt bows down to Islamists, Urdu Academy scraps Javed Akhtar eventThe West Bengal government it seems has abjectly surrendered to Islamists. The state government-run Urdu Academy has put off its literary event after the Jamiat Ulema-e-Hind and the Wahyahin Foundation objected to it inviting poet-lyricist Javed Akhtar for a mushaira. They said Akhtar repeatedly \"spoke against religion and God\". The real reason for the event's cancellation was fear of unrest and political fallout ahead of Assembly elections in Bengal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/male-teachers-india-stigma-low-pay-decline-2779917-2025-09-01",
      "headline": "From classroom to boardroom: Why male teachers don't get the same respect as CEOsMale teachers in India are leaving classrooms due to low pay and social stigma. This trend threatens gender balance and reinforces stereotypes in education."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/top-court-dismisses-plea-against-nationwide-rollout-of-20-ethanol-blended-petrol-2780030-2025-09-01",
      "headline": "Supreme Court dismisses plea against rollout of 20% ethanol blended petrolA bench led by Chief Justice of India B R Gavai dismissed the plea, which had alleged that millions of motorists were being forced to use E20 fuel, despite it not being designed for use in many vehicles currently in operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-judge-sanjeev-kumar-singh-suspended-after-allegations-of-forcing-sexual-assault-victim-to-settle-2780107-2025-09-01",
      "headline": "Delhi judge suspended after allegations of forcing sexual assault victim to settleJudge Sanjeev Kumar Singh has been directed to remain at headquarters and will receive only subsistence allowance during the period of suspension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/south-mumbai-massive-traffic-jams-manoj-jarange-patil-maratha-quota-stir-enters-day-four-2780105-2025-09-01",
      "headline": "Massive traffic jams in Mumbai as Maratha quota protesters occupy streetsMaratha activist Manoj Jarange Patil has been pressing for a 10 per cent quota and declared that he would not leave Mumbai until the demand is met. The protest entered its fourth day on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-crashes-indian-brides-wedding-in-us-internet-cant-stop-watching-2779866-2025-09-01",
      "headline": "Justin Bieber crashes Indian bride's wedding in US, internet can't stop watchingPop icon Justin Bieber surprised an Indian bride by making an unexpected appearance at her wedding in Los Angeles, creating a viral sensation on social media. A video and several pictures from the bash have since gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/nikki-bhati-dowry-case-greater-noida-news-viral-reel-making-family-society-instagram-reels-women-violence-patriarchy-2778950-2025-08-31",
      "headline": "How women with risqué content have India reelingSocial media shorts and Instagram Reels are creating dangerous friction in Indian society. The technology of the 21st century is clashing with the mores of a society still in the 19th century. While men opt for risky, women are getting into risque and vulgar content in an economy where eyeballs convert to hard cash. The Nikki Bhati case is just the tip of the iceberg. Here's how Indian society is reeling from the reel-making tornado."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/connectivity-that-bypasses-sovereignty-loses-trust-pm-modis-veiled-swipe-at-china-over-belt-and-road-project-2779850-2025-09-01",
      "headline": "Connectivity that bypasses sovereignty..: PM calls out China's mega road projectAt the SCO summit in Tianjin, Prime Minister Narendra Modi subtly criticised China's Belt and Road Initiative, saying connectivity projects must respect sovereignty or risk losing trust and credibility. Highlighting India's own infrastructure initiatives such as Chabahar Port and the International North-South Transport Corridor, Modi emphasised security, connectivity, and opportunity as the three pillars of India's SCO policy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-all-time-low-fall-speculative-bets-hedging-trump-tariff-pm-modi-2780011-2025-09-01",
      "headline": "Rupee falls to all-time low of 88.33 against US dollar amid tariff woesThe fall also came as investors reacted to the recent move by the United States to raise tariffs on goods, which has added to concerns over India's trade and fiscal outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/young-indians-multivitamins-nutrient-deficiency-supplements-growth-2779967-2025-09-01",
      "headline": "Why are young Indians popping multivitamins?Hectic lifestyle and poor nutrition leave young Indians increasingly relying on multivitamins. This trend reflects a shift towards preventive health but warns against overuse without medical guidance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/last-person-to-touch-hubble-telescope-in-space-megan-mcarthur-retires-from-nasa-2780103-2025-09-01",
      "headline": "Last person to touch Hubble telescope in space retires from NasaAstronaut Megan McArthur's first spaceflight was aboard the space shuttle Atlantis in 2009 on the STS-125 mission, the fifth and final servicing mission to the Hubble telescope. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-india-rely-on-china-for-trade-amid-trumps-50-tariff-tsunami-2780065-2025-09-01",
      "headline": "Can India rely on China to counter Trump's 50% tariff shock?With US tariffs hitting 50% and Indian exporters scrambling, turning to China may seem tempting. But the strategic and economic risks are real. But can India really rely on China as trade tensions escalate with the US after Donald Trump's tariff tsunami?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/lasting-peace-in-ukraine-call-of-entire-humanity-pm-modi-to-putin-during-bilateral-meeting-in-tianjin-2779937-2025-09-01",
      "headline": "Peace in Ukraine call of entire humanity: PM to Putin during bilateral in ChinaPM Narendra Modi pressed for \"lasting peace\" in Ukraine during talks with Russian President Vladimir Putin at the SCO summit in China's Tianjin and also reaffirmed India-Russia ties amid the US tariff offensives. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-back-injury-ashes-series-2025-26-2780085-2025-09-01",
      "headline": "Pat Cummins faces back injury concerns ahead of Ashes 2025-26Australia captain Pat Cummins may not play all five Tests in the upcoming Ashes series, as he is struggling with a reported back problem. There are chances that the star pacer may pick and choose games for the five-match series, which begins on November 21."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mahanaryaman-scindia-elected-youngest-mpca-president-scindia-family-2780077-2025-09-01",
      "headline": "Mahanaryaman Scindia becomes youngest president of MP Cricket AssociationMahanaryaman Scindia has been unanimously elected as the youngest president of the Madhya Pradesh Cricket Association. Mahanaryaman's involvement in cricket administration has grown in the past three years. He was appointed GDCA vice-president and became a lifetime MPCA member in 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/asia-cup-hockey-craig-fulton-dilip-tirkey-interveiw-2780082-2025-09-01",
      "headline": "Hockey coach Craig Fulton reacts to Tirkey's reassurance on his futureAsia Cup 2025: Speaking to India Today, men's hockey team coach, Craig Fulton, responded to Hockey India president Dilip Tirkey's reassuring words about his future in the job. India are looking to win the Asia Cup In Rajgir to secure a World Cup berth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-tokyo-world-championships-2780072-2025-09-01",
      "headline": "Amid form concerns, will Neeraj be able to defend his World Championships title?Neeraj Chopra will lead India's 19-member squad at the Tokyo World Athletics Championships. Amid inconsistent form, will he be able to defend his world crown?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-snubs-kohli-from-list-of-top-5-cricketers-apologises-2780033-2025-09-01",
      "headline": "AB de Villiers snubs Kohli from list of top 5 cricketers, picks Mohammad AsifLegendary South Africa batter AB de Villiers snubbed Virat Kohli from his list of the top five cricketers. De Villiers and Kohli have played together in Royal Challengers Bengaluru (RCB) for number of seasons in the Indian Premier League (IPL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2023-day-9-sinner-gauff-osaka-fourth-round-schedule-timing-2780010-2025-09-01",
      "headline": "US Open Day 9 Order of Play: Tricky test for Sinner, Osaka takes on GauffUS Open 2025 Day schedule: Jannik Sinner and Iga Swiatek will be looking to book their place in the quarterfinals. In a blockbuster outing, former champion Naomi Osaka takes on third seed Coco Gauff at the Arthur Ashe Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-2025-prize-pool-rise-bigger-than-men-2779982-2025-09-01",
      "headline": "Women's World Cup to offer USD 3.88m more in prize money than men's 2023 editionThe ICC has announced a total prize pool of USD 13.88 million for the Women's World Cup, starting on 30 September in India. This is USD 3.88 million more than what was on offer at the Men's ODI World Cup in 2023."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-slams-lalit-modi-for-releasing-slap-gate-video-involving-sreesanth-2779972-2025-09-01",
      "headline": "Harbhajan slams Lalit Modi for releasing 'slap-gate' video involving SreesanthFormer India cricketer Harbhajan Singh has slammed Lalit Modi for releasing the unseen clip of the slap-gate incident involving him and Sreesanth from the Indian Premier League 2008 (IPL 2008)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-asia-cup-squad-jitesh-sharma-2779963-2025-09-01",
      "headline": "With Jitesh in fray, can Sanju Samson secure a middle-order spot in Asia Cup?Sanju Samson and Jitesh Sharma are the only two wicketkeepers named in India's Asia Cup 2025 squad. With the T20 World Cup 2026 on the horizon, will Sanju be able to beat the competition and make the place his own? Aakash Chopra delves deep into the debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-misses-daughter-tara-birthday-us-open-quarter-final-2779939-2025-09-01",
      "headline": "US Open glory over birthday bash: Djokovic says daughter not happy with clashNovak Djokovic will miss his daughter Tara's eighth birthday to focus on his US Open quarter-final against Taylor Fritz. The Serb aims to gift his daughter a victory despite her disappointment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-asia-cup-test-debut-2779928-2025-09-01",
      "headline": "Not just a T20 specialist: Rinku Singh puts his hand up for Test cricketIndia batter Rinku Singh does not want to be an one-format star. Speaking on the sidelines of the UP T20 League he said that he wants to make his debut in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-2025-prize-pool-rise-bigger-than-men-2779982-2025-09-01",
      "headline": "Women's World Cup to offer USD 3.88m more in prize money than men's 2023 editionThe ICC has announced a total prize pool of USD 13.88 million for the Women's World Cup, starting on 30 September in India. This is USD 3.88 million more than what was on offer at the Men's ODI World Cup in 2023."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-slams-lalit-modi-for-releasing-slap-gate-video-involving-sreesanth-2779972-2025-09-01",
      "headline": "Harbhajan slams Lalit Modi for releasing 'slap-gate' video involving SreesanthFormer India cricketer Harbhajan Singh has slammed Lalit Modi for releasing the unseen clip of the slap-gate incident involving him and Sreesanth from the Indian Premier League 2008 (IPL 2008)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-asia-cup-squad-jitesh-sharma-2779963-2025-09-01",
      "headline": "With Jitesh in fray, can Sanju Samson secure a middle-order spot in Asia Cup?Sanju Samson and Jitesh Sharma are the only two wicketkeepers named in India's Asia Cup 2025 squad. With the T20 World Cup 2026 on the horizon, will Sanju be able to beat the competition and make the place his own? Aakash Chopra delves deep into the debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-misses-daughter-tara-birthday-us-open-quarter-final-2779939-2025-09-01",
      "headline": "US Open glory over birthday bash: Djokovic says daughter not happy with clashNovak Djokovic will miss his daughter Tara's eighth birthday to focus on his US Open quarter-final against Taylor Fritz. The Serb aims to gift his daughter a victory despite her disappointment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-asia-cup-test-debut-2779928-2025-09-01",
      "headline": "Not just a T20 specialist: Rinku Singh puts his hand up for Test cricketIndia batter Rinku Singh does not want to be an one-format star. Speaking on the sidelines of the UP T20 League he said that he wants to make his debut in Test cricket."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}