{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-ril-lt-tech-hdfc-life-hero-motocorp-ltimindtree-q3-results-2665466-2025-01-16",
      "headline": "Stocks to watch today: RIL, L&T Tech, HDFC Life, Hero MotoCorp, SwiggyInvestors will closely watch RIL, Infosys, Axis Bank, and LTIMindtree as these companies are scheduled to announce their third-quarter earnings today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sharechat-to-cut-5-percent-of-its-workforce-amid-performance-reviews-report-2665254-2025-01-15",
      "headline": "ShareChat to cut 5% of its workforce amid performance reviews: ReportShareChat has announced slashing 5% of its headcount to enhance operational efficiency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/3-must-know-sections-under-old-tax-regime-to-save-money-2665199-2025-01-15",
      "headline": "3 must-know sections under old tax regime to save moneyThe old regime offers several tax-saving opportunities under several sections."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/how-to-prevent-and-report-credit-card-fraud-a-complete-guide-2665174-2025-01-15",
      "headline": "How to prevent and report credit card fraud: A complete guideCustomers must know how to handle unauthorised credit card transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-climb-as-it-stocks-shine-ahead-of-us-inflation-data-2665153-2025-01-15",
      "headline": "Sensex, Nifty climb as IT stocks shine ahead of US inflation dataThe S&P BSE Sensex gained 224.45 points to close at 76,724.08, while the NSE Nifty50 added 37.15 points to end at23,213.20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-bond-sell-off-whats-going-on-and-will-it-impact-india-2665147-2025-01-15",
      "headline": "Global bond sell-off: What's going on, and will it have any impact on India?As the global bond sell-off continues to accelerate, here's how rising yields and higher borrowing costs may impact the Indian economy and stock markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/laxmi-dental-ipo-to-close-for-bidding-day-3-should-you-invest-check-latest-gmp-subscription-allotment-date-2665131-2025-01-15",
      "headline": "Laxmi Dental IPO to close for bidding: Should you invest? Check latest GMPLaxmi Dental IPO is expected to be listed on both the BSE and NSE, with the tentative listing date scheduled for Monday, January 20, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epf-withdrawal-why-you-should-link-aadhaar-and-uan-today-2665104-2025-01-15",
      "headline": "EPF withdrawal: Why you should link Aadhaar and UAN todayLinking bank accounts with UAN simplifies EPF management for a seemless experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-expectations-for-personal-income-tax-reforms-and-more-2665064-2025-01-15",
      "headline": "Budget 2025: Expectations for personal income tax reforms and moreBudget 2025: The middle-income group is looking forward to personal income tax revisions to ease their financial burden in the upcoming budget."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-stock-market-expectations-capital-gains-tax-ltcg-relief-dalal-street-investors-2665049-2025-01-15",
      "headline": "LTCG tax relief in Budget 2025? What stock market investors are hoping forStock markets are buzzing with anticipation for the upcoming budget, especially after the Finance Minister Nirmala Sitharaman announced key changes to capital gains taxation in her seventh Budget."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/union-budget-2025-old-and-new-income-tax-regime-merger-benefits-challenges-explained-2665029-2025-01-15",
      "headline": "Budget 2025: Is merging old and new income tax regimes a good idea?Budget 2025: Will merging the old and new tax regimes offer the best of both worlds for taxpayers? Experts weigh in on whether a unified system could simplify compliance or introduce new challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-10-key-financial-terms-every-taxpayer-must-know-2665024-2025-01-15",
      "headline": "Budget 2025: 10 key financial terms every taxpayer must knowThe Union Budget 2025 will be presented by Finance Minister Nirmala Sitharaman on February 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-3-key-expectations-of-homebuyers-2664988-2025-01-15",
      "headline": "Budget 2025: 3 key expectations of homebuyersThe housing sector plays an important role in India's GDP and employment generation, raising hopes for reforms to reduce costs and promote homeownership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-gain-for-2nd-straight-day-key-things-investors-should-track-2664976-2025-01-15",
      "headline": "Sensex up 500 points, Nifty continues positive run. What investors should doStock market today: The Sensex hit an intraday high of 76,991.05 and was trading 463.37 points higher at 76,963 at 10:55 am. The Nifty50 also rose 110.40 points to 23,286.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-green-share-price-continues-positive-run-rises-6-percent-whats-driving-the-strong-rally-2664960-2025-01-15",
      "headline": "Adani Green share price surges over 6% in early trade. What's driving the rally?Adani Green share price: At 10:20 am, the stock was trading 3.28% higher at Rs 1,040.60, continuing its positive momentum after jumping as much as 19% in the previous session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-higher-it-stocks-rebound-after-recent-slump-stock-market-today-2664941-2025-01-15",
      "headline": "Sensex, Nifty open higher; IT stocks rebound after recent slumpThe S&P BSE Sensex gained 144.53 points to76,644.16, while the NSE Nifty50 added 16.15 points to23,192.20 as of 9:30 AM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/haldiram-stake-pepsico-enters-bidding-against-temasek-alpha-wave-starts-talks-report-2664931-2025-01-15",
      "headline": "PepsiCo enters bidding for Haldiram stake against Temasek, Alpha Wave: ReportPepsiCo has initiated discussions with the Aggarwal family, who own Haldiram, for a minority stake. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-layoffs-decided-to-move-out-low-performers-ceo-mark-zuckerberg-5-percent-internal-memo-report-2664924-2025-01-15",
      "headline": "Meta layoffs: 3,600 to lose jobs as Mark Zuckerberg targets low performersMeta layoffs: The decision, shared in an internal memo by CEO Mark Zuckerberg, focusses on improving overall performance by moving out those not meeting expectations more quickly than before."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-hdfc-life-adani-energy-vedanta-irfc-sula-vineyards-lt-q3-results-sensex-nifty-2664918-2025-01-15",
      "headline": "Stocks to watch today: HDFC Life, Adani Energy, Vedanta, IRFC, Sula VineyardsShares of companies such as HDFC Life, Adani Energy, Vedanta, IRFC, CESC, Sula Vineyards, and Shoppers Stop are likely to remain in focus today due to news developments and quarterly results announcements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/we-wouldnt-do-that-itc-chief-sanjiv-puri-shares-view-on-90-hour-workweek-2664713-2025-01-14",
      "headline": "'We wouldn't do that': ITC chief Sanjiv Puri shares view on 90-hour workweekThe 90-hour workweek debate, triggered by L&T chairman SN Subrahmanyan's comments, has faced criticism from industry leaders and celebrities."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.However, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.While Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.Temple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. On the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.Deepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/joe-biden-farewell-address-speech-white-house-oval-office-oligarchy-in-america-dangerous-power-wealthy-donald-trump-transition-2665460-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Biden warns against 'oligarchy, dangerous concentration of power' in farewell speechJoe Biden is set to leave the White House on January 20, paving the way for his successor Donald Trump to return for a second stint as the US President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-agree-ceasefire-deal-to-end-15-month-gaza-war-2665409-2025-01-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israel, Hamas reach ceasefire deal to end 15-month Gaza war, release hostagesThe six-week initial agreement which will come into effect on January 19 will see the gradual withdrawal of Israeli forces from Gaza, and release of the Hamas-held hostagesin exchange for Palestinian prisoners taken into custody by Israel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/been-the-adventure-of-lifetime-short-selling-firm-hindenburg-research-to-close-up-shop-2665456-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US short seller Hindenburg Research winds down: Been the adventure of lifetimeNate Anderson, the founder of Hindenburg Research, on Wednesday said that the short-seller firm was shutting down. In his note, Anderson said that running the firm has been \"rather intense, and at times, all-encompassing\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-elections-arvind-kejriwal-declares-assets-worth-rs-173-ahead-of-polls-has-no-car-or-house-2665450-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No car, no house: Arvind Kejriwal declares assets worth Rs 1.73 crore ahead of pollsFormer Delhi Chief Minister Arvind Kejriwal on Wednesday filed his nomination for the Assembly polls. In his affidavit submitted to the Election Commission, Kejriwal declared assets worth Rs 1.73 crore, revealing that he owns neither a house nor a car."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/baba-abhay-singh-iit-bombay-now-at-maha-kumbh-in-quest-for-knowledge-2665372-2025-01-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meet IIT Baba, aerospace engineer whose quest for truth led him to spiritualismBaba Abhay Singh of Juna Akhara, an IIT-alumnus and former aerospace engineer, is famously known among the seers and sages at Maha Kumbh mela as 'IIT Baba'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-election-sanjay-singh-accuses-poll-officer-of-bjp-bias-official-clarifies-retweet-error-2665340-2025-01-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Reposting BJP tweet inadvertent, poll officer clarifies as AAP alleges biasSanjay Singh accused the District Election Officer of secretly retweeting BJP's posts on X. The DEO clarified that the post was mistakenly retweeted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/kerala-19-year-old-woman-dies-by-suicide-family-alleges-harassment-by-husband-over-english-skills-2665453-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woman dies by suicide, family alleges harassment by husband over English skillsThe 19-year-old woman died by suicide in Kerala's Malappuram district. Her family alleged that harassment by her husband and in-laws over her complexion and limited English proficiency drove her to take her own life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-laughs-off-reports-of-him-being-advised-bed-rest-after-australia-tour-2665384-2025-01-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jasprit Bumrah laughs off reports of him being advised bed rest after Australia tourStar India fast bowler Jasprit Bumrah mocked an X page for spreading fake news about his fitness. Bumrah got injured during the fifth Test vs Australia in Sydney and opted not to bowl from Day 2 onwards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/battleground-tourism-india-indian-army-ministry-of-tourism-galwan-siachel-kargil-longewala-battle-2665110-2025-01-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Add Galwan, Siachen to holiday plan. India is opening battle tourism bunkerNow, tourists can add historical battleground sites of the Indian armed forces to their list of travel destinations. The Indian Army, in association with the Ministry of Tourism, is launching Bharat Ranbhoomi Darshan, and would open up 77 battleground spots, including those in Siachen, Kargil and Galwan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/pollution-curbs-grap-iv-delhi-air-quality-worsens-aqi-2665270-2025-01-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Strictest pollution curbs back in Delhi: Construction banned, hybrid classes onThe dip in Delhi's air quality is attributed to dense fog, low temperatures, and poor atmospheric conditions that hinder the dispersion of pollutants."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/panel-advises-action-against-individual-months-after-pannun-murder-plot-charge-2665268-2025-01-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Panel advises action against 'individual' months after Pannun murder plot chargeThe government's enquiry panel recommended action against an \"individual\" with criminal links, without directly referring to the alleged failed assassination plot of Khalistani terrorist Pannun."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-elections-3-time-mla-ex-haryana-minister-avtar-singh-bhadana-son-arjun-in-congresss-4th-list-of-polls-2665454-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "3-time MLA, ex-Haryana minister's son in Congress's 4th list for Delhi electionsThe Congress on Wednesday released its fourth list of candidates for the Delhi Assembly elections, naming five nominees and taking the total number of declared candidates to 68 out of 70 seats. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/housing-toilet-freebies-boost-womens-voting-mp-leads-punjab-haryana-trail-2665086-2025-01-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Housing, toilet, freebies boost women's voting: MP leads; Punjab, Haryana trailA study says 18 million more women voted in the 2024 Lok Sabha polls, driven by better literacy, jobs, housing and sanitation, and schemes like PMAY and Mudra loans"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-day-5-live-sinner-swiatek-medvedev-fritz-rybakina-2665433-2025-01-15?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Day 5 Live Updates: Swiatek cruises into Round 3, Jabeur winsAustralian Open 2025 Day 5 Live Updates: Iga Swiatek has made it to round 3 with relative ease, dispatching Sramkova 6-0, 6-2. Ons Jabeur was able to overcome a wobble in the first set to beat Camila Osorio and make it to the next round. World No. 1 Jannik Sinner and Indian players Rithvik Choudary Bollipalli and N. Sriram Balaji are set to compete on Day 5 of the Australian Open 2025 on January 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/shehbaz-sharif-order-probe-pakistan-international-airlines-paris-ad-eiffel-tower-twin-tower-attack-2665173-2025-01-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Stupidity': Pak PM orders probe after national airline's Paris flight ad backfiresIt has been a PR disaster for Pakistan International Airlines after its ad celebrating the resumption of its European flights featured an image of an aircraft seemingly heading towards the Eiffel Tower."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/starship-super-heavy-to-launch-why-elon-musk-is-excited-about-this-mission-2665255-2025-01-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Elon Musk is excited about Starship Super Heavy launch SpaceX aims to achieve a successful catch of the Super Heavy booster using its launch tower's \"chopstick\" arms. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/drake-sues-universal-music-group-over-alleged-defamation-campaign-kendrick-lamar-not-like-us-2665434-2025-01-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Drake sues Universal Music Group over alleged defamation campaignRapper Drake has taken legal action against Universal Music Group, claiming the label defamed him through the diss track - Not Like Us - by Kendrick Lamar. The lawsuit alleges a malicious campaign to spread false narratives about Drake."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-elections-case-against-parvesh-verma-bjp-distributing-shoes-voters-2665198-2025-01-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Case against BJP's Parvesh Verma for distributing shoes to Delhi votersParvesh Verma, who has been fielded against Arvind Kejriwal on New Delhi seat, has been accused of violating the Model Code of Conduct."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-elections-how-an-ngo-connect-to-delhi-hoax-bomb-emails-sparked-a-political-row-between-aap-and-bjp-2665442-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How an NGO connect to Delhi hoax bomb emails sparked a political row The hoax bomb threat case in Delhi, which initially appeared to be the work of a minor prankster, became the focal point of intense political sparring between the ruling AAP and the BJP. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/maha-kumbh-is-a-greatest-thing-on-the-planet-spiritual-leader-sadhguru-2665281-2025-01-15?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Greatest thing on planet, humans seeking liberation: Sadhguru on Maha KumbhIn an exclusive interview with India Today's Akshita Nandagopal, spiritual leader Sadhguru Jaggi Vasudev shared insights on the significance of Maha Kumbh in Prayagraj, Moksha, Naga Sadhus and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/rihanna-anushka-sharma-fashion-trends-2025-2665245-2025-01-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Canvas couture, bucket bags and a hint of nostalgia for a fab 2025 wardrobeFrom canvas couture to nostalgic dressing, here are the hottest fashion trends that deserve your attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/elisha-otis-elevator-innovator-dramatic-stunt-shocked-audiences-to-sell-safety-2665312-2025-01-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "When Elisha Otis's daring elevator stunt shocked audiences to sell safetyIn 1854, Elisha Otis pulled off one of history's greatest marketing moves, performing a theatrical, public demonstration to prove his elevator safety device worked. This innovation would go on to reshape cities and enable skyscrapers, forever changing modern living."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-removes-long-standing-curbs-on-3-indian-nuclear-entities-from-trade-blacklist-2665458-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US removes long-standing curbs on 3 Indian nuclear entities from trade blacklistThe decision, which affects Indian Rare Earths, the Indira Gandhi Atomic Research Centre (IGCAR), and the Bhabha Atomic Research Centre (BARC), signals a significant step forward in bilateral collaboration, particularly in clean energy and advanced scientific research."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gujarat-pm-modi-hometown-vadnagar-to-get-new-archaeological-museum-showcasing-2500-years-of-history-2665455-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM's hometown to get new Archaeological Museum showcasing 2,500 years of historyUnion Home Minister Amit Shah is scheduled to inaugurate the museum on Thursday, which is designed to offer a comprehensive look at the city's 2,500-year-old history through an immersive and interactive experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priyanka-chopra-los-angeles-wildfire-heart-is-heavy-please-donate-2665463-2025-01-16",
      "headline": "Priyanka Chopra on devastating Los Angeles wildfires: My heart is so heavyActor-producer Priyanka Chopra expressed her sadness and anguish over the damage from the Los Angeles wildfires. She said that she's grateful for her family's safety."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/drake-sues-universal-music-group-over-alleged-defamation-campaign-kendrick-lamar-not-like-us-2665434-2025-01-15",
      "headline": "Drake sues Universal Music Group over alleged defamation campaignRapper Drake has taken legal action against Universal Music Group, claiming the label defamed him through the diss track - Not Like Us - by Kendrick Lamar. The lawsuit alleges a malicious campaign to spread false narratives about Drake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bhojpuri-actor-sudip-pandey-dies-of-heart-attack-2665391-2025-01-15",
      "headline": "Bhojpuri actor Sudip Pandey dies of heart attackBhojpuri actor and filmmaker Sudip Pandey has died due to a heart attack. His career spanned both Bhojpuri and Hindi cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/yeh-jo-hai-zindagi-director-manjul-sinha-dies-due-to-heart-attack-2665347-2025-01-15",
      "headline": "Yeh Jo Hai Zindagi director Manjul Sinha dies due to heart attackDirector Manjul Sinha, famed for Yeh Jo Hai Zindagi, died in Goa due to a heart attack. His death marks a significant loss for the television industry."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-fan-crashes-his-car-while-trying-to-click-a-selfie-with-sam-konstas-2665437-2025-01-16",
      "headline": "Watch: Fan crashes his car while trying to click a selfie with Sam KonstasA fan crashed his car while trying to click a selfie with rising young Australian cricketer Sam Konstas, who recently made his debut during the Test series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-results-arsenal-vs-tottenham-leandro-trossard-winner-north-london-derby-2665461-2025-01-16",
      "headline": "Trossard the hero as Arsenal win North London derby, Newcastle thrash WolvesLeandro Trossard was the match winner for Arsenal as they got back to winning ways by defeating Tottenham Hotspur 2-1 at the Emirates on Wednesday, January 15. Newcastle United continued their brilliant form, while Crystal Palace and Aston Villa also secured wins. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-day-5-live-sinner-swiatek-medvedev-fritz-rybakina-2665433-2025-01-15",
      "headline": "Day 5 Live Updates: Swiatek cruises into Round 3, Jabeur winsAustralian Open 2025 Day 5 Live Updates: Iga Swiatek has made it to round 3 with relative ease, dispatching Sramkova 6-0, 6-2. Ons Jabeur was able to overcome a wobble in the first set to beat Camila Osorio and make it to the next round. World No. 1 Jannik Sinner and Indian players Rithvik Choudary Bollipalli and N. Sriram Balaji are set to compete on Day 5 of the Australian Open 2025 on January 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kho-kho-world-cup-india-men-women-teams-book-quarterfinal-spot-2665429-2025-01-15",
      "headline": "India men and women teams book quarterfinal spots with commanding winsThe Indian men's and women's teams secured quarterfinal berths in the Kho Kho World Cup in New Delhi on Wednesday. While the men's team secured a 70-38 victory over Peru, the women's team registered a 100-16 win against Iran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/will-miss-playing-in-india-in-future-icc-events-pakistans-fakhar-zaman-2665419-2025-01-15",
      "headline": "Will miss playing in India in future ICC events: Pakistan's Fakhar ZamanStar Pakistan batter Fakhar Zaman recently said that he will miss playing in India in future ICC events. India and Pakistan have reached a consensus to not play in each other's countries during multinational tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-pacer-anrich-nortje-ruled-out-of-champions-trophy-with-back-injury-2665410-2025-01-15",
      "headline": "South Africa pacer Anrich Nortje ruled out of Champions Trophy with back injurySouth Africa pacer Anrich Nortje will miss the Champions Trophy due to a back injury. Nortje has not played international cricket since the T20 World Cup final in June last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-hazare-trophy-karnataka-beat-haryan-to-reach-final-2665392-2025-01-15",
      "headline": "Vijay Hazare Trophy: Karnataka enter final after comprehensive win over HaryanaKarnataka chased down the 238-run target in 47.2 overs to beat Haryana by 5 wickets and book their spot in the final of the Vijay Hazare Trophy on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-alexander-zverev-relishing-night-matches-in-melbourne-after-second-round-win-2665378-2025-01-15",
      "headline": "Alexander Zverev relishing night matches in Melbourne after second round winAlexander Zverev revealed that he's enjoying playing night matches in the ongoing Australian Open 2025 after his second round victory over Pedro Martinez."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-laughs-off-reports-of-him-being-advised-bed-rest-after-australia-tour-2665384-2025-01-15",
      "headline": "Jasprit Bumrah laughs off reports of him being advised bed rest after Australia tourStar India fast bowler Jasprit Bumrah mocked an X page for spreading fake news about his fitness. Bumrah got injured during the fifth Test vs Australia in Sydney and opted not to bowl from Day 2 onwards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-2025-lakshya-prannoy-crash-out-anupama-enters-round-2-2665371-2025-01-15",
      "headline": "Lakshya Sen, HS Prannoy crash out, Anupama enters round 2 Former national champion Anupama Upadhyaya progressed to the second round, but the likes of Lakshya Sen, HS Prannoy and Priyanshu Rajawat failed to go past the opening round on Day 2 of the India Open on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-yet-to-confirm-his-availability-for-mumbai-ranji-trophy-report-2665336-2025-01-15",
      "headline": "Rohit Sharma yet to confirm his availability for Mumbai's Ranji clash: ReportIndia captain Rohit Sharma's participation in Mumbai's Ranji Trophy match against Jammu and Kashmir is uncertain. The Mumbai selectors will follow the standard procedure to verify Rohit's availability before announcing the squad on January 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-hazare-trophy-karnataka-beat-haryan-to-reach-final-2665392-2025-01-15",
      "headline": "Vijay Hazare Trophy: Karnataka enter final after comprehensive win over HaryanaKarnataka chased down the 238-run target in 47.2 overs to beat Haryana by 5 wickets and book their spot in the final of the Vijay Hazare Trophy on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-alexander-zverev-relishing-night-matches-in-melbourne-after-second-round-win-2665378-2025-01-15",
      "headline": "Alexander Zverev relishing night matches in Melbourne after second round winAlexander Zverev revealed that he's enjoying playing night matches in the ongoing Australian Open 2025 after his second round victory over Pedro Martinez."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-laughs-off-reports-of-him-being-advised-bed-rest-after-australia-tour-2665384-2025-01-15",
      "headline": "Jasprit Bumrah laughs off reports of him being advised bed rest after Australia tourStar India fast bowler Jasprit Bumrah mocked an X page for spreading fake news about his fitness. Bumrah got injured during the fifth Test vs Australia in Sydney and opted not to bowl from Day 2 onwards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-2025-lakshya-prannoy-crash-out-anupama-enters-round-2-2665371-2025-01-15",
      "headline": "Lakshya Sen, HS Prannoy crash out, Anupama enters round 2 Former national champion Anupama Upadhyaya progressed to the second round, but the likes of Lakshya Sen, HS Prannoy and Priyanshu Rajawat failed to go past the opening round on Day 2 of the India Open on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-yet-to-confirm-his-availability-for-mumbai-ranji-trophy-report-2665336-2025-01-15",
      "headline": "Rohit Sharma yet to confirm his availability for Mumbai's Ranji clash: ReportIndia captain Rohit Sharma's participation in Mumbai's Ranji Trophy match against Jammu and Kashmir is uncertain. The Mumbai selectors will follow the standard procedure to verify Rohit's availability before announcing the squad on January 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/if-scott-boland-had-not-played-india-would-have-won-the-series-vs-australia-r-ashwin-2665332-2025-01-15",
      "headline": "If Boland had not played, India would have won the series vs Australia: R AshwinFormer India spinner Ravichandran Ashwin feels that India would've won the recent Test series against Australia had Scott Boland not played in the rubber."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-can-reach-an-even-higher-level-coach-irwansyah-adi-pratama-2665328-2025-01-15",
      "headline": "PV Sindhu can reach an even higher level: New coach Irwansyah Adi PratamaPV Sindhu's new coach, Irwansyah Adi Pratama, is determined to help her reclaim dominance in badminton by enhancing her aggression, speed, and power. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-day-5-schedule-daniil-medvedev-jannik-sinner-rithvik-choudary-bollipalli-2665309-2025-01-15",
      "headline": "Australian Open 2025, Day 5 schedule: Medvedev, Sinner and Bollipalli in actionThe Day 5 of the Australian Open 2025 will feature several big stars in action as Daniil Medvedev, Jannik Sinner, Rithvik Choudary Bollipalli, Elena Rybakina amongst others in action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-name-injured-saim-ayub-champions-trophy-provisional-squad-2665306-2025-01-15",
      "headline": "Pakistan selectors decide to name Saim in Champions Trophy provisional squadPakistan's cricket selectors have provisionally included Saim Ayub, recovering from an ankle injury, in the Champions Trophy squad. Despite not being officially announced, the squad features key players like Shaheen Shah Afridi and Haris Rauf, with the option for changes till mid-February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-hundred-sundar-pichai-joins-tech-leaders-in-bid-london-based-cricket-team-report-2665282-2025-01-15",
      "headline": "Sundar Pichai joins tech leaders in bid for London-based cricket team: ReportSundar Pichai has joined a group of prominent Silicon Valley leaders in a bid to acquire a London-based cricket team. According to a Bloomberg report, the consortium is eyeing ownership of either the Oval Invincibles or the London Spirit in The Hundred."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-pakistan-opening-ceremony-pcb-visa-2665286-2025-01-15",
      "headline": "PCB hopeful Rohit Sharma will attend Champions Trophy opening ceremony in PakistanChampions Trophy 2025: The Pakistan Cricket Board is hopeful of hosting all 8 captains, including Rohit Sharma, for the opening ceremony in Pakistan. India will be playing all their matches in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-james-vince-quits-first-class-cricket-for-pakistan-super-league-2665273-2025-01-15",
      "headline": "England's James Vince quits first-class cricket to play Pakistan Super LeagueEngland batter James Vince has announced his decision to step away from red-ball cricket for the 2025 season. This move opens the door for his participation in the Pakistan Super League (PSL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-vs-ire-w-3rd-odi-smriti-mandhana-pratika-rawal-deepti-sharma-richa-ghosh-2665271-2025-01-15",
      "headline": "Smriti, Pratika power India to record win over Ireland, 3-0 series sweepIndia women beat Ireland women in the third ODI by 304 runs and registered their highest victory margin in Women's ODIs as Partika Rawal won Player of the Match award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-hundred-sundar-pichai-joins-tech-leaders-in-bid-london-based-cricket-team-report-2665282-2025-01-15",
      "headline": "Sundar Pichai joins tech leaders in bid for London-based cricket team: ReportSundar Pichai has joined a group of prominent Silicon Valley leaders in a bid to acquire a London-based cricket team. According to a Bloomberg report, the consortium is eyeing ownership of either the Oval Invincibles or the London Spirit in The Hundred."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-pakistan-opening-ceremony-pcb-visa-2665286-2025-01-15",
      "headline": "PCB hopeful Rohit Sharma will attend Champions Trophy opening ceremony in PakistanChampions Trophy 2025: The Pakistan Cricket Board is hopeful of hosting all 8 captains, including Rohit Sharma, for the opening ceremony in Pakistan. India will be playing all their matches in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-james-vince-quits-first-class-cricket-for-pakistan-super-league-2665273-2025-01-15",
      "headline": "England's James Vince quits first-class cricket to play Pakistan Super LeagueEngland batter James Vince has announced his decision to step away from red-ball cricket for the 2025 season. This move opens the door for his participation in the Pakistan Super League (PSL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-vs-ire-w-3rd-odi-smriti-mandhana-pratika-rawal-deepti-sharma-richa-ghosh-2665271-2025-01-15",
      "headline": "Smriti, Pratika power India to record win over Ireland, 3-0 series sweepIndia women beat Ireland women in the third ODI by 304 runs and registered their highest victory margin in Women's ODIs as Partika Rawal won Player of the Match award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-jakub-mensik-the-19-year-old-stunned-casper-ruud-2665243-2025-01-15",
      "headline": "Meet Jakub Mensik, the 19-year-old who stunned Casper RuudAustralian Open 2025: 19-year-old Jakub Mensik stunned World No. 6 Casper Ruud to storm into the men's singles third round. Mensik defeated Ruud 6-2, 3-6, 6-1, 6-4 in the second round. This marks the first time since 2006 that two teenagers have ousted top 10 players in a Grand Slam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/felt-sad-when-r-ashwin-retired-in-the-middle-of-australia-tour-kapil-dev-2665225-2025-01-15",
      "headline": "Felt sad when R Ashwin retired in the middle of Australia tour: Kapil DevLegendary India cricketer Kapil Dev said he felt sad when Ravichandran Ashwin retired in the middle of the Test series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-ruud-crashes-out-zverev-gauff-badosa-reach-3rd-round-2665228-2025-01-15",
      "headline": "Huge upset as Czech teen Mensik knocks out sixth seed RuudAustralian Open 2025: World No.6 Casper Ruud was knocked out in the men's singles second round after losing to Czech teenager Jakub Mensik. Meanwhile, German Alexander Zverev and American Coco Gauff stormed into the third round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-recalls-fond-memories-at-wankhede-stadium-ahead-of-its-50th-anniversary-2665191-2025-01-15",
      "headline": "Rohit Sharma recalls fond memories at Wankhede Stadium ahead of its 50th anniversaryIndia captain Rohit Sharma recalled his fond memories at the Wankhede Stadium in Mumbai ahead of the venue's 150th anniversary celebration."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Courtto recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination afterdiscrepancies in the declared results."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}