{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/planning-to-start-sip-2-reasons-why-you-should-consider-nps-national-pension-scheme-2683286-2025-02-21",
      "headline": "Planning to start SIP? 2 reasons why you should consider NPSBy investing in NPS, individuals can claim tax benefits of up to Rs 1.5 lakh under Section 80C and an additional Rs 50,000 under Section 80CCD (1B)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/religare-enterprises-stock-price-jump-up-to-9-percent-today-burman-family-takeover-2683282-2025-02-21",
      "headline": "Explained: Why Religare Enterprises share price jumped up to 9% today Soon after the announcement, Religare's stock price climbed 8.52% to hit Rs 242 on the Bombay Stock Exchange. At around 11:24 am, shares of the company were trading 2.31% higher at Rs 228.15. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-may-let-foreign-electric-vehicle-makers-like-tesla-test-market-before-investing-2683262-2025-02-21",
      "headline": "India may let foreign EV makers like Tesla test market before investing: ReportThe government may let foreign electric vehicle makers like Tesla sell cars first and invest later, with final SMEC guidelines expected soon to kickstart local manufacturing incentives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-the-share-market-falling-today-3-key-reasons-to-know-2683247-2025-02-21",
      "headline": "Sensex tanks nearly 500 points. 3 reasons why stock market is falling todayThe S&P BSE Sensex was down 461.08 points to 75,274.88 at 11:32 am and the NSE Nifty50 fell 144.45 points to trade at 22,768.70. Here are 3 things investors need to know about today's stock market downturn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-fall-as-fii-selling-trumps-tariff-threat-batter-d-street-2683240-2025-02-21",
      "headline": "Sensex, Nifty fall as FII selling, Trump's tariff threat batter D-StreetThe S&P BSE Sensex was down 272.61 points to 75,463.64 at around 9:51 am, while the NSE Nifty50 declined 91.80 points to 22,821.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/punjab-national-bank-interest-rates-pnb-revises-interest-rates-check-new-home-car-and-personal-loan-rates-2683021-2025-02-20",
      "headline": "PNB revises interest rates. Check new home, car and personal loan rates There will be zero processing fees and documentation charges on most of PNB's home loan schemes till March 31, 2025, thereby making housing loans more affordable and more accessible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-smart-pension-plan-check-eligibility-and-other-details-2682975-2025-02-20",
      "headline": "LIC Smart Pension Plan: Check eligibility and other details The Smart Pension Plan requires a minimum investment of Rs 1,00,000, while there is no cap on the maximum purchase limit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-electric-vehicle-set-for-india-entry-with-first-ev-shipment-in-coming-months-report-2682925-2025-02-20",
      "headline": "Tesla set for India entry with first EV shipment in coming months: Report The US carmaker plans to start selling these cars in the three major cities of Mumbai, Delhi, and Bangalore around the third quarter of the year, say reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-ends-200-points-lower-nifty-below-23000-hdfc-falls-over-2-2682897-2025-02-20",
      "headline": "Sensex ends 200 points lower, Nifty below 23,000; HDFC falls over 2%Stock market closing today: The S&P BSE Sensex ended 203.22 points lower at 75,735.96, while the NSE Nifty50 fell 19.75 points to settle at 22,913.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-impact-on-indian-rupee-jefferies-explained-2682872-2025-02-20",
      "headline": "Will Donald Trump's reciprocal tariffs hurt Indian rupee? It may be noted that India was the 10th biggest exporter to the US in 2024, and higher tariffs might make it tougher for Indian businesses to sell their goods there."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/supreme-court-gratuity-act-can-employers-deny-gratuity-in-any-situation-check-ruling-2682833-2025-02-20",
      "headline": "Can employers deny gratuity in any situation? Here's all you need to knowWith the latest ruling, the Supreme Court has stated that if an employer dismisses an employee on grounds of moral turpitude, his gratuity can be forfeited without waiting for a court's verdict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fiis-continue-to-dump-indian-stocks-which-stocks-are-feeling-the-heat-2682829-2025-02-20",
      "headline": "FIIs continue to dump Indian stocks: Which stocks are feeling the heat? Data from National Securities Depository Limited (NSDL) showed that FPIs have dumped $3.5 billion worth of financial stocks in 2025 so far, accounting for 31% of their total sales of $11.45 billion as of February 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-may-offer-relief-for-new-india-co-op-bank-depositors-scam-scrutiny-2682825-2025-02-20",
      "headline": "RBI may allow some depositors of New India Co-op Bank to withdraw funds: Report Last week, the RBI took strict action against New India Co-operative bank by suspending deposit withdrawals for six months, stopping the issuance of new loans, and appointing an administrator. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uday-kotak-explains-how-fiis-foreign-outflow-are-gaining-at-the-expense-of-domestic-retail-investors-stock-market-2682813-2025-02-20",
      "headline": "Uday Kotak explains how FIIs are gaining at the expense of domestic investorsUday Kotak said that FIIs are benefiting from the investments made by domestic retail investors, who are continuously putting money into the stock market. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-pay-new-bill-payment-google-pay-begins-charging-for-bill-payments-what-users-need-to-know-2682787-2025-02-20",
      "headline": "Google Pay begins charging for bill payments. Here's what users need to knowThis is not the first time Google Pay has announced the imposition of fees. Last year, it levied Rs 3 convenience fee for mobile recharges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-threat-indian-exporters-minimal-impact-explained-2682790-2025-02-20",
      "headline": "Indian exporters aren't losing sleep over Donald Trump's tariff threat. Here's whyIndustry executives say US tariff hikes on autos and pharmaceuticals won't hurt Indian exporters much, as competitors from other countries will face the same impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-cuts-budget-2025-rbi-bulletin-consumption-middle-class-2682747-2025-02-20",
      "headline": "Will tax cuts for middle class in budget help boost consumption? RBI says this The RBI bulletin pointed out that the government has given a Rs 1 lakh crore tax break to the middle class, which should leave more money in their pockets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dalal-street-top-market-investors-lose-over-rs-80000-crore-radhakishan-damani-dmart-jhunjhunwala-2682742-2025-02-20",
      "headline": "Dalal Street carnage: Top market investors lose over Rs 80,000 croreThe recent stock market downturn has wiped out over Rs 80,000 crore from the portfolios of some of India's most renowned investors, such as Radhakishan Damani and the Jhunjhunwala family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-to-roll-out-upi-based-claim-withdrawals-within-3-months-check-details-2682731-2025-02-20",
      "headline": "EPFO to roll out UPI-based EPF claim withdrawals within 3 months. Check detailsOnce integrated, claim amounts can be easily accessed by the subscribers via digital wallets, mention sources. This would minimise the processing time and lead to an enhanced user-friendly experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-economy-rbi-bulletin-key-points-global-challenges-high-frequency-indicators-2682718-2025-02-20",
      "headline": "Is India's economy set for a strong recovery? Here's what RBI saysThe government's push on capital spending, MSMEs, agriculture, and exports is expected to help the economy in the long run while keeping the fiscal deficit in check. A recent repo rate cut might also support domestic demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itc-godfrey-phillips-share-price-down-today-gst-hike-possiblity-cigarettes-2682709-2025-02-20",
      "headline": "Why shares of cigarette makers ITC, Godfrey Phillips are falling today?ITC's share price was trading 1.44% lower at Rs 400.65 on the Bombay Stock Exchange (BSE) at 11:06 am. Godfrey Phillips shares were down 4.58% to Rs 6,260 and VST Industries stock was down 3% to Rs 290.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vs-epf-which-one-is-better-for-tax-saving-under-new-income-tax-regime-2682697-2025-02-20",
      "headline": "Why NPS is better than EPF for tax saving under new tax regimeNPS vs EPF: In the case of EPF, employee contributions generally qualify for a deduction under Section 80C of the Income Tax Act, capped at Rs 1.5 lakh annually, under the Old Income Tax regime. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opening-bell-sensex-nifty-open-lower-as-fmcg-banking-stocks-drag-market-nse-bse-dalal-street-2682667-2025-02-20",
      "headline": "Sensex, Nifty open lower as FMCG, banking stocks drag marketThe S&P BSE Sensex lost 233.22 points to 75,705.96, while the NSE Nifty50 was down by 75.05 points to 22,857.85 as of 9:38 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cigarette-prices-set-to-rise-government-may-hike-gst-on-tobacco-products-cess-tax-2682653-2025-02-20",
      "headline": "Cigarette prices set to rise? Government may hike GST on tobacco productsCurrently, cigarettes and other tobacco products attract a GST of 28% along with various other levies, taking the total tax burden to 53%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-ahead-outlook-dalal-streets-losing-streak-why-the-market-fall-may-not-end-soon-nse-bse-2682632-2025-02-20",
      "headline": "Dalal Street's losing streak: Why the market fall may not end soonStock Market: The earnings growth of Nifty50 companies was 5% in the October-December quarter, marking the third straight quarter of single-digit growth, which is a sharp contrast to the double-digit profit growth seen in the previous two years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-end-flat-in-volatile-session-small-and-midcaps-gain-2682344-2025-02-19",
      "headline": "Sensex, Nifty end marginally lower in volatile session; small and midcaps gainThe S&P BSE Sensex ended 28.21 points lower at 75,939.18, while the NSE Nifty50 settled 12.40 points lower at 22,932.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fiis-fpis-continue-to-dump-indian-stocks-what-it-means-for-your-investment-portfolio-2682292-2025-02-19",
      "headline": "FIIs continue to dump Indian stocks: What it means for your investment portfolioWith FIIs selling aggressively, smallcaps and midcaps bleeding, and China attracting inflows, here's what retail investors should do. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-likely-to-set-up-manufacturing-hub-india-maharashtra-gujarat-2682262-2025-02-19",
      "headline": "Tesla likely to set up shop in India, may invest $3-5 billion: Sources During their visit, Tesla executives are expected to hold meetings with officials from the Prime Minister's Office (PMO) and other key ministries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/small-sip-big-returns-investment-tip-check-how-rs-250-a-month-can-grow-to-rs-17-lakh-sbi-jannivesh-2682243-2025-02-19",
      "headline": "Small SIP, big returns: Check how Rs 250 a month can grow to Rs 17 lakhSBI Mutual Fund's new JanNivesh SIP is making investing more accessible, letting anyone start with as little as Rs 250 a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-is-indias-most-valuable-company-check-other-firms-in-top-10-2682232-2025-02-19",
      "headline": "Reliance is India's most valuable company. Check top 10 firms in Hurun India 500The 2024 Burgundy Private Hurun India 500 report values Reliance at Rs 17.5 lakh crore. TCS comes in second at Rs 16.1 lakh crore, and HDFC Bank takes third place with Rs 14.2 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dr-reddys-aurobindo-phrama-why-pharma-stocks-fell-in-early-trade-today-2682211-2025-02-19",
      "headline": "Dr Reddy's, Aurobindo Pharma: Why pharma stocks fell in early trade today?The Nifty Pharma index dropped as much as 2% in early trade. Sun Pharma fell nearly 2%, Dr Reddy's dropped as much as 4%, and Aurobindo Pharma sank almost 6%. Cipla shares also fell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-get-boost-after-clsa-upgrade-check-target-price-2682190-2025-02-19",
      "headline": "Tata Motors shares get boost after CLSA upgrade. Check target priceTata Motors share price: At around 11:04 am, shares of Tata Motors were trading 0.34% higher at Rs 683.90 on the Bombay Stock Exchange (BSE). It was up over 1% in early trade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hexaware-technologies-shares-debut-at-5-premium-over-ipo-price-2682180-2025-02-19",
      "headline": "Hexaware Technologies shares debut at 5% premium over IPO priceHexaware Technologies IPO listing: The listing was largely in line with expectations, as the grey market premium (GMP) had disappeared ahead of the debut, indicating weak demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-lower-as-it-pharma-stocks-drag-markets-2682149-2025-02-19",
      "headline": "Sensex, Nifty open lower as IT, pharma stocks drag marketsThe S&P BSE Sensex shed 291.20 points to 75,676.19, while the NSE Nifty50 lost 88.65 points to 22,856.65 as of 9:25 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quality-power-ipo-allotment-status-online-guide-latest-gmp-listing-date-allotment-date-2682131-2025-02-19",
      "headline": "Quality Power IPO: Check allotment status, latest GMP and listing date Quality Power IPO allotment status: Investors who applied for the Quality Power IPO can check their allotment status through the BSE website or the registrar's website (Link Intime India Private Ltd)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/elon-musks-tesla-hunts-for-land-in-india-manufacturing-plant-maharashtra-leads-report-2682119-2025-02-19",
      "headline": "Elon Musk's Tesla hunts for land in India, Maharashtra leads: ReportWhile Maharashtra is leading the race, other states are also vying for the project. Tesla's plans could change depending on the incentives offered by different states."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/unified-pension-scheme-to-roll-out-from-april-1-check-eligibility-and-benefits-2681864-2025-02-18",
      "headline": "Unified Pension Scheme to roll out from April 1. Check eligibility and benefitsUnder the new pension scheme, government employees will contribute 10% of their basic salary along with DA, while the government's contribution will rise from the previous 14% to 18.5%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elss-explained-check-tax-benefits-under-section-80c-and-other-key-details-2681815-2025-02-18",
      "headline": "ELSS explained: Check tax benefits under Section 80C and other key details ELSS offers market-linked returns and has the potential to generate higher long-term returns as compared to other Section 80C options, including PPF, ULIPS, and NPS, etc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-president-donald-trump-tariffs-could-hurt-indian-exports-which-sectors-are-at-risk-2681818-2025-02-18",
      "headline": "Trump's reciprocal tariffs could hurt Indian exports. Which sectors are at risk?While officials are still waiting for details on how these tariffs will be calculated, they are already preparing countermeasures and working on a trade deal proposal to reduce tariffs and boost two-way trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-bounce-back-from-days-low-to-close-flat-it-stocks-lead-recovery-2681781-2025-02-18",
      "headline": "Sensex, Nifty bounce back from day's low to close flat; IT stocks lead recoveryThe S&P BSE Sensex lost 29.47 points to close at 75,967.39, while the NSE Nifty50 was down by 14.20 points to end at 22,945.30. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/varun-grover-jibe-at-beerbiceps-ranveer-allahabadia-samay-raina-indias-got-latent-controversy-2683270-2025-02-21",
      "headline": "Comedian Varun Grover's jibe at BeerBiceps: Sounds like Gurgaon's pornstarComedian-lyricist Varun Grover recently took a jibe at the recent controversy surrounding podcaster Ranveer Allahbadia's appearance on India's Got Latent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bb-18-alice-kaushik-tajinder-bagga-and-others-reunite-at-arfeen-saras-goa-bash-2683249-2025-02-21",
      "headline": "BB 18's Alice Kaushik, Tajinder Bagga, others reunite at Arfeen-Sara's Goa bashBigg Boss 18 contestants, including Alice Kaushik, Tajinder Bagga, and Nyrraa Banerjii reunited to celebrate Sara and Arfeen Khan's anniversary in Goa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dhanashree-verma-shares-cryptic-post-amid-divorce-rumours-with-yuzvendra-chahal-stressed-to-blessed-2683241-2025-02-21",
      "headline": "Dhanashree Verma's cryptic post amid divorce rumours: From stressed to blessedDhanashree Verma recently shared a cryptic message on social media, suggesting a shift from 'stressed to blessed'. This comes amid swirling rumours of a possible divorce with cricketer Yuzvendra Chahal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/popular-tv-actor-dipika-kakar-ibrahim-has-quit-celebrity-masterchef-india-2683158-2025-02-20",
      "headline": "TV actor Dipika Kakar Ibrahim quits Celebrity MasterChef amid health concernsPopular TV actor Dipika Kakar Ibrahim has withdrawn from Celebrity MasterChef due to health issues. Despite the show's support, she prioritised her well-being over the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-singer-honey-singh-arrives-in-mumbai-for-millionaire-concert-stageaajtak-2683117-2025-02-20",
      "headline": "Rapper-singer Honey Singh arrives in Mumbai for sold-out concertHoney Singh is in Mumbai for the much-anticipated Stage AajTak Millionaire concert this Saturday, February 22. With a fantastic set list, the sold-out show promises a night full of magic and madness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/boyfriend-on-demand-jisoo-seo-in-guk-to-star-in-netflixs-next-show-on-virtual-dating-2683100-2025-02-20",
      "headline": "Jisoo, Seo In-guk to star in Netflix's next show on virtual datingJisoo and Seo In-guk are joining hands for an upcoming Netflix drama, Boyfriend on Demand. The show will explore virtual reality dating. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-last-of-us-part-2-set-for-april-release-pedro-pascal-bella-ramsey-hbo-2682924-2025-02-20",
      "headline": "The Last Of Us Part 2 release date announced The Last Of Us Part 2's release date has been announced. The Pedro Pascal show is all set to stream on Prime Video from April 13."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/eminem-finally-coming-to-india-rappers-leaked-schedule-hints-so-2682961-2025-02-20",
      "headline": "Is Eminem finally coming to India? Rapper's leaked schedule hints soLeaked documents have suggested that Eminem will perform in Mumbai in June 2025 as part of his world tour. The rapper's first visit to India is stirring excitement among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/cid-now-streaming-on-netflix-2682942-2025-02-20",
      "headline": "Iconic TV show CID now streaming on NetflixCID on Netflix: The iconic Indian crime series CID is now available on Netflix, allowing fans worldwide to stream the popular show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/will-prime-video-jack-reacher-ever-visit-india-author-lee-child-speaks-2682815-2025-02-20",
      "headline": "Will Prime Video's Jack Reacher ever visit India? Author Lee Child speaksAuthor Lee Child, whose Reacher books have inspired a series on Prime Video, spoke to India Today Digital, about the possibility of seeing his leading character travelling to India in the future. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/shenaz-treasury-reveals-losing-a-brand-deal-after-ranveer-allahbadia-controversy-samay-raina-indias-got-latent-2682822-2025-02-20",
      "headline": "Vlogger Shenaz Treasury reveals losing a brand deal after Ranveer Allahbadia row Former actor and influencer Shenaz Treasury recently shared how she lost a brand deal after Ranveer Allahbadia's controversy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nadaaniyan-ibrahim-ali-khan-explains-love-to-miss-briganza-release-date-out-2682803-2025-02-20",
      "headline": "Nadaaniyan: Ibrahim Ali Khan explains love to Miss Briganza; release date outNetflix on Thursday announced the release date of Ibrahim Ali Khan and Khushi Kapoor's 'Nadaaniyan'. The film is a Gen-Z love story and is set in Delhi-Noida. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/palak-muchhal-on-timeless-appeal-of-sanam-teri-kasam-title-song-2682763-2025-02-20",
      "headline": "Palak Muchhal on timeless appeal of Sanam Teri Kasam title song: It's magicalSanam Teri Kasam's title track is topping the music charts. Singer Palak Muchhal calls it surreal, recalls recording it, and hints at a new version. She also discusses Amitabh Bachchan's praise and the evolving music industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/comedian-daniel-fernandes-samay-raina-ranveer-allahbadia-indias-got-latent-2682707-2025-02-20",
      "headline": "They'll just ask Samay Raina to write a 300-word essay: Comic mocks outrageComedian Daniel Fernandes mocked the outrage over Samay Raina's controversy, joking that he'd only need to write a \"300-word essay.\" He also criticised calls to ban India's Got Latent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/aap-rocky-rihanna-promised-to-name-their-next-baby-after-lawyer-joe-tacopina-2682691-2025-02-20",
      "headline": "Rihanna, A$AP Rocky to name next baby after lawyer who helped win caseIn a statement, A$AP Rocky's lawyer revealed that the rapper and his long-time partner Rihanna jokingly promised to name their next child after him. A$AP Rocky was found not guilty in a felony assault trial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aashram-3-part-2-trailer-bobby-deol-is-back-as-the-menacing-baba-nirala-2682511-2025-02-19",
      "headline": "Aashram 3 part 2 trailer: Bobby Deol is back as the menacing Baba NiralaAshram Season 3, Part 2 trailer: The much-awaited Aashram returns with Part 2 of Season 3, directed by Prakash Jha. The new season delves into themes of power, betrayal, and revenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/melo-movie-review-slow-burn-netflix-drama-choi-wooshik-park-boyoung-kim-jaewook-2682347-2025-02-19",
      "headline": "Melo Movie review: A slow-burn, mature drama that will stay with youReleased-Fri Feb 14, 2025Melo Movie released in Netflix on February 14. Starring Choi Woo-shik and Park Bo-young, the 10-episode-show deals with love, loss, and grief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/new-matthew-perry-documentary-promises-to-dig-deep-into-the-hollywood-tragedy-2682494-2025-02-19",
      "headline": "New Matthew Perry documentary promises to dig deep into the Hollywood tragedyA new Matthew Perry documentary called Matthew Perry: A Hollywood Tragedy will be out later this month, wherein the makers will investigate the untimely death of the Friends star. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-first-frost-review-love-trauma-longing-new-chinese-drama-delivers-it-all-2682428-2025-02-19",
      "headline": "The First Frost review: Love, trauma, longing - new Chinese drama delivers it all Released-Thu Feb 20, 2025The First Frost review: This Chinese drama delves into the complexities of love, trauma, and longing, offering a poignant narrative that diverges from typical romance tropes. With its melancholic visuals and dual perspectives, it explores the tangled history between its protagonists, making it a compelling watch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javed-mother-on-her-bold-fashion-was-shocked-at-first-but-i-support-her-2682289-2025-02-19",
      "headline": "Uorfi Javed's mother on her bold fashion: Was shocked at first, but I support herUorfi Javed revealed her mother was the first in their family to try Botox. Her mother also recalled her reaction when she saw Uorfi's \"new style\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suzhal-the-vortex-season-2-trailer-kathir-takes-on-gripping-murder-mystery-with-aishwarya-rajesh-2682271-2025-02-19",
      "headline": "Suzhal 2 trailer: Kathir takes on gripping murder mystery with Aishwarya RajeshThe official trailer of the highly-anticipated second season of the Tamil crime thriller Suzhal - The Vortex was released on Wednesday. Starring Kathir and Aishwarya Rajesh in lead roles, the series will premiere on Prime Video on February 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rihanna-thankful-humbled-after-aap-rocky-found-not-guilty-in-shooting-case-2682140-2025-02-19",
      "headline": "Rihanna 'thankful, humbled' after A$AP Rocky found not guilty in shooting caseA$AP Rocky was declared not guilty in a felony assault trial, leading to an emotional embrace with Rihanna in court. After the verdict, the singer issued her first statement, expressing relief. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papons-valentines-day-special-show-retro-hits-to-soulful-music-moh-moh-ke-dhaage-to-bulleya-2681678-2025-02-18",
      "headline": "Retro hits to soulful music: Magical evening at Papon's Valentine's Day special showPapon's concert in Delhi, hosted by TV9, was an unforgettable night filled with soulful music. Held at Major Dhyan Chand National Stadium, the event was part of the World Travel and Tourism Festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-picks-fathers-video-call-during-live-concert-2681893-2025-02-18",
      "headline": "Watch: Arijit Singh attends father's video call during live concertArijit Singh's live concert in Chandigarh was made memorable by a surprise video call from his father during his performance. The singer shared heartfelt moments from the event on Instagram, expressing gratitude to his fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/baarishein-singer-anuv-jain-married-shares-photos-with-wife-2681838-2025-02-18",
      "headline": "Pics: Singer Anuv Jain married, shares photos with wifeSinger Anuv Jain, popular for songs like Baarishein, is now married. He shared photos from the wedding and pre-wedding festivities on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-akhil-sachdeva-on-diljit-dosanjh-infrastructure-remark-2681792-2025-02-18",
      "headline": "Singer Akhil Sachdeva on Diljit Dosanjh's infrastructure remark: I feel it's amazingSinger Akhil Sachdeva discusses the rise of concerts in India, film vs indie music, ticket prices, and Diljit Dosanjh's comments on concert infrastructure. He also stresses the importance of crediting technicians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/k-drama-2025-when-life-gives-you-tangerine-to-wife-of-a-21st-century-prince-full-list-from-kakao-entertainment-2681749-2025-02-18",
      "headline": "K-slate 2025: When Life Gives You Tangerine to Wife of a 21st Century PrinceKakao Entertainment is set to make 2025 a landmark year for K-dramas and films, with a rich array of releases across various genres. From gripping thrillers to heartwarming romances, the lineup promises stellar performances and captivating stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dabba-cartel-trailer-netflix-shabana-azmi-jyotika-gajraj-rao-2681735-2025-02-18",
      "headline": "Dabba Cartel trailer: Shabana Azmi, Jyotika promise an addictive showThe trailer for Netflix's Dabba Cartel unveils a gripping crime drama about five women whose dabba business unexpectedly plunges them into the dangerous world of a drug cartel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-sae-rons-father-blames-youtuber-for-death-co-star-won-bin-breaks-down-at-funeral-2681684-2025-02-18",
      "headline": "Kim Sae-ron's father blames YouTuber for death, co-star Won Bin breaks downSouth Korean actor Kim Sae-ron's father spoke out at her funeral, held a day after her death, highlighting the emotional distress she suffered due to a YouTuber's videos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-singh-grover-back-on-tv-5-years-after-kasautii-zindagii-kay-report-2681666-2025-02-18",
      "headline": "Karan Singh Grover back on TV 5 years after Kasautii Zindagii Kay: ReportActor Karan Singh Grover might just be a part of a romantic show very soon. He is reported to be seen alongside Helly Shah in this new TV show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/linkin-park-singer-chester-benningtons-child-comes-out-as-transgender-2681663-2025-02-18",
      "headline": "Late Linkin Park singer Chester Bennington's child comes out as transgenderLinkin Park singer Chester Bennington's child, Draven, has come out as transgender. The artiste shared the news on her social media handle, while stating her preferred pronouns in a small note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-global-artists-ed-sheeran-dua-lipa-coldplay-india-purely-business-exclusive-2680888-2025-02-18",
      "headline": "Amit Trivedi: Global artists performing in India is nothing but pure businessIndia has become a hotspot for global artists to perform, drawing big names like Coldplay, Ed Sheeran, and Dua Lipa. Music composer Amit Trivedi believes their choice is driven by business interests, as they seek lucrative opportunities in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-4-first-look-benedict-sophies-love-story-takes-centre-stage-2681436-2025-02-17",
      "headline": "Bridgerton 4 first look: Benedict-Sophie's love story takes centre stageThe fourth season of Bridgerton is set to spotlight Benedict Bridgerton's romance with Sophie Baek. New characters like Katie Leung's Lady Araminta Gun will add intrigue to the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/legends-of-shiva-amish-tripathi-get-real-about-lord-shiva-in-discovery-show-2681343-2025-02-17",
      "headline": "Legends of Shiva: Amish Tripathi gets real about Lord Shiva in his latest showAuthor and producer Amish Tripathi returns as host of Legends of Shiva with Amish, a new show on Discovery Channel, exploring Lord Shiva beyond myths. Unveiled at the New Delhi Book Fair, it promises a deep dive into mythology coinciding with Maha Kumbh 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amortage-review-jisoos-album-shakes-things-up-like-an-earthquake-2681277-2025-02-17",
      "headline": "Amortage review: Jisoo's album shakes things up like an 'earthquake'Jisoo's new EP, Amortage, released on February 14, 2025, marks her evolution as a solo artist. The EP blends pop and R&B to explore love's many facets, featuring English tracks and her own songwriting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bhabiji-writer-manoj-santoshi-battles-cancer-shilpa-shinde-takes-care-of-him-2681295-2025-02-17",
      "headline": "Bhabiji writer Manoj Santoshi battles cancer, Shilpa Shinde takes care of himActor Kavita Kaushik made an emotional post on social media, highlighting screenwriter Manoj Santoshi's struggle with liver cancer. She also mentioned actor Shilpa Shinde and thanked her for taking care of him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-witch-review-park-jinyoung-roh-jeong-eui-shine-in-slow-burning-psychological-mystery-2681258-2025-02-17",
      "headline": "The Witch review: Jinyoung, Jeong-eui shine in slow-burning psychological mysteryReleased-Sat Feb 15, 2025The Witch review: The Witch, a new K-drama starring Jinyoung and Jeong-eui, captivates with its psychological mystery and slow-burning narrative. The series, based on a popular webtoon, blends mystery, romance, and suspense, leaving viewers intrigued by the enigmatic characters and their complex interactions, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rashami-desai-on-love-hate-bond-with-sidharth-shukla-we-would-communicate-through-eyes-2681270-2025-02-17",
      "headline": "Rashami Desai on love-hate bond with Sidharth Shukla: We'd communicate through eyesActor Rashami Desai, who had worked with the late Sidharth Shukla on 'Dil Se Dil Tak' and 'Bigg Boss 13', was reminded of her relationship with him on comedian Bharti Singh's podcast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/stray-kids-felix-arm-fracture-in-car-accident-misses-fan-meet-2681229-2025-02-17",
      "headline": "Stray Kids' Felix suffers fracture after car accident, misses group's fan meetFelix, a member of the boy band Stray Kids, suffered an arm fracture in a minor car accident, causing him to miss the band's fifth fan meeting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/south-korean-actor-kim-sae-ron-suicide-comeback-to-films-2681202-2025-02-17",
      "headline": "South Korean actor Kim Sae-ron wanted to make a comeback to films, open a cafeSouth Korean actor Kim Sae-ron, who was found dead in her apartment on Sunday, had wished to make a comeback to the entertainment world, revealed a friend recently. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-usaid-funds-india-voter-turnout-kickback-scheme-bjp-rahul-gandhi-2683261-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump calls USAID funds to India 'kickback scheme', BJP needles Rahul GandhiThe BJP was quick to latch on to Trump's latest remarks to accuse Rahul Gandhi of seeking foreign intervention ahead of the 2024 election, citing his comments at an event in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankars-veiled-dig-at-china-during-g20-ministers-meet-in-south-africa-no-room-for-coercion-2683197-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No room for coercion: Jaishankar's veiled dig at China during G20 ministers' meetJaishankar said that the member nations must also recognise that multilateralism itself lies deeply damaged and that the UN and its Security Council are often grid-locked."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/elon-musk-andreas-mogensen-sunita-williams-butch-wilmore-return-space-spat-twitter-retarded-lie-idiot-donald-trump-joe-biden-2683221-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Idiot: Elon Musk feuds with astronaut over Sunita Williams' return from spaceFormer ISS commander Andreas Mogensen called out SpaceX CEO Elon Musk for claiming Joe Biden abandoned Sunita Williams and Butch Wilmore in space for \"political reasons\". Musk was quick to counter, calling Mogensen an \"idiot\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/kash-patel-fbi-director-confirmed-donald-trump-loyalist-republican-dan-scavino-assistant-bollywood-meme-video-viral-2683177-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Trump aide's 'Malhari' edit to welcome new FBI chief Kash PatelTaking to X, Dan Scavino - who is US President Donald Trump's assistant and White House Deputy Chief of Staff - shared an edited 47-second dance clip from the film 'Bajirao Mastani' to congratulate Kash Patel on becoming the FBI director."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/its-2025-but-has-dating-become-any-easier-for-divorced-indian-women-2683214-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "It's 2025, but has dating become any easier for divorced Indian women?Everyone wants to find love—because why not? It's a magical feeling. But in this search for love, do divorced men have it easier than women?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/milk-price-hike-in-karnataka-kmf-proposes-rs-5-hike-per-litre-lesser-quantity-2683268-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pay more, get less: Karnataka milk body proposes Rs 5 hike, cut in quantityKMF has proposed a Rs 5 per litre hike in Nandini milk prices, reducing the quantity from 1,050 ml to one litre. If approved, the price will rise to Rs 47 per litre after the state budget on March 7. This comes amid hikes in coffee powder, BMTC, Metro fares, water tariffs, and electricity rates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-claims-brics-india-china-broke-up-threatened-150-tariffs-undermining-dollar-2683205-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump claims BRICS 'broke up' after tariff threat: Haven't heard from them latelyTrump claims BRICS, which includes India, 'broke up' after he threatened 150% tariffs for undermining dollar"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rajkummar-rao-set-to-portray-sourav-ganguly-in-upcoming-biopic-confirms-former-indian-cricket-captain-2683250-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rajkummar Rao to play Sourav Ganguly in his biopic, confirms former cricketerBollywood actor Rajkummar Rao has been confirmed to play the role of Sourav Ganguly in an upcoming biopic. The former Indian cricket captain mentioned issues with scheduling but confirmed the project is underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/tesla-ceo-elon-musk-waves-chainsaw-symbolising-us-federal-spending-cuts-under-doge-javier-milei-2683182-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'For bureaucracy': Elon Musk waves chainsaw gifted by Argentina's MileiThe Department of Government Efficiency (DOGE) headed by Tesla CEO and billionaire Elon Musk, claims to have saved $55 billion by February 19, with a single contract being worth USD 8 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/lpus-2025-batch-final-year-student-bags-rs-103-crore-118000-placement-package-2682322-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LPU's 2025 Batch Final Year Student Bags Rs 1.03 Crore ($1,18,000) Placement Package-Betireddy Naga Vamsi Reddy B. Tech student has secured a 1.03 Crore ($1,18,000) package with an AI robotics company and is set to graduate in May 2025. \r\n\r\n-Over 1,700 students have received packages ranging from Rs 10 LPA – Rs 1 Crore per annum \r\n\r\n-1,912 students received multiple job offers while Adireddy Vasu, secured 7 job offers, setting a rare and impressive record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/rss-imprint-modis-messaging-how-rekha-gupta-got-to-the-hot-seat-in-delhi-2683038-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RSS imprint, Modi's messaging: How Rekha Gupta got to the hot seat in DelhiGupta joins the BJP's small league of woman CMs, bringing to the table dyed-in-the-wool Sangh experience, strong organisational skills and an uncontroversial image\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/fact-check/story/fact-check-woman-showing-impressive-sword-wielding-skills-is-not-delhis-new-cm-rekha-gupta-2683085-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woman showing impressive sword-wielding skills is NOT Delhi's new CM Rekha GuptaThe viral video shows actress Payal Jadhav showcasing her sword-wielding skills. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-to-play-auto-driver-in-hollywood-debut-watch-viral-clip-2683234-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan to play auto driver in Hollywood debut? Watch viral clipVideos of superstar Salman Khan filming his Hollywood debut in Dubai have gone viral on social media. In one clip, he is seen dressed as an auto driver, accompanied by actor and friend Sanjay Dutt.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-marriage-divorce-case-end-of-life-terminate-cases-couple-2683119-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Marriage falling apart not end of life, move ahead: Supreme Court to coupleThe Supreme Court, while dissolving the marriage of a couple, observed that a failed marriage is not the end of life and advised them to move forward peacefully."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dhanashree-verma-shares-cryptic-post-amid-divorce-rumours-with-yuzvendra-chahal-stressed-to-blessed-2683241-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dhanashree Verma's cryptic post amid divorce rumours: From stressed to blessedDhanashree Verma recently shared a cryptic message on social media, suggesting a shift from 'stressed to blessed'. This comes amid swirling rumours of a possible divorce with cricketer Yuzvendra Chahal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/ashish-chanchlani-india-got-latent-vulgar-joke-row-case-petition-supreme-court-ranveer-allahbadia-samay-raina-2683245-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Youtuber Ashish Chanchlani seeks scrapping of case, Supreme Court hearing todayYouTuber Ashish Chanchlani, who has been named in the FIR registered by Assam Police, has approached the Supreme Court seeking the cancellation of the case of transfer of the same to Mumbai, citing it was filed in the latter first. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/scientists-reveal-how-coronal-holes-on-sun-influence-monsoon-rains-in-india-2682544-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dark patches on the Sun are affecting monsoon rains in India These findings are crucial, as space weather affects satellites, and there's growing evidence linking coronal holes to variations in the Indian Monsoon rainfall."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bhopal-man-married-5-times-kills-friend-for-opposing-his-marriage-to-sister-2683248-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bhopal man, married 5 times, kills friend for opposing his marriage to sisterDuring interrogation, the accused admitted that he wanted to marry Sandeep's cousin Vandana, but Sandeep opposed the idea. To eliminate him, he conspired with his associates, Utkarsh Chaudhary and Adarsh Chaudhary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-the-share-market-falling-today-3-key-reasons-to-know-2683247-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex tanks nearly 500 points. 3 reasons why stock market is falling todayThe S&P BSE Sensex was down 461.08 points to 75,274.88 at 11:32 am and the NSE Nifty50 fell 144.45 points to trade at 22,768.70. Here are 3 things investors need to know about today's stock market downturn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/usaid-india-voter-turnout-42-billion-rs-182-crore-indian-election-explained-elon-musk-donald-trump-2682931-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "USAID for voter turnout: Can Rs 182 crore turn an Indian election?US President Donald Trump suggested that USAID, an independent US aid agency that handles $42 billion of funds, interfered in India's electoral process. The USAID dedicated Rs 182 crore to boost voter turnout in India when the country spends Rs 16 lakh crore in general elections. Can this drop in the ocean influence poll outcomes?  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/nilavuku-enmel-ennadi-kobam-review-dhanush-pavish-narayan-mathew-thomas-anikha-surendran-2683195-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nilavuku Enmel Ennadi Kobam review: Dhanush's moon-aimed mission is half successfulReleased-Fri Feb 21, 2025Nilavuku Enmel Ennadi Kobam movie review: Directed by Dhanush, the rom-com starring Pavish, Anikha Surendran and Matthew Thomas, is a fun film about love and friendships. The film has inconsistencies in screenplay, which never lets it rise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/oppo-launches-find-n5-thinnest-foldable-phone-in-the-world-pricing-is-eye-watering-2683206-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Oppo Find N5 launched, company says it is the thinnest foldable phone in the worldOppo Find N5 has made a global debut of its world's thinnest foldable phone and it is priced around Rs 1,60,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-lok-sabha-election-turnout-usaid-funding-india-director-veena-reddy-2683025-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Veena Reddy, ex-USAID India chief facing BJP heatDonald Trump claimed that the previous Joe Biden administration in the US tried to interfere in India's elections by allocating a now-cancelled $21 million grant for voter turnout, implying it was intended to influence the outcome."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/please-come-back-kiit-founder-achyuta-samanta-apologises-asks-nepalese-students-to-return-2683188-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Please come back: KIIT founder apologises, asks Nepalese students to returnThe video of Samanta's first public statement on the incident was posted on KIIT's X platform, hours after he was summoned by the Odisha government's high-level committee probing the matter to appear before it on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-box-office-collection-day-7-detailed-report-vicky-kaushal-film-roars-past-rs-200-crore-but-will-it-beat-uri-the-surgical-strike-2683284-2025-02-21",
      "headline": "Chhaava box office Day 7: Vicky's film roars past Rs 200 crore, will it beat Uri?'Chaava' has wrapped up its first week at the box office on a stupendous note. The Vicky Kaushal film has entered the Rs 200 crore club, and has become Kaushal's second after 'Uri: The Surgical Strike' to do so. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mere-husband-ki-biwi-review-rating-arjun-kapoor-bhumi-pednekar-rakul-preet-2683253-2025-02-21",
      "headline": "Mere Husband Ki Biwi review: Arjun Kapoor shines in this chaotic comedyReleased-Fri Feb 21, 2025Mere Husband Ki Biwi sets up a fun premise but loses steam with a chaotic climax. Arjun Kapoor shines, while Rakul Preet and Bhumi Pednekar struggle to leave an impact. Harsh Gujral steals scenes with his comic timing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rajkummar-rao-set-to-portray-sourav-ganguly-in-upcoming-biopic-confirms-former-indian-cricket-captain-2683250-2025-02-21",
      "headline": "Rajkummar Rao to play Sourav Ganguly in his biopic, confirms former cricketerBollywood actor Rajkummar Rao has been confirmed to play the role of Sourav Ganguly in an upcoming biopic. The former Indian cricket captain mentioned issues with scheduling but confirmed the project is underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bb-18-alice-kaushik-tajinder-bagga-and-others-reunite-at-arfeen-saras-goa-bash-2683249-2025-02-21",
      "headline": "BB 18's Alice Kaushik, Tajinder Bagga, others reunite at Arfeen-Sara's Goa bashBigg Boss 18 contestants, including Alice Kaushik, Tajinder Bagga, and Nyrraa Banerjii reunited to celebrate Sara and Arfeen Khan's anniversary in Goa. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-knocked-out-qatar-open-jiri-lehecka-2683281-2025-02-21",
      "headline": "Alcaraz crashes out of Qatar Open after shock defeat in quarter-finalCarlos Alcaraz suffered a shock Qatar Open exit after losing to Jiri Lehecka in the quarter-finals. The Czech player secured the biggest win of his career, shaking up the tournament with another major upset following Djokovic's early elimination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-jai-sholay-gabbar-jasprit-bumrah-india-2683274-2025-02-21",
      "headline": "Shami: The Jai of Indian cricket's Sholay, overshadowed by Gabbar BumrahTime travel to the 90s and the 2000s when Javagal Srinath and Zaheer Khan shared the burden of Indian pace bowling with trundlers like Manoj Prabhakar. Had Mohammed Shami been part of any of these teams, he would have been a legend, a superstar whose face could have launched a million brands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-comeback-india-vs-bangladesh-dubai-2683246-2025-02-21",
      "headline": "8 hours a day at NCA: Mohammed Shami's relentless grind for Champions Trophy gloryMohammed Shami stamped his authority with the ball in India's Champions Trophy opener against Bangladesh. Shami picked up 5 wickets and overtook Zaheer Khan as India's most successful bowler in the ICC white-ball tournaments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-slow-over-rate-penalty-new-zealand-mohammed-rizwan-guilty-2683226-2025-02-21",
      "headline": "Champions Trophy: Pakistan fined for slow-over rate against New ZealandPakistan were fined 5 percent of their match fee for maintaining a slow over-rate against New Zealand in their Champions Trophy opener, adding to their struggles as they prepare for a high-stakes clash against India on February 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-towhid-hridoy-century-india-vs-bangladesh-build-confidence-2683208-2025-02-21",
      "headline": "Champions Tropphy: Hridoy hopeful century vs India will build confidenceBangladesh batter Towhid Hridoy expressed optimism after his maiden ODI century against India in the Champions Trophy opener on February 20, believing the knock will boost his confidence and play a crucial role in shaping his international cricketing career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-mohammed-shami-india-vs-bangladesh-dedicates-to-father-role-model-2683194-2025-02-21",
      "headline": "Shami dedicates bowling brilliance vs Bangladesh to 'role model' fatherIndia's veteran pacer Mohammed Shami dedicated his stunning five-wicket haul against Bangladesh in the Champions Trophy opener to his father, whom he hailed as his greatest inspiration and role model, crediting him for shaping his cricketing journey and resilience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/sourav-ganguly-accident-durgapur-expressway-uninjured-2683198-2025-02-21",
      "headline": "Sourav Ganguly accident: Former India captain escapes unhurt after collision on roadFormer Indian captain Sourav Ganguly narrowly avoided a major accident en route to Burdwan University. Fortunately, no one was injured in the accident. However, two cars in Ganguly's convoy suffered minor damage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-india-vs-pakistan-no-special-mindset-needed-2683192-2025-02-21",
      "headline": "5-star Shami not stressing over India vs Pakistan: No special mindsetMohammed Shami remains unfazed ahead of India's high-stakes Champions Trophy clash against Pakistan, trusting his momentum from a stellar five-wicket haul against Bangladesh instead of adopting a special mindset for the blockbuster encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-robin-uthappa-on-virat-kohlis-form-india-vs-bangladesh-ind-vs-ban-2683155-2025-02-21",
      "headline": "Virat Kohli more worried about middling the ball instead of scoring: Robin UthappaFormer India batter Robin Uthappa commented on Virat Kohli's poor form after he got dismissed for 22 in India's first match of the ICC Champions Trophy 2025 against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-harbhajan-singh-india-lession-interview-2683165-2025-02-21",
      "headline": "Harbhajan Singh wants India to learn 'one lesson' despite win against Bangladesh  Champions Trophy: Former Indian spinner Harbhajan Singh said that India should try and put around 280-300 runs on the board while batting first to put pressure on the opposition on the slow and low pitches at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-shubman-gill-reactions-2683159-2025-02-21",
      "headline": "Who said what after Shami, Shubman Gill help India beat Bangladesh Champions Trophy: Rohit Sharma praised Shubman Gill and Mohammed Shami for their incredible performance after India beat Bangladesh by six wickets. Shanto, on the other hand, said that losing wickets in the powerplay pushed the Tigers back on the backfoot. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/sourav-ganguly-accident-durgapur-expressway-uninjured-2683198-2025-02-21",
      "headline": "Sourav Ganguly accident: Former India captain escapes unhurt after collision on roadFormer Indian captain Sourav Ganguly narrowly avoided a major accident en route to Burdwan University. Fortunately, no one was injured in the accident. However, two cars in Ganguly's convoy suffered minor damage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-india-vs-pakistan-no-special-mindset-needed-2683192-2025-02-21",
      "headline": "5-star Shami not stressing over India vs Pakistan: No special mindsetMohammed Shami remains unfazed ahead of India's high-stakes Champions Trophy clash against Pakistan, trusting his momentum from a stellar five-wicket haul against Bangladesh instead of adopting a special mindset for the blockbuster encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-robin-uthappa-on-virat-kohlis-form-india-vs-bangladesh-ind-vs-ban-2683155-2025-02-21",
      "headline": "Virat Kohli more worried about middling the ball instead of scoring: Robin UthappaFormer India batter Robin Uthappa commented on Virat Kohli's poor form after he got dismissed for 22 in India's first match of the ICC Champions Trophy 2025 against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-harbhajan-singh-india-lession-interview-2683165-2025-02-21",
      "headline": "Harbhajan Singh wants India to learn 'one lesson' despite win against Bangladesh  Champions Trophy: Former Indian spinner Harbhajan Singh said that India should try and put around 280-300 runs on the board while batting first to put pressure on the opposition on the slow and low pitches at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-shubman-gill-reactions-2683159-2025-02-21",
      "headline": "Who said what after Shami, Shubman Gill help India beat Bangladesh Champions Trophy: Rohit Sharma praised Shubman Gill and Mohammed Shami for their incredible performance after India beat Bangladesh by six wickets. Shanto, on the other hand, said that losing wickets in the powerplay pushed the Tigers back on the backfoot. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}