{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-income-tax-regime-what-to-choose-if-you-earn-rs-50-lakh-per-year-2696980-2025-03-21",
      "headline": "Old vs new income tax regime: What to choose if you earn Rs 50 lakh per yearTaxpayers should consider a few key factors before making a choice. The old regime allows deductions, whereas the new regime offers lower tax rates but no major deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-over-500-points-nifty-above-23300-ntpc-gains-3-percent-2696931-2025-03-21",
      "headline": "Sensex closes over 500 points, Nifty above 23,300; NTPC gains 3%The S&P BSE Sensex added 557.45 points to end at 76,905.51, while the NSE Nifty50 gained 159.75 points to close at 23,350.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-likely-to-drop-usd-23-billion-plan-to-push-domestic-manufacturing-blow-to-make-in-india-2696891-2025-03-21",
      "headline": "Government to lapse $23 billion scheme to boost domestic manufacturing: ReportThe Production-Linked Incentive (PLI) scheme, introduced in 2020, aimed to increase manufacturing's share of India's economy to 25% by 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sbi-card-flexipay-know-how-to-convert-credit-card-payments-into-emis-2696879-2025-03-21",
      "headline": "SBI Card Flexipay: Know how to convert credit card payments into EMIsOne can convert transactions of Rs 500 or more into EMIs under SBI Card's Flexipay option. It offers multiple repayment tenure options, such as three, six, nine, 12, 18 and 24 months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/smallcap-midcap-stock-market-recover-dalal-street-is-it-good-for-risky-mutual-funds-explained-2696870-2025-03-21",
      "headline": "Smallcap, midcap stocks gain momentum. Good news for mutual funds too?Given the correction, some analysts have indicated that quality smallcap and midcap stocks could start regaining some momentum. But does this apply to smallcap and midcap mutual funds too?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-rise-against-us-dollar-strong-fpi-inflows-best-week-in-past-2-years-market-performance-2696862-2025-03-21",
      "headline": "Rupee heads for best week in 2 years as dollar inflows riseAt 1 pm, the rupee was trading at 86.07 against the US dollar, extending its weekly gain to 0.72%. This marks the strongest weekly performance for the rupee since 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foreign-investor-exodus-dalal-street-over-key-factors-explained-stock-market-rally-retail-investors-2696842-2025-03-21",
      "headline": "Is the foreign selling crisis finally over on Dalal Street?Foreign investors turned net buyers in two of the last four sessions, sparking a market rally. While selling pressure has eased, is the months-long foreign outflow crisis finally coming to an end?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/morgan-stanley-to-layoff-2000-employees-to-boost-efficiency-2696835-2025-03-21",
      "headline": "Morgan Stanley to layoff 2,000 employees to boost efficiencySeveral renowned banks have been reducing their workforce recently as they brace for economic uncertainty following President Donald Trump's newly announced trade tariffs.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-group-tesla-partnership-global-supplier-india-entry-elon-musk-report-2696815-2025-03-21",
      "headline": "Tata Group quietly becomes Tesla's global supplier: ReportTata firms have already signed global agreements with Tesla and are supplying various parts and services and their involvement is expected to grow further. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unified-pension-scheme-to-start-from-april-1-check-eligibility-and-contribution-2696790-2025-03-21",
      "headline": "Unified Pension Scheme: Who can join and how much to contributeUPS will be available to central government employees who meet specific criteria. This includes existing employees under NPS as of 1st April 2025. It also includes newly recruited employees joining central government services on or after April 1, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ai-algorithmic-trading-can-artificial-intelligence-help-you-make-money-on-dalal-street-2696777-2025-03-21",
      "headline": "Can AI pick winning stocks on Dalal Street? Check out these toolsOne of the major advantages of using AI is that it takes care of the labour-intensive aspects of trading efficiently, as per experts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-pakistan-planning-to-legalise-cryptocurrency-3-key-reasons-2696773-2025-03-21",
      "headline": "Pakistan plans to legalise cryptocurrency to tackle economic slowdownNearly 15-20 million Pakistanis are already trading digital assets. Further, countries like the US and UAE are embracing crypto-friendly policies, making it crucial for Pakistan to stay competitive."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jack-harlows-long-awaited-collaboration-with-doja-cat-just-us-stream-it-now-glbs-2697197-2025-03-22",
      "headline": "Jack Harlow's long-awaited collaboration with Doja Cat, 'Just Us': Stream it nowJack Harlow and Doja Cat join forces for \"Just Us,\" a long-awaited collaboration. The track follows Harlow's successful Jackman album and recent singles, fueling excitement for his upcoming projects.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/blake-lively-seeks-dismissal-of-justin-baldonis-400-million-defamation-lawsuit-glbs-2697189-2025-03-21",
      "headline": "Blake Lively seeks dismissal of Justin Baldoni's $400 million defamation lawsuitBlake Lively seeks dismissal of Justin Baldoni's $400 million defamation lawsuit, calling it \"vengeful\". Baldoni countersued Lively, Ryan Reynolds, and The New York Times. A March 2026 trial is scheduled.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflixs-adolescence-soars-to-243-million-views-in-just-four-days-glbs-2697184-2025-03-21",
      "headline": "Netflix's 'Adolescence' soars to 24.3 million views in just four daysNetflix's crime drama Adolescence became a breakout hit with 24.3 million views, exploring a teen accused of murder. Its slow-burning tension, emotional depth, and realistic storytelling make it a must-watch.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/disneys-snow-white-controversies-delays-box-office-uncertainty-glbs-2697129-2025-03-21",
      "headline": "Disney's Snow White: Controversies, delays & box office uncertaintyDisney's live-action Snow White faced delays, controversies, and budget woes. Casting backlash, political disputes, and a $270 million cost led to low confidence and uncertain box office projections.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-arrives-in-kolkata-of-kkr-vs-rcb-ipl-2025-2697140-2025-03-21",
      "headline": "Shah Rukh Khan arrives in Kolkata in style ahead of KKR vs RCB match. WatchSuperstar Shah Rukh Khan has arrived in the City of Joy. The actor landed in Kolkata in style as he was seen waving to fans before getting inside his car. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/severance-season-2-finale-dichen-lachman-shares-behind-the-scenes-details-glbs-2697136-2025-03-21",
      "headline": "'Severance' Season 2 finale: Dichen Lachman shares behind-the-scenes detailsDichen Lachman shares behind-the-scenes information regarding Severance's Season 2 finale, including Gemma's tearful reunion with Mark, dramatic moments on set, and doubts regarding the future of the show.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/pete-davidson-spotted-with-elsie-hewitt-new-romance-rumours-spark-glbs-2697124-2025-03-21",
      "headline": "Pete Davidson spotted with Elsie Hewitt: New romance rumours sparkPete Davidson was spotted with Elsie Hewitt, sparking dating rumours. The comedian has a history of high-profile relationships and recently made headlines for removing his tattoos, calling the process painful and lengthy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apple-tv-severance-renewed-for-season-3-2697085-2025-03-21",
      "headline": "Apple TV's Severance renewed for Season 3The critically acclaimed Apple TV show Severance has been renewed for a third season, Apple CEO Tim Cook shared. The show has been created by Ben Stiller. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/salaar-re-releases-in-theatres-fans-cheer-dance-celebrate-prabhas-prithviraj-sukumaran-prashanth-neel-2697092-2025-03-21",
      "headline": "Salaar re-releases in theatres: Fans cheer, dance, and celebrate Prabhas' filmPrabhas and Prithviraj Sukumaran's Salaar re-released in theatres on March 21. Several videos of fans celebrating the movie have surfaced online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-named-21st-centurys-most-influential-female-artiste-by-billboard-2697091-2025-03-21",
      "headline": "Taylor Swift named 21st century's most influential female artiste by BillboardBillboard has named Taylor Swift as the most influential female artist of the 21st century. Her chart-topping success and industry impact earn her the top spot on the list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-sukumaran-opens-up-about-casting-aamir-khan-sister-nikhat-in-empuraan-2697054-2025-03-21",
      "headline": "Prithviraj Sukumaran opens up about casting Aamir Khan's sister Nikhat in EmpuraanSouth star Prithviraj Sukumaran recently opened up about casting Aamir Khan's sister Nikhat Hegde in L2: Empuraan. Empuraan releases on March 27 in cinemas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/disney-confirms-coco-sequel-for-2029-with-original-director-returning-2697023-2025-03-21",
      "headline": "Disney confirms Coco sequel for 2029 with original director returningDisney has officially announced a sequel to its acclaimed animated film Coco. The film, set for release in 2029, is currently in early development stages."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ektaa-kapoor-shares-a-cryptic-post-after-anurag-kashyap-praises-adolescence-2697042-2025-03-21",
      "headline": "Ektaa Kapoor shares a cryptic post after Anurag Kashyap praises AdolescenceEktaa Kapoor shared a cryptic message on social media following Anurag Kashyap's praise for the show, Adolescence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-salman-khan-vicky-kaushal-suniel-shetty-anurag-thakur-tb-awareness-cricket-match-2697018-2025-03-21",
      "headline": "Big B, Salman Khan, Vicky Kaushal to attend tuberculosis awareness cricket matchAmitabh Bachchan, Salman Khan, Vicky Kaushal among other stars are expected to attend TB Mukt Bharat Awareness cricket match which is scheduled to take place on March 22 in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-teens-and-mind-boggling-coded-world-of-kidney-beans-purple-hearts-2696892-2025-03-21",
      "headline": "Adolescence: Teens and mind-boggling coded world of kidney beans, purple hearts'Adolescence' opens the door to a whole new world for parents and guardians, where teenagers are creating their own language, encrypted with codes and symbols. How scary is that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-alia-bhatt-hints-about-expanding-his-family-2696971-2025-03-21",
      "headline": "Ranbir Kapoor hints about expanding his family, having a second childActor Ranbir Kapoor might be thinking about expanding his family with partner and actor Alia Bhatt. Bhatt and Kapoor got married in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/novocaine-review-jack-quaid-ray-nicholson-carry-well-paced-action-comedy-2696890-2025-03-21",
      "headline": "Novocaine review: Jack Quaid, Ray Nicholson easily carry the well-paced actionerReleased-Fri Mar 14, 2025Novocaine is a high-speed thriller that combines action and comedy in equal measure. Despite its predictable plot, strong performances by Jack Quaid and Ray Nicholson make it a worthwhile watch. But is it to your liking? Read on and find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saqib-ayub-superboys-of-malegaon-box-office-we-got-only-500-600-screens-2696959-2025-03-21",
      "headline": "Actor Saqib Ayub on Superboys of Malegaon box office: We got only 500-600 screensActor Saqib Ayub, in an exclusive interview, spoke about his journey on Rema Kagti's Superboys of Malegaon. The actor also discussed the \r\nfilm's limited screen releases. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ashish-chanchlani-admits-stress-eating-amid-indias-got-latent-row-in-new-post-2696953-2025-03-21",
      "headline": "Ashish Chanchlani admits 'stress eating', amid India's Got Latent row in new postSocial media influencer and YouTuber Ashish Chanchlani shared a picture from his gym on Friday, admitting to 'stress eating' amid India's Got Latent controversy. He has been in the limelight for his drastic weight-loss transformation. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gross-domestic-behaviour-india-today-survey-states-social-progress-gender-equality-civic-behaviour-2697039-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mapping India's GDB: Survey reveals how states fare in social behaviourIndia might be the fastest-growing economy, but how does it fare on social indicators like civic behaviour, safety, gender attitudes and diversity? A first-of-its-kind survey by India Today across 21 states sheds light on the social progress of the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-on-high-court-judge-transfer-proposal-independent-of-probe-into-cash-row-2697040-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi judge's transfer not linked to cash probe: Supreme Court rejects rumoursThe Supreme Court clarified today that Justice Yashwant Varma's transfer to the Allahabad High Court is unrelated to the alleged cash recovery from his residence, emphasising that the in-house inquiry is proceeding separately as per procedure."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/amit-shah-hindi-language-controversy-criticises-dmk-over-no-tamil-engineering-medical-education-courses-promises-translations-2697012-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DMK hiding behind Hindi row, lacks courage to translate texts in Tamil: Amit ShahUnion Home Minister Amit Shah accused the DMK government of lacking the courage to introduce Tamil translations for medical and engineering courses, promising to implement them if his party comes to power in the state.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/why-shivaji-grandson-shahuji-visited-aurangzeb-tomb-maratha-mughal-empire-what-happened-nagpur-violence-chhavva-2696811-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Shivaji's grandson went on pilgrimage to Aurangzeb's tombShahu I, the grandson of Shivaji and son of Shambhaji who was executed by the Mughals, visited Aurangzeb's grave. The visit by Shahuji, who was kept captive for 18 years in a Mughal camp, has to be seen in the correct historical and political context, and his battle with Maratha queen Tarabai Bhosle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-teens-and-mind-boggling-coded-world-of-kidney-beans-purple-hearts-2696892-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Adolescence: Teens and mind-boggling coded world of kidney beans, purple hearts'Adolescence' opens the door to a whole new world for parents and guardians, where teenagers are creating their own language, encrypted with codes and symbols. How scary is that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/is-travelling-ticketless-paying-bribe-gross-domestic-behaviour-india-today-survey-will-shock-heres-why-2697065-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Is travelling ticketless, paying bribe okay? GDB survey will shock youIndia is doing well economically and that is visible through its GDP numbers. But how do its citizens fare when it comes to social responsibilities and civic sense? The India Today Gross Domestic Behaviour (GDB) survey for the first time reveals what Indians think about tampering with electric meters or travelling without tickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-hc-judge-yashwant-verma-caught-with-cash-stash-heaped-praise-on-upi-firefighters-official-residence-2696973-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi HC judge with cash stash at home heaped praise on UPIHeaps of cash were found at the official residence of Delhi High Court judge Yashwant Varma by firefighters who were called to fight a fire. In 2023, Justice Varma heaped praise on UPI, India's indigenous digital transaction interface. UPI is intended to reduce cash transactions, thereby hurting the black economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/heathrow-power-outage-disrupts-flight-ops-foul-play-ruled-out-all-we-know-glbs-2697185-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Heathrow power outage disrupts flight ops, foul play ruled out: All we knowAt least 1,350 flights to and from Heathrow were affected and the impact was likely to last several days as passengers tried to reschedule their travel and airlines worked to reposition aircraft and crews."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/summer-fruit-jewellery-bags-hailey-bieber-ananya-panday-khushi-kapoor-2697003-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Citrus summer: Eat fruits, but wear them too (we tell you how)This season, we recommend a high dose of citrus - perhaps in your diet, but definitely in your fashion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-high-court-judge-yashwant-varma-cash-recovery-revives-memory-of-simbhaoli-sugar-mill-fraud-case-2697156-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi judge embroiled in cash row was named in CBI case in 2018The alleged cash recovery from Justice Yashwant Varma's residence has revived scrutiny over his past financial dealings, particularly his ties to the 2018 Simbhaoli Sugar Mill fraud case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-rcb-opener-rain-threat-rules-cut-off-time-2697137-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What happens if IPL 2025 opener between KKR and RCB is affected by rain?IPL 2025, KKR vs RCB: The much-anticipated start to IPL 2025 faces a potential hurdle in the form of inclement weather in Kolkata. Rain showers are predicted, which could dampen the spirits of what is expected to be a packed crowd at the iconic Eden Gardens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-assembly-bjp-mlas-suspended-removed-by-marshals-honeytrap-scandal-muslim-quota-2696970-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "18 protesting BJP MLAs suspended, carried out of Karnataka Assembly by marshalsThe Karnataka Speaker suspended 18 BJP MLAs for six months after they disrupted proceedings over a honey-trap scandal and a bill that gives 4 per cent quota to Muslims in public contracts. BJP members stormed the well, tore documents, and demanded a probe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-arrives-in-kolkata-of-kkr-vs-rcb-ipl-2025-2697140-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shah Rukh Khan arrives in Kolkata in style ahead of KKR vs RCB match. WatchSuperstar Shah Rukh Khan has arrived in the City of Joy. The actor landed in Kolkata in style as he was seen waving to fans before getting inside his car. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/cancer-early-detection-tests-signs-symptoms-cough-fever-fatigue-tired-sleepy-fever-colon-breast-uterine-2697030-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Spot cancer before it spots you: Signs you shouldn't ignore, tests you must takeHave you ever googled your symptoms and got a 'mini heart attack' when the answer indicates cancer? You are not alone. But it is better to be safe than sorry. Read on to know more about must-do tests for early detection of cancer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/singing-song-yeh-reshmi-zulfein-not-workplace-sexual-harassment-bombay-high-court-verdict-bank-employee-posh-act-case-2696956-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Singing 'ye reshmi zulfein' in work meet not sexual harassment: Bombay High CourtThe Bombay High Court quashed an Internal Complaints Committee report and an Industrial Court ruling against a bank employee accused of workplace sexual harassment. The court ruled that singing \"Yeh Reshmi Zulfein\" doesn't count as sexual harassment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/brs-mlc-k-kavitha-chili-garlands-mini-scooters-postcards-handcuffs-protests-against-telangana-congress-2697074-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BRS leader K Kavitha is pro at protests: How she keeps Congress on toesBRS leader K Kavitha has turned political protests into striking visual spectacles, using chilli garlands, mini-scooters, dried crops, postcards, and handcuffs to highlight the failures of the ruling Congress government. Her dramatic demonstrations keep Congress on its toes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-history-vijay-mallya-parties-rcb-vs-kkr-2696957-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IPL Story, Part 3: Greed is good. When Indian cricket met its dark sideCricket has come a long way from its pure, traditional form to its transformation into a commercialised, glamour-driven spectacle through the IPL. The transformation reflects societal and economic shifts in India and the world highlighting IPL's rise as a symbol of materialism, entertainment, and the commodification of both players and fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-income-tax-regime-what-to-choose-if-you-earn-rs-50-lakh-per-year-2696980-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Old vs new income tax regime: What to choose if you earn Rs 50 lakh per yearTaxpayers should consider a few key factors before making a choice. The old regime allows deductions, whereas the new regime offers lower tax rates but no major deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kane-williamson-interview-commentary-anchor-big-names-2697122-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IPL only for big-hitters? Different styles still relevant, says Kane WilliamsonIPL 2025: Batting great Kane Williamson acknowledged the growing dominance of power-hitting in the Indian Premier League but stressed that there is still room for different batting styles. The former New Zealand captain is set to make his commentary debut in the 2025 season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/whats-a-gynaecologist-got-to-do-with-gut-issues-2696416-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What's a gynaecologist got to do with gut issues?Gut and vaginal health, linked to microbiome balance, are far more interconnected than one would imagine\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/snow-white-movie-review-starring-rachel-zegler-gal-gadot-forgettable-watch-2696875-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Snow White review: Gal Gadot is the bright spot in an otherwise dull narrativeReleased-Fri Mar 21, 2025The 2025 live-action adaptation of Snow White, starring Rachel Zegler and directed by Marc Webb, fails to capture the magic of the original 1937 classic. Despite Gal Gadot's standout performance as the Evil Queen and impressive visuals, the film lacks emotional depth and leaves little impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-awards-boeing-contract-build-f-47-us-air-force-future-fighter-jet-2697148-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump awards Boeing contract to build F-47, US Air Force's future fighter jetPresident Donald Trump awarded the production of the F-47 fighter jet to Boeing. It will replace Lockheed Martin's F-22 Raptor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-man-hangs-self-wife-mother-in-law-watch-live-on-instagram-2697094-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Madhya Pradesh man hangs self; wife, mother-in-law watch live on InstagramA man in Madhya Pradesh died by suicide on Instagram Live as his wife watched for 44 minutes. Police arrested her and her mother, citing domestic disputes and alleged extramarital ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-bros-are-big-on-botox-2696409-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why bros are big on BotoxWith 'Brotox', men can look to sport a smoother appearance, preserving their individuality while softening the markers of time on skin\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/blake-lively-seeks-dismissal-of-justin-baldonis-400-million-defamation-lawsuit-glbs-2697189-2025-03-21",
      "headline": "Blake Lively seeks dismissal of Justin Baldoni's $400 million defamation lawsuitBlake Lively seeks dismissal of Justin Baldoni's $400 million defamation lawsuit, calling it \"vengeful\". Baldoni countersued Lively, Ryan Reynolds, and The New York Times. A March 2026 trial is scheduled.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/disneys-snow-white-controversies-delays-box-office-uncertainty-glbs-2697129-2025-03-21",
      "headline": "Disney's Snow White: Controversies, delays & box office uncertaintyDisney's live-action Snow White faced delays, controversies, and budget woes. Casting backlash, political disputes, and a $270 million cost led to low confidence and uncertain box office projections.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-arrives-in-kolkata-of-kkr-vs-rcb-ipl-2025-2697140-2025-03-21",
      "headline": "Shah Rukh Khan arrives in Kolkata in style ahead of KKR vs RCB match. WatchSuperstar Shah Rukh Khan has arrived in the City of Joy. The actor landed in Kolkata in style as he was seen waving to fans before getting inside his car. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/severance-season-2-finale-dichen-lachman-shares-behind-the-scenes-details-glbs-2697136-2025-03-21",
      "headline": "'Severance' Season 2 finale: Dichen Lachman shares behind-the-scenes detailsDichen Lachman shares behind-the-scenes information regarding Severance's Season 2 finale, including Gemma's tearful reunion with Mark, dramatic moments on set, and doubts regarding the future of the show.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/lions-sign-cb-avonte-maddox-to-one-year-deal-agent-confirms-glbs-2697199-2025-03-22",
      "headline": "Lions sign CB Avonte Maddox to one-year deal, agent confirmsThe Detroit Lions have added veteran cornerback Avonte Maddox on a one-year contract. The move strengthens their secondary as they look to build on last season's defensive improvements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/report-aaron-rodgers-set-to-visit-steelers-on-friday-amid-trade-speculation-glbs-2697194-2025-03-21",
      "headline": "Report: Aaron Rodgers set to visit steelers on friday amid trade speculationVeteran quarterback Aaron Rodgers is reportedly meeting with the Pittsburgh Steelers, fueling speculation about a potential move. The visit could signal major changes for both Rodgers and the Steelers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/capitals-clinch-first-nhl-playoff-spot-of-2025-after-last-place-finish-last-year-glbs-2697186-2025-03-21",
      "headline": "Capitals Clinch first NHL playoff spot of 2025 after last-place finish last yearThe Washington Capitals secured the first postseason berth of the 2025 NHL season, a remarkable turnaround after barely making the playoffs last year. Their resurgence signals a strong championship push."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/march-madness-2025-less-than-1-of-brackets-remain-perfect-after-day-on-2697181-2025-03-21",
      "headline": "March Madness 2025: Less than 1% of brackets remain perfect after day onThe first day of March Madness 2025 delivered major upsets, busting nearly all brackets. Only a fraction of fans still hold a perfect bracket as the tournament unfolds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/march-madness-2025-five-nba-stars-college-performances-glbs-2697157-2025-03-21",
      "headline": "March Madness 2025: Five NBA stars' college performancesMarch Madness 2025 season has started, and it is the perfect time to reflect on how some of the current NBA stars performed during their college careers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-aaron-finch-on-virat-kohlis-strike-rate-kkr-vs-rcb-2697168-2025-03-21",
      "headline": "If you want Virat Kohli to strike higher, his consistency will go down: Aaron FinchFormer Australia captain Aaron Finch feels Royal Challengers Bengaluru (RCB) batter Virat Kohli's consistency will be massively affected if he tries to up his strike rate in the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/is-stephen-curry-playing-tonight-latest-injury-updates-for-warriors-star-glbs-2697169-2025-03-21",
      "headline": "Is Stephen Curry playing tonight? Latest injury updates for Warrior's starGolden State Warriors Stephen Curry suffered a hard fall on Thursday, March 20 in a thriller 117-114 win over the Toronto Raptors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-doesnt-need-to-bat-like-rohit-sharma-aaron-finch-2697163-2025-03-21",
      "headline": "Virat Kohli doesn't need to bat like Rohit Sharma in IPL 2025: Aaron FinchFormer Australia captain Aaron Finch said that India and Royal Challengers Bengaluru batter Virat Kohli doesn't need to go after the bowling right from the word go like Rohit Sharma in the upcoming Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/kkr-vs-rcb-ipl-2025-varun-chakravarthy-pre-match-press-conference-2697154-2025-03-21",
      "headline": "KKR banking on overseas core for title defence: Varun ChakravarthyKolkata Knight Riders are going to bank on their strong core of overseas players as they look to defend the IPL title this season, said Varun Chakravarthy. KKR play RCB in the season opener at Eden Gardens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-andy-flower-on-virat-kohlis-batting-in-modern-t20-cricket-2697147-2025-03-21",
      "headline": "Still place for players like Virat Kohli in modern T20 cricket: Andy FlowerRoyal Challengers Bengaluru (RCB) head coach Andy Flower said that while T20 cricket has become a game of big hitters in the recent past, there's still a place for high-quality, highly intelligent cricketers like Virat Kohli."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-rcb-varun-chakravarthy-virat-kohli-2697138-2025-03-21",
      "headline": "Varun Chakravarthy excited for Virat Kohli battle in IPL 2025 openerKolkata Knight Riders will face Royal Challengers Bengaluru in the IPL 2025 opener. Ahead of the game, Varun Chakravarthy has said that he is excited to face Virat Kohli in the opposition team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/is-stephen-curry-playing-tonight-latest-injury-updates-for-warriors-star-glbs-2697169-2025-03-21",
      "headline": "Is Stephen Curry playing tonight? Latest injury updates for Warrior's starGolden State Warriors Stephen Curry suffered a hard fall on Thursday, March 20 in a thriller 117-114 win over the Toronto Raptors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-doesnt-need-to-bat-like-rohit-sharma-aaron-finch-2697163-2025-03-21",
      "headline": "Virat Kohli doesn't need to bat like Rohit Sharma in IPL 2025: Aaron FinchFormer Australia captain Aaron Finch said that India and Royal Challengers Bengaluru batter Virat Kohli doesn't need to go after the bowling right from the word go like Rohit Sharma in the upcoming Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/kkr-vs-rcb-ipl-2025-varun-chakravarthy-pre-match-press-conference-2697154-2025-03-21",
      "headline": "KKR banking on overseas core for title defence: Varun ChakravarthyKolkata Knight Riders are going to bank on their strong core of overseas players as they look to defend the IPL title this season, said Varun Chakravarthy. KKR play RCB in the season opener at Eden Gardens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-andy-flower-on-virat-kohlis-batting-in-modern-t20-cricket-2697147-2025-03-21",
      "headline": "Still place for players like Virat Kohli in modern T20 cricket: Andy FlowerRoyal Challengers Bengaluru (RCB) head coach Andy Flower said that while T20 cricket has become a game of big hitters in the recent past, there's still a place for high-quality, highly intelligent cricketers like Virat Kohli."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-rcb-varun-chakravarthy-virat-kohli-2697138-2025-03-21",
      "headline": "Varun Chakravarthy excited for Virat Kohli battle in IPL 2025 openerKolkata Knight Riders will face Royal Challengers Bengaluru in the IPL 2025 opener. Ahead of the game, Varun Chakravarthy has said that he is excited to face Virat Kohli in the opposition team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-rcb-opener-rain-threat-rules-cut-off-time-2697137-2025-03-21",
      "headline": "What happens if IPL 2025 opener between KKR and RCB is affected by rain?IPL 2025, KKR vs RCB: The much-anticipated start to IPL 2025 faces a potential hurdle in the form of inclement weather in Kolkata. Rain showers are predicted, which could dampen the spirits of what is expected to be a packed crowd at the iconic Eden Gardens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kane-williamson-interview-commentary-anchor-big-names-2697122-2025-03-21",
      "headline": "IPL only for big-hitters? Different styles still relevant, says Kane WilliamsonIPL 2025: Batting great Kane Williamson acknowledged the growing dominance of power-hitting in the Indian Premier League but stressed that there is still room for different batting styles. The former New Zealand captain is set to make his commentary debut in the 2025 season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-andy-flower-on-varun-chakravarthy-sunil-narine-rcb-2697108-2025-03-21",
      "headline": "RCB is all ready for Varun Chakravarthy and Sunil Narine challenge: Andy FlowerRoyal Challengers Bengaluru (RCB) head coach Andy Flower acknowledged the threat of Varun Chakravarthy and Sunil Narine ahead of their opening game against Kolkata Knight Riders (KKR). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-spinner-harbhajan-singh-kkr-vs-rcb-2697106-2025-03-21",
      "headline": "Spinners in IPL are not brave any more: Harbhajan Singh rues lost artFormer spinner Harbhajan Singh has rued the fact that spinners are not brave anymore in the Indian Premier League. Harabhajan said that current spinners lack aggression.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kl-rahul-to-miss-first-two-matches-for-delhi-capitals-2697064-2025-03-21",
      "headline": "KL Rahul to miss first two matches for Delhi Capitals? Alyssa Healy spills the beansIndia wicketkeeper batter KL Rahul is likely to miss the first two matches of the Indian Premier League 2025 (IPL 2025) revealed Australia women's cricket team captain Alyssa Healy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-lsg-match-moved-guwahati-shah-rukh-khan-ashok-dinda-2697057-2025-03-21",
      "headline": "SRK comes to Eden for profits: Dinda after KKR vs LSG relocated to GuwahatiAmidst the controversy over the KKR-LSG match on Ram Navami, Ashok Dinda suggests the shift could be due to potential economic loss for KKR, citing traffic congestion and low attendance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-complete-guide-to-new-rules-lifting-of-saliva-ban-use-of-two-balls-2697041-2025-03-21",
      "headline": "IPL 2025: Complete guide to new rules set to revolutionise T20 extravaganzaThe Indian Premier League 2025 (IPL 2025) is all set to introduce a new set of rules for the 18th season of the T20 extravaganza to add to the excitement of fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-michael-vaughan-backs-harry-brooks-ban-delhi-capitals-2696990-2025-03-21",
      "headline": "Vaughan backs Harry Brook's IPL ban after season pull out: Rules are rulesFormer England captain Michael Vaughan has backed BCCI's move to ban Harry Brook for two seasons of the Indian Premier League 2025 after he pulled out of upcoming season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kl-rahul-to-miss-first-two-matches-for-delhi-capitals-2697064-2025-03-21",
      "headline": "KL Rahul to miss first two matches for Delhi Capitals? Alyssa Healy spills the beansIndia wicketkeeper batter KL Rahul is likely to miss the first two matches of the Indian Premier League 2025 (IPL 2025) revealed Australia women's cricket team captain Alyssa Healy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-lsg-match-moved-guwahati-shah-rukh-khan-ashok-dinda-2697057-2025-03-21",
      "headline": "SRK comes to Eden for profits: Dinda after KKR vs LSG relocated to GuwahatiAmidst the controversy over the KKR-LSG match on Ram Navami, Ashok Dinda suggests the shift could be due to potential economic loss for KKR, citing traffic congestion and low attendance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-complete-guide-to-new-rules-lifting-of-saliva-ban-use-of-two-balls-2697041-2025-03-21",
      "headline": "IPL 2025: Complete guide to new rules set to revolutionise T20 extravaganzaThe Indian Premier League 2025 (IPL 2025) is all set to introduce a new set of rules for the 18th season of the T20 extravaganza to add to the excitement of fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-michael-vaughan-backs-harry-brooks-ban-delhi-capitals-2696990-2025-03-21",
      "headline": "Vaughan backs Harry Brook's IPL ban after season pull out: Rules are rulesFormer England captain Michael Vaughan has backed BCCI's move to ban Harry Brook for two seasons of the Indian Premier League 2025 after he pulled out of upcoming season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/salman-agha-comment-babar-azam-rizwan-pakistan-vs-new-zealand-t20i-2696988-2025-03-21",
      "headline": "My boys aren't just here to make up numbers: Agha's dig at Babar-RizwanPakistan captain in the New Zealand series Salman Ali Agha has taken a sharp dig at Babar Azam and Mohammad Rizwan. After their incredible chase of 205 runs vs New Zealand, Agha took a veiled dig at the senior players.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-ipl-mark-boucher-interview-dressing-room-rohit-sharma-2696987-2025-03-21",
      "headline": "Hardik Pandya had tough IPL 2024, sure MI have sorted things out: Mark BoucherIPL 2025: Former Mumbai Indians head coach Mark Boucher praised Hardik Pandya's battle-hardened mindset, backing him to have a strong season with the five-time champions. Boucher also expressed hope for a more settled dressing room under coach Mahela Jayawardene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-history-vijay-mallya-parties-rcb-vs-kkr-2696957-2025-03-21",
      "headline": "IPL Story, Part 3: Greed is good. When Indian cricket met its dark sideCricket has come a long way from its pure, traditional form to its transformation into a commercialised, glamour-driven spectacle through the IPL. The transformation reflects societal and economic shifts in India and the world highlighting IPL's rise as a symbol of materialism, entertainment, and the commodification of both players and fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nz-vs-pak-3rd-t20i-ahmad-shazad-on-hasan-nawazs-fastest-century-2696943-2025-03-21",
      "headline": "No talent in Pakistan? Ex-opener says Hasan Nawaz's ton vs NZ tight slap for criticsFormer Pakistan opener Ahmed Shahzad has slammed several experts who claimed that there wasn't enough talent in Pakistan to replace the current players following Hasan Nawaz's record-breaking century vs New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hasan-nawaz-babar-azam-rizwan-new-zealand-pakistan-2696925-2025-03-21",
      "headline": "After Hasan Nawaz's hundred, fans want Babar Azam, Rizwan to retireNZ vs PAK: Fans reckoned that Babar Azam and Mohammad Rizwan should retire from T20Is after Hasan Nawaz's record century helped Pakistan beat New Zealand in Auckland. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-hasan-nawaz-fastest-t20i-century-auckland-run-chase-2696904-2025-03-21",
      "headline": "Hasan Nawaz hits Pakistan's fastest T20I hundred in record run chase in AucklandNew Zealand vs Pakistan, 3rd T20I: Hasan Nawaz, 22, hit his hundred in just 44 deliveries in Auckland, breaking the record for the fastest hundred in T20Is for Pakistan. The visitors chased 205 in just 16 overs to keep the five-match series alive. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-opening-ceremony-details-venue-tickets-date-time-performers-2696886-2025-03-21",
      "headline": "IPL 2025 opening ceremony: Check date, timings, venue, performersIPL 2025 opening ceremony details: The curtain-raiser of the Indian Premier League 2025 will be held at Eden Gardens in Kolkata on Saturday, March 22. Shreya Ghoshal, Karan Ahuja and Disha Patani will perform in front of what is expected to be a packed crowd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-ticket-booking-kolkata-eden-gardens-2696885-2025-03-21",
      "headline": "Kolkata Knight Riders IPL Ticket Booking 2025: Date, Price List, How to BookIPL Ticket Booking 2025, Kolkata Knight Riders: Tickets for KKR's match against Royal Challengers Bengaluru have already been sold out. Here's where you can buy your match tickets for KKR's home matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammed-siraj-comeback-gujarat-titans-mohammed-shami-2696877-2025-03-21",
      "headline": "Not going to stress over India comeback during IPL 2025: Mohammed SirajIPL 2025: Mohammed Siraj said he will be fully focussed on giving his best for Gujarat Titans- his first new franchise after having spent seven years at RCB. Siraj was not picked for Champions Trophy 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-kkr-vs-rcb-record-2696861-2025-03-21",
      "headline": "Virat Kohli eyes special landmarks in KKR vs RCB openerIPL 2025: Virat Kohli is only 38 runs away from becoming only the third batter after David Warner and Rohit Sharma to score 1000 or more runs against the Kolkata Knight Riders.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-family-trip-france-champions-trophy-2696821-2025-03-21",
      "headline": "Watch: Gambhir heads to France for family holiday after Champions TrophyIndian men's head coach Gautam Gambhir went on a family trip to France along with his beloved wife Natasha and their two daughters, Aazeen and Anaiza. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}