{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-income-tax-bill-2025-changes-impact-taxpayers-pension-standard-deduction-taxrates-2769897-2025-08-12",
      "headline": "New Income Tax Bill 2025: Will changes in the revised bill impact taxpayers?The updated Bill, presented by Finance Minister Nirmala Sitharaman on August 11, incorporates most of the recommendations made by the Select Committee. It is set to replace the six-decade-old Income Tax Act, 1961."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-150-points-nifty-above-24500-banking-stocks-dip-2769875-2025-08-12",
      "headline": "Sensex, Nifty rebound after falling in early trade; inflation data in focusThe S&P BSE Sensex fell over 150 points at the opening bell but swiftly recovered by 9:23 am. The Sensex was trading 10 points higher at 80,614.05, while the NSE Nifty50 traded 12.80 points higher at 24,597.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/jsw-cement-ipo-allotment-out-today-check-status-listing-date-gmp-kfin-bse-share-price-review-2769863-2025-08-12",
      "headline": "JSW Cement IPO allotment today: Check status online, listing date and GMPInvestors who applied for JSW IPO can check their allotment status online through the Bombay Stock Exchange (BSE) website or the portal of KFin Technologies Limited. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-loan-travel-funding-trend-india-expert-advice-holiday-genz-money-tips-2769651-2025-08-11",
      "headline": "Is it smart to use personal loan to fund your next trip?Most of the rise in holiday loans is from non-metro India. In 2025, 71% of borrowers came from Tier-2 and Tier-3 cities, up from 68% in 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-approved-what-is-new-after-withdrawal-of-earlier-draft-2769590-2025-08-11",
      "headline": "New Income Tax Bill approved: What's new after withdrawal of earlier draftThe original Income Tax Bill, 2025, was introduced on February 13 to replace the six-decade-old Income Tax Act, 1961. However, last week, the government decided to pull it back, saying the changes suggested by the Select Committee needed to be included in a fresh draft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icici-bank-minimum-balance-rule-savings-accounts-rbi-governor-sanjay-malhotra-statement-2769568-2025-08-11",
      "headline": "ICICI Bank raises minimum balance to Rs 50,000: What RBI governor saidICICI Bank has raised the minimum balance from Rs 10,000 to Rs 50,000. In semi-urban branches, it has gone up from Rs 5,000 to Rs 25,000. In rural branches, the requirement is now Rs 10,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-to-suspend-delhi-washington-direct-flights-from-september-1-2769548-2025-08-11",
      "headline": "Air India to suspend Delhi-Washington direct flights from September 1Despite the halt of the direct Delhi-Washington service, Air India will continue offering one-stop flights to Washington via partner airlines Alaska Airlines, United Airlines, and Delta Air Lines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-746-points-up-nifty-above-24500-tata-motors-gain-3-percent-2769539-2025-08-11",
      "headline": "Sensex ends 746 points up, Nifty above 24,500; Tata Motors gains 3%The S&P BSE Sensex added 746.29 points to close at 80,604.08, while the NSE Nifty50 gained 221.75 points to end at 24,585.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/equity-mutual-fund-inflows-soar-to-record-high-in-july-key-details-2769533-2025-08-11",
      "headline": "Equity mutual fund inflows soar to record high in July. Check detailsNet flows into equity schemes rose 81% month-on-month to Rs 42,702 crore in July, data from the Association of Mutual Funds in India (AMFI) showed. Overall, assets under management in the mutual fund industry hit a record high at Rs 75.36 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rise-today-why-reasons-amfi-data-sensex-700-points-gain-us-tariff-sbi-shares-2769527-2025-08-11",
      "headline": "Sensex gains 700 points: Why is stock market rising today?The rally was led by public sector banking and auto sector stocks. Banking stocks were in focus after State Bank of India (SBI) posted strong Q1 results, which prompted positive commentary from brokerages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/7-money-myths-that-are-keeping-you-from-maximising-your-financial-worth-2769405-2025-08-11",
      "headline": "From health insurance and tax: 7 money-related myths decodedFrom health insurance and tax filing to investing and retirement planning, understanding the truth behind common myths can help you make confident, well-informed decisions for your future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-5-excel-utility-opens-what-is-it-and-who-must-file-2769440-2025-08-11",
      "headline": "ITR-5 excel utility opens: What is it and who must fileIf filing physically, taxpayers must verify the return by sending the signed ITR-V form to the Centralised Processing Centre (CPC) in Bengaluru within 30 days, unless they choose to e-verify instead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/make-in-india-made-in-china-manufacturing-economics-trade-deficit-report-pm-modi-geopolitical-2769387-2025-08-11",
      "headline": "Why 'Make in India' still depends so much on China-made goodsWhen Prime Minister Narendra Modi launched the 'Make in India' programme in 2014, it was meant to transform India into a global manufacturing hub, create millions of jobs, and reduce dependence on imports, especially from China. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-amd-us-china-semiconductor-chip-sales-agreement-explained-2769358-2025-08-11",
      "headline": "From ban to profit sharing: Inside US deal with Nvidia, AMD on China chip salesThe deal makes the US a direct financial beneficiary of sensitive technology sales to a geopolitical rival. This article looks into the key details of this first-of-its-kind agreement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icici-bank-new-minimum-balance-rules-faqs-charges-and-key-information-2769349-2025-08-11",
      "headline": "ICICI Bank new minimum balance rules: FAQs, charges, and key informationIn metro and urban branches, the minimum average balance will jump from Rs 10,000 to Rs 50,000. For semi-urban areas, it will increase from Rs 5,000 to Rs 25,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/borrowed-cash-from-a-friend-you-may-end-up-paying-income-tax-penalty-2768449-2025-08-11",
      "headline": "Borrowed cash from a friend? You may end up paying income tax penaltyThe income tax department is strict when it comes to large cash transactions. Whether it's taking a loan, repaying one, or even making donations, there are limits you need to follow. Go beyond those, and you could face a penalty equal to the entire amount involved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bluestone-jewellery-ipo-review-subscribe-skip-opening-date-latest-gmp-good-bad-details-2769330-2025-08-11",
      "headline": "BlueStone Jewellery IPO opens for bidding: Should you subscribe?The IPO consists of a fresh issue of 1.59 crore shares worth Rs 820 crore and an offer for sale of 1.39 crore shares worth Rs 720.65 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sbi-share-price-gain-rise-2-percent-good-q1-results-should-you-buy-price-target-review-2769314-2025-08-11",
      "headline": "SBI shares rise 2% over Q1 results. Should you buy?SBI share price: The rise came after SBI posted a standalone net profit of Rs 19,160 crore for the June quarter (Q1FY26), up from Rs 17,035 crore in the same quarter last year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/why-volatas-shares-are-down-today-q1-results-explained-2769311-2025-08-11",
      "headline": "Voltas shares slide nearly 8% after sharp Q1 profit declineAt around 9:55 am, shares of Voltas were trading 5.86% lower at Rs 1,227.35.  The company reported a steep 58% year-on-year decline in net profit to Rs 140.6 crore, weighed down by unseasonal weather and subdued summer demand, which impacted air conditioner sales."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-100-points-nifty-above-24400-grasim-gains-2-2769299-2025-08-11",
      "headline": "Sensex back above 80,000 as markets eye Trump-Putin meeting outcomeThe S&P BSE Sensex was trading 157.26 points higher at 80,015.05 at 9:26 am, while the NSE Nifty50 rose 43.60 points to trade at 24,406.90. Most of the other broader market indices were mixed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-share-price-multibagger-stock-market-gains-investors-rally-explained-2769295-2025-08-11",
      "headline": "NSDL turns into a multibagger for investors: Will it continue to gain?Issued at Rs 800, the stock opened at Rs 880 and has raced to Rs 1,300.30, minting massive gains for early institutional investors and retail shareholders alike.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-bank-hikes-minimum-balance-to-rs-50000-metro-urban-areas-penalty-charges-2768696-2025-08-09",
      "headline": "ICICI Bank hikes minimum savings balance to Rs 50,000: What it means for youThe change applies to all new accounts opened after that date, setting a new benchmark in the industry for the highest MAB requirement among domestic banks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/union-minister-piyush-goyal-swiss-firm-land-problem-maharashtra-ease-of-business-endress-hauser-2768661-2025-08-09",
      "headline": "Ease of doing business: Piyush Goyal resolves Swiss firm's land issue in hoursUnion Minister Piyush Goyal resolved a complex land allocation issue for a major Swiss company during a live business conference, highlighting the ease of business in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/trumps-tariff-war-is-this-indias-1991-moment-montek-singh-ahluwalia-exclusive-2768555-2025-08-08",
      "headline": "Trump's tariff war: Is this India's 1991 moment? Montek Singh Ahluwalia exclusiveAt the Business Today India@100 Summit, Montek Singh Ahluwalia, former Deputy Chairman of the Planning Commission, discusses if the 2025 Trump tariff war presents a 1991-like moment for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/piyush-goyal-exclusive-whole-world-recognises-india-as-fastest-growing-economy-2768534-2025-08-08",
      "headline": "Piyush Goyal exclusive: Whole world recognises India as fastest-growing economyUnion Minister Piyush Goyal hailed the Indian economy and said the whole world recognises us as the fastest-growing large economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/a-win-for-india-piyush-goyal-on-clinching-uk-free-trade-deal-2768506-2025-08-08",
      "headline": "'A win for India': Piyush Goyal on clinching UK free trade dealUnion Minister Piyush Goyal, speaking at the Business Today India@100 Summit, called the India-UK free trade deal a big win for the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-rs-30000-crore-compensation-for-oil-marketing-companies-to-maintain-lpg-price-stability-2768365-2025-08-08",
      "headline": "Cabinet approves Rs 30,000 crore subsidy to oil companies to keep LPG prices stableThe decision aims to protect consumers from changes in global LPG prices and support the financial health of the public sector oil companies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-donald-trump-trade-talk-dalal-street-2768343-2025-08-08",
      "headline": "Sensex cracks below 80,000 as tariff fears rattle stock marketsThe S&P BSE Sensex fell 765.47 points to close below the psychological 80,000 mark, while the NSE Nifty50 dropped 232.85 points to settle at 24,363.30. Midcap and smallcap stocks witnessed deeper cuts, reflecting growing investor unease over the evolving global trade scenario."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-not-a-dead-economy-set-to-become-3rd-largest-in-world-amitabh-kant-2768334-2025-08-08",
      "headline": "India not a dead economy, poised to become 3rd-largest in world: Amitabh KantAfter Donald Trump's 'dead economy' jibe, Amitabh Kant calls India a resilient, reform-driven powerhouse on track to become the world's third-largest economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-surge-could-stall-indias-manufacturing-momentum-warns-moodys-2768326-2025-08-08",
      "headline": "US tariff surge could stall India's manufacturing momentum, warns Moody'sOn Thursday, US President Donald Trump signed an Executive Order that adds a 25% tariff on Indian goods. This move comes in response to India's continued import of oil from Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-fuel-bill-may-rise-by-9-billion-in-fy26-and-12-billion-in-fy27-if-it-stops-russian-oil-import-sbi-2768284-2025-08-08",
      "headline": "How much will India's fuel bill rise if it stops buying oil from Russia?Russia currently provides 10% of the world's crude supply. If multiple countries stop buying from Russia at once, crude oil prices could rise by around 10%, as per the report. That would affect everyone, not just India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-record-high-of-rs-102-lakh-is-it-the-right-time-to-buy-bullion-rates-2768222-2025-08-08",
      "headline": "Gold hits record high of Rs 1.02 lakh. Is it the right time to buy?The rally in gold comes amid growing concerns over new tariffs announced by US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arvind-panagariya-bets-on-these-states-to-leads-indias-growth-by-2047-2768268-2025-08-08",
      "headline": "Arvind Panagariya bets on these states to leads India's growth by 2047Arvind Panagariya explained that India doesn't need to push growth artificially. He believes market forces are already at work, shaping the country's growth naturally."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/nitin-gadkari-dismisses-concerns-over-ethanol-blended-petrol-as-misinformation-2768238-2025-08-08",
      "headline": "Nitin Gadkari dismisses concerns over ethanol-blended petrol as misinformationUnion Minister Nitin Gadkari firmly defended the government's ethanol-blended petrol initiative, stating that no complaints have surfaced about vehicle issues. Speaking at the India@100 Summit, he challenged critics to cite a single case of malfunction and accused them of spreading baseless misinformation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/show-a-single-instance-of-e20-fuel-causing-car-issues-minister-hits-back-at-criticism-of-ethanol-mixed-petrol-2768205-2025-08-08",
      "headline": "Nitin Gadkari's dare on E20 petrol row: Show a single instance of cars facing issueSpeaking at a session during the Business Today India@100 Summit, Nitin Gadkari said no complaints had been reported so far and accused detractors of spreading misinformation about the government's ethanol-blending programme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-shares-are-on-a-dream-run-after-listing-should-you-buy-now-2768195-2025-08-08",
      "headline": "NSDL shares are on a dream run after listing. Should you buy now?The NSDL stock, which made its market debut on August 6, has now risen for three straight sessions—prompting IPO investors to ask: is it time to book profits or hold on?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-save-tax-by-claiming-hra-for-rent-paid-to-parents-read-this-first-2768173-2025-08-08",
      "headline": "Want to save tax by claiming HRA for rent paid to parents? Read this firstAccording to tax rules, salaried individuals can claim HRA even if they're living in their parents' home. But the rent must be real, paid regularly, and documented properly. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-may-approve-rs-30000-crore-support-to-maintain-lpg-price-stability-2768148-2025-08-08",
      "headline": "Government may approve Rs 30,000 crore support to maintain LPG price stabilityThis move is aimed at helping oil marketing companies recover losses they have been facing on domestic LPG sales due to high international prices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-down-500-points-key-factors-donald-trump-us-trade-talk-threat-tariffs-2768131-2025-08-08",
      "headline": "Sensex tumbles 500 points: Why is the stock market down today?At 10:07 am, the Sensex was down 496.21 points at 80,127.05, while the Nifty stood at 24,444.55, lower by 151.60 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-likely-dropped-to-an-eight-year-low-in-july-report-2768124-2025-08-08",
      "headline": "Retail inflation likely dropped to an eight-year low in July: ReportDespite uneven monsoons, a strong spring harvest has helped India keep a lid on food prices, extending the country's longest disinflationary streak in more than a decade."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kay-kay-menon-says-congress-misused-his-clip-denies-role-in-vote-chori-campaign-2769899-2025-08-12",
      "headline": "Kay Kay Menon says Congress misused his clip, denies role in Vote Chori campaignActor Kay Kay Menon shared a post and denied his involvement in Congress's latest 'Vote Chori' campaign. He claimed that the political party used his clip without permission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pooja-hegde-monica-song-praised-by-monica-bellucci-coolie-rajini-kanagaraj-2769876-2025-08-12",
      "headline": "Coolie song Monica gets Monica Bellucci's stamp of approval. Pooja Hegde reactsPooja Hegde's song 'Monica' from the film 'Coolie' directed by Lokesh Kanagaraj has now received praise from Monica Bellucci. The 'Retro' actor called it the biggest compliment ever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-new-heights-podcast-promo-new-album-2769882-2025-08-12",
      "headline": "Taylor Swift, Travis Kelce's new podcast promo is pure romance. WatchTravis Kelce's podcast promo with Taylor Swift has left fans excited. The video will out on August 13 (ET). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-reacts-nick-jonas-emotional-note-jonas-brothers-metlife-gig-new-jersey-2769873-2025-08-12",
      "headline": "My heart is full: Nick Jonas reflects on MetLife show, Priyanka says so proudSeveral artists, including Demi Lovato, took the stage with the Jonas Brothers, captivating the audience with their performances. Nick Jonas even shared an emotional note while thanking all for their love. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-coolie-ticket-45k-in-chennai-theatre-all-time-high-2769864-2025-08-12",
      "headline": "Coolie mania: Rs 4,500 for 1st show, Rajinikanth fans to cross states to watch filmThe craze for Superstar Rajinikanth's upcoming film 'Coolie' is unprecedented. The film's first-day first-show tickets are being sold for as high as Rs 4,500 in black in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-aniston-friends-cast-mourning-mathew-perry-addiction-struggle-2769740-2025-08-11",
      "headline": "Jennifer Aniston says Friends cast mourned Mathew Perry long before his deathActor Jennifer Aniston revealed the 'Friends' cast had been mourning former co-star Matthew Perry before his death in October 2023. She highlighted his tough battle with addiction and shared that he was healthy and happy before he died."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saurabh-sachdeva-comments-on-triptii-dimris-choices-after-animal-success-dhadak-2-2769691-2025-08-11",
      "headline": "Actor Saurabh Sachdeva comments on Triptii Dimri's choices after Animal successTriptii Dimri experienced a mixed phase in her acting career with some hits and misses. Her 'Dhadak 2' co-star Saurabh Sachdeva recently reflected on her career choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/abhinav-shukla-echoes-isha-talwar-claim-shanoo-sharma-told-me-i-lacked-spark-2769699-2025-08-11",
      "headline": "Abhinav Shukla echoes Isha Talwar's claim: Shanoo Sharma told me I lacked sparkActor Abhinav Shukla responded to 'Mirzapur' actor Isha Talwar's post against YRF casting director Shanoo Sharma. Shukla shared that he was told by the casting director that he was good-looking but lacked spark. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-saiyaara-arjun-kapoor-romantic-bike-wrap-sonakshi-sinha-tevar-2769674-2025-08-11",
      "headline": "Not Ahaan in Saiyaara, Arjun Kapoor did romantic bike wrap with Sonakshi firstAn old scene from Arjun Kapoor's film 'Tevar' has resurfaced on social media. Social media users drew parallels to a strikingly similar moment in the recent hit 'Saiyaara'. In the video, Kapoor can be seen pulling Sonakshi Sinha closer on a bike before driving off. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/abir-gulaal-film-release-worldwide-excluding-india-kashmir-ban-pakistani-artists-2769702-2025-08-11",
      "headline": "Fawad Khan–Vaani's Abir Gulaal skips India, to release worldwide on August 29The romantic drama 'Abir Gulaal', starring Fawad Khan and Vaani Kapoor, is slated for worldwide release on August 29, excluding India. It was earlier scheduled for a release on May 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-coolie-film-anirudh-ravichander-admits-using-chatgpt-creative-block-2769583-2025-08-11",
      "headline": "For Rajinikanth's Coolie, Anirudh admits using ChatGPT to overcome creative blockMusic composer Anirudh Ravichander opened up about his experience of working on the songs for Rajinikanth's latest film, 'Coolie'. He revealed in a recent interview that he used artificial intelligence to overcome a creative block. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-barkha-bisht-entry-tulsi-life-drama-2769605-2025-08-11",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi: Barkha Bisht's stormy entry to create turmoilThe iconic show Kyunki Saas Bhi Kabhi Bahu Thi has returned with a gripping new season. Actor Barkha Bisht's dramatic entry promises to intensify family conflicts and shake Shanti Niketan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-motion-poster-akshay-kumar-arshad-warsi-teaser-launch-2769586-2025-08-11",
      "headline": "Jolly LLB 3 poster: Akshay Kumar and Arshad Warsi's fight begins ahead of teaser launchFeaturing Akshay Kumar and Arshad Warsi, the motion poster of Jolly LLB 3 was released today, ahead of its teaser launch tomorrow (August 12). The upcoming legal comedy-drama is slated for a theatrical release on September 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-shares-cook-dilip-earns-big-from-youtube-vlogs-he-makes-more-than-us-2769637-2025-08-11",
      "headline": "Farah Khan shares cook Dilip earns big from YouTube vlogs: He makes more than usFarah Khan shared that her long-time cook and vlog co-star, Dilip, earns extra for his YouTube appearances, joking that he makes \"more than everyone here put together.\"\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-gets-ua-16-rating-kiara-advani-bikini-scene-trimmed-inappropriate-gesture-cut-2769623-2025-08-11",
      "headline": "War 2 gets U/A 16+ rating, Kiara's bikini scene trimmed, inappropriate gesture cutWar 2 censor details out: The sixth film in YRF's spy universe, starring Hrithik Roshan and Jr NTR, was passed with a U/A 16+ rating by the censor board. The film also saw a few cuts and modifications by the makers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-box-office-prediction-tamil-cinema-rajinikanth-biggest-rs-1000-crore-gamble-2769545-2025-08-11",
      "headline": "Coolie box office prediction: Tamil cinema's biggest Rs 1,000 crore gamble beginsSuperstar Rajinikanth's 'Coolie' is all set to release in theatres on August 14. The film has all the potential to become the Tamil film industry's first Rs 1,000 crore grosser. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-completes-50-years-soorma-bhopali-jailor-dhanno-legendary-characters-2769587-2025-08-11",
      "headline": "Sholay@50: How Soorma, Jailor, Dhanno became legendsIn part 4 of our series celebrating Sholay's 50th anniversary, we spotlight the unforgettable minor characters who, despite brief screen time, became cultural icons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/director-ashwin-kumar-mahavtar-narishimha-success-audiences-spoke-their-hearts-2769599-2025-08-11",
      "headline": "Director Ashwin Kumar on Mahavtar Narishimha success: Audiences spoke their hearts'Mahavtar Narishimha', in an exclusive interview with India Today, spoke about the success of the latest release. He credited the audience for showing their love to the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jonas-brothers-and-demi-lovato-reunite-for-epic-camp-rock-moment-at-metlife-2769509-2025-08-11",
      "headline": "Jonas Brothers and Demi Lovato reunite for epic Camp Rock moment at MetLife. WatchThe Jonas Brothers kicked off their 'JONAS20' tour with a surprise reunion with Demi Lovato, performing iconic 'Camp Rock' songs at MetLife Stadium. The nostalgic moment has reignited fan hopes for a possible 'Camp Rock 3'."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-largesse-pakistan-army-chief-asim-munir-balochistan-liberation-army-terror-tag-2769905-2025-08-12",
      "headline": "Baloch group gets terror tag. Trump's latest largesse for Pak's Asim MunirWhile the Balochistan Liberation Army has been behind several attacks in Pakistan, particularly targeting its military, what is significant here is the timing of the US announcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-tariffs-indias-oil-imports-big-blow-to-moscow-trump-putin-alaska-talks-glbs-2769821-2025-08-12",
      "headline": "Tariffs on India's oil buys big blow to Russia, says Trump before talks with PutinDonald Trump, speaking at a White House press conference, said Russia's economy was 'not doing well' and had been 'very well disturbed' by the combined effect of American trade duties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/pm-modis-stand-historic-moment-us-india-ties-ex-pentagon-official-michael-rubin-glbs-2769835-2025-08-12",
      "headline": "Can't kick India around: Ex-Pentagon official praises PM's tough stand on US tiesFormer Pentagon official Michael Rubin said PM Modi's stance would mark the moment the US learnt it can't kick India around. He criticised Trump's position and warned that Pakistan has lost legitimacy over its nuclear threats."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gurugram-urban-flooding-civic-chaos-gurgaon-sahibi-river-aravalli-hills-jungles-illegal-mining-factors-explained-2769606-2025-08-12",
      "headline": "Where have Gurugram's river and hills gone? Gurugram's rise as a corporate powerhouse has come at the expense of its rivers, wetlands, and the Aravallis that once sustained it. The Sahibi River, the Aravallis, and their forests are now either gone or in a dire state. The city's recurring floods, choking dust, and vanishing green cover are the direct fallout of decades of unchecked, ill-planned \"development\", which, in effect, have been the reasons for their disappearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-coolie-ticket-45k-in-chennai-theatre-all-time-high-2769864-2025-08-12",
      "headline": "Coolie mania: Rs 4,500 for 1st show, Rajinikanth fans to cross states to watch filmThe craze for Superstar Rajinikanth's upcoming film 'Coolie' is unprecedented. The film's first-day first-show tickets are being sold for as high as Rs 4,500 in black in Chennai."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-kn-rajanna-congress-high-command-removed-himconspiracy-voter-list-remarks-rahul-gandhis-vote-chori-campaign-2769917-2025-08-12",
      "headline": "Congress High Command sacked me: Ex-Karnataka Minister vows to expose conspiracyFormer Karnataka minister KN Rajanna said the Congress high command was behind his removal. He hinted at a conspiracy but promised details later. His ouster followed remarks on voter list lapses during Congress rule.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/teens-in-canada-harass-indian-couple-issue-death-threat-glbs-2769833-2025-08-12",
      "headline": "You f***ing immigrant: Teens in Canada harass Indian couple, issue death threatAccording to the couple, the confrontation began when the Indian man confronted the group over damage to his vehicle. The teenagers allegedly responded with insults such as \"big nose\" and \"you f***ing immigrant.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-income-tax-bill-2025-changes-impact-taxpayers-pension-standard-deduction-taxrates-2769897-2025-08-12",
      "headline": "New Income Tax Bill 2025: Will changes in the revised bill impact taxpayers?The updated Bill, presented by Finance Minister Nirmala Sitharaman on August 11, incorporates most of the recommendations made by the Select Committee. It is set to replace the six-decade-old Income Tax Act, 1961."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-odi-future-retirement-rumours-2769898-2025-08-12",
      "headline": "Idle days, wild rumours: Kohli and Rohit deserve to decide ODI futuresFor all the noise about grey beards and holiday photos, the scoreboard still tells the truest story: Virat Kohli and Rohit Sharma remain match-winners in one-day cricket. The off-season may fuel idle speculation, but the final call on their ODI futures should rest with the men who've carried Indian cricket on their shoulders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-pakistan-army-chief-asim-munirs-nuclear-threat-to-india-from-american-soil-indicates-2769739-2025-08-11",
      "headline": "What Pakistan army chief Asim Munir's nuclear threat to India from American soil indicatesIndia vowed not to give in to Pakistan's nuclear blackmail and said it was \"regrettable\" that the \"nuclear sabre-rattling\" had come from the soil of a friendly third country\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-declares-balochistan-liberation-army-majeed-brigade-as-foreign-terrorist-organisation-2769797-2025-08-11",
      "headline": "US declares Balochistan Liberation Army, Majeed Brigade as terror groupsThe US has named the Balochistan Liberation Army (BLA) and its alias, the Majeed Brigade, as Foreign Terrorist Organisations. Secretary of State Marco Rubio said the step comes after several deadly attacks in Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trump-putin-meet-pm-modi-india-escaped-photo-op-trap-asim-munir-us-president-ukraine-zelenskyy-putin-alaska-2769426-2025-08-11",
      "headline": "How Modi outsmarted Trump, avoided photo-op trapUS President Donald Trump's Nobel Peace Prize ambitions have him collecting photos with warring world leaders. Last week, Trump turned \"peacemaker\" again and got Azerbaijan's President Ilham Aliyev and Armenian PM Nikol Pashinyan in a single frame. He's trying the same for Putin and Zelenskyy in Alaska. However, PM Narendra Modi outsmarted Trump and didn't fall into a photo-op trap with Pakistan's Asim Munir in June."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/brothers-of-destruction-india-relay-team-animesh-kujur-gurindervir-singh-manikanta-hoblidhar-amlan-borgohain-2769849-2025-08-12",
      "headline": "Brothers of Destruction: How the relay team is driving India's athletics revolutionThe Indian sprinting group of Animesh Kujur, Gurindervir Singh, Manikanta Hoblidhar and Amlan Borgohain are breaking each other's records in the race to become the fastest man in India. But when they get together for the 4x100m relay, they become one — the Brothers of Destruction."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fake-interpol-office-busted-in-noida-former-trinamool-leader-used-to-run-it-2769874-2025-08-12",
      "headline": "Fake Interpol office busted in Noida, former Trinamool leader used to run itVibhas Chand, a former Trinamool leader, has been caught for running a fake international police station in Noida."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kay-kay-menon-says-congress-misused-his-clip-denies-role-in-vote-chori-campaign-2769899-2025-08-12",
      "headline": "Kay Kay Menon says Congress misused his clip, denies role in Vote Chori campaignActor Kay Kay Menon shared a post and denied his involvement in Congress's latest 'Vote Chori' campaign. He claimed that the political party used his clip without permission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/plane-collision-during-landing-at-montana-airport-sparks-fire-glbs-2769830-2025-08-12",
      "headline": "Plane collides with parked aircraft during landing in Montana, causing fireA landing plane crashed into a parked aircraft at Kalispell City Airport, sparking a fire. All four onboard escaped with two having minor injuries. The blaze was quickly contained."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/sholay-completes-50-years-soorma-bhopali-jailor-dhanno-legendary-characters-286-11-08-2025",
      "headline": "Sholay@50: How Soorma, Jailor, Dhanno became legendsIn part 4 of our series celebrating Sholay's 50th anniversary, we spotlight the unforgettable minor characters who, despite brief screen time, became cultural icons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/asim-munirs-pakistan-nuclear-bluster-meets-cold-reality-2769749-2025-08-11",
      "headline": "Asim Munir's hollow nuke threats exposed: Here's the reality check for PakistanAsim Munir's talk of \"taking half the world down\" is far removed from Pakistan's actual nuclear capabilities. The hard numbers reveal that Pakistan's nuclear arsenal is designed for regional deterrence, not global Armageddon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/incorrect-misleading-poll-panel-fact-checks-opposition-alleging-vote-fraud-2769798-2025-08-11",
      "headline": "Incorrect, misleading: Poll body fact-checks Opposition's 'vote chori' claimsIn a post shared on X (formerly Twitter), the poll panel posted a screenshot of a social media post by Rahul Gandhi in which he thanked all INDIA bloc leaders who joined the protest march and alleged vote theft, stamping it as \"MISLEADING\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-georgina-rodriguez-engagement-frenzy-2769806-2025-08-11",
      "headline": "Is Cristiano Ronaldo finally engaged? Georgina Rodriguez's post sparks frenzyCristiano Ronaldo and Georgina Rodríguez have sparked fresh engagement rumours after her Instagram post with a huge ring. The couple, together since 2016, have yet to confirm the news, though social media speculation has been fuelled by past similar hints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/mullah-marshal-asim-munir-nuclear-threats-india-mercedes-pakistan-dump-truck-remark-2769713-2025-08-11",
      "headline": "Mullah Marshal Munir and his maniacal mad-doggingPakistani Army chief Asim Munir's nuclear threats, jihadist rhetoric, and Mercedes-dump truck analogy reveal a dangerous mindset that India's defence planners cannot afford to underestimate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/chief-justice-recalls-contempt-warning-while-rejecting-lawyer-petition-2769785-2025-08-11",
      "headline": "Saved you once: Chief Justice recalls contempt warning while junking lawyer's pleaThe bench rebuked the advocate for his courtroom conduct, with Chief Justice of India BR Gavai recalling a prior contempt warning from his Bombay High Court tenure."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/jain-priest-rashtriya-sant-nilesh-muni-guru-maharaj-weapons-remark-pigeon-feeding-ban-2769811-2025-08-12",
      "headline": "Meant fast-unto-death: Jain priest clarifies 'weapons' remark on pigeon-feeding banRashtriya Sant Nilesh Muni Guru Maharaj acknowledged concerns over health issues linked to pigeon feeding but maintained it was part of the Jain faith."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kangana-ranaut-mocks-rahul-gandhi-mahua-moitra-opposition-poll-body-march-2769796-2025-08-11",
      "headline": "Overacting, sasta performance: Kangana Ranaut mocks Opposition's poll body marchAs the opposition continues to press for accountability, the BJP and its leaders, including Kangana Ranaut, have dismissed the protests as political theatrics aimed at discrediting the electoral process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kay-kay-menon-says-congress-misused-his-clip-denies-role-in-vote-chori-campaign-2769899-2025-08-12",
      "headline": "Kay Kay Menon says Congress misused his clip, denies role in Vote Chori campaignActor Kay Kay Menon shared a post and denied his involvement in Congress's latest 'Vote Chori' campaign. He claimed that the political party used his clip without permission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pooja-hegde-monica-song-praised-by-monica-bellucci-coolie-rajini-kanagaraj-2769876-2025-08-12",
      "headline": "Coolie song Monica gets Monica Bellucci's stamp of approval. Pooja Hegde reactsPooja Hegde's song 'Monica' from the film 'Coolie' directed by Lokesh Kanagaraj has now received praise from Monica Bellucci. The 'Retro' actor called it the biggest compliment ever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-reacts-nick-jonas-emotional-note-jonas-brothers-metlife-gig-new-jersey-2769873-2025-08-12",
      "headline": "My heart is full: Nick Jonas reflects on MetLife show, Priyanka says so proudSeveral artists, including Demi Lovato, took the stage with the Jonas Brothers, captivating the audience with their performances. Nick Jonas even shared an emotional note while thanking all for their love. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-coolie-ticket-45k-in-chennai-theatre-all-time-high-2769864-2025-08-12",
      "headline": "Coolie mania: Rs 4,500 for 1st show, Rajinikanth fans to cross states to watch filmThe craze for Superstar Rajinikanth's upcoming film 'Coolie' is unprecedented. The film's first-day first-show tickets are being sold for as high as Rs 4,500 in black in Chennai."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-odi-future-retirement-rumours-2769898-2025-08-12",
      "headline": "Idle days, wild rumours: Kohli and Rohit deserve to decide ODI futuresFor all the noise about grey beards and holiday photos, the scoreboard still tells the truest story: Virat Kohli and Rohit Sharma remain match-winners in one-day cricket. The off-season may fuel idle speculation, but the final call on their ODI futures should rest with the men who've carried Indian cricket on their shoulders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-kanga-league-sunil-gavaskar-india-comeback-2769881-2025-08-12",
      "headline": "Sarfaraz Khan eyeing Sunil Gavaskar's Kanga League script for India comebackSarfaraz Khan is embracing the monsoon grind of Mumbai's Kanga League, following in Sunil Gavaskar's footsteps, to sharpen his game and make a strong case for a Test comeback after his England series omission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/cincinnati-open-2025-emma-raducanu-crying-child-funny-incident-aryna-sabalenka-2769878-2025-08-12",
      "headline": "Emma Raducanu, chair umpire have hilarious exchange over crying baby at CincinnatiDuring her Cincinnati Open third-round clash with Aryna Sabalenka, Emma Raducanu was distracted by a crying child, leading to a hilarious exchange with the umpire. Raducanu lost the match against Sabalenka, despite a valiant effort. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-csk-future-ipl-2026-trade-rumours-2769862-2025-08-12",
      "headline": "R Ashwin breaks silence on IPL trade rumours, asks CSK for clarityR Ashwin has finally lifted the lid on the IPL trade rumours surrounding him ahead of the 2026 season. Ashwin returned to CSK during the 2025 mega auction but had a horrible campaign upon his return to Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/brothers-of-destruction-india-relay-team-animesh-kujur-gurindervir-singh-manikanta-hoblidhar-amlan-borgohain-2769849-2025-08-12",
      "headline": "Brothers of Destruction: How the relay team is driving India's athletics revolutionThe Indian sprinting group of Animesh Kujur, Gurindervir Singh, Manikanta Hoblidhar and Amlan Borgohain are breaking each other's records in the race to become the fastest man in India. But when they get together for the 4x100m relay, they become one — the Brothers of Destruction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-georgina-rodriguez-engagement-frenzy-2769806-2025-08-11",
      "headline": "Is Cristiano Ronaldo finally engaged? Georgina Rodriguez's post sparks frenzyCristiano Ronaldo and Georgina Rodríguez have sparked fresh engagement rumours after her Instagram post with a huge ring. The couple, together since 2016, have yet to confirm the news, though social media speculation has been fuelled by past similar hints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-drop-goalkeeper-gianluigi-donnarumma-from-super-cup-squad-transfer-looms-2769802-2025-08-11",
      "headline": "PSG drop Gianluigi Donnarumma from Super Cup squad as summer exit loomsParis Saint-Germain goalkeeper Gianluigi Donnarumma has been excluded from the squad for the UEFA Super Cup, sending a clear message that his time at the club is nearing its end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/riyan-parag-reason-sanju-samson-exit-rumours-rajasthan-royals-2769795-2025-08-11",
      "headline": "Riyan Parag is the reason: Ex-CSK batter on Sanju Samson trade rumoursBadrinath links Sanju Samson's possible Rajasthan Royals exit to Riyan Parag's captaincy prospects. He also questions whether Samson could fit into CSK's already-set top order if a trade happens, despite being a like-for-like replacement for Dhoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-jasprit-bumrah-return-shubman-gill-axar-patel-vice-captaincy-report-2769787-2025-08-11",
      "headline": "Asia Cup: Bumrah in contention, Gill-Axar for vice captaincy, says reportJasprit Bumrah is reportedly in contention to be included in India's squad for the Asia Cup. In addition, both Shubman Gill and Axar Patel are in the race to be the vice-captain of the T20I side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/canada-beat-argentina-50-over-u19-world-cup-qualifier-five-deliveries-2769782-2025-08-11",
      "headline": "How Canada U19 won a 50-over game vs Argentina after batting for five deliveriesCanada Under-19 bowled out Argentina Under-19 for just 23 runs in the 2025 Men's U19 Cricket World Cup Americas Qualifier and then chased down the target in only five deliveries on Sunday (10 August)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-india-vs-england-dilip-vengsarkar-2769765-2025-08-11",
      "headline": "Would have told Virat Kohli to retire after England Tests: Ex-India chief selectorFormer India skipper and ex-chairman of selectors Dilip Vengsarkar believes Virat Kohli should have been convinced to postpone his Test retirement until the conclusion of the recent five-match series in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-drop-goalkeeper-gianluigi-donnarumma-from-super-cup-squad-transfer-looms-2769802-2025-08-11",
      "headline": "PSG drop Gianluigi Donnarumma from Super Cup squad as summer exit loomsParis Saint-Germain goalkeeper Gianluigi Donnarumma has been excluded from the squad for the UEFA Super Cup, sending a clear message that his time at the club is nearing its end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/riyan-parag-reason-sanju-samson-exit-rumours-rajasthan-royals-2769795-2025-08-11",
      "headline": "Riyan Parag is the reason: Ex-CSK batter on Sanju Samson trade rumoursBadrinath links Sanju Samson's possible Rajasthan Royals exit to Riyan Parag's captaincy prospects. He also questions whether Samson could fit into CSK's already-set top order if a trade happens, despite being a like-for-like replacement for Dhoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-jasprit-bumrah-return-shubman-gill-axar-patel-vice-captaincy-report-2769787-2025-08-11",
      "headline": "Asia Cup: Bumrah in contention, Gill-Axar for vice captaincy, says reportJasprit Bumrah is reportedly in contention to be included in India's squad for the Asia Cup. In addition, both Shubman Gill and Axar Patel are in the race to be the vice-captain of the T20I side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/canada-beat-argentina-50-over-u19-world-cup-qualifier-five-deliveries-2769782-2025-08-11",
      "headline": "How Canada U19 won a 50-over game vs Argentina after batting for five deliveriesCanada Under-19 bowled out Argentina Under-19 for just 23 runs in the 2025 Men's U19 Cricket World Cup Americas Qualifier and then chased down the target in only five deliveries on Sunday (10 August)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-india-vs-england-dilip-vengsarkar-2769765-2025-08-11",
      "headline": "Would have told Virat Kohli to retire after England Tests: Ex-India chief selectorFormer India skipper and ex-chairman of selectors Dilip Vengsarkar believes Virat Kohli should have been convinced to postpone his Test retirement until the conclusion of the recent five-match series in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/world-para-athletics-championships-mondo-tracks-completed-september-1-2769766-2025-08-11",
      "headline": "World Para Athletics Championships: Mondo tracks to be completed by September 1Preparations for the World Para Athletics Championships are on track, with Mondo surfaces at both competition and training venues set for completion by September 1, as India gears up to host its largest-ever para athletics contingent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rfef-la-liga-in-miami-barcelona-villareal-match-2769747-2025-08-11",
      "headline": "Spanish federation approve request for Barcelona-Villareal match in MiamiBarcelona and Villarreal set to make history with La Liga's first-ever official match abroad, slated for Miami this December. The RFEF have approved La Liga's request and now UEFA will have to give the go-ahead for the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-questions-ecb-over-tendulkar-anderson-exclusion-after-india-england-test-series-2769731-2025-08-11",
      "headline": "Gavaskar questions England: Were Tendulkar and Anderson invited to trophy ceremony?England vs India: Batting great Sunil Gavaskar questioned the England and Wales Cricket Board over why James Anderson and Sachin Tendulkar were absent from the trophy presentation ceremony following the five-Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-duleep-trophy-message-to-india-teammamtes-sunil-gavaskar-2769730-2025-08-11",
      "headline": "Gill in Duleep Trophy sends right message to India teammates: GavaskarSunil Gavaskar hailed Shubman Gill for his willingness to participate in the Duleep Trophy even when he could've taken the back seat and rested, considering the gruelling England tour he was a part of. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-deep-served-notice-up-transport-authority-new-car-2769717-2025-08-11",
      "headline": "Akash Deep lands in trouble days after buying new carIndian fast bowler Akash Deep has been served a notice by the Uttar Pradesh Transport Department for allegedly using a vehicle without a High Security Registration Plate (HSRP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-mo-bobat-appointed-director-of-cricket-the-hundred-london-spirit-2769703-2025-08-11",
      "headline": "RCB's Mo Bobat appointed Director of Cricket for The Hundred side London SpiritThe Lord's-based Hundred franchise will retain the name London Spirit despite selling a 49% stake to the Silicon Valley consortium \"Tech Titans\", with former England performance director Mo Bobat named as the incoming director of cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-sa-ryan-rickelton-in-awe-of-fiery-kwena-maphaka-2769692-2025-08-11",
      "headline": "Rickelton in awe of fiery Kwena Maphaka: Cool to see him stand up to AustraliaSouth Africa wicketkeeper batter Ryan Rickelton said that it was cool to see fiery Kwena Maphaka to stand up to Australia in the first T20I in Darwin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-india-womens-world-cup-2025-home-pressure-2769655-2025-08-11",
      "headline": "Be in the moment: Yuvraj Singh's golden advice for India ahead of Women's World CupWomen's World Cup 2025: Former all-rounder Yuvraj Singh urged the Indian women's team to focus on processes rather than results as they try to deal with the burden of playing a major event at home. Harmanpreet Kaur's side will begin their campaign against Sri Lanka in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-deep-served-notice-up-transport-authority-new-car-2769717-2025-08-11",
      "headline": "Akash Deep lands in trouble days after buying new carIndian fast bowler Akash Deep has been served a notice by the Uttar Pradesh Transport Department for allegedly using a vehicle without a High Security Registration Plate (HSRP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-mo-bobat-appointed-director-of-cricket-the-hundred-london-spirit-2769703-2025-08-11",
      "headline": "RCB's Mo Bobat appointed Director of Cricket for The Hundred side London SpiritThe Lord's-based Hundred franchise will retain the name London Spirit despite selling a 49% stake to the Silicon Valley consortium \"Tech Titans\", with former England performance director Mo Bobat named as the incoming director of cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-sa-ryan-rickelton-in-awe-of-fiery-kwena-maphaka-2769692-2025-08-11",
      "headline": "Rickelton in awe of fiery Kwena Maphaka: Cool to see him stand up to AustraliaSouth Africa wicketkeeper batter Ryan Rickelton said that it was cool to see fiery Kwena Maphaka to stand up to Australia in the first T20I in Darwin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-india-womens-world-cup-2025-home-pressure-2769655-2025-08-11",
      "headline": "Be in the moment: Yuvraj Singh's golden advice for India ahead of Women's World CupWomen's World Cup 2025: Former all-rounder Yuvraj Singh urged the Indian women's team to focus on processes rather than results as they try to deal with the burden of playing a major event at home. Harmanpreet Kaur's side will begin their campaign against Sri Lanka in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jack-grealish-everton-loan-move-manchester-city-pep-guardiola-david-moyes-2769675-2025-08-11",
      "headline": "Man City's Jack Grealish set for season-long loan to Everton: ReportManchester City's Jack Grealish is reportedly on the verge of a season-long move to David Moyes' Everton. The English midfielder could be the one that revitalises the attack which underperformed last season.,who"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kingsley-coman-al-nassr-transfer-bayern-munich-reports-saudi-pro-league-2769670-2025-08-11",
      "headline": "Coman completes Saudi move to Al Nassr from Bayern Munich: ReportsKingsley Coman is set to swap Bayern Munich for Al-Nassr in a 30 million euros deal, joining Cristiano Ronaldo and Sadio Mané in Saudi Arabia's star-studded squad as they chase domestic and continental glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-on-test-return-ipl-2025-performance-2025-champions-trophy-2769636-2025-08-11",
      "headline": "Rashid Khan blames early Test return for poor show in Champions Trophy and IPLRashid Khan has said that returning to Test cricket too soon after surgery took a toll on his body. He feels that the decision led to a disappointing Champions Trophy and a below-par IPL 2025 campaign."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/jos-buttler-late-father-emotional-note-the-hundred-2769641-2025-08-11",
      "headline": "Jos Buttler remembers late father with emotional note after playing The HundredJos Buttler has paid tribute to his late father, who passed away a week ago, in a heartfelt post shared on Monday. The England batter uploaded a photograph on Instagram showing the two of them holding the ICC Men's Cricket World Cup trophy from England's 2019 triumph, captioned simply: \"Rest in peace Dad, thank you for everything.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/crystal-palace-lose-cas-appeal-uefa-europa-league-demotion-2769627-2025-08-11",
      "headline": "Why Crystal Palace lost CAS appeal against UEFA on Europa League demotion?Crystal Palace have lost their appeal to the CAS regarding UEFA's decision to demote them from the Europa League. The London-based club are exploring their legal options as it remains firm on its stance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/national-sports-bill-anti-doping-amendment-bill-passed-lok-sabha-2769585-2025-08-11",
      "headline": "National Sports Bill passed in Lok Sabha: What does it mean?The Union Government passed the National Sports Governance Bill and the National Anti-Doping Amendment Bill in the Lok Sabha, amid loud protests from the opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-south-africa-glenn-maxwell-rickleton-catch-legal-icc-new-rules-2769567-2025-08-11",
      "headline": "Was Maxwell's sensational catch vs SA legal according to new ICC rules?Glenn Maxwell's jaw-dropping boundary catch against South Africa sparked debate under the ICC's updated fielding laws. Here's how his effort stacked up against the new one-touch rule — and why it was perfectly legal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-went-down-wrong-path-and-spoilt-his-career-dinesh-lad-2769557-2025-08-11",
      "headline": "Prithvi Shaw went down wrong path and spoilt his career: Rohit Sharma's coachRohit Sharma's childhood coach Dinesh Lad recently recalled Prithvi Shaw's rise to international cricket and said that he went down the wrong path to destroy his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-on-sri-lanka-south-africas-chances-for-wtc-final-2027-2769523-2025-08-11",
      "headline": "South Africa may not reach WTC final 2027, Sri Lanka have better chance: ChopraFormer India cricketer Aakash Chopra said that Sri Lanka have a better chance of reaching the World Test Championship (WTC) final in 2027 than defending champions South Africa. He believes that sub-continent tours will pose a threat to South Africa in this cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-2036-olympics-bid-continuous-dialogue-ioc-host-selection-pause-2769517-2025-08-11",
      "headline": "India in continuous dialogue phase with IOC about 2036 Olympic bid: Sports MinistryIndia's bid to host the 2036 Olympics is currently in the continuous dialogue phase with the IOC's Future Host Commission. The host selection process is paused as the IOC reassesses future election procedures amid doping concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-enzo-maresca-confident-chelsea-thrash-ac-milan-perfect-pre-season-2769502-2025-08-11",
      "headline": "Chelsea boss Maresca upbeat about Premier League campaign after fine pre-seasonChelsea boss Enzo Maresca is upbeat about the upcoming Premier League campaign as the Blues defeated AC Milan to cap off a fine pre-season. Chelsea defeated Milan 4-1 on Sunday, August 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-on-winning-womens-world-cup-2025-at-home-2769484-2025-08-11",
      "headline": "Harmanpreet Kaur sets sights on World Cup glory at home: Want to break barriersIndia women's cricket team captain Harmanpreet Kaur has set her sights on ending the team's ICC Trophy drought by winning the upcoming World Cup at home. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}