{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-lost-200-points-nifty-in-red-tcs-it-ril-stocks-fall-2635228-2024-11-18",
      "headline": "Sensex, Nifty extend losses amid weak rupee and IT sector declineThe S&P BSE Sensex lost 241.30 points to close at 77,339.01, while the NSE Nifty50 was down 78.90 points to end at 23,453.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-rise-cryptocurrency-revival-us-elections-donald-trump-india-demand-high-taxes-2635196-2024-11-18",
      "headline": "Will Bitcoin's revival boost India's appetite for cryptos despite high taxes?The crypto market has been riding a wave of optimism following Donald Trump's election as US president, with hopes that his administration will adopt a crypto-friendly stance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tata-electronics-deal-done-to-acquire-iphone-plant-tamil-nadu-pegatron-2635175-2024-11-18",
      "headline": "Tata seals deal to acquire 60% of Pegatron's Tamil Nadu iPhone plant: ReportUnder the agreement, Tata will hold a 60% stake in the plant and oversee daily operations, while Pegatron will retain the remaining 40% and provide technical support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/telangana-government-announces-100-percent-tax-exemption-for-electric-vehicles-ev-2635158-2024-11-18",
      "headline": "Telangana government announces 100% tax exemption for electric vehiclesThe Telangana government's initiative is a part of its broader electric vehicle policy aimed at creating an eco-friendly transport system while reducing pollution levels in Hyderabad and other urban centres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-india-to-move-bengaluru-headquarters-new-office-near-airport-to-cut-costs-report-2635151-2024-11-18",
      "headline": "Amazon India to move Bengaluru headquarters to cut costs: ReportThe relocation is aimed at reducing costs and will involve vacating 500,000 square feet of office space across 18 floors at the WTC, which is owned by Brigade Enterprises Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-tells-india-recruiters-not-to-ask-for-marital-status-in-iphone-job-ads-2635148-2024-11-18",
      "headline": "Foxconn tells India recruiters not to ask for marital status in iPhone job adsFoxconn, which employs thousands of women at the iPhone factory at Sriperumbudur, near Chennai, outsources recruitment of assembly-line workers to third-party vendors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-correction-selloff-smallcap-and-midcap-shares-brokerages-fpi-selling-impact-2635116-2024-11-18",
      "headline": "Stock market correction: How bad is the selloff in smallcap and midcap space?Stock Market Correction: Despite aggressive selling by foreign portfolio investors (FPIs) in Indian equities, ICICI Securities recently noted that small-cap and mid-cap indices have shown relative resilience compared to the Nifty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-are-falling-in-india-but-rising-globally-explained-3-reasons-why-2635081-2024-11-18",
      "headline": "Gold prices are falling in India but rising globally. 3 reasons whyGold prices have seen a decline, bringing prices closer to lows recorded in September. Globally, however, gold prices have edged higher due to geopolitical and economic factors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-downturn-sensex-nifty-bloodbath-on-dalal-street-four-things-to-know-2635058-2024-11-18",
      "headline": "Sensex, Nifty fall as market bloodbath continues. 4 things investors should knowStock market correction: Sensex and Nifty have entered a correction zone, marked by a drop of more than 10% from their recent highs. The sell-off has rattled retail investors, many of whom are now asking a pressing question: Has the market bottomed out, or is there more pain ahead?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/honasa-consumer-share-price-mamaearth-crashes-20-percent-today-brokerage-downgrades-2635034-2024-11-18",
      "headline": "Explained: Why Honasa Consumer share price crashed 20% todayHonasa Consumer share price: The sharp drop came after Mamaearth's parent company released its Q2FY25 earnings report, which revealed weaker-than-expected performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-fall-further-as-demand-weakens-check-latest-rates-2635027-2024-11-18",
      "headline": "Gold prices fall further as demand weakens. Check latest rates Gold prices in India have fallen as the precious metal has seen a decline in November as demand for gold weakens globally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-november-18-2024-precious-metals-record-hike-on-mcx-2635019-2024-11-18",
      "headline": "Gold, silver price today, November 18, 2024: Precious metals record hike on MCXGold Price Today November 18, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Monday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-down-400-points-nifty-in-red-dragged-by-decline-in-it-energy-stocks-2635000-2024-11-18",
      "headline": "Sensex, Nifty open in red dragged by decline in IT stocks; RIL shares down 1%The S&P BSE Sensex was down 420.71 points to 77,159.60, while the NSE Nifty50 lost 132.50 points to 23,400.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mrf-shares-last-chance-final-day-buy-dividend-eligibility-ahead-of-ex-dividend-date-2634996-2024-11-18",
      "headline": "Final day to buy MRF shares for dividend eligibility ahead of ex-dividend dateThe board of MRF, in its recent meeting, announced the interim dividend while also releasing its financial results for the second quarter that ended on September 30, 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trading-setup-for-today-what-to-expect-from-stock-markets-expert-review-sensex-nifty-2634975-2024-11-18",
      "headline": "Trading setup for today: What to expect from the stock markets? Last week marked the second consecutive week of losses, as both the Sensex and Nifty declined by nearly 2%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ril-ola-electric-adani-green-hero-motocorp-stocks-to-watch-today-sensex-nifty-2634965-2024-11-18",
      "headline": "RIL, Ola Electric, Adani Green, Hero Motocorp: Stocks to watch today Several key stocks, including Hero MotoCorp, Grasim Industries, Adani Green Energy, and Ola Electric, are expected to remain in focus due to second-quarter earnings reports and other updates"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-gold-price-has-become-cheaper-in-india-than-in-gulf-uae-qatar-oman-singapore-2634724-2024-11-17",
      "headline": "Explained: Why Gold has become cheaper in India than in Gulf and SingaporeGold prices in India have become cheaper than in some traditional gold-buying destinations, like the United Arab Emirates, Qatar, Oman, and Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foreign-investors-fpis-stock-market-selloff-q2-earnings-downgrade-trump-trade-high-valuations-ipos-2634365-2024-11-16",
      "headline": "Why are foreign investors exiting India? 3 reasons behind stock market selloffExperts suggest that the trajectory of future FPI flows will largely depend on how India maintains macroeconomic stability and improves corporate earnings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-gmp-price-band-key-dates-other-details-2634349-2024-11-16",
      "headline": "NTPC Green Energy IPO: Check key dates, price band, and latest GMPNTPC Green Energy IPO: The IPO is positioned as one of the largest in India this year, alongside Hyundai Motor India Ltd. and Swiggy Ltd. The anchor book will open for subscription on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-biggest-weekly-drop-in-3-years-should-you-buy-sell-expert-views-2634341-2024-11-16",
      "headline": "Gold rates see biggest weekly drop in 3 years. Good time to buy?Despite the fall in prices, analysts remain bullish about the yellow metal's long-term potential. Here is all you need to know. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-worst-pollution-season-grap-iv-curbs-aqi-air-quality-index-2635293-2024-11-18",
      "headline": "At AQI of 493, Delhi faces worst pollution of season; strictest curbs in placeDelhi's air quality plunged to hazardous levels on Monday, recording a season-high AQI of 493. Strict Stage 4 curbs under GRAP, including truck bans and halted public construction, are enforced in the capital city."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amit-shah-high-level-meet-manipur-violence-central-forces-2635253-2024-11-18",
      "headline": "Amit Shah chairs meet amid Manipur unrest, 50 central force units to be deployedUnion Home Minister Amit Shah chaired a high-level meeting on Monday to discuss the ongoing situation in Manipur as the violence in the state escalated. This marked the second consecutive day of deliberations led by the Home Minister on the state's security concerns."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-muslim-reservation-assembly-election-revanth-reddy-congress-amit-shah-bjp-2635172-2024-11-18",
      "headline": "Maharashtra Muslim quota talks after new government forms: Revanth ReddyMaharashtra Election: Telangana Chief Minister Revanth Reddy said it is Congress' 'responsibility to do justice to them (Muslims)', by providing reservations.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aap-kailash-gehlot-exit-bjp-aam-aadmi-party-jat-leader-nangloi-jat-mla-raghuvinder-shokeen-importance-delhi-politics-2635261-2024-11-18",
      "headline": "Why AAP rushed to get Shokeen as minister within a day of Gahlot's exitThe AAP government in Delhi on Monday named Jat leader Raghuvinder Shokeen as a Cabinet minister, a day after transport minister Kailash Gahlot resigned from the party. The swift move by the Arvind Kejriwal-led party to have Shokeen, the Nangloi Jat MLA, reveals the importance of Jat votes in the state's politics ahead of the 2025 Assembly election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/working-out-is-great-but-how-much-is-too-much-2635232-2024-11-18",
      "headline": "Working out is great, but how much is too much?Incorporating workouts into your daily routine is fantastic, but it's equally important to know where to draw the line."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-air-quality-supreme-court-centre-states-pollution-level-aqi-2635231-2024-11-18",
      "headline": "GRAP-IV curbs stay, AQI must be brought down: Supreme Court to Centre, statesGRAP 4: A Supreme Court bench, comprising Justices Abhay S. Oka and Augustine George Masih, emphasised the constitutional duty of both the central and state governments to ensure a pollution-free environment. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-supreme-leader-ali-khamenei-health-crisis-succession-battle-second-son-mojtaba-khamenei-to-lead-shia-islamic-2635188-2024-11-18",
      "headline": "Khamenei unwell, Iran might have secretly elected its next supreme leaderIran's supreme leader Ali Khamenei is reported to be seriously unwell. Amid concerns over his health, reports emerged of a succession battle. It is being said now that his second son, Mojtaba Khamenei, has been chosen to lead the Shia Islamic nation amid a confrontation with Israel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/onion-price-hike-increase-reason-why-maharashtra-nashik-low-harvest-acreage-agriculture-ministry-2635037-2024-11-18",
      "headline": "Tears of farmers have set onions on fire. When will prices cool down?Onion prices touched Rs 100 a kilogram in several cities in India. Though some onion shortages, which drive up prices, are usually seen during this time of the year, the crisis this year is far worse, and has tears of farmers fuelling it. When will onion prices come down?  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/if-all-states-ban-liquor-diljit-dosanjh-bold-declaration-at-ahmedabad-concert-2635085-2024-11-18",
      "headline": "If all states ban liquor...: Diljit Dosanjh's bold declaration at Ahmedabad concertSinger Diljit Dosanjh, during his Ahmedabad concert, boldly asked the authorities not to 'poke' him. His outburst came after the Telangana government sent him a notice about avoiding mention of alcohol in songs during his performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/harnessing-the-power-of-data-iim-kozhikodes-professional-certificate-programme-in-advanced-data-analytics-for-managers-2631624-2024-11-11",
      "headline": "Harnessing the Power of Data: IIM Kozhikode's Professional Certificate Programme in Advanced Data Analytics for ManagersEmpowering Managers with Data-Driven Insights for Strategic Decision-Making"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-on-kailash-gahlot-join-bjp-aap-delhi-elections-2025-video-2635106-2024-11-18",
      "headline": "Kailash Gahlot can go wherever he wants: Arvind Kejriwal as ex-Minister joins BJPIn his resignation letter addressed to Arvind Kejriwal, ex-Delhi minister Kailash Gahlot cited unfulfilled promises and recent controversies as the reason for quitting the party. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-advocate-gopal-sankarnarayanan-flags-construction-inside-top-court-hears-delhi-air-pollution-plea-2635234-2024-11-18",
      "headline": "Advocate flags construction inside Supreme Court as top court hears pollution pleaAdvocate Gopal Sankarnarayanan highlighted the issue when the Supreme Court was taking stock of the pollution levels from Commission for Air Quality Management (CAQM) and the Delhi government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-vs-dhanush-documentary-lawsuit-10-crore-producers-lawyer-weign-in-2635187-2024-11-18",
      "headline": "Nayanthara vs Dhanush: Who is right?Nayanthara wrote a loaded open letter to Dhanush over his legal notice regarding unauthorised use of clips from Naanum Rowdy Dhaan in her Netflix documentary. In an exclusive chat with India Today Digital, producers and a lawyer weighed in on the controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-takes-chhota-popat-jibe-at-rahul-gandhi-after-he-mocks-ek-hai-toh-safe-hai-slogan-maharashtra-polls-2635262-2024-11-18",
      "headline": "Chhota popat: BJP after Rahul Gandhi mocks PM's 'ek hai toh safe hai' sloganBJP spokesperson Sambit Patra said that Rahul Gandhi inferred that a safe meant 'tijori' as his party had looted the country for decades through various scams. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/states-supreme-court-on-severe-pollution-delhi-online-classes-2635222-2024-11-18",
      "headline": "Lungs in 10th, 12th no different: In Supreme Court, an argument over classesThe Delhi government has already discontinued physical classes for all students, except for Class 10 and 12 students. The Supreme Court has now directed all states to take an immediate call to stop physical classes for Class 10 and 12 students as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/more-us-states-dropping-standardised-high-schools-exam-requirements-2635239-2024-11-18",
      "headline": "Only 7 US states still need graduation exams. Why are more states ditching them?A growing number of US states are moving away from standardised tests as graduation requirements, citing equity concerns, pandemic setbacks, and questions about their role in measuring readiness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/woman-jokes-bout-deepika-padukone-depression-fans-irked-as-tanmay-bhat-samay-raina-laugh-indias-got-latent-2635254-2024-11-18",
      "headline": "Woman 'jokes' about Deepika Padukone's depression, fans irked as Tanmay-Samay laughIn a viral video from India's Got Latent, a YouTube comedy show, a contestant 'jokes' about Deepika Padukone's battle with depression and the judges on the panel laugh uncontrollably. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-origin-ceo-daksh-gupta-death-threats-company-84-hour-workweek-policy-2635065-2024-11-18",
      "headline": "Indian-origin CEO claims he got death threats over 84-hour workweek policyDaksh Gupta, CEO of Greptile, sparked controversy after detailing the company's intense work culture in a viral post."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-national-man-dirty-harry-human-smuggling-dingucha-gujarati-family-death-trial-begin-us-court-canada-border-2635127-2024-11-18",
      "headline": "3 years after Gujarat family froze to death on Canada border, US trial to startFour members of a family from Dingucha, Gujarat, froze to death while attempting to illegally cross into the US from Canada. After nearly three years, a US court is scheduled to begin the jury selection process for the trial of two human smugglers linked to the deaths in January 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-auto-driver-innovative-approach-to-raise-funds-for-his-startup-is-viral-2635281-2024-11-18",
      "headline": "Bengaluru auto driver's innovative approach to raise funds for his startup is viralA photo of the Bengaluru auto driver was shared on Reddit with the caption, \"Yet another Peak Bengaluru moment\", prompting admiration for his entrepreneurial spirit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/chicken-or-egg-what-came-first-science-may-finally-have-the-answer-2635202-2024-11-18",
      "headline": "Chicken or egg - what came first? Science has found the answerThe revelation comes from the study of a single-celled organism called Chromosphaera perkinsii, an Ichthyosporean microbe that has existed for over a billion years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-praises-the-sabarmati-report-film-exposes-truth-powerful-ecosystem-pm-modi-godhra-train-burning-2635153-2024-11-18",
      "headline": "After PM, Amit Shah praises 'The Sabarmati Report' film: Unparalleled courageUnion Minister Amit Shah's endorsement came a day after PM Modi commended 'The Sabarmati Report', which has since seen a notable surge in box office collections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-rise-cryptocurrency-revival-us-elections-donald-trump-india-demand-high-taxes-2635196-2024-11-18",
      "headline": "Will Bitcoin's revival boost India's appetite for cryptos despite high taxes?The crypto market has been riding a wave of optimism following Donald Trump's election as US president, with hopes that his administration will adopt a crypto-friendly stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/dune-prophecy-review-episode-1-emily-watson-olivia-williams-2635020-2024-11-18",
      "headline": "Dune Prophecy review: A compelling start burdened by franchise expectationsReleased-Mon Nov 18, 2024Dune: Prophecy, a prequel series to the 2021 film Dune, explores the origins of the Bene Gesserit and key players, set 10,000 years before Paul Atreides' saga. The first episode is now streaming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/is-baaghi-4-continuing-the-strong-south-indian-influence-of-its-franchise-2635272-2024-11-18",
      "headline": "Is Baaghi 4 continuing the strong South Indian influence of its franchise?The Baaghi franchise is set to return with Baaghi 4, featuring Tiger Shroff in a darker avatar. Directed by Kannada filmmaker A Harsha, the film is expected to bring a fresh South Indian influence to the series, marking a potential shift in tone and storytelling style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-net-worth-2024-all-about-fees-films-pushpa-2-endorsements-2635294-2024-11-18",
      "headline": "Allu Arjun's net worth 2024: All about his fees, films, endorsementsTelugu superstar Allu Arjun is among the wealthiest actors, with a net worth of around Rs 460 crore. He earns from films, endorsements, and various business ventures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pakistani-actor-hania-aamir-channels-shalini-passi-in-viral-video-watch-2635191-2024-11-18",
      "headline": "Pakistani actor Hania Aamir channels Shalini Passi in viral video. WatchPakistani actor Hania Aamir shared a video on Instagram lip-syncing to Shalini Passi's memorable lines from Fabulous Lives vs Bollywood Wives. The video even caught the attention of Shalini Passi herself, who praised Hania."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/120-bahadur-farhan-akhtar-major-shaitan-singh-honours-warriors-1962-indi-china-battle-2635287-2024-11-18",
      "headline": "120 Bahadur: Farhan Akhtar as Major Shaitan Singh honours warriors of 1962 warActor Farhan Akhtar shared the first-look poster of his upcoming film, 120 Bahadur. The film will honour the soldiers who sacrificed their lives during this pivotal chapter of the 1962 Indo-China war. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/tennis-rafael-nadal-retirement-davis-cup-finals-press-conference-malaga-2635326-2024-11-18",
      "headline": "Rafael Nadal keen on not making Davis Cup his farewell show: 'Not here to retire'Davis Cup Finals: Rafael Nadal acknowledged the buzz in Malaga around his retirement, but the Spaniard said he doesn't want to make it a spectacle. Nadal added he is focused on helping the team win, regardless of whether he gets to play. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-pakistan-babar-azam-fans-reaction-hobart-2635317-2024-11-18",
      "headline": "Drop Babar Azam, save Pakistan cricket: Fans slam batter after 3rd T20IAUS vs PAK: Babar Azam had to face criticism for his lack of impact after Pakistan lost the third and final T20I against Australia by seven wickets at the Bellerive Oval in Hobart. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohlis-favourite-100-in-australia-border-gavaskar-trophy-2024-25-aus-vs-ind-2635316-2024-11-18",
      "headline": "Virat Kohli reveals his favourite hundred in Australia. It's not Adelaide 2014Star India batter Virat Kohli revealed his most favourite century in Australia in a recent video shared by the BCCI. Kohli has scored six Test centuries in Australia from 13 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-pakistan-ahmad-shahzad-senior-players-baggage-t20i-whitewash-2635277-2024-11-18",
      "headline": "Pakistan opener calls for T20I team revamp: Whitewash in Australia embarrassingAustralia vs Pakistan: In a strongly-worded statement, out-of-favour opener Ahmad Shahzad lashed out at the senior men's team after they were whitewashed 0-3 in a T20I series. Shahzad slammed Babar Azam and Mohammad Rizwan, calling the selectors to replace underperforming seniors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-aus-vs-pak-marcus-stoinis-aaron-hardie-babar-azam-spencer-johnson-2635268-2024-11-18",
      "headline": "Insipid Pakistan whitewashed 0-3 in T20I series in AustraliaAustralia beat Pakistan by seven wickets in the third and final T20I of the series in Hobart as Marcus Stoinis played a breathtaking knock of 61* (27)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-nathan-lyon-australia-vs-india-tests-2635270-2024-11-18",
      "headline": "Not just Kohli, Australia have plans for all Indian batters: Nathan Lyon AUS vs IND: Nathan Lyon said that Australia have the required resources to stop Virat Kohli and the other Indian batters in the upcoming five-match Test series of the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nathan-mcsweeney-border-gavaskar-trophy-australia-vs-india-aus-vs-ind-2635236-2024-11-18",
      "headline": "Nervy Nathan McSweeney 'ready' to open for Australia in Perth against IndiaYoung Australia opener Nathan McSweeney admitted to be under pressure ahead of his Test debut against India in the first Test in Perth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/pakistan-cricket-aaqib-javed-champions-trophy-head-coach-2635238-2024-11-18",
      "headline": "Pakistan appoint Aaqib Javed as interim white-ball head coach Pakistan have appointed Aaqib Javed as the interim head coach of the Pakistan men's national team until the Champions Trophy to be held next year from February 19 to March 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-first-look-at-perth-pitch-ahead-of-opening-test-match-2635233-2024-11-18",
      "headline": "First look at Perth pitch ahead of opening Test matchIndia are set to play their opening Test match of the series in Perth. Here's the first look of the pitch at the Optus Stadium in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-india-vs-australia-bgt-travis-head-2635224-2024-11-18",
      "headline": "Hopefully Kohli will not have too many moments over 5 Tests: Travis HeadAustralia batter Travis Head has hoped that Virat Kohli will not have too many good moments in India's tour of Australia. Head said that Australia respect Kohli for the world-class player that he is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-1st-test-bgt-travis-head-rohit-sharmas-miss-1st-test-2635200-2024-11-18",
      "headline": "Travis Head backs Rohit's decision to skip 1st Test: Would have done the sameBorder-Gavaskar Trophy: Australia batter Travis Head has supported Rohit Sharma's decision to skip the opening Test match in Perth. Head said that if he was in Rohit's position, he would have done the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nathan-mcsweeney-border-gavaskar-trophy-australia-vs-india-aus-vs-ind-2635236-2024-11-18",
      "headline": "Nervy Nathan McSweeney 'ready' to open for Australia in Perth against IndiaYoung Australia opener Nathan McSweeney admitted to be under pressure ahead of his Test debut against India in the first Test in Perth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/pakistan-cricket-aaqib-javed-champions-trophy-head-coach-2635238-2024-11-18",
      "headline": "Pakistan appoint Aaqib Javed as interim white-ball head coach Pakistan have appointed Aaqib Javed as the interim head coach of the Pakistan men's national team until the Champions Trophy to be held next year from February 19 to March 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-first-look-at-perth-pitch-ahead-of-opening-test-match-2635233-2024-11-18",
      "headline": "First look at Perth pitch ahead of opening Test matchIndia are set to play their opening Test match of the series in Perth. Here's the first look of the pitch at the Optus Stadium in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-india-vs-australia-bgt-travis-head-2635224-2024-11-18",
      "headline": "Hopefully Kohli will not have too many moments over 5 Tests: Travis HeadAustralia batter Travis Head has hoped that Virat Kohli will not have too many good moments in India's tour of Australia. Head said that Australia respect Kohli for the world-class player that he is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-1st-test-bgt-travis-head-rohit-sharmas-miss-1st-test-2635200-2024-11-18",
      "headline": "Travis Head backs Rohit's decision to skip 1st Test: Would have done the sameBorder-Gavaskar Trophy: Australia batter Travis Head has supported Rohit Sharma's decision to skip the opening Test match in Perth. Head said that if he was in Rohit's position, he would have done the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-siraj-morne-morkel-border-gavaskar-trophy-australia-vs-india-perth-test-2635192-2024-11-18",
      "headline": "Watch: Morne Morkel, Mohammad Siraj's hilarious moment during team's practiceIndia bowling coach Morne Morkel had a hilarious moment with Mohammed Siraj during the team's practice session at the WACA Ground in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-sunil-gavaskar-trophy-australia-vs-india-perth-test-rohit-sharma-2635150-2024-11-18",
      "headline": "Virat Kohli will be very very hungry in Australia Test series: Sunil GavaskarFormer India cricketer Sunil Gavaskar feels star India batter Virat Kohli will be really hungry to score in the upcoming Test series against Australia after his poor outings in the ongoing year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/fans-throw-bottle-at-lionel-messi-paraguay-footballer-apologises-2635136-2024-11-18",
      "headline": "Fans throw bottle at Lionel Messi: Paraguay footballer apologisesParaguayan footballer Omar Alderete apologised to Lionel Messi after fans threw a bottles at the Argentina captain during their recent World Cup Qualifier match. Argentina were left frustrated by the hosts, who won the match 2-1.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nitish-kumar-reddy-perth-test-debut-dodda-ganesh-australia-vs-india-2635129-2024-11-18",
      "headline": "Fast-tracking Nitish Reddy makes no sense: Ex-India pacer on Perth Test rumoursAustralia vs India, Perth Test: Nitish Kumar Reddy, according to reports, is in line to make a debut in the series opener, starting November 22. India face selection headache as they are likely to be without Rohit Sharma and Shubman Gill in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-sourav-ganguly-gautam-gambhir-remark-ricky-ponting-2635121-2024-11-18",
      "headline": "Sourav Ganguly issues verdict on Gautam Gambhir's Ricky Ponting remarksFormer India captain Sourav Ganguly has defended Gautam Gambhir after the head coach faced backlash for his blunt responses at press conferences. India's recent 0-3 loss to New Zealand at home has intensified scrutiny on Gambhir, whose coaching tenure has seen a mixed start ahead of the Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-mitchell-marsh-bowls-nets-ahead-perth-test-2635076-2024-11-18",
      "headline": "Australia's Mitchell Marsh bowls in nets ahead of Perth Test vs India: ReportMitchell Marsh was seen preparing for a crucial bowling role as Australia trained for the Border-Gavaskar Trophy against India. The all-rounder's return to bowling adds depth to the Australian squad, gearing up to face India's formidable lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-prediction-which-players-can-delhi-capitals-target-shreyas-iyer-purse-rs-73-crore-purse-2635089-2024-11-18",
      "headline": "IPL auction: Will DC look to reunite with Shreyas Iyer with Rs 73 crore purse?IPL 2025 Auction: Delhi Capitals are set for a fresh after saying goodbye to captain Rishabh Pant ahead of the mega auction. With spin maestros Axar Patel and Kuldeep Yadav, South African Tristan Stubbs and rising star Abishek Porel, DC retained a young core. Armed with Rs 73 crore and two RTM cards, DC may look to resign ex-captain Shreyas Iyer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-sourav-ganguly-gautam-gambhir-remark-ricky-ponting-2635121-2024-11-18",
      "headline": "Sourav Ganguly issues verdict on Gautam Gambhir's Ricky Ponting remarksFormer India captain Sourav Ganguly has defended Gautam Gambhir after the head coach faced backlash for his blunt responses at press conferences. India's recent 0-3 loss to New Zealand at home has intensified scrutiny on Gambhir, whose coaching tenure has seen a mixed start ahead of the Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-mitchell-marsh-bowls-nets-ahead-perth-test-2635076-2024-11-18",
      "headline": "Australia's Mitchell Marsh bowls in nets ahead of Perth Test vs India: ReportMitchell Marsh was seen preparing for a crucial bowling role as Australia trained for the Border-Gavaskar Trophy against India. The all-rounder's return to bowling adds depth to the Australian squad, gearing up to face India's formidable lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-prediction-which-players-can-delhi-capitals-target-shreyas-iyer-purse-rs-73-crore-purse-2635089-2024-11-18",
      "headline": "IPL auction: Will DC look to reunite with Shreyas Iyer with Rs 73 crore purse?IPL 2025 Auction: Delhi Capitals are set for a fresh after saying goodbye to captain Rishabh Pant ahead of the mega auction. With spin maestros Axar Patel and Kuldeep Yadav, South African Tristan Stubbs and rising star Abishek Porel, DC retained a young core. Armed with Rs 73 crore and two RTM cards, DC may look to resign ex-captain Shreyas Iyer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-pakistan-3rd-t20i-playing-11-hobart-mohammad-rizwan-naseem-shah-2635080-2024-11-18",
      "headline": "AUS vs PAK: T20I series lost, Pakistan announce new captain for series finaleAustralia vs Pakistan: Visitors Pakistan made two changes to their XI for the final match of the T20I series. Having already lost the series 0-2, they have rested captain Mohammad Rizwan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-rohit-sharma-set-to-miss-perth-test-might-join-team-directly-in-adelaide-2635048-2024-11-18",
      "headline": "Rohit Sharma set to miss Perth Test, might join team directly in AdelaideBorder-Gavaskar Trophy: India captain Rohit Sharma is set to miss the opening Test match in Perth, sources have confirmed to India Today. Sharma is likely to join the team in Adelaide ahead of the 2nd Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-doug-bracewell-tests-positive-for-cocaine-handed-one-month-ban-2635028-2024-11-18",
      "headline": "Bracewell tests positive for cocaine, handed one-month ban from cricketFormer New Zealand cricketer Doug Bracewell has been banned for one month after testing positive for cocaine. The 34-year-old was found to have used the banned substance following a stellar performance in a domestic T20 match for Central Districts against Wellington in January 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bgt-recap-when-maxwell-mocked-kohlis-shoulder-injury-only-to-receive-fiery-sendoff-2634887-2024-11-18",
      "headline": "BGT Recap: When Maxwell mocked Kohli's shoulder injury only to receive fiery sendoffBorder-Gavaskar Trophy: Mocked by Glenn Maxwell for his shoulder injury during the 2017 Ranchi Test, Virat Kohli hit back with a fiery gesture of his own. The intense rivalry fuelled India's spirit, leading them to a memorable 2-1 series victory."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}