{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/markets-closing-bell-sensex-nifty-end-lower-as-cautious-investors-await-us-economic-data-2594315-2024-09-05",
      "headline": "Sensex, Nifty end lower as cautious investors await US economic dataThe S&P BSE Sensex lost 151.48 points to close at 82,201.16, while the NSE Nifty50 ended 53.60 points lower to end at 25,145.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rapido-indias-latest-unicorn-with-usd-11-billion-valuation-series-e-funding-2594291-2024-09-05",
      "headline": "Rapido becomes India's latest unicorn with $1.1 billion valuation The latest funding round saw participation from investors including WestBridge Capital, Think Investments and Invus Opportunities, alongside existing investor Nexus Ventures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rama-steel-tubes-shares-jump-20-percent-today-heres-why-partnership-onix-renewable-2594261-2024-09-05",
      "headline": "Rama Steel Tubes shares jump 20% today. Here's why Rama Steel has developed specialised steel structures and tracker tubes that are crucial for the long-term success of solar projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suzlon-energy-share-price-jump-4-percent-key-triggers-icici-securities-target-price-2594227-2024-09-05",
      "headline": "Explained: Why Suzlon Energy shares jumped on 4% todaySuzlon Energy's stock rose 3.03% to Rs 76.43 on the BSE at 1:42 pm, after reaching an intraday high of Rs 77 earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-jumps-4-percent-anand-rathi-stock-target-price-24-percent-upside-2594206-2024-09-05",
      "headline": "Ola Electric shares jump 5% today. Will the rally continue?Ola Electric share price: Brokerage firm Anand Rathi has said that the stock looks \"oversold\" and that it has great potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-bonus-issue-board-approval-today-key-details-2594178-2024-09-05",
      "headline": "RIL board set to approve 1st bonus issue since 2017 today. Check detailsThe oil-to-telecom giant, led by Mukesh Ambani, is expected to propose a 1:1 bonus share issue, where investors will receive one bonus share for each share they own."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shree-tirupati-balajee-ipo-opens-good-or-bad-subscribe-skip-expert-view-2594149-2024-09-05",
      "headline": "Shree Tirupati Balajee IPO opens for bidding: Should you subscribe?Shree Tirupati Balajee's IPO is a book-built issue comprising a fresh issue of 1.48 crore shares totalling Rs 122.43 crore and an offer for sale of 57 lakh shares amounting to Rs 47.23 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-may-slash-tax-rates-on-life-health-insurance-report-2594111-2024-09-05",
      "headline": "GST Council may reduce tax rates on life, health insurance premiums: ReportThe GST Council is expected to review recommendations from the fitment panel, which has been examining the 18% GST rate on health and life insurance products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-gst-filing-rules-apply-from-september-2024-details-negative-liability-validation-bank-accounts-2594098-2024-09-05",
      "headline": "New GST filing rules apply from September 2024: All you need to know These new rules include adjustments to the reporting of high-value transactions, the validation of bank accounts, and an important update allowing the reporting of negative liability. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-stock-price-surges-brokerage-target-price-jp-morgan-overweight-2594084-2024-09-05",
      "headline": "Explained: Why Zomato shares surged over 7% in early tradeZomato share price: The food delivery giant's shares have surged in 2024, fuelled by optimistic brokerage outlooks, particularly for its quick commerce unit, Blinkit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-trade-flat-as-investors-remain-cautious-zomato-shares-jump-6-2594079-2024-09-05",
      "headline": "Sensex, Nifty trade flat as investors remain cautious; Zomato shares jump 6%The S&P BSE Sensex was down 26.89 points to 82,325.75 at 10:27 am, while the NSE Nifty50 fell 1.85 points to 25,196.85."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/gala-precision-engineering-ipo-allotment-date-step-by-step-guide-to-check-status-gmp-today-2594078-2024-09-05",
      "headline": "Gala Precision Engineering IPO allotment: Step-by-step guide to check statusGala Precision Engineering IPO allotment: Investors can check their allotment status online via the BSE website or through Link Intime India Private Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-prices-today-september-5-2024-yellow-metal-records-dip-silver-trades-higher-mcx-latest-rates-2594067-2024-09-05",
      "headline": "Gold, silver price today, September 5, 2024: Yellow metal records dip, silver trades higher on MCXGold Price Today 5 September 2024: Gold is trading on the lower side while silver rates have recorded a hike on the Multi Commodity Exchange (MCX) on Thursday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdb-financial-services-eyes-ipo-worth-usd-7-8-billion-by-end-of-fy24-report-hdfc-bank-2593812-2024-09-04",
      "headline": "HDB Financial Services eyes IPO worth $7–8 billion by end of FY24: ReportThe IPO is expected to be a mix of secondary sale and fresh capital, aiming for a valuation in the range of $7–8 billion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/shree-tirupati-balajee-ipo-details-price-band-issue-size-opening-date-gmp-2593792-2024-09-04",
      "headline": "Shree Tirupati Balajee IPO: All you need to know before subscribingShree Tirupati Balajee's IPO is a book-built issue comprising a fresh issue of 1.48 crore shares totalling Rs 122.43 crore and an offer for sale of 57 lakh shares amounting to Rs 47.23 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-marathon-meetings-what-to-expect-in-its-54-meet-nirmala-sitharaman-tax-2593743-2024-09-04",
      "headline": "54th GST Council meeting: What's on the agenda?These meetings have focused on various important issues, including tax rates on hybrid vehicles, life insurance premiums, and challenges within the textiles and pharmaceuticals sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/another-sme-ipo-frenzy-boss-packing-135-times-subscription-despite-sebi-warning-2593654-2024-09-04",
      "headline": "Another SME IPO in spotlight over 135x subscription. Details hereBoss Packing Solutions, which supplies packaging machines, labelling, capping, and filling equipment, had an issue size of a little over Rs 8 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quick-commerce-boom-in-india-instant-delivery-blinkit-zepto-swiggy-instamart-2593627-2024-09-04",
      "headline": "Beyond the grocery rush: What's fuelling India's instant delivery boom?Quick commerce is changing the retail landscape in India—imagine getting everything from snacks to electronic gadgets at your door in minutes. It's fast, it's fierce, and it's here to stay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-on-us-slowdown-worries-wipro-falls-3-percent-2593601-2024-09-04",
      "headline": "Sensex, Nifty end lower on US slowdown worries; Wipro falls 3% The S&P BSE Sensex dropped 171.32 points, closing at 82,384.12, while the NSE Nifty50 fell 81.15 points, finishing at 25,198.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/motilal-oswal-launches-nifty-500-momentum-50-index-fund-check-details-2593499-2024-09-04",
      "headline": "Motilal Oswal launches Nifty 500 Momentum 50 Index Fund. Check details The Nifty 500 Momentum 50 Index follows a momentum investing strategy, which involves selecting stocks that have shown strong performance recently."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-doctor-rape-murder-rg-kar-hospital-principal-sandip-ghosh-renovation-2594283-2024-09-05",
      "headline": "Day after doctor's murder, ex-RG Kar principal ordered renovation in hospitalRG Kar Doctor Rape-Murder: India Today has exclusively accessed a letter written by Sandip Ghosh to the PWD, asking them for repairs and renovation of on-duty doctors' rooms in RG Kar Hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/arvind-kejriwal-supreme-court-hearing-cbi-arrest-bail-plea-pulls-up-judicial-custody-ed-liquor-policy-case-2594110-2024-09-05",
      "headline": "'Need court nod': CBI blasted for arresting Arvind Kejriwal while in custodyThe Supreme Court is hearing Arvind Kejriwal's pleas challenging his arrest by the CBI in the liquor policy case and seeking regular bail."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shimla-sanjauli-mosque-illegal-construction-minister-anirudh-singh-state-assembly-congress-love-jihad-2594142-2024-09-05",
      "headline": "Row over Congress minister's remarks on Shimla mosque, party MLAs opposeWhile Himachal Rural Development Minister Anirudh Singh demanded an investigation into the mosque's construction and claimed it had caused social unrest, his fellow ministers appeared to refrain from endorsing his stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/renukaswamy-murder-new-photos-show-victim-moments-before-death-2594045-2024-09-05",
      "headline": "Shirtless, pleading for life: Last moments of Darshan's fan before murderIn both the images, Renukaswamy is not wearing a shirt, while there are parked trucks in the background. An injury mark can also been seen on his body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/goat-movie-review-brilliant-vijay-shoulders-venkat-prabhu-film-wafter-thin-plot-mohan-2594249-2024-09-05",
      "headline": "GOAT Review: Brilliant Vijay shoulders Venkat Prabhu's film with wafer-thin plotReleased-Thu Sep 05, 2024GOAT Review: Director Venkat Prabhu's spy thriller features Thalapathy Vijay, Prashanth and Prabhudheva, among others. The director whips up a tribute film for Vijay but struggles with a basic storyline. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-china-brazil-could-mediate-russia-ukraine-peace-talks-russian-president-vladimir-putin-2594234-2024-09-05",
      "headline": "India, China, Brazil could mediate Russia-Ukraine peace talks: Vladimir PutinRussian President Vladimir Putin said that China, India, and Brazil could mediate peace talks over Ukraine. He referred to a preliminary agreement reached in Istanbul as a possible foundation for future negotiations.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rituparna-sengupta-heckled-kolkata-protest-reclaim-the-night-2594284-2024-09-05",
      "headline": "Bengali actor Rituparna Sengupta heckled at Kolkata protest: They were drunkBengali actor Rituparna Sengupta faced hostility during the 'Reclaim the Night' protest on September 4, leading to her being pushed out and her car being thumped by protesters. She spoke about the incident to India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ic-814-netflix-series-hijack-terrorist-body-hijackers-sought-sajjad-afghani-june-1999-taliban-masood-azhar-2593791-2024-09-05",
      "headline": "IC 814 hijack: Who's the terrorist whose body hijackers sought?Among the initial demands of the five IC 814 hijackers was the body of a terrorist who was buried six months earlier. The terrorist whose body they were demanding was Sajjad Afghani, killed in Jammu in July 1999. Who was Afghani?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-women-friendly-seats-help-special-pink-seats-web-check-in-6e-sexual-harassment-women-on-flights-2593551-2024-09-05",
      "headline": "Why women are critical of IndiGo's women-friendly seatsIndiGo is running a pilot project that allows women to choose seats that are next to women flyers. The airline is saying there is huge interest in 'women-friendly' seats. However, several women have raised questions about the policy, including if those who don't choose a seat next to a woman would be seen inviting misbehaviour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/video/sathyabama-welcomes-the-yorker-champion-jasprit-bumrah-2590772-2024-08-30",
      "headline": "Sathyabama welcomes the Yorker Champion Jasprit BumrahIn a memorable event, Sathyabama University had the honour of hosting one of India's most celebrated cricket icons, Mr. Jasprit Bumrah. The university's President, Dr. Marie Johnson, and Chancellor, Dr. Mariazeena Johnson, warmly welcomed the champion fast bowler, renowned for his impeccable yorkers, to the campus.\r\n\r\nThe atmosphere was electric as students gathered in large numbers, eager to catch a glimpse of the cricket sensation. Their excitement and enthusiasm were palpable, reflecting the immense respect and admiration they hold for Bumrah. His visit not only inspired the students but also created an unforgettable experience, further strengthening the bond between sports and academia at Sathyabama University."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-day-eight-live-updates-harvinder-singh-mona-agarwal-arvind-simran-2594146-2024-09-05",
      "headline": "Day 8 Live: Simran reaches women's 100m T12 FinalParalympics 2024, Day 8 Live: After Harvinder Singh and Pooja secured their berth in the quarter-final of the Mixed Team Recurve Open in Para-Archery, India's Simran has also qualified for the final for the Women's 100m T12 Final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/olympic-medallist-yogeshwar-dutt-cryptic-social-media-post-bjp-election-ticket-snub-2594229-2024-09-05",
      "headline": "Sinners have no right to test you: Yogeshwar Dutt after BJP poll ticket snubYogeshwar Dutt told reporters last week that he had informed the Haryana Chief Minister and the Central leadership of his willingness to contest from the Gohana Assembly seat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-cool-suresh-brings-goat-to-watch-thalapathy-vijay-goat-theatres-venkat-prabhu-2594215-2024-09-05",
      "headline": "Viral: Actor Cool Suresh brings a goat to watch Vijay's 'GOAT' in theatresActor Cool Suresh showed his excitement for Thalapathy Vijay's 'GOAT' by bringing a goat with him to watch the film. A video of the actor at the theatre has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/early-teachers-day-gift-guru-amit-praises-shishya-dharambirs-paralympics-win-2594314-2024-09-05",
      "headline": "Early Teacher's Day gift: Guru Amit praises shishya Dharambir's Paralympics winAmit Saroha praised his student and teammate Dharambir after his gold medal win the men's club throw F51 event. He secured a gold medal with an astounding throw of 34.92m. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/haryana-minister-ranjit-singh-chautala-resigns-bjp-ticket-assembly-election-2594221-2024-09-05",
      "headline": "Haryana minister Ranjit Chautala resigns after being denied BJP poll ticketRanjit Chautala was among the nine incumbent MLAs dropped by the BJP as it released the first list of 67 candidates on Wednesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/law/supreme-court/story/arvind-kejriwal-supreme-court-liquor-policy-bail-order-top-quotes-2594159-2024-09-05",
      "headline": "Nowadays 'Trump' is a dangerous word: Top quotes at Arvind Kejriwal bail hearingThe Supreme Court is hearing two petitions filed by Delhi Chief Minister Arvind Kejriwal, seeking bail in the CBI case linked to the liquor policy case and challenging his arrest by the central agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-leads-2024-celebrity-taxpayer-list-thalapathy-vijay-in-second-place-2594113-2024-09-05",
      "headline": "Shah Rukh Khan leads 2024 celebrity taxpayer list, Thalapathy Vijay in second placeShah Rukh Khan leads the 2024 list of top celebrity taxpayers with Rs 92 crore, followed by Thalapathy Vijay at Rs 80 crore. Salman Khan and Amitabh Bachchan are also top contributors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-rape-murder-rg-kar-hospital-doctor-parents-bribe-case-protest-west-bengal-2594006-2024-09-05",
      "headline": "Kolkata doctor's family claims police tried to suppress case, 'bribe them'The family of the doctor who was raped and murdered at Kolkata hospital accused the West Bengal police of covering up the case by hurriedly cremating her body and attempting to bribe them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rebecca-cheptegei-uganda-olympic-athlete-dies-boyfriend-fire-kenya-land-dispute-2594188-2024-09-05",
      "headline": "Set on fire by boyfriend, Ugandan Olympic athlete dies in KenyaUgandan Olympian Rebecca Cheptegei, 33, died at a Kenyan hospital where she was being treated after sustaining 80 percent burns on her body. She was set on fire by her boyfriend during a disagreement over a land deal, police said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canadian-prime-minister-justin-trudeau-party-support-ndp-new-democriatic-party-jagmeet-singh-2594001-2024-09-05",
      "headline": "Justin Trudeau's minority government at risk as ally withdraws supportCanadian Prime Minister Justin Trudeau faces a political challenge after the New Democratic Party withdrew its automatic support for his minority government, forcing him to seek new alliances to survive confidence votes. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/terrified-lion-swims-for-his-life-hippo-chases-him-african-guide-records-video-2594217-2024-09-05",
      "headline": "Terrified lion swims for his life as hippo chases him, African guide records videoAn African guide recorded an intense encounter in which a terrified lion swam for his life after a hippopotamus chased him across the Luangwa River in Zambia.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-removes-seats-from-starliner-spacecraft-loads-cargo-2594199-2024-09-05",
      "headline": "Sunita Williams removes seats from Starliner spacecraft, loads cargoThe veteran space travelers focused on loading cargo and conducting final inspections of the capsule, which is set to depart the International Space Station on Friday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jharkhand-west-singhbhum-odia-school-kera-dilapidated-state-gopabandhu-das-chakradharpur-utkal-sammilani-2592665-2024-09-05",
      "headline": "Classrooms razed by Jharkhand govt, 130-year-old Odia school cries for helpThe Odia Middle School in West Singhbhum, Jharkhand, is one of the oldest Odia schools outside Odisha. Established in 1895, it has been reduced to two crumbling classrooms after the Jharkhand government in 2019 tore down six classrooms, promising to rebuild them. The promise hasn't been kept, and the 230 students are suffering because of no fault of theirs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-rishabh-pant-out-shubman-gill-catch-india-a-vs-india-b-bengaluru-2594214-2024-09-05",
      "headline": "Watch: Rishabh Pant out cheaply on red-ball return after Shubman Gill's stunnerDuleep Trophy 2024, India A vs India B: Wicketkeeper-batter Rishabh Pant, playing his first red-ball match in nearly two years, managed just 7 on Day 1 of the first round of the tournament. He was dismissed by India A pacer Akash Deep after a stunning catch by opposition captain, Shubman Gill in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rituparna-sengupta-heckled-kolkata-protest-reclaim-the-night-2594284-2024-09-05",
      "headline": "Bengali actor Rituparna Sengupta heckled at Kolkata protest: They were drunkBengali actor Rituparna Sengupta faced hostility during the 'Reclaim the Night' protest on September 4, leading to her being pushed out and her car being thumped by protesters. She spoke about the incident to India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/goat-movie-review-brilliant-vijay-shoulders-venkat-prabhu-film-wafter-thin-plot-mohan-2594249-2024-09-05",
      "headline": "GOAT Review: Brilliant Vijay shoulders Venkat Prabhu's film with wafer-thin plotReleased-Thu Sep 05, 2024GOAT Review: Director Venkat Prabhu's spy thriller features Thalapathy Vijay, Prashanth and Prabhudheva, among others. The director whips up a tribute film for Vijay but struggles with a basic storyline. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sector-36-trailer-vikrant-massey-serial-killer-deepak-dobriyal-murder-mystery-nithari-case-2594257-2024-09-05",
      "headline": "'Sector 36' trailer: Vikrant Massey turns serial killer in new murder mysteryThe trailer for 'Sector 36' featuring Vikrant Massey as a serial killer and Deepak Dobriyal as a determined police inspector is now out. The film is presumably based on the 2006 Nithari serial murders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/joker-folie-a-deux-lady-gaga-joaquin-phoenix-receives-11-minute-standing-ovation-at-venice-film-festival-2594220-2024-09-05",
      "headline": "'Joker Folie a Deux' receives 11-minute standing ovation at Venice Film Festival 'Joker: Folie a Deux', starring Lady Gaga and Joaquin Phoenix, received a 11-minute long standing ovation at the Venice International Film Festival. The musical thriller is directed by Todd Phillips. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/early-teachers-day-gift-guru-amit-praises-shishya-dharambirs-paralympics-win-2594314-2024-09-05",
      "headline": "Early Teacher's Day gift: Guru Amit praises shishya Dharambir's Paralympics winAmit Saroha praised his student and teammate Dharambir after his gold medal win the men's club throw F51 event. He secured a gold medal with an astounding throw of 34.92m. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-jos-buttler-injury-phil-salt-captain-t20i-odi-series-doubt-2594274-2024-09-05",
      "headline": "Salt to lead England in T20Is vs Australia after injured Buttler ruled outEngland vs Australia: Captain Jos Buttler was ruled out of the upcoming three-match T20I series in September due to a calf injury. Phil Salt will lead the England side in his absence. Buttler is also doubtful for the five-match ODI series against Australia later this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-axar-patel-stranded-on-86-as-shreyas-iyers-team-164-all-out-2594238-2024-09-05",
      "headline": "Duleep Trophy: Axar Patel stranded on 86 as Shreyas Iyer's team 164-all outDuleep Trophy: Axar Patel missed out on his 2nd First Class hundred, but he rescued the India D team from a precarious situation of 34/5.  He led the recovery of Shreyas Iyer's team alongside Arshdeep Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/singapore-bowls-out-mongolia-for-joint-lowest-t20i-total-in-t20-world-cup-qualifier-2594213-2024-09-05",
      "headline": "Singapore bowls out Mongolia for joint-lowest T20I total in T20 World Cup qualifierSingapore bowled out Mongolia for the joint lowest T20I total during 14th Match of the ICC Men's T20 World Cup Asia Qualifier A."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-rishabh-pant-out-shubman-gill-catch-india-a-vs-india-b-bengaluru-2594214-2024-09-05",
      "headline": "Watch: Rishabh Pant out cheaply on red-ball return after Shubman Gill's stunnerDuleep Trophy 2024, India A vs India B: Wicketkeeper-batter Rishabh Pant, playing his first red-ball match in nearly two years, managed just 7 on Day 1 of the first round of the tournament. He was dismissed by India A pacer Akash Deep after a stunning catch by opposition captain, Shubman Gill in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/sarah-storey-wins-18th-paralympic-gold-at-46-breaking-age-and-disability-barriers-2594202-2024-09-05",
      "headline": "Sarah Storey wins 18th Paralympic Gold at 46, breaking age and disability barriersBritain's Para-athlete Sarah Storey, a British Paralympian, secured her 18th gold medal at Paris Olympics 2024. She emerged victorious in the Women's C5 Time Trial cycling event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rebecca-cheptegei-uganda-olympic-athlete-dies-boyfriend-fire-kenya-land-dispute-2594188-2024-09-05",
      "headline": "Set on fire by boyfriend, Ugandan Olympic athlete dies in KenyaUgandan Olympian Rebecca Cheptegei, 33, died at a Kenyan hospital where she was being treated after sustaining 80 percent burns on her body. She was set on fire by her boyfriend during a disagreement over a land deal, police said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-day-eight-live-updates-harvinder-singh-mona-agarwal-arvind-simran-2594146-2024-09-05",
      "headline": "Day 8 Live: Archers Harvinder and Pooja reach mixed team quartersParalympics 2024, Day 8 Live: After Mona Agarwal and Siddhartha Babu failed to qualify to the final of mixed 50m rifle prone SH1, Harvinder Singh and Pooja secured their berth in the quarter final of the Mixed Team Recurve Open in Para-Archery. Meanwhile, Kokila is in action in Judo Women's -48 kg J2 Quarterfinals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/gracious-in-defeat-medvedev-calls-sinner-one-of-the-best-after-us-open-exit-2594138-2024-09-05",
      "headline": "Gracious in defeat, Medvedev calls Sinner 'one of the best' after US Open exitDaniil Medvedev was gracious in defeat as he called Jannik Sinner one of the best players after the former US Open champion suffered an exit in the quarter-final. Sinner advanced to semi-final of the US Open 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/sumit-antil-paralympics-2024-javelin-throw-paralympics-record-2594117-2024-09-05",
      "headline": "Sumit Antil recalls sleepless night before Paralympic glory in ParisIndia's Sumit Antil recalls his sleepless night before breaking the Paralympics Javelin Throw Record in Paris. Antil successfully defended his gold with a 70.59m throw."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/an-afghan-style-welcome-for-kiwis-as-they-arrive-in-greater-noida-for-afg-vs-nz-2594107-2024-09-05",
      "headline": "Watch: Afghanistan gives warm welcome to Kiwis as they arrive in Greater NoidaThe Tim Southee-led New Zealand team received a warm and Afghan-style welcome as they arrived in Greater Noida for one-off Test vs Afghanistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rebecca-cheptegei-uganda-olympic-athlete-dies-boyfriend-fire-kenya-land-dispute-2594188-2024-09-05",
      "headline": "Set on fire by boyfriend, Ugandan Olympic athlete dies in KenyaUgandan Olympian Rebecca Cheptegei, 33, died at a Kenyan hospital where she was being treated after sustaining 80 percent burns on her body. She was set on fire by her boyfriend during a disagreement over a land deal, police said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-day-eight-live-updates-harvinder-singh-mona-agarwal-arvind-simran-2594146-2024-09-05",
      "headline": "Day 8 Live: Archers Harvinder and Pooja reach mixed team quartersParalympics 2024, Day 8 Live: After Mona Agarwal and Siddhartha Babu failed to qualify to the final of mixed 50m rifle prone SH1, Harvinder Singh and Pooja secured their berth in the quarter final of the Mixed Team Recurve Open in Para-Archery. Meanwhile, Kokila is in action in Judo Women's -48 kg J2 Quarterfinals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/gracious-in-defeat-medvedev-calls-sinner-one-of-the-best-after-us-open-exit-2594138-2024-09-05",
      "headline": "Gracious in defeat, Medvedev calls Sinner 'one of the best' after US Open exitDaniil Medvedev was gracious in defeat as he called Jannik Sinner one of the best players after the former US Open champion suffered an exit in the quarter-final. Sinner advanced to semi-final of the US Open 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/sumit-antil-paralympics-2024-javelin-throw-paralympics-record-2594117-2024-09-05",
      "headline": "Sumit Antil recalls sleepless night before Paralympic glory in ParisIndia's Sumit Antil recalls his sleepless night before breaking the Paralympics Javelin Throw Record in Paris. Antil successfully defended his gold with a 70.59m throw."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/an-afghan-style-welcome-for-kiwis-as-they-arrive-in-greater-noida-for-afg-vs-nz-2594107-2024-09-05",
      "headline": "Watch: Afghanistan gives warm welcome to Kiwis as they arrive in Greater NoidaThe Tim Southee-led New Zealand team received a warm and Afghan-style welcome as they arrived in Greater Noida for one-off Test vs Afghanistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-eager-to-face-good-friend-draper-in-maiden-us-open-semis-outing-2594071-2024-09-05",
      "headline": "Sinner eager to face 'good friend' Draper in maiden US Open semis outingJannik Sinner opened up on facing Jake Draper in the US Open semi-final and admitted that the battle against his 'good friend' will be a tough one. Sinner reached his maiden US Open semi-final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-reveals-how-head-coach-gambhir-helps-india-play-fearless-cricket-2594054-2024-09-05",
      "headline": "Yashasvi Jaiswal reveals how head coach Gambhir helps India play 'fearless cricket'Yashasvi Jaiswal revealed head coach Gautam Gambhir's mantra which helped the Indian team play fearless cricket. Jaiswal is playing for Team A in the Duleep Trophy tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-suryakumar-kumar-prasidh-krishna-to-miss-first-round-of-duleep-trophy-2024-2594046-2024-09-05",
      "headline": "Duleep Trophy: Ishan Kishan, Suryakumar and Prasidh Krishna to miss first roundSuryakumar Yadav, Prasidh Krishna and Ishan Kishan will not be featuring in the first round of the Duleep Trophy beginning from September 5 in Bengaluru and Anantapur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/us-open-2024-jannik-sinner-daniil-medvedev-2594050-2024-09-05",
      "headline": "US Open: Jannik Sinner advances to semi-final after beating former champion Daniil MedvedevJannik Sinner advanced to the semi-final of US Open after beating former champion Daniil Medvedev by 6-2, 1-6, 6-1, 6-4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/india-at-paralympics-2024-day-8-schedule-harvinder-singh-pooja-2594032-2024-09-05",
      "headline": "India at Paralympics 2024, Day 8 schedule: Harvinder Singh, Pooja in focusAfter scripting history in Paris, India have the opportunity to add more medals to their best-ever tally at the Paralympics as total seven medal events are lined up on Day 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jack-draper-lives-dream-come-true-moment-on-reaching-1st-us-open-semi-final-2594031-2024-09-05",
      "headline": "Jack Draper lives 'dream come true moment' on reaching 1st US Open semi-finalJack Draper became the first British player in 12 years to reach the semi-final of the US Open after Andy Murray's title-winning campaign in 2012.  Draper called it a dream come true moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/meet-indias-historic-club-throw-medallists-dharambir-and-pranav-at-paralympics-2594010-2024-09-05",
      "headline": "Meet Dharambir and Pranav, India's historic Paralympic club throw medalistsIndia's para athletes script history with a stunning 1-2 finish at the Paralympics, led by Dharambir's record-breaking gold and Pranav Soorma's inspiring silver in club throw.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-jessica-pegula-iga-swiatek-karolina-muchova-2594002-2024-09-05",
      "headline": "US Open: Jessica Pegula upsets Iga Swiatek to advance to 1st Grand Slam semi finalJessica Pegula stunned the world no one Iga Swiatek in the quarter-finals of the US Open 2024 to advance to her first ever Grand Slam semi final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/india-at-paralympics-2024-day-8-schedule-harvinder-singh-pooja-2594032-2024-09-05",
      "headline": "India at Paralympics 2024, Day 8 schedule: Harvinder Singh, Pooja in focusAfter scripting history in Paris, India have the opportunity to add more medals to their best-ever tally at the Paralympics as total seven medal events are lined up on Day 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jack-draper-lives-dream-come-true-moment-on-reaching-1st-us-open-semi-final-2594031-2024-09-05",
      "headline": "Jack Draper lives 'dream come true moment' on reaching 1st US Open semi-finalJack Draper became the first British player in 12 years to reach the semi-final of the US Open after Andy Murray's title-winning campaign in 2012.  Draper called it a dream come true moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/meet-indias-historic-club-throw-medallists-dharambir-and-pranav-at-paralympics-2594010-2024-09-05",
      "headline": "Meet Dharambir and Pranav, India's historic Paralympic club throw medalistsIndia's para athletes script history with a stunning 1-2 finish at the Paralympics, led by Dharambir's record-breaking gold and Pranav Soorma's inspiring silver in club throw.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-jessica-pegula-iga-swiatek-karolina-muchova-2594002-2024-09-05",
      "headline": "US Open: Jessica Pegula upsets Iga Swiatek to advance to 1st Grand Slam semi finalJessica Pegula stunned the world no one Iga Swiatek in the quarter-finals of the US Open 2024 to advance to her first ever Grand Slam semi final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jack-draper-alex-de-minaur-quarterfinal-2593968-2024-09-05",
      "headline": "Jack Draper first British man in 12 years to reach US Open semis US Open 2024: Jack Draper is yet to drop a set in the ongoing major and has stormed into the semi-final with a dominating win over Alex de Minaur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-india-medal-tally-harvinder-singh-dharambir-2593963-2024-09-05",
      "headline": "Harvinder, Dharambir shine as India edge close to 25 medalsIndia's medal tally at the Paris Paralympics 2024 edged closer to 25 with Harvinder Singh and Dharambir being the stars of the show on September 4, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/dharambir-gold-pranav-soorma-silver-club-throw-2593965-2024-09-05",
      "headline": "Club throw: Dharambir wins gold, Pranav silver in historic 1-2 for India Paralympics: India's Dharambir and Pranav Soorma won the gold and silver medals, respectively, in the men's club throw event on Wednesday in Paris. India took its medals tally to 24 in the quadrennial event. It was the first instance of a 1-2 for India in para-athletics at the Games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-sheetal-devi-cheers-for-harvinder-singh-in-gold-medal-campaign-2593962-2024-09-05",
      "headline": "Sheetal Devi cheers for Harvinder Singh in gold-medal campaignParalympics 2024: Armless archer Sheetal Devi was there in the stands cheering for Harvinder Singh in the final of the men's recurve individual event in Paris. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}