{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/should-you-buy-vodafone-idea-shares-after-20-percent-fall-ubs-nomura-novuma-new-target-price-2603391-2024-09-20",
      "headline": "Should you buy Vodafone Idea shares after 20% fall? UBS shares new target priceVodafone Idea shares fell 20% after the Supreme Court on Thursday dismissed the company's curative petition, which sought a re-computation of Adjusted Gross Revenue (AGR) dues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-iifl-finance-shares-surged-13-percent-today-2603356-2024-09-20",
      "headline": "Explained: Why IIFL Finance shares surged 13% todayIIFL Finance stock climbed to a high of Rs 560.60, marking its peak since late February, before settling to trade 9.31% higher as of 2:06 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cochin-shipyard-shares-jump-10-percent-today-ftse-all-world-index-inclusion-2603280-2024-09-20",
      "headline": "Explained: Why Cochin Shipyard shares soared 10% todayAt around 12:25 pm, shares of the company were up 9.45% at Rs 1,837.30 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/western-carriers-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-2603255-2024-09-20",
      "headline": " Western Carriers IPO allotment: Step-by-step guide to check statusWestern Carriers IPO allotment: Investors can check their allotment status online via the BSE website or through Link Intime India Private Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iphone-16-in-10-minutes-quick-commerce-blinkit-steals-spotlight-from-e-commerce-giants-2603215-2024-09-20",
      "headline": "iPhone 16 in 10 minutes: Quick commerce firms bring fight to Amazon, FlipkartiPhone 16 sales: Quick commerce platforms like Blinkit, BigBasket and Zepto have started delivering the latest iPhone 16 in minutes, challenging traditional e-commerce giants Amazon and Flipkart.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-all-time-high-sensex-84000-nifty-sharp-rise-us-fed-rate-cut-small-and-midcap-stocks-2603213-2024-09-20",
      "headline": "Sensex jumps over 1,276 points to cross 84,400, Nifty nears 25,800The S&P BSE Sensex was up 1275.45 points to 84,460.25 at 12:49 pm, while the NSE Nifty50 gained 368.70 points to trade at 25,784.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-ipo-allotment-latest-gmp-step-by-step-guide-to-check-status-2603206-2024-09-20",
      "headline": "Northern Arc IPO allotment: Latest GMP, step-by-step guide to check statusNorthern Arc IPO allotment: To check their share allocation, investors should visit the IPO registrar's portal or the BSE and NSE websites."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rites-share-price-up-over-7-percent-railway-psu-stock-ex-bonus-dividend-2603180-2024-09-20",
      "headline": "RITES shares rise 8% but why railway PSU stock may be showing 48% slideDespite this positive momentum, many investors were caught off guard, seeing what appeared to be a 48% slide in the stock price on their trading apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-intern-to-ceo-elliott-hill-32-year-journey-at-nike-linkendin-profile-goes-viral-2603178-2024-09-20",
      "headline": "Elliott Hill's 32-year journey at Nike from intern to CEO goes viralElliott Hill, who has spent over 32 years at Nike, started his journey as an intern and will now be leading the iconic company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-surges-500-points-nifty-gains-momentum-rites-jumps-over-7-2603164-2024-09-20",
      "headline": "Sensex surges 500 points, Nifty gains momentum; JSW Steel jumps 3%The S&P BSE Sensex was up 415.45 points at 83,600.25 at 10:16 am, while the NSE Nifty50 gained 135.80 points to trade at 25,550.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arkade-developers-ipo-allotment-check-status-latest-subscription-gmp-listing-gains-2603115-2024-09-20",
      "headline": "Arkade Developers IPO allotment: Check status, GMP, subscription Arkade Developers IPO allotment: Investors can check their allotment status by logging into the BSE website or the Bigshare Services Pvt Ltd website, the issue's registrar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-capital-ipo-allotment-tomorrow-check-latest-subscription-listing-gain-gmp-2602821-2024-09-19",
      "headline": "Northern Arc Capital IPO allotment tomorrow: Check latest subscription, GMPNorthern Arc Capital Limited, founded in 2009, provides retail loans to underserved households and businesses across India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-higher-after-us-feds-50-bps-rate-cut-ntpc-gains-2602758-2024-09-19",
      "headline": "Sensex, Nifty end higher after US Fed's 50 bps rate cut; NTPC gainsThe S&P BSE Sensex ended 236.57 points higher at 83,184.80, while the NSE Nifty50 settled 38.25 points higher at 25,415.80. Both the indices had hit fresh all-time highs in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-working-on-new-income-tax-act-budget-2025-check-inside-details-2602746-2024-09-19",
      "headline": " Government working on new income tax act. Check inside detailsThe new tax framework aims to replace the current 1961 act, simplifying the tax process for individuals and businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rpsg-sanjiv-goenka-firstsource-expands-globally-eyes-usd-550-million-boost-from-ai-2602719-2024-09-19",
      "headline": "RPSG's Firstsource expands globally, eyes $550 million boost from AIThe expansion is part of Firstsource's strategy to improve its business margins while continuing to create jobs in India. For every position created in Australia, the company plans to create three jobs in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-react-to-us-fed-rate-cut-what-investors-need-to-know-expert-view-2602676-2024-09-19",
      "headline": "Gold prices react to US Fed rate cut: What investors need to knowThe US Federal Reserve's rate cuts aim to stabilise the economy but raise concerns about their impact on global markets, particularly on gold prices, a key investment in uncertain times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-gain-small-midcap-stocks-under-pressure-reason-explained-2602658-2024-09-19",
      "headline": "Explained: Why small and midcap stocks are under pressure todayPublic Sector Undertaking (PSU) stocks, particularly in sectors such as defence, railways, and non-banking financial companies (NBFCs), have been hit hard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-rate-cut-stock-market-protfolio-rebalancing-strategies-it-banking-largecap-expert-views-2602618-2024-09-19",
      "headline": "IT, banking, large-cap stocks: Strategies to boost portfolio after Fed rate cutWill the US Fed's rate cut boost opportunities on Dalal Street? Check these expert strategies to realign your portfolio. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hal-irfc-bhel-rvnl-pfc-irctc-cochin-shipyard-rec-stocks-fall-why-psu-stocks-are-under-pressure-2602600-2024-09-19",
      "headline": "HAL, IRFC, BHEL stocks fall: Here's why PSU stocks are under pressurePSU stocks fell even as India's benchmark indices, Sensex and Nifty, rose on the back of higher-than-expected interest rate cuts by the US Federal Reserve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-50-bps-rate-cut-impact-on-indian-economy-explained-2602573-2024-09-19",
      "headline": "Explained: What US Fed's 50 bps rate cut means for Indian economyThe Fed's decision signalled a shift towards easing monetary policy, with experts divided on its implications for the global economy, including India. Here's a detailed look at how the bigger-than-expected rate cut could impact the Indian economy and the broader market."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/army-officer-fiancee-odisha-police-station-sexual-assault-stripped-details-2603314-2024-09-20",
      "headline": "Kicked on chest, flashed: Army officer's fiancée on Odisha police station ordealThe Army officer and his fiancée had approached Bharatpur police station to file a complaint about road rage. However, what followed was a harrowing experience for the couple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/supreme-court-chief-justice-chandrachud-collegium-judges-appointment-2603366-2024-09-20",
      "headline": "Collegium not a search panel: Supreme Court pulls up Centre on judges' selectionAs per convention, the government is obliged to accept the collegium's recommendation for appointment of judges if the decision has been reiterated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/tirupati-laddoo-row-jp-nadda-speaks-to-chandrababu-naidu-seeks-report-fssai-will-probe-2603347-2024-09-20",
      "headline": "Union Health Minister asks for report on Tirupati laddoos amid animal fat row Union Health Minister JP Nadda has sought a report on the alleged use of animal fat in the famous Tirupati laddoos and ensured that action will be taken after the examination of the report by the Food Safety and Standards Authority of India (FSSAI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/israel-intelligence-shin-bet-mossad-first-cell-phone-bombing-pager-blasts-hezbollah-lebanon-gaza-yahya-ayyash-2603204-2024-09-20",
      "headline": "050507497 does not exist: When Israeli mobile bomb killed The Engineer in 1996Yahya Ayyash, popular as 'The Engineer', was Hamas's chief bombmaker whose devices had killed around 150 people. Spy agency Shin Beit used a cellphone bomb to kill Israel's most-wanted terrorist in 1996, when most of the world hadn't even seen a mobile. His killing came three decades before Hezbollah pager blasts in Lebanon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/why-gen-z-brides-are-choosing-comfort-over-crippling-fashion-2601905-2024-09-20",
      "headline": "Why Gen Z brides are choosing comfort over crippling fashionDesigners say Gen Z brides are far more experimental and self-assured and believe in prioritising personal style, comfort, and sustainability in their wedding outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/tirupati-ladoos-beef-animal-fat-controversy-karnataka-nandini-ghee-2603098-2024-09-20",
      "headline": "Changed ghee brand behind 'animal fat in Tirupati laddoo' controversy?Chandrababu Naidu's claim, citing a lab report, that animal fat was found in the ghee procured during the YSR Congress Party regime has brought into focus the halt in the supply of the famous Nandini ghee last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kim-yeji-acting-role-viral-korean-shooter-assasin-anushka-sen-2603343-2024-09-20",
      "headline": "Viral at Paris Olympics, Korean shooter Kim Yeji lands acting role as assassin South Korean Kim Yeji landed her first acting role, a month after she went viral at the Paris Olympics for her distinctive style at the range. Kim will work with Indian actor Anushka Sen in a spin-off series of the film 'Asia'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/customer-in-mumbai-gets-tired-of-queue-outside-apple-store-orders-it-online-and-receives-it-in-minutes-2603308-2024-09-20",
      "headline": "iPhone 16 buyer gets tired of queues, orders online and receives it in minutesThe iPhone 16 series sale is now live on both online and offline stores. The enthusiasts have been standing outside the store since last night, hoping to be the first ones to get their hands on the new gen iPhones. However, one customer was done with the queues and could not wait any longer. Here is what he did."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/law/story/supreme-court-cbi-plea-2021-west-bengal-post-poll-violence-courts-2603312-2024-09-20",
      "headline": "Supreme Court raps CBI for claiming Bengal courts are hostile, warns of contemptA bench of Justices Abhay S Oka and Pankaj Mithal expressed displeasure over the CBI's plea, stressing that the central probe agency had cast aspersions on the entire judiciary of West Bengal.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/supreme-court-karnataka-rebukes-high-court-judge-over-pakistan-comment-on-locality-2603214-2024-09-20",
      "headline": "Supreme Court rebukes High Court judge over Pak comment on Karnataka localityDuring a recent hearing on a landlord-tenant dispute, Justice Srishananda called a Muslim-majority area in Bengaluru \"Pakistan\" and made a misogynistic remark involving a woman advocate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-all-time-high-sensex-84000-nifty-sharp-rise-us-fed-rate-cut-small-and-midcap-stocks-2603213-2024-09-20",
      "headline": "Sensex jumps over 1,276 points to cross 84,400, Nifty nears 25,800The S&P BSE Sensex was up 1275.45 points to 84,460.25 at 12:49 pm, while the NSE Nifty50 gained 368.70 points to trade at 25,784.50."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/chinese-zoo-admits-their-pandas-are-actually-painted-dogs-after-video-goes-viral-2603303-2024-09-20",
      "headline": "Chinese zoo admits their 'pandas' are actually painted dogs after video goes viral A video of the 'painted dogs' has gone viral in which one of them was seen panting while lying exhausted on a rock inside a fenced-off area. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ernst-and-young-india-rajiv-memani-pune-woman-death-funeral-2603119-2024-09-20",
      "headline": "Will never happen again: Rajiv Memani on EY missing funeral of employeeErnst and Young India chairperson Rajiv Memani has expressed regret on no one from the company attending the funeral of its employee, who died allegedly due to excessive work pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/supreme-court-youtube-channel-hacked-videos-cryptocurrencies-2603256-2024-09-20",
      "headline": "Supreme Court's YouTube channel hacked, videos promoting crypto postedThe Supreme Court's official YouTube channel showed videos promoting XRP, a cryptocurrency developed by a US-based company, instead of live court proceedings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/gurugram/story/gurugram-bike-suv-crash-akshat-garg-mother-dlf-phase-2-2603191-2024-09-20",
      "headline": "How can someone kill a person and get bail: Victim's mother on SUV-bike crashThe mother of the victim questioned how the accused, who was driving the SUV on the wrong side of Golf Course Road in Gurugram, was let off immediately."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/yudhra-review-siddhant-chaturvedi-raghav-juyal-2603278-2024-09-20",
      "headline": "Yudhra review: Siddhant-Raghav's film more style, less substanceReleased-Fri Sep 20, 2024Siddhant Chatturvedi, Raghav Juyal and Malavika Mohanan-starrer Yudhra was released in theatres today, September 20. Considering whether to watch this actioner? Read our review of the film first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/revolution-or-mirage-controversy-surrounds-new-alzheimers-drugs-2603320-2024-09-20",
      "headline": "Revolution or mirage? Controversy surrounds new Alzheimer's drugsTwo new drugs, lecanemab and donanemab, which were shown to slow down the progression of Alzheimer's disease, are now mired in controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/lebanon-hezbollah-pager-blasts-israel-iran-yemen-houthi-middle-east-war-2602815-2024-09-20",
      "headline": "How pager blasts, Hamas chief killing have brought Middle East to brink of warIsrael-Hezbollah War: Even though the intensity of the hostilities has waxed and waned, there is no sign of a pause in the year-long war in Gaza. The pager blasts in Lebanon have further pushed the Middle East to the brink of a full-blown regional war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/video-multiple-cracks-appear-on-taj-mahal-after-rain-pounds-agra-2603307-2024-09-20",
      "headline": "Video: Multiple cracks appear on Taj Mahal after rain pounds AgraMultiple cracks were observed on the iconic Taj Mahal after incessant rain in Agra. Videos accessed by India Today showed cracks on the walls, floor, and other important parts of the Taj Mahal. In another video, a plant was also seen sprouting out of the Taj Mahal. Speaking about the issue, Archaeological of India's Superintendent of Agra Circle Rajkumar Patel said that plants tend to grow on the corners of every monument, and they are duly removed with \"root killer and pesticides\" within eight to ten days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/astronaut-captures-comet-tsuchinshan-atlas-flying-above-earth-in-stunning-video-from-space-2603338-2024-09-20",
      "headline": "Astronaut captures comet flying above Earth in stunning videoThe comet, which has been generating excitement among astronomers and skywatchers, is currently visible in Earth's skies as it approaches its closest point to the sun."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/iphone-16-first-sale-in-india-today-check-price-offers-and-more-2603123-2024-09-20",
      "headline": "iPhone 16 first sale in India today: Check price, offers and moreiPhone 16 series, starting at Rs 79,900, is all set to hit the Indian market. The lineup will be available on both online and offline platforms. Here is how you can buy the iPhone 16 series at a lower price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-weather-cold-temperature-september-morning-coldest-record-2603291-2024-09-20",
      "headline": "At 17.8°C, Delhi recorded coldest September morning in 15 years on ThursdayWeather enthusiasts and experts are monitoring the weather in the upcoming days to understand better whether this is an isolated weather event or part of a larger pattern of climatic shifts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/former-actor-sana-khan-says-devil-made-her-switch-from-full-sleeves-to-backless-2603310-2024-09-20",
      "headline": "Former actor Sana Khan says 'devil' made her switch from full sleeves to backlessSana Khan quit the film and TV industry a few years ago and dedicated her life to the spirituality and teachings of Islam. She now spoke about leaving the life of \"modernism\" and how she found the right path after identifying the \"devil\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-says-karan-johar-called-him-to-cast-bright-actor-janhvi-kapoor-in-devara-2603376-2024-09-20",
      "headline": "Jr NTR says Karan Johar called him to cast 'bright actor' Janhvi Kapoor in DevaraIn an interview recently, actor Jr NTR revealed that it was Karan Johar who called him up while he was writing the script for Devara, and pitched Janhvi Kapoor's name as the female lead in the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/charlie-hunnam-to-portray-serial-killer-ed-gein-in-monster-season-3-on-netflix-2603311-2024-09-20",
      "headline": "Charlie Hunnam to portray serial killer Ed Gein in Monster Season 3 on NetflixCharlie Hunnam will star as notorious serial killer Ed Gein in the third season of Netflix's anthology series Monster. The announcement was made by co-creator Ryan Murphy during a promotional event for Season 2 in Los Angeles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/photo/sholay-dil-chahta-hai-rang-de-basanti-yeh-jawaani-hai-deewani-10-bollywood-films-on-friendship-2603346-2024-09-20",
      "headline": "Sholay to Dil Chahta Hai: 10 Bollywood films based on friendshipBollywood films have always celebrated friendship with heartfelt stories that explore the deep bonds between friends. From Sholay to Dil Chahta Hai, here are 10 Hindi films that beautifully capture the essence of friendship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/photo/5-best-photos-of-rajinikanth-from-his-blockbuster-films-2603354-2024-09-20",
      "headline": "5 best photos of Rajinikanth from his blockbuster filmsSuperstar Rajinikanth is one of the most celebrated actors in Indian cinema. Let's take a look at five best photos of the Vettaiyan actor from his films."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kim-yeji-acting-role-viral-korean-shooter-assasin-anushka-sen-2603343-2024-09-20",
      "headline": "Viral at Paris Olympics, Korean shooter Kim Yeji lands acting role as assassin South Korean Kim Yeji landed her first acting role, a month after she went viral at the Paris Olympics for her distinctive style at the range. Kim will work with Indian actor Anushka Sen in a spin-off series of the film 'Asia'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-olympiad-indian-mens-team-extend-unbeaten-run-to-inch-closer-to-gold-medal-2603328-2024-09-20",
      "headline": "Chess Olympiad: Indian men's team extend unbeaten run to inch closer to gold medalChess Olympiad: Indian men's hammered Iran 3.5-0.5 to extend their unbeaten run to 8 games. While the men's team inched closer to the gold medal, the women's team suffered a shock loss to Poland.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-spinner-yuzvendra-chahal-signs-off-for-northamptonshire-with-19-wickets-2603317-2024-09-20",
      "headline": "Yuzvendra Chahal signs off for Northamptonshire with 19 county wicketsYuzvendra Chahal ended his county championship stint with another 5-wicket haul as Northamptonshire secured a dominant nine-wicket victory over Leicestershire. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-mohammed-siraj-ind-vs-ban-chennai-test-2603296-2024-09-20",
      "headline": "Watch: Rishabh Pant apologises to Mohammad Siraj after DRS error leaves him lividIndia wicketkeeper batter Rishabh Pant apologised to Mohammed Siraj on Day 2 of the second Test against Bangladesh after his DRS error denied him a wicket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-vikram-rathour-batting-coach-rajasthan-royals-rahul-dravid-2603279-2024-09-20",
      "headline": "Vikram Rathour reunites with coach Rahul Dravid at Rajasthan Royals IPL 2025: Rajasthan Royals appointed Vikram Rathour as their batting coach for the upcoming season. The former India opener will reunite with Rahul Dravid, who was named as the head coach of the IPL franchise in September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-barcelona-boss-hansi-flick-sees-positives-despite-monaco-loss-2603257-2024-09-20",
      "headline": "Champions League: Barcelona boss Hansi Flick sees positives despite Monaco lossBarcelona boss Hansi Flick said that he can see positives from his side's performance despite their loss to AS Monaco in the Champions League on Thursday, September 19. Barca lost 2-1 after Eric Garcia got a red card. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-chennai-test-akash-deep-wickets-morne-morkel-reaction-2603254-2024-09-20",
      "headline": "Chennai Test: Coach Morne Morkel all smiles after Akash Deep breathes fire India vs Bangladesh, 1st Test: Fast bowler Akash Deep picked two wickets in successive deliveries in his second over of the Test match in Chennai. Bowling coach Morne Morkel was thrilled to see the young pacer's success on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/travis-head-steve-smith-border-gavaskar-trophy-australia-test-opener-2603249-2024-09-20",
      "headline": "Travis Head eager to 'keep the chatter on' around his promotion as Test openerAustralian opener Travis Head is eager to keep the chatter on around his promotion as Test opener after match-winning innings against England in the first ODI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-sanju-samson-hundred-india-d-vs-b-anantapur-2603209-2024-09-20",
      "headline": "Sanju Samson smashes 94-ball hundred in solid Duleep Trophy outing in AnantapurDuleep Trophy 2024: Wicketkeeper-batter Sanju Samson hit his 11th first-class hundred, smashing a 92-ball century for India D against India B in Anantapur. Samson made the most of the opportunity in the domestic red-ball tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-two-r-ashwin-hundred-virat-kohli-chepauk-ovation-video-2603207-2024-09-20",
      "headline": "Watch: Virat Kohli, Chepauk applaud R Ashwin after 113 in Chennai TestVirat Kohli led the way with the applause for R Ashwin after his fantastic 113 against Bangladesh in the Chennai Test. The whole of Chepauk also gave Ashwin a standing ovation on Day 2 after he got out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-ravichandran-ashwin-ravindra-jadeja-ind-vs-ban-2603200-2024-09-20",
      "headline": "Dinesh Karthik feels Ashwin, Jadeja 'will be valued a lot' after retirementFormer India cricketer Dinesh Karthik opined that India all-rounders Ravichandran Ashwin and Ravindra Jadeja will be valued a lot after their retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-chennai-test-akash-deep-wickets-morne-morkel-reaction-2603254-2024-09-20",
      "headline": "Chennai Test: Coach Morne Morkel all smiles after Akash Deep breathes fire India vs Bangladesh, 1st Test: Fast bowler Akash Deep picked two wickets in successive deliveries in his second over of the Test match in Chennai. Bowling coach Morne Morkel was thrilled to see the young pacer's success on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/travis-head-steve-smith-border-gavaskar-trophy-australia-test-opener-2603249-2024-09-20",
      "headline": "Travis Head eager to 'keep the chatter on' around his promotion as Test openerAustralian opener Travis Head is eager to keep the chatter on around his promotion as Test opener after match-winning innings against England in the first ODI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-sanju-samson-hundred-india-d-vs-b-anantapur-2603209-2024-09-20",
      "headline": "Sanju Samson smashes 94-ball hundred in solid Duleep Trophy outing in AnantapurDuleep Trophy 2024: Wicketkeeper-batter Sanju Samson hit his 11th first-class hundred, smashing a 92-ball century for India D against India B in Anantapur. Samson made the most of the opportunity in the domestic red-ball tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-two-r-ashwin-hundred-virat-kohli-chepauk-ovation-video-2603207-2024-09-20",
      "headline": "Watch: Virat Kohli, Chepauk applaud R Ashwin after 113 in Chennai TestVirat Kohli led the way with the applause for R Ashwin after his fantastic 113 against Bangladesh in the Chennai Test. The whole of Chepauk also gave Ashwin a standing ovation on Day 2 after he got out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-ravichandran-ashwin-ravindra-jadeja-ind-vs-ban-2603200-2024-09-20",
      "headline": "Dinesh Karthik feels Ashwin, Jadeja 'will be valued a lot' after retirementFormer India cricketer Dinesh Karthik opined that India all-rounders Ravichandran Ashwin and Ravindra Jadeja will be valued a lot after their retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hasan-mahmud-1st-bangladesh-bowler-test-five-wicket-haul-in-india-ind-vs-ban-2602679-2024-09-20",
      "headline": "Hasan Mahmud 1st Bangladesh bowler to take Test five-wicket haul in India India vs Bangladesh, Chennai Test: Pacer Hasan Mahmud became the first Bangladesh bowler to take a five-wicket haul in a Test match on Indian soil and rattled India's batting lineup in the first innings of the first Test in Chennai.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-atalanta-vs-arsenal-david-raya-double-save-mikel-arteta-2603160-2024-09-20",
      "headline": "Watch: David Raya makes incredible double save as Arsenal get point vs AtalantaDavid Raya pulled off an incredible double-save to help Arsenal salvage a point against Atalanta in the UEFA Champions League on Thursday, September 19. Raya's praise received a lot of praise for his effort. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-two-r-ashwin-hundred-tamim-iqbal-chennai-2603154-2024-09-20",
      "headline": "IND vs BAN: 'Crisis-man' R Ashwin is underrated as a batter, says Tamim IqbalFormer Bangladesh opener Tamim Iqbal heaped praise on R Ashwin and claimed that the Indian star is underrated as a batter. Ashwin scored his 6th Test hundred on Day one of the Chennai  Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/former-manchester-united-forward-anthony-martial-joins-aek-athens-2603122-2024-09-20",
      "headline": "Former Manchester United forward Anthony Martial joins AEK AthensFormer Manchester forward Anthony Martial has joined Greek club AEK Athens on a three-year deal. Martial joins the club on a three-year deal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-eng-vs-aus-marnus-labuschagne-travis-head-2603112-2024-09-20",
      "headline": "Harry Brook's bizarre take on 1st ODI loss vs Australia: 'We want to entertain'England's young ODI skipper Harry Brook gave a bizarre statement following his team's seven-wicket loss against Australia in the first ODI of the five match series in Nottingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-report-barcelona-as-monaco-arsenal-atalanta-2603111-2024-09-20",
      "headline": "Champions League: Barcelona stunned by AS Monaco, Arsenal held by Atalanta10-man Barcelona were beaten 2-1 by AS Monaco while Arsenal had David Raya to thank as they salvaged a point against Atalanta on Thursday, September 19. Atletico Madrid and Bayer Leverkusen started their campaigns with wins. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/former-manchester-united-forward-anthony-martial-joins-aek-athens-2603122-2024-09-20",
      "headline": "Former Manchester United forward Anthony Martial joins AEK AthensFormer Manchester forward Anthony Martial has joined Greek club AEK Athens on a three-year deal. Martial joins the club on a three-year deal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-eng-vs-aus-marnus-labuschagne-travis-head-2603112-2024-09-20",
      "headline": "Harry Brook's bizarre take on 1st ODI loss vs Australia: 'We want to entertain'England's young ODI skipper Harry Brook gave a bizarre statement following his team's seven-wicket loss against Australia in the first ODI of the five match series in Nottingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-report-barcelona-as-monaco-arsenal-atalanta-2603111-2024-09-20",
      "headline": "Champions League: Barcelona stunned by AS Monaco, Arsenal held by Atalanta10-man Barcelona were beaten 2-1 by AS Monaco while Arsenal had David Raya to thank as they salvaged a point against Atalanta on Thursday, September 19. Atletico Madrid and Bayer Leverkusen started their campaigns with wins. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-sanjay-manjrekar-ind-vs-ban-chennai-test-2603095-2024-09-20",
      "headline": "KL Rahul's temperamental problem has plagued his career: Sanjay ManjrekarFormer India cricketer Sanjay Manjrekar has blamed KL Rahul's temperamental issues for his low returns in Test cricket. Rahul was dismissed for just 16 (52) on Day 1 against Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/travis-head-harry-brook-england-australia-odi-series-report-2603056-2024-09-20",
      "headline": "Travis Head's 154* powers Australia to 1-0 lead against EnglandENG vs AUS: Travis Head hammered 154 runs as Australia beat England by seven wickets at the Trent Bridge in Nottingham to take a 1-0 lead in the five-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/photo/best-football-teams-real-madrid-champions-league-bayer-leverkusen-manchester-city-premier-league-2603041-2024-09-19",
      "headline": "Best Football Teams of 2024Football powerhouse names like Real Madrid, Manchester City have ensured yet another dominating 2023-2024 season with their triumphs in the La Liga, UEFA Champions League and Premier League. On the other hand, the year has also been big for the likes of Bayer Leverkusen and Olympiacos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/photo/iconic-moments-of-indian-cricket-team-in-2024-2603032-2024-09-19",
      "headline": "Iconic moments of Indian cricket team in 2024The Indian cricket team has had several memorable moments in 2024, having won the T20 World Cup in the Caribbean and claiming the Test series against England earlier this year. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}