{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-hopeful-of-inking-trade-deal-but-new-delhi-firm-on-protecting-key-sectors-2752663-2025-07-08",
      "headline": "India, US hopeful of inking trade deal, but New Delhi firm on protecting key sectorsIndia and the United States are nearing a trade deal, with negotiations ongoing. India has taken a firm stance on protecting sensitive sectors, particularly wheat, maize, dairy, and genetically grown crops."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/da-hike-dearness-allowance-60-percent-central-government-employees-salary-rise-2752659-2025-07-08",
      "headline": "Will central government employees' dearness allowance reach 60%?The government revises the DA/DR rates twice a year, effective from January 1 and July 1. However, the official announcement generally comes a few months later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-kotak-bank-rise-3-percent-india-us-trade-2752641-2025-07-08",
      "headline": "Sensex closes 271 points higher, Nifty above 25,500; Kotak Bank up 3%The S&P BSE Sensex added 270 points to end at 83,712.51, while the NSE Nifty50 gained 61.20 points to close at 25,522.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fincluencer-explains-why-indias-rich-are-planning-to-retire-abroad-2752627-2025-07-08",
      "headline": "Fincluencer explains why India's rich are planning to retire abroadIndia's rich are rethinking where they retire and how they invest. Finfluencer Akshat Shrivastava says it's not a whim but a calculated response to India's tax structure on wealth and income."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/high-salary-still-broke-financial-expert-sanjay-kathuria-on-lifestyle-inflation-2752583-2025-07-08",
      "headline": "Earning Rs 80,000 a month and still broke? Finance coach explains what's wrongMany in their 20s and 30s are earning more than generations before, but their money often disappears into lifestyle upgrades, digital conveniences, and impulse-driven choices. The result is a sense of helplessness despite a good paycheck."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bill-gates-net-worth-trails-former-microsoft-ceo-steve-balmer-top-10-richest-world-2752559-2025-07-08",
      "headline": "Bill Gates no longer in world's top 10 richest; trails former Microsoft CEOBill Gates now ranks behind Michael Dell, who is at number 11 with $137 billion, and Steve Ballmer, his former Microsoft colleague, who is far ahead at number 5 with $172 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/all-you-need-to-know-about-uae-golden-visa-cost-application-process-documentation-2752538-2025-07-08",
      "headline": "All you need to know about UAE's Golden Visa: Cost, application, documentationUnlike earlier Golden Visas that required big investments in property or business, this new scheme allows skilled professionals to apply based on their talent and work experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-vs-sebi-all-you-need-to-know-about-the-case-2752537-2025-07-08",
      "headline": "Jane Street vs Sebi: All you need to know about the caseAt the heart of the controversy is a long-running investigation into the firm's index arbitrage strategy, one that Jane Street insists is standard and legal, but which Sebi believes may have distorted prices in India's rapidly growing equity derivatives market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-you-receive-a-tax-refund-now-if-you-file-your-itr-before-september-15-2752492-2025-07-08",
      "headline": "Filed your ITR early? Will you get a faster tax refund?Filing an ITR early improves your chances of a quicker refund, but only if your return is correct, complete and verified on time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-claim-rejections-india-irda-data-real-stories-personal-finance-health-life-term-2752351-2025-07-08",
      "headline": "Insured, but still deniedIn Part 2 of our series on India's insurance crisis, we explore why, for thousands of Indians, having a policy doesn't mean having protection when it matters most."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sebi-vs-jane-street-to-challenge-trading-ban-slams-charges-as-inflammatory-2752400-2025-07-08",
      "headline": "Jane Street to challenge Sebi trading ban, slams charges as inflammatory: ReportIn an internal email to staff over the weekend, the US-based firm said it was \"beyond disappointed\" by Sebi's accusations, which it described as \"extremely inflammatory.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/expert-sanjay-bangar-ulips-high-premiums-not-tax-free-explained-2752383-2025-07-08",
      "headline": "Have lost their tax edge: Expert sounds the alarm on ULIPsThe tax expert said ULIPs no longer guarantee tax-free returns. Investors paying over Rs 2.5 lakh annually may face capital gains tax—making mutual funds a more efficient alternative."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-dipika-chikhlia-ram-arun-govil-playing-dashrath-out-of-context-ranbir-kapoor-2752624-2025-07-08",
      "headline": "Dipika Chikhlia on Arun Govil playing Dashrath in Ramayana: Really out of contextActor Dipika Chikhlia, who portrayed Goddess Sita in Ramanand Sagar's 'Ramayan' has reacted to Arun Govil's casting in 'Ramayana'. She expressed her views on Govil playing Dashrath in the Nitesh Tiwari directorial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-jr-ntr-wrap-up-war-2-shooting-share-emotional-notes-for-crew-2752734-2025-07-08",
      "headline": "Hrithik Roshan wraps War 2: 149 days of blood, sweat, injuries… all worth it!Hrithik Roshan has finished shooting for 'War 2', which will release in cinemas on August 14, 2025. Directed by Ayan Mukerji, the action-packed film also stars Kiara Advani and was shot across five countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jackie-shroff-recalls-why-dev-anand-replaced-him-with-mithun-chakraborty-as-lead-in-swami-dada-2752562-2025-07-08",
      "headline": "Jackie Shroff recalls why Dev Anand replaced him with Mithun as lead in Swami DadaJackie Shroff recalled that he was initially offered the second lead in 'Swami Dada' by Dev Anand but was later replaced by Mithun Chakraborty. Despite the demotion to a minor villain role, he accepted it out of respect for Dev Anand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/srikanth-and-krishna-granted-conditional-bail-in-drug-case-2752717-2025-07-08",
      "headline": "Actors Srikanth and Krishna granted conditional bail in drug caseThe Madras High Court has granted conditional bail to actors Srikanth and Krishna in a high-profile drug-related case, providing them temporary relief amid ongoing investigations. The actors must comply with strict conditions, including daily appearances before the investigating officer, to ensure cooperation with the probe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-is-ranveer-singh-playing-major-mohit-sharma-nsa-ajit-doval-2752528-2025-07-08",
      "headline": "Is Ranveer Singh playing this real-life spy in DhurandharActor Ranveer Singh's new look in Aditya Dhar's upcoming spy action-thriller 'Dhurandhar' has left audiences curious about his character. Is he playing National Security Advisor Ajit Doval? Social media users believe the actor might be portraying an unsung patriot in the film. IndiaToday.in shares insights on the two real-life characters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-on-nepotism-industry-support-couldnt-say-no-to-flawed-scripts-2752686-2025-07-08",
      "headline": "Couldn't say no to flawed scripts: Vijay Deverakonda on nepotism, industry supportWith his upcoming film 'Kingdom' generating buzz, Vijay Deverakonda opened up about the challenges of navigating the industry without a support system and how that shaped his approach to scripts and creative control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-on-serious-relationship-with-girlfriend-gauri-spratt-marriage-plans-2752656-2025-07-08",
      "headline": "Aamir Khan on relationship with Gauri Spratt: I'm married to her in my heartBollywood actor Aamir Khan opened up about his relationship with Gauri Spratt in a recent interview. He discussed the possibility of getting married for the third time and said he is married to her in his heart. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-surprises-fan-new-song-jump-deadline-world-tour-2752554-2025-07-08",
      "headline": "BLACKPINK surprises fans with new song JUMP during DEADLINE world tourK-pop girl group BLACKPINK surprised fans with a new song called 'JUMP' at their much-awaited 'DEADLINE World Tour'. The group also released a 30-second teaser of the song's music video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-praises-vishnu-vishal-oho-endhan-baby-calls-it-a-rare-love-story-2752569-2025-07-08",
      "headline": "Aamir Khan praises Vishnu Vishal's Oho Endhan Baby, calls it a rare love storyAmid growing buzz for the romantic drama 'Oho Endhan Baby', actor Aamir Khan watched the film and called it one of the most touching love stories he's seen, praising its emotional depth and message."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/special-ops-season-2-release-postponed-kay-kay-menon-announce-new-date-2752676-2025-07-08",
      "headline": "Special Ops Season 2 release postponed, Kay Kay Menon announce new dateThe much-awaited 'Special Ops Season 2', starring Kay Kay Menon as R&AW officer Himmat Singh, has been postponed. The new season will stream later in July. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lee-si-young-shares-ivf-pregnancy-plans-single-motherhood-after-divorce-2752596-2025-07-08",
      "headline": "Sweet Home's Lee Si-young announces IVF pregnancy, chooses single motherhoodK-drama star Lee Si-young is embarking on the 'miraculous' journey of motherhood once again, this time, with a heart free of worries or regrets. Here's all you need to know.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/female-actors-stripping-off-their-damsel-in-distress-stereotype-in-cinema-katrina-kaif-priyanka-chopra-alia-bhatt-2752525-2025-07-08",
      "headline": "How female actors are demolishing their damsel in distress stereotype in cinemaFrom dodging bullets to delivering blows, female actors have completely changed the action game. No longer damsel in distress, they aren't just breaking stereotypes, they're rewriting the rulebook, one punch at a time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shabana-azmi-javed-akhtar-fly-air-india-to-wimbledon-express-faith-in-the-airline-2752655-2025-07-08",
      "headline": "Shabana Azmi, Javed Akhtar fly Air India to Wimbledon, express faith in the airlineShabana Azmi and Javed Akhtar are off to Wimbledon. The couple have reinstated their faith in Air India as they chose the airline for travel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-music-lacks-kk-magic-kk-absence-is-missed-tribute-to-late-singer-kk-2752134-2025-07-08",
      "headline": "Metro… In Dino's melody hits the right notes, but KK's absence echoes loudly'Metro… In Dino' delivers emotional depth and strong performances, but without KK's iconic voice, the soundtrack feels incomplete, and here's why we think so."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/divyanka-vivek-nine-years-anniversary-love-television-couple-2752543-2025-07-08",
      "headline": "Divyanka is unapologetically silly in love with Vivek. See anniversary postDivyanka Tripathi marks her ninth wedding anniversary with Vivek Dahiya, sharing a heartfelt post on Instagram. The couple, who met on the sets of 'Yeh Hai Mohabbatein', have been cherished by fans for their enduring relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-pay-hike-kyunki-saas-bhi-kabhi-bahu-thi-reboot-tulsi-virani-star-plus-2752591-2025-07-08",
      "headline": "Smriti Irani gets a massive pay hike for Kyunki Saas Bhi Kabhi Bahu Thi rebootAs actor-turned-politician Smriti Irani gears up to make her TV comeback, her compensation for the show has reportedly increased significantly. She was paid Rs 1,800 per episode when the show first aired in 2000. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neena-gupta-joins-kareena-kapoor-calling-out-prada-kolhapuri-chappal-row-2752501-2025-07-08",
      "headline": "After Kareena Kapoor, Neena Gupta calls out Prada over Kolhapuri footwear row Actor Neena Gupta joined Kareena Kapoor in calling out Prada for allegedly copying the design of traditional Kolhapuri chappals in their latest collection. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyami-kher-becomes-first-indian-actor-to-complete-ironman-703-twice-in-a-year-2752593-2025-07-08",
      "headline": "Saiyami Kher becomes first Indian actor to complete Ironman 70.3 twice in a yearSaiyami Kher has become the first Indian actor to complete the Ironman 70.3 triathlon twice in less than a year. She finished her second race in Sweden with a faster time. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-cheers-for-shanaya-kapoor-ahead-of-aankhon-ki-gustaakhiyan-release-2752491-2025-07-08",
      "headline": "Ananya Panday cheers for Shanaya Kapoor ahead of Aankhon Ki Gustaakhiyan releaseAhead of 'Aankhon Ki Gustaakhiyan' release, actor Ananya Panday cheered for debutant Shanaya Kapoor on Instagram. She also shared that she loves the song 'Alvida' from the upcoming film. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-says-it-did-not-issue-fresh-order-to-ban-accounts-x-took-more-than-21-hours-to-unblock-reuters-2752723-2025-07-08",
      "headline": "What block? We pursued X to get Reuters unblocked: Government counters chargeResponding to the ongoing controversy, an official spokesperson said there was \"no fresh blocking order\" and that the government had \"no intention to block any prominent international news channels, including Reuters and ReutersWorld\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fuel-ban-for-overage-vehicles-in-delhi-from-november-1-scheme-to-be-implemented-in-ncr-same-day-2752753-2025-07-08",
      "headline": "Fuel ban for overage vehicles in Delhi from November 1, scheme to be implemented in NCR same dayFuel ban for overage vehicles in Delhi from November 1, scheme to be implemented in NCR same day"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-deal-likely-to-be-announced-tonight-dairy-agriculture-may-stay-out-government-sources-2752740-2025-07-08",
      "headline": "India-US trade deal likely to be announced tonight: Government sourcesIndia-US trade deal likely to be announced tonight, dairy, agriculture may stay out: Government sources"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-mallikarjun-kharge-mispronounces-droupadi-murmu-ram-nath-kovind-bjp-2752496-2025-07-08",
      "headline": "Murma ji and Covid: Congress chief's gaffes on Presidents' names leave BJP furiousMallikarjun Kharge, speaking in Chhattisgarh, could be heard referring to the President as 'Murma ji'. Seconds later, he did a gaffe again, mispronouncing 'Kovind' as 'Covid'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/paris-seine-france-cleanup-swimming-ban-delhi-yamuna-cleaning-revival-challenge-bjp-rekha-gupta-explained-2752295-2025-07-08",
      "headline": "Seine greets swimmers in Paris after 100 years. Will Delhi pass Yamuna test?The Seine, which flows through the heart of Paris, was sick for 100 years. For the first time since 1923, people were allowed to swim in the Seine. This is after an extensive clean-up of the river. The Yamuna is similarly polluted in Delhi. With Delhi CM Rekha Gupta intensifying the push, will Delhiites get to swim in the Yamuna anytime soon?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kerala-couple-absconds-after-defrauding-bengaluru-investors-in-multi-crore-chit-fund-scam-2752611-2025-07-08",
      "headline": "How Kerala's 'Bunty aur Babli' pulled off multi-crore scam in BengaluruA Kerala couple allegedly behind a decades-long chit fund scam in Bengaluru has gone missing after investors stopped receiving promised returns. Police have launched a manhunt and registered a case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/germany-accuses-china-of-laser-attack-on-its-jet-during-eu-mission-unacceptable-2752683-2025-07-08",
      "headline": "Unacceptable: Germany accuses China of laser attack on its jet during EU missionAlthough the precise coordinates of the incident were not disclosed, Germany confirmed the aircraft was conducting a routine mission when the laser was directed at it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-9-live-score-updates-carlos-alcaraz-aryna-sabalenka-taylor-fritz-2752674-2025-07-08",
      "headline": "Wimbledon Day 9 Live Updates: Sabalenka vs Siegemund underway, Fritz in frontWimbledon 2025 Day 9 Live Updates: Carlos Alcaraz and Aryna Sabalenka will be in focus for their respective singles fixtures as they eye their spots in the semifinal stages. Taylor Fritz will also look to push through.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-angry-america-dalai-lama-tariffs-tibet-india-marco-rubio-2752729-2025-07-08",
      "headline": "China's fresh 'back off' warning to US has a Dalai Lama connect, not tariffsAmid tensions between China and US over tariffs, Beijing lashed out at Washington accusing it of backing Tibetan separatism after Secretary of State Marco Rubio praised the Dalai Lama on his 90th birthday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/woman-gangraped-panipat-train-coach-thrown-sonipat-tracks-loses-leg-2752595-2025-07-08",
      "headline": "Woman gang-raped in train in Haryana, thrown on tracks, loses legThe survivor told the police that she was approached by a man at Panipat railway station, who claimed he had been sent by her husband. She further informed the police that she was taken into an empty coach of a stationary train and raped by him. Subsequently, two other men joined in and also raped her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-claim-rejections-india-irda-data-real-stories-personal-finance-health-life-term-2752351-2025-07-08",
      "headline": "Insured, but still deniedIn Part 2 of our series on India's insurance crisis, we explore why, for thousands of Indians, having a policy doesn't mean having protection when it matters most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/expired-valium-at-home-drug-regulator-lists-17-unused-medicines-to-flush-now-anti-anxiety-diazepam-mental-health-cdsco-2752526-2025-07-08",
      "headline": "Expired Valium at home? Drug regulator lists 17 unused medicines to flush nowThat half-used strip of pills in your medicine cabinet isn't just clutter, it could be deadly. India's top drug regulator warns that expired medications can be fatal if taken by someone they weren't meant for. This isn't just a health advisory by CDSCO, it's an urgent call to action"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/reviews/story/oneplus-nord-5-review-true-value-for-money-phone-with-slick-performance-and-long-lasting-battery-2752614-2025-07-08",
      "headline": "OnePlus Nord 5 review: True value for money phoneThe OnePlus Nord 5 series has been launched in India, with the Nord 5 being the company's latest offering for users looking for a reliable mid-range smartphone under Rs 40,000. In this review, let's explore what the fifth generation of the Nord smartphone offers and whether it truly delivers the value it promises on paper.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-acknowledges-virat-kohli-gladiator-shoutout-wimbledon-2752524-2025-07-08",
      "headline": "Novak Djokovic acknowledges Virat Kohli's 'gladiator' shoutout: Thank YouFormer World No. 1 Novak Djokovic thanked Virat Kohli for his support during his round-of-16 clash with Alex de Minaur. Kohli, clearly captivated by Djokovic's resilience on Centre Court, hailed the Serb as a \"gladiator.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/dreamliner-one-of-the-safest-aircraft-over-1000-flying-air-india-to-parliamentary-panel-on-ahmedabad-crash-2752628-2025-07-08",
      "headline": "Dreamliner among safest aircraft, over 1,000 flying: Air India on Ahmedabad crashAir India's defence came during a PAC meeting that was originally scheduled to discuss \"levy charges at airports\" but turned into a tense session over the June 12 crash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-iran-air-force-j10c-fighter-jet-deal-drubbing-israel-conflict-nuclear-facilities-2752684-2025-07-08",
      "headline": "Willing to share...: China as Iran eyes its 'Vigorous Dragon' jets after drubbingWith its 12-day conflict with Israel crippling its air defences, and exposing the vulnerability of its air force, Iran has reached out to China to purchase J-10C fighter jets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-is-back-but-who-asked-for-it-2752463-2025-07-08",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi is back. But, who asked for it? 'Kyunki Saas Bhi Kabhi Bahu Thi' may have once stood as a symbol of family values, teaching the audience what an ideal woman should look like, but it doesn't sound relevant today. Nostalgia may be powerful, but it shouldn't come at the cost of progress. Women are chasing dreams beyond the kitchen. Do you believe that bringing back Tulsi is a step forward in storytelling?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/information/story/bharat-bandh-25-crore-workers-to-strike-banks-transport-hit-2752382-2025-07-08",
      "headline": "Bharat bandh: 25 crore workers to go on strike; banks, transport to be hitWorkers from various sectors including banking, insurance, postal services, and coal mining are expected to participate in the Bharat Bandh strike.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/zohran-mamdani-new-york-city-old-tweet-showing-middle-finger-to-columbus-statue-sparks-new-row-with-italian-americans-2752535-2025-07-08",
      "headline": "Zohran Mamdani's old tweet giving the finger to Columbus statue sparks new rowA 2020 tweet in which he is seen showing the middle finger to a statue of Christopher Columbus has infuriated the Italian-American voter base, which makes up 8 percent of New York City's electorate,"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-high-court-warns-former-dmk-minister-ponmudy-over-derogatory-remarks-against-vaishnavites-saivites-and-women-hints-at-cbi-probe-2752527-2025-07-08",
      "headline": "Politicians act like kings: Madras High Court raps ex-minister for vulgar speechThe Madras High Court criticised former DMK Minister K Ponmudy for his derogatory remarks against Vaishnavites, Saivites, and women. Justice Velmurugan warned of a possible CBI probe if police fail to act. The final decision is set for July 8, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/female-actors-stripping-off-their-damsel-in-distress-stereotype-in-cinema-katrina-kaif-priyanka-chopra-alia-bhatt-2752525-2025-07-08",
      "headline": "How female actors are demolishing their damsel in distress stereotype in cinemaFrom dodging bullets to delivering blows, female actors have completely changed the action game. No longer damsel in distress, they aren't just breaking stereotypes, they're rewriting the rulebook, one punch at a time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/rs-20-lakh-mba-rs-25k-salary-where-did-b-schools-go-wrong-2752667-2025-07-08",
      "headline": "Rs 20 lakh MBA, Rs 25K salary: Where did B-Schools go wrong? As India's B-schools mushroom, thousands of students graduate with crippling debt and dismal salaries. A hard look at the MBA dream gone wrong.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubahsnhu-shukla-ax-4-mission-isro-student-interaction-astronaut-sleeping-in-space-2752587-2025-07-08",
      "headline": "Shux tells students how astronauts sleep in space where Sun rises 16 timesConnecting directly from the International Space Station (ISS), Shukla shared firsthand experiences about the unique challenges of living, and sleeping in space. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/minor-rape-birth-up-train-newborn-found-moradabad-investigation-2752661-2025-07-08",
      "headline": "SIM card next to baby in bag helps Bihar police uncover rape by girl's fatherAs the family was taking the child's mother, a minor, to Delhi for medical treatment, she gave birth in the train's washroom. Overcome with panic, they hid the newborn in a bag, left it in the general coach, and returned home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-jr-ntr-wrap-up-war-2-shooting-share-emotional-notes-for-crew-2752734-2025-07-08",
      "headline": "Hrithik Roshan wraps War 2: 149 days of blood, sweat, injuries… all worth it!Hrithik Roshan has finished shooting for 'War 2', which will release in cinemas on August 14, 2025. Directed by Ayan Mukerji, the action-packed film also stars Kiara Advani and was shot across five countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jackie-shroff-recalls-why-dev-anand-replaced-him-with-mithun-chakraborty-as-lead-in-swami-dada-2752562-2025-07-08",
      "headline": "Jackie Shroff recalls why Dev Anand replaced him with Mithun as lead in Swami DadaJackie Shroff recalled that he was initially offered the second lead in 'Swami Dada' by Dev Anand but was later replaced by Mithun Chakraborty. Despite the demotion to a minor villain role, he accepted it out of respect for Dev Anand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/srikanth-and-krishna-granted-conditional-bail-in-drug-case-2752717-2025-07-08",
      "headline": "Actors Srikanth and Krishna granted conditional bail in drug caseThe Madras High Court has granted conditional bail to actors Srikanth and Krishna in a high-profile drug-related case, providing them temporary relief amid ongoing investigations. The actors must comply with strict conditions, including daily appearances before the investigating officer, to ensure cooperation with the probe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-is-ranveer-singh-playing-major-mohit-sharma-nsa-ajit-doval-2752528-2025-07-08",
      "headline": "Is Ranveer Singh playing this real-life spy in DhurandharActor Ranveer Singh's new look in Aditya Dhar's upcoming spy action-thriller 'Dhurandhar' has left audiences curious about his character. Is he playing National Security Advisor Ajit Doval? Social media users believe the actor might be portraying an unsung patriot in the film. IndiaToday.in shares insights on the two real-life characters."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sa-zimbabwe-pacer-fined-demerit-point-dangerous-throw-lhuan-dre-pretorious-2752711-2025-07-08",
      "headline": "Zimbabwe pacer fined, handed demerit point for dangerous play in 2nd TestZimbabwe pacer Kundai Matigimu was fined 15 per cent of his match fee and handed a demerit point after his dangerous throw at Lhuan dre Pretorious on Day 1 of the 2nd Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-geoffrey-boycott-on-chris-woakes-and-zak-crawley-2752698-2025-07-08",
      "headline": "Chris Woakes past his sell-date, Zak Crawley not doing enough: Geoffrey BoycottLegendary England batter Geoffrey Boycott tore into Chris Woakes and Zak Crawley following England's massive 336-run loss against India in the second Test at Edgbaston, Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-9-live-score-updates-carlos-alcaraz-aryna-sabalenka-taylor-fritz-2752674-2025-07-08",
      "headline": "Wimbledon Day 9 Live Updates: Sabalenka vs Siegemund underway, Fritz in frontWimbledon 2025 Day 9 Live Updates: Carlos Alcaraz and Aryna Sabalenka will be in focus for their respective singles fixtures as they eye their spots in the semifinal stages. Taylor Fritz will also look to push through.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-wimbledon-pressure-playing-at-lords-2752675-2025-07-08",
      "headline": "Virat Kohli compares playing at Wimbledon and Lord's: Centre court more intimidatingVirat Kohli finds playing at Wimbledon's Centre Court more intimidating than cricket stadiums. He praises tennis players' mental strength and says only India vs Pakistan games match such pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-drops-moral-harassment-case-psg-reconcilation-2752648-2025-07-08",
      "headline": "Mbappe drops moral harassment case against PSG and seeks reconciliationKylian Mbappe has dropped the moral harassment case against Paris Saint-Germain, and the Frenchman seeks reconciliation with his former club. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/virat-kohli-backs-novak-djokovic-eighth-wimbledon-25th-grand-slam-2752600-2025-07-08",
      "headline": "Virat Kohli makes Wimbledon 2025 prediction: I want Novak Djokovic to winVirat Kohli, speaking from the Center Court at Wimbledon, backed Novak Djokovic to play Carlos Alcaraz in the men's singles final and beat the Spaniard for his 25th Grand Slam title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-pakistan-babar-azam-mohammad-rizwan-shaheen-afridi-dropped-2752572-2025-07-08",
      "headline": "No Babar, Rizwan, Shaheen as Pakistan announce squad for Bangladesh T20I seriesThere was no place for Babar Azam, Mohammad Rizwan and Shaheen Shah Afridi as Pakistan announced the squad for the upcoming T20I series against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/mirra-andreeva-reaction-roger-federer-attends-wimbledon-win-2752553-2025-07-08",
      "headline": "Watch: Andreeva starstruck as Roger Federer attends her Wimbledon winWimbledon 2025: Russian tennis star Mirra Andreeva fulfilled a lifelong dream when 20-time Grand Slam champion Roger Federer watched her match from the iconic Royal Box at SW19 on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tim-david-australia-odi-team-return-t20i-world-cup-2752552-2025-07-08",
      "headline": "Why Tim David isn't chasing an ODI return? Australian batter explains decisionTim David is in no rush to return to the ODI setup as Australia enter a period of transition with their 50-over side following the retirements of big names. David said that his current focus is on T20s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/virat-kohli-backs-novak-djokovic-eighth-wimbledon-25th-grand-slam-2752600-2025-07-08",
      "headline": "Virat Kohli makes Wimbledon 2025 prediction: I want Novak Djokovic to winVirat Kohli, speaking from the Center Court at Wimbledon, backed Novak Djokovic to play Carlos Alcaraz in the men's singles final and beat the Spaniard for his 25th Grand Slam title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-pakistan-babar-azam-mohammad-rizwan-shaheen-afridi-dropped-2752572-2025-07-08",
      "headline": "No Babar, Rizwan, Shaheen as Pakistan announce squad for Bangladesh T20I seriesThere was no place for Babar Azam, Mohammad Rizwan and Shaheen Shah Afridi as Pakistan announced the squad for the upcoming T20I series against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/mirra-andreeva-reaction-roger-federer-attends-wimbledon-win-2752553-2025-07-08",
      "headline": "Watch: Andreeva starstruck as Roger Federer attends her Wimbledon winWimbledon 2025: Russian tennis star Mirra Andreeva fulfilled a lifelong dream when 20-time Grand Slam champion Roger Federer watched her match from the iconic Royal Box at SW19 on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tim-david-australia-odi-team-return-t20i-world-cup-2752552-2025-07-08",
      "headline": "Why Tim David isn't chasing an ODI return? Australian batter explains decisionTim David is in no rush to return to the ODI setup as Australia enter a period of transition with their 50-over side following the retirements of big names. David said that his current focus is on T20s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-acknowledges-virat-kohli-gladiator-shoutout-wimbledon-2752524-2025-07-08",
      "headline": "Novak Djokovic acknowledges Virat Kohli's 'gladiator' shoutout: Thank YouFormer World No. 1 Novak Djokovic thanked Virat Kohli for his support during his round-of-16 clash with Alex de Minaur. Kohli, clearly captivated by Djokovic's resilience on Centre Court, hailed the Serb as a \"gladiator.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-batting-captaincy-don-bradman-ravi-shastri-2752519-2025-07-08",
      "headline": "Shubman Gill batted like Don Bradman in 2nd Test, captaincy 10 out of 10: Ravi ShastriRavi Shastri heaped praise on Shubman Gill for his batting prowess and captaincy skills during India's win in the second Test against England. Gill scored twin centuries as India handed England a big defeat to level the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-third-test-ben-stokes-captaincy-michael-atherton-lords-2752475-2025-07-08",
      "headline": "Lord's Test vs India will be Ben Stokes' toughest challenge as captain: AthertonMichael Atherton believes the Lord's Test will be a stern challenge for Ben Stokes' England captaincy after the heavy Edgbaston defeat. The upcoming match will be a test of Stokes' leadership and resilience, according to Atherton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-wimbledon-trip-test-retirement-let-him-watch-in-peace-2752438-2025-07-08",
      "headline": "Virat Kohli's Wimbledon trip a problem? Let him watch, without being watchedVirat Kohli watching Wimbledon at the iconic Centre Court on Monday has upset a few. The former India captain was rooting for Novak Djokovic in his fourth-round match. Can't Kohli even watch tennis now?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/serie-a-luka-modric-ac-milan-real-madrid-massimiliano-allegri-2752428-2025-07-08",
      "headline": "Extraordinary Luka Modric is coming to AC Milan: New manager Massimiliano AllegriAC Milan boss Massimiliano Allegri has confirmed that Luka Modric will join the club after the end of the FIFA World Cup this month. Modric is set to leave Real Madrid after a successful 13 years with the club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mcc-verdict-akash-deep-wicket-joe-root-2752411-2025-07-08",
      "headline": "Was Akash Deep's delivery to Joe Root a no-ball? MCC settles debateThe Marylebone Cricket Club (MCC), the England-based governing body responsible for cricket laws, has confirmed that Akash Deep's delivery, which dismissed Joe Root in the second Anderson-Tendulkar Trophy Test, was legal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-sam-konstas-test-career-andrew-mcdonald-2752402-2025-07-08",
      "headline": "Too early to judge Sam Konstas' Test career: Australia coach Andrew McDonaldAustralia coach Andrew McDonald said that it was too early to judge the Test career of Sam Konstas after his rough time during the ongoing Test series against the West Indies. McDonald also said that they will keep a close eye on the domestic performances heading into the Ashes series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarandeep-singh-on-rishabh-pant-priyansh-arya-digvesh-rathi-2752296-2025-07-08",
      "headline": "Phenomenal Pant follows his instincts: Delhi coach decodes India's X factorFormer India cricketer and selector Sarandeep Singh has been left in awe of Rishabh Pant's electrifying strokeplay in the ongoing Test series against England. The Delhi coach hailed the wicketkeeper batter for his strong resolve and fearlessness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/serie-a-luka-modric-ac-milan-real-madrid-massimiliano-allegri-2752428-2025-07-08",
      "headline": "Extraordinary Luka Modric is coming to AC Milan: New manager Massimiliano AllegriAC Milan boss Massimiliano Allegri has confirmed that Luka Modric will join the club after the end of the FIFA World Cup this month. Modric is set to leave Real Madrid after a successful 13 years with the club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mcc-verdict-akash-deep-wicket-joe-root-2752411-2025-07-08",
      "headline": "Was Akash Deep's delivery to Joe Root a no-ball? MCC settles debateThe Marylebone Cricket Club (MCC), the England-based governing body responsible for cricket laws, has confirmed that Akash Deep's delivery, which dismissed Joe Root in the second Anderson-Tendulkar Trophy Test, was legal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-sam-konstas-test-career-andrew-mcdonald-2752402-2025-07-08",
      "headline": "Too early to judge Sam Konstas' Test career: Australia coach Andrew McDonaldAustralia coach Andrew McDonald said that it was too early to judge the Test career of Sam Konstas after his rough time during the ongoing Test series against the West Indies. McDonald also said that they will keep a close eye on the domestic performances heading into the Ashes series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarandeep-singh-on-rishabh-pant-priyansh-arya-digvesh-rathi-2752296-2025-07-08",
      "headline": "Phenomenal Pant follows his instincts: Delhi coach decodes India's X factorFormer India cricketer and selector Sarandeep Singh has been left in awe of Rishabh Pant's electrifying strokeplay in the ongoing Test series against England. The Delhi coach hailed the wicketkeeper batter for his strong resolve and fearlessness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-day-9-schedule-sabalenka-alcaraz-fritz-anisimova-khachanov-2752378-2025-07-08",
      "headline": "Day 9 schedule: Aryna Sabalenka, Carlos Alcaraz headline quarterfinalistsThe quarterfinals of Wimbledon get underway on Day Nine of the Championships at the All England Lawn Tennis and Croquet Club in London. In the men's singles, fifth seed Taylor Fritz faces Karen Khachanov, while Carlos Alcaraz takes on home favourite Cameron Norrie in a blockbuster clash on Centre Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-james-anderson-jofra-archer-inclusion-lords-test-2752359-2025-07-08",
      "headline": "England must play Jofra Archer at Lord's, says James AndersonEngland vs India, 3rd Test: England great James Anderson has called for the immediate inclusion of Jofra Archer in the playing XI for the crucial third Test against India at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-pitch-shubman-gill-dig-england-headache-2752350-2025-07-08",
      "headline": "Lord's pitch chatter: Shubman Gill's subtle dig and England's growing headacheEngland vs India, 3rd Test: On a Birmingham featherbed that suits their style, England were outplayed comfortably by Shubman Gill's India. Ahead of the third Test in London, there is speculation that England might resort to a more lively pitch. But, can they afford the extra spice at Lord's? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-wimbledon-sportsmanship-grigor-dimitrov-injury-retirement-2752346-2025-07-08",
      "headline": "Watch: Sinner carries injured Dimitrov's bags off court after retirementJannik Sinner showed pure class on Monday at Wimbledon, carrying Grigor Dimitrov's bags off the court after the Bulgarian was forced to retire mid-match due to injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-squad-zimbabwe-test-series-kane-williamson-unavailable-2752338-2025-07-08",
      "headline": "Kane Williamson unavailable as New Zealand name squad for Zimbabwe TestsSenior batter Kane Williamson remains unavailable as New Zealand named their squad for the upcoming two-match Test series against Zimbabwe in Bulawayo."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-jannik-sinner-grigor-dimitrov-injury-walkover-2752309-2025-07-08",
      "headline": "Jannik Sinner escapes upset as Grigor Dimitrov's injury sends him to quarterfinalsJannik Sinner was given a major reprieve during his fourth-round clash at Wimbledon as Grigor Dimitrov's unfortunate pectoral injury handed him a walkover despite being two sets down in the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-ben-shelton-mira-andreeva-through-to-quarterfinals-2752297-2025-07-08",
      "headline": "Wimbledon 2025: Ben Shelton defeats Lorenzo Sonego, Mira Andreeva thumps NavarroBen Shelton came out victorious in a hard-fought win over Italy's Lorenzo Sonego in the fourth round, while Mira Andreeva put up a dominant display to join Maria Sharapova as the youngest to progress through to the quarterfinals of Wimbledon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/shubman-gill-next-indias-batting-great-sachin-tendulkar-sunil-gavaskar-karsan-ghavri-2752283-2025-07-07",
      "headline": "Gill halfway through to being India's next batting great: Karsan GhavriThe former India cricketer, Karsan Ghavri has gone on to back Shubman Gill, already being on track to be India's next big batting great, following the path of legendary names like Sunil Gavaskar and Sachin Tendulkar. This comes after his sensational performance against England in the Birmingham Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-anushka-sharma-attend-wimbledon-to-watch-novak-djokovic-2752259-2025-07-07",
      "headline": "Virat Kohli, Anushka Sharma attend Wimbledon, watch gladiator Djokovic in actionStar India batter Virat Kohli was in attendance with his Bollywood actor wife Anushka Sharma to watch Novak Djokovic's fourth-round fixture against Alex de Minaur. Djokovic beat his Australian rival 1-6, 6-4, 6-4, 6-4 to progress ahead in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-breaks-federer-curse-wins-wimbledon-fourth-round-de-minaur-2752245-2025-07-07",
      "headline": "Novak Djokovic breaks 'Roger Federer curse' to reach 16th Wimbledon quarterfinalWimbledon 2025: Novak Djokovic came back from a set down to beat 11th seed Alex de Minaur on Monday. Roger Federer watched the Serb's win from the Royal Box on Center Court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-yograj-singh-gautam-gambhir-birmingham-test-win-2752243-2025-07-07",
      "headline": "Nothing should be said about Gambhir: Yograj after India's 2nd Test winYograj Singh believes that Gautam Gambhir has copped a lot of unfair criticism with regards to the Test team, and the head coach should be appreciated instead for giving back to the game that made their careers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/fir-registered-against-rcb-cricketer-yash-dayal-in-sexual-harassment-case-2752239-2025-07-07",
      "headline": "RCB's Yash Dayal faces sexual harassment case after woman alleges exploitationAn FIR has been registered against Royal Challengers Bengaluru (RCB) fast bowler Yash Dayal for sexually exploiting a woman on the pretext of marriage. According to the complaint, the woman alleged that she was in a five-year relationship with Dayal, during which he mentally, physically, and financially exploited her under the false promise of marriage."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}