{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/terrific-effort-but-still-away-from-being-good-and-simple-tax-ex-cea-on-gst-20-2782748-2025-09-05",
      "headline": "Terrific effort but still away from being Good and Simple Tax: Ex-CEA on GST 2.0Former Chief Economic Advisor Arvind Subramanian analyses the recent GST rationalisation. He states the tax has become \"more good and more simple\" with the removal of the 28% slab, but cautions, \"we're still some ways away from reaching that goal.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-in-delhi-rates-surge-by-rs-900-to-rs-107-lakh-amid-interest-rate-cut-hopes-2782688-2025-09-05",
      "headline": "Gold prices surge by Rs 900 to Rs 1.07 lakh amid interest rate cut hopesGold of 99.5 per cent purity advanced by Rs 900 to Rs 1,06,100 per 10 grams (inclusive of all taxes) on Friday, from the previous close of Rs 1,05,200 per 10 grams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-forex-reserves-usd-35-billion-to-usd-694-billion-says-reserve-bank-of-india-2782682-2025-09-05",
      "headline": "India's forex reserves rise by $3.5 billion to $694 billion, says RBIFor the week ended August 29, foreign currency assets, a major component of the reserves, increased by USD 1.686 billion to USD 583.937 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-urban-company-dev-accelerator-shringar-house-of-mangalsutra-details-gmp-review-2782623-2025-09-05",
      "headline": "Urban Company and 2 IPOs lined for next week. Check GMP and detailsUrban Company, Dev Accelerator and Shringar House of Mangalsutra will all launch their IPOs on September 10, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/the-truth-behind-guaranteed-8-10-returns-expert-explains-the-reality-2782468-2025-09-05",
      "headline": "The truth behind \"Guaranteed 8–10% Returns\": Expert explains the realityMany savers in India are often attracted to insurance plans that promise \"guaranteed\" returns, offering the appeal of steady growth without exposure to market risks. But do these policies actually deliver what they claim?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-on-gst-20-citizen-relief-and-way-forward-2782535-2025-09-05",
      "headline": "Nirmala Sitharaman on GST 2.0, citizen relief, and way forwardIn an exclusive interview with India Today TV, Finance Minister Nirmala Sitharaman talked about the next-generation GST reforms, GST classification, how the GST reforms benefits will be passed on to common man, the opposition's 'Gabbar Singh Tax' jibe on GST and much more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/finance-minister-on-gst-slabs-medicine-taxes-and-us-india-tariff-war-ytvd-2782566-2025-09-05",
      "headline": "Finance Minister on GST Slabs, Medicine Taxes, and US-India Tariff WarFinance Minister Nirmala Sitharaman, during an exclusive interview with India Today TV, addressed public's queries from Lucknow on key economic issues, including GST slabs and international trade tariffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-answers-questions-on-gst-reforms-from-kolkata-2782553-2025-09-05",
      "headline": "Nirmala Sitharaman answers questions on GST reforms from KolkataFinance Minister Nirmala Sitharaman, during an exclusive interview with India Today TV, addressed questions of public from Kolkata regarding recent GST reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-auto-sector-stocks-gain-it-shares-down-mahindra-ril-2782548-2025-09-05",
      "headline": "Sensex, Nifty end flat as auto sector stocks offset losses by IT sharesThe S&P BSE Sensex was down by just 7.25 points to close at 80,710.76, while the NSE Nifty50 gained a paltry 6.70 points to end at 24,741.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-gst-started-with-four-slabs-finance-minister-nirmala-sitharaman-explains-exclusive-interview-with-india-today-2782539-2025-09-05",
      "headline": "Exclusive: Why GST started with 4 slabs? Nirmala Sitharaman explainsWhen GST was launched in 2017, it came with four slabs, 5%, 12%, 18% and 28%. With GST 2.0 now moving to a simpler two-slab system, Nirmala Sitharaman has explained why the original multi-slab structure was necessary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-tax-free-benefit-pass-to-people-private-public-sector-finance-minister-nirmala-sitharaman-2782521-2025-09-05",
      "headline": "Exclusive: Will common man get insurance rate cut benefits in GST 2.0? FM answersFinance Minister Nirmala Sitharaman made it clear that the tax relief was introduced for citizens and not for insurance companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/popcorn-puzzle-solved-nirmala-sitharaman-explains-gst-classification-2782506-2025-09-05",
      "headline": "Popcorn puzzle solved: Nirmala Sitharaman explains GST classificationIn an exclusive interview with India Today TV, Finance Minister Nirmala Sitharaman explained why salted and chocolate-coated variants had earlier attracted different GST rates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-petrol-diesel-is-still-not-part-of-gst-nirmala-sitharaman-answers-exclusive-interview-with-india-today-2782492-2025-09-05",
      "headline": "Why petrol, diesel is still not part of GST? Nirmala Sitharaman answersThe new GST 2.0 promises a simpler, two-rate structure and relief for many sectors. But fuel, petrol and diesel, remains outside its ambit. Finance Minister Nirmala Sitharaman has explained the reason behind this decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-next-after-gst-20-finance-minister-nirmala-sitharaman-on-gst-30-plans-exclusive-interview-with-india-today-2782467-2025-09-05",
      "headline": "What's next after GST 2.0? Nirmala Sitharaman on GST 3.0 plansFinance Minister Nirmala Sitharaman has confirmed that GST 2.0, with its new two-slab framework, will begin on September 22. But the bigger question is, what lies ahead in GST 3.0?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/benz-vs-hawai-chappal-nirmala-sitharaman-on-why-india-isnt-ready-for-one-nation-one-tax-2782479-2025-09-05",
      "headline": "Benz vs Hawai chappal: Nirmala Sitharaman on why India isn't ready for uniform GSTIn an exclusive conversation with India Today TV, Finance Minister Nirmala Sitharaman stated that while \"one nation, one tax\" remains an aspirational idea, India's uneven levels of development make a uniform GST rate unfair."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-rate-cut-benefit-nirmala-sitharaman-corporate-pass-to-people-cbic-keep-track-2782474-2025-09-05",
      "headline": "Exclusive: How will government ensure GST cut benefits pass on to consumers? FM explainsFinance Minister Nirmala Sitharaman addressed concerns about rate-cut benefits being passed on to people, explaining how the government plans to track the benefits in an exclusive with India Today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/working-to-ensure-gst-rate-cut-is-passed-on-to-the-public-says-nirmala-sitharaman-2782449-2025-09-05",
      "headline": "GST rate cuts must be passed on to public, that's the focus: Nirmala SitharamanIn an exclusive interview with India Today TV, Finance Minister Nirmala Sitharaman said GST 2.0's success hinges on strict vigilance to ensure rate cuts are fully passed on to consumers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-tips-gst-reforms-how-to-make-share-portfolio-investor-money-trading-tips-2782443-2025-09-05",
      "headline": "GST rate cut, portfolio reset: Where should your money go now?The Goods and Services Tax (GST) is moving away from the four-slab system of 5%, 12%, 18% and 28% to a simpler structure of just two main rates, 5% and 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/life-and-health-insurance-premiums-exempt-from-gst-how-much-will-you-save-2782423-2025-09-05",
      "headline": "Life and health insurance premiums exempt from GST: How much will you save?With full GST exemption, life and health insurance premiums could become lower, potentially saving policyholders several thousand rupees. The change is expected to cover all individual policies, including term plans, ULIPs, endowments, and senior citizen health plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-a-home-vs-investing-in-stocks-which-builds-more-wealth-explains-expert-2782403-2025-09-05",
      "headline": "Buying a home vs investing in stocks: Which builds more wealth, explains expertIndians often believe owning a house is the ultimate financial goal. But when it comes to wealth creation, stocks may have left property behind. An expert breaks down the real returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-falls-after-rising-gst-reforms-fail-to-cheer-dalal-street-explained-2782364-2025-09-05",
      "headline": "Explained: Why stock markets are down despite GST 2.0 reformsThe BSE Sensex slipped 254.91 points to 80,463.10, while the NSE Nifty50 was down 69.25 points to 24,665.05 at 12:08 pm. Both benchmarks had gained in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/exporters-relief-modi-government-schemes-negate-trump-tariff-2782357-2025-09-05",
      "headline": "Government may announce schemes to help exporters hit by Trump tariffs: SourcesWith textiles, gems, and leather shipments now weighed down by a 50% duty, the government is drawing up a relief package aimed at keeping liquidity flowing and jobs intact. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-after-september-15-heres-the-penalty-and-conditions-you-must-check-2782349-2025-09-05",
      "headline": "ITR filing after September 15? Here's the penalty and conditions you must checkThe extended deadline to file income tax returns (ITR) for FY 2024–25 is September 15, 2025. Missing it means your return will be treated as belated, attracting penalties and interest. Here's what you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-rate-cut-news-changes-business-gain-loss-sectors-impacted-insurance-small-firm-nbfcs-2782346-2025-09-05",
      "headline": "GST 2.0: Diwali gift for the middle class, but what about businesses?The GST rate cut boost to consumer sentiment is expected to drive demand, but industry experts say that the reforms also carry long-term benefits for businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-20-essentials-cheaper-but-these-items-will-now-cost-more-2782305-2025-09-05",
      "headline": "GST 2.0: Essentials cheaper, but these items will now cost moreWhile essentials will see meaningful relief, everyday indulgences and luxury items will carry heavier taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/gst-rate-cut-auto-sector-rally-top-stocks-mahindra-tvs-eicher-motors-maruti-suzuki-2782267-2025-09-05",
      "headline": "GST cuts drive auto sector rally: Top stocks to keep on your radarWith the festive season approaching, experts believe that automobile companies will be among the biggest winners of the recent rate cuts in GST."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-200-points-nifty-above-24800-wipro-asian-paints-lead-gains-2782252-2025-09-05",
      "headline": "Sensex, Nifty extend gains as GST cut optimism fuels Dalal Street rallyThe S&P BSE Sensex gained nearly 300 points in early trade, while the Nifty50 climbed past 24,800, signalling the possibility of a fresh rally if a favourable outcome emerges on the US tariff front."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oracle-salesforce-job-cuts-hit-bay-area-and-seattle-as-tech-layoffs-drag-on-2782249-2025-09-05",
      "headline": "Oracle, Salesforce cut hundreds of jobs in US as tech layoffs drag on: ReportIn filings with state regulators, the two software giants disclosed plans to eliminate more than 500 jobs in the Bay Area and nearly 200 in the Seattle region. Salesforce is cutting 262 roles in San Francisco, while Oracle is eliminating 254 jobs spread across Redwood City, Pleasanton and Santa Clara. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-white-house-dinner-tech-ceo-google-apple-microsoft-investment-2782216-2025-09-05",
      "headline": "How much will you invest in US? Trump presses tech titans at White House dinnerAt a White House dinner with top tech CEOs, Donald Trump pressed Apple, Google, Meta, and Microsoft on their US investments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/giorgio-armani-italian-fashion-empire-successor-inheritance-2782214-2025-09-05",
      "headline": "What after Armani: The way ahead for iconic Italian fashion empireGiorgio Armani, who died at 91 leaving no children, built one of the world's most iconic fashion brands and ensured its future independence through a foundation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-scraps-biden-era-plan-mandating-airlines-to-pay-for-flight-disruptions-glbs-2782206-2025-09-05",
      "headline": "US scraps Biden-era plan mandating airlines to pay for flight disruptionsIn December, the US Department of Transportation under then-President Joe Biden sought public comment on the rulemaking process about whether airlines should be required to pay $200 to $300 for domestic delays of at least three hours and up to $775 for longer delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/gst-reforms-will-consumption-and-investment-get-a-real-boost-experts-debate-2782158-2025-09-04",
      "headline": "GST reforms: Will consumption and investment get a real boost? Experts debateA major overhaul of the Goods and Services Tax, termed GST 2.0, has been initiated, which the government is calling a significant 'Diwali bonus' for consumers and the economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/gst-20-is-game-changing-and-transformational-reform-piyush-goyal-2782038-2025-09-04",
      "headline": "GST 2.0 is game-changing and transformational reform: Piyush GoyalIn an exclusive interview with India Today TV's Managing Editor Marya Shakil, Union Commerce and Industry Minister Piyush Goyal called GST 2.0 the most game-changing and transformational reform the country has seen in several decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-hails-gst-20-as-game-changing-reform-for-citizens-and-businesses-2782043-2025-09-04",
      "headline": "GST 2.0 a game-changing reform for citizens and businesses: Piyush GoyalUnion Commerce Minister Piyush Goyal has described the new GST 2.0 reforms as a \"game-changing\" move that will simplify taxes, reduce prices on daily essentials, and give a major boost to India's economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zara-lacoste-and-other-global-brands-face-higher-gst-report-2782014-2025-09-04",
      "headline": "Zara, Lacoste, and other global brands face higher GST: ReportInternational names such as Zara, H&M, Levi's, Lacoste, Nike and Uniqlo could be directly impacted. These brands rely heavily on India's growing middle-class youth, who see branded apparel as a lifestyle upgrade but remain highly price-sensitive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/gst-reforms-commendable-will-have-far-reaching-benefits-anand-sharma-2781987-2025-09-04",
      "headline": "GST reforms commendable, will have far-reaching benefits: Anand SharmaIn an exclusive interview with India Today TV, former Commerce Minister Anand Sharma provides his assessment of the next-generation GST reforms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/stock-market-sensex-nifty-end-higher-gst-rate-cut-next-big-trigger-for-economy-2781955-2025-09-04",
      "headline": "Sensex, Nifty end higher: Is GST 2.0 next big trigger for the economy?Speaking on the possible impact on the market closing show on BT TV, Vinit Bolinjkar, Head of Research at Ventura Securities, said the domestic economy is set for a strong rebound."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-are-sin-goods-india-gst-taxation-new-rate-special-40-percent-slab-2781951-2025-09-04",
      "headline": "What are 'sin' goods? All you need to know about special 40% GST slabFrom September 22, 2025, India will have a simpler GST system with just two main rates and a special 40% slab. This top rate applies only to a few products, popularly known as 'sin goods'. Let's break it down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-150-points-higher-nifty-settles-above-24700-mm-gains-6-2781948-2025-09-04",
      "headline": "Sensex, Nifty end higher as profit booking caps GST 2.0 rallyAnalysts said the day began on a strong note, with sweeping GST rate cuts fuelling broad-based buying in auto, FMCG, and consumer durable stocks. However, sustained selling pressure in the second half of trade eroded much of the early momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-guide-explained-what-gets-cheaper-costlier-sin-goods-food-itesm-rate-cut-festive-season-services-2781928-2025-09-04",
      "headline": "GST 2.0 guide: What gets cheaper, costlier, and everything in betweenJust as the festival season approaches, Finance Minister Nirmala Sitharaman has delivered a comprehensive GST overhaul that will put more money back into the pockets of Indians."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-stuns-london-crowd-with-surprise-saiyaara-rendition-2783242-2025-09-07",
      "headline": "Arijit Singh stuns London crowd with surprise Saiyaara renditionArijit Singh mesmerised fans at London's Tottenham Hotspur Stadium with a soulful and retro-infused performance of 'Saiyaara'. The unexpected choice of this hit track had the entire stadium singing along. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-slays-in-silver-at-birmingham-event-fans-flock-in-a-flurry-2783228-2025-09-07",
      "headline": "Kareena Kapoor slays in silver at Birmingham event, fans flock in a flurryBollywood icon Kareena Kapoor Khan created a buzz in Birmingham as she dazzled fans at a store launch, charming the crowd with her elegance and warmth. Several videos and pictures from the event went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/comedian-zakir-khan-announces-break-from-tour-says-been-unwell-for-an-year-2783217-2025-09-07",
      "headline": "Comedian Zakir Khan announces break, says been unwell for a yearStand-up comedian Zakir Khan has decided to take a break from his touring schedule to prioritise his health after a decade of rigorous performances across India. He will continue with a limited 'Papa Yaar India' tour starting October 2025, followed by a much-needed long break."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakesh-roshan-turns-76-ameesha-simi-garewal-extend-wishes-throwback-pics-2783021-2025-09-06",
      "headline": "Rakesh Roshan turns 76: Ameesha, Simi Garewal extend wishes with throwback picsActor Ameesha Patel wished her mentor Rakesh Roshan on his 76th birthday. She called him a 'beacon of hope' by sharing a throwback photo. His actor-friend Simi Garewal also wrote a sweet birthday note for him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-cheers-for-kalyani-priyadarshan-lokah-chandra-gave-me-goosebumps-2783018-2025-09-06",
      "headline": "Chandra gave me goosebumps: Samantha cheers for Kalyani Priyadarshan's Lokah'Lokah: Chapter 1', featuring Kalyani Priyadarshan as India's first female superhero, has garnered widespread acclaim for its captivating blend of mythology and fantasy. Recently, Samantha joined the list of celebs who hailed the movie. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-salman-khan-scolds-amaal-malik-asks-if-he-only-came-to-sleep-2783002-2025-09-06",
      "headline": "Bigg Boss 19: Salman Khan scolds Amaal Malik, asks if he only came to sleepBigg Boss 19 host Salman Khan scolded singer Amaal Malik for not living up to the audience's expectations as a contestant on the reality show. Salman asked Amaal whether he wanted to make a difference or not."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amol-parashar-responds-to-relationship-buzz-with-konkona-sensharma-people-made-it-official-2782999-2025-09-06",
      "headline": "Amol Parashar responds to relationship buzz with Konkona: People made it officialAmol Parashar addressed rumours about his relationship with Konkona Sensharma, clarifying their public appearance was just a casual event with friends and family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/siima-2025-full-winners-list-allu-arjun-rashmika-mandanna-win-big-2782980-2025-09-06",
      "headline": "SIIMA 2025 full winners list: Allu Arjun, Rashmika Mandanna win bigThe South Indian International Movie Awards 2025 celebrated outstanding achievements in South Indian cinema, with 'Kalki 2898 AD' winning Best Film and multiple honours for 'Pushpa 2: The Rule'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/director-vikram-bhatts-mother-dies-at-85-after-prolonged-illness-report-2782978-2025-09-06",
      "headline": "Director Vikram Bhatt's mother dies at 85 after prolonged illness. ReportDirector-producer Vikram Bhatt's mother Varsha Bhatt died at 85 after a prolonged illness, according to reports. The family is yet to release an official statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-tanya-mittal-family-reacts-criticism-requests-kindness-humanity-2782961-2025-09-06",
      "headline": "Bigg Boss 19: Tanya Mittal's family reacts to criticism, requests people to be kind'Bigg Boss 19' contestant Tanya Mittal is currently at the centre of social media debates. Her parents have now appealed for fairness and asked viewers to reserve judgment until the show ends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/die-my-love-trailer-robert-pattinson-jennifer-lawrence-play-chaotic-couple-2782937-2025-09-06",
      "headline": "Die My Love trailer: Robert Pattinson, Jennifer Lawrence play a chaotic coupleLynne Ramsay has returned to direction with her new film 'Die My Love', featuring Jennifer Lawrence and Robert Pattinson. The movie shows a chaotic life of a couple living in rural Montana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-reacts-to-stepping-down-from-malayalam-film-body-it-was-time-to-move-on-2782968-2025-09-06",
      "headline": "Mohanlal reacts to stepping down from Malayalam film body: It was time to move onMohanlal resigned as AMMA president following criticism over the handling of sexual abuse complaints, clarifying his decision was a timely conclusion rather than a response to public pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/a-very-jonas-christmas-teaser-kevin-jonas-joe-jonas-nick-jonas-bring-holiday-mischief-to-screens-2782945-2025-09-06",
      "headline": "A Very Jonas Christmas teaser: The Jonas Brothers' festive fun is here to sleighThe Jonas Brothers have delighted fans with a sneak peek of their festive film 'A Very Jonas Christmas Movie', premiering on Disney+ this November. Featuring comedy, music, and family moments, the movie promises a joyous holiday experience with a star-studded cast and original songs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/nostalgia-save-theatres-bollywood-hollywood-bet-cinema-icons-meena-kumari-biopic-rocky-2782582-2025-09-06",
      "headline": "Can nostalgia save theatres? Bollywood-Hollywood bet on cinema icons and memoriesPop culture icons are the new flavour of the season in Indian cinema and Hollywood. Where is cinema headings with the announcement of Sourav Ganguly and Meena Kumari biopics, 'Rambo' origins story, 'I Play Rocky' and 'The Smashing Machine'? On Cinematic Saturday, we reflect on the future of storytelling as filmmakers recreate nostalgia to evoke audience emotions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhamaal-4-shoot-wrap-ajay-devgn-eid-2026-comedy-2782903-2025-09-06",
      "headline": "Dhamaal 4 shoot wraps up, set for Eid 2026 releaseActor Ajay Devgn has officially wrapped up 'Dhamaal 4' shoot in Mumbai after six months. The film promises a unique blend of comedy, drama and action for its Eid 2026 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/who-is-ashish-warang-remembering-the-marathi-actor-who-died-at-55-2782913-2025-09-06",
      "headline": "Who is Ashish Warang? Remembering the Marathi actor who died at 55Ashish Warang, a versatile actor known for his impactful supporting roles across Bollywood, Marathi and South Indian cinema, has died at 55. His memorable performances in films like 'Drishyam' and 'Sooryavanshi' will continue to be cherished by audiences and peers alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jonathan-bailey-announces-break-from-acting-2782902-2025-09-06",
      "headline": "Jonathan Bailey announces break from actingJonathan Bailey is taking a break from acting next year to focus on The Shameless Fund, an LGBTQ+ charity he founded. He was last seen in 'Jurassic World Rebirth'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/madharaasi-vs-ghaati-box-office-day-1-sivakarthikeyan-film-races-ahead-anushka-shetty-film-2782874-2025-09-06",
      "headline": "Madharaasi vs Ghaati box office Day 1: Sivakarthikeyan-Murugadoss film races aheadSivakarthikeyan's 'Madharaasi' has opened to a strong box office response, overshadowing Anushka Shetty's 'Ghaati' on its first day. Both films received mixed reviews. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-vs-bengal-files-box-office-day-1-tiger-shroff-actioner-dominates-vivek-agnihotri-film-lags-2782858-2025-09-06",
      "headline": "Baaghi 4 vs Bengal Files box office Day 1: Tiger Shroff's actioner dominates'Baaghi 4' and 'The Bengal Files' clashed at the box office with contrasting opening performances. While Tiger Shroff's action-packed 'Baaghi 4' impressed with strong collections, Vivek Agnihotri's complex drama struggled to make an impact amid stiff competition."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ukraine-government-building-in-kyiv-catches-fire-in-russian-attack-several-structures-destroyed-2783218-2025-09-07",
      "headline": "Key Ukraine government building gutted in fire in Russia's largest air strikeThree people, including an infant, were killed in Russia's overnight attacks on Kyiv, while 18 others were injured, Ukrainian officials said. Scores of buildings in the capital, including the seat of the government, were set ablaze. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-to-visit-flood-hit-punjab-gurdaspur-on-september-9-to-meet-families-review-relief-operations-2783221-2025-09-07",
      "headline": "PM Modi to visit flood-hit Punjab's Gurdaspur on September 9, to meet familiesSources said the Prime Minister is likely to stress the urgent need to strengthen embankments along the Sutlej, Beas, Ravi, and Ghaggar rivers, which have weakened over the years due to illegal mining and lack of maintenance, during his visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-aide-peter-navarro-tears-into-elon-musk-as-x-debunks-his-india-russia-post-on-oil-2783178-2025-09-07",
      "headline": "X fact checks Peter Navarro's India rants, he rants even morePeter Navarro, the White House trade adviser, who has for days targeted New Delhi over its energy purchases from Moscow, alleged that India was buying Russian oil \"purely to profit\" and to feed the Russian \"war machine\" in Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-amanda-anisimova-womens-singles-final-us-open-2783159-2025-09-07",
      "headline": "Aryna Sabalenka emulates Serena Williams to defend US Open crownUS Open 2025: World No.1 Aryna Sabalenka won the women's singles title after beating Amanda Anisimova of the United States in straight sets at the Arthur Ashe Stadium. With her defeat, Anisimova also lost back-to-back Grand Slam finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/prized-h1b-visa-us-donald-trump-ashes-indians-relations-india-immigrant-america-work-visas-rejected-2783066-2025-09-07",
      "headline": "The prized H-1B visa is nothing but ashesOnce the ultimate ticket to the American Dream, the H-1B visa stands vilified now. As the Trump administration cracks down, Indians with H-1B and jobs are scared to go to the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-expected-in-south-korea-next-month-meeting-with-xi-jinping-on-the-cards-glbs-2783172-2025-09-07",
      "headline": "Trump may meet China's Xi in South Korea next month, key talks on cards: ReportAccording to CNN, the White House is considering a bilateral meeting between Donald Trump and Xi Jinping on the sidelines of APEC, though no firm plans have been finalised. The talks are seen as potentially pivotal for trade and security relations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-asia-cup-india-vs-china-2783229-2025-09-07",
      "headline": "Back in form: India's clinical domination of ChinaIndia men's hockey team delivered a stunning 7-0 victory over China to reach the Asia Cup final. The dominant performance restored confidence ahead of a potentially tough final against Korea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/comeback-kid-congress-will-bihar-walk-rahul-gandhis-voter-adhikar-talk-2783078-2025-09-06",
      "headline": "Comeback kid Congress? Will Bihar walk Rahul Gandhi's Voter Adhikar talk?The Voter Adhikar Yatra, with Tejashwi Yadav and other INDIA leaders, may have just given the Congress what it lacked in the Bihar poll theatre: visibility and legitimacy\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/total-lunar-eclipse-to-turn-the-blood-moon-red-tonight-visible-in-these-cities-time-2783087-2025-09-07",
      "headline": "Total lunar eclipse tonight: Moon to turn blood-red for 82 minutesThis striking phenomenon, often referred to as a \"Blood Moon\", will last for an impressive 82 minutes, making it one of the longest total lunar eclipses of the decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-donald-trump-friends-india-us-relationship-thaw-amid-tariffs-trade-deal-2783022-2025-09-06",
      "headline": "India-US thaw incoming? Trump lowers offensive, PM 'deeply appreciates'Donald Trump appeared to break the ice amid the strain in India-US ties, harping on the strong personal bond between him and PM Modi. PM Modi was quick to respond. Is a thaw between India and the US incoming?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-asia-cup-2025-final-india-vs-korea-preview-world-cup-spot-2783177-2025-09-07",
      "headline": "Red-hot India eye WC spot and 4th Asia Cup title, but Korea stands in their wayThe Indian team have found form at the right time as they chase down a spot in next year's World Cup and aim for their fourth Asia Cup title on Sunday, September 7. But standing in their way will be defending champions, Korea, who have delivered the goods on big occasions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-lalbaugcha-raja-ganesh-visarjan-anant-ambani-reliance-maharashtra-2783193-2025-09-07",
      "headline": "Devotees bid farewell to Mumbai's Lalbaugcha Raja, grand immersion shortlyMumbai witnessed a sea of devotees braving rains on Sunday as they bid farewell to Lalbaugcha Raja during the grand Ganesh immersion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/how-pms-is-changing-for-gen-z-and-millennial-women-hustle-culture-2782571-2025-09-07",
      "headline": "Is hustle culture making your PMS worse?Hustle culture impacts women's bodies like a domino effect: more stress, more lifestyle issues, irregular menstrual cycles, and more intense PMS. Believe it or not, it's true. Experts decode the layers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/ashwini-ganapathi-india-fittest-woman-ultramarathon-safety-2782972-2025-09-07",
      "headline": "India is going through a running revolution, but are women safe?She's conquered ultras abroad, but India's roads remain her hardest race. Ultramarathon runner Ashwini Ganapathi speaks on fear, freedom, and reclaiming public space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/comedian-zakir-khan-announces-break-from-tour-says-been-unwell-for-an-year-2783217-2025-09-07",
      "headline": "Comedian Zakir Khan announces break, says been unwell for a yearStand-up comedian Zakir Khan has decided to take a break from his touring schedule to prioritise his health after a decade of rigorous performances across India. He will continue with a limited 'Papa Yaar India' tour starting October 2025, followed by a much-needed long break."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/thieves-attempt-robbery-madhya-pradesh-congress-president-home-indore-jitu-patwari-2783173-2025-09-07",
      "headline": "Caught on CCTV: Thieves break into Madhya Pradesh Congress chief's home, ransackMasked men allegedly attempted a robbery at Madhya Pradesh Congress chief Jitu Patwari's Indore residence, with the party slamming the BJP government over deteriorating law and order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pune-college-student-dances-to-dupatta-mera-in-viral-video-internet-cant-look-away-2783038-2025-09-06",
      "headline": "Internet can't look away from viral video of Pune student performing at college festIn the video, Ritesh takes centre stage with a remix of three songs – 'Dupatta Mera', 'Jigar Da Tukda', and 'Shaky'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-520-05-09-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-yamuna-recedes-but-stays-above-danger-mark-flood-alert-continues-2783240-2025-09-07",
      "headline": "Yamuna recedes, but stays above danger mark; flood alert continuesThe Yamuna in Delhi was recorded at 205.56 metres on Sunday morning, below the evacuation mark but still above the danger level. Low-lying areas remain inundated, with relief camps set up as fresh discharges from upstream barrages keep the city on alert."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/when-bengal-assembly-turned-ground-zero-of-mamata-bjp-war-2783103-2025-09-06",
      "headline": "When Bengal assembly turned Ground Zero of Mamata-BJP warThe Trinamool-BJP battle in the run-up to the Bengal assembly polls is taking the shape of a bitter face-off over Bangla identity, history and the very right to speak the language\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-slays-in-silver-at-birmingham-event-fans-flock-in-a-flurry-2783228-2025-09-07",
      "headline": "Kareena Kapoor slays in silver at Birmingham event, fans flock in a flurryBollywood icon Kareena Kapoor Khan created a buzz in Birmingham as she dazzled fans at a store launch, charming the crowd with her elegance and warmth. Several videos and pictures from the event went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-lieutenant-parul-dhadwal-becomes-first-woman-officer-to-join-army-from-5th-generation-army-family-2783006-2025-09-06",
      "headline": "Lt Parul Dhadwal etches history, becomes 5th-gen officer from family to join ArmyLt Parul Dhadwal has become the first woman officer from a five-generation military family, commissioned into the Army Ordnance Corps and awarded the President's Gold Medal for topping her course at Officers Training Academy Chennai. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/dust-of-bihar-politics-too-much-bjp-ridicules-rahul-gandhis-malaysia-trip-2783141-2025-09-06",
      "headline": "Dust of Bihar politics too much? BJP ridicules Rahul Gandhi's Malaysia tripTime and again, the BJP has targeted Rahul Gandhi's foreign trips, particularly during Parliament sessions or amid election campaigns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-sent-me-his-fitness-test-scores-from-london-sunil-chhetri-2783251-2025-09-07",
      "headline": "Virat Kohli sent me his fitness test scores from London: Sunil ChhetriSunil Chhetri revealed that Virat Kohli shared his fitness test scores from London. Recently, reports claimed that Kohli underwent his pre-season mandatory fitness test in London, unlike other players who gave it at the BCCI Centre of Excellence in Bengaluru."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-south-africa-wtc-2025-27-tests-t20is-odis-faisalabad-odi-return-2783256-2025-09-07",
      "headline": "Pakistan to start WTC 2025-27 cycle with two-match series against South AfricaPakistan will host South Africa in their opening series of the World Test Championship (WTC)2025-27. Faisalabad is set to host its first ODI in 17 years, marking a significant return of international cricket to the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-aryna-sabalenka-champagne-war-2783252-2025-09-07",
      "headline": "Watch: Aryna Sabalenka's champagne war with team after US Open victoryUS Open champion Aryna Sabalenka celebrated her victory in style. She and her team got into a champagne-spraying war inside the women's locker room."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-sent-me-his-fitness-test-scores-from-london-sunil-chhetri-2783251-2025-09-07",
      "headline": "Virat Kohli sent me his fitness test scores from London: Sunil ChhetriSunil Chhetri revealed that Virat Kohli shared his fitness test scores from London. Recently, reports claimed that Kohli underwent his pre-season mandatory fitness test in London, unlike other players who gave it at the BCCI Centre of Excellence in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-asia-cup-india-vs-china-2783229-2025-09-07",
      "headline": "Back in form: India's clinical domination of ChinaIndia men's hockey team delivered a stunning 7-0 victory over China to reach the Asia Cup final. The dominant performance restored confidence ahead of a potentially tough final against Korea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/rampant-india-storm-into-asia-cup-2025-final-favourites-against-korea-2783235-2025-09-07",
      "headline": "Rampant India storm into Asia Cup 2025 final, favourites against KoreaThe Indian team produced their best performance in the Asia Cup 2025 so far as they demolished China 7-0 on Saturday, September 6. With form on their side and plans falling into place, the hosts enter the final in Rajgir on Sunday as strong favourites against Korea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jitesh-sharma-preferred-over-sanju-samson-asia-cup-2025-2783227-2025-09-07",
      "headline": "Jitesh Sharma likely to be picked over Samson in India's Asia Cup opener: ReportJitesh Sharma is likely to be picked over Sanju Samson for India's opening fixture in the Asia Cup 2025 against the UAE as Shubman Gill will return to open the innings alongside Abhishek Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-jasprit-bumrah-return-t20i-2783220-2025-09-07",
      "headline": "Reinvigorated Jasprit Bumrah ready for some T20I action after over 1 yearIndia pace spearhead Jasprit Bumrah has not play a T20I game in over an year. He speaks about his return and how a short break after the England series has helped him rest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/how-much-money-does-bcci-earn-2783203-2025-09-07",
      "headline": "BCCI doubles revenue, adds Rs 14,627 crore in 5 years: ReportThe Indian Cricket Board might be in a difficult space with the sponsorship debacle right now, but it has steadily strengthened its coffers over the last five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-defends-us-open-title-emotional-win-2025-2783195-2025-09-07",
      "headline": "Champagne and tears: Sabalenka's emotional roller coaster after US Open winUS Open champion Aryna Sabalenka celebrated her victory in style. She made an unique entry into the press conference, and the spoke in depth about what motivates and inspires her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/ashwini-ganapathi-india-fittest-woman-ultramarathon-safety-2782972-2025-09-07",
      "headline": "India is going through a running revolution, but are women safe?She's conquered ultras abroad, but India's roads remain her hardest race. Ultramarathon runner Ashwini Ganapathi speaks on fear, freedom, and reclaiming public space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-asia-cup-2025-final-india-vs-korea-preview-world-cup-spot-2783177-2025-09-07",
      "headline": "Red-hot India eye WC spot and 4th Asia Cup title, but Korea stands in their wayThe Indian team have found form at the right time as they chase down a spot in next year's World Cup and aim for their fourth Asia Cup title on Sunday, September 7. But standing in their way will be defending champions, Korea, who have delivered the goods on big occasions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-jasprit-bumrah-return-t20i-2783220-2025-09-07",
      "headline": "Reinvigorated Jasprit Bumrah ready for some T20I action after over 1 yearIndia pace spearhead Jasprit Bumrah has not play a T20I game in over an year. He speaks about his return and how a short break after the England series has helped him rest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/how-much-money-does-bcci-earn-2783203-2025-09-07",
      "headline": "BCCI doubles revenue, adds Rs 14,627 crore in 5 years: ReportThe Indian Cricket Board might be in a difficult space with the sponsorship debacle right now, but it has steadily strengthened its coffers over the last five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-defends-us-open-title-emotional-win-2025-2783195-2025-09-07",
      "headline": "Champagne and tears: Sabalenka's emotional roller coaster after US Open winUS Open champion Aryna Sabalenka celebrated her victory in style. She made an unique entry into the press conference, and the spoke in depth about what motivates and inspires her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/ashwini-ganapathi-india-fittest-woman-ultramarathon-safety-2782972-2025-09-07",
      "headline": "India is going through a running revolution, but are women safe?She's conquered ultras abroad, but India's roads remain her hardest race. Ultramarathon runner Ashwini Ganapathi speaks on fear, freedom, and reclaiming public space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-asia-cup-2025-final-india-vs-korea-preview-world-cup-spot-2783177-2025-09-07",
      "headline": "Red-hot India eye WC spot and 4th Asia Cup title, but Korea stands in their wayThe Indian team have found form at the right time as they chase down a spot in next year's World Cup and aim for their fourth Asia Cup title on Sunday, September 7. But standing in their way will be defending champions, Korea, who have delivered the goods on big occasions. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}