{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gandhi-jayanti-2025-stock-market-holiday-nse-bse-open-or-close-dussehra-october-2-sensex-nifty-2796520-2025-10-02",
      "headline": "Market holiday: Are NSE, BSE open on Gandhi Jayanti, Dussehra on October 2?Sensex and Nifty gained nearly 1% in the last session after the Reserve Bank of India (RBI) kept the repo rate unchanged at 5.5% and maintained its neutral stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-ceo-satya-nadella-shifts-focus-to-ai-elevates-judson-althoff-to-lead-commercial-unit-2796469-2025-10-01",
      "headline": "Satya Nadella bets big on AI, names Judson Althoff to lead Microsoft commercial unitMicrosoft has elevated Chief Commercial Officer Judson Althoff as CEO of its commercial business, allowing Satya Nadella to focus on AI, datacenter buildout, and product innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-the-price-of-gold-keeps-breaking-records-business-news-2796426-2025-10-01",
      "headline": "Why the price of gold keeps breaking recordsBullion has soared more than 45% this year, putting it on track for the biggest annual gain since 1979.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adar-poonawalla-in-talks-to-buy-royal-challengers-bangalore-rcb-stake-united-spirits-shares-update-2796326-2025-10-01",
      "headline": "Adar Poonawalla in talks to buy RCB stake? United Spirits shares updateThe CEO of Serum Institute, Adar Poonawalla, is in talks with Diageo to purchase a stake in RCB, one of the Indian Premier League's top teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/are-festive-cheer-and-auto-stocks-driving-the-market-rally-heres-what-expert-says-2796279-2025-10-01",
      "headline": "Are festive cheer and auto stocks driving the market rally?The stock market showed renewed strength, as festive season cheer and gains in auto stocks lifted investor sentiment across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/da-hike-58-percent-government-employee-salary-rise-how-to-calculate-diwali-gift-arrears-2796256-2025-10-01",
      "headline": "DA hiked to 58%: What it means for government employees' salary and pensionThe Union Cabinet approved the proposal to increase the DA for central government employees and Dearness Relief (DR) for pensioners by 3%. With this revision, the DA rate now stands at 58%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-716-points-higher-nifty-above-24800-tata-motors-up-5-percent-2796231-2025-10-01",
      "headline": "Sensex ends 716 points higher, Nifty above 24,800; Tata Motors up 5%The S&P BSE Sensex jumped 715.64 points to end at 80,983.31, while the NSE Nifty50 added 225.20 points to close at 24,836.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/this-indian-gold-lender-holds-3-times-the-gold-of-pakistan-muthoot-finance-2796225-2025-10-01",
      "headline": "This Indian gold lender holds 3 times the gold of PakistanThe country's largest gold loan provider, currently holds 209 tonnes of gold in its safe deposit boxes. This is three times the gold reserves of Pakistan and higher than the reserves of Brazil, Australia, and South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mukesh-ambani-tops-hurun-rich-list-2025-shah-rukh-khan-joins-billionaire-club-2796169-2025-10-01",
      "headline": "Shah Rukh Khan joins billionaire club, Mukesh Ambani tops Hurun India Rich ListMukesh Ambani has reclaimed the top spot on the Hurun India Rich List 2025, while Bollywood superstar Shah Rukh Khan joins the billionaire club for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-why-reason-sensex-600-points-nifty-jump-rbi-mpc-auto-shares-tata-motors-2796146-2025-10-01",
      "headline": "Sensex jumps 500 points: 3 reasons why markets are rising todayThe S&P BSE Sensex surged 660.64 points to 80,928.26, while the NSE Nifty50 rose 185.70 points to 24,796.80 as of 12:10 PM. The rally was broad-based on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-set-to-approve-da-hike-for-employees-and-pensioners-today-sources-2796115-2025-10-01",
      "headline": "Union Cabinet approves 3% DA hike for central government employeesEarlier this year, the government had approved a 2% increase in DA in March, raising it from 53% to 55% of the basic salary and pension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-announces-big-push-for-business-reforms-and-easier-lending-details-here-2796075-2025-10-01",
      "headline": "RBI announces big push for business reforms and easier lending. Details hereThe Reserve Bank of India has unveiled a set of measures aimed at making it easier for businesses to operate and improving access to loans. The reforms are expected to help companies, exporters, and banks alike."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-rishab-shetty-craftsmanship-cultural-impact-karnataka-2796542-2025-10-02",
      "headline": "Kantara Chapter 1 X reviews: Fans call Rishab Shetty film a divine roar 'Kantara: Chapter 1' has received spectacular reviews on X, with fans praising Rishab Shetty's masterful storytelling and immersive cinematic experience. The film has created a 'divine roar' among audiences, resonating deeply with cultural pride and raising high expectations for its success in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sunny-sanskari-ki-tulsi-kumari-review-varun-dhawan-janhvi-kapoor-rom-com-2796536-2025-10-02",
      "headline": "Sunny Sanskari Ki review: Varun leads a shaky front in this lukewarm rom-comRelease Date:Thu Oct 02, 2025 Sunny Sanskari Ki Tulsi Kumari movie review: Varun Dhawan and Shashank Khaitan reunite for 'Sunny Sanskari Ki Tulsi Kumari', a rom-com mixing classic Bollywood style with modern humour. The film entertains with witty dialogues but stumbles with a rushed climax and awkward scenes, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kantara-chapter-1-review-rishab-shetty-folklore-saga-is-a-spellbinding-spectacle-rukmini-vasanth-jayaram-2796510-2025-10-02",
      "headline": "Kantara Chapter 1 review: Rishab Shetty's folklore saga is a spellbinding spectacleRelease Date:Thu Oct 02, 2025 Kantara Chapter 1 movie review: Director, writer, and actor Rishab Shetty's film, also starring Rukmini Vasanth and Jayaram, explores the man vs nature conflict and land rights, blending them with divinity, folklore, myth, and faith. The film is a brilliant cinematic showcase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-shares-vacation-photos-with-partner-saba-azad-fourth-anniversary-2796411-2025-10-01",
      "headline": "Hrithik Roshan shares vacation photos with partner Saba Azad on fourth anniversary Actor Hrithik Roshan marked his fourth anniversary with partner Saba Azad by sharing heartfelt note and vacation pictures. The post sparked warm reactions on social media, highlighting the couple's affectionate bond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/frankenstein-trailer-creature-jacob-elordi-unleashes-rage-on-creator-oscar-issac-2796374-2025-10-01",
      "headline": "Frankenstein trailer: Creature Jacob Elordi unleashes rage on creator Oscar Issac The trailer of director Guillermo del Toro's 'Frankenstein' was released by Netflix on October 1, 2025. The film features Oscar Isaac and Jacob Elordi and reimagines Mary Shelley's classic tale with a modern twist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/priya-marathe-husband-shantanu-shares-heartfelt-note-a-month-after-her-death-2796369-2025-10-01",
      "headline": "Priya Marathe's husband Shantanu shares heartfelt note a month after her death Actor Shantanu Moghe posted an emotional message marking a month since Priya Marathe's death. Priya Marathe, known for 'Pavitra Rishta', died after battling cancer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-sirish-engagement-nayanika-grandfather-birth-anniversary-2796373-2025-10-01",
      "headline": "Allu Arjun's brother Allu Sirish announces engagement to Nayanika in October Actor Allu Sirish announced his engagement to Nayanika on October 1, the birth anniversary of his grandfather, actor Allu Ramalingaiah. His brother Allu Arjun, shared a congratulatory post on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/which-marvel-actor-stars-in-jason-statham-the-beekeeper-2-find-out-here-2796380-2025-10-01",
      "headline": "Which Marvel actor stars in Jason Statham's The Beekeeper 2? Find out here Apart from new additions to the cast, Jason Statham's The Beekeeper 2 will bring back Jeremy Irons, Jemma Redgrave and Emmy Raver-Lampman in familiar roles from the first film"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-sanskari-ki-tulsi-kumari-box-office-day-1-advance-booking-2796344-2025-10-01",
      "headline": "Sunny Sanskari vs Kantara Chapter 1: Varun-Janhvi film trails in advance booking 'Sunny Sanskari Ki Tulsi Kumari' is set for a Rs 2 crore opening. The film faces stiff competition from actor-director Rishab Shetty's 'Kantara: Chapter 1' at the box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bigg-boss-19-leads-ott-non-fiction-viewership-rise-and-fall-second-on-chart-2796312-2025-10-01",
      "headline": "Bigg Boss 19 leads OTT non-fiction with 7.5 million weekly views 'Bigg Boss 19', hosted by Salman Khan, became the most watched reality show on OTT for the week of September 22-28, 2025, with 7.5 million views. The second most-watched on the list was 'Rise & Fall'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-contestant-quits-at-rs-1-crore-question-2796280-2025-10-01",
      "headline": "KBC 17: Contestant quits at Rs 1 crore question, can you answer it? Kaun Banega Crorepati 17 contestant Kailash Rambhau Kuntewad won Rs 50 lakh after quitting the Rs 1 crore question on Amitabh Bachchan's quiz show.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/13th-review-kota-factory-dejavu-with-a-twist-of-corporate-drama-paresh-pahuja-2796287-2025-10-01",
      "headline": "13th review: Kota Factory déjà vu with a twist of corporate dramaRelease Date:Wed Oct 01, 2025 Beyond Kota's grind and IIT's glory, SonyLiv's latest series '13th: Some Lessons Aren't Taught in Classrooms' celebrates mentorship, integrity, and the power of learning that outlives any test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/they-call-him-og-pawan-kalyan-film-adds-new-neha-shetty-dance-track-2796259-2025-10-01",
      "headline": "They Call Him OG: Pawan Kalyan's film adds a new Neha Shetty dance track Neha Shetty's dance track 'Kiss Kiss Bang Bang' has been added to 'They Call Him OG' from Tuesday evening shows. The move aims to boost theatre footfall during Dasara after ticket price normalisation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-taj-story-poster-controversy-shiva-temple-claims-paresh-rawal-2796245-2025-10-01",
      "headline": "Explained: Taj Mahal controversy reignited by The Taj Story poster row Taj Mahal's origins spark fresh debate after Paresh Rawal's 'The Taj Story' poster depicts a Shiva idol inside the monument. Here's why the poster is raising storm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/song-kang-completes-military-service-considers-four-hands-drama-2796242-2025-10-01",
      "headline": "Song Kang completes military service, to star in musical drama Four Hands South Korean actor Song Kang was discharged from military service on October 1, 2025. He is reviewing an offer for the lead in the upcoming drama 'Four Hands'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-reacts-hilariously-to-viral-reel-calling-her-films-brainrot-core-2796016-2025-10-01",
      "headline": "Farah Khan reacts hilariously to viral reel calling her films brainrot core Filmmaker Farah Khan reacted with humour to a viral reel calling her films 'Om Shanti Om', 'Happy New Year', and 'Tees Maar Khan' \"brain rot core,\" asking, \"Is brain rot a compliment??\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/balika-se-vadhu-tak-avika-gor-shares-pics-from-wedding-with-milind-chandwani-2796246-2025-10-01",
      "headline": "Balika se vadhu tak: Avika Gor shares pics from wedding with Milind Chandwani Actor Avika Gor recently shared pictures from her wedding with Milind Chandwani. The couple got married on the 'Pati Patni Aur Panga' sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rani-mukerji-comments-eight-hour-work-shift-debate-bollywood-2796171-2025-10-01",
      "headline": "Rani Mukerji on Deepika's 8-hour rule: Worked 6–7 hours while breastfeeding Adira Actor Rani Mukerji recently weighed in on the 8-hour working shift and explained how such things can be sorted out with proper conversation. Mukerji also recalled her motherhood experience with daughter Adira.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-advance-bookings-rishab-shetty-movie-earns-rs-18-crore-2796195-2025-10-01",
      "headline": "Kantara Chapter 1: How much did Rishab Shetty's film earn through advance booking? Rishab Shetty's 'Kantara Chapter 1' has collected over Rs 11 crore (without block seats) in advance bookings ahead of its October 2 release. The film's strong regional appeal highlights growing interest in historical narratives from coastal Karnataka."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-asim-munir-photo-trump-rare-earth-minerals-criticism-senator-salesman-2796540-2025-10-02",
      "headline": "What a joke: Pak Army chief faces flak at home over rare earth pic with TrumpThe blowback indicates simmering discontent inside Pakistan over growing involvement of the military in diplomacy, which is primarily carried out by civilian leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/rashtriya-swayamsevak-sangh-centenary-vijayadashami-nation-building-2047-mohan-bhagwat-narendra-modi-2796425-2025-10-02",
      "headline": "RSS: 100 years of service to the nationThe Rashtriya Swayamsevak Sangh (RSS) marks its centenary on Vijayadashami, celebrating a century of nation-building, social harmony, and service through its ideals of character-building and seva. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kantara-chapter-1-review-rishab-shetty-folklore-saga-is-a-spellbinding-spectacle-rukmini-vasanth-jayaram-2796510-2025-10-02",
      "headline": "Kantara Chapter 1 review: Rishab Shetty's folklore saga is a spellbinding spectacle  Live UpdatesKantara Chapter 1 movie review: Director, writer, and actor Rishab Shetty's film, also starring Rukmini Vasanth and Jayaram, explores the man vs nature conflict and land rights, blending them with divinity, folklore, myth, and faith. The film is a brilliant cinematic showcase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/i-thought-it-was-over-jimmy-kimmel-opens-up-about-abcs-last-minute-suspension-glbs-2796537-2025-10-02",
      "headline": "I thought it was over: Jimmy Kimmel opens up about being taken off airSpeaking on The Late Show with Stephen Colbert on Tuesday night, Kimmel recounted learning about the suspension just 90 minutes before taping was scheduled to begin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-becomes-first-person-to-hit-usd-500-billion-net-worth-forbes-list-shows-glbs-2796524-2025-10-02",
      "headline": "Elon Musk becomes first person to hit $500 billion net worth, Forbes list showsElon Musk's net worth hit USD 499.5 billion on Wednesday, driven by Tesla's stock rebound and rising valuations of SpaceX and xAI, making him the first person to approach a half-trillion fortune."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-stops-gaza-aid-flotilla-vessels-greta-thunberg-others-are-safe-glbs-2796525-2025-10-02",
      "headline": "Israeli military diverts Gaza aid flotilla vessels with Greta Thunberg aboardThe Israeli foreign ministry shared a post on X saying Swedish climate activist Greta Thunberg and other passengers were \"safe and healthy,\" alongside a video that appeared to show Thunberg with masked and armed Israeli personnel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/living-like-a-mahatma-sadhguru-opinion-2796370-2025-10-02",
      "headline": "Living like a MahatmaMahatma Gandhi developed a certain level of relentless commitment to a cause and rose like a colossus. The man went on to move millions of people. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-1st-test-ahmedabad-preview-shubman-gill-restore-home-dominance-2796430-2025-10-01",
      "headline": "IND v WI, 1st Test: Shubman Gill's India aim to reignite home dominanceIND vs WI, 1st Test preview: India will head into a home Test series without Rohit Sharma, Virat Kohli and R Ashwin for the first time in more than a decade. With the scars of a 0-3 loss to New Zealand still remaining fresh, Shubman Gill and his men will not take the West Indies lightly. With wet weather forecast, the conditions in Ahmedabad may not be straightforward. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/the-curious-case-of-ladakhs-pregnancy-tourism-aryan-race-2796175-2025-10-01",
      "headline": "The curious case of Ladakh's 'pregnancy tourism'The concept of pregnancy tourism takes a complete U-turn when you head deep into Ladakh's Aryan Valley, where the narrative around the phenomenon has little to do with a better life or social benefits. Here, the story is tangled up in myth, folklore, and a lingering obsession with \"racial purity.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-mid-air-fight-uttar-pradesh-mla-rakesh-pratap-singh-passenger-clash-over-foul-language-2796552-2025-10-02",
      "headline": "Air India flight sees mid-air fight as MLA, passenger clash over foul languageThe incident took place on Tuesday aboard flight AI-837. Rakesh Pratap Singh, a Samajwadi Party MLA from Gauriganj who was expelled in June for anti-party activities, objected to passenger Samad Ali allegedly using foul language while talking on the phone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sunny-sanskari-ki-tulsi-kumari-review-varun-dhawan-janhvi-kapoor-rom-com-2796536-2025-10-02",
      "headline": "Sunny Sanskari Ki review: Varun leads a shaky front in this lukewarm rom-comRelease Date:Thu Oct 02, 2025Sunny Sanskari Ki Tulsi Kumari movie review: Varun Dhawan and Shashank Khaitan reunite for 'Sunny Sanskari Ki Tulsi Kumari', a rom-com mixing classic Bollywood style with modern humour. The film entertains with witty dialogues but stumbles with a rushed climax and awkward scenes, says our review."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/man-objects-to-daughter-in-laws-durga-puja-dance-son-wife-beat-him-to-death-2796545-2025-10-02",
      "headline": "Man objects to daughter-in-law's Durga Puja dance; son, wife beat him to deathA 62-year-old man was killed in Mauganj district by his own family after tryin to stop his daughter-in-law from dancing at a Durga pandal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-soybean-farmers-hurt-due-to-china-will-meet-xi-jinping-in-4-weeks-says-trump-2796484-2025-10-01",
      "headline": "Trump to meet Xi in four weeks, promises aid to US farmers amid tariff warDonald Trump said he will meet Xi Jinping in four weeks, with soybeans set to be a major topic. Trump accused China of halting purchases for negotiating reasons and vowed tariff revenues would support US farmers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/i-love-muhammad-row-bareilly-congress-mps-danish-ali-imran-masood-claim-house-arrest-situation-tense-police-deployment-2796538-2025-10-02",
      "headline": "'I Love Muhammad' row: More arrests in Bareilly, Congress MP under house arrestSince the September 26 violence in Bareilly, 81 people have been arrested, while additional police reinforcements have been deployed across the city until October 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/for-the-sake-of-kids-society-reality-of-silent-divorces-in-indian-homes-2796119-2025-10-01",
      "headline": "Married, but no connection: Reality of silent divorces in Indian homesSilent divorce is the reality of many Indian households. On paper and in society's eyes, couples remain married, but behind closed doors there is no emotional or physical connection. Rarely acknowledged, this situation often leaves people bitter, fuels mental health struggles, and has long-term consequences for children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-allows-shops-to-stay-open-247-bars-liquor-outlets-excluded-2796436-2025-10-01",
      "headline": "Maharashtra allows shops to stay open 24/7; bars, liquor outlets excludedMaharashtra government has allowed shops and establishments to operate 24/7, excluding liquor outlets. The move aims to boost business activity and ensure flexibility across the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/leave-now-or-be-considered-terrorists-israel-warns-palestinians-in-gaza-city-glbs-2796526-2025-10-02",
      "headline": "Leave now or be considered terrorists, Israel warns Palestinians in Gaza CityIsrael ordered all Palestinians to evacuate Gaza City, warning holdouts would face its offensive. The order comes as Hamas weighs US President Trump's peace plan, which has drawn skepticism from Egypt and Qatar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/deeply-ironic-to-lecture-on-human-rights-india-slams-pakistan-at-unhrc-glbs-2796534-2025-10-02",
      "headline": "Deeply ironic to lecture on human rights: India slams Pakistan at UNHRCAt the 34th meeting of the UNHRC's 60th session in Geneva on Wednesday, Indian diplomat Mohammed Hussain called out Islamabad's hypocrisy in unusually sharp terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/stress-screens-millennial-employees-face-70-percent-spike-in-heart-disease-risk-2796250-2025-10-02",
      "headline": "Stress, screens: Millennial employees face 70% spike in heart disease riskAccording to an analysis of over 30,000 employees, heart disease cases have risen by 40%, with chronic stress and demanding work schedules identified as major contributors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-unveils-rs-100-coin-at-rss-event-bharat-mata-features-on-currency-for-1st-time-2796381-2025-10-01",
      "headline": "PM unveils Rs 100 coin at RSS event, Bharat Mata features on currency for 1st timeThe Rs 100 coin features the national emblem on one side, while the other side depicts a majestic image of Bharat Mata in Varada Mudra, a gesture of offering with the palm outward, accompanied by a lion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/indian-origin-couple-deliberately-starved-3-yr-old-daughter-to-death-uk-court-glbs-2796519-2025-10-02",
      "headline": "Indian-origin couple deliberately starved 3-year-old daughter to death: UK courtManpreet Jatana, 34, and Jaskiret Singh Uppal, 36, appeared at the Old Bailey criminal court on Tuesday charged with the murder of their daughter, Penelope Chandrie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/over-400-arrested-300-injured-after-genz-led-protests-morocco-turn-violent-glbs-2796530-2025-10-02",
      "headline": "Over 400 arrested, 300 injured after GenZ-led protests in Morocco turn violentThe demonstrations, which were not authorised by authorities, entered their fourth straight day on Tuesday. According to news agency AFP, protests were organised at the call of GenZ 212, a newly formed online collective that operates mainly through Discord. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/leonardo-dicaprio-pays-tribute-to-primatologist-jane-goodall-2796562-2025-10-02",
      "headline": "Lost a true hero: Leonardo DiCaprio pays tribute to primatologist Jane GoodallLeonardo DiCaprio paid an emotional tribute to legendary primatologist Jane Goodall, who died at 91, calling her \"a true hero for the planet.\" The two shared a long friendship rooted in their passion for conservation and environmental advocacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-rishab-shetty-craftsmanship-cultural-impact-karnataka-2796542-2025-10-02",
      "headline": "Kantara Chapter 1 X reviews: Fans call Rishab Shetty film a divine roar'Kantara: Chapter 1' has received spectacular reviews on X, with fans praising Rishab Shetty's masterful storytelling and immersive cinematic experience. The film has created a 'divine roar' among audiences, resonating deeply with cultural pride and raising high expectations for its success in Indian cinema."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-weat-indies-1st-test-live-score-shubman-gill-roston-chase-ahmedabad-2796548-2025-10-02",
      "headline": "1st Test Live: Shubman Gill's India begin home season vs West Indies India (IND) vs West Indies (WI), Live Score 1st Test: Shubman Gill's India are playing their first home Test of the season against West Indies. This is the first home game India play after their disaster against New Zealand last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-unsold-ilt20-auction-bbl-scheduling-clash-2796514-2025-10-02",
      "headline": "Why did Ravichandran Ashwin go unsold in ILT20 auction: Explained Ravichandran Ashwin went unsold in the ILT20 auction, surprising many cricket fans and experts. His decision to prioritise the Big Bash League suggests strategic planning amid scheduling conflicts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-indias-spin-attack-prepared-after-r-ashwin-jadeja-kuldeep-2796490-2025-10-02",
      "headline": "IND vs WI: Is India's spin attack prepared for life after R Ashwin? India are set to embark on a new era at home as they face the West Indies in a two-Test series after the retirement of Ravichandran Ashwin. His absence has left a big void, but the series presents an opportunity for a new generation of spinners to rise and restore India's home dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-dhruv-jurel-specialist-batter-rishabh-pant-absence-backup-ahmedabad-2796511-2025-10-02",
      "headline": "In Pant's absence, Dhruv Jurel given a chance to prove he's not just a backup keeper In the absence of Rishabh Pant, Dhruv Jurel comes in red-hot form and has an opportunity to prove that there is more to his game than just being a backup-keeper in the Test team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-are-west-indies-players-vs-india-test-series-2796522-2025-10-02",
      "headline": "Can the new-look West Indies trouble Shubman Gill's India? Roston Chase's West Indies arrives in India for a two-match Test series at a time when India, under Shubman Gill, appear more vulnerable at home than they have in years. But do the Caribbean visitors have the firepower to take advantage?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-century-new-zealand-fight-icc-womens-world-cup-opener-loss-australia-2796483-2025-10-01",
      "headline": "I'd throw it all away to win: Sophie Devine reflects on bittersweet loss vs Australia Sophie Devine scored a heroic 111 runs in New Zealand's ICC Women's World Cup opener against Australia. Despite her effort, New Zealand fell short chasing 327, highlighting the challenge posed by the defending champions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-1st-test-livestreaming-and-broadcast-details-2796480-2025-10-01",
      "headline": "India vs West Indies 1st Test livestreaming details: When and where to watch? India begin a new chapter in their Test history as Shubman Gill is set to lead the team in a home series against West Indies, beginning on October 2 at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-century-australia-beat-new-zealand-womens-world-cup-2025-2796462-2025-10-01",
      "headline": "Women's World Cup: Australia start title defence with 89-run win over New Zealand Australia got their title defence off to a winning start in the Women's World Cup 2025, with a massive 89-run victory over New Zealand in Indore. Sophie Devine's remarkable century ended in vain as New Zealand crumbled under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-sg-pipers-2796442-2025-10-01",
      "headline": "SG Pipers stick with youth, but tweak formula for new HIL season The SG Pipers were known to be a team that remained committed on the future but the mini-auction saw them make a tweak to their mantra. Balance was key as experienced stars like Rupinder Pal Singh and Udita joined the fray to make the men's and women's teams stronger. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/balance-and-belief-fatima-sana-eyes-strong-start-in-pakistans-world-cup-campaign-2796432-2025-10-01",
      "headline": "Balance and belief: Fatima Sana eyes strong start in Pakistan's World Cup campaign Pakistan skipper Fatima Sana stresses calmness, spin strength and senior batting support as key pillars of their Women's World Cup campaign, aiming to turn belief into consistent performances on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-1st-test-ahmedabad-preview-shubman-gill-restore-home-dominance-2796430-2025-10-01",
      "headline": "IND v WI, 1st Test: Shubman Gill's India aim to reignite home dominance IND vs WI, 1st Test preview: India will head into a home Test series without Rohit Sharma, Virat Kohli and R Ashwin for the first time in more than a decade. With the scars of a 0-3 loss to New Zealand still remaining fresh, Shubman Gill and his men will not take the West Indies lightly. With wet weather forecast, the conditions in Ahmedabad may not be straightforward. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-1st-test-livestreaming-and-broadcast-details-2796480-2025-10-01",
      "headline": "India vs West Indies 1st Test livestreaming details: When and where to watch? India begin a new chapter in their Test history as Shubman Gill is set to lead the team in a home series against West Indies, beginning on October 2 at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-century-australia-beat-new-zealand-womens-world-cup-2025-2796462-2025-10-01",
      "headline": "Women's World Cup: Australia start title defence with 89-run win over New Zealand Australia got their title defence off to a winning start in the Women's World Cup 2025, with a massive 89-run victory over New Zealand in Indore. Sophie Devine's remarkable century ended in vain as New Zealand crumbled under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-sg-pipers-2796442-2025-10-01",
      "headline": "SG Pipers stick with youth, but tweak formula for new HIL season The SG Pipers were known to be a team that remained committed on the future but the mini-auction saw them make a tweak to their mantra. Balance was key as experienced stars like Rupinder Pal Singh and Udita joined the fray to make the men's and women's teams stronger. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/balance-and-belief-fatima-sana-eyes-strong-start-in-pakistans-world-cup-campaign-2796432-2025-10-01",
      "headline": "Balance and belief: Fatima Sana eyes strong start in Pakistan's World Cup campaign Pakistan skipper Fatima Sana stresses calmness, spin strength and senior batting support as key pillars of their Women's World Cup campaign, aiming to turn belief into consistent performances on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-1st-test-ahmedabad-preview-shubman-gill-restore-home-dominance-2796430-2025-10-01",
      "headline": "IND v WI, 1st Test: Shubman Gill's India aim to reignite home dominance IND vs WI, 1st Test preview: India will head into a home Test series without Rohit Sharma, Virat Kohli and R Ashwin for the first time in more than a decade. With the scars of a 0-3 loss to New Zealand still remaining fresh, Shubman Gill and his men will not take the West Indies lightly. With wet weather forecast, the conditions in Ahmedabad may not be straightforward. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}