{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharama-asks-banks-to-stay-on-alert-amid-rising-indo-pak-tensions-2722375-2025-05-09",
      "headline": "Nirmala Sitharama asks banks to stay on alert amid rising Indo-Pak tensionsThe directive comes a day after India successfully intercepted multiple missile and drone attacks launched from Pakistan late on May 8. While India reported no major damage, the government has since asked all critical institutions to bolster their cybersecurity infrastructure in anticipation of potential retaliatory attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/go-homestays-cuts-ties-with-turkish-airlines-over-anti-india-stand-2722299-2025-05-09",
      "headline": "'Unsupportive stance towards India': Go Homestays ends ties with Turkish AirlinesGo Homestays ends ties with Turkish Airlines after Turkey backs Pakistan following 'Operation Sindoor'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/india-pak-tensions-oil-psus-assure-ample-fuel-stocks-urge-against-panic-buying-2722194-2025-05-09",
      "headline": "India-Pak tensions: Oil PSUs assure ample fuel stocks, urge against panic buyingIndian oil companies have issued statements assuring ample fuel stocks across the country. The Indian Oil Corporation and Bharat Petroleum Corporation Limited have emphasised that there is no shortage of petrol, diesel, CNG, or LPG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bharti-airtel-in-talks-to-acquire-49-percent-stake-in-haier-india-report-2722238-2025-05-09",
      "headline": "Bharti Airtel in talks to acquire 49% stake in Haier India: ReportSunil Mittal, the billionaire-founder of Indian telecom operator Bharti Airtel, has partnered with private equity firm, Warburg Pincus to buy a substantial stake in Haier India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/telecom-regulator-trai-recommends-5-year-satellite-spectrum-allotment-report-2722224-2025-05-09",
      "headline": "Telecom regulator recommends 5-year satellite spectrum allotment: ReportThe move comes amid growing interest in satellite internet services from global players like Elon Musk's Starlink and domestic telecom giants."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-880-points-lower-nifty-above-24000-titan-ends-4-percent-up-2722207-2025-05-09",
      "headline": "Sensex closes 880 points lower, Nifty above 24,000; Titan ends 4% upThe S&P BSE Sensex lost 880.34 points to end at 79,454.47, while the NSE Nifty50 was down by 265.80 points to close at 24,008.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-faces-no-shortage-of-essentials-items-government-amid-rising-tensions-pakistan-war-2722173-2025-05-09",
      "headline": "Essential goods supply to remain unaffected across India amid geopolitical heatPrices of key food items, including pulses and vegetables, are being watched closely to make sure they stay under control. Efforts are also being made to keep the supply of these items steady across all cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-an-fd-in-2025-check-these-6-banks-offering-attractive-interest-rates-2722156-2025-05-09",
      "headline": "Planning an FD in 2025? Check these 6 banks offering attractive interest ratesFor fixed deposits between 15 and 21 months, HDFC Bank is offering 7.05% to general citizens, while senior citizens get 7.55%"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-pakistan-tensions-finance-minister-nirmala-sitharaman-review-cyber-readiness-banks-financial-institutions-2722163-2025-05-09",
      "headline": "Finance Minister to review cyber readiness of banks, financial institutionsThe meeting will bring together representatives from several key institutions like the Reserve Bank of India (RBI), the National Payments Corporation of India (NPCI), the Bombay Stock Exchange (BSE), the National Stock Exchange (NSE), etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-share-price-jumped-over-7-percent-today-key-reasons-explained-2722110-2025-05-09",
      "headline": "Explained: Why Yes Bank share price jumped over 7% todayThe Yes Bank stock has now gained nearly 11% over the past five sessions, sparking investor curiosity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-crosses-100000-dollars-again-as-us-uk-trade-deal-lifts-market-mood-2722020-2025-05-09",
      "headline": "Bitcoin crosses $100,000 again, as US-UK trade deal lifts market moodThe announcement of a fresh trade deal between US President Donald Trump and UK Prime Minister Keir Starmer helped lift market mood across sectors and gave crypto investors an added reason to feel positive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/yes-securities-raises-paytm-target-to-rs-975-on-profitability-turnaround-and-surge-in-merchant-lending-2722100-2025-05-09",
      "headline": "YES Securities raises Paytm target to Rs 975 on profitability turnaround and surge in merchant lendingContribution margin rises to 56.1%, EBITDA turns positive before ESOP costs, and merchant loan volumes gain traction under DLG model."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/equity-mutual-fund-inflows-hit-one-year-low-in-april-amid-tariff-worries-says-amfi-2722081-2025-05-09",
      "headline": "Equity mutual fund inflows hit 1-year low in April amid tariff worries, says AMFIIndia's equity mutual fund inflows eased for a fourth month in April, dropping to Rs 242.69 billion, the weakest level in a year, reveals AMFI data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-dip-explained-in-5-points-sensex-down-500-points-india-pakistan-military-conflict-rising-tensions-2722059-2025-05-09",
      "headline": "Sensex tumbles 800 points: Why is the stock market falling today?The BSE Sensex was trading 722.62 points lower at 79,612.19 around 11:57 am, while the NSE Nifty50 was down 221.05 points to trade barely above 24,000. Most of the broader market indices also fell during the trading session as volatility surged due to the ongoing military escalations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-oil-assures-public-of-fuel-stock-india-pakistan-war-no-need-for-panic-buying-2722054-2025-05-09",
      "headline": "Indian Oil assures public of fuel stock: No need for panic buyingIndian Oil Corporation Limited (IOCL) requested the public to stay calm and avoid unnecessary rush at petrol pumps amid rising tensions between India and Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/star-health-hacker-xenzen-claims-sending-bullets-and-death-threats-to-top-executives-2722053-2025-05-09",
      "headline": "Star Health hacker claims sending bullets and death threats to top executivesIn the recent email, xenZen said he had sent two packages in February to the company's main office in Chennai. These packages reportedly contained bullet cartridges and threatening notes warning of further violence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/titan-share-price-rise-5-percent-q4-result-dividend-should-you-buy-bse-trading-2722033-2025-05-09",
      "headline": "Titan share price jumps over 4% after strong Q4 numbers. Should you buy?Titan's share price surged 4.95% to reach the day's high of Rs 3,530 on the BSE, compared to the previous close of Rs 3,363.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/drone-defence-warfare-stocks-rise-on-dalal-street-india-pakistan-conflict-tensions-2722013-2025-05-09",
      "headline": "Drone stocks light up Dalal Street, rally up to 17% amid Indo-Pak tensionsShares of ideaforge Technology jumped nearly 17% to Rs 450 on the Bombay Stock Exchange (BSE) after Indian forces deployed suicide drones to neutralise air defence systems in Lahore and Multan. Meanwhile, Droneacharya gained 5%, ZEN Technologies advanced 5%, and Paras Defence rose almost 5% in intraday trade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-likely-to-caution-imf-against-fresh-financial-support-to-pakistan-report-2721981-2025-05-09",
      "headline": "India likely to caution IMF against fresh financial support to Pakistan: ReportIndia seems to be sending a message that simply handing out money to Pakistan won't solve the deeper issues, especially when terrorism and poor handling of previous funds remain concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hal-bel-bharat-dynamics-defence-stocks-in-focus-rally-india-pakistan-tension-conflict-2721987-2025-05-09",
      "headline": "HAL, BEL, Bharat Dynamics: Defence stocks rally up to 7% amid Indo-Pak tensionsShares of Hindustan Aeronautics (HAL), Bharat Dynamics (BDL), Bharat Electronics Ltd (BEL), and Paras Defence jumped between 2 and 7% in Friday's trade, outperforming a jittery broader market shaken by geopolitical uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-news-india-pakistan-tension-what-should-investors-do-sensex-nifty-red-2721974-2025-05-09",
      "headline": "India-Pakistan tension: What should investors do as Sensex, Nifty trade in red?At 9:43 am, the S&P BSE Sensex had fallen by 507.64 points to 79,827.17, while the NSE Nifty50 dropped 160 points to 24,113.80. Most shares and sectors were trading lower, with only a few managing to stay in the green."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-volatility-rising-india-pakistan-conflict-tension-no-dalal-street-crash-explained-2721969-2025-05-09",
      "headline": "Markets volatile but no crash on D-Street amid Indo-Pak tensions. 3 things to knowThe Sensex dropped over 500 points within minutes, and the Nifty wasn't far behind. But despite the panic-inducing headlines, the market didn't spiral into chaos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-500-points-nifty-falls-as-indo-pak-tensions-spook-dalal-street-2721949-2025-05-09",
      "headline": "Market opens volatile amid India-Pakistan tension; Sensex down over 500 pointsSensex falls 500 points, Nifty falls as Indo-Pak tensions spook Dalal Street"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-live-updates-bse-sensex-nifty-share-market-today-pakistan-stock-exchange-india-pak-tension-conflict-war-situation-operation-sindoor-2721947-2025-05-09",
      "headline": "Stock market highlights: Sensex ends 880 points lower, Nifty holds above 24,000Share market: Investor sentiment has been dampened by rising border tensions between India and Pakistan as Dalal Street has taken a hit. However, experts have still asked investors not to panic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-may-9-sensex-nifty-crash-today-indo-pak-tension-war-like-trading-bse-nse-2721928-2025-05-09",
      "headline": "Stock market opening: Will Sensex, Nifty crash today amid Indo-Pak tension?Gift Nifty futures were trading at 23,987 as of 6:46 am, which suggests that the Nifty50 could open nearly 1.2% below Thursday's close of 24,273.8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-9-hal-swiggy-titan-zee-mcx-bharat-forge-lt-india-pakistan-war-2721914-2025-05-09",
      "headline": "Stocks to watch today: HAL, Swiggy, Titan, Zee, MCX, Bharat Forge, L&TDefence sector stocks such as Hindustan Aeronautics Ltd (HAL), Bharat Forge, and Bharat Dynamics Ltd (BDL) are likely to remain in focus. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-to-speed-up-higher-pension-applications-payouts-likely-by-year-end-report-2721644-2025-05-08",
      "headline": "EPFO to speed up higher pension applications, payouts likely by year-end: ReportThe EPFO has received about 1.75 million applications from pensioners who want to get a higher pension based on their actual wages, out of a total of 7.8 million pensioners. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-why-sensex-nifty-fell-sharply-before-today-market-closing-explained-2721626-2025-05-08",
      "headline": "Explained: Why Sensex, Nifty fell sharply moments before stock market closingBy market close, the BSE Sensex had dropped 411.97 points to 80,334.81, while the Nifty 50 fell 140.60 points to 24,273.80. The India VIX, often seen as the market's fear gauge, spiked over 10 per cent to cross the 21 mark—its highest since early April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-withdraws-operation-sindoor-trademark-says-it-was-filed-inadvertently-2721608-2025-05-08",
      "headline": "Reliance withdraws 'Operation Sindoor' trademark, says it was filed inadvertentlyOn May 7, four different applications were made to trademark the phrase 'Operation Sindoor' under Class 41 of the Nice Classification. This category includes services like films, shows, online content, education, cultural events and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/kamikaze-suicide-drone-makers-stock-jumps-after-operation-sindoor-details-here-2721607-2025-05-08",
      "headline": "Kamikaze 'suicide' drone maker's stock jumps after 'Operation Sindoor'. Details hereListed on the NASDAQ under the ticker ESLT, Elbit's stock rose 3.62% over two sessions, jumping from $400.00 on May 6 to $414.47 by May 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-falls-412-points-nifty-below-24300-as-indo-pak-tensions-hit-dalal-street-2721578-2025-05-08",
      "headline": "Sensex, Nifty end in red as panic grows over India-Pak tensionsThe S&P BSE Sensex had fallen over 700 points just a few minutes before closing. However, it bounced back to end 412 points lower at 80,334.81, while the NSE Nifty50 lost 140.60 points to close at 24,273.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-stock-exchange-trading-halted-after-7-per-cent-crash-post-operation-sindoor-2721546-2025-05-08",
      "headline": "Pakistan's Karachi Stock Exchange crashes 7%, trading haltedAccording to the official notification from the exchange, trading was paused after the benchmark index plunged 6.3% in a short period. The sharp fall triggered automatic circuit breakers to stop further decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-what-is-itr-form-3-check-eligibility-documents-and-deadlines-all-details-explained-2721527-2025-05-08",
      "headline": "ITR Filing 2025: What is ITR Form 3, check eliigibility, documents and deadlinesYou should file ITR-3 if you run a business or work as a self-employed professional, regardless of whether a tax audit is needed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/avic-chengdu-aircraft-co-ltd-share-price-india-pak-tensions-chinese-jet-maker-j-17-stock-by-36-percent-in-2-days-2721520-2025-05-08",
      "headline": "India-Pak tensions lift Chinese jet maker's stock by 36% in 2 daysAs of Thursday, the company's share price rose by 16.37% to reach 80.68 yuan. This was after a 17% jump on Wednesday. In total, the stock has gained 36.21% in two days and has gone up 44% in the past one month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retirement-age-is-moving-from-60-to-45-an-investment-banker-sarthak-ahuja-explains-why-2721482-2025-05-08",
      "headline": "'Retirement age is moving from 60 to 45': An investment banker explains whyUnlike lawyers or doctors, where experience adds value, senior professionals in corporate roles like sales, marketing, operations, product, and tech, are seen as costly and sometimes out of touch, said the investment banker."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-india-pakistan-tension-should-investors-on-dalal-street-panic-2721478-2025-05-08",
      "headline": "Why stock market investors shouldn't panic amid rising Indo-Pak tensionsWhile 'Operation Sindoor' led to worries about increased market volatility and losses, the main indices on Dalal Street actually managed to end in green in the previous session. Even today, the stock markets are trading in positive territory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-economy-going-down-forex-reserve-overflight-fees-airspace-ban-india-border-tension-2721445-2025-05-08",
      "headline": "Pakistan's forex is slipping fast. More trouble ahead for already debt-ridden economy?A bailout by the International Monetary Fund (IMF), including a loan of $2 billion in March this year, gave Pakistan some breathing room. But the current situation could undo much of that progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/you-can-now-automate-strategies-zerodha-founder-and-ceo-nithin-kamath-on-nse-new-algo-rules-2721437-2025-05-08",
      "headline": "'You can now automate strategies': Zerodha's Nithin Kamath on NSE's new algo rulesZerodha's founder and CEO, Nithin Kamath, hailed NSE's new rules to ease algo trading for retail users and explained the main update in simple terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-pakistan-rising-tension-war-impact-on-economy-foreign-investments-2721404-2025-05-08",
      "headline": "Will rising Indo-Pak tensions dent foreign investment inflows to India?India's economy, which recently crossed the $4 trillion mark, has minimal direct trade with Pakistan. As a result, cross-border missile strikes carried out by India had limited immediate impact on domestic equities, currencies, or bonds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-layoffs-cuts-200-jobs-in-latest-round-of-restructuring-2721392-2025-05-08",
      "headline": "Google cuts 200 jobs in latest round of restructuring: ReportGoogle described the changes as \"small\" adjustments meant to foster \"greater collaboration\" and improve how quickly teams can serve customers."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/falaq-naaz-questions-loyalty-of-muslim-actors-towards-the-nation-2722412-2025-05-09",
      "headline": "Falaq Naaz questions loyalty of fellow actors towards the nation: I feel sorryTelevision actor Falaq Naaz has openly criticised Muslim actors in the Indian entertainment industry for their silence amidst the India-Pakistan conflict, urging them to show loyalty to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bramayugam-maker-rahul-sadasivan-horror-film-pranav-mohanlal-titled-dies-irae-2722387-2025-05-09",
      "headline": "Dies Irae: Bramayugam makers announce title of horror film with Pranav MohanlalPranav Mohanlal's horror film, which will be directed by Rahul Sadasivan of 'Bramayugam' fame has finally got its title - 'Dies Irea'. It is a Latin word that means 'The Day of Wrath'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohans-wife-aarti-ravi-in-fresh-note-on-divorce-issues-2722346-2025-05-09",
      "headline": "He walked away from duties: Actor Ravi Mohan's wife in fresh note on divorce issuesActor Ravi Mohan's estranged wife, Aarti Ravi, once again shared a long note on social media, accusing the actor of emotional abandonment and financial neglect during their ongoing divorce. Her statement comes amid rumours of Ravi's alleged relationship with singer Kenishaa Francis, who has denied any romantic involvement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-calls-actors-bhands-says-fine-with-dancing-at-weddings-2722364-2025-05-09",
      "headline": "Nawazuddin Siddiqui calls actors 'bhands', says fine with dancing at weddings Nawazuddin Siddiqui said he has no issue with actors dancing at weddings and called performers like himself modern-day 'bhands'. He shared that despite receiving disrespect towards artists, performance remains a respectful part of their profession."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/not-all-men-just-baek-ho-the-potato-lab-hero-who-stays-and-rewrites-romance-2722355-2025-05-09",
      "headline": "Not all men, just Baek Ho: The Potato Lab hero who stays and rewrites romanceThey say you grow out of fairytales. But, in our weekly K-fix, we introduce you to a man - So Baek-ho from 'The Potato Lab' - who walks into a lab tucked in the hills and quietly rewrites everything you thought you knew about love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/indian-idol-12-winner-pawandeep-rajan-undergoes-three-more-surgeries-remains-under-observation-2722352-2025-05-09",
      "headline": "Singer Pawandeep Rajan's health update: Undergoes three more surgeriesIndian Idol 12 winner Pawandeep Rajan underwent three more surgeries following his tragic accident on May 5. His team issued a statement and updated fans about his health. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jackson-wang-india-trip-may-defer-amid-indo-pak-tension-2722334-2025-05-09",
      "headline": "Singer Jackson Wang's India trip may defer amid Indo-Pak tensionSinger Jackson Wang's India trip might be deferred due to escalating tensions between India and Pakistan. No official statement has been released by the global sensation yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-sitaare-zameen-par-to-follow-youtube-pay-per-view-model-2722274-2025-05-09",
      "headline": "Aamir Khan's Sitaare Zameen Par to follow YouTube pay-per-view model: ReportAamir Khan's upcoming film 'Sitaare Zameen Par' will be released on YouTube through a pay-per-view model, eight weeks after its theatrical release. The film introduces 10 debutant actors under the banner of Aamir Khan Productions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-unusual-x-activity-raises-eyebrows-2722257-2025-05-09",
      "headline": "Blank tweets? Amitabh Bachchan's unusual X activity raises eyebrowsVeteran actor Amitabh Bachchan's recent string of around 20 blank tweets has left fans puzzled and speculating about their significance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/subham-movie-review-samantha-first-production-delivers-a-sweet-offbeat-horror-comedy-2722247-2025-05-09",
      "headline": "Subham review: Samantha's first production delivers a sweet, offbeat horror comedyReleased-Fri May 09, 2025'Subham', Samantha Ruth Prabhu's debut production, offers a quirky, light-hearted blend of horror and comedy. Directed by 'Cinema Bandi''s Praveen Kandregula, the film tackles social themes with humour. Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-dismisses-akshay-kumar-isnt-friend-statement-calls-him-cool-guy-2722235-2025-05-09",
      "headline": "Paresh Rawal dismisses 'Akshay isn't friend' statement, calls him 'cool guy'Paresh Rawal says 'maatha kharab ho gaya' after the interview in which he called Akshay Kumar 'a colleague' and 'not a friend'. The actor now comes clean on the statement. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-row-hits-back-files-new-lawsuit-against-kim-sae-ron-family-2722203-2025-05-09",
      "headline": "Kim Soo-hyun row: Actor hits back, files new lawsuit against Kim Sae-ron's familyKorean actor Kim Soo-hyun filed a lawsuit against YouTuber Kim Se-eui and Kim Sae-ron's family for spreading false information against the actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/single-movie-review-honest-timepass-comedy-without-logic-but-delivers-wholesome-laughs-sree-vishnu-ivana-caarthick-raju-2722189-2025-05-09",
      "headline": "Single review: A timepass comedy without logic but delivers wholesome laughsReleased-Fri May 09, 2025'Single' movie review: Directed by Caarthick Raju, 'Single' is a slapstick comedy about a love triangle between Sree Vishnu, Ivana and Ketika Sharma. The film, although has an illogical plot, serves as a good timepass flick to watch and laugh in abandon. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-daughter-sitara-ghattamaneni-meets-kendall-jenner-2722158-2025-05-09",
      "headline": "Mahesh Babu's daughter Sitara's fan girl moment with Kendall JennerMahesh Babu's daughter Sitara Ghattamaneni recently bumped into international model Kendall Jenner. The two clicked selfies together, delighting fans across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ishaan-khatter-bhumi-pednekar-the-royals-review-lacks-chemistry-visually-grand-2722121-2025-05-09",
      "headline": "The Royals review: A royal khichdi with ample hot bods but lacklustre chemistryReleased-Fri May 09, 2025'The Royals' offers a modern Indian fairy-tale set in Rajasthan, blending classic romance tropes with regal grandeur and contemporary twists. Despite its picturesque backdrop and strong performances, the show struggles to ignite the essential chemistry expected in a mushy romantic drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-asks-citizens-to-be-cautious-in-wise-note-amid-india-pakistan-tensions-2722118-2025-05-09",
      "headline": "Rajamouli asks citizens to be cautious in wise note amid India-Pakistan tensionsFilmmaker SS Rajamouli praised the Indian Army and urged citizens to act responsibly amid India-Pakistan tensions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-posts-proud-note-for-indian-army-amid-india-pakistan-tensions-virat-kohli-reacts-2722126-2025-05-09",
      "headline": "Anushka Sharma posts proud note for Indian Army amid Indo-Pak tensions, Virat reactsAnushka Sharma called the Indian Armed Forces real 'heroes' in a note posted on Instagram, following India's precision strike against terrorist centres in Pakistan and PoK under the code-name Operation Sindoor. Her husband and cricketer, Virat Kohli, was among the first people to comment on the post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-kundrra-krystle-dsouza-tv-celebs-extend-support-to-indian-army-2722116-2025-05-09",
      "headline": "Karan Kundrra to Krystle Dsouza: TV celebs extend support to Indian ArmyKaran Kundrra, Krystle Dsouza, Karan Veer Mehra, among other TV celebs who extended their support to the Indian army amid tensions with Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/cancelled-events-to-delayed-releases-impact-of-india-pakistan-tension-on-film-industry-2722108-2025-05-09",
      "headline": "Cancelled events to delayed releases: Impact of Indo-Pak tension on film industryThe recent terror attack in Pahalgam and subsequent Operation Sindoor have deeply affected the Indian entertainment industry, leading to cancellations of events and removal of Pakistani content from platforms. Film releases have also been impacted as the industry shows solidarity with the nation. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-tensions-live-update-operation-sindoor-blackout-india-pak-war-missile-drone-attack-pahalgam-terror-attack-air-strike-2721927-2025-05-09",
      "headline": "LIVE: Blackout in Jammu, blasts heard, drones spotted for 2nd consecutive nightLive Updates: Sirens went off in Jammu for a second consecutive day as Pakistan began shelling in parts of Jammu and Kashmir, including Poonch and Uri. Blasts were heard in Jammu, and the city witnessed blackout for a second day. Meanwhile, amid escalating tensions, Prime Minister Narendra Modi chaired a high-level security meeting with the chiefs of Army, Navy and Air Force. On Thursday, Pakistan launched a series of missile and drone attacks targeting several regions in India, including Jammu, Rajasthan, and Punjab. All incoming threats were successfully thwarted by India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-india-attack-civilian-planes-air-space-shields-didnt-close-air-space-during-may-8-attack-government-2722312-2025-05-09",
      "headline": "Pak used civilian planes as shield, didn't close airspace during attack: GovernmentPakistan launched a drone attack towards India on Thursday night. The government has said that Pakistan did not close its airspace to passenger flights at the time of attack, and used civil airliners as shields."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-attack-pahalgam-terrorist-attack-chinese-missile-pl-15-jammu-punjab-rajasthan-army-2722405-2025-05-09",
      "headline": "Pak confirms use of Chinese PL-15 missile after India struck its terror campsIn the first-ever confirmed combat use, Pakistan admitted to firing China's long-range PL-15 missile at India, following India's strike on Pak terrorist camps. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/pakistans-strike-on-india-used-gun-toting-turkish-drones-all-about-songar-2722320-2025-05-09",
      "headline": "Pakistan likely used Turkey's Songar drones to attack India: What is it?Indian air defence systems responded swiftly, bringing down the majority of these drones before they could inflict significant damage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-pakistan-confrontation-operation-sindoor-hidden-enemy-china-hand-pakistan-general-asim-munir-2722305-2025-05-09",
      "headline": "Who wants to keep India busy in war, apart from a mad Pakistan General?Hostilities are simmering between India and Pakistan, but a more insidious force may be pulling the strings. As missiles fly and tempers flare, the real battle might not be at the border — but in the shadows, where the hidden enemy quietly thrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/airports-closure-india-extended-pak-tensions-drone-missiles-airspace-2722389-2025-05-09",
      "headline": "Closure of 24 airports extended till May 15 amid rising tensions with PakIndia has extended the closure of 24 airports near the Pakistan border till May 15 after cross-border drone and missile threats. Security has been heightened nationwide, with flights cancelled and stricter checks enforced."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-india-may-8-attack-turkish-drone-used-400-drones-civilian-planes-radar-india-36-drones-operation-sindoor-2722309-2025-05-09",
      "headline": "Pak targeted 36 places with 300-400 'Turkish' drones: India on May 8 attackThe government said that the \"possible purpose of these large-scale aerial intrusions were to test the air defence systems and gather intelligence.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/balochistan-attacks-on-pakistan-army-bla-rebels-fighters-overrun-flag-hoist-independence-liberation-calls-2722171-2025-05-09",
      "headline": "Baloch rebels see opportunity in Pak's adversity, hoist flags of liberationFierce attacks by Baloch rebels have shaken the Pakistani state, even as it is focused on the Indian front. Balochistan's provincial capital, Quetta, saw six attacks on Pakistani forces on Thursday. The Baloch people have replaced Pakistani flags with their own, and want to be recognised as an independent country, with a diplomatic mission in Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/kashmiri-foiled-pakistan-plan-snatch-jammu-kashmir-india-mujahideens-1965-war-operation-sindoor-2722234-2025-05-09",
      "headline": "When Kashmiris foiled Pak's villainous plan to snatch J&K with mujahideenThe Pakistan military and the ISI hatched a plot for months to use mujahideen and disguised army regulars to snatch Kashmir from India. Its Operation Gibraltar hinged on the belief that Kashmiris would side with them and revolt against India. Leave alone revolt, Kashmiris gave away critical information that helped the Indian Army defeat the Pakistanis. It was Operation Gibraltar that led to the 1965 War."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-ipl-2025-michael-vaughan-england-vs-india-test-series-2722332-2025-05-09",
      "headline": "Should BCCI take IPL 2025 outside India? Michael Vaughan floats ideaThe Indian Premier League has been suspended for a week amidst rising tensions between India and Pakistan. Former England captain Michael Vaughan has floated the idea that BCCI could reschedule the IPL and host it in the United Kingdom.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/permanent-commission-for-women-army-officers-case-sc-hearing-not-time-for-running-around-courtrooms-amid-border-conflict-2722322-2025-05-09",
      "headline": "This isn't time for court battles: Top court says retain all women officersThe Supreme Court made strong remarks on women officers in defence forces amidst the ongoing India-Pakistan border tensions. The top court urged the Army not to release women officers challenging denial of Permanent Commission, stressing morale and service utility over courtroom battles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-economy-imf-loan-package-financial-condition-bailout-islamabads-suicide-attack-on-itself-amid-india-tensions-2722114-2025-05-09",
      "headline": "Pakistan's suicide attack on itself amid IMF meetEven as Pakistan is firing missiles and drones at Indian civilian and military infrastructure, the \"establishment\" of the almost-broke nation might be shooting itself in the foot. With a crucial IMF review meeting on loans to Pakistan today, Islamabad's war drums may drown out the jingle of the much-needed money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-the-smiles-on-rajnath-singh-3-service-chiefs-tell-a-story-india-crushing-pak-2722078-2025-05-09",
      "headline": "The smiles on Rajnath Singh, 3 service chiefs tell a story - India crushing PakThe meeting - attended by Chief of Defence Staff General Anil Chauhan, Chief of the Army Staff General Upendra Dwivedi, Air Chief Marshal AP Singh, and Navy Chief Admiral Dinesh K Tripathi - came less than 24 hours after Pakistan launched a wave of drone and missile attacks along India's western border."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspended-bcci-asia-cup-2722244-2025-05-09",
      "headline": "IPL 2025 suspended: Why scrapping of Asia Cup is best option for BCCIThe Asia Cup has become uncertain after the IPL 2025 was suspended following the rising tensions between India and Pakistan. The Asia Cup was scheduled for a window in September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-shuts-down-pakistans-phone-a-friend-bail-out-option-amid-tensions-with-india-2722150-2025-05-09",
      "headline": "US shuts down Pakistan's phone-a-friend bail out optionWith Washington stepping back and Pakistan's allies offering limited support, Islamabad is stuck between the proverbial rock and the hard place. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-terror-camps-strike-pakistan-pok-indian-armed-forces-evidence-2722250-2025-05-09",
      "headline": "Armed forces document every anti-terror strike for transparency: Government sourcesA data collection unit documents evidence on Indian Armed Forces' strikes on terror bases, government sources told India Today. India's Operation Sindoor targeted terror infrastructure in Pakistan and POK on May 7.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-unusual-x-activity-raises-eyebrows-2722257-2025-05-09",
      "headline": "Blank tweets? Amitabh Bachchan's unusual X activity raises eyebrowsVeteran actor Amitabh Bachchan's recent string of around 20 blank tweets has left fans puzzled and speculating about their significance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chandigarh-orders-retailers-traders-not-to-stockpile-panic-buying-india-pakistan-tensions-operation-sindoor-2722222-2025-05-09",
      "headline": "Don't hoard food, fuel, Chandigarh orders as India-Pak tensions spark panic buyingThe Chandigarh administration has ordered all traders and stockists to declare their current stock to the Department of Food and Supplies within three days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-drones-strike-pakistan-locations-verified-sites-2722245-2025-05-09",
      "headline": "Verified locations of Indian drone impact sites in PakistanTo filter facts from fiction, India Today has verified these claims using social media videos posted by locals, eyewitness accounts, satellite images, and reports in Pakistan's media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/the-psychological-toll-of-a-india-pakistan-war-like-situation-on-common-man-2721174-2025-05-09",
      "headline": "The psychological toll of a war-like situation on common manThe escalating tensions between India and Pakistan have left many feeling anxious and scared. Psychologists acknowledge the impact of such situations on mental health, but there are ways to cope."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-tensions-pakistan-supreme-court-strengthens-power-army-chief-asim-munir-civial-tried-in-military-court-imran-khan-pti-2721543-2025-05-09",
      "headline": "Pakistan Supreme Court strengthens army chief Asim Munir's handsEven as Pakistan reels after India's Operation Sindoor and the counterstrike after its aerial attack, its Supreme Court handed the Army, led by the unpopular General Asim Munir, a potent new weapon. Now, civilians can be tried in military courts in Pakistan. The judiciary has effectively approved a military crackdown on dissent, just when Munir needed it the most."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-border-force-bsf-foils-major-infiltration-bid-in-jk-samba-amid-india-pak-tensions-2721955-2025-05-09",
      "headline": "7 suspected Jaish terrorists killed while trying to infiltrate Jammu's SambaThe infiltration bid came on a day when India neutralised Pakistan military's attempt to hit military stations in Jammu, Pathankot, Udhampur and some other locations with missiles and drones as tensions soared between the two countries amid fears of a wider military conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/centre-government-army-chief-call-out-officers-enrolled-persons-territorial-army-support-regular-army-pakistan-operation-sindoor-2722137-2025-05-09",
      "headline": "Centre empowers Army Chief to call out officers, enrollees of Territorial ArmyUnder a notification dated May 6, 2025, issued in accordance with Rule 33 of the Territorial Army Rules, 1948, the government has authorised the Army Chief to call out every officer and enroled personnel of the Territorial Army as needed, either for guard duties or for full embodiment to support and supplement the regular armed forces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bramayugam-maker-rahul-sadasivan-horror-film-pranav-mohanlal-titled-dies-irae-2722387-2025-05-09",
      "headline": "Dies Irae: Bramayugam makers announce title of horror film with Pranav MohanlalPranav Mohanlal's horror film, which will be directed by Rahul Sadasivan of 'Bramayugam' fame has finally got its title - 'Dies Irea'. It is a Latin word that means 'The Day of Wrath'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohans-wife-aarti-ravi-in-fresh-note-on-divorce-issues-2722346-2025-05-09",
      "headline": "He walked away from duties: Actor Ravi Mohan's wife in fresh note on divorce issuesActor Ravi Mohan's estranged wife, Aarti Ravi, once again shared a long note on social media, accusing the actor of emotional abandonment and financial neglect during their ongoing divorce. Her statement comes amid rumours of Ravi's alleged relationship with singer Kenishaa Francis, who has denied any romantic involvement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-calls-actors-bhands-says-fine-with-dancing-at-weddings-2722364-2025-05-09",
      "headline": "Nawazuddin Siddiqui calls actors 'bhands', says fine with dancing at weddings Nawazuddin Siddiqui said he has no issue with actors dancing at weddings and called performers like himself modern-day 'bhands'. He shared that despite receiving disrespect towards artists, performance remains a respectful part of their profession."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-sitaare-zameen-par-to-follow-youtube-pay-per-view-model-2722274-2025-05-09",
      "headline": "Aamir Khan's Sitaare Zameen Par to follow YouTube pay-per-view model: ReportAamir Khan's upcoming film 'Sitaare Zameen Par' will be released on YouTube through a pay-per-view model, eight weeks after its theatrical release. The film introduces 10 debutant actors under the banner of Aamir Khan Productions."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-delhi-capitals-security-dharamsala-2722425-2025-05-09",
      "headline": "How IPL teams, Delhi and Punjab, were moved amid security concernsIPL 2025: Punjab Kings and Delhi Capitals players were evacuated from the HPCA Stadium in Dharamsala after Pakistan tried to invade air space near Chandigarh with drone attacks. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspended-chennai-super-kings-ravindra-jadeja-urvil-patel-2722411-2025-05-09",
      "headline": "CSK players Ravindra Jadeja, Urvil Patel head home after IPL 2025 suspensionCSK players Ravindra Jadeja and Urvil Patel are heading home after the IPL 2025 season was suspended for a week in the wake of the rising cross-border tensions between India and Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-thanks-indian-railways-special-train-evacuates-ipl-teams-dharamsala-india-pakistan-war-2722400-2025-05-09",
      "headline": "Indian railways' special train evacuates players from DharamsalaBCCI thanked Indian Railways for arranging a special train to evacuate IPL teams from Dharamsala. The move followed the suspension of the Punjab Kings and Delhi Capitals match amid India-Pakistan tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sourav-ganguly-suspension-bcci-exclusive-2722402-2025-05-09",
      "headline": "IPL 2025 will be completed, BCCI is efficient: Sourav GangulyIPL 2025: Sourav Ganguly expressed confidence in the BCCI's ability to complete the tournament and take appropriate measures, as they did during the Covid-19 pandemic in 2020 and 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/narendra-modi-india-vs-pakistan-operation-sindoor-ravi-shastri-2722388-2025-05-09",
      "headline": "GOAT Narendra Modi: Shastri as India stands united amidst rising tensionsFormer India head coach Ravi Shastri lauded the Indian government and Prime Minister Modi amidst difficult times. Shastri said that he has never seen 1.5 billion Indians this united."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/italian-open-2025-carlos-alcaraz-dusan-lajovic-injury-2722379-2025-05-09",
      "headline": "Carlos Alcaraz returns with dominating win after injury layoffItalian Open 2025: Carlos Alcaraz beat Serbia's Dusan Lajovic in straight sets on Friday and made a stunning comeback following his Madrid Open snub due to injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-arun-jaitley-stadium-bomb-threat-delhi-ddca-2722376-2025-05-09",
      "headline": "IPL 2025: Bomb threat at Arun Jaitley stadium declared hoax, security increasedThe Delhi and District Cricket Association (DDCA) received a bomb threat at the Arun Jaitley stadium on Friday, May 8. However, the information turned out to be hoax but the security at the venue has been stepped up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bundesliga-xabi-alonso-bayer-leverkusen-exit-real-madrid-2722345-2025-05-09",
      "headline": "Bayer Leverkusen coach Xabi Alonso announces exit amidst Real Madrid rumoursBayer Leverkusen manager Xabi Alonso has confirmed that he will be leaving the club at the end of the season, amidst rumours connecting him to the Real Madrid job. Alonso guided Leverkusen to a historic Bundesliga title last season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pcb-psl-matches-uae-rejection-emirates-cricket-board-india-pakistan-tensions-2722336-2025-05-09",
      "headline": "UAE set to decline PCB request to host PSL gamesThe United Emirates Cricket Board is unlikely to approve the Pakistan Cricket Board's request to host the PSL in the UAE. PSL was suspended amidst rising tensions between India and Pakistan on May 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chloe-tryon-annerie-dercksen-south-africa-vs-sri-lanka-tri-series-report-2722330-2025-05-09",
      "headline": "All-round Tryon, Dercksen 104 give South Africa consolation win in tri seriesChloe Tryon scored 74 runs and picked up a five-wicket haul as South Africa beat Sri Lanka by 76 runs in the last match of the league stage in the ongoing tri-series at the R Premadasa Stadium in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-ipl-2025-michael-vaughan-england-vs-india-test-series-2722332-2025-05-09",
      "headline": "Should BCCI take IPL 2025 outside India? Michael Vaughan floats ideaThe Indian Premier League has been suspended for a week amidst rising tensions between India and Pakistan. Former England captain Michael Vaughan has floated the idea that BCCI could reschedule the IPL and host it in the United Kingdom.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-arun-jaitley-stadium-bomb-threat-delhi-ddca-2722376-2025-05-09",
      "headline": "IPL 2025: Bomb threat at Arun Jaitley stadium declared hoax, security increasedThe Delhi and District Cricket Association (DDCA) received a bomb threat at the Arun Jaitley stadium on Friday, May 8. However, the information turned out to be hoax but the security at the venue has been stepped up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bundesliga-xabi-alonso-bayer-leverkusen-exit-real-madrid-2722345-2025-05-09",
      "headline": "Bayer Leverkusen coach Xabi Alonso announces exit amidst Real Madrid rumoursBayer Leverkusen manager Xabi Alonso has confirmed that he will be leaving the club at the end of the season, amidst rumours connecting him to the Real Madrid job. Alonso guided Leverkusen to a historic Bundesliga title last season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pcb-psl-matches-uae-rejection-emirates-cricket-board-india-pakistan-tensions-2722336-2025-05-09",
      "headline": "UAE set to decline PCB request to host PSL gamesThe United Emirates Cricket Board is unlikely to approve the Pakistan Cricket Board's request to host the PSL in the UAE. PSL was suspended amidst rising tensions between India and Pakistan on May 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chloe-tryon-annerie-dercksen-south-africa-vs-sri-lanka-tri-series-report-2722330-2025-05-09",
      "headline": "All-round Tryon, Dercksen 104 give South Africa consolation win in tri seriesChloe Tryon scored 74 runs and picked up a five-wicket haul as South Africa beat Sri Lanka by 76 runs in the last match of the league stage in the ongoing tri-series at the R Premadasa Stadium in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-ipl-2025-michael-vaughan-england-vs-india-test-series-2722332-2025-05-09",
      "headline": "Should BCCI take IPL 2025 outside India? Michael Vaughan floats ideaThe Indian Premier League has been suspended for a week amidst rising tensions between India and Pakistan. Former England captain Michael Vaughan has floated the idea that BCCI could reschedule the IPL and host it in the United Kingdom.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-trent-alexander-arnold-departure-arne-slot-2722313-2025-05-09",
      "headline": "Liverpool sad to lose Trent Alexander-Arnold, but a new player will step up: SlotLiverpool boss Arne Slot claimed that the club is sad to lose Trent Alexander-Arnold but expects a player to step up and fill the void left by the departure of the England defender. Alexander--Arnold will leave Liverpool at the end of the summer as a free agent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/ons-jabeur-italian-open-gaza-palestine-war-terrorist-2722289-2025-05-09",
      "headline": "Been called a terrorist: Jabeur on helping starving people in GazaTunisia's Ons Jabeur talked about the emotional turmoil she has had to go through while trying to help starving people in Gaza amid their war with Palestine. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-test-retirement-opener-sanjay-manjrekar-indian-team-2722283-2025-05-09",
      "headline": "Rohit Sharma's days as Test opener were over: Sanjay Manjrekar's bold claimSanjay Manjrekar has made the bold claim that Rohit Sharma's days as an opener in Tests were over after the 38-year-old announced his retirement from the longest format of the game earlier in the week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspended-jiostar-statement-bcci-2722246-2025-05-09",
      "headline": "IPL 2025 suspended: Broadcaster JioStar wholeheartedly supports BCCI's callIPL 2025 official broadcasters JioStar has wholeheartedly supported BCCI's call to suspend the tournament for a week amidst escalating tensions between India and Pakistan. The tournament was suspended by BCCI for a week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspended-bcci-asia-cup-2722244-2025-05-09",
      "headline": "IPL 2025 suspended: Why scrapping of Asia Cup is best option for BCCIThe Asia Cup has become uncertain after the IPL 2025 was suspended following the rising tensions between India and Pakistan. The Asia Cup was scheduled for a window in September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspended-cricketers-support-bcci-call-safety-nation-2722243-2025-05-09",
      "headline": "Cricketers support IPL 2025 suspension amid IND-PAK tensionsWith military tensions escalating and safety concerns mounting, the BCCI's swift call to pause IPL 2025 has drawn widespread praise from cricket veterans and pundits, reflecting a moment of unity during national tension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shukri-conrad-rob-walter-south-africa-coach-2722221-2025-05-09",
      "headline": "Shukri Conrad replaces Rob Walter as South Africa's white-ball coachShukri Conrad has replaced Rob Walter as the head coach of the South African white-ball team. Walter had resigned following the Proteas' exit in the Champions Trophy semi-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspension-playoff-race-standings-points-table-2722215-2025-05-09",
      "headline": "IPL 2025 Suspended for a Week: Where Every Team Stands in the Playoff RaceWith the IPL 2025 campaign being suspended for a week, here's a look at the play-offs race so far and the teams who have a chance of making it to the top four this season.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspended-bcci-asia-cup-2722244-2025-05-09",
      "headline": "IPL 2025 suspended: Why scrapping of Asia Cup is best option for BCCIThe Asia Cup has become uncertain after the IPL 2025 was suspended following the rising tensions between India and Pakistan. The Asia Cup was scheduled for a window in September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspended-cricketers-support-bcci-call-safety-nation-2722243-2025-05-09",
      "headline": "Cricketers support IPL 2025 suspension amid IND-PAK tensionsWith military tensions escalating and safety concerns mounting, the BCCI's swift call to pause IPL 2025 has drawn widespread praise from cricket veterans and pundits, reflecting a moment of unity during national tension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shukri-conrad-rob-walter-south-africa-coach-2722221-2025-05-09",
      "headline": "Shukri Conrad replaces Rob Walter as South Africa's white-ball coachShukri Conrad has replaced Rob Walter as the head coach of the South African white-ball team. Walter had resigned following the Proteas' exit in the Champions Trophy semi-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspension-playoff-race-standings-points-table-2722215-2025-05-09",
      "headline": "IPL 2025 Suspended for a Week: Where Every Team Stands in the Playoff RaceWith the IPL 2025 campaign being suspended for a week, here's a look at the play-offs race so far and the teams who have a chance of making it to the top four this season.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspended-for-one-week-new-schedule-to-be-announced-soon-bcci-2722183-2025-05-09",
      "headline": "IPL 2025 suspended for one week, new schedule to be announced soon: BCCIThe Board of Control for Cricket in India (BCCI) said that the board has decided to suspend the remainder of the ongoing Indian Premier League (IPL 2025) with immediate effect for one week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspension-bcci-official-statement-explanation-india-pakistan-tensions-2722181-2025-05-09",
      "headline": "IPL suspended for a week, BCCI says nothing greater than nationIPL 2025 suspended: The Indian cricket board (BCCI) confirmed the suspension of the IPL for one week. In a statement, the board said that it would continue to follow the directives of the government and saluted the armed forces for leading the counter-strikes against Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspended-will-bcci-reschedule-tournament-to-a-later-window-2722148-2025-05-09",
      "headline": "IPL 2025 suspended: Will BCCI eye Asia Cup window to reschedule tournament?With IPL 2025 suspended amid escalating tensions between India and Pakistan, the BCCI is expected to explore a possible window later in the year to complete the remaining matches. An August-September window-potentially clashing with India's tour of Bangladesh and the Asia Cup-can be considered."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspended-bcci-prioritises-players-safety-overseas-stars-return-2722145-2025-05-09",
      "headline": "IPL suspended: BCCI prioritises players' safety, overseas stars may leave on FridayWith rising India-Pakistan hostilities sparking safety fears, the BCCI has suspended IPL 2025 and is working swiftly to send overseas players home, prioritising their security amid escalating military tensions and cross-border conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-indian-armed-forces-tensions-paksitan-operation-sindoor-2722144-2025-05-09",
      "headline": "Virat Kohli salutes Indian armed forces amid rising tensions with PakistanIndia cricketer Virat Kohli took to social media to share a heartfelt tribute to the Indian armed forces, who are leading the counter-strikes amid escalating tensions with Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-wants-to-continue-playing-for-mumbai-writes-to-mca-seeking-approval-2722119-2025-05-09",
      "headline": "Yashasvi wants to continue playing for Mumbai, writes to MCA seeking approvalIndian Test opener Yashasvi Jaiswal has withdrawn his NOC request and confirmed his availability to play for Mumbai in the upcoming domestic season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-suspended-india-pakistan-military-war-safety-2722105-2025-05-09",
      "headline": "IPL 2025 suspended amid India-Pakistan tensions to ensure safety for allIPL 2025 was suspended due to escalating India-Pakistan tensions, ensuring safety for players, staff, and fans. The decision follows military hostilities, with matches on hold until further notice from BCCI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-suspends-ipl-indefinitely-amid-escalating-tensions-with-pakistan-india-pahalgam-attack-operation-sindoor-2722062-2025-05-09",
      "headline": "BCCI suspends IPL 2025 amid escalating tensions with PakistanIPL 2025 suspended: The remainder of the Indian Premier League 2025 has been suspended amid escalating military tensions between India and Pakistan, the BCCI confirmed on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-proud-of-indian-armed-forces-amid-rising-india-pakistan-tensions-2722047-2025-05-09",
      "headline": "Rohit Sharma proud of Indian armed forces amid rising India-Pakistan tensionsRohit Sharma thanked the Indian armed forces for their service amid the rising tension between India and Pakistan while urging everyone to follow safety guidelines to stay safe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-rcb-match-preview-predicted-xi-picth-condition-weather-forecast-lucknow-2722025-2025-05-09",
      "headline": "LSG vs RCB Preview: Predicted XI, team news and Ekana pitch conditionsLSG vs RCB, IPL 2025 Preview: Despite heightened national tensions, IPL chairman Arun Dhumal confirmed LSG vs RCB will go on as planned in Lucknow on May 9, setting up a must-win clash for Pant's men and a playoff boost for Bengaluru.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-navjot-singh-sidhu-on-rishabh-pant-form-lsg-playoff-chances-2722010-2025-05-09",
      "headline": "Rishabh Pant needs to go back to basics: Navjot Sidhu decodes LSG skipper's struggleFormer India cricketer Navjot Singh Sidhu believes Lucknow Super Giants captain Rishabh Pant needs to go back to basics to resurrect his batting form in the ongoing Indian Premier League (IPL) 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-manchester-united-vs-athletic-bilbao-mason-mount-positive-brace-2721975-2025-05-09",
      "headline": "Mason Mount's positive route to United brace vs Bilbao: Knew good would comeMason Mount credited his return to form to a positive mindset and hard work after his match-winning brace helped Manchester United cruise past Athletic Bilbao and into the Europa League final with a 7-1 aggregate win."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}