{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-eb4-visa-process-for-foreign-technical-experts-glbs-2837630-2025-12-18",
      "headline": "India eases visa process for foreign professionals, engineers hired by firmsIndia has introduced a simplified e-B-4 visa process to facilitate foreign experts' entry for manufacturing projects. The move aims to reduce visa processing time and support faster industrial execution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/poses-risks-warner-bros-discovery-board-rejects-108-billion-rival-bid-from-paramount-netflix-in-race-2837474-2025-12-17",
      "headline": "Warner Bros rejects Paramount's $108-billion hostile bid, Netflix in raceThe board said Netflix's $27.75-per-share binding merger offers greater certainty, stronger finances and lower risk for shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-walmart-to-reliance-meet-the-worlds-10-richest-families-2837436-2025-12-17",
      "headline": "From Walmart to Reliance: Meet the world's 10 richest familiesFrom retail giants to oil empires, the world's richest families control businesses that shape global markets. Let's look at the 10 richest families globally, with the Ambani family representing India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-nse-bse-rupee-gain-fii-selling-sbi-psu-bank-shares-2837335-2025-12-17",
      "headline": "Sensex ends 120 points lower, Nifty below 25,900; SBI gains 2%The S&P BSE Sensex was down 120.21 points to close at 84,559.65, while the NSE Nifty50 lost 41.55 points to end at 25,818.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-tax-gst-on-health-insurance-will-premium-come-down-low-cost-or-not-insurer-personal-finance-2837317-2025-12-17",
      "headline": "Zero GST on health insurance: What it means for your premium and your pocketFrom September 22, individual health and life insurance policies have become free from Goods and Services Tax, removing the 18% tax that policyholders were paying earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-when-will-it-be-implemented-and-how-much-can-you-expect-2837249-2025-12-17",
      "headline": "8th Pay Commission: When will it be implemented and how much can you expect?The 8th Pay Commission has officially been set up, but the big questions remain unanswered. When will the new pay structure be implemented, and how much of a salary hike can central government employees realistically expect?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-prices-hit-record-high-gold-rate-today-mcx-should-you-invest-outshining-yellow-metal-2837224-2025-12-17",
      "headline": "Silver rates reach new high: Why is it beating gold prices, and should you buy?On the Multi Commodity Exchange (MCX), silver jumped over 4% during early trade. Around 9:20 am, MCX silver was trading 3.38% higher at Rs 2,04,445 per kg, touching a lifetime high."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-the-70-salary-rule-and-where-the-other-30-should-go-2837215-2025-12-17",
      "headline": "What is the 70% salary rule and where the other 30% should go?Abhishek Walia urges individuals to base their spending only on verified take-home pay, warning that relying on bonuses or predicted increments leads to financial stress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-to-exit-nps-here-is-how-the-new-rules-affect-your-retirement-payout-2837175-2025-12-17",
      "headline": "Planning to exit NPS? Here's how the new rules affect your retirement payoutThe pension regulator has eased NPS exit rules, allowing subscribers to access more of their money upfront. If retirement is around the corner, these changes could directly impact your final payout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/vedanta-demerger-news-shareholders-new-stock-anil-agarwal-statement-five-entities-share-price-today-2837128-2025-12-17",
      "headline": "Vedanta shares in focus as it gets NCLT approval for demerger. Check detailsVedanta share price: The approval clears a key legal hurdle and allows the company to move ahead with splitting its businesses into multiple listed entities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-open-higher-psu-banking-stocks-rally-eternal-up-2837071-2025-12-17",
      "headline": "Sensex, Nifty open marginally higher as banking stocks rally in early tradeThe S&P BSE Sensex was up by 91.32 points to 84,771.18, while the NSE Nifty50 added 44.40 points to 25,904.50 as of 9:22 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bharat-taxi-app-launch-date-january-1-delhi-competition-ola-uber-surge-price-problem-2837065-2025-12-17",
      "headline": "Bharat Taxi app to launch in Delhi from January 1The app is expected to provide relief to passengers who often face sharp fare increases on platforms such as Ola and Uber during peak hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warner-bros-deal-paramount-usd-108-billion-likely-backout-netflix-partnership-likely-report-2837054-2025-12-17",
      "headline": "Warner Bros likely to skip Paramount's $108.4 billion bid, back Netflix: ReportIf the board moves ahead with this recommendation, it would signal Warner Bros Discovery's preference to back Netflix's earlier buyout proposal instead of Paramount's all-cash offer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/icici-prudential-ipo-allotment-status-guide-how-to-check-bse-kfin-website-gmp-today-listing-details-2837045-2025-12-17",
      "headline": "ICICI Prudential AMC IPO allotment today: Check status, GMP, expected share priceInvestors who applied for the IPO can check their allotment status through the registrar, Kfin Technologies, or the BSE website once the allotment is finalised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/100-fdi-in-insurance-explained-what-it-means-for-your-policies-premiums-and-claims-2836862-2025-12-17",
      "headline": "100% FDI in insurance explained: What it means for your policies, premiums and claimsWhat does allowing 100% foreign investment in insurance really mean for you as a policyholder, and could it change your premiums, policy features or claim experience? Find out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-eastern-airlines-daily-delhi-shanghai-flights-expansion-glbs-2837009-2025-12-17",
      "headline": "China Eastern Airlines to run daily flights on Delhi-Shanghai route from JanuaryFlight services between the two countries were suspended following the Covid-19 pandemic in 2020 and were not restored due to the over four-year border face-off in eastern Ladakh, which ended in October last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-hits-historic-low-of-91-against-us-dollar-what-is-behind-this-drop-2836767-2025-12-16",
      "headline": "Rupee hits historic low of 91 against US dollar. What's behind this drop?The rupee breached the 91 mark against the US dollar for the first time on Tuesday, extending its run of losses amid sustained foreign fund outflows and market uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/missed-the-december-advance-tax-deadline-this-is-the-interest-you-may-have-to-pay-2836738-2025-12-16",
      "headline": "Missed the December advance tax deadline? This is the interest you may have to payIf you missed the December advance tax deadline, don't panic just yet. There is no direct penalty, but interest will apply. Here's what the Income Tax Act says and how much it may cost you."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-533-points-lower-nifty-below-25900-axis-bank-down-5-percent-2836736-2025-12-16",
      "headline": "Sensex ends 533 points lower, Nifty below 25,900; Axis Bank down 5%The S&P BSE Sensex lost 533.50 points to close at 84,679.86, while the NSE Nifty50 was down by 167.20 points to end at 25,860.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-economy-debt-borrowing-global-finance-comparison-us-dollar-weak-rupee-world-inequality-report-2026-2836731-2025-12-16",
      "headline": "India loses billions yearly as global finance favours rich nations: ReportPoorer and emerging economies like India consistently pay more to the global financial system than they receive back, while rich countries continue to benefit from lower costs and higher returns.​"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/preity-zinta-praises-mukesh-chhabra-says-dhurandhar-casting-was-a-treat-to-watch-2837625-2025-12-17",
      "headline": "Preity Zinta gives shout-out to Mukesh Chhabra for Dhurandhar casting Preity Zinta shared a post and praised casting director Mukesh Chhabra for his impressive work in 'Dhurandhar'. The film is currently running successfully in theatres. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/radhika-apte-reveals-challenges-unfair-treatment-debut-film-vaah-life-ho-toh-aisi-2837598-2025-12-17",
      "headline": "The awful producers didn't put me up, didn't pay me: Radhika Apte on debut film Radhika Apte reflected on her difficult experience during the making of her debut film 'Vaah! Life Ho Toh Aisi!', describing issues with the producers and contract process, as well as highlighting positive interactions with Mahesh Manjrekar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/john-abraham-birthday-celebration-actor-warmth-fan-engagement-bollywood-2837537-2025-12-17",
      "headline": "Watch: John Abraham celebrates 53rd birthday with fans and paparazzi John Abraham marked his 53rd birthday by celebrating with fans and photographers. Pictures and videos of the actor celebrating the same have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-teaser-earns-varun-dhawan-praise-from-colonel-hoshiar-singh-dahiya-family-2837529-2025-12-17",
      "headline": "Border 2 teaser earns Varun Dhawan praise from Colonel Hoshiar Singh Dahiya's family The family of Colonel Hoshiar Singh Dahiya, Param Vir Chakra awardee, has expressed appreciation for Varun Dhawan's portrayal following the release of the 'Border 2' teaser. The late war hero's son Colonel Sushil Singh  Dahiya and granddaughter Anushka Dahiya praised Varun."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-nivetha-thomas-warns-legal-action-over-ai-deepfakes-after-sreeleela-2837511-2025-12-17",
      "headline": "After Sreeleela, actor Nivetha Thomas warns legal action over AI deepfakes Nivetha Thomas has slammed the creation and circulation of AI-generated images using her likeness. She called the act disturbing, unlawful, and a violation of privacy. Earlier, Sreeleela urged the public to refrain from engaging with such content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/melania-trumps-documentary-to-release-in-theatres-on-january-30-watch-teaser-2837520-2025-12-17",
      "headline": "Melania Trump's documentary to release in theatres on January 30. Watch teaser The first teaser for Melania, a documentary on US First Lady Melania Trump, offers a rare behind-the-scenes look at her return to the White House, her role in the inauguration, and her journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-spiritual-retreat-vrindavan-alibaug-trip-2837507-2025-12-17",
      "headline": "Anushka Sharma-Virat Kohli head to Alibaug after spiritual retreat in Vrindavan After visiting Premanand Maharaj in Vrindavan, Anushka Sharma and Virat Kohli were seen travelling to Alibaug. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-cameron-offers-to-film-second-unit-shots-for-ss-rajamouli-varanasi-2837466-2025-12-17",
      "headline": "James Cameron offers to film second unit shots for SS Rajamouli's Varanasi James Cameron, in a virtual interaction with SS Rajamouli, expressed his interest in being the second-unit director on the sets of the latter's film 'Varanasi'. Rajamouli recently reviewed Cameron's 'Avatar: Fire and Ash'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aftab-shivdasani-kasoor-2-his-most-challenging-role-yet-2837487-2025-12-17",
      "headline": "Exclusive: Aftab Shivdasani says Kasoor 2 is his most challenging role yet Aftab Shivdasani, in an exclusive interview, spoke about his upcoming film 'Kasoor 2'. The actor revealed that this is his challenging role so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-promo-amitabh-bachchan-gen-z-lingo-ananya-panday-kartik-aaryan-jumma-chumma-dance-2837445-2025-12-17",
      "headline": "KBC 17: Big B learns Gen Z lingo from Ananya, Kartik joins for Jumma Chumma dance The next episode of 'Kaun Banega Crorepati 17' will see Bollywood actors Kartik Aaryan and Ananya Panday grace the hot seat. A promo shows Amitabh Bachchan learning Gen Z slang lessons and dancing on 'Jumma Chumma' with the actors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ikkis-release-pushed-amid-dhurandhars-box-office-storm-and-avatar-3-arrival-2837478-2025-12-17",
      "headline": "Ikkis release pushed amid Dhurandhar's box office storm and Avatar 3 arrival Ikkis, starring Agastya Nanda and directed by Sriram Raghavan, has rescheduled its release from December 25. The decision was made to avoid competing with the ongoing box office success of Dhurandhar and the imminent release of Avatar: Fire and Ash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/avengers-doomsday-teaser-leak-another-marvel-studio-biggie-another-leak-chris-evans-return-hype-machine-2837350-2025-12-17",
      "headline": "Another Marvel biggie, another leak: The hype machine keeps rolling Rumours around the leaked Avengers: Doomsday teaser have reignited Marvel's familiar pre-release frenzy. As with past MCU blockbusters, leaks have only strengthened fan engagement and speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dino-morea-says-raaz-wouldve-given-him-akshaye-khanna-level-craze-today-2837426-2025-12-17",
      "headline": "Dino Morea says Raaz would've given him Akshaye Khanna-level craze today Actor Dino Morea discussed how the internet has transformed the Bollywood landscape. He shared his thoughts on his own career and the current popularity of Bobby Deol and Akshaye Khanna because of social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-great-indian-kapil-show-promo-first-episode-kapil-sharma-priyanka-chopra-2837348-2025-12-17",
      "headline": "What if Kapil Sharma woke up as Priyanka Chopra? Comedian has a funny answer The promo for the first episode of Season 4 of 'The Great Indian Kapil Show', featuring Priyanka Chopra as the guest, has been released. In the promo, Priyanka is seen asking Kapil Sharma what he would do if he woke up as the 'Citadel' actor one day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ss-rajamouli-reviews-james-cameron-avatar-fire-ash-like-a-child-in-the-theatre-2837393-2025-12-17",
      "headline": "Rajamouli reviews James Cameron's Avatar Fire and Ash: Like a child in the theatre SS Rajamouli reviewed James Cameron's 'Avatar: Fire and Ash'. He praised Cameron's vision for the science-fiction film and recalled his excitement while attending the screening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonali-bendre-celebrates-26-years-of-dahek-says-emotions-remain-unchanged-2837408-2025-12-17",
      "headline": "Sonali Bendre celebrates 26 years of Dahek, says emotions remain unchanged Sonali Bendre celebrated 26 years of Dahek by sharing a nostalgic throwback from the film and recalling her cherished memories with co-star Akshaye Khanna. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/seventeens-new-subunit-dxs-to-release-their-first-mini-album-serenade-2837400-2025-12-17",
      "headline": "SEVENTEEN's new subunit DxS to release their first mini-album Serenade As SEVENTEEN enters its military era, the group is expanding its musical journey through subunits like DxS, ensuring their voice remains vibrant despite enlistments. This strategic shift highlights the group's evolving storytelling, blending emotional depth with diverse musical expressions to keep fans engaged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ott-content-regulation-india-outside-cbfc-jurisdiction-ministry-clarifies-2837354-2025-12-17",
      "headline": "OTT content in India stays beyond censor board's reach, says I&B ministry OTT platforms in India will not fall under the Central Board of Film Certification, with their content instead regulated by a three-tier mechanism established by the Information Technology Rules, 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/housemaid-first-reviews-critics-say-sydney-sweeney-amanda-seyfried-film-is-over-the-top-on-purpose-2837358-2025-12-17",
      "headline": "Housemaid first reviews: Critics say Sydney Sweeney film is over the top on purpose The Housemaid is a glossy crime thriller that has divided critics with its pulpy style and twist-packed storytelling. Led by a starry cast, the film leans into chaos and excess, offering a bold, indulgent watch that doesn't play by conventional rules."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-4th-t20i-called-off-dense-fog-lucknow-2837534-2025-12-17",
      "headline": "Smog 1-0 cricket: 4th T20I abandoned due to poor visibility in LucknowIndia vs South Africa: The fourth T20I at Lucknow's Atal Bihari Vajpayee Stadium was abandoned due to poor visibility on a smoggy evening. The umpires inspected conditions six times before taking the final call. A section of cricket fans slammed the BCCI for scheduling a match in the city during the winter months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pollution-debate-in-lok-sabha-thursday-environment-minister-bhupendra-yadav-respond-at-5-pm-2837615-2025-12-17",
      "headline": "Pollution debate in Lok Sabha today, Environment Minister to respond at 5 pmThe issue dominated proceedings in the Rajya Sabha, where several MPs questioned the Centre on its strategy to tackle hazardous air quality."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kerala-shouldve-hosted-tharoor-as-ind-sa-lucknow-t20i-called-off-due-to-smog-2837588-2025-12-17",
      "headline": "Kerala should've hosted: Tharoor as IND-SA Lucknow T20I called off due to smogOfficials monitored the situation closely, but with player safety at risk, the decision was made to abandon the game without a ball being bowled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-closes-visa-application-centre-in-dhaka-amid-bangladeshi-leaders-threats-2837388-2025-12-17",
      "headline": "India closes visa application centre in Dhaka amid Bangladeshi leaders' threatsIndia closed the Indian Visa Application Centre in Dhaka citing security threats from extremist elements and summoned Bangladesh's envoy to convey serious concerns over the deteriorating situation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-ethiopia-visit-award-malik-ambar-slave-guerrilla-united-deccan-forces-akbar-jahangir-mughals-2837302-2025-12-17",
      "headline": "How an Ethiopian slave challenged Mughal emperors, inspired MarathasAddressing the Ethiopian Parliament, PM Narendra Modi said that India and Ethiopia have shared connections for nearly 2,000 years, exchanging not just gold and spices, but ideas and ways of life. One such remarkable story is that of Malik Ambar, an Ethiopia-born slave. Ambar rose to unite Deccan forces against the Mughals, challenged Akbar and Jahangir and inspired the Marathas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-aqi-air-pollution-crisis-china-embassy-offer-beijing-model-2837248-2025-12-17",
      "headline": "Delhi air crisis: India gets an unsolicited but timely tutorial from ChinaDelhi pollution: Noting that China and India know the struggle with air pollution, the Chinese embassy has offered help to Delhi by posting a step-by-step guide on how Beijing came out of the crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/not-personal-property-culture-ministry-asks-sonia-gandhi-to-return-nehru-letters-taken-in-2008-2837504-2025-12-17",
      "headline": "Govt asks Sonia Gandhi to return Nehru letters taken in 2008: Not personal propertyThe government emphasised that documents related to Jawaharlal Nehru form part of India's documentary heritage and cannot be treated as private property. It said their custody with PMML and access for citizens and scholars is essential for historical research."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/surprised-how-fruit-seller-tackled-bondi-shooter-ahmed-al-ahmed-military-past-syrian-army-sydney-mass-shooting-hanukkah-2837524-2025-12-17",
      "headline": "Surprised how fruit-seller tackled Bondi shooter? Ahmed Al Ahmed has a military pastAhmed Al Ahmed, a Syrian migrant and fruit-seller, became a hero after disarming a terrorist during the mass shooting at Sydney's Bondi Beach. His quick response saved several lives. Ahmed's clinical method of tackling the armed terrorist came from his experience in the Syrian military, revealed his relative."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/fog-abandons-ind-vs-sa-4th-t20i-lucknow-cricket-history-2837586-2025-12-17",
      "headline": "Was Lucknow T20I the first time an international game was abandoned due to fog?Fog played spoilsport in Lucknow on Wednesday, December 17 as the 4th T20I between India and South Africa was abandoned without the toss even happening. Here's a look if this was the first time an international game was abandoned due to poor visibility. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aap-claims-victories-zones-punjab-zila-parishad-panchayat-samiti-polls-2837623-2025-12-17",
      "headline": "AAP claims victories in over 900 zones as Punjab local body poll counting continuesThe AAP said early trends reflected public support for the Bhagwant Mann government, even as opposition parties alleged irregularities during counting.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/supreme-court-allows-ban-of-old-vehicles-below-bs-iv-in-delhi-ncr-modfied-its-earlier-order-2837347-2025-12-17",
      "headline": "Can act against older Delhi-NCR cars below BS-IV: Supreme Court modifies own orderAdditional Solicitor General Aishwarya Bhati, appearing for the Delhi Government, sought a modification for action against vehicles up to BS-III, arguing that continued use of older, highly polluting vehicles was contributing significantly to deteriorating pollution levels."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/video-haryana-rohtak-university-car-tries-to-run-over-students-at-university-chased-attacked-with-stones-2837607-2025-12-17",
      "headline": "Video: Car tries to run over students at university; chased, attacked with stonesThe incident has once again raised serious concerns over security at Maharshi Dayanand University. Locals and students allege that the campus frequently sees the presence of outsiders and unruly elements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/irans-hormuz-coast-turns-blood-red-after-heavy-rain-heres-the-science-behind-it-2837256-2025-12-17",
      "headline": "Iran's Hormuz coast turned blood-red overnight. Science explains whyLocated in the Persian Gulf near the Strait of Hormuz, this small island is already famous for its dramatic landscape and kaleidoscopic geology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-vantara-shivling-shiv-abhishek-meditation-2837566-2025-12-17",
      "headline": "Lionel Messi performs Shiv Abhishek, chants mantra in Anant Ambani's VantaraLionel Messi performed Shiv Abhishek at Anant Ambani's Vantara on Tuesday, December 16. Apart from offering prayers, Messi, along with Luis Suarez and Rodrigo de Paul, meditated in front of the Shivling as well."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/evasive-unconvincing-parliamentary-panel-rap-to-indigo-coo-aviation-officials-2837560-2025-12-17",
      "headline": "IndiGo COO, DGCA officials face Parliament panel's ire: Evasive, unconvincing replyIndiGo COO Isidro Porqueras and senior DGCA officials appeared before a parliamentary panel probing recent air traffic disruptions. However, the panel found their replies \"evasive and unconvincing\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/north-goa-court-orders-five-day-police-custody-for-luthra-brothers-in-nightclub-fire-case-2837565-2025-12-17",
      "headline": "Luthras organised fire activities with full knowledge of risk: Goa Police to courtCalling out gross negligence, the Goa Police told the court that the Luthra brothers had knowingly permitted and organised fireworks inside the restaurant/club without adopting any security measures, despite being fully aware that such activity posed serious fire hazards and was likely to cause loss of life.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/cancer-cure-blood-cancer-leukaemia-incurable-cancer-dna-base-editing-genetic-editing-crispr-cas9-car-t-cell-therapy-lymphoblastic-leukaemia-alyssa-university-college-london-2837461-2025-12-17",
      "headline": "A new hope: Scientists have found a way to cure a rare blood cancerScientists have utilised revolutionary DNA base editing to treat previously incurable T-cell acute lymphoblastic leukaemia. This breakthrough study marks the first human use of base-edited cells to achieve long-term cancer remission.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/asim-munir-donald-trump-meeting-pakistan-troops-gaza-war-2837074-2025-12-17",
      "headline": "Asim Munir's big test as Trump pushes Pakistan to send troops to GazaAsim Munir, who is now Pakistan's chief of defence forces, is expected to fly to Washington to meet President Donald Trump in the coming weeks. The meeting will likely focus on the Gaza stabilisation force."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjp-shares-clip-of-trinamool-mp-kirti-azad-vaping-inside-parliament-anurag-thakur-complaint-2837373-2025-12-17",
      "headline": "Imagine the audacity: BJP shares clip of Trinamool MP 'vaping' inside parliamentAfter days of suspense following Thakur's complaint, BJP IT cell chief Amit Malviya finally revealed the identity of the TMC MP in the video, saying, \"The TMC MP accused by BJP MP Anurag Thakur of vaping inside Parliament is none other than Kirti Azad. For people like him, rules and laws clearly hold no meaning.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/poses-risks-warner-bros-discovery-board-rejects-108-billion-rival-bid-from-paramount-netflix-in-race-2837474-2025-12-17",
      "headline": "Warner Bros rejects Paramount's $108-billion hostile bid, Netflix in raceThe board said Netflix's $27.75-per-share binding merger offers greater certainty, stronger finances and lower risk for shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/shy-bowel-syndrome-parcopresis-symptoms-anxiety-disorder-2837177-2025-12-17",
      "headline": "Shy bowel syndrome is real: Why some people can only poop at homeBreaking wind in public washrooms, the time you spend when taking a dump in the office toilet – all of it can become a point of anxiety for some people. And that makes their bowel shy.  Experts agree."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengal-sir-news-wb-assam-nrc-moment-bjp-tmc-special-intensive-revision-election-commission-hindi-speaking-muslim-constituencies-2837299-2025-12-17",
      "headline": "How SIR in Bengal has thrown up NRC-like surpriseWest Bengal's Special Intensive Revision (SIR) of voter rolls echoes Assam's NRC in intent but, the results were surprising. Despite political expectations of mass deletions and demographic shifts, the draft list showed minimal changes in Muslim-majority districts and higher deletions in Matua and Hindi-speaking areas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/indian-railways-revises-initial-reservation-chart-timing-ease-travel-planning-2837270-2025-12-17",
      "headline": "Railways to allow ticket status check 10 hours before train departurePassengers will now know their train ticket reservation status well in advance as Indian Railways revises chart preparation timings, enabling confirmation details to be available up to 10 hours before the scheduled departure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-government-mandates-50-work-from-home-amid-toxic-air-crisis-warns-of-fines-for-violation-2837126-2025-12-17",
      "headline": "Function at 50% WFH or pay fine: Delhi's mandate to all firms amid air crisisThe Delhi government on Wednesday mandated all government and private companies to function at a 50 per cent work from home mode amid the air pollution crisis."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sandesh-jhingan-questions-crores-spent-messi-tour-indian-football-crisis-2837629-2025-12-18",
      "headline": "No will to invest in Indian football but crores spent on Messi tour: Jhingan Star centre-back Sandesh Jhingan posted a hard-hitting message on social media, questioning the decision to spend crores on Lionel Messi's GOAT India Tour at a time when Indian football has hit rock bottom and the Indian Super League has been indefinitely postponed due to a lack of investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-world-cup-2026-prize-money-50-million-record-payout-ticket-price-controversy-2837621-2025-12-17",
      "headline": "FIFA World Cup winners to get record 50 million USD, much less than Club World Cup FIFA has announced a 50 per cent increase in World Cup prize money for next year's tournament, with the champions set to take home a record $50 million (£37.5 million) for lifting the trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/satwik-rankireddy-chirag-shetty-improve-service-receive-top-badminton-pairs-2837571-2025-12-17",
      "headline": "Satwik and Chirag aim for improvement after gritty win in opening match BWF World Tour Finals: Satwiksairaj Rankireddy and Chirag Shetty clinched a gritty win over Olympic silver medallists Liang Wei Keng and Wang Chang of China in their first group match in the season-ending tournament in Hangzhou. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-eden-gardens-ticket-prices-announced-2837610-2025-12-17",
      "headline": "T20 World Cup: Eden Gardens tickets start at Rs 100, India Super 8 game at Rs 900 The Cricket Association of Bengal has revealed the ticket structure for ICC Men's T20 World Cup matches at Eden Gardens, with prices varying across group-stage and knockout fixtures."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-lucknow-t20i-abandoned-fog-ekana-stadium-2837608-2025-12-17",
      "headline": "Heartbroken, give my money back: Fans demand refund after Lucknow T20I abandoned Fans in Lucknow demanded a refund after the 4th T20I between India and South Africa at the Ekana stadium was abandoned due to fog on Wednesday, December 17. The game was abandoned without the toss even happening. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/fog-abandons-ind-vs-sa-4th-t20i-lucknow-cricket-history-2837586-2025-12-17",
      "headline": "Was Lucknow T20I the first time an international game was abandoned due to fog? Fog played spoilsport in Lucknow on Wednesday, December 17 as the 4th T20I between India and South Africa was abandoned without the toss even happening. Here's a look if this was the first time an international game was abandoned due to poor visibility. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-4th-t20i-called-off-dense-fog-lucknow-2837534-2025-12-17",
      "headline": "Smog 1-0 cricket: 4th T20I abandoned due to poor visibility in Lucknow India vs South Africa: The fourth T20I at Lucknow's Atal Bihari Vajpayee Stadium was abandoned due to poor visibility on a smoggy evening. The umpires inspected conditions six times before taking the final call. A section of cricket fans slammed the BCCI for scheduling a match in the city during the winter months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-vantara-shivling-shiv-abhishek-meditation-2837566-2025-12-17",
      "headline": "Lionel Messi performs Shiv Abhishek, chants mantra in Anant Ambani's Vantara Lionel Messi performed Shiv Abhishek at Anant Ambani's Vantara on Tuesday, December 16. Apart from offering prayers, Messi, along with Luis Suarez and Rodrigo de Paul, meditated in front of the Shivling as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-2026-rules-explained-new-cars-engines-no-drs-2837555-2025-12-17",
      "headline": "DRS out, Overtake mode on: What are the new F1 regulations for 2026 season The new rules and regulations for Formula One 2026 season has been revealed by the FIA on Wednesday, December 17. With no more DRS and the cars getting a bit smaller in size, expect the new season to throw a lot of curveballs to the drivers and the fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-juan-carlos-ferrero-end-coaching-partnership-grand-slam-success-2837530-2025-12-17",
      "headline": "Carlos Alcaraz ends 7-year stint with coach, who says would have loved to continue World No. 1 Carlos Alcaraz and his long-time coach Juan Carlos Ferrero have ended their partnership after over seven years, marking the close of a highly successful chapter in men's tennis. Ferrero, a former No. 1 himself, said he would have loved to continue working with Alcaraz. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-4th-t20i-smog-or-fog-toss-delayed-bcci-slammed-winter-2837526-2025-12-17",
      "headline": "December T20I in Lucknow? Fans slam BCCI after dense fog delays IND vs SA clash IND vs SA, 4th T20I: Thick fog delayed India's fourth T20I match in Lucknow on Wednesday. Fans were left angry after the match did not start on time and slammed the BCCI over their poor scheduling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-sa-hardik-pandya-wears-mask-fog-lucknow-t20i-delayed-2837519-2025-12-17",
      "headline": "Smog or fog? Hardik Pandya wears mask during training as Lucknow T20I delayedIndian all-rounder Hardik Pandya was seen wearing a face mask as dense fog blanketed the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, delaying the toss in the fourth T20I between India and South Africa in Lucknow."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-ruled-out-lucknow-t20i-south-africa-foot-injury-2837505-2025-12-17",
      "headline": "IND vs SA: Out-of-form Shubman Gill ruled out of Lucknow T20I due to foot injuryOut-of-form Shubman Gill has been ruled out of the Lucknow T20I against South Africa due to a foot injury. Sanju Samson is expected to return to the top of the order after Gill's setback. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-banned-afc-competitions-2027-refusal-travel-iran-2837491-2025-12-17",
      "headline": "AFC bans Mohun Bagan SG from 2027 to 28 tournaments, imposes fineIndian Super League champions Mohun Bagan Super Giant have been banned from all AFC club competitions until the 2027–28 season and fined over USD 100,000 for refusing to travel to Iran for a scheduled group-stage match against Sepahan SC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srk-fan-sarthak-ranjan-kkr-ipl-2026-auction-manifestation-2837482-2025-12-17",
      "headline": "Manifestation works: SRK, Gambhir fan Ranjan's wish to play for KKR comes trueShah Rukh Khan and Gautam Gambhir fan Sarthak Ranjan was able to fulfil his wish of playing for KKR after being picked by the three-time IPL champions during the 2026 auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-booed-sydney-bbl-poor-form-sixers-strikers-2837455-2025-12-17",
      "headline": "Was Babar Azam booed by own fans in BBL? Video from Sixers vs Strikers go viralBabar Azam poor run of form in the Big Bash League continued as he was dismissed for 9 runs in the match against Adelaide Strikers. Babar was seemingly booed off the park following his latest match by the home crowd in Sydney. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-rahman-kkr-ipl-2026-auction-record-availability-exclusive-2837404-2025-12-17",
      "headline": "Will KKR's Rs 9.2 crore recruit Mustafizur be available for all of IPL 2026?Mustafizur Rahman is set to miss a few games in the Indian Premier League (IPL) with Kolkata Knight Riders (KKR), as the pacer is expected to return home for Bangladesh's white-ball series against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-10-crore-limited-edition-richard-mille-watch-vantara-anant-ambani-2837406-2025-12-17",
      "headline": "Did Anant Ambani gift Lionel Messi Rs 10 crore Richard Mille watch in Vantara?Lionel Messi's India tour ended at Vantara, where a viral claim about a Rs 10 crore Richard Mille watch gifted by Anant Ambani set social media abuzz, adding intrigue to the GOAT's visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/viswanathan-anand-returns-tata-steel-chess-india-2025-mentor-versus-protege-showdown-2837387-2025-12-17",
      "headline": "Gukesh vs Anand set as Tata Steel Chess as ex-World Champ returns after 6 yearsViswanathan Anand will return to competitive chess at Tata Steel Chess India 2025, meeting reigning world champion D Gukesh on home soil. The event features top international and Indian talents, with both Open and Women's rapid and blitz formats and equal prize money offered."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-live-score-ind-vs-sa-4th-t20i-match-coverage-lucknow-2837394-2025-12-17",
      "headline": "4th T20I Highlights: Match called off in foggy Lucknow after six inspectionsIndia (IND) vs South Africa (SA) Highlights: After six inspections, the umpires finally decide to call off the match. Poor visibility due to fog led to the abandonment. The officials waited three hours, hoping (against hope) for the weather to improve. India are leading the series 2-1. The final match will be played on Friday in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/snicko-controversy-adelaide-test-alex-carey-england-fuming-2837355-2025-12-17",
      "headline": "Snicko chaos in Ashes Adelaide Test: Why England were left fumingEngland were left fuming at the end of Day 1 of the Adelaide Test as Alex Carey admitted that he got a lucky break as the Snicko came to the rescue of the Australian wicketkeeper on Wednesday, December 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-how-auction-top-buys-fared-cameron-green-duck-record-kkr-liam-livingstone-fifty-2837334-2025-12-17",
      "headline": "Duck for Green, Livingstone shines: How IPL auction's top buys fared in last 24 hours?IPL 2026 auction: From a match-winning 76 to a first-ball duck, IPL auction's biggest buys were under the spotlight within 24 hours. Here's how the league's costliest signings fared immediately after the hammer fell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-sridhar-appointed-sri-lanka-fielding-coach-icc-t20-world-cup-2026-2837320-2025-12-17",
      "headline": "Former India fielding coach joins Sri Lanka ahead of T20 World Cup 2026Former India fielding coach R. Sridhar has been appointed Sri Lanka's fielding coach until March 2026 to sharpen their on-field standards ahead of the ICC Men's T20 World Cup co-hosted by India and Sri Lanka.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kolkata-knight-riders-sign-matheesha-pathirana-18-crore-ipl-2026-auction-2837308-2025-12-17",
      "headline": "Hit-and-miss bowler? KKR's Pathirana move labelled gamble by Kris SrikkanthFormer Indian captain Kris Srikkanth has voiced concerns about Kolkata Knight Riders' high-profile purchase of Sri Lankan pacer Matheesha Pathirana, highlighting risks associated with getting the Sri Lankan pacer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alex-carey-maiden-ashes-century-emotional-tribute-adelaide-test-2837263-2025-12-17",
      "headline": "Alex Carey pays emotional tribute to late father after maiden Ashes centuryAlex Carey marked a deeply emotional milestone by scoring his maiden Ashes century at his home ground in Adelaide, paying tribute to his late father after ending a long wait for a hundred in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-highest-rated-indian-t20i-bowler-surpasses-jasprit-bumrah-2837254-2025-12-17",
      "headline": "Varun Chakravarthy breaks Bumrah's record, achieves new high in T20I rankingsVarun Chakravarthy has become the highest-rated Indian bowler in ICC T20I rankings. He surpassed Jasprit Bumrah's feat from 2017 against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-chennai-super-kings-move-on-ms-dhoni-trade-sanju-samson-2837247-2025-12-17",
      "headline": "At some point MS Dhoni will move on: Fleming on CSK's trade to bring in Sanju SamsonIPL 2026: Chennai Super Kings have begun planning for life after MS Dhoni, with the trade for Sanju Samson signalling a clear shift towards succession planning and a younger, future-focused squad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-steve-smith-on-field-banter-border-gavaskar-2014-15-2837235-2025-12-17",
      "headline": "Watch: Rohit recalls heated exchange with Steve Smith in 2014-15 Australia tourRohit Sharma recalled a heated on-field exchange with Steve Smith during the 2014–15 Border-Gavaskar Trophy in Australia, sparked by an LBW appeal while he was bowling part-time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indias-untapped-potential-athletics-world-athletics-president-2030-commonwealth-games-2837227-2025-12-17",
      "headline": "CWG 2030 in Ahmedabad to unlock India's potential: World Athletics' Sebastian CoeWorld Athletics chief Sebastian Coe emphasises the strategic significance of India and the reintroduction of historic athletic events ahead of the 2030 Commonwealth Games in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-26-day-1-adelaide-alex-carey-hundred-usman-khawaja-australia-emotions-archer-burst-rememberance-2837218-2025-12-17",
      "headline": "Alex Carey, Usman Khawaja lift Australia after Archer burst on a day of remembranceThe Ashes, 3rd Test Day 1: Emotion hung heavy over Adelaide as Alex Carey's defiant Ashes hundred lifted Australia to 326/8 on a day shaped by remembrance, an Archer-led new-ball burst, and a timely Khawaja comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-sign-matheesha-pathirana-bowling-ipl-2026-irfan-pathan-2837211-2025-12-17",
      "headline": "Irfan Pathan praises KKR's Pathirana deal, says they have perfect IPL bowling attackKKR strengthened their IPL 2026 bowling attack by acquiring Matheesha Pathirana for Rs 18 crore in the auction on Tuesday, creating a balanced lineup across all phases of a T20 innings."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}