{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/movie-isnt-over-gita-gopinath-on-trump-tariffs-and-carneys-speech-2855847-2026-01-21",
      "headline": "Movie isn't over: Gita Gopinath on Trump tariffs and Carney's speechGita Gopinath, Indian-American economist and Professor of Economics at Harvard University, shares her insights on Canadian Prime Minister Mark Carney's remarks on shifting global economic order during the World Economic Forum in Davos and dealing with tariffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pollution-a-bigger-economic-threat-than-tariffs-for-india-says-gita-gopinath-world-economic-forum-davos-2855620-2026-01-21",
      "headline": "Pollution a bigger economic threat than tariffs for India, says Gita GopinathGopinath said discussions about new business development often focus on trade, tariffs and regulations, but pollution is rarely given the importance it deserves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/wef-roundtable-can-india-become-the-third-largest-economy-experts-weigh-in-2855821-2026-01-21",
      "headline": "WEF Roundtable: Can India become the third-largest economy? Experts weigh inAt World Economic Forum (WEF) Roundtable in Davos, India Today Group Vice-Chairperson and Executive Editor-in-Chief Kalli Purie moderated a session on India's growth story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-trusted-value-chain-partner-ashwini-vaishnaw-davos-wef-2026-2855582-2026-01-21",
      "headline": "India has emerged as trusted value chain partner to the world: Ashwini VaishnawUnion Minister Ashwini Vaishnaw said the biggest change over the last decade has been how the world views India's role in global manufacturing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-world-third-largest-economy-world-economic-forum-davos-session-2855697-2026-01-21",
      "headline": "Can India become the world's third-largest economy?At Davos, a session moderated by India Today Group Vice-Chairperson and Executive Editor-in-Chief Kalli Purie brought together leading economist Gita Gopinath, Union Minister Ashwini Vaishnaw, Bharti Chairman Sunil Bharti Mittal, and IKEA Group CEO Juvencio Maeztu Herrera to decode India's journey towards becoming the world's third-largest economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/markets-will-fall-and-bounce-back-says-gita-gopinath-on-uncertain-global-outlook-world-economic-forum-wef-in-davos-2855762-2026-01-21",
      "headline": "Markets will fall and bounce back, says Gita Gopinath on uncertain global outlookGopinath said she had earlier believed the world had passed the peak of tariff tensions by 2025. However, developments at the start of 2026, including tensions over Greenland and a visible rupture between the US and the European Union, changed that view."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/autumn-davos-india-business-summit-ashwini-vaishnaw-wef-2855597-2026-01-21",
      "headline": "An Autumn Davos in India? Ashwini Vaishnaw flags new idea at WEFUnderscoring the growing global recognition of the country's economic reforms and investment momentum, Union Minister Vaishnaw pitched for an 'Autumn Davos' at the World Economic Forum (WEF)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-nifty-extend-losses-rupee-hits-record-low-foreign-selling-global-trade-worries-2855590-2026-01-21",
      "headline": "Sensex, Nifty extend losses a day after sharp sell-off; rupee hits record lowThe Nifty 50 closed 0.3% lower at 25,157.5, while the BSE Sensex slipped 0.33% to settle at 81,909.63. Both indices touched fresh three-month lows during the day. In the previous session, the Nifty had fallen 1.4% and the Sensex had dropped 1.3%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomatos-deepinder-goyal-to-quit-as-eternal-ceo-blinkit-ceo-albinder-singh-dhindsa-to-take-charge-2855580-2026-01-21",
      "headline": "Zomato's Deepinder Goyal steps down as Eternal CEO, Albinder Dhindsa to take overThe online delivery firm, which runs food delivery platform Zomato and quick commerce arm Blinkit, reported a sequential increase in profit for the third quarter, driven by strong demand for quick-delivery services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-ai-push-puts-it-on-path-to-global-tech-powerhouse-says-ashwini-vaishnaw-world-economic-forum-davos-2855515-2026-01-21",
      "headline": "India's AI push puts it on path to global tech powerhouse, says Ashwini VaishnawThe Union Minister said AI is now being used almost everywhere, making it essential for countries to build capabilities across all layers of the technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/eu-india-trade-deal-news-why-european-union-free-trade-agreement-mother-of-all-deals-jolt-us-president-donald-trump-2855430-2026-01-21",
      "headline": "Why EU-India FTA will be Mother of All Deals, and Trump deserves a thanksAfter almost two decades of work and negotiations, the India-EU Free Trade Agreement (FTA) is the closest it has ever been to fruition. The deal would not only benefit both sides enormously, but also come as a rude awakening for US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-industries-share-price-fall-january-oversold-buy-or-sell-ril-stock-down-2855487-2026-01-21",
      "headline": "RIL shares face January blues, trade at 5-year oversold levels. Should you buy?RIL share price: The country's most valuable listed company with a market value of close to $210 billion, has seen its shares slide sharply since the start of the year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-hits-record-rs-157-lakh-is-it-time-to-buy-hold-or-sell-2855469-2026-01-21",
      "headline": "Gold hits record Rs 1.57 lakh: Is it time to buy, hold or sell?Gold has touched a new peak of Rs 1.57 lakh, fuelled by rising geopolitical tensions and safe-haven demand. As the rally gathers pace, the key question for investors is whether to enter now or wait for a pullback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/why-global-investors-are-betting-on-india-ananya-birla-wef-2855457-2026-01-21",
      "headline": "AI, trade risks and growth: Why India still stands out for global investorsAnanya Birla, Director at the Aditya Birla Group, spoke about trade disruptions and tariffs, saying short-term volatility cannot be ignored. However, she said long-term investors continue to see India as a stable and high-growth market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-30-coming-soon-new-platform-core-banking-system-and-regional-language-support-2855435-2026-01-21",
      "headline": "EPFO 3.0 coming soon: New platform, core banking system and regional language supportThe Employees' Provident Fund Organisation (EPFO) is preparing for its next major digital upgrade, EPFO 3.0. The move aims to make PF services faster, more user-friendly and accessible to workers across both organised and unorganised sectors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/kalyan-jewellers-share-price-down-sharply-why-is-it-falling-today-2855419-2026-01-21",
      "headline": "Kalyan Jewellers share price tumbles 12%: Why is the stock falling today?While the broader market was weak, the depth of the fall pointed to a mix of technical stress, institutional activity and sector-specific caution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rupee-91-per-us-dollar-why-is-indian-currency-falling-explained-2855409-2026-01-21",
      "headline": "Rupee slides past 91 per US dollar: What is driving the fall?The sharp slide came as global uncertainty rose once again. Investors worldwide have been shifting money toward safer assets, which has strengthened the US dollar and put pressure on emerging market currencies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-900-points-why-stock-market-is-falling-today-crash-us-eu-greenland-trump-tariff-2855391-2026-01-21",
      "headline": "Sensex tumbles 900 points: 5 reasons why the stock market is falling todayAt 11:07 am, the Sensex was down 895.64 points to 81,303.08, while the Nifty dropped 252.35 points to trade at 24,980.15. Read to know the key factors behind today's bloodbath on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-record-high-rally-continues-what-next-explained-2855370-2026-01-21",
      "headline": "Gold at record highs, silver inching closer to Rs 3.5 lakh: Should you buy now?With both metals roaring to lifetime levels, investors are torn between fear of heights and fear of missing out. Whether this is a peak or a fresh beginning is the real question now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-long-term-investment-ananya-birla-wef-davos-2026-2855364-2026-01-21",
      "headline": "India remains top investment bet despite global volatility: Ananya BirlaSpeaking about the global business environment, Ananya Birla said artificial intelligence is changing the way companies operate at a rapid pace."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-to-be-inducted-as-second-youngest-member-into-songwriters-hall-of-fame-2855846-2026-01-21",
      "headline": "Taylor Swift joins Songwriters Hall of Fame as one of its youngest members ever Taylor Swift has been inducted into the Songwriters Hall of Fame as one of its youngest members in history. The 36-year-old submitted All Too Well (10 Minute Version), Blank Space, Anti-Hero, Love Story and The Last Great American Dynasty for her successful nomination.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-plans-a-free-comeback-performance-at-south-korea-historic-gwanghwamun-square-2855829-2026-01-21",
      "headline": "BTS plans a free comeback performance at South Korea's historic Gwanghwamun Square BTS is planning a 'free' comeback performance at South Korea's historic Gwanghwamun Square. The first solo concert will link BTS to Korean heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sanjay-leela-bhansali-to-represent-indian-cinema-at-republic-day-parade-report-2855813-2026-01-21",
      "headline": "Sanjay Leela Bhansali to represent Indian cinema at Republic Day parade: Report Sanjay Leela Bhansali, in a first-ever, will represent Indian cinema at the 2026 Republic Day parade. He will present a special tableau at Kartavya Path on January 26, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishal-sundar-c-reunite-purushan-tamannaah-yogi-babu-2855804-2026-01-21",
      "headline": "Tamannaah Bhatia, Vishal team up again for Sundar C's next, title teaser out Vishal and director Sundar C have teamed up for the fourth time, officially announcing their new film Purushan. The title reveal teaser introduces Tamannaah as the female lead, with Yogi Babu featuring in a supporting role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mayasabha-trailer-jaaved-jaaferis-film-is-a-dark-tale-of-greed-and-missing-gold-2855768-2026-01-21",
      "headline": "Mayasabha trailer: Jaaved Jaaferi's film is a dark tale of greed and missing gold The trailer of Jaaved Jaaferi's psychological-thriller Mayasabha was released on January 21, 2026. The film revolves around a mystery of missing gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/oscars-2026-nominations-check-out-when-and-where-to-watch-live-in-india-2855722-2026-01-21",
      "headline": "Oscars 2026 nominations: Check out when and where to watch live in India The much-anticipated Oscars 2026 nominations will be announced on January 22, 2026. Here are the details about when and where to watch the 98th Academy Award announcement live in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vishal-bhardwaj-romeo-legal-notice-gangster-family-consent-dispute-2855724-2026-01-21",
      "headline": "O' Romeo: Vishal Bhardwaj on not seeking consent of Hussain Ustara's family Vishal Bhardwaj addressed controversy over O'Romeo's claim of being based on true events. The director clarified the film is a fictionalised narrative inspired by a published book, amid legal demands from the gangster's family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anti-hindi-agitations-film-parasakthi-sivakarthikeyan-atharvaa-gv-prakash-100th-composition-2855611-2026-01-21",
      "headline": "Sudha Kongara wanted Abhishek Bachchan, Vijay Devarakonda cameos for Parasakthi Director Sudha Kongara revealed her process behind selecting cameo roles in Parasakthi and details her approach, including attempts to involve Abhishek Bachchan and Vijay Deverakonda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chatha-pacha-advance-bookings-mohanlal-mammootty-cameo-malayalam-film-2855675-2026-01-21",
      "headline": "Mohanlal opens bookings for Chatha Pacha; hints at Mammootty cameo? Mohanlal launched advance ticket sales for the Malayalam film Chatha Pacha: The Ring of Rowdies. The film, starring Arjun Ashokan, Roshan Mathew among others, is set to release in theatres on January 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/this-is-fake-turkish-actor-hande-ercel-denies-calling-shah-rukh-khan-uncle-2855618-2026-01-21",
      "headline": "This is fake: Turkish actor Hande Ercel denies calling Shah Rukh Khan uncle Turkish actor Hande Ercel has denied referring to Shah Rukh Khan as 'uncle', while putting an end to viral rumours. Ercel was present at the Joy Awards, also attended by Shah Rukh and other popular celebrities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nana-patekar-walk-out-of-oromeo-trailer-launch-event-amid-shahid-kapoor-triptii-dimri-delay-vishal-bhardwaj-jokes-hes-bully-viral-video-2855612-2026-01-21",
      "headline": "Nana Patekar walks out of O'Romeo trailer event, Vishal Bhardwaj jokes he's bully Nana Patekar walked out of the O'Romeo trailer launch after waiting over an hour for his co-stars. Director Vishal Bhardwaj later addressed the media about the veteran actor's exit, referring to him as a child who likes to bully."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ridhi-dogra-confirms-participation-in-the-50-reality-show-2855615-2026-01-21",
      "headline": "Ridhi Dogra confirms participation in The 50: Going into the Lion's Den Actor Ridhi Dogra has confirmed her participation in the upcoming reality show The 50, which debuts February 1, 2026. The series, adapted from the French format Les Cinquante, brings together 50 celebrities to compete in high-stakes challenges for a major prize."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dacoit-film-wraps-mrunal-thakur-shoot-adivi-sesh-returns-hindi-telugu-action-drama-2855554-2026-01-21",
      "headline": "Mrunal Thakur wraps filming for Adivi Sesh's Dacoit, set for March 2026 release The makers announced completion of Mrunal Thakur's shoot, with the film set for theatrical release on March 19, 2026 in both Hindi and Telugu. The movie, directed by Shaneil Deo, features Adivi Sesh in the lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/uae-first-female-filmmaker-nayla-al-khaja-defends-ar-rahman-national-treasure-2855557-2026-01-21",
      "headline": "UAE's first female filmmaker Nayla Al Khaja defends AR Rahman: National treasure UAE's 1st female filmmaker, Nayla Al Khaja, defended AR Rahman against backlash over his remarks about communal bias in the film industry. Al Khaja urged people to choose love over hate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshans-bollywood-biceps-refuse-to-age-internet-asks-really-52-2855584-2026-01-21",
      "headline": "Hrithik Roshan's 'Bollywood biceps' refuse to age, internet asks: Really 52? Hrithik Roshan dropped what can be seen as the most ravishing 2016 photo-dump on social media. The actor showed off his sculpted body, while talking about the pressure of dealing with his self-obsession of having \"Bollywood biceps.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/amid-beckham-saga-victoria-posts-birthday-wishes-for-ex-spice-girl-emma-bunton-2855563-2026-01-21",
      "headline": "Amid Beckham saga, Victoria posts birthday wishes for ex-Spice Girl Emma Bunton Victoria Beckham shared warm birthday wishes for ex-Spice Girls bandmate Emma Bunton. This is Victoria's first public post amidst a family feud with son Brooklyn.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-a-small-film-like-dhandoraa-matters-to-telugu-cinema-2855536-2026-01-21",
      "headline": "Why a small film like Dhandoraa matters to Telugu cinema  A quiet Telugu social drama, Dhandoraa has found renewed attention after its OTT release for its restrained take on caste and everyday injustice.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rachel-mcadams-hollywood-walk-of-fame-star-25-years-acting-2855538-2026-01-21",
      "headline": "Rachel McAdams gets her Walk of Fame star, thanks Diane Keaton in emotional speech Canadian actor Rachel McAdams, known for her roles in Mean Girls and The Notebook, was awarded a star on the Hollywood Walk of Fame on Tuesday, with colleagues and family celebrating her 25-year career."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/varun-dhawan-transformation-pvc-hero-hoshiyar-singh-border-2-2855517-2026-01-21",
      "headline": "Why was Varun Dhawan chosen to play Param Vir Hoshiyar Singh in Border 2? Read here Producer Nidhi Dutta revealed why Varun Dhawan was chosen to play Major Hoshiyar Singh in Border 2. She condemned negative PR against the actor portraying a Param Vir Chakra hero."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-cancels-tariff-threat-over-greenland-nato-mark-rutte-agreed-to-framework-on-arctic-glbs-2855880-2026-01-22",
      "headline": "Trump drops Greenland tariff threat after talks with NATO chief on future frameworkThe US President said the proposed framework would be good for both the US and its NATO allies, and said that's why he decided to drop the tariffs. He added that talks were continuing on the \"Golden Dome\" related to Greenland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/no-country-in-position-to-secure-greenland-except-us-trump-at-davos-2855761-2026-01-21",
      "headline": "Greenland's just a piece of ice, say no and we'll remember, Trump warns Europe  Live UpdatesThe US President also said that no nation can secure Greenland as the United States. Calling Greenland 'a piece of ice,' he said it is a very small ask. Trump also ruled out the use of force in his bid to control Greenland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-world-third-largest-economy-world-economic-forum-davos-session-2855697-2026-01-21",
      "headline": "Can India become the world's third-largest economy?At Davos, a session moderated by India Today Group Vice-Chairperson and Executive Editor-in-Chief Kalli Purie brought together leading economist Gita Gopinath, Union Minister Ashwini Vaishnaw, Bharti Chairman Sunil Bharti Mittal, and IKEA Group CEO Juvencio Maeztu Herrera to decode India's journey towards becoming the world's third-largest economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-ind-vz-nz-shashi-tharoor-x-tweet-2855879-2026-01-22",
      "headline": "Gambhir reacts to Tharoor's PM Modi post, says pitted against his own teamIND vs NZ: After India's win in the 1st T20I against New Zealand, head coach Gautam Gambhir put in a bizarre tweet. Reacting to Shashi Tharoor's tweet of him, Gambhir said that he was being pitted against his own team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-showed-how-to-deal-with-trump-europe-world-leaders-lessons-2855436-2026-01-21",
      "headline": "PM Modi saw the Trump trap coming. Other leaders didn'tEurope learnt it the hard way that trade agreements and flattery do not insulate even close allies from Trump's tariffs. Prime Minister Narendra Modi read the US President right months ahead and helped India avoid the Trump trap. The world should take note."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pollution-a-bigger-economic-threat-than-tariffs-for-india-says-gita-gopinath-world-economic-forum-davos-2855620-2026-01-21",
      "headline": "Pollution a bigger economic threat than tariffs for India, says Gita GopinathGopinath said discussions about new business development often focus on trade, tariffs and regulations, but pollution is rarely given the importance it deserves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20-world-cup-icc-india-2855865-2026-01-22",
      "headline": "Bangladesh to decide on T20 World Cup participation after meeting cricketersThe Bangladesh government will take a call on T20 World Cup participation in a cabinet meeting on Thursday, January 22. The sports advisor will also meet the cricketers and take their opinion on participation in the World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/putin-greenland-purchase-doesnt-concern-russia-does-maths-on-donald-trump-bid-glbs-2855891-2026-01-22",
      "headline": "Putin says Greenland issue doesn't concern Russia, does maths on Trump's bidRussian President Putin noted that the United States has a long history of territorial acquisitions, including Alaska, which Washington purchased from Russia in the 19th century. Drawing a comparison with Greenland, he speculated that the cost would be well within America's means."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-chaos-us-policy-reaction-america-trade-deficit-tariffs-immigration-nato-china-global-order-2855593-2026-01-21",
      "headline": "No, Trump isn't the chaosHandcrafted ByOur Editors US President Donald Trump's sharp and blunt moves on immigration, tariffs, Nato and trade are not the source of the chaos but a response to it. The world was witnessing a silent chaos and the US had been at the receiving end amid China's rapid rise. Trump chose to act, and act fast. And that felt like a sonic boom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/will-have-a-great-deal-with-india-trump-calls-pm-modi-a-fantastic-leader-at-davos-2855814-2026-01-21",
      "headline": "Will have a great deal with India: Trump calls PM Modi a fantastic leader at DavosDonald Trump expressed confidence in sealing a strong India–US trade deal, praising Narendra Modi as a \"fantastic leader\" while highlighting ongoing engagement despite past tariff disputes.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-lives-because-of-us-donald-trump-to-mark-carney-after-fiery-speech-2855798-2026-01-21",
      "headline": "Remember that, Mark…: Trump's message to Canada PM on fiery Davos speechA day after Canadian Prime Minister Mark Carney declared at the World Economic Forum that the US-led global order was fading, Donald Trump needled him on the same stage, saying the US's northern neighbour was \"not grateful\" despite receiving several \"freebies\" from Washington, DC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/yuvraj-mehta-cctv-trail-shows-last-moments-of-noida-techie-before-drowning-in-water-filled-pit-2855767-2026-01-21",
      "headline": "CCTV trail shows last moments of Noida techie before drowning in water-filled pitAajtak accesses the complete chronology of the movements of Noida techie Yuvraj Mehta on the day his car plunged into the water-filled pit in Greater Noida. Here is a minute-by-minute timeline to show what happened after he left office. Read here...."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/vlogger-gives-a-sneak-peek-of-vande-bharat-first-class-calls-it-5-star-on-wheels-2855765-2026-01-21",
      "headline": "Vlogger gives a sneak-peek of Vande Bharat first class, calls it '5 star on wheels'A video by vlogger Yash Bajpai offers a look inside India's first Vande Bharat sleeper train, which launched service between Howrah and Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/india-weather-forecast-january-22-rain-snow-western-disturbance-temperature-rise-imd-2855733-2026-01-21",
      "headline": "Rain and rising temperatures to hit parts of north India on ThursdayAn intense western disturbance will bring widespread rain and snow to parts of north India on Thursday, January 22. Minimum temperatures are expected to rise by two to four degrees Celsius across the plains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/8-islamic-nations-to-join-trump-board-of-peace-gaza-check-who-is-in-and-who-is-out-glbs-2855871-2026-01-22",
      "headline": "8 Islamic nations agree to join Trump's Board of Peace while Europe drifts apartEight Muslim-majority countries have agreed to join US President Donald Trump's proposed Board of Peace. This move supports a US-led plan to end the Gaza conflict but faces resistance from some European nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-1st-t20i-abhishek-sharma-glenn-phillips-nagpur-report-2855827-2026-01-21",
      "headline": "India crush New Zealand in Nagpur, begin final T20 World Cup preps in styleIND vs NZ, 1st T20I: Suryakumar Yadav's India took a 1-0 lead in the five-match series after hammering New Zealand by 48 runs at the VCA Stadium in Nagpur. Abhishek Sharma was the star performer for the hosts with 84 runs off 35 balls. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-eknath-shinde-shiv-sena-raj-thackeray-mns-alliance-kalyan-dombivli-kdmc-2855519-2026-01-21",
      "headline": "Maha puzzle: Shinde Sena-MNS tie-up derails BJP's mayor bid in KalyanIn Kalyan-Dombivli, the Eknath Shinde-led Shiv Sena kept aside its bitter rivalry with Raj Thackeray's Maharashtra Navnirman Sena (MNS) to stitch up an alliance to prevent the BJP from securing the mayor's post."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/india-today-special-garbage-governance-and-neglect-inside-delhi-waterlogged-hell-2855755-2026-01-21",
      "headline": "Garbage, governance and neglect: Inside Delhi's waterlogged hellDespite the monsoons and no nearby rivers, hundreds of homes in Sharma Enclave and Sharma Colony are submerged in water so filthy that even breathing, let alone living, seems impossible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/saw-macron-with-beautiful-sunglasses-what-the-hell-happened-trump-at-davos-2855811-2026-01-21",
      "headline": "Saw Macron with beautiful sunglasses, what the hell happened: Trump at DavosSpeaking at the World Economic Forum in Davos on Wednesday, Trump took a characteristically blunt yet curious swipe at Macron, referring to the French leader's much-discussed sunglasses. Here is what he said..."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-bangladesh-t20-world-cup-request-india-bcb-controversy-2855682-2026-01-21",
      "headline": "ICC votes to replace Bangladesh with Scotland if it doesn't play in IndiaT20 World Cup: The ICC has told the Bangladesh Cricket Board (BCB) to inform the Bangladesh government that if the team continues to refuse to travel to India for the 2026 T20 World Cup, it will be replaced by another side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mark-carney-exposes-western-hypocrisy-at-davos-signals-dawn-of-post-american-realism-2855414-2026-01-21",
      "headline": "Why the world must thank Mark CarneyCanadian PM Mark Carney's Davos speech shreds the myth of a fair Western order, calling out the US as a disruptor. His advice to middle powers amidst Trump's tariffs and threats: adapt or perish."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/nodejs-creator-says-era-of-humans-writing-code-is-over-suggests-next-options-for-software-engineers-2854873-2026-01-20",
      "headline": "NodeJS creator says era of humans writing code is overThe state of Vibe Coding in early 2026 is such that even seasoned software developers are now saying that the days of manually writing code are over. The latest in line to say this is NodeJS creator Ryan Dahl. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/video-trump-fluffs-greenland-iceland-wef-davos-speech-rules-out-use-force-denmark-europe-nato-allies-2855826-2026-01-21",
      "headline": "Video: Trump fluffs Greenland with Iceland during Davos speechUS President Donald Trump confused Greenland with Iceland during his Davos address, while insisting that no country other than the US can secure the Danish territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sahara-desert-snowfall-2026-northern-algeria-ain-sefra-weather-news-2855746-2026-01-21",
      "headline": "Sahara turns white: Why is it snowing in the desert?Rare snowfall has transformed the golden dunes of northern Algeria into a stunning winter landscape. Cold air from Europe collided with Mediterranean moisture to create this extraordinary desert phenomenon."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-live-updates-day-5-novak-djokovic-jannik-sinner-iga-swiatek-2855866-2026-01-22",
      "headline": "Australian Open live updates: Djokovic, Sinner and Swiatek headline Day 5 at Australian Open 2026 Australian Open 2026 Live: Novak Djokovic, Jannik Sinner and Iga Swiatek headline a packed Day 5 at the Australian Open 2026, with Naomi Osaka and several top seeds also in action across Melbourne on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-ind-vz-nz-shashi-tharoor-x-tweet-2855879-2026-01-22",
      "headline": "Gambhir reacts to Tharoor's PM Modi post, says pitted against his own team IND vs NZ: After India's win in the 1st T20I against New Zealand, head coach Gautam Gambhir put in a bizarre tweet. Reacting to Shashi Tharoor's tweet of him, Gambhir said that he was being pitted against his own team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-abhishek-sharma-batting-2855878-2026-01-22",
      "headline": "Abhishek Sharma jokes after Nagpur carnage: I don't have a lot of shots IND vs NZ: India opener Abhishek Sharma joked at the end of the 1st T20I that he did not have enough shots in his arsenal. Sharma said that he only had a few, and he tried to execute them well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20-world-cup-icc-india-2855865-2026-01-22",
      "headline": "Bangladesh to decide on T20 World Cup participation after meeting cricketers The Bangladesh government will take a call on T20 World Cup participation in a cabinet meeting on Thursday, January 22. The sports advisor will also meet the cricketers and take their opinion on participation in the World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-1st-t20i-abhishek-sharma-glenn-phillips-nagpur-report-2855827-2026-01-21",
      "headline": "India crush New Zealand in Nagpur, begin final T20 World Cup preps in style IND vs NZ, 1st T20I: Suryakumar Yadav's India took a 1-0 lead in the five-match series after hammering New Zealand by 48 runs at the VCA Stadium in Nagpur. Abhishek Sharma was the star performer for the hosts with 84 runs off 35 balls. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-third-fastest-indian-9000-t20-runs-new-zealand-2855808-2026-01-21",
      "headline": "Suryakumar Yadav shows signs of form, becomes 3rd fastest Indian to 9000 T20 runs IND vs NZ, 1st T20I: Suryakumar Yadav showed signs of returning to form, becoming the third-fastest Indian to 9,000 T20 runs with a fluent 32 off 22 balls against New Zealand on Wednesday in Nagpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-84-completes-5000-t20-runs-india-vs-new-zealand-nagpur-2855801-2026-01-21",
      "headline": "Abhishek Sharma dazzles Nagpur with 35-ball 84, completes 5000 T20 runs Star India opener Abhishek Sharma lit up Nagpur with a blazing 35-ball 84 in the first T20I against New Zealand on Wednesday and became the fourth-fastest Indian batter to cross 5000 runs in T20 cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/woman-pleads-rohit-sharma-security-breach-daughters-costly-treatment-2855787-2026-01-21",
      "headline": "Didn't stop Rohit Sharma for selfie: Woman explains shocking security breach in Indore A woman breached security at the Indian team hotel in Indore on Sunday in an attempt to meet Rohit Sharma following India's ODI series against New Zealand. She later revealed that her actions were driven by a desperate effort to draw the Indian cricketer's attention and seek help for her ailing daughter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shashi-tharoor-praises-gautam-gambhir-india-cricket-coach-scrutiny-nz-t20i-series-2855759-2026-01-21",
      "headline": "Gambhir has hardest job after PM Modi, says Shashi Tharoor after meeting coach Senior Congress MP Shashi Tharoor on Wednesday met Indian men's cricket team head coach Gautam Gambhir, hailing him as \"the man with the hardest job in India after the Prime Minister.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2026-day-5-djokovic-sinner-swiatek-schedule-2855752-2026-01-21",
      "headline": "Day 5 Order of Play: Djokovic, Sinner, Swiatek aim for Round 3 berths Day 5 of the Australian Open 2026 features Novak Djokovic, Jannik Sinner and Iga Swiatek headlining a blockbuster schedule as they aim to book their spots in the third round across Melbourne Park."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-need-to-decide-chinnaswamy-stadium-return-ipl-2026-venkatesh-prasad-2855757-2026-01-21",
      "headline": "RCB need to decide on returning to Chinnaswamy stadium for IPL 2026: Venkatesh PrasadKSCA president Venkatesh Prasad says the ball is now in RCB's court on returning to Chinnaswamy for IPL 2026, assuring the stadium will be completely safe and ready after major upgrades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-1st-t20i-playing-11-no-kuldeep-yadav-ishan-kishan-returns-after-two-years-2855745-2026-01-21",
      "headline": "IND vs NZ, 1st T20I: No Kuldeep Yadav, Ishan Kishan returns after over two yearsIND vs NZ, 1st T20I Playing XIs: New Zealand opted to bowl after winning the toss in the first T20I against India, handing Kristian Clarke a debut, while India recalled Ishan Kishan and left out Kuldeep Yadav and Shreyas Iyer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-statement-t20-world-cup-bangladesh-security-threat-india-2855744-2026-01-21",
      "headline": "ICC says no credible threat to safety of Bangladesh team in IndiaT20 World Cup 2026: The International Cricket Council on Wednesday dismissed Bangladesh's concerns over security in India, saying it's not feasible to change the venues in the eleventh hour. Bangladesh have remained adamant about not playing in India with all four of their league games scheduled across two cities in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-waugh-maxwell-support-odi-cricket-european-t20-premier-league-2855717-2026-01-21",
      "headline": "Waugh, Maxwell open up on ODI cricket's future: Would hate to see it disappearSteve Waugh and Glenn Maxwell have expressed concerns over the future of ODI cricket amid the rapid growth of T20 leagues. Both Waugh and Maxwell are part of the inaugural European T20 Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sydney-sixers-mark-waugh-suggests-dropping-babar-azam-bbl-2855701-2026-01-21",
      "headline": "Drop Babar Azam if you want to win BBL: Mark Waugh urges Sydney Sixers for tough loveFormer Australian all-rounder Mark Waugh has urged the Sydney Sixers to drop Babar Azam and reshuffle their batting to boost their title chances in the Big Bash League 2025-26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-opens-up-tough-calls-india-captain-shreyas-iyer-yuzvendra-chahal-2855696-2026-01-21",
      "headline": "Rohit Sharma opens up on tough calls he took as India captain: Can't please everyoneRohit Sharma has opened up on the hardest decisions of his captaincy, from leaving out Shreyas Iyer in 2022 to managing difficult conversations with senior players, explaining why leadership in Indian cricket means accepting that you cannot please everyone."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-bangladesh-t20-world-cup-request-india-bcb-controversy-2855682-2026-01-21",
      "headline": "ICC votes to replace Bangladesh with Scotland if it doesn't play in IndiaT20 World Cup: The ICC has told the Bangladesh Cricket Board (BCB) to inform the Bangladesh government that if the team continues to refuse to travel to India for the 2026 T20 World Cup, it will be replaced by another side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pooja-vastrakar-returns-rcb-wpl-2026-playoffs-boost-2855632-2026-01-21",
      "headline": "RCB get huge boost as star all-rounder joins squad before WPL 2026 playoffsRoyal Challengers Bengaluru have received a timely boost ahead of the WPL 2026 playoffs with the return of all-rounder Pooja Vastrakar, adding depth and experience to their squad.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-fears-losing-england-captaincy-nightclub-incident-public-apology-2855613-2026-01-21",
      "headline": "Harry Brook admits fear of losing England captaincy after nightclub incidentEngland captain Harry Brook has revealed that the fear of losing his job was real after the nightclub incident, admitting the mistake weighed heavily on him and prompted a heartfelt apology to teammates, fans and the ECB."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-1st-t20i-live-score-india-vs-new-zealand-match-suryakumar-bumrah-2855600-2026-01-21",
      "headline": "1st T20I Highlights: India win by 48 runs, take 1-0 series leadIndia (IND) vs New Zealand (NZ) Highlights: A comprehensive all-round show saw Abhishek Sharma's fifty and Rinku Singh's late blitz set the tone, before Arshdeep and Hardik struck early and India closed out a comfortable 48-run win with authority."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dishant-yagnik-kolkata-knight-riders-fielding-coach-ipl-2026-2855592-2026-01-21",
      "headline": "IPL 2026: Kolkata Knight Riders appoint Dishant Yagnik as fielding coachIPL 2026: Kolkata Knight Riders appoint Dishant Yagnik as fielding coach ahead of IPL 2026, strengthening a star-studded support staff and completing a major rebuild after an aggressive auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-eng-charith-asalanka-returns-captain-sri-lanka-squad-england-odis-2855579-2026-01-21",
      "headline": "Charith Asalanka returns as captain: Sri Lanka name 15-man squad for England ODIsSL vs ENG: Charith Asalanka returns as Sri Lanka captain for the England ODI series, with Dhananjaya de Silva recalled and several senior pacers missing as Colombo hosts all three matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-laughs-fans-australian-open-win-yannick-hanfmann-2855575-2026-01-21",
      "headline": "Carlos Nadal: Alcaraz all smiles as fan's gesture wins heart in Australian OpenAustralian Open: Carlos Alcaraz lit up Rod Laver Arena with both his tennis and his personality, playfully responding to a playful \"Carlos Nadal\" shout from the stands before cruising past Yannick Hanfmann in straight sets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-t20i-form-aakash-chopra-advice-play-straighter-shots-world-cup-2855531-2026-01-21",
      "headline": "Suryakumar Yadav given golden advice by former opener ahead of T20 World CupFormer India opener Aakash Chopra has given key advice to captain Suryakumar Yadav amid his poor T20I form. Chopra urges him to play straighter shots and spend more time at the crease ahead of the T20 World Cup 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-offers-to-host-bangladeshs-t20-world-cup-games-report-2855516-2026-01-21",
      "headline": "Pakistan offers to host Bangladesh's T20 World Cup games: ReportThe Pakistan Cricket Board (PCB) has reportedly offered to host Bangladesh's T20 World Cup matches while backing its refusal to play the tournament in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-wins-opening-round-indonesia-masters-super-500-comeback-2855506-2026-01-21",
      "headline": "Indonesia Masters: PV Sindhu digs deep to enter pre-quarterfinalsPV Sindhu overcame a tough challenge from Manami Suizu in the opening round of the Indonesia Masters Super 500. Meanwhile, Kidambi Srikanth needed three games to overcome his first-round opponent, Koki Watanabe of Japan at the Istora on Wednesday, January 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-odi-rankings-daryl-mitchell-virat-kohli-rohit-sharma-2855490-2026-01-21",
      "headline": "Virat Kohli loses No. 1 spot in ODI rankings to New Zealand's Daryl MitchellICC ODI rankings: New Zealand star Daryl Mitchell dethroned Virat Kohli to become the new No.1 batter in ICC ODI rankings on the back of his batting heroics in the Blackcaps' historic series win in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-golfing-with-roger-federer-australian-open-break-2855454-2026-01-21",
      "headline": "Is Federer good at golf? Alcaraz rates tennis great's game after playing togetherWorld No. 1 Carlos Alcaraz took a golfing break with Roger Federer at the Australian Open. The Spaniard rated the Swiss great's skills on the course after his second-round win at Melbourne Park on Wednesday, January 21. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}