{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rent-vs-buy-why-young-indians-are-rethinking-homeownership-is-it-better-to-rent-or-buy-in-india-real-estate-trends-india-2730761-2025-05-26",
      "headline": "Rent vs buy? Why young Indians are rethinking homeownershipNot long ago, a house was more than just a home—it was a badge of honour in Indian families. Parents encouraged early buying, regardless of the financial strain. Today, however, younger Indians are rethinking this dream, looking for new paths to stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/luxury-real-estate-dlf-camellias-delhi-ncr-ultra-rich-property-celebrity-shikhar-dhawan-rishi-parti-2730692-2025-05-26",
      "headline": "The billionaire blueprint: Inside DLF's ultra-luxury playbookWelcome to the new epicentre of ultra-luxury in India, where DLF isn't just selling apartments, it is curating a billionaire lifestyle and cashing in on the growing trend of 'living life king-size'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-455-points-higher-nifty-settles-above-25000-eternal-tanks-5-2730715-2025-05-26",
      "headline": "Sensex ends 455 points higher, Nifty settles above 25,000; Eternal tanks 5%At the closing bell, the BSE Sensex was up 455.37 points to 82,176.45, while the NSE Nifty50 settled 148 points higher at 25,001.15. The broader markets also performed well during the session, extending the rally in mid-cap and small-cap stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-lta-exempt-under-the-new-tax-regime-what-you-should-know-2730656-2025-05-26",
      "headline": "Is LTA exempt under the New Tax Regime? What you should knowLeave Travel Allowance (LTA) is a common perk in many salary packages, yet with two tax regimes in place, people often ask if the exemption holds true in the new tax regime. Let's find out in this article."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/supreme-court-puts-bhushan-power-liquidation-on-hold-amid-jsw-review-plea-2730641-2025-05-26",
      "headline": "Supreme Court puts Bhushan Power liquidation on hold as JSW seeks reviewThis interim order effectively pauses the liquidation process of BSPL, offering JSW a window to pursue legal recourse and protect its investment interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-for-2025-here-is-why-you-must-verify-your-ais-and-form-26as-first-2730625-2025-05-26",
      "headline": "Filing ITR for 2025? Here's why you must verify your AIS and Form 26AS firstOne of the most important things you should do before filing your return is to check your Annual Information Statement (AIS) and Form 26AS. These documents contain details of your income and financial transactions during the year. If you forget to report something, you could end up receiving a notice from the tax department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radico-khaitan-launches-trikal-and-morpheus-premium-whiskies-2730624-2025-05-26",
      "headline": "Radico Khaitan launches TRIKĀL and Morpheus whiskiesWith the new launches, the company's goal is to dominate both the luxury and super-premium categories, building on the global success of its flagship Rampur Indian Single Malt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-utilities-not-live-yet-will-the-e-filing-deadline-be-extended-2730597-2025-05-26",
      "headline": "ITR utilities not live yet: Will the e-filing deadline be extended?Many taxpayers are wondering if the delay in these filing tools means the return filing deadline will be pushed. But that's unlikely. The deadline for those who don't need to get their accounts audited remains July 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/belrise-industries-ipo-allotment-status-online-guide-check-latest-gmp-listing-date-2730551-2025-05-26",
      "headline": "Belrise Industries IPO allotment: Step-by-step guide to check statusThe IPO received a good response from all types of investors. By the end of the three-day bidding period on May 23, it was subscribed 43.14 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nibe-share-price-rise-5-percent-upper-circuit-why-reason-new-order-israel-2730514-2025-05-26",
      "headline": "Explained: Why NIBE share price surged 5% to hit upper circuit todayNIBE share price: The shares of NIBE Ltd surged 5% to hit the upper circuit. The stock has lost 4.43% in the last 5 days, but has gained 18.22% in the past month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/aegis-vopak-terminals-ipo-open-bidding-subscribe-skip-details-expert-review-gmp-today-2730498-2025-05-26",
      "headline": "Aegis Vopak Terminals IPO: Subscribe or skip Rs 2,800 crore listing? Check GMPBefore the public issue opened, the company raised Rs 1,259.99 crore from 32 anchor investors. This money was raised at the upper end of the price band, which is Rs 235 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-zomato-share-price-falling-today-global-index-msci-ftse-cut-weights-explained-2730494-2025-05-26",
      "headline": "Eternal shares tumble over 3% in early trade. Why is the stock falling?The Zomato stock was trading 3.17% lower on the NSE at 9:38 am, making it the only significant laggard among Nifty50 constituents during morning trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-gain-why-is-stock-market-rising-3-reasons-why-tariff-pause-4th-largest-economy-rbi-dividend-monsoon-2730489-2025-05-26",
      "headline": "Sensex gains 750 points: 3 reasons why stock market is rising todayStock market rally: Sensex surged over 700 points to 82,437.76 in early trade, while Nifty gained over 200 points to 25,063.65 as of 9:50 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-over-500-points-nifty-crosses-25000-eternal-falls-over-3-2730482-2025-05-26",
      "headline": "Sensex jumps over 600 points, Nifty crosses 25,000; Eternal tumbles 3%The BSE Sensex rose 704.45 points to 82,425.53 around 9:53 am while the Nifty50 gained 218.10 points to 25,071.25. Broader market indices were also in the green, reflecting widespread bullish sentiment on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/leela-hotels-ipo-open-bidding-subscribe-skip-latest-gmp-opening-date-market-view-2730473-2025-05-26",
      "headline": "Leela Hotels IPO opens for bidding: Should you subscribe? Check latest GMPLeela Hotels plans to raise Rs 2,500 crore by issuing 5.75 crore fresh equity shares. An additional Rs 1,000 crore will be raised through the offer for sale (OFS) route, where existing shareholders will sell 2.30 crore shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-prediction-trading-setup-sensex-nifty-today-may-26-nse-bse-2730462-2025-05-26",
      "headline": "Stock market today: Will Sensex, Nifty open higher on May 26?Market experts believe Nifty may continue to trade in a narrow range, with some key support and resistance levels in focus. Gift Nifty futures were trading at 24,935.5 around 8:09 am, which is above Friday's closing level of 24,853.15 for Nifty50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-share-market-news-may-26-hyundai-swiggy-eternal-paytm-ntpc-green-2730455-2025-05-26",
      "headline": "Stocks to watch on May 26: Hyundai, Swiggy, Eternal, Paytm, NTPC GreenHyundai Motor India, NTPC Green Energy, Swiggy, and Waaree Energies will be added to the FTSE global equity indices under the largecap category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-overtakes-japan-become-worlds-4th-largest-economy-in-world-niti-aayog-2730164-2025-05-25",
      "headline": "India overtakes Japan to become fourth-largest economy: Niti AayogIndia has overtaken Japan to become the world's 4th largest economy, with a GDP of $4 trillion. NITI Aayog projects India will become the 3rd largest economy in the next 2-3 years, surpassing Germany. Factors contributing to this growth include infrastructure development, Make in India initiative, GST implementation, and fiscal discipline during the COVID-19 pandemic. The country has reduced extreme poverty to less than 5% and is poised for rapid growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-becomes-fourth-largest-economy-ahead-of-japan-niti-aayog-ceo-2730153-2025-05-25",
      "headline": "India now fourth-largest economy, ahead of Japan: Niti Aayog CEOIndia's GDP has reached $4 trillion, placing it behind only the US, China, and Germany, according to IMF data cited by NITI Aayog CEO BVR Subrahmanyam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-samsung-mobiles-apple-iphone-tariffs-india-manufacturing-2729791-2025-05-24",
      "headline": "Trump targets Samsung after tax threat to Apple for India shift: Wouldn't be fairThe US President warned that Samsung, and not only Apple, would face a 25% import tax if its phones were not manufactured in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-proposes-50-tariff-on-eu-goods-from-june-1-2729562-2025-05-23",
      "headline": "Trump proposes 50% tariff on EU goods from June 1Trump criticised the EU for maintaining restrictive trade practices, levying high taxes, and taking legal action against US companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-declares-rs-268-lakh-crore-dividend-to-support-government-fiscal-goals-2729528-2025-05-23",
      "headline": "RBI to pay Rs 2.69 lakh crore to government as dividend for FY25The RBI has approved a large dividend of Rs 2.69 lakh crore for the financial year 2025, which is higher than Rs 2.1 lakh crore given last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-india-or-anyplace-else-trump-warns-apple-of-25-tariff-if-iphones-not-manufactured-in-us-2729506-2025-05-23",
      "headline": "Not India or anyplace else: Trump's 25% tariff warning if iPhones not made in USDonald Trump's statement on levying 25% tariff on iPhones has caused Apple shares to fall by 2.5% in premarket trading, and US stock futures also slipped. However, it's still unclear whether Trump actually has the legal power to impose a tariff on one specific company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-revival-primary-market-upcoming-public-listings-should-investors-put-money-leela-hotel-lg-ril-2729465-2025-05-23",
      "headline": "Fresh IPOs likely to flood Dalal Street: Time to ride the wave?Four IPOs are lined up to open in the last week of May. These include Scoda Tubes, Prostarm Info Systems, Leela Hotels (Schloss Bangalore Limited), and Aegis Vopak Terminals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-10-crore-for-child-education-edelweiss-ceo-and-md-radhika-gupta-maths-and-message-2729440-2025-05-23",
      "headline": "Rs 10 crore for child's education? Edelweiss' Radhika Gupta's maths and messageRadhika Gupta explained that the current cost of a full higher education in the US is around Rs 2.5 crore. Now, if you consider average inflation of 5% and currency depreciation of 4% every year, the value of that education will go up a lot over the next 16 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-769-points-higher-nifty-above-24800-eternal-ends-with-3-percent-gain-fmcg-it-banking-2729441-2025-05-23",
      "headline": "Sensex, Nifty close higher over US-China trade hopes despite FII outflow fearsThe S&P BSE Sensex added 769.09 points to close at 81,721.08, while the NSE Nifty50 gained 243.45 points to end at 24,853.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-google-and-more-cut-over-61000-jobs-in-2025-here-is-why-2729361-2025-05-23",
      "headline": "Microsoft, Google and more cut over 61,000 jobs in 2025: Here's why?One of the biggest cuts came from Microsoft, which let go of 6,000 employees, its largest round of job losses since 2023. Nearly 2,000 of these were in Washington state alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-power-rpower-share-price-rise-18-percent-why-reason-should-you-buy-2729360-2025-05-23",
      "headline": "Reliance Power Ltd share price rises over 18%. Should you buy?Reliance Power has gained 20.77% in the last month, 51.98% over the last six months, and 99.13% over the past year. Over the last five years, it has gone up by a massive 2,820.56%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-plans-to-let-us-other-foreign-firms-bid-for-government-contracts-report-2729355-2025-05-23",
      "headline": "India plans to let US, other foreign firms bid for government contracts: ReportContracts worth over $50 billion, primarily issued by federal agencies, could soon be accessible to US companies as part of a broader effort to strike a limited trade agreement with Washington by early July."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bajaj-auto-acquisition-to-take-over-ktm-800-million-euro-deal-financial-trouble-2729351-2025-05-23",
      "headline": "Bajaj Auto to take over KTM with massive €800 million dealThe move is aimed at helping KTM recover from financial trouble and marks a major step forward for Bajaj, which has been a minority investor in KTM since 2007."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/data-can-be-misleading-zerodha-founder-and-ceo-nithin-kamath-on-rise-of-tier-2-and-3-city-investors-2729307-2025-05-23",
      "headline": "'Data can be misleading': Nithin Kamath on rise of Tier 2 and 3 city investorsZerodha's Nithin Kamath explained that if you look at the addresses provided by users during their KYC process, it appears many traders are from Tier 2 and Tier 3 towns. However, this can be misleading because most people don't update their address when they move to a new city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-share-price-rises-rising-today-today-check-brokerage-views-should-you-buy-sell-hold-2729293-2025-05-23",
      "headline": "ITC share price rises 3% today. Check brokerage views and what should investors do?The stock was trading 2.78% higher at Rs 437.95, recovering from Thursday's close of Rs 426.10, as investors appeared to focus on the company's long-term fundamentals rather than short-term headwinds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/some-individuals-do-not-need-to-file-an-itr-are-you-one-of-them-2729270-2025-05-23",
      "headline": "Some individuals don't need to file an ITR. Are you one of them?As the 2025–26 financial year begins, the Income Tax Department has released all the seven ITR forms along with the ITR-U form.  But did you know not everyone is required to file a return?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-to-invest-rs-50000-crore-in-northeast-over-next-decade-says-gautam-adani-2729269-2025-05-23",
      "headline": "Adani Group to invest Rs 50,000 crore in Northeast over next decadeThe fresh investment commitment comes just months after the Adani Group pledged Rs 50,000 crore in Assam alone, targeting sectors like airports, aero cities, city gas distribution, transmission, cement, and road infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-loan-bailout-package-pakistan-usd-1-billion-why-reason-india-objection-terror-11-conditions-2729243-2025-05-23",
      "headline": "Explained: Why IMF gave Pakistan $1 billion despite India's objectionsThe IMF agreed to support Pakistan with a total of $7 billion under the EFF programme. So far, it has given $2.1 billion in two separate instalments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bse-shares-appear-65-percent-lower-trading-apps-has-multibagger-stock-crashed-2729212-2025-05-23",
      "headline": "Have BSE shares really crashed? Here's why some apps show a 66% fallThe apparent crash was just a technical adjustment following the company's 2:1 bonus issue, which turned the stock ex-bonus today. Some trading platforms may not have accounted for this corporate action in their price charts, leading to misleading visuals of a steep 65% drop. In reality, the share price simply adjusted to reflect the bonus allotment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rising-today-key-reasons-behind-sensex-nifty-rebound-explained-2729199-2025-05-23",
      "headline": "Sensex jumps 900 points: Why stock market is rising today and what next?Market watchers suggest the current bounce is likely driven by a 'buy-on-dips' strategy that many investors have adopted amid recent volatility. Despite concerns about the global macro environment, the strength in domestic fundamentals seems to be offering support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/honasa-consumer-share-price-rise-13-percent-revenue-rise-decline-in-q4-net-profit-reason-why-2729197-2025-05-23",
      "headline": "Honasa shares rise 13% despite decline in Q4 net profitThe company's revenue from operations went up by 13% year-on-year (YoY), reaching Rs 534 crore in Q4FY25. However, despite the rise in revenue, Honasa's consolidated net profit fell by 18% YoY."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-sensex-opens-flat-nifty-below-24700-sun-pharma-falls-5-2729185-2025-05-23",
      "headline": "Sensex, Nifty move up in early session despite concerns over FII flowsThe S&P BSE Sensex went up by 289.27 points to 81,241.26, while the NSE Nifty50 added 119.15 points to 24,728.85 as of 9:29 am."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadak-2-release-date-siddhant-chaturvedi-triptii-dimri-love-story-in-august-2730907-2025-05-26",
      "headline": "Dhadak 2 release date out: Siddhant-Triptii's film to hit cinemas in AugustAfter facing many delays, 'Dhadak 2', starring Siddhant Chaturvedi and Triptii Dimri, is set to hit theatres. The film will be released in August this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/simbu-manchu-manoj-are-bromance-goal-bhairavam-2730801-2025-05-26",
      "headline": "Actor Simbu on Manchu Manoj: He's like a small kid, show him love, not angerAt the pre-release event of Bhairavam, Manchu Manoj called his friend, actor Simbu, during a live segment, leading to a candid and cheerful exchange. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-aravind-extends-support-to-pawan-kalyan-distances-from-exhibitors-strike-2730796-2025-05-26",
      "headline": "Allu Aravind extends support to Pawan Kalyan, distances from exhibitors strikePushpa star Allu Arjun's father and producer Allu Aravind addressed speculations regarding his involvement in the ongoing exhibitor's strike in Telangana and Andhra Pradesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-raveena-tandon-recalls-reason-behind-fight-with-karisma-kapoor-shared-non-veg-jokes-2730838-2025-05-26",
      "headline": "Raveena Tandon on alleged feud with Karisma Kapoor: It was classroom politicsActor Raveena Tandon recently recalled her catfight with Karisma Kapoor in the 90s on film sets. In a conversation with Farah Khan on her Vlog, Raveena called it, 'classroom politics.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/singer-demi-lovato-marries-jordan-jutes-in-la-wears-vivienne-westwood-corset-gown-2730770-2025-05-26",
      "headline": "Singer Demi Lovato marries Jordan Jutes in LA, wears Vivienne Westwood corset gownSinger and actor Demi Lovato on Sunday got married to her fiancé, Jordan Jutes Lutes, in California. The bride wore a custom Vivienne Westwood corset dress for the ceremony. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/actor-chhavi-mittal-on-tahira-kashyaps-advice-during-cancer-diagnosis-gave-me-confidence-2730714-2025-05-26",
      "headline": "Actor Chhavi Mittal says Tahira Kashyap gave her 'confidence' during cancer battleActor Chhavi Mittal said that Tahira Kashyap was the first person she had a long conversation with during her breast cancer diagnosis. Chhavi shared how Tahira's advice gave her clarity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/sunny-leone-wraps-shoot-for-her-first-hollywood-film-leaked-photos-2730731-2025-05-26",
      "headline": "Sunny Leone wraps shoot for her first independent Hollywood film. See picsSunny Leone is set to make her debut in an independent Hollywood film, playing a United Nations peacekeeping soldier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakesh-roshan-switches-to-hulk-mode-at-75-with-heavy-workout-son-hrithik-roshan-goes-uff-watch-viral-video-2730739-2025-05-26",
      "headline": "Rakesh Roshan switches to Hulk mode at 75 with heavy workout, Hrithik commentsFilmmaker Rakesh Roshan shared an inspiring video on social media. The 'Krrish' director could be seen working out dedicatedly in a gym, trying to make the 'best' of every day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/seventeen-releases-happy-burstday-album-on-10th-anniversary-with-solo-tracks-2730713-2025-05-26",
      "headline": "SEVENTEEN releases Happy Burstday album on 10th anniversary with solo tracksSEVENTEEN commemorated their 10th anniversary by releasing their fifth studio album, 'Happy Burstday'. The album highlights individual member projects and features global artists Pharrell Williams and Timbaland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dacoit-glimpse-out-adivi-sesh-mrunal-thakurs-film-for-christmas-release-2730689-2025-05-26",
      "headline": "Dacoit glimpse out: Adivi Sesh-Mrunal Thakur's film for Christmas releaseThe makers of Adivi Sesh's much-awaited bilingual 'Dacoit' have unveiled a fiery glimpse video. The film is releasing on December 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-expresses-admiration-for-fahadh-faasil-at-cannes-aavesham-is-my-favourite-2730682-2025-05-26",
      "headline": "Alia Bhatt expresses admiration for Fahadh Faasil: Aavesham is my favouriteAlia Bhatt, who made her debut at Cannes, recently expressed her admiration for Malayalam actor Fahadh Faasil and said that she would definitely be interested in working with him. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-ishaan-khatter-on-feeling-safe-shooting-intimate-scenes-with-naughty-tabu-2730675-2025-05-26",
      "headline": "Ishaan Khatter on 'feeling safe' shooting intimate scenes with 'naughty' TabuActor Ishaan Khatter recently recalled her 'A Suitable Boy' days with co-star Tabu. The actor appreciated Tabu for being supportive while filming intense scenes. He will next be seen in Neeraj Ghaywan's 'Homebound.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-says-raha-has-transformed-her-emotionally-everyone-pain-affects-you-2730644-2025-05-26",
      "headline": "Alia Bhatt says Raha has transformed her emotionally: Everyone's pain affects youActor Alia Bhatt talked about motherhood bringing a whirlwind of changes in her. She mentioned feeling more empathetic and concerned about people's feelings, and looking at the world from a whole new perspective. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/retro-ott-release-when-and-where-to-watch-suriyas-gangster-drama-2730606-2025-05-26",
      "headline": "Retro OTT release: When and where to watch Suriya's gangster dramaSuriya and director Karthik Subbaraj's 'Retro' had a decent run at the box office. The film is all set to stream on an OTT platform later this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gurmeet-choudhary-debina-bonnerjee-hina-khan-rocky-jaiswal-colors-tv-pati-patni-aur-panga-2730632-2025-05-26",
      "headline": "Gurmeet-Debina, Hina-Rocky star in new show Pati, Patni Aur PangaColors TV is set to launch a new reality show, 'Pati, Patni Aur Panga', featuring popular celebrity couples. The show promises exciting challenges and a fresh take on couples competing together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yg-2025-blueprint-blackpink-treasure-baby-monster-new-rookies-unveiled-2730556-2025-05-26",
      "headline": "Blackpink headlines YG's 2025 Blueprint featuring Treasure, BabyMonsterYG's executive producer, Yang Hyun-suk unveiled a new plan to boost activities for artists like Blackpink, Baby Monster, and Treasure, while also accelerating the debut of new talents. He announced the upcoming projects of Blackpink and the release of their new album and world tour 'Deadline' following the teaser release on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-to-have-a-30-minute-extended-cameo-in-kannappa-reveals-vishnu-manchu-2730571-2025-05-26",
      "headline": "Prabhas to have a 30-minute extended cameo in Kannappa, reveals Vishnu ManchuTelugu actor Vishnu Manchu's upcoming fantasy film, 'Kannappa', has been generating buzz due to its star-studded cameo appearances, which include Prabhas, Mohanlal and Akshay Kumar. In a recent interview, Vishnu revealed more details about the film and these characters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/woman-injured-as-theatre-ceiling-crashes-down-at-final-destination-screening-2730586-2025-05-26",
      "headline": "Final Destination turns real as Aregntina theatre ceiling collapses, injures womanFiamma Villaverde's 29th birthday ended up being a real-life 'Final Destination' when she got injured while watching the sixth instalment of the American horror franchise. The theatre ceiling in Argentina collapsed mid-screening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/joju-george-kamal-haasan-oscar-thug-life-mani-ratnam-2730592-2025-05-26",
      "headline": "Kamal Haasan's praise is my Oscar, Mollywood co-workers hurt me: Actor Joju GeorgeActor Joju George was moved to tears when Kamal Haasan praised him at the 'Thug Life' audio launch. The actor shared the video on his Instagram and called Haasan's appreciation his Oscar."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-gujarat-visit-pakistan-terrorism-tourism-operation-sindoor-india-pak-conflict-2730846-2025-05-26",
      "headline": "Have roti, live in peace, else my goli is there: PM Modi warns Pak on terrorPM Modi, while speaking at a public rally in Gujarat, said that Operation Sindoor was a direct response to the Pahalgam attack and made it clear that India will not hesitate to strike terror bases if provoked.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-conflict-jaishankar-us-mediation-claim-trump-operation-sindooor-2730785-2025-05-26",
      "headline": "US warned about big Pak attack, we said we'll hit harder: Jaishankar to MPs panelChairing a meeting of MPs, External Affairs Minister (EAM) S Jaishankar clarified that the ceasefire was initiated by Pakistan through military channels, dismissing US claims of brokering the de-escalation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/illegal-bangladeshi-from-india-push-ins-unacceptable-ready-to-step-in-if-needed-bangladesh-army-2730909-2025-05-26",
      "headline": "Push-ins from India unacceptable, ready to step in if needed: Bangladesh ArmyA top officer of the Bangladesh Army termed India's handing over of Bangladeshi illegal immigrants a \"push in\" and said it was \"unacceptable\". Brigadier General Md Nazim-ud-Daula said the army was ready to step in if needed and instructed by the government. India has been handing over Bangladeshi illegal immigrants to Border Guard Bangladesh personnel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/they-are-in-cahoots-tej-prataps-estranged-wife-aishwarya-rejects-lalu-yadavs-action-against-him-as-poll-season-drama-2730774-2025-05-26",
      "headline": "As Lalu Yadav expels son over sanskar, daughter-in-law shreds it as poll dramaAishwarya Roy rejected the action against Tej Pratap as a mere eyewash to mislead people ahead of Bihar Assembly elections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/alia-bhatt-cannes-gucci-gown-saree-lehenga-debate-2730777-2025-05-26",
      "headline": "No Gucci, that Alia Bhatt outfit was not a gownIn a noteworthy fashion moment, Alia Bhatt attended the Cannes Film Festival closing ceremony in a custom-made Gucci outfit. But was it really a gown, as the brand labelled it in an Instagram post? Not quite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-court-closes-sexual-harassment-case-under-pocso-against-former-wrestling-body-chief-brij-bhushan-singh-2730895-2025-05-26",
      "headline": "Delhi court closes POCSO case against ex-wrestling body chief Brij BhushanThe Delhi Police submitted a report under Section 173 CrPC, requesting the cancellation of the case based on the statements of the minor complainant and her father."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-army-says-no-differences-with-the-yunus-government-pressure-elections-2730872-2025-05-26",
      "headline": "No differences with government: Top Bangladesh Army officer amid reports of riftCalling the Army and Bangladesh government \"parts of the same family\", Brigadier General Md Nazim-ud-Daula said that any minor differences should be viewed in context."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-was-informed-30-minutes-within-op-sindoor-launch-s-jaishankar-tells-mps-panel-2730712-2025-05-26",
      "headline": "Pak was told 30 minutes after Op Sindoor's first phase, Jaishankar tells MPs panelIndia had informed Pakistan after 30 minutes of launching Operation Sindoor that only terror camps were being targeted, with a ceasefire following talks initiated by Islamabad, S Jaishankar told the Parliamentary Consultative Committee."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/french-president-emmanuel-macron-wife-brigitte-smack-his-face-viral-video-2730701-2025-05-26",
      "headline": "Did Macron's wife smack him in the face? Here's what we know about viral videoA video of French President Emmanuel Macron arriving in Vietnam has gone viral. It shows his wife, Brigitte, seemingly smacking him in the face just as he stepped off an aeroplane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-politics-kabhi-khushi-kabhie-gham-moment-lalu-prasad-yadav-disowns-son-tej-pratap-2730819-2025-05-26",
      "headline": "K3G moment in Bihar politics: Lalu disowns son Tej Pratap over 'love confession'What the Yadav family experienced felt straight out of a Bollywood drama, as Lalu Prasad Yadav expelled his son Tej Pratap not just from the RJD but from the family itself, citing \"irresponsible behaviour.\" The dramatic turn of events drew uncanny parallels to Yashvardhan Raichand disowning his son Rahul over a love affair in Kabhi Khushi Kabhie Gham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sourav-ganguly-brother-snehashish-ganguly-his-wife-arpita-speedboat-capsizes-in-odisha-puri-sea-2730752-2025-05-26",
      "headline": "Close shave for Sourav Ganguly's brother, his wife as speedboat capsizes in PuriThe incident happened near the Lighthouse when the Snehashish and Arpita were enjoying a speedboat ride on Saturday evening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/luxury-real-estate-dlf-camellias-delhi-ncr-ultra-rich-property-celebrity-shikhar-dhawan-rishi-parti-2730692-2025-05-26",
      "headline": "The billionaire blueprint: Inside DLF's ultra-luxury playbookWelcome to the new epicentre of ultra-luxury in India, where DLF isn't just selling apartments, it is curating a billionaire lifestyle and cashing in on the growing trend of 'living life king-size'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/king-charles-candan-visit-parliament-inauguration-uk-support-donald-trump-51-state-message-2730871-2025-05-26",
      "headline": "King Charles is on a 2-day trip to Canada. A message for Donald Trump?King Charles is on a two-day visit to Canada to open the 45th Parliament, becoming only the second monarch in Canadian history to take part in the tradition. The historic visit is seen as a subtle message to Donald Trump, who has floated the idea that Canada should become the 51st US state."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jaipur-jail-inmates-hotel-outing-with-girlfriends-police-constables-among-arrested-2730747-2025-05-26",
      "headline": "Poha, drugs, girlfriends: Jaipur jail break scandal exposed, 13 arrestedA total of 13 people, including five constables, four inmates and four relatives, were arrested on Sunday after it came to the fore that the inmates had allegedly paid bribes to enjoy a few hours of freedom outside the jail. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-smells-teen-spirit-free-adolescent-love-from-pocso-cases-sex-education-sexual-relationship-2730550-2025-05-26",
      "headline": "Supreme Court smells teen spirit, acts to free adolescent love from PocsoThe Supreme Court is trying to ensure that adolescents don't end up being jailed for consensual sexual relationships under the stringent Pocso Act, which is meant to protect minors. It has urged the Centre to consider devising a national sex education policy, and formed a committee to look into Pocso-related cases and suggest improvements."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-rain-newly-inaugurated-underground-metro-station-in-worli-flooded-2730676-2025-05-26",
      "headline": "Video: Mumbai's brand-new underground metro station flooded in heavy rainOperational since May 10, the Acharya Atre Chowk underground metro station on Aqua Line 3 got submerged after incessant rain in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/symptoms-of-new-covid-variant-similar-to-viral-fever-delhi-health-minister-2730847-2025-05-26",
      "headline": "Symptoms of new Covid variant similar to viral fever: Delhi Health MinisterDelhi Health Minister said that the Covid variants detected in India cause only mild symptoms. However, the Centre remains vigilant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/early-monsoon-surprises-india-is-it-due-to-climate-change-or-something-else-2730724-2025-05-26",
      "headline": "Early monsoon surprises India: Is climate change to be blamed?The onset and spread of the monsoon aren't driven by just a few isolated factors. Both natural climatic systems and human-induced (anthropogenic) changes—like global warming and climate change—play a role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-gifts-pm-chinese-drill-photo-to-celebrate-own-strikes-against-india-2730549-2025-05-26",
      "headline": "Asim Munir passes off pic of Chinese drill as strike on India, gifts it to Pak PMThe photo was reportedly presented at a high-profile dinner hosted by Pakistan Field Marshal Asim Munir, Chief of Army Staff. It quickly became the subject of widespread mockery on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/quick-vitals-app-noninvasive-blood-test-anemia-screening-india-no-needle-2730654-2025-05-26",
      "headline": "Inside India's first AI-driven blood test that doesn't require bloodA new app called Quick Vitals offers blood test results by scanning the face without needles. This innovation aims to improve early health screening, especially for anaemia in pregnant women and children, across India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/no-foreign-wife-shopping-china-warns-against-marriage-scams-in-bangladesh-2730474-2025-05-26",
      "headline": "No 'foreign wife' shopping: China warns against marriage scams in BangladeshThe Chinese embassy in Bangladesh warned its citizens not to fall for deceptive \"cross-border dating\" content on short video platforms or seek out so-called \"foreign wives\" through informal networks or commercial matchmaking agencies,"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trumps-crazy-jab-at-putin-over-massive-ukraine-strikes-russia-calls-it-emotional-reaction-2730744-2025-05-26",
      "headline": "Trump's 'CRAZY' jab at Putin over strikes, Russia calls it 'emotional reaction'Trump posted the remark on Truth Social as sleeping Ukrainians woke to a third consecutive night of Russian aerial attacks, listening for hours to drones buzzing near their homes and eruptions of Ukrainian anti-aircraft fire."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/arson-attack-on-houses-car-of-british-pm-russia-denies-involvement-2730760-2025-05-26",
      "headline": "Russia denies involvement in arson attacks on houses, car linked to British PMThree men - two of them Ukrainians and one Romanian national - have been charged in connection with the fire at British Prime Minister Keir Starmer's house. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-shreyas-iyer-captaincy-playing-xis-jaipur-2730898-2025-05-26",
      "headline": "No pep talk for PBKS: Shreyas Iyer says he lets actions speak more than wordsShreyas Iyer opened up about his captaincy and said that he is a skipper who lets his actions do the talking on the field. Shreyas has been sensational as a captain this season for the Punjab Kings in IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-carlos-alcaraz-emma-raducanu-results-first-round-2730863-2025-05-26",
      "headline": "Carlos Alcaraz begins title defence in style, Emma Raducanu wriggles out of dangerFrench Open 2025: Carlos Alcaraz began his Roland Garros title defence with a commanding straight sets win. Emma Raducanu fought hard to reach the second round, setting up a tough clash against Iga Swiatek."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-sai-sudharsan-debut-sulakshan-kulkarni-tamil-nadu-2730861-2025-05-26",
      "headline": "Sai Sudharsan's technique against moving ball needs to improve: EX-TN coachFormer Tamil Nadu coach Sulakshan Kulkarni has said that Sai Sudharsan's technique needs to improve against the moving ball ahead of the England tour. Sudharsan is one of the new faces in the India squad for the tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/priyank-panchal-retires-all-forms-of-cricket-statement-2730855-2025-05-26",
      "headline": "Priyank Panchal retires, recalls late father's motivation in emotional noteVeteran Gujarat opener Priyank Panchal has announced his retirement from all formats of cricket with immediate effect. Panchal recalled his late father's motivational message in an emotional farewell note."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-reveals-his-top-two-teams-and-finalists-of-ipl-2025-2730830-2025-05-26",
      "headline": "Aakash Chopra reveals his top two teams and finalists of IPL 2025Former India cricketer-turned commentator Aakash Chopra has predicted his top two teams and the finalists of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/xabi-alonso-real-madrid-head-coach-new-era-ambitions-2730816-2025-05-26",
      "headline": "Alonso thanks Carlo Ancelloti, hopes to make Real Madrid unstoppable forceXabi Alonso has promised to help Real Madrid achieve great things after being unveiled as the club's new manager on Monday. Alonso also thanked Carlo Ancelotti, saying he wouldn't be in this position without his predecessor's influence.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-t20-world-cup-2026-changed-approach-2730827-2025-05-26",
      "headline": "T20I snub helped me rethink my game, World Cup 2026 in my mind: KL RahulWicketkeeper-batter KL Rahul has expressed his desire to return to the T20I set-up and be part of the World Cup next year. Rahul last played for India in the shortest format of the game in November 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-iga-swiatek-casper-ruud-emma-navarro-first-round-results-2730825-2025-05-26",
      "headline": "Iga Swiatek made to sweat in first round, Casper Ruud advancesIga Swiatek was made to sweat in her first round clash of the French Open on Monday, May 26. Casper Ruud overcame Albert Ramos-Viñolas to make it to the second round at Roland Garros on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-mohamed-salah-saudi-arabia-move-arne-slot-2730797-2025-05-26",
      "headline": "Liverpool's Mohamed Salah admits talks about Saudi Pro League move was seriousLiverpool's Mohamed Salah has admitted that talks for a move to Saudi Arabia were serious last summer before signing an extension with the Reds. Salah played a key role in Liverpool's title win this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gujarat-titans-tom-moody-gt-vs-csk-2730749-2025-05-26",
      "headline": "Gujarat Titans bowlers are losing form at the wrong time: Tom MoodyIPL 2025: Former all-rounder Tom Moody said that Gujarat Titans' bowlers haven't been able to bowl well in partnerships due to which they have lost form in recent matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/xabi-alonso-real-madrid-head-coach-new-era-ambitions-2730816-2025-05-26",
      "headline": "Alonso thanks Carlo Ancelloti, hopes to make Real Madrid unstoppable forceXabi Alonso has promised to help Real Madrid achieve great things after being unveiled as the club's new manager on Monday. Alonso also thanked Carlo Ancelotti, saying he wouldn't be in this position without his predecessor's influence.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-t20-world-cup-2026-changed-approach-2730827-2025-05-26",
      "headline": "T20I snub helped me rethink my game, World Cup 2026 in my mind: KL RahulWicketkeeper-batter KL Rahul has expressed his desire to return to the T20I set-up and be part of the World Cup next year. Rahul last played for India in the shortest format of the game in November 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-iga-swiatek-casper-ruud-emma-navarro-first-round-results-2730825-2025-05-26",
      "headline": "Iga Swiatek made to sweat in first round, Casper Ruud advancesIga Swiatek was made to sweat in her first round clash of the French Open on Monday, May 26. Casper Ruud overcame Albert Ramos-Viñolas to make it to the second round at Roland Garros on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-mohamed-salah-saudi-arabia-move-arne-slot-2730797-2025-05-26",
      "headline": "Liverpool's Mohamed Salah admits talks about Saudi Pro League move was seriousLiverpool's Mohamed Salah has admitted that talks for a move to Saudi Arabia were serious last summer before signing an extension with the Reds. Salah played a key role in Liverpool's title win this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gujarat-titans-tom-moody-gt-vs-csk-2730749-2025-05-26",
      "headline": "Gujarat Titans bowlers are losing form at the wrong time: Tom MoodyIPL 2025: Former all-rounder Tom Moody said that Gujarat Titans' bowlers haven't been able to bowl well in partnerships due to which they have lost form in recent matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-ipl-future-murali-karthik-virat-kohli-2730748-2025-05-26",
      "headline": "MS Dhoni IPL future: Murali Karthik uses Virat Kohli reference to discuss topicMurali Karthik said that while people still adore MS Dhoni, there comes a time when players need to step away from the sport. Karthik used the reference of Virat Kohli to make his case to Dhoni, whose future remains a mystery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bundesliga-erik-ten-hag-bayer-leverkusen-manchester-united-xabi-alonso-2730711-2025-05-26",
      "headline": "Former Manchester United boss Erik ten Hag becomes Bayer Leverkusen managerFormer Manchester United manager Erik ten Hag has replaced Xabi Alonso as the new boss of Bayer Leverkusen, the German club confirmed on Monday, May 26. Ten Hag has been out of work since being sacked by United last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-rafael-nadal-son-tribute-novak-djokovic-2730709-2025-05-26",
      "headline": "Watch: Rafael Nadal's son plays with Big four after father's tributeRafael Nadal had a dream day in the presence of his son, wife and other family members after the French Open paid him an emotional tribute on Sunday, May 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharmas-father-thanks-yuvraj-singh-for-shaping-sons-career-2730705-2025-05-26",
      "headline": "Abhishek Sharma's father thanks Yuvraj Singh for shaping son's careerSunrisers Hyderabad (SRH) opening batter Abhishek Sharma's father Raj Kumar Sharma thanked Yuvraj Singh for shaping son's career. Abhishek had another good season in the IPL 2025 as he scored 439 runs from 13 innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-visits-kamakhya-temple-ahead-of-england-tour-2730643-2025-05-26",
      "headline": "Gambhir visits Kamakhya temple in Guwahati to seek blessings for England tourIndian cricket team head coach Gautam Gambhir visited Maa Kamakhya temple in Guwahati ahead of the upcoming tour of England. India are set to play five Tests against England beginning from June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-robin-uthappa-comments-on-ms-dhonis-ipl-future-2730620-2025-05-26",
      "headline": "Uthappa comments on Dhoni's IPL Future: His fire to win tournaments still burnsFormer India cricketer-turned commentator Robin Uthappa has shared his thoughts on MS Dhoni's future and said that the fire to win tournaments still burns bright in him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gujarat-titans-chennai-super-kings-vikram-solanki-press-conference-2730605-2025-05-26",
      "headline": "GT must be better, no two ways around it: Vikram SolankiIPL 2025, GT vs CSK: Gujarat Titans Director of Cricket Vikram Solanki said that his team needs to play better cricket following the heavy 83-run defeat to the Chennai Super Kings on Sunday at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/vidarbha-hockey-supreme-court-india-plea-2730598-2025-05-26",
      "headline": "Vidarbha's plea for associate membership at Indian Hockey rejectedThe Supreme Court has refused to hear Vidarbha Hockey Association's plea for recognition, citing rules allowing only one state association. It questioned Vidarbha's inaction after derecognition by Maharashtra Hockey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-visits-kamakhya-temple-ahead-of-england-tour-2730643-2025-05-26",
      "headline": "Gambhir visits Kamakhya temple in Guwahati to seek blessings for England tourIndian cricket team head coach Gautam Gambhir visited Maa Kamakhya temple in Guwahati ahead of the upcoming tour of England. India are set to play five Tests against England beginning from June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-robin-uthappa-comments-on-ms-dhonis-ipl-future-2730620-2025-05-26",
      "headline": "Uthappa comments on Dhoni's IPL Future: His fire to win tournaments still burnsFormer India cricketer-turned commentator Robin Uthappa has shared his thoughts on MS Dhoni's future and said that the fire to win tournaments still burns bright in him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gujarat-titans-chennai-super-kings-vikram-solanki-press-conference-2730605-2025-05-26",
      "headline": "GT must be better, no two ways around it: Vikram SolankiIPL 2025, GT vs CSK: Gujarat Titans Director of Cricket Vikram Solanki said that his team needs to play better cricket following the heavy 83-run defeat to the Chennai Super Kings on Sunday at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/vidarbha-hockey-supreme-court-india-plea-2730598-2025-05-26",
      "headline": "Vidarbha's plea for associate membership at Indian Hockey rejectedThe Supreme Court has refused to hear Vidarbha Hockey Association's plea for recognition, citing rules allowing only one state association. It questioned Vidarbha's inaction after derecognition by Maharashtra Hockey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-mi-will-jacks-full-pre-match-press-conference-2730585-2025-05-26",
      "headline": "I've been given lot of confidence in my bowling by captain and coach: Will JacksMumbai Indians (MI) all-rounder Will Jacks has thanked captain Hardik Pandya and head coach Mahela Jayawardene for instilling confidence in his bowling. Jacks has been handy with the ball in the ongoing IPL 2025 having scalped six wickets from seven innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-csk-sridharan-sriram-full-post-match-press-conference-2730575-2025-05-26",
      "headline": "Delighted to finish season on a winning note: CSK bowling coach after win vs GTChennai Super Kings (CSK) bowling coach Sridharan Sriram was delighted with his team finishing the season on a winning note. CSK beat Gujarat Titans by 83 runs in their last fixture in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jos-buttler-vikram-solanki-press-conference-2730567-2025-05-26",
      "headline": "Will Jos Buttler's absence affect GT in playoffs? Vikram Solanki opens upIPL 2025, GT vs CSK: On Jos Buttler's departure after the playoffs, Vikram Solanki said that the Gujarat Titans don't depend on one or two individuals. The Titans have roped in Kusal Mendis as Buttler's replacement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-preview-jaipur-conditions-preview-2730560-2025-05-26",
      "headline": "Top spot at stake as Mumbai Indians face off against Punjab KingsMumbai Indians (MI) are set to take on Punjab Kings (PBKS) in an all-important clash of the Indian Premier League 2025 (IPL 2025), which will guarantee a top two finish for either of the sides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-ajinkya-rahane-press-conference-srh-vs-kkr-2730540-2025-05-26",
      "headline": "Not easy winning a title and then defending it: Ajinkya RahaneIPL 2025: Ajinkya Rahane said that the Knight Riders struggled in the batting department, although their bowlers did reasonably well throughout. On Sunday, the Knights lost to Sunrisers Hyderabad by 110 runs in New Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-preview-carlos-alcaraz-rafael-nadal-2730518-2025-05-26",
      "headline": "Who can challenge Carlos Alcaraz on clay in the post-Nadal era? French Open 2025 ushers in a new era with Carlos Alcaraz poised to defend his crown. With Sinner surging, Djokovic seeking redemption, and dark horses in the mix, Paris is set for a gripping battle to decide the next ruler of Roland Garros."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-kkr-heinrich-klaasen-srh-season-review-2730512-2025-05-26",
      "headline": "SRH's final game serves a reminder of an IPL season that could have beenSRH beat KKR with a scintillating display of batting in their final game of the IPL 2025. The performance served a reminder of the season that could have been for SRH."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-roger-federer-french-open-tribute-2730504-2025-05-26",
      "headline": "Relieved I didn't face Nadal: Federer recalls French Open 2009 winRoger Federer went down the memory lane to his French Open 2009 win, saying that he was relieved after not facing Rafael Nadal, who won the title four times from 2005 to 2008. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-vs-kkr-daniel-vettoi-full-post-match-press-conference-2730505-2025-05-26",
      "headline": "Given Shami's quality, he will bounce back strongly next season: SRH coachSunrisers Hyderabad (SRH) head coach Daniel Vettori has backed fast bowler Mohammed Shami to bounce back strongly next season after his forgettable return to the Indian Premier League (IPL). Shami picked just six wickets from nine matches as he looked completely out of rhythm for the entire season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-kkr-daniel-vettori-on-harsh-dubey-2730499-2025-05-26",
      "headline": "Harsh Dubey will become a complete all-rounder by next IPL season: Daniel VettoriSunrisers Hyderabad (SRH) head coach Daniel Vettori has backed rising star Harsh Dubey to grow immensely as an all rounder by the next season of the Indian Premier League (IPL). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-ajinkya-rahane-kkr-press-conference-srh-2730488-2025-05-26",
      "headline": "Batters took undue pressure: Rahane dissects KKR's poor seasonIPL 2025: Skipper Ajinkya Rahane said that poor batting led to Kolkata Knight Riders' (KKR) downfall in the tournament. The Knights finished their campaign with a 110-run defeat to the Sunrisers Hyderabad (SRH). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-iga-swiatek-carlos-alcaraz-jannik-sinner-2730471-2025-05-26",
      "headline": "Day 2 Order of Play: Swiatek, Alcaraz, Sinner begin campaignFrench Open 2025, Day 2 Order of Play: Defending champions Carlos Alcaraz and Iga Swiatek will begin their campaign on Monday. The likes of Jannik Sinner, Naomi Osaka and Paula Badosa will also be in action. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}