{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-lays-off-employees-bengaluru-technology-centre-under-global-workforce-reduction-2698349-2025-03-24",
      "headline": "180 Boeing employees laid off in India under global workforce reduction: ReportAs part of the global workforce reduction, up to 180 staff at the Boeing India Engineering Technology Center in Bengaluru were laid off in the December quarter of 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-bull-run-sensex-reclaims-78000-after-1100-point-rally-nifty-ends-above-23600-2698202-2025-03-24",
      "headline": "Sensex reclaims 78,000 after 1,100-point rally, Nifty ends above 23,600The S&P BSE Sensex surged 1,078.87 points to close at 77,984.38, while the NSE Nifty50 added 323.55 points to end at 23,673.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-united-states-exclude-sector-specific-reciprocal-tariffs-scale-back-april-2-2698189-2025-03-24",
      "headline": "US planning to scale back April 2 reciprocal tariffs for specific sectors: ReportsUS President Donald Trump's administration may exclude a set of sector-specific tariffs while applying reciprocal levies on April 2, Bloomberg News and the Wall Street Journal reported, citing officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/japanese-stock-market-zensho-holdings-co-share-fall-unexpected-rodent-incident-report-2698187-2025-03-24",
      "headline": "A rat did it: Japanese stock tanks after unexpected rodent incidentThe stock of the Japanese firm Zensho Holdings Co fell 7.1% in one of its biggest declines since February 13 due to an incident involving a rodent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-zerodha-founder-and-ceo-nithin-kamath-left-a-lasting-impression-on-a-customer-they-won-my-trust-for-life-2698143-2025-03-24",
      "headline": "How Zerodha's Nithin Kamath left a lasting impression on a customerNithin Kamath not only acknowledged the customer's concern but also took immediate action. Zerodha's team quickly looked into the compliance issue and assured the customer that they were working on resolving it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-dalal-street-green-flags-what-investors-should-know-2698127-2025-03-24",
      "headline": "Red flags turn green on Dalal Street: Will the stock market bull run continue?Stock market rally today: With today's rebound, both indices have nearly erased most of the losses suffered in the first two months of 2025. It may be noted that the total market capitalisation of all BSE-listed firms swelled by over Rs 5 lakh crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/volkswagen-tax-case-why-government-doesnt-want-to-quash-14-billion-demand-2698086-2025-03-24",
      "headline": "Volkswagen tax case: Why government stands firm on $1.4 billion demandThe government's tax demand is against Skoda Auto Volkswagen India, which is accused of wrongly classifying imported parts for some Audi, VW and Skoda cars to avoid paying higher import taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bull-run-continues-on-dalal-street-as-sensex-surges-1000-points-2698085-2025-03-24",
      "headline": "Sensex surges 1,000 points as FIIs chase Dalal Street rallyBull run on Dalal Street: The S&P BSE Senses added 1,003.06 points to 77,908.57, while the NSE Nifty50 gained 286.95 points to 23,637.35 as of 12:37 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-middle-class-under-pressure-cautions-saurabh-mukherjea-what-are-its-key-challenges-2698060-2025-03-24",
      "headline": "Is India's middle class losing momentum? See what this expert saysThe rise of automation is a growing threat to jobs. Machines are replacing traditional roles in both factories and offices. The next phase of automation, powered by generative AI, is expected to accelerate job displacement across multiple sectors, Saurabh Mukherjea said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fii-selling-stop-return-to-dalal-street-why-comeback-on-sensex-nifty-key-reasons-2698064-2025-03-24",
      "headline": "Why foreign investors are rushing back to bet on Dalal Street FIIs returning to Dalal Street has given a sharp boost to domestic investors, with the main indices extending gains for the sixth consecutive session. The S&P BSE Sensex was up 950 points and Nifty rose 273 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-gainers-loser-stocks-on-sensex-and-nifty-stock-market-today-titan-kotak-bank-bhel-infosys-ntpc-lt-2698016-2025-03-24",
      "headline": "Stock market rally: Check top gainers and losers on Dalal StreetSensex surged over 800 points to surpass the 77,700 mark, and Nifty jumped over 200 points to trade above the 23,500 level as Dalal Street continued its winning streak.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-gains-dalal-street-no-impact-of-reciprocal-tariffs-explained-2698012-2025-03-24",
      "headline": "Why Trump's tariffs aren't spooking Dalal Street investors anymoreForeign investors are back, and markets are rallying. But with Trump's reciprocal tariffs set for April 2, will the optimism last, or is another sell-off on the way?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-lopez-emme-shine-at-othello-broadway-premiere-in-matching-black-outfits-glbs-2698353-2025-03-24",
      "headline": "Jennifer Lopez & Emme shine at Othello Broadway premiere in matching black outfitsJennifer Lopez and Emme attended Broadway's Othello premiere in stylish black outfits. The event featured star guests, including Joe Biden. Lopez reflected on motherhood while celebrating Emme's 17th birthday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-residence-review-uzo-aduba-randall-park-giancarlo-esposito-shine-in-netflix-whodunnit-2698324-2025-03-24",
      "headline": "The Residence review: Uzo Aduba, Randall Park shine in sharp whodunnitReleased-Thu Mar 20, 2025Shondaland's latest offering - The Residence - is a gripping murder mystery set in the iconic White House. Led by Uzo Aduba as detective Cordelia Cupp, the series combines satire and social commentary with suspenseful storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-episode-5-review-no-harvey-spector-but-ted-black-finally-delivers-sass-swag-and-story-worth-the-wait-2698336-2025-03-24",
      "headline": "Suits LA finally delivers as episode 5 brings sass, swag, and story worth the waitAfter the wait of four episodes, we get the one justifying what the 'Suits' franchise stands for. Ted Black is making you sit up and notice his world, and you are finally into it. Check out a no-spoiler commentary on the latest episode. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/emraan-hashmi-reacts-after-pakistani-actor-javed-sheikh-calls-him-rude-2698297-2025-03-24",
      "headline": "Emraan Hashmi reacts after Pakistani actor Javed Sheikh calls him rudeActor Emraan Hashmi has reacted to veteran Pakistani actor Javed Sheikh's claims that he was rude to him during the shoot of Jannat. Hashmi said that the claims are false. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-jana-nayagan-to-be-a-grand-pongal-release-check-announcement-2698306-2025-03-24",
      "headline": "Thalapathy Vijay's Jana Nayagan to be a grand Pongal release. Check announcementThalapathy Vijay shared the new poster of his film 'Jana Nayagan' online. The poster revealed the release date of the film, which is supposed to be his last. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/oscar-winner-christoph-waltz-joins-only-murders-in-the-building-season-5-2698257-2025-03-24",
      "headline": "Oscar winner Christoph Waltz joins Only Murders in the Building Season 5Two-time Oscar winner Christoph Waltz is set to appear in Season 5 of Hulu's Only Murders in the Building. The Austrian actor will join a cast that includes Keegan-Michael Key."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-says-sikandar-will-earn-rs-100-200-crore-irrespective-of-its-content-2698291-2025-03-24",
      "headline": "Salman Khan says Sikandar will earn Rs 100-200 crore irrespective of its contentActor Salman Khan was speaking to the media at the trailer launch of 'Sikandar' when he commented on the expected box office performance of the film. The actor shared that it will end up collecting at least Rs 200 crore irrespective of whether it is good or bad. Watch the video inside. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-deol-says-high-time-deols-got-work-in-bollywood-we-were-waiting-for-it-2698262-2025-03-24",
      "headline": "Sunny Deol says 'high time' Deols got work in Bollywood: We were waiting for itActor Sunny Deol commented on the success enjoyed by him, his brother, Bobby Deol, and father, Dharmendra with newfound popularity in the industry. He spoke at the trailer launch of 'Jaat'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-singer-v-says-he-has-lost-10-kg-in-military-pics-2698254-2025-03-24",
      "headline": "BTS singer V says he has lost 10 kg in military, shares picsBTS singer V aka Kim Taehyung has shared brand-new photos from his time in the military. The artiste said he has lost 10 kilos during training. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-holds-tricolour-car-racing-team-secure-third-place-italy-2698261-2025-03-24",
      "headline": "Ajith holds tricolour, leads celebration as his car racing team secures 3rd placeAjith Kumar and his racing team secured third place in an international car racing championship in Italy. A video shows the actor leading the celebration by holding the tricolour and popping the champagne bottle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-video-responds-shekhar-kapur-claims-bandit-queen-edits-2698255-2025-03-24",
      "headline": "Prime Video responds to Shekhar Kapur's claims about Bandit Queen editsGiant streamer Prime Video reacted to Shekhar Kapur's complaint over the editing of his 1994 film Bandit Queen. The OTT platform has denied making any changes to the film. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zeenat-aman-love-for-accessories-as-she-gives-a-peek-into-her-closet-2698161-2025-03-24",
      "headline": "Zeenat Aman shares her love for accessories as she gives a peek into her closetVeteran actor Zeenat Aman shared her love for accessories, revealing her preference for boutiques over high street brands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-pop-group-newjeans-defy-court-order-perform-as-njz-before-announcing-hiatus-2698210-2025-03-24",
      "headline": "K-pop group NewJeans defy court order, perform as NJZ before announcing hiatusIn a surprising move, K-pop group NewJeans performed under the name NJZ at ComplexCon Hong Kong, defying a South Korean court ruling. The group debuted a new song and announced a temporary pause in activities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pranav-mohanlal-teams-up-with-bramayugam-director-rahul-sadasivan-for-his-next-2698209-2025-03-24",
      "headline": "Pranav Mohanlal teams up with Bramayugam director Rahul Sadasivan for his nextMalayalam actor Pranav Mohanlal has teamed up with director Rahul Sadasivan for his next film. He began filming on March 24. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaya-bachchan-defends-kunal-kamra-controversy-freedom-of-speech-eknath-shinde-2698203-2025-03-24",
      "headline": "Jaya Bachchan defends Kunal Kamra amid controversy: Where is freedom of speech?Actor and SP MP Jaya Bachchan reacted to the Kunal Kamra controversy over his comments on Maharashtra Deputy Chief Minister, Eknath Shinde. The actor questioned the limits placed on freedom of expression in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zakir-khan-standup-special-delulu-express-trailer-prime-video-2698204-2025-03-24",
      "headline": "Delulu Express trailer: Zakir Khan returns with a stand-up comedy specialThe trailer of Zakir Khan's new stand-up special, Delulu Express, is out. It promises a laughter riot and will premiere on Prime Video on March 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-visits-baps-temple-abu-dhabi-offers-prayers-2698183-2025-03-24",
      "headline": "Allu Arjun visits BAPS temple in Abu Dhabi, offers prayers. WatchAllu Arjun recently visited the BAPS temple in Abu Dhabi. A video of the Pushpa actor offering prayers at the temple has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-breathtaking-third-episode-netflix-stephen-graham-owen-cooper-2698174-2025-03-24",
      "headline": "In praise of Adolescence's breathtaking third episode: A perfect stormStephen Graham and Jack Thorne's Adolescence is a masterclass in filmmaking. However, its pivotal third episode deserves a special appreciation note. The show, starring Owen Cooper in the lead, is streaming on Netflix. (Spoilers ahead). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rhea-chakraborty-visits-siddhivinayak-after-closure-in-sushant-singh-rajput-case-2698177-2025-03-24",
      "headline": "Rhea Chakraborty visits Siddhivinayak after closure in Sushant Singh Rajput caseActor Rhea Chakraborty and her family visited Mumbai's famous Siddhivinayak temple on Monday after her name was cleared in the closure report filed by the CBI in the Sushant Singh Rajput death case. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/comedian-kunal-kamra-wont-apologise-eknath-shinde-joke-row-habitat-studio-mumbai-police-investigation-2698264-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Won't apologise but...: What Kunal Kamra told cops in Eknath Shinde joke rowThe stand-up comedian stirred a huge row with his indirect dig at Shinde for switching sides and joining the BJP after defecting from the erstwhile Shiv Sena, with the political outfit targeting him through threats and a police complaint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/judges-are-caesars-wife-allahabad-bar-wants-justice-varma-impeached-in-cash-row-2698289-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Judges are Caesar's wife: Allahabad Bar wants Justice Varma impeached in cash rowThe Allahabad High Court Bar Association has demanded a review of Justice Yashwant Varma's rulings and his impeachment following a cash discovery at his residence. The association argues that judicial integrity is at stake and public trust is eroding.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/allahabad-high-court-gives-centre-4-weeks-to-file-status-report-on-rahul-gandhis-citizenship-2698303-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre given 4 weeks for status report on plea over Rahul Gandhi's citizenshipIn 2019, BJP leader Subramanian Swamy had alleged that Rahul Gandhi had declared himself a British citizen in documents submitted to British authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-lays-off-employees-bengaluru-technology-centre-under-global-workforce-reduction-2698349-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "180 Boeing employees laid off in India under global workforce reduction: ReportAs part of the global workforce reduction, up to 180 staff at the Boeing India Engineering Technology Center in Bengaluru were laid off in the December quarter of 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/kunal-kamra-comic-timing-gone-wrong-for-bitter-or-verse-eknath-shinde-controversy-2698309-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "For bitter or verse, Kamra's comic timing gone wrongComics have a way with words and of telling the bitter truth. But once personal bitterness takes full control, comedy shrinks in size and becomes politics in disguise. For a comic, politics is a terrific slave but a terrible master."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dc-vs-lsg-live-score-updates-ipl-2025-delhi-capitals-vs-lucknow-super-giants-2698312-2025-03-24#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "DC vs LSG, IPL 2025 Live: Marsh, Markram off to steady startDC vs LSG, IPL 2025 Live Score Updates: Lucknow Super Giants have started steadily in the powerplay. Mitchell Marsh and Aiden Markram have come out to open for the side. KL Rahul is missing the game for DC due to the birth of his first child."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cctv-meerut-murder-case-victim-bike-friend-chilling-murder-wife-lover-police-visuals-2698279-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CCTV shows Meerut man on bike with friend hours before wife, her lover killed himCCTV footage showed Saurabh Rajput and his friend on a bike entering a street to get food at 11.49 pm on March 3 before he was murdered by his wife Muskan Rastogi and her lover Sahil after a few hours."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/salary-daily-allowance-pension-hike-of-mps-parliament-april-2023-2698249-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre notifies 24% hike in salaries, pensions for MPs and ex-ParliamentariansSitting MPs will receive a monthly salary of Rs 1.24 lakh as against Rs 1 lakh they received earlier. The pension for former MPs was hiked from Rs 25,000 per month to Rs 31,000 per month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kunal-kamra-eknath-shinde-controversy-karma-is-a-bitch-kangana-ranaut-bungalow-demolition-shiv-sena-sanjay-raut-2698212-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kamra's Kangana karma comes back to bite himJokes on Shiv Sena leader Eknath Shinde have landed stand-up comic Kunal Kamra in a spot. As people defended his right to free speech, some were quick to point out how he cheered on the BMC as it demolished actor Kangana Ranaut's bungalow in 2020. Though karma might have returned to bite Kamra, his right to free speech should be defended by all."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-kl-rahul-misses-game-birth-child-2698343-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DC vs LSG: KL Rahul misses out Delhi's opening game in VizagIPL 2025, DC vs LSG: KL Rahul missed the opening game of Delhi Capitals due to personal reasons. Delhi picked both Faf du Plessis and Jake Fraser-McGurk in their XI for the game on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dk-shivakumar-bjp-spar-over-constitution-change-remarks-2698221-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DK Shivakumar says his 'Constitution change' remark misquoted: What's the row?As BJP claims DK Shivakumar hinted at changing the Constitution for religion-based reservations, the Karnataka Deputy Chief Minister vehemently denied the charge. He called it the Centre's political ploy to take the focus away from more pressing matters. Here's what has happened so far.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-collegium-repatriates-yashwant-varma-allahabad-high-court-cash-row-2698258-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Supreme Court collegium recommends Justice Varma's transfer to Allahabad High CourtThe Supreme Court Collegium has recommended Justice Yashwant Varma's repatriation to the Allahabad High Court. This follows a cash discovery at his residence, which he denies being involved in. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-breathtaking-third-episode-netflix-stephen-graham-owen-cooper-2698174-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "In praise of Adolescence's breathtaking third episode: A perfect stormStephen Graham and Jack Thorne's Adolescence is a masterclass in filmmaking. However, its pivotal third episode deserves a special appreciation note. The show, starring Owen Cooper in the lead, is streaming on Netflix. (Spoilers ahead). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-the-habitat-kunal-kamra-eknath-shinde-joke-demolition-shiv-sena-vandalism-2698318-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "All about The Habitat, Mumbai studio where Kunal Kamra mocked Eknath ShindeThe Habitat studio in Mumbai, where comedian Kunal Kamra triggered a huge row for his joke on Maharashtra Deputy Chief Minister Eknath Shinde, has been a popular venue for stand-up comedy shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/what-makes-revanth-reddy-and-kt-rama-rao-enemies-in-hyderabad-frenemies-in-chennai-2698164-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What makes Revanth Reddy and KT Rama Rao enemies in Hyderabad, frenemies in ChennaiRevanth Reddy and KT Rama Rao, who are at each other's throats in Hyderabad almost every day, found themselves singing the same tune in Chennai. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/chennai/story/rippling-0xppl-founder-prasanna-sankar-x-twitter-thread-harassed-by-wife-chennai-police-son-custody-post-divorce-2697961-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tech entrepreneur alleges harassment by wife, Chennai cops over child custodyThe founder of the software company Rippling and tech entrepreneur Prasanna Sankar made serious allegations against his estranged wife, amid their divorce and custody battle. While he claimed harassment by the police, the wife accused him of financial and sexual misconduct."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bryan-johnson-face-sexual-allegation-confidentiality-agreement-blueprint-2698141-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Walked naked, discussed erection at work: Bryan Johnson faces sensational chargesTech entrepreneur Bryan Johnson faces allegations of inappropriate workplace behaviour, including nudity and sexual conversations, with former employees challenging his confidentiality agreements.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-says-sikandar-will-earn-rs-100-200-crore-irrespective-of-its-content-2698291-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan says Sikandar will earn Rs 100-200 crore irrespective of its contentActor Salman Khan was speaking to the media at the trailer launch of 'Sikandar' when he commented on the expected box office performance of the film. The actor shared that it will end up collecting at least Rs 200 crore irrespective of whether it is good or bad. Watch the video inside. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/12-year-old-us-boy-builds-nuclear-fusion-reactor-gets-visit-from-fbi-2697413-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "12-year-old builds nuclear fusion reactor, gets visit from FBI12-year-old Jackson Oswalt, from Memphis, US, has built a nuclear fusion reactor in his bedroom and made a Guinness World Record for the youngest person to achieve fusion. Later on, he got a visit from the FBI to make sure all was good. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-nainital-naini-lake-water-crisis-shortage-tourism-deforestation-low-rainfall-snowfall-2698275-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nainital to face water crisis this summer?Naini Lake's water level has dropped to 4.7 feet, the lowest in 5 years, due to low rainfall and snowfall, raising fears of a summer water crisis in Nainital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/perplexity-ai-ceo-aravind-srinivas-explains-why-he-never-explored-bengaluru-nikhil-kamath-podcast-2698282-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Perplexity AI CEO explains why he never explored Bengaluru on Nikhil Kamath's podcastPerplexity AI CEO Aravind Srinivas explained why he never explored Bengaluru on Nikhil Kamath's podcast. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kunal-kamra-row-habitat-studio-demolition-bmc-officials-eknath-shinde-sena-maharashtra-2698156-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Demolition begins at Mumbai studio where Kunal Kamra mocked Eknath ShindeThe controversy erupted after Kamra, known for his sharp criticism of the ruling dispensation, used a parody of a popular Hindi song to describe Shinde's 2022 rebellion against his former boss, Uddhav Thackeray."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uddhav-thackeray-backs-comedian-kunal-kamra-controversy-gaddar-traitor-jibe-eknath-shinde-joke-habitat-shiv-sena-vandalism-2698139-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gaddar is a gaddar: Uddhav Thackeray backs Kunal Kamra over Eknath Shinde jokeShiv Sena (UBT) chief Uddhav Thackeray extended full support to comic Kunal Kamra amid a controversy over the latter's \"traitor\" dig at Maharashtra Deputy Chief Minister Eknath Shinde in a joke."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/grok-says-this-and-grok-says-that-but-you-should-never-believe-a-scholastic-parrot-2698089-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Grok says this and Grok says that, but you should never believe a scholastic parrotElon Musk's Grok AI is in the news in India because it is saying all things unsayable, including addressing Indians with a language that will put a Delhi bro to shame. But you should not believe everything Grok says, or everything that AI systems like ChatGPT tell you. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-lopez-emme-shine-at-othello-broadway-premiere-in-matching-black-outfits-glbs-2698353-2025-03-24",
      "headline": "Jennifer Lopez & Emme shine at Othello Broadway premiere in matching black outfitsJennifer Lopez and Emme attended Broadway's Othello premiere in stylish black outfits. The event featured star guests, including Joe Biden. Lopez reflected on motherhood while celebrating Emme's 17th birthday.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/emraan-hashmi-reacts-after-pakistani-actor-javed-sheikh-calls-him-rude-2698297-2025-03-24",
      "headline": "Emraan Hashmi reacts after Pakistani actor Javed Sheikh calls him rudeActor Emraan Hashmi has reacted to veteran Pakistani actor Javed Sheikh's claims that he was rude to him during the shoot of Jannat. Hashmi said that the claims are false. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-jana-nayagan-to-be-a-grand-pongal-release-check-announcement-2698306-2025-03-24",
      "headline": "Thalapathy Vijay's Jana Nayagan to be a grand Pongal release. Check announcementThalapathy Vijay shared the new poster of his film 'Jana Nayagan' online. The poster revealed the release date of the film, which is supposed to be his last. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-says-sikandar-will-earn-rs-100-200-crore-irrespective-of-its-content-2698291-2025-03-24",
      "headline": "Salman Khan says Sikandar will earn Rs 100-200 crore irrespective of its contentActor Salman Khan was speaking to the media at the trailer launch of 'Sikandar' when he commented on the expected box office performance of the film. The actor shared that it will end up collecting at least Rs 200 crore irrespective of whether it is good or bad. Watch the video inside. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-kl-rahul-misses-game-birth-child-2698343-2025-03-24",
      "headline": "DC vs LSG: KL Rahul misses out Delhi's opening game in VizagIPL 2025, DC vs LSG: KL Rahul missed the opening game of Delhi Capitals due to personal reasons. Delhi picked both Faf du Plessis and Jake Fraser-McGurk in their XI for the game on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/psl-2025-david-warner-karachi-kings-captain-shan-masood-replaced-2698326-2025-03-24",
      "headline": "Warner replaces Shan Masood as Karachi Kings captain in maiden PSL stintDavid Warner has been announced as Karachi Kings' new skipper for his maiden PSL season in 2025, replacing Shan Masood ahead of the highly anticipated tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vignesh-puthur-parents-reaction-csk-vs-mi-kerala-spinner-2698308-2025-03-24",
      "headline": "Watched every ball of CSK v MI, couldn't sleep from joy: Vignesh Puthur's motherIPL 2025, CSK vs MI: Vignesh Puthur called his parents twice after the match,sharing his excitement with them. The Kerala spinner took three wickets in his debut for Mumbai Indians in Chennai on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dc-vs-lsg-live-score-updates-ipl-2025-delhi-capitals-vs-lucknow-super-giants-2698312-2025-03-24",
      "headline": "DC vs LSG, IPL 2025 Live: Marsh, Markram off to steady startDC vs LSG, IPL 2025 Live Score Updates: Lucknow Super Giants have started steadily in the powerplay. Mitchell Marsh and Aiden Markram have come out to open for the side. KL Rahul is missing the game for DC due to the birth of his first child."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-early-impression-pat-cummins-ishan-kishan-travis-head-2698294-2025-03-24",
      "headline": "SRH early impressions: Cummins' men return with big bash energy in IPL 2025SunRisers Hyderabad returned in style, slamming 286 runs in their first match of the IPL 2025. Here's the early impression of the side after their first game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-rohit-sharma-poor-start-kane-williamson-2698247-2025-03-24",
      "headline": "Rohit Sharma's poor IPL 2025 start played down by Kane Williamson: Just 1st matchRohit Sharma's poor start to IPL 2025 has been played down by Kane Williamson. The Mumbai opener was dismissed for a 4-ball duck against Chennai Super Kings in the first El Clasico of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-touchdown-chennai-csk-virat-kohli-watch-2698237-2025-03-24",
      "headline": "Watch: Virat Kohli, RCB stars touchdown in Chennai ahead of CSK clashRCB, led by skipper Rajat Patidar, and star batter Virat Kohli arrived in Chennai ahead of their highly anticipated IPL 2025 clash against arch-rivals CSK on March 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-deepak-chahar-kattappa-sister-reference-2698213-2025-03-24",
      "headline": "IPL 2025: Deepak Chahar's sister makes 'Kattappa' reference in MI vs CSKDeepak Chahar's MI debut sparked social media frenzy, intensified by sister Malti's 'Kattappa' reference, as he impressed against his former team CSK in a high-profile IPL 2025 clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-vignesh-puthur-mumbai-indians-best-bowler-award-nita-ambani-2698188-2025-03-24",
      "headline": "CSK vs MI: Vignesh Puthur rewarded by Nita Ambani after sensational debutAfter his fantastic performance with the ball, Mumbai Indians' Vignesh Puthur received a special award from Nita Ambani on Sunday, March 23. Vignesh was the star with the ball for MI despite their loss to CSK. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-banned-india-commentators-ipl-2025-2698179-2025-03-24",
      "headline": "Irfan Pathan banned? Other instances of Indian commentators facing the heatFormer India all-rounder Irfan Pathan isn't a part of the commentary panel for IPL 2025 after being excluded due to dissatisfaction amongst broadcasters over bringing personal grudges into his commentary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-rohit-sharma-poor-start-kane-williamson-2698247-2025-03-24",
      "headline": "Rohit Sharma's poor IPL 2025 start played down by Kane Williamson: Just 1st matchRohit Sharma's poor start to IPL 2025 has been played down by Kane Williamson. The Mumbai opener was dismissed for a 4-ball duck against Chennai Super Kings in the first El Clasico of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-touchdown-chennai-csk-virat-kohli-watch-2698237-2025-03-24",
      "headline": "Watch: Virat Kohli, RCB stars touchdown in Chennai ahead of CSK clashRCB, led by skipper Rajat Patidar, and star batter Virat Kohli arrived in Chennai ahead of their highly anticipated IPL 2025 clash against arch-rivals CSK on March 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-deepak-chahar-kattappa-sister-reference-2698213-2025-03-24",
      "headline": "IPL 2025: Deepak Chahar's sister makes 'Kattappa' reference in MI vs CSKDeepak Chahar's MI debut sparked social media frenzy, intensified by sister Malti's 'Kattappa' reference, as he impressed against his former team CSK in a high-profile IPL 2025 clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-vignesh-puthur-mumbai-indians-best-bowler-award-nita-ambani-2698188-2025-03-24",
      "headline": "CSK vs MI: Vignesh Puthur rewarded by Nita Ambani after sensational debutAfter his fantastic performance with the ball, Mumbai Indians' Vignesh Puthur received a special award from Nita Ambani on Sunday, March 23. Vignesh was the star with the ball for MI despite their loss to CSK. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-banned-india-commentators-ipl-2025-2698179-2025-03-24",
      "headline": "Irfan Pathan banned? Other instances of Indian commentators facing the heatFormer India all-rounder Irfan Pathan isn't a part of the commentary panel for IPL 2025 after being excluded due to dissatisfaction amongst broadcasters over bringing personal grudges into his commentary."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}