{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-rising-today-what-are-the-reasons-behind-rally-2696725-2025-03-21",
      "headline": "Ola Electric shares jump 5% after clarification on February sales mismatchOla Electric Mobility's share price rose 5% on the Bombay Stock Exchange in early trade after an important clarification. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-stocks-tcs-infosys-wipro-fall-after-accenture-revenue-guidance-check-details-2696720-2025-03-21",
      "headline": "Accenture revenue forecast hits IT stocks, Infosys, Wipro fallAccenture, which is seen as a key indicator for the Indian IT sector, raised the lower end of its annual revenue forecast but kept the upper end unchanged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-opens-200-points-lower-nifty-falls-50-points-infosys-down-3-pecent-it-stocks-decline-2696709-2025-03-21",
      "headline": "Sensex, Nifty open lower as IT stocks drag markets down after 4-day rallyThe S&P BSE Sensex was down 98.30 points to 76,249.76, while the NSE Nifty50 lost 21.85 points to 23,168.80 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-explanation-february-sale-registration-data-temporary-backlog-bhavish-aggarwal-ev-sector-news-india-2696698-2025-03-21",
      "headline": "Ola Electric explains February sales mismatch: Temporary backlog in registrationsOla Electric addressed concerns about the mismatch in a stock exchange filing, saying that daily registrations have now exceeded 50% of its three-month daily sales average."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dalal-street-opening-predictions-on-march-21-what-to-expect-from-sensex-nifty-today-it-stocks-in-focus-2696685-2025-03-21",
      "headline": "Sensex, Nifty opening predictions on March 21: What to expect todayBSE, NSE today: Nifty has posted gains for four straight sessions this week, marking its longest winning streak in nearly seven weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-march-21-list-of-shares-in-news-tcs-wipro-hul-zomato-adani-enterprises-jio-financial-2696675-2025-03-21",
      "headline": "Stocks to watch on March 21: TCS, HUL, Zomato, Adani Enterprises, Jio FinancialSeveral stocks will be in focus today due to recent developments. These include Hindustan Unilever (HUL), Jio Financial, Adani Enterprises, Infosys, TCS, Bajaj Finance, Zomato, and others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/planning-taxes-for-fy2026-which-regime-to-pick-old-or-new-ta-regime-2696460-2025-03-21",
      "headline": "Planning taxes for FY2026? Which regime to pick- old or new?The old tax regime offers over 70 deductions and exemptions, including HRA, LTA, Section 80C, 80D, home loan interest, and education loan interest. Meanwhile, the new tax regime has simplified slabs but does not offer these deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-opening-wall-street-opens-lower-as-tariff-concerns-resurface-2696503-2025-03-20",
      "headline": "US stock market opening: Wall Street opens lower as tariff concerns resurfaceDarden Restaurants Inc. was the biggest gainer, climbing by 6.52%, at the opening bell. Others in the green zone included Jabil Inc., up by 4.09%, Solventum Corp., which rose by 2.41% and TransDigm Group Inc., which climbed by 2.15%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-speeds-up-claim-processing-60-percent-settled-via-automated-system-2696487-2025-03-20",
      "headline": "EPFO speeds up claim processing, 60% settled via automated systemTo further quicken the process, EPFO has automated claims related to medical emergencies, housing, studies, and marriage costs. With this system in place, claims are now processed within just three days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/daughters-future-which-is-better-sukanya-samriddhi-yojana-or-elss-2696425-2025-03-20",
      "headline": "Daughter's future? Which is better- Sukanya Samriddhi Yojana or ELSS?SSY offers 8.2% as an annual interest rate. Investors can invest a minimum of Rs 250, while the maximum limit is Rs 1.5 lakh per year. Further, this scheme allows tax benefits under Sector 80C of the Income Tax Act 1961."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/alimony-calculation-divorce-cases-court-guidelines-india-global-yuzvendra-chahal-dhanashree-verma-2696382-2025-03-20",
      "headline": "Money after divorce: How courts calculate alimonyAlimony in India does not follow a fixed formula. Courts consider various factors such as the financial position of both spouses, their earning potential, and their contributions to the marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jio-financial-allianz-likely-reach-initial-deal-for-joint-venture-in-india-report-2696368-2025-03-20",
      "headline": "Jio Financial, Allianz likely reach deal for insurance joint venture in India: ReportJio Financial Services has reached an initial deal for a joint venture with Allianz SE to form an insurance business in India."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-pre-sales-mohanlal-12-crore-worldwide-history-2696715-2025-03-21",
      "headline": "Mohanlal's Empuraan scripts history in pre-sales, set for a grand openingMohanlal's L2: Empuraan is taking the box office by storm in its pre-sales. According to initial reports, the film has grossed over Rs 12 crore only in the international market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/one-battle-after-another-teaser-leonardo-dicaprio-brings-grit-gunfire-in-actioner-2696714-2025-03-21",
      "headline": "One Battle After Another teaser: Leonardo DiCaprio brings grit, gunfire in actionerThe teaser trailer of Paul Thomas Anderson's upcoming film with Leonardo DiCaprio was released. Titled One Battle After Another, the action-thriller is set for a September 2025 release. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-family-happy-his-relationship-gauri-spratt-sister-nikhat-hegde-2696705-2025-03-21",
      "headline": "Aamir Khan's family 'happy' about his relationship with Gauri, says sister NikhatAamir Khan's sister, Nikhat Hegde, said she is happy with his relationship with Gauri Spratt. She also praised Gauri and wished for the couple to stay happy forever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kanneda-review-parmish-varma-is-fantastic-in-gangster-drama-beyond-guns-and-goons-2696668-2025-03-21",
      "headline": "Kanneda review: Parmish Varma is fantastic in gangster drama beyond guns and goons Released-Fri Mar 21, 2025'Kanneda' is a breath of fresh air in the Indian OTT scene. Singer and actor Parmish Verma bowls you over as an underdog-turned-drug-lord in the 90s 'Kanneda' of the Punjabi immigrants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-highlights-growing-problem-must-screen-in-schools-uk-prime-minister-2696692-2025-03-21",
      "headline": "Adolescence highlights 'growing problem', must screen in schools: UK Prime MinisterThe UK Prime Minister, Keir Starmer, backed the call for screening Netflix's show Adolescence in schools. The four-part show sheds light on the growing influence of social media on teenage boys. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-was-meant-to-be-a-why-not-a-whodunnit-actor-stephen-graham-2696689-2025-03-21",
      "headline": "Adolescence was meant to be a why, not a whodunnit: Actor Stephen GrahamActor Stephen Graham discussed his latest Netflix series, Adolescence, on The Tonight Show. He highlighted how today's generation is exposed to all the information on social media, increasing social accountability. The Netflix series aims to spark a conversation on social influence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-daughter-sitara-gen-z-words-first-ad-together-2696683-2025-03-21",
      "headline": "Mahesh Babu's daughter Sitara teaches him Gen-Z lingo in their first collaborationMahesh Babu and his daughter Sitara appeared in their first-ever on-screen collaboration for a clothing brand. In the fun comercial, Sitara can be seen teaching Mahesh Babu Gen-Z words."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-fan-meet-uk-no-payment-exploitation-2696665-2025-03-21",
      "headline": "Chiranjeevi condemns unauthorised paid fan meets in UK, says no to exploitationMegastar Chiranjeevi warned his fans in United Kingdom about middlemen trying to charge them fees for fan meets. In a post on X, he condemned this behaviour and promised refunds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kendall-jenner-criticizes-khloe-kardashians-cold-behavior-towards-lamar-odom-glbs-2696608-2025-03-20",
      "headline": "Kendall Jenner criticizes Khloe Kardashian's 'cold' behavior towards Lamar OdomKendall Jenner criticized Khloe Kardashian's 'cold' and 'snarky' behavior during her reunion with Lamar Odom. She compared it to Khloe's treatment of Tristan Thompson and admitted she cried watching the episode.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hollywood-release-shake-up-warner-bros-reschedules-major-films-for-box-office-success-glbs-2696602-2025-03-20",
      "headline": "Hollywood release shake-up: Warner Bros. reschedules major films for box office successWarner Bros. has rescheduled major releases, pushing The Bride to 2026 and One Battle After Another to September 2025. These moves aim to boost box office earnings and enhance awards season positioning.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/comedian-samay-raina-postpones-india-tour-amid-indias-got-latent-row-2696601-2025-03-20",
      "headline": "Comedian Samay Raina postpones India tour amid India's Got Latent rowComedian Samay Raina shared a note in his Instagram stories, announcing that he has postponed his India tour. His decision comes weeks after he found himself in the middle of a controversy involving podcaster Ranveer Allahabadia's comments on his YouTube show, 'India's Got Latent'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lollapalooza-2025-lineup-announced-olivia-rodrigo-aap-rocky-and-more-glbs-2696592-2025-03-20",
      "headline": "Lollapalooza 2025 lineup announced: Olivia Rodrigo, A$AP Rocky, and moreLollapalooza 2025's lineup includes Olivia Rodrigo, A$AP Rocky, Sabrina Carpenter, and Korn. The festival runs from July 31 and promises another exciting mix of top artists.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/khloe-kardashian-reveals-her-beauty-secret-glbs-2696567-2025-03-20",
      "headline": "Khloé Kardashian reveals her beauty secretKhloé Kardashian revealed that she uses salmon sperm into her skincare routine. However, experts remain skeptical due to lack of scientific evidence, and the treatment is not FDA-approved.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sobhita-dhulipala-says-she-drives-naga-chaitanya-crazy-love-story-2696554-2025-03-20",
      "headline": "Sobhita says she drives Naga Chaitanya 'crazy', reveals how they fell in loveActors Sobhita Dhulipala and Naga Chaitanya recently opened up about their sweet bond in a new interview, where they shared how their love story began. The couple got married last December. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/shaheer-sheikh-visits-tirupati-temple-with-mahabharat-co-stars-2696545-2025-03-20",
      "headline": "Pics: Shaheer Sheikh visits Tirupati temple, reunites with Mahabharat co-starsActor Shaheer Sheikh recently visited the Tirupati temple with his Mahabharat co-stars. The actor donned a traditional outfit and his co-star, Thakur Anup Singh shared the photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kendrick-lamars-label-universal-music-group-halt-drakes-lawsuit-not-like-us-diss-track-2696538-2025-03-20",
      "headline": "Kendrick Lamar's label seeks to halt Drake's lawsuit over Not Like Us diss trackUniversal Music Group (UMG) seeks to pause the discovery process in Drake's lawsuit concerning Kendrick Lamar's diss track 'Not Like Us.' Drake's team argues against UMG's delay tactics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/hanumankind-diljit-dosanjh-take-indian-music-global-2696534-2025-03-20",
      "headline": "Independent artistes Hanumankind, Diljit Dosanjh take Indian music global: ReportIn addition to Bollywood, independent Indian artistes are gaining significant recognition on the global music stage. Musicians such as Hanumankind, AP Dhillon, Diljit Dosanjh, and others are at the forefront of this movement, drawing a growing international audience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/armaan-and-i-are-one-singer-amaal-mallik-in-new-statement-on-breaking-family-ties-2696531-2025-03-20",
      "headline": "Armaan and I are one: Singer Amaal Mallik after deleting 'breaking family ties' postSinger Amaal Mallik talked about his struggle with clinical depression in a now-deleted social media post. He announced in the same post that he was breaking ties with his family. However, he later mentioned that his relationship with his brother, Armaan Malik, is fine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kanye-west-calls-kim-kardashian-sex-trafficker-raises-concern-over-daughter-north-video-2696511-2025-03-20",
      "headline": "Kanye West accuses Kim Kardashian of 'sex trafficking'Rapper Kanye West ranted against his ex-wife Kim Kardashian in a social media post. He called her a 'sex trafficker' and raised concerns over their daughter, North's music video. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-high-court-judge-cash-found-after-fire-at-bungalow-supreme-court-collegium-transfers-allahabad-high-court-2696710-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fire at Delhi judge's bungalow leads to huge cash recovery; he gets transferredJustice Yashwant Verma was sent back to his parent court following the recommendation of the Supreme Court Collegium after the incident came to light."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/judge-blocks-trump-move-to-deport-indian-student-badar-khan-suri-over-alleged-hamas-link-2696659-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Judge blocks Trump move to deport Indian student over alleged Hamas linkThe Department of Homeland Security has accused Badar Khan Suri of ties to the Palestinian militant group Hamas and said he had spread Hamas propaganda and antisemitism on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/london-heathrow-airport-uk-closed-power-outage-fire-electrical-substation-travel-advisory-2696684-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UK's Heathrow Airport closed for 24 hours after huge fire at power substationLondon's Heathrow Airport on Friday announced that it will remain shut for at least 24 hours after a fire at a nearby electrical substation caused a significant power outage. All arrival and departure flights to the airport have been cancelled."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/meerut-saurabh-rajput-murder-case-sahil-fell-for-muskan-snapchat-trick-killed-saurabh-on-dead-mother-wish-2696691-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meerut woman posed as lover's dead mother on Snapchat, said husband be killed: CopsIn a bizarre twist to the case, Muskan had created three fake Snapchat ID under the name of her brother. She used this account to send messages, convincing Sahil that his mother was speaking to him from the afterlife."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/can-a-parents-affair-shape-a-childs-emotional-world-2696525-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can a parent's affair shape a child's emotional world?For a child who is in his teens or pre-teens and struggling with numerous things like puberty, peers, and relationships, the revelation of a parent's affair can be a blow big enough to shape how the person grows up emotionally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/karnataka-leads-with-31-richest-mlas-in-india-salary-hike-proposal-draft-bill-adr-report-2696671-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Report shows Karnataka leads with country's richest MLAs amid salary hike rowA report by Association for Democratic Reforms shows that Karnataka leads India with 31 billionaire MLAs, followed by Andhra Pradesh and Maharashtra. Despite having the wealthiest MLAs, the  Congress-led government has proposed a bill to give hefty salary and allowance hikes to the legislators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-history-second-part-lalit-modi-meiyappan-srinivasan-2696543-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IPL Story, Part 2: From power to ruin, the league that devoured its ownThe Indian Premier League, like the mysterious host in Agatha Christie's novel first published as Ten Little Niggers, invited many to its party, only to destroy them one by one. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-education-department-dismantle-executive-order-usa-2696655-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump signs executive order aimed at dismantling Department of EducationTrump signed an executive order to dismantle the US Department of Education, shifting control to states, but full closure requires Congress's approval. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kanneda-review-parmish-varma-is-fantastic-in-gangster-drama-beyond-guns-and-goons-2696668-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kanneda review: Parmish Varma is fantastic in gangster drama beyond guns and goons Released-Fri Mar 21, 2025'Kanneda' is a breath of fresh air in the Indian OTT scene. Singer and actor Parmish Verma bowls you over as an underdog-turned-drug-lord in the 90s 'Kanneda' of the Punjabi immigrants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-submits-bid-to-host-2030-youth-olympics-2696590-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India submits bid to host 2030 Commonwealth Games: Sports Ministry SourcesIndia submitted the bid to host the 2030 Commonwealth Games on Thursday, March 20. It's a major step towards achieving India's dream of hosting the 2036 Summer Olympic Games in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/comedian-samay-raina-postpones-india-tour-amid-indias-got-latent-row-2696601-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Comedian Samay Raina postpones India tour amid India's Got Latent rowComedian Samay Raina shared a note in his Instagram stories, announcing that he has postponed his India tour. His decision comes weeks after he found himself in the middle of a controversy involving podcaster Ranveer Allahabadia's comments on his YouTube show, 'India's Got Latent'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-opens-200-points-lower-nifty-falls-50-points-infosys-down-3-pecent-it-stocks-decline-2696709-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex, Nifty open lower as IT stocks drag markets down after 4-day rallyThe S&P BSE Sensex was down 98.30 points to 76,249.76, while the NSE Nifty50 lost 21.85 points to 23,168.80 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-was-meant-to-be-a-why-not-a-whodunnit-actor-stephen-graham-2696689-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Adolescence was meant to be a why, not a whodunnit: Actor Stephen GrahamActor Stephen Graham discussed his latest Netflix series, Adolescence, on The Tonight Show. He highlighted how today's generation is exposed to all the information on social media, increasing social accountability. The Netflix series aims to spark a conversation on social influence. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-techie-says-wife-threatened-suicide-demanded-money-to-be-intimate-wife-files-harassment-domestic-abuse-case-2696475-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru techie levels cash-for-intimacy charge, wife alleges domestic abuseA Bengaluru techie accused his wife of harassment over financial demands and physical abuse. His wife filed a counter-complaint alleging domestic violence and dowry harassment. The police summoned both for questioning to look into the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/world-happiness-report-india-pakistan-china-us-ranking-israel-palestine-ukraine-2696457-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "People in war-torn Ukraine and Palestine are happier than Indians: ReportAre you happy? Do the people around you seem happy? While this question might invite deep reflection, the answer to personal happiness often boils down to a simple 'Yes' or 'No.' The 2025 World Happiness Report is out and Finland has topped the list. Check out India's ranking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/draft-bill-karnataka-mla-mlc-salary-hikes-proposal-exact-amount-increase-document-exclusive-access-2696428-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "100% salary hike for Chief Minister, legislators: Inside Karnataka draft billIndia Today has exclusively accessed the Karnataka Legislature Salaries, Pensions, and Allowances (Amendment) Bill, 2025, which proposes significant salary hikes for legislators, ministers, and Assembly officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/armaan-and-i-are-one-singer-amaal-mallik-in-new-statement-on-breaking-family-ties-2696531-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Armaan and I are one: Singer Amaal Mallik after deleting 'breaking family ties' postSinger Amaal Mallik talked about his struggle with clinical depression in a now-deleted social media post. He announced in the same post that he was breaking ties with his family. However, he later mentioned that his relationship with his brother, Armaan Malik, is fine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-indian-personal-care-market-is-making-even-better-business-sense-2696394-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Indian personal care market is making even better business senseNewer growth areas, such as serums, hair masks, mists and facial oils, lead the charge as consumers get more self-aware and discretionary spending rises\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-national-security-advisor-mike-waltz-donald-trump-top-aide-backs-israeli-strikes-on-gaza-that-broke-ceasefire-2696661-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's top aide backs Israeli strikes on Gaza that broke 2-month ceasefireThe Donald Trump administration has firmly backed Israel's decision to resume fighting on Monday night after Hamas rejected a US offer to extend the first phase of the hostage deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/one-battle-after-another-teaser-leonardo-dicaprio-brings-grit-gunfire-in-actioner-2696714-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "One Battle After Another teaser: Leonardo DiCaprio brings grit, gunfire in actionerThe teaser trailer of Paul Thomas Anderson's upcoming film with Leonardo DiCaprio was released. Titled One Battle After Another, the action-thriller is set for a September 2025 release. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/chhatrapati-sambhaji-9-year-struggle-40-days-of-torture-yet-refused-to-convert-aurangzeb-2694361-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Sambhaji Maharaj's 9-year struggle doomed Aurangzeb and the Mughal empire's fallCrowned as the Chhatrapati of Marathas in 1681 after Shivaji's death, Sambhaji Maharaj did not merely inherit the throne, but the smouldering legacy of Swarajya. Sensing weakness, the Mughals kept doggedly pursuing him, and he was captured after nine years of resistance. Sambhaji endured 40 days of savage torture at the hands of Aurangzeb, but still, he would neither surrender nor convert."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-honey-trap-scandal-48-leaders-including-central-figures-targeted-2696482-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Karnataka Minister claims 48 politicians, including central leaders, honey trappedKarnataka Minister KN Rajanna made an explosive claim in the Assembly about 48 politicians, including central leaders, being victims of honey traps. This triggered a political storm, with demands for a high-level investigation.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-man-found-hanging-in-laws-place-jhansi-records-video-suicide-2696450-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'They want to kill me': UP man records video, found hanging at in-laws' placeOn the day of the incident, the man had gone to bring his wife back without informing his family. His father alleged that his son was threatened and forced into taking this extreme step."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-family-happy-his-relationship-gauri-spratt-sister-nikhat-hegde-2696705-2025-03-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Aamir Khan's family 'happy' about his relationship with Gauri, says sister NikhatAamir Khan's sister, Nikhat Hegde, said she is happy with his relationship with Gauri Spratt. She also praised Gauri and wished for the couple to stay happy forever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-roasts-sobhita-dhulipala-you-lack-basic-human-skills-2696721-2025-03-21",
      "headline": "Naga Chaitanya roasts Sobhita Dhulipala: You lack basic human skillsSobhita Dhulipala and Naga Chaitanya shared fun relationship insights, from who apologises first to who is more dramatic when sick. The couple got married in December 2024 in a traditional ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-pre-sales-mohanlal-12-crore-worldwide-history-2696715-2025-03-21",
      "headline": "Mohanlal's Empuraan scripts history in pre-sales, set for a grand openingMohanlal's L2: Empuraan is taking the box office by storm in its pre-sales. According to initial reports, the film has grossed over Rs 12 crore only in the international market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/one-battle-after-another-teaser-leonardo-dicaprio-brings-grit-gunfire-in-actioner-2696714-2025-03-21",
      "headline": "One Battle After Another teaser: Leonardo DiCaprio brings grit, gunfire in actionerThe teaser trailer of Paul Thomas Anderson's upcoming film with Leonardo DiCaprio was released. Titled One Battle After Another, the action-thriller is set for a September 2025 release. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-family-happy-his-relationship-gauri-spratt-sister-nikhat-hegde-2696705-2025-03-21",
      "headline": "Aamir Khan's family 'happy' about his relationship with Gauri, says sister NikhatAamir Khan's sister, Nikhat Hegde, said she is happy with his relationship with Gauri Spratt. She also praised Gauri and wished for the couple to stay happy forever."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sreesanth-umran-malik-kkr-exclusive-2696708-2025-03-21",
      "headline": "Forget the past, believe in yourself: Sreesanth backs Umran to bounce backIPL 2025: S Sreesanth, speaking to IndiaToday.in, urged young fast bowlers, including Umran Malik, to prioritise fitness, smart training, and recovery for sustained success. Backing Umran to make a strong comeback from injury setbacks, the former fast bowler urged young pacers in the country to believe they can win matches for India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-suryakumar-yadav-mumbai-indians-chennai-csk-2696695-2025-03-21",
      "headline": "Suryakumar Yadav's Mumbai Indians reach Chennai before CSK clashIPL 2025: Suryakumar Yadav's Mumbai Indians (MI) reached Chennai on Thursday night before their opening game against five-time champions Chennai Super Kings on March 23 at the MA Chidambaram Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bcci-rule-ban-captains-over-rate-demerit-points-2696688-2025-03-21",
      "headline": "BCCI abolishes rule of banning captains for over-rate offencesIPL 2025: The BCCI did away with the rule of banning captains for over-rate offences with the decision being taken in the captains' meeting at the BCCI headquarters in Mumbai on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-batting-session-fans-rcb-vs-kkr-2696672-2025-03-21",
      "headline": "Fans enjoy Virat Kohli's batting session before curtain raiserIPL 2025: RCB veteran Virat Kohli practised wholeheartedly at the Eden Gardens in Kolkata before the tournament opener as the fans enjoyed watching him bat in the training session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ajinkya-rahane-kkr-doubters-captain-2696662-2025-03-21",
      "headline": "Will KKR captain Ajinkya Rahane silence doubters in new season?KKR decided to take the bold call of having Ajinkya Rahane as their skipper for the new season. With many doubting his credentials, can Rahane silence his critics and lead KKR to glory?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jay-shah-wishes-kirsty-coventry-1st-female-president-of-olympic-body-2696638-2025-03-20",
      "headline": "Kirsty Coventry becomes 1st female president of Olympic body, Jay Shah leads wishesInternational Cricket Council (ICC) President Jay Shah congratulated the newly elected President of the International Olympic Committee Kirsty Coventry, who also became the first woman to hold the position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-tournament-fordham-sacks-keith-urgo-over-recruiting-violations-charges-glbs-2696633-2025-03-20",
      "headline": "NCAA Tournament: Fordham sacks Keith Urgo over recruiting violations chargesFordham parted ways with basketball coach Keith Urgo amid charges of recruiting violations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rangers-seek-rebound-against-high-flying-maple-leafs-glbs-2696630-2025-03-20",
      "headline": "Rangers seek rebound against high-flying maple leafsAfter a sluggish stretch, the New York Rangers aim to reignite their offense as they face the Toronto Maple Leafs, who bring firepower and momentum into a high-stakes Eastern Conference showdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-boston-celtics-set-for-record-breaking-61-billion-sale-glbs-2696623-2025-03-20",
      "headline": "NBA: Boston Celtics set for record-breaking $6.1 billion saleOn Thursday, reigning NBA champions, the Boston Celtics announced plans of a $6.1 billion sale to a private equity firm. If approved, this would be the most expensive team sale in North America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-eyes-tush-push-ban-playoff-seeding-revamp-in-proposed-rule-changes-glbs-2696620-2025-03-20",
      "headline": "NFL eyes Tush Push ban, playoff seeding revamp in proposed rule changesThe league is considering eliminating the controversial QB sneak tactic and adjusting playoff seeding criteria. Owners will vote on proposals that could reshape competitive balance and game strategy for the 2025 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pcb-mohsin-naqvi-says-no-monetary-loss-in-champions-trophy-2696587-2025-03-20",
      "headline": "PCB says no monetary loss in Champions Trophy, claims USD 10 million profitPakistan Cricket Board (PCB) has refuted claims of monetary loss after hosting the ICC Champions Trophy 2025 and said that it earned approximately USD 10 million as profit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-tournament-fordham-sacks-keith-urgo-over-recruiting-violations-charges-glbs-2696633-2025-03-20",
      "headline": "NCAA Tournament: Fordham sacks Keith Urgo over recruiting violations chargesFordham parted ways with basketball coach Keith Urgo amid charges of recruiting violations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rangers-seek-rebound-against-high-flying-maple-leafs-glbs-2696630-2025-03-20",
      "headline": "Rangers seek rebound against high-flying maple leafsAfter a sluggish stretch, the New York Rangers aim to reignite their offense as they face the Toronto Maple Leafs, who bring firepower and momentum into a high-stakes Eastern Conference showdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-boston-celtics-set-for-record-breaking-61-billion-sale-glbs-2696623-2025-03-20",
      "headline": "NBA: Boston Celtics set for record-breaking $6.1 billion saleOn Thursday, reigning NBA champions, the Boston Celtics announced plans of a $6.1 billion sale to a private equity firm. If approved, this would be the most expensive team sale in North America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-eyes-tush-push-ban-playoff-seeding-revamp-in-proposed-rule-changes-glbs-2696620-2025-03-20",
      "headline": "NFL eyes Tush Push ban, playoff seeding revamp in proposed rule changesThe league is considering eliminating the controversial QB sneak tactic and adjusting playoff seeding criteria. Owners will vote on proposals that could reshape competitive balance and game strategy for the 2025 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pcb-mohsin-naqvi-says-no-monetary-loss-in-champions-trophy-2696587-2025-03-20",
      "headline": "PCB says no monetary loss in Champions Trophy, claims USD 10 million profitPakistan Cricket Board (PCB) has refuted claims of monetary loss after hosting the ICC Champions Trophy 2025 and said that it earned approximately USD 10 million as profit."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}