{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-opening-latest-gmp-subscribe-or-not-brokerage-views-key-details-2628349-2024-11-05",
      "headline": "Swiggy IPO: Should you subscribe as GMP declines ahead of opening? Swiggy IPO: Some brokerages recommend subscription, arguing that the pricing appears fair in comparison to competitors, while others caution against investing due to the company's reported negative cash flows and ongoing losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tilaknagar-industries-share-price-20-percent-increase-all-time-high-q2-results-2628325-2024-11-05",
      "headline": "Why Tilaknagar Industries share price gained 20% to hit all-time high todayTilaknagar Industries share price: The company's stock price surged during today's trading session after it reported strong Q2FY25 results. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/premier-energies-share-price-jumps-7-percent-order-wins-key-factors-2628319-2024-11-05",
      "headline": "Premier Energies share price jumps nearly 7% today. Know whyPremier Energies share price has risen 37% since getting listed on the stock market in September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/orient-technologies-share-price-jumps-16-percent-interim-dividend-board-meeting-key-details-2628310-2024-11-05",
      "headline": "Explained: Why Orient Technologies share price jumped 16% today The jump in share price follows the company's announcement of a board meeting scheduled for November 11, 2024, where directors will review the unaudited financial results for the quarter and half-year ended September 30, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-elections-donald-trump-victory-impact-dalal-street-stock-market-sensex-nifty-explained-2628286-2024-11-05",
      "headline": "US elections: What a Donald Trump victory could mean for Dalal StreetWith the stage set for the US elections, could a Donald Trump win spark a bullish turn for the Indian stock market, or will uncertainty keep investors on edge?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maruti-suzuki-retail-sales-november-wedding-season-inventory-2628278-2024-11-05",
      "headline": "Why Maruti Suzuki is counting on lakhs of weddings in NovemberWith impressive sales figures from October, Maruti Suzuki is optimistic that the upcoming wedding season will sustain its sales momentum in November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sagility-india-ipo-day-1-should-you-subscribe-or-skip-check-key-details-gmp-2628228-2024-11-05",
      "headline": "Sagility India IPO Day 1: Should you subscribe or skip? Check key details, GMPSagility India IPO: Before its launch, Sagility India was trading at a premium of Rs 3 in the grey market, indicating neutral investor demand. However, the GMP has now dipped to Rs 0. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/irctc-share-price-dips-post-q2-results-interim-dividend-record-date-2628222-2024-11-05",
      "headline": "Explained: Why IRCTC share price dipped in early trade after Q2 resultsIRCTC's share price fell as much as 3% in early trade before making a comeback. At 10:40 am, shares of IRCTC were trading 0.82% higher at Rs 822.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-news-sensex-nifty-irctc-investor-sentiment-caution-us-presidential-elections-2628211-2024-11-05",
      "headline": "Sensex, Nifty dip as investors remain cautious ahead of US electionsThe S&P BSE Sensex was down 125.73 points to 78,656.51 at 10:17 am, while the NSE Nifty50 fell 36.20 points to trade at 23,959.15 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-volatility-us-elections-experts-2627851-2024-11-04",
      "headline": "Sensex, Nifty tumble ahead of US elections; Hero MotoCorp falls 4%The NSE Nifty 50 dropped by 321.20 points to settle at 23,983.15, while the BSE Sensex fell 941.88 points to 78,782.24. Most of the broader market indices also declined sharply during the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-jio-ipo-set-for-2025-launch-retail-arm-debut-later-key-details-mukesh-ambani-2627838-2024-11-04",
      "headline": "Reliance Jio IPO likely in 2025, retail arm to debut much later: Report Reliance Jio IPO: The company is targeting a 2025 listing for Jio, although the retail unit's IPO is expected to follow later due to internal operational priorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-elections-impact-on-indian-stock-market-explained-donald-trump-kamala-harris-possible-outcomes-sectors-2627826-2024-11-04",
      "headline": "Donald Trump vs Kamala Harris: How US elections may impact Indian stock marketWith the US election just a day away, Indian markets prepare for shifts across sectors from tech to oil. What could this high-stakes race mean for investors on Dalal Street?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-today-check-reliance-adani-ports-bajaj-auto-ongc-top-losers-2627734-2024-11-04",
      "headline": "Stock market crash: Adani Ports, Reliance, Bajaj Auto among top losers Market crash: The bloodbath on Dalal Street can be attributed to a combination of factors, including a disappointing Q2 earnings season, heightened caution ahead of the upcoming US presidential elections, and persistent selling by foreign institutional investors (FIIs)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/us-elections-and-market-turbulence-2627718-2024-11-04",
      "headline": "US presidential elections cause market turbulence as investors grow waryThe US elections are affecting the share market, with significant impacts on bond yields and investor caution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-panic-on-dalal-street-sensex-falls-1000-points-nifty-down-key-factors-2627722-2024-11-04",
      "headline": "Panic grips Dalal Street: 4 factors behind today's stock market crashStock market today: Both benchmark indices fell as much as 2%, leading to massive losses for investors. At 12:57 pm, the S&P BSE Sensex was down 1,303.19 points at 78,420.93, while the NSE Nifty50 tanked 437.15 points to trade at 23,867.20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/niva-bupa-health-ipo-latest-gmp-price-band-opening-date-financial-details-and-important-details-2627694-2024-11-04",
      "headline": "Niva Bupa Health IPO: Check price band, GMP, lot size, key dates and other detailsNiva Bupa Health IPO: The shares of Niva Bupa Health Insurance are expected to list on the Bombay Stock Exchange (BSE) and the National Stock Exchange (NSE) on November 14, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-price-band-gmp-key-dates-lot-size-allotment-other-key-details-2627690-2024-11-04",
      "headline": "Swiggy IPO: Check GMP, price band, lot size, dates and other key detailsSwiggy's upcoming IPO promises to be a game-changer in the food delivery market. Read on to know about the key details and what this debut could mean for the future of online delivery in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/azad-engineering-share-price-jump-14-percent-despite-stock-market-selloff-explained-2627680-2024-11-04",
      "headline": "Explained: Why Azad Engineering share price jumped 14% despite market selloffAzad Engineering stock price: Around 12:15 pm, the shares were up 9.49% at Rs 1,599.70, giving Azad Engineering a market capitalization of Rs 9,450 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-auto-share-price-falls-5-percent-today-sales-figures-buy-sell-hold-2627639-2024-11-04",
      "headline": "Bajaj Auto share price falls over 5% today. Should you buy?Bajaj Auto share price declined sharply during Monday's trading session. Is it a good opportunity to buy the stock? Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-1400-points-key-factors-investors-lose-over-rs-8-lakh-crore-2627634-2024-11-04",
      "headline": "Stock market crash: Sensex drops 1,400 points, here's how much investors lostStock market crash: Concerns mounted amid a volatile market environment driven by uncertainties surrounding the upcoming US presidential election and the Federal Reserve's potential interest rate decisions. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-uttar-pradesh-madarsa-education-act-valid-allahabad-high-court-cancels-2628268-2024-11-05",
      "headline": "Big relief to UP madarsas, Supreme Court says 2004 law valid, High Court erredA bench comprising Chief Justice of India DY Chandracuhd, and Justices JB Pardiwala and Manoj Misra gave the verdict against the High Court's March 22 judgement striking down the Madarsa Education Act 2004 as \"unconstitutional\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-2024-voting-result-live-updates-donald-trump-kamala-harris-tim-walz-jd-vance-white-house-2628341-2024-11-05",
      "headline": "Live: Harris, Trump tied in midnight vote in US hamlet of Dixville NotchUS Presidential Election Live Updates: Kamala Harris and Donald Trump, the two contenders for the 2024 US presidential election, wrapped up their electoral campaigns on Monday night, paving the way for Americans to cast their ballots in one of the most anticipated polls in the country. While Trump, the Republican contender, is attempting to win a second stint at the White House, Harris -- the incumbent Vice President and Democratic nominee -- is vying to create history by becoming first female President of the US. The 7 battleground states of Arizona, Nevada, Georgia, North Carolina, Wisconsin, Michigan and Pennsylvania will play a key role in deciding the fate of Harris and Trump. The two will need at least 270 electoral votes to win the presidency. Voting will begin at 4.30 pm (IST) on Tuesday and will continue until around 6.30 pm (IST) on Wednesday morning. Follow indiatoday.in for live updates on the presidential election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-makes-formal-bid-to-host-2036-olympics-2628363-2024-11-05",
      "headline": "India makes formal bid to host 2036 OlympicsThe Indian Olympic Association (IOA) officially submitted a Letter of Intent to the Future Host Commission of the International Olympic Committee (IOC), formally expressing India's interest in hosting the Olympic and Paralympic Games in 2036. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/drunk-driving-mercedes-benz-rams-kills-bengaluru-woman-arrested-after-crash-2628320-2024-11-05",
      "headline": "20-year-old drunk man, driving Mercedes Benz, runs over woman in BengaluruA 30-year-old woman was killed after being hit by a speeding Mercedes driven by a drunk 20-year-old in Bengaluru's Kengeri area. The driver, Dhanush, attempted to flee but was caught by bystanders and arrested by the police. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/video/the-fabulous-life-of-shalini-passi-india-today-exclusive-2628254-2024-11-05",
      "headline": "The Fabulous Life of Shalini Passi: India Today ExclusiveDiet secrets, daily routine, life before getting married, her life mantra and some hilarious anecdotes from Netflix's Fabulous Lives vs Bollywood Lives—know it all and more from art collector, artist, and OTT star Shalini Passi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-hindu-protests-temple-attack-khalistanis-police-alert-2628334-2024-11-05",
      "headline": "Canada cops call Hindu protests near temple unlawful, warn of arrestsIssuing a public safety alert, Canadian police said 'weapons' were seen during the demonstration by members of the Hindu community outside the Hindu Mahasabha Temple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/sharad-pawar-hints-at-retirement-maharashtra-assembly-election-2628354-2024-11-05",
      "headline": "Sharad Pawar, 83, hints at retirement: Will have to stop somewhereSharad Pawar, speaking at a rally in Maharashtra's Baramati, said he would not contest any future elections and would work towards mentoring the younger generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/pennsylvania-election-swing-state-significance-kamala-harris-donald-trump-2628257-2024-11-05",
      "headline": "The fierce battle for Pennsylvania, the top prize of US electionUS election 2024: It is a measure of Pennsylvania's importance that both Kamala Harris and Donald Trump spent their last day of campaigning in the swing state. Here is why is likely to determine the White House winner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/who-is-bihari-tarzan-and-why-are-his-videos-viral-all-you-need-to-know-about-raja-yadav-2628344-2024-11-05",
      "headline": "Who is Bihari Tarzan and why are his videos viral?Who is Bihari Tarzan? Why are his videos viral? Here's all you need to know about Raja Yadav, the fitness enthusiast who has taken social media by storm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/sathyabamas-rise-building-a-stronger-future-2625146-2024-10-29",
      "headline": "Sathyabama's RISE - Building a Stronger FutureSathyabama Institute of Science and Technology stands out as a beacon of educational excellence and social responsibility. Under the visionary leadership of Chancellor Dr. Mariazeena Johnson, this institution is redefining what it means to be a premier university in India, transforming lives through both world-class education and impactful community initiatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sanjay-verma-new-maharashtra-director-general-of-police-replace-rashmi-shukla-transferred-over-phone-tapping-claims-2628382-2024-11-05",
      "headline": "Sanjay Verma appointed Maharashtra's new police chief, replaces Rashmi ShuklaThe Election Commission on Tuesday appointed Sanjay Verma as the new Director General of Police of Maharashtra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-government-wikipedia-bias-inaccuracies-small-group-editorial-control-complaint-2628252-2024-11-05",
      "headline": "Government raps Wikipedia over 'bias', says small group controls edits: SourcesThe government has put Wikipedia on notice over multiple complaints about bias and inaccuracies on the platform, sources said. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/how-the-us-presidential-election-trump-vs-harris-is-make-or-break-time-for-the-world-of-science-2628197-2024-11-05",
      "headline": "How the US election is make-or-break time for the world of scienceWith the candidates presenting starkly different agendas, the outcome could significantly influence national and global science policy in the years ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-sunil-gavaskar-on-indian-batters-technique-rohit-sharma-virat-kohli-2628180-2024-11-05",
      "headline": "Sunil Gavaskar explains why Indian Test batters are failing vs spinLegendary India cricketer Sunil Gavaskar has dissected why Indian batters have struggled to bat against spin amid their recent dismal performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/iit-kanpur-to-consider-olympiad-scores-for-admission-to-btech-bs-programmes-2628277-2024-11-05",
      "headline": "IIT Kanpur to consider Olympiad scores for admission to BTech-BS programmesThe Indian Institute of Technology, IIT Kanpur will admit students to its BTech and BS programmes through the Olympiads. Starting from the 2025-26 academic year, this admission process will be implemented in five departments.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-battleground-swing-states-fate-kamala-harris-donald-trump-2628200-2024-11-05",
      "headline": "The 7 states that will swing the fate of Kamala Harris and Donald TrumpUS election 2024: The 2024 US presidential race will be determined by seven swing states: Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania, and Wisconsin, which collectively hold 93 electoral votes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/what-is-rhabdomyosarcoma-all-about-rare-cancer-tiktoker-bella-bradford-death-2628372-2024-11-05",
      "headline": "All about the rare cancer behind TikToker Bella Bradford's death at 2424-year-old TikTok star Bella Bradford announced her death in a video released posthumously. She was suffering from a rare cancer - rhabdomyosarcoma - which forms in the body's muscle tissue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/a-bullet-train-to-economic-prosperity-how-station-areas-are-being-planned-so-2627892-2024-11-04",
      "headline": "A bullet train to economic prosperity? How station areas are being planned soDeveloping the 12 stations on the Mumbai-Ahmedabad Bullet Train route as zones of economic influence is the focus of urban bodies in Maharashtra and Gujarat"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/jharkhand-assembly-polls-yogi-aditynath-calls-for-bulldozer-hemant-soren-alamgir-alam-india-bloc-ram-temple-ayodhya-2628364-2024-11-05",
      "headline": "Bring BJP in power to bulldoze mafia: Yogi Adityanath in poll-bound JharkhandAddressing a rally in Jharkhand's Koderma, Uttar Pradesh Chief Minister Yogi Adityanath accused the Hemant Soren-led Jharkhand government of patronising the mafia and urged people to vote for BJP, which would bulldoze them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aap-mla-naresh-balyan-sexist-remark-road-like-hema-malini-cheeks-bjp-praveen-shankar-kapoor-demands-action-swati-maliwal-national-commission-for-women-2628210-2024-11-05",
      "headline": "Road like Hema Malini's cheeks: AAP MLA's remark stirs row, BJP demands actionDelhi BJP spokesperson Praveen Shankar Kapoor charged that AAP MLA Naresh Balyan has not only disrespected women but has also humiliated the people of the area by saying that roads will be repaired by the \"35th\" of the month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/who-is-sharda-sinha-singer-who-moved-many-to-tears-with-hum-aapke-hain-koun-song-2628214-2024-11-05",
      "headline": "Who is Sharda Sinha, singer who moved many to tears with Hum Aapke Hain Koun songSharda Sinha, the renowned folk singer from Bihar, is in critical condition and on ventilator support at AIIMS. The Padma Bhushan awardee is famous for her iconic Chhath songs and has also lent her voice to several popular Bollywood tracks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/chief-justice-dy-chandrachud-independence-judiciary-isnt-always-deciding-against-government-2628164-2024-11-05",
      "headline": "Judiciary's independence doesn't mean deciding against government: Chief JusticeWhile addressing an event in Delhi on Monday, the Chief Justice said that when he struck down the electoral bonds scheme and ruled against the Centre, he was called \"very independent\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-elections-donald-trump-victory-impact-dalal-street-stock-market-sensex-nifty-explained-2628286-2024-11-05",
      "headline": "US elections: What a Donald Trump victory could mean for Dalal StreetWith the stage set for the US elections, could a Donald Trump win spark a bullish turn for the Indian stock market, or will uncertainty keep investors on edge?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/hyderabad-man-loses-rs-50-lakh-after-joining-whatsapp-group-to-learn-stock-market-investment-2628253-2024-11-05",
      "headline": "Hyderabad man loses Rs 50 lakh after joining WhatsApp group to learn stock market investment In a recent case of an online scam, an elderly man from Hyderabad fell victim to a WhatsApp-based stock market scam, losing Rs 50 lakh after being lured by promises of high returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-kanguva-november-14-release-hope-we-have-another-diwali-2628360-2024-11-05",
      "headline": "Actor Suriya on Kanguva release: I hope we have another Diwali on November 14Actor Suriya, who is gearing up for the release of his upcoming magnum opus Kanguva, was in Bengaluru for the promotions of his film. While talking about the fantasy action film which is directed by Siva, Suriya spoke about the motivation behind bringing a film like Kanguva, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-wishes-virat-kohli-on-36th-birthday-with-1st-pic-of-son-daughter-2628380-2024-11-05",
      "headline": "Anushka Sharma wishes Virat Kohli on 36th birthday with 1st pic of son, daughterActor Anushka Sharma on Tuesday celebrated her husband and cricketer, Virat Kohli's 36th birthday, with a heart-warming post on Instagram. The photo that she shared featured Virat carrying their kids Akaay and Vamika. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/richard-gere-is-leaving-america-sells-connecticut-home-for-11-million-dollars-2628370-2024-11-05",
      "headline": "Richard Gere is leaving America, sells Connecticut home for $11 millionAmerican movie star Richard Gere is leaving the US for Spain. According to reports, Gere recently sold his Connecticut house for 11 million dollars. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-kiran-rao-on-oscar-worthy-laapataa-ladies-and-breaking-social-norms-2628373-2024-11-05",
      "headline": "Exclusive: Kiran Rao on Oscar-worthy Laapataa Ladies, and breaking 'social norms'In an exclusive interview with us, filmmaker Kiran Rao shares her excitement for Laapataa Ladies, and explains her ambitions and purpose as a woman in the Indian filmmaking scene. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-full-schedule-fixtures-teams-unvieled-phases-2628379-2024-11-05",
      "headline": "Hockey India League full schedule, format, fixtures and teams: ExplainedThe men's Hockey India League will get underway from December 28 and will be held in two phases. The women's edition of the tournament will be played from January 12 to 26. Eight men's teams and four women's teams will be in action as the HIL returns to the hockey calendar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-makes-formal-bid-to-host-2036-olympics-2628363-2024-11-05",
      "headline": "India makes formal bid to host 2036 OlympicsThe Indian Olympic Association (IOA) officially submitted a Letter of Intent to the Future Host Commission of the International Olympic Committee (IOC), formally expressing India's interest in hosting the Olympic and Paralympic Games in 2036. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-birthday-greatest-of-all-time-emotional-note-riyan-parag-2628351-2024-11-05",
      "headline": "Happy Birthday GOAT: Riyan Parag pens emotional wish for idol Virat KohliIndia and Rajasthan Royals all-rounder, Riyan Parag, penned an emotional birthday note for his idol Virat Kohli. Wishes have been pouring in for the former India captain who turned 36 on Tuesday, November 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/danish-kaneria-virat-kohli-rohit-sharma-border-gavaskar-trophy-australia-vs-india-2628338-2024-11-05",
      "headline": "Danish Kaneria advises struggling Rohit-Kohli to change batting order in Australia Former Pakistan cricketer Danish Kaneria has advised star India batters Rohit Sharma and Virat Kohli to change their batting order in the upcoming tour of Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-scott-boland-world-class-rahul-pressure-test-series-2628317-2024-11-05",
      "headline": "Boland wants to keep 'world-class' Rahul under pressure in India Test seriesAustralia pacer Scott Boland has marked KL Rahul as a key target in the upcoming Border-Gavaskar Trophy, aiming to leverage Australia's bouncier, seam-friendly conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-eng-philip-salt-jos-buttler-england-tour-of-west-indies-2628304-2024-11-05",
      "headline": "WI vs ENG: Phil Salt to keep wickets in T20I series despite Jos Buttler's returnEngland wicketkeeper batter Phil Salt will be seen keeping wickets in the T20I series against West Indies despite captain Jos Buttler's return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-birthday-memories-world-cup-sachin-tendulkar-record-hundred-2628290-2024-11-05",
      "headline": "When Virat Kohli celebrated his birthday by equalling idol Tendulkar's recordVirat Kohli celebrated his 35th birthday last year by hitting a hundred for India in their ODI World Cup match against South Africa in Kolkata. With the three-figure score, Kohli equalled his idol Sachin Tendulkar's all-time record for most hundreds in the 50-over format of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ian-healy-slams-australian-boys-egos-nervy-win-pakistan-2628235-2024-11-05",
      "headline": "Ian Healy slams 'Australian Boys' egos' after nervy win over PakistanFormer Australian wicketkeeper Ian Healy sharply criticized Australia's poor batting in their first ODI against Pakistan at the MCG, where they scraped a two-wicket win, chasing 204 in 33.3 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-birthday-wishes-yuvraj-singh-suresh-raina-kohl-records-2628226-2024-11-05",
      "headline": "Virat Kohli turns 36, Yuvraj, Raina lead birthday wishes for batting stalwartStar India batter Virat Kohli is celebrating his 36th birthday as wishes poured in for the star batter on his special day from the entire cricketing fraternity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bayer-leverkusen-coach-xabi-alonso-calls-liverpool-one-of-europe-best-2628225-2024-11-05",
      "headline": "Leverkusen's Alonso calls Liverpool one of Europe's best ahead of clashBayer Leverkusen coach Xabi Alonso acknowledged his team's struggle against Liverpool in the Champions League on Tuesday, describing the Merseyside club as one of Europe's finest teams at the moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/match-fixing-scandal-in-mizoram-24-footballers-3-clubs-banned-in-local-league-2628205-2024-11-05",
      "headline": "Match-fixing scandal breaks out in Mizoram football; 24 players bannedThe Mizoram Football Association has banned three clubs and 24 players after uncovering a match-fixing scandal in the Mizoram Premier League. The association is determined to maintain the sport's integrity and has assured strict penalties for those involved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-birthday-memories-world-cup-sachin-tendulkar-record-hundred-2628290-2024-11-05",
      "headline": "When Virat Kohli celebrated his birthday by equalling idol Tendulkar's recordVirat Kohli celebrated his 35th birthday last year by hitting a hundred for India in their ODI World Cup match against South Africa in Kolkata. With the three-figure score, Kohli equalled his idol Sachin Tendulkar's all-time record for most hundreds in the 50-over format of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ian-healy-slams-australian-boys-egos-nervy-win-pakistan-2628235-2024-11-05",
      "headline": "Ian Healy slams 'Australian Boys' egos' after nervy win over PakistanFormer Australian wicketkeeper Ian Healy sharply criticized Australia's poor batting in their first ODI against Pakistan at the MCG, where they scraped a two-wicket win, chasing 204 in 33.3 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-birthday-wishes-yuvraj-singh-suresh-raina-kohl-records-2628226-2024-11-05",
      "headline": "Virat Kohli turns 36, Yuvraj, Raina lead birthday wishes for batting stalwartStar India batter Virat Kohli is celebrating his 36th birthday as wishes poured in for the star batter on his special day from the entire cricketing fraternity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bayer-leverkusen-coach-xabi-alonso-calls-liverpool-one-of-europe-best-2628225-2024-11-05",
      "headline": "Leverkusen's Alonso calls Liverpool one of Europe's best ahead of clashBayer Leverkusen coach Xabi Alonso acknowledged his team's struggle against Liverpool in the Champions League on Tuesday, describing the Merseyside club as one of Europe's finest teams at the moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/match-fixing-scandal-in-mizoram-24-footballers-3-clubs-banned-in-local-league-2628205-2024-11-05",
      "headline": "Match-fixing scandal breaks out in Mizoram football; 24 players bannedThe Mizoram Football Association has banned three clubs and 24 players after uncovering a match-fixing scandal in the Mizoram Premier League. The association is determined to maintain the sport's integrity and has assured strict penalties for those involved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-sunil-gavaskar-on-rohit-sharma-virat-kohli-gautam-gambhir-australia-test-series-2628201-2024-11-05",
      "headline": "Sunil Gavaskar exclusive full text: 'Australia series to decide future of seniors'Legendary India cricketer Sunil Gavaskar in an exclusive conversation with India Today, dissected India's series loss against New Zealand and the spoke about the future of senior players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/happy-birthday-virat-kohli-star-batter-redefined-fitness-indian-cricket-2628195-2024-11-05",
      "headline": "How Virat Kohli redefined fitness in Indian cricketVirat Kohli, who once celebrated sweets as freely as he celebrated scoring runs, is now the fitness icon of Indian cricket. Today, on his birthday, we celebrate the story of a man who didn't just change his own life; he redefined the culture of an entire sport.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-sunil-gavaskar-on-indian-batters-technique-rohit-sharma-virat-kohli-2628180-2024-11-05",
      "headline": "Sunil Gavaskar explains why Indian Test batters are failing vs spinLegendary India cricketer Sunil Gavaskar has dissected why Indian batters have struggled to bat against spin amid their recent dismal performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-expecting-challenging-season-for-injury-hit-manchester-city-2628170-2024-11-05",
      "headline": "Guardiola sees challenging season for injury-hit City with Sporting nextManchester City will have a more difficult season as they deal with injuries that make it difficult to replicate their current success, manager Pep Guardiola warned ahead of their Champions League match against Sporting on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-pak-haris-rauf-mcg-melbourne-cricket-ground-mitchell-starc-pat-cummins-2628166-2024-11-05",
      "headline": "Haris Rauf rues not defending 203 in first ODI vs Australia: We were untidyPakistan fast bowler Haris Rauf rued not being able to defend 203 in the first ODI vs Australia as they lost the match by two wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-australia-vs-india-border-gavaskar-trophy-2024-25-2628156-2024-11-05",
      "headline": "Why R Ashwin should not be written off ahead of Australia seriesStar India spinner Ravichandran Ashwin had a terrible time in the New Zealand series. The spinner picked up only 9 wickets from 3 Test matches, and was faced a lot of cricticism. But here's why Indian fans should not count him out ahead of the Australia tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/happy-birthday-virat-kohli-wishlist-for-36-year-old-superstar-2628122-2024-11-05",
      "headline": "Happy Birthday Virat Kohli: A wishlist for 36-year-old superstarThe star of Indian cricket, Virat Kohli, is celebrating his 36th birthday. Here is a little wish-list for the batting maestro as he completes 365 days around the sun."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tests-player-of-the-series-will-young-2628115-2024-11-04",
      "headline": "No one in New Zealand even dreamt of 3-0 win vs India: Will YoungWill Young, player of the series in IND vs NZ said that no one even dreamt of a whitewash when they arrived in India. Young, who put up consistent performances in the series said that the mood in the team is incredible after their historic feat.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-pak-haris-rauf-mcg-melbourne-cricket-ground-mitchell-starc-pat-cummins-2628166-2024-11-05",
      "headline": "Haris Rauf rues not defending 203 in first ODI vs Australia: We were untidyPakistan fast bowler Haris Rauf rued not being able to defend 203 in the first ODI vs Australia as they lost the match by two wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-australia-vs-india-border-gavaskar-trophy-2024-25-2628156-2024-11-05",
      "headline": "Why R Ashwin should not be written off ahead of Australia seriesStar India spinner Ravichandran Ashwin had a terrible time in the New Zealand series. The spinner picked up only 9 wickets from 3 Test matches, and was faced a lot of cricticism. But here's why Indian fans should not count him out ahead of the Australia tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/happy-birthday-virat-kohli-wishlist-for-36-year-old-superstar-2628122-2024-11-05",
      "headline": "Happy Birthday Virat Kohli: A wishlist for 36-year-old superstarThe star of Indian cricket, Virat Kohli, is celebrating his 36th birthday. Here is a little wish-list for the batting maestro as he completes 365 days around the sun."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tests-player-of-the-series-will-young-2628115-2024-11-04",
      "headline": "No one in New Zealand even dreamt of 3-0 win vs India: Will YoungWill Young, player of the series in IND vs NZ said that no one even dreamt of a whitewash when they arrived in India. Young, who put up consistent performances in the series said that the mood in the team is incredible after their historic feat.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-tour-will-decide-the-future-of-lot-of-players-sunil-gavaskar-2628080-2024-11-04",
      "headline": "Australia tour will decide the future of lot of players: Sunil GavaskarAustralia tour will decide the future of several Indian players including Rohit Sharma and Virat Kohli, feels Sunil Gavaskar. The former cricketer felt that the captain and coach duo should be held responsible for the series loss vs New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-should-not-captain-if-he-misses-2-tests-in-australia-gavaskar-2628047-2024-11-04",
      "headline": "Rohit Sharma should not captain if he misses 2 Tests in AUS: GavaskarFormer India cricketer Sunil Gavaskar said that India should not keep Rohit Sharma the captain for the Australia tour in case he misses 2 or more Test matches. Gavaskar said that instead of Rohit, Jasprit Bumrah should be made the India captain for the entire series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-gets-hanuman-jis-poster-by-fan-ahead-of-36th-birthday-in-mumbai-2628014-2024-11-04",
      "headline": "Virat Kohli gets Hanuman ji's poster by fan ahead of 36th birthday in MumbaiVirat Kohli received Hanuman ji's portrait from a fan at the Indian team's hotel in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-new-zealand-cricketers-get-warm-reception-after-historic-series-win-in-india-2628012-2024-11-04",
      "headline": "New Zealand cricketers get warm reception after historic series win in IndiaNew Zealand cricket team got a rousing reception at their team hotel in Mumbai after their historic whitewash of India. The team put out the video of the celebration via their social media accounts."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}