{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-board-approves-company-name-change-to-eternal-ltd-ceo-deepinder-goyal-2675789-2025-02-06",
      "headline": "Zomato board approves renaming company to Eternal Ltd: CEO Deepinder GoyalThe renaming announcement comes weeks after Zomato entered the BSE Sensex on December 23, which coincides with the 17th anniversary of its founding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/default-on-personal-loan-check-consequences-impact-on-credit-score-hefty-penalty-legal-notice-2675670-2025-02-06",
      "headline": "What if you default on personal loan? Check consequencesPersonal loan default consequences: Banks or lenders impose hefty penalties, or late fee charges in case of a missed EMI amount. They may even impose higher interest charges and additional charges for collection efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-redeem-credit-card-points-check-2-simple-ways-online-banking-customer-service-helpline-2675748-2025-02-06",
      "headline": "Want to redeem credit card points? Check these 2 simple ways How to redeem credit card points: The number of credit card points one earns depends on the type of card, whether basic or premium, and the amount spent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-fall-sharply-as-dalal-street-remains-edgy-ahead-of-rbis-rate-decision-2675724-2025-02-06",
      "headline": "Sensex, Nifty fall sharply as D-Street remains edgy ahead of RBI's rate decisionThe S&P BSE Sensex closed 213.12 points lower at 78,058.16 and the NSE Nifty50 settled 92.95 points lower at 23,603.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-income-tax-regime-maximum-deductions-savings-calculations-explained-2675707-2025-02-06",
      "headline": "How much can you save with maximum deductions under old income tax regime?Old tax regime: What if someone earning above Rs 12.75 lakh annually chooses the old regime and claims the maximum deductions? Will it result in tax savings? This article explores the key deductions available under the old income tax regime and the maximum amount one can claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-tax-regime-which-one-should-you-choose-for-income-above-rs-12-lakh-2675644-2025-02-06",
      "headline": "Old vs New tax regime: Which one should you choose for income above Rs 12.75 lakh?Old vs New tax regime: What if you earn more than Rs 12.75 lakh? Should you pick the new tax regime for lower rates or stick to the old one for deductions?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-what-is-it-and-how-will-it-help-taxpayers-2675626-2025-02-06",
      "headline": "New Income Tax Bill: What is it and how will it help taxpayers?In order to make the Income Tax Act 1961 more concise and simpler, the government is introducing a new income tax bill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/union-cabinet-likely-to-approve-new-income-tax-bill-tomorrow-2675611-2025-02-06",
      "headline": "Union Cabinet likely to approve new Income Tax Bill tomorrowThe Union Cabinet is expected to clear the new Income Tax Bill tomorrow, paving the way for its introduction in the Lok Sabha"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-stock-price-today-falling-q3fy25-results-explained-2675613-2025-02-06",
      "headline": "Explained: Why Swiggy shares hit record low todaySwiggy shares dropped over 7% to hit a new 52-week low of Rs 387 on the Bombay Stock Exchange (BSE) in early trade. At around 11:37 am, Swiggy shares were down 4.16% lower at Rs 400.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-bets-on-pro-business-policies-in-budget-2025-here-are-the-key-takeaways-business-friendly-reforms-2675596-2025-02-06",
      "headline": "India bets on pro-business policies in Budget 2025. Here are the key takeawaysOne of the most significant initiatives announced is the establishment of a High-Level Committee for transformative reforms across sector regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-will-senior-citizens-benefit-from-increased-tds-limits-on-interest-and-rental-payments-2675587-2025-02-06",
      "headline": "How will senior citizens benefit from increased TDS limits?The tax reforms announced in Budget 2025 aim at lowering the compliance burden for elderly taxpayers, and giving them enhanced financial flexibility and security in their retirement years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-likely-to-be-approved-by-cabinet-tomorrow-check-key-details-2675593-2025-02-06",
      "headline": "New Income Tax Bill likely to be approved by Cabinet tomorrow. Check key details The new legislation, often referred to as the Direct Tax Code, is aimed at overhauling the existing tax structure, making it more streamlined and transparent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-policy-decision-repo-rate-cut-likely-first-time-in-5-years-25-bps-2675563-2025-02-06",
      "headline": "Will RBI cut key rates for 1st time in 5 years? 4 things you need to knowRBI MPC: There are expectations that the central bank's MPC will decide on cutting the key rates for the first time in 5 years by 25 basis points (BPS)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-flat-opening-investors-rbi-rate-decision-25-bps-cut-2675557-2025-02-06",
      "headline": "Sensex, Nifty fall after flat opening as investors await RBI rate decisionShare Market Today: The S&P BSE Sensex was down 151.58 points to 78,119.70 at 10:12 am, while the NSE Nifty50 traded 42.95 points lower at 23,696.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-accuses-kia-of-tax-evasion-in-vw-like-dispute-report-2675260-2025-02-05",
      "headline": "Government accuses Kia of tax evasion in VW-like dispute: ReportKia competes with Hyundai and Maruti Suzuki in the world's third-largest auto market, where it has a share of 6% of roughly 4 million units a year, and its Kia Seltos and Sonet SUVs are among the top sellers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-end-lower-as-consumer-shares-fall-rupee-drops-2675234-2025-02-05",
      "headline": "Sensex, Nifty end lower as consumer stocks weigh; rupee dropsShare Market: The S&P BSE Sensex was down 312.53 points to 78,271.28 at the closing bell, while the NSE Nifty50 settled 42.95 points lower at 23,696.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/openai-sam-altman-meets-with-it-minister-ashwini-vaishnaw-to-discuss-india-ai-roadmap-2675222-2025-02-05",
      "headline": "OpenAI's Sam Altman meets with IT minister to discuss India's AI roadmapIn a post on X, Ashwini Vaishnaw said he had a \"super cool discussion\" with Altman on India's \"strategy of creating the entire AI stack - GPUs, model, and apps\" and that OpenAI was willing to collaborate on all three."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-regime-relief-capital-gains-tax-rs-12-lakh-does-it-apply-2675212-2025-02-05",
      "headline": "Will Rs 12 lakh income qualify for zero tax even with capital gains?The biggest announcement was that individuals earning up to Rs 12 lakh would not have to pay any tax. But does this still apply if you have additional income from capital gains? Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quick-commerce-zepto-delivering-cars-now-skoda-kylaq-new-teaser-sparks-buzz-february-8-2675195-2025-02-05",
      "headline": "Zepto delivering cars now? Skoda's new teaser sparks buzzWhile the teaser does not confirm the exact details, it suggests that Skoda cars could soon be purchased through Zepto."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arbitrator-may-decide-who-controls-ratan-tatas-fortune-report-2675159-2025-02-05",
      "headline": "Arbitrator may decide who controls Ratan Tata's fortune: ReportRatan Tata had set up two entities in 2022 to manage his personal wealth for charitable purposes—the RTEF under Section 8 of the Companies Act 2013 and the Ratan Tata Endowment Trust."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kinda-pregnant-review-amy-schumers-comedy-netflix-film-barely-delivers-2675690-2025-02-06",
      "headline": "Kinda Pregnant review: Amy Schumer's comedy film barely deliversReleased-Wed Feb 05, 2025Amy Schumer returns with Kinda Pregnant, a comedy that struggles to hit the mark. Despite its premise of friendship and motherhood, it fails to offer fresh laughs or insights."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-wife-hailey-step-out-for-a-date-amid-divorce-rumours-2675733-2025-02-06",
      "headline": "Justin Bieber, wife Hailey step out for a date amid divorce rumoursJustin and Hailey Bieber were seen enjoying a date night in New York City, countering recent divorce rumours. Despite reports of marital strain linked to Justin's legal anxieties, the couple appeared united."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anuja-movie-review-hard-hitting-subject-compelling-watch-2675725-2025-02-06",
      "headline": "Anuja review: Raw performances, hard-hitting subject make it a compelling watchReleased-Thu Feb 06, 2025Anuja movie review: Oscar-nominated Anuja is a gripping short film on child labour and resilience. With stellar performances and a hard-hitting narrative, it is a must-watch on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-night-agent-season-2-review-equal-parts-dramatic-and-delectably-exciting-netflix-series-2675638-2025-02-06",
      "headline": "The Night Agent Season 2 review: Equal parts dramatic and delectably excitingReleased-Thu Jan 23, 2025In The Night Agent Season 2 on Netflix, a spy recruited by the most secretive body of the FBI, gets entangled in the mysteries of state secrets and in-house traitors. Peter Sutherland is back to save his country from falling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kadhalikka-neramillai-on-ott-when-where-to-watch-nithya-menen-ravi-mohan-film-2675609-2025-02-06",
      "headline": "Kadhalikka Neramillai on OTT: When and where to watch Nithya Menen, Ravi Mohan filmNithya Menen and Ravi Mohan's Kadhalikka Neramillai is reportedly gearing up for its OTT debut on Netflix. The film was earlier released in theatres during the Pongal festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-review-sanya-malhotra-nishant-dahiya-kanwaljit-singh-zee5-film-2675594-2025-02-06",
      "headline": "Mrs review: Sanya Malhotra's film is an unsettling watch, for all the right reasonsReleased-Thu Feb 06, 2025ZEE5 film 'Mrs', starring Sanya Malhotra, explores the harsh realities that several women face in marriage. A Hindi adaptation of 'The Great Indian Kitchen', Mrs delves into themes of patriarchy and unfulfilled aspirations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shiv-sena-mp-milind-deoras-woke-dig-at-grammys-for-not-honouring-zakir-hussain-2675559-2025-02-06",
      "headline": "Milind Deora's 'woke' dig at Grammys for not honouring tabla icon Zakir HussainShiv Sena leader and Member of Parliament Milind Deora took a dig at the Grammys for omitting Tabla maestro Zakir Hussain's name from their In Memoriam segment. Zakir Hussain, who died in December 2024, was a four-time Grammy winner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/drake-kendrick-lamar-biggest-fight-rap-history-grammys-2025-2675551-2025-02-06",
      "headline": "Kendrick Lamar vs Drake: Did the Grammys settle the 'battle rap'?Rappers Kendrick Lamar and Drake's feud spans over a decade, with diss tracks, accusations, and a lawsuit. From collaborations to lyrical attacks, here's a full breakdown of their ongoing rap battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jisoo-of-blackpink-working-in-newtopia-gave-me-a-lot-of-confidence-2675539-2025-02-06",
      "headline": "Jisoo of BLACKPINK: Working in Newtopia gave me a lot of confidence The highly anticipated K-drama, Newtopia, featuring Park Jeong-min and BLACKPINK's Jisoo, debuts on February 7, 2025, blending a zombie apocalypse with a poignant love story. Jisoo opens up on her character and the differences between herself and Young-joo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-and-ar-rahman-perform-urvasi-urvasi-in-chennai-leave-fans-ecstatic-2675531-2025-02-06",
      "headline": "Ed Sheeran, AR Rahman perform Urvasi Urvasi in Chennai, fans ecstaticEd Sheeran's Chennai concert took an unforgettable turn when AR Rahman joined him on stage. The duo's surprise performance left the audience thrilled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-to-skip-the-bads-of-bollywood-promotions-2675386-2025-02-05",
      "headline": "Aryan Khan to skip The Bads of Bollywood promotions. How makers plan to compensateSuperstar Shah Rukh Khan's son, Aryan Khan, will not be a part of any promotional event for his debut series, the Netflix project, The Bads of Bollywood. The show is set to feature Bobby Deol, Mona Singh among others in pivotal roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/one-piece-season-2-wraps-filming-netflix-shares-first-look-2675387-2025-02-05",
      "headline": "One Piece Season 2 filming wrapped. Netflix shares first look from the showNetflix has completed the filming of One Piece Season 2, and the main cast shared a celebratory image. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-on-ott-when-and-where-to-watch-sanya-malhotra-hindi-remake-of-great-indian-kitchen-stmp-2675365-2025-02-05",
      "headline": "Mrs on OTT: When and where to watch Sanya Malhotra's filmSanya Malhotra's Mrs, the Hindi remake of The Great Indian Kitchen, will release on Zee5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kapil-sharma-says-coldplay-wanted-to-appear-on-his-show-sent-his-team-a-mail-2675358-2025-02-05",
      "headline": "Kapil Sharma says Coldplay reached out to appear on his showKapil Sharma recently revealed that British band Coldplay expressed their desire to take part in his show. The band was in India as part of their Music of Spheres tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aamir-ali-on-finding-love-again-staying-private-after-divorce-dating-ankita-kukreja-2675310-2025-02-05",
      "headline": "Aamir Ali opens up finding love again, staying private after divorceAamir Ali shared insights on finding love again after his divorce from Sanjeeda Shaikh. He talked about his emotional journey and staying private about his personal life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/celebrity-masterchef-review-farah-khan-tejasswi-prakash-2675267-2025-02-05",
      "headline": "Too many celebs spoil the broth: Why Celebrity MasterChef is not palatableWhile Celebrity MasterChef offers entertainment, it lacks the raw authenticity that made the original MasterChef format so compelling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-meets-ar-rahman-new-pic-sparks-collaboration-rumours-2675203-2025-02-05",
      "headline": "Ed Sheeran meets AR Rahman, sparks collaboration rumoursEd Sheeran and AR Rahman shared a picture together, sparking collaboration rumours. Fans are excited about the possibility of a joint musical project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-recruit-season-2-review-noah-centineo-teo-yoo-2675194-2025-02-05",
      "headline": "The Recruit S2 review: Teo Yoo steals the show in this Noah Centineo seriesReleased-Fri Jan 31, 2025The Recruit Season 2 sees Noah Centineo's Owen Hendricks embark on a new mission in South Korea. The season introduces Teo Yoo as Jung Kyung, who steals the spotlight with his flawless performance. Read more about how this season fared."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/blackpink-lisa-shares-release-date-of-white-lotus-season-3-2675179-2025-02-05",
      "headline": "Blackpink's Lisa shares release date of White Lotus Season 3. WatchThe release date of the highly-anticipated White Lotus Season 3 is here. The HBO show will begin streaming from this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mufasa-the-lion-king-to-stream-ott-february-on-rent-disney-plus-hotstar-2675172-2025-02-05",
      "headline": "Mufasa: The Lion King to stream on OTT from February, but here's the catchMufasa: The Lion King is set to stream on Disney+ Hotstar from February 18. The musical film will be available to stream on Video-on-demand. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-in-rajya-sabha-sabka-saath-sabka-vikas-beyond-imagination-of-congress-motion-of-thanks-president-address-rahul-gandhi-2675721-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi refers to ban on Dev Anand's films to blast Congress on EmergencyPrime Minister Narendra Modi, speaking in Rajya Sabha, underscored that while the BJP's model of development was 'nation first', for the Congress it was 'family first' - a reference to the Gandhis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-budget-session-updates-opposition-protests-deportation-illegal-indians-us-2675585-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Use of restraint US SOP: Jaishankar as video of cuffed deported Indians emergesParliament Budget session: External Affairs Minister S Jaishankar, speaking in the Rajya Sabha, said India was engaging the US to ensure the deportees are not mistreated in any manner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-board-approves-company-name-change-to-eternal-ltd-ceo-deepinder-goyal-2675789-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Zomato board approves renaming company to Eternal Ltd: CEO Deepinder GoyalThe renaming announcement comes weeks after Zomato entered the BSE Sensex on December 23, which coincides with the 17th anniversary of its founding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-odi-live-score-ind-eng-updates-virat-rohit-buttler-nagpur-2675595-2025-02-06?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "1st ODI LIVE: Shreyas reaches fifty in just 30 balls, as India dominate chaseIndia (IND) vs England (ENG) 1st ODI LIVE Updates: Shreyas Iyer hits the second fastest fifty in his ODI career. He has combined with Shubman Gill to counterpunch the England side after the hosts lost two early wickets in the chase. India have gone past 100 runs in just 14 overs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/why-handcuffed-illegal-immigrants-alarmed-india-american-standard-practice-s-jaishankar-donald-trump-2675746-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Indians deported in handcuffs sparked outrage? Explaining law and loathingThe images of Indians being deported from the US in handcuffs and leg restraints sparked a huge uproar, even leading to disruptions in Parliament. This strong reaction to the deportation of illegal immigrants in restraints may stem from the differing practices regarding the use of handcuffs by law enforcement in the US and India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-protest-india-sheikh-hasina-online-speech-mujibur-rahman-house-burnt-2675807-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bangladesh lodges protest with India over Sheikh Hasina's 'fabricated' remarksBangladesh lodged a protest with India's Acting High Commissioner over the \"false and fabricated\" remarks by deposed Prime Minister Sheikh Hasina and said such statements were hurting the sentiments of the people there."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-ban-dev-anand-films-doordarshan-dd-congress-emergency-freedom-of-speech-2675804-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ban on Dev Anand films: What were the DD days that PM reminded Congress of?Prime Minister Narendra Modi, while attacking the Congress on its crackdown on freedom of speech and curbing rights, reminded it of the time when Dev Anand films were banned from Doordarshan (DD). He also spoke of how Balraj Sahni and Majrooh Sultanpuri were arrested in 1949. Here's how artists faced the might of governments during the Gandhi-Nehru regime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-tax-regime-which-one-should-you-choose-for-income-above-rs-12-lakh-2675644-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Old vs New tax regime: Which one should you choose for income above Rs 12.75 lakh?Old vs New tax regime: What if you earn more than Rs 12.75 lakh? Should you pick the new tax regime for lower rates or stick to the old one for deductions?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/how-to-stick-to-phone-free-february-challenge-and-reduce-screen-time-2675803-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How to stick to Phone-Free February challenge, and reduce screen timeHow about going phone-free this February? Hold on, no need to give up just because of the title of this viral challenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-first-odi-rohit-sharma-failure-trolled-nagpur-2675837-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Please retire Rohit Sharma: Fans troll India captain after Nagpur ODI failureRohit Sharma was heavily trolled by fans on social media after his failure in the Nagpur ODI against England on Thursday, February 6. Rohit was dismissed for just 2 runs in the first ODI of the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-trying-to-break-aap-offered-rs-15-crore-to-7-candidates-sanjay-singh-claims-2675737-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AAP alleges Op Lotus in Delhi: BJP elements offered Rs 15 crore to 7 of our MLAsWithout revealing the names of the candidates, Sanjay Singh said that seven of them received phone calls from the BJP, a day after the 70-member Delhi Legislative Assembly went to polls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-bans-trans-athletes-in-womens-sports-wont-allow-men-to-beat-girls-2675822-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump signs order banning trans athletes in women's sports, but legal battles loomDonald Trump has signed an executive order to ban trans athletes from women's sports but there are several challenges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-deportee-panama-jungle-dunki-route-enter-united-states-illegally-2675671-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian deportee's video from Panama jungle shows donkey route to enter USIn a video shared by the family, Akash is seen camping with several other illegal immigrants in the dense forests of Panama while en route to the US. The footage also shows women and children wading through a water body."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/government-new-law-soon-indians-working-abroad-sources-amid-us-deportation-row-2675759-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre to bring in law for Indians working abroad: Sources amid US deportation rowOn February 5, a US military plane carrying 104 illegal Indian immigrants landed in Amritsar amid President Donald Trump's crackdown on undocumented aliens in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-review-sanya-malhotra-nishant-dahiya-kanwaljit-singh-zee5-film-2675594-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mrs review: Sanya Malhotra's film is an unsettling watch, for all the right reasonsReleased-Thu Feb 06, 2025ZEE5 film 'Mrs', starring Sanya Malhotra, explores the harsh realities that several women face in marriage. A Hindi adaptation of 'The Great Indian Kitchen', Mrs delves into themes of patriarchy and unfulfilled aspirations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-hypocrisy-kashmir-pok-pm-shahbaz-sharif-terrorism-peace-india-host-hamas-let-jem-terrorists-2675677-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistan exposes itself yet again, with forked tongue on Kashmir, terrorismEven as Pakistani Prime Minister Shahbaz Sharif spoke of peace with India, Islamabad hosted a rally in Pakistan-Occupied Kashmir (POK) that featured top terrorists of JeM, LeT, and Hamas. The contradiction of both the actions and speeches laid bare once again Islamabad's duplicity and doublespeak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anuja-movie-review-hard-hitting-subject-compelling-watch-2675725-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Anuja review: Raw performances, hard-hitting subject make it a compelling watchReleased-Thu Feb 06, 2025Anuja movie review: Oscar-nominated Anuja is a gripping short film on child labour and resilience. With stellar performances and a hard-hitting narrative, it is a must-watch on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-assembly-elections-exit-polls-matrize-cvoter-peoples-pulse-pmark-bjp-win-prediction-aap-congress-arvind-kejriwal-narendra-2675346-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP comeback in Delhi after 27 years, predict exit polls, big setback for AAP Delhi exit poll results: A majority of exit polls have predicted that the BJP would break its losing streak in Delhi and stop the juggernaut of the AAP, which was eyeing a third term in the national capital."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-dhaka-warming-up-to-pakistan-while-attempting-thaw-with-india-intrigues-2675238-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Dhaka warming up to Pakistan while attempting thaw with India intriguesBangladesh's strategic overtures to Pakistan are bound to arouse deep suspicion given India's perception that Sheikh Hasina was unseated by an ISI-orchestrated uprising\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/five-planets-begin-celestial-lineup-how-to-see-them-venus-saturn-jupiter-mars-mercury-2675586-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Five planets begin celestial lineup. You can see them with naked eyesThese events, often called \"planet parades\" or \"planetary alignments,\" though not exceedingly rare, are worth observing since they don't happen yearly. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/who-is-nikhil-saini-man-tests-paneer-in-bread-pakoda-quality-check-video-viral-2675774-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Nikhil Saini, the man who went viral for testing 'paneer' in bread pakodaNikhil Saini's video titled 'Bread Pakoda Quality Check' went viral on Instagram with over 18 million views and triggered widespread curiosity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/elon-musks-starlinks-are-crashing-120-satellites-fell-from-space-in-january-2025-2675649-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk's Starlinks are crashing every day, 120 fell in JanuaryStarlink is a satellite network developed by SpaceX to provide low-cost internet to remote locations. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/road-accident-jaipur-dudu-car-jumps-divider-after-tyre-burst-collides-with-bus-2675744-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "8 devotees on way to Kumbh killed as car jumps divider, crashes into bus in JaipurEight devotees heading to Kumbh Mela in Prayagraj were killed in Jaipur when their car lost control, jumped the divider, and collided with a bus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-injury-how-many-times-has-virat-kohli-missed-matches-due-to-injury-ind-vs-eng-2675684-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How often has Virat Kohli missed cricket matches due to injury concernsVirat Kohli injury: Star India batter Virat Kohli missed the first ODI against England due to a knee injury, making it a rare occasion in international cricket. Here's a look at the few instances when Kohli's injury forced him to miss matches: "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-vidaamuyarchi-full-movie-leaked-online-after-theatrical-release-2675798-2025-02-06",
      "headline": "Ajith Kumar's Vidaamuyarchi full movie leaked online hours after theatrical releaseVidaamuyarchi full movie leaked online: Hours after Vidaamuyarchi hit cinemas, the film was leaked online. The Tamil film stars Ajith Kumar and Trisha Krishnan in lead roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kinda-pregnant-review-amy-schumers-comedy-netflix-film-barely-delivers-2675690-2025-02-06",
      "headline": "Kinda Pregnant review: Amy Schumer's comedy film barely deliversReleased-Wed Feb 05, 2025Amy Schumer returns with Kinda Pregnant, a comedy that struggles to hit the mark. Despite its premise of friendship and motherhood, it fails to offer fresh laughs or insights."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/priyanka-chopra-flaunts-mehndi-dances-with-mannara-chopra-at-brother-siddharth-pre-wedding-2675795-2025-02-06",
      "headline": "Pics: Priyanka Chopra dances with Mannara at brother Siddharth's MehndiPriyanka Chopra joined in her brother, Siddharth Chopra's Mehndi celebration. The actor shared glimpses from the ceremony that took place last night, where she danced with cousin Mannara Chopra and also got Mehndi on her daughter, Malti's hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/srk-farah-han-reunion-main-hoon-na-part-2-scripting-in-progress-2675776-2025-02-06",
      "headline": "Shah Rukh Khan and Farah Khan to reunite for Main Hoon Na 2: ReportShah Rukh Khan and Farah Khan are reportedly set to collaborate once again for Main Hoon Na 2, with the film currently in development and the superstar having approved the project."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-nathan-lyon-150-wickets-asia-first-spinner-2675838-2025-02-06",
      "headline": "Nathan Lyon becomes first non-Asian bowler to take 150 wickets in AsiaSri Lanka vs Australia: Off-spinner Nathan Lyon completed 150 wickets in Asia after dismantling the Sri Lankan batting unit with three wickets on Day 1 of the 2nd Test in Galle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-first-odi-rohit-sharma-failure-trolled-nagpur-2675837-2025-02-06",
      "headline": "Please retire Rohit Sharma: Fans troll India captain after Nagpur ODI failureRohit Sharma was heavily trolled by fans on social media after his failure in the Nagpur ODI against England on Thursday, February 6. Rohit was dismissed for just 2 runs in the first ODI of the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-harshit-rana-debut-comeback-rohit-sharma-nagpur-2675788-2025-02-06",
      "headline": "How Rohit Sharma's advice helped Harshit Rana to bounce back in NagpurHarshit Rana revealed the advice he got from Rohit Sharma which helped him bounce back in the Nagpur ODI on Thursday, February 6. Harshit picked up 3 wickets in his ODI debut against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-ravindra-jadeja-600-huge-milestone-fifth-bowler-james-anderson-2675785-2025-02-06",
      "headline": "Ravindra Jadeja breaks James Anderson's record, completes 600 wickets for IndiaIndia vs England, 1st ODI: Ravindra Jadeja completed 600 wickets in international cricket on Thursday. He took three wickets against England in the series opener in Nagpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-odi-mohammed-shami-comeback-nagpur-2675771-2025-02-06",
      "headline": "Shami tidy on ODI comeback, gives India confidence ahead of Champions TrophyIndia pacer Mohammed Shami dismissed Brydon Carse in the first One-Day International (ODI) in Nagpur for his first wicket in the format in 445 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-rohit-sharma-yashasvi-jaiswal-inspiring-pep-talk-video-2675767-2025-02-06",
      "headline": "Watch: Rohit Sharma gives inspiring pep talk to debutant Yashasvi Jaiswal India vs England, 1st ODI: Captain Rohit Sharma spoke with the emotions of a doting mentor before he presented debutant Yashasvi Jaiswal his maiden one-day internationals cap in Nagpur on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-player-of-the-month-awards-varun-chakravarthy-gongadi-trisha-2675761-2025-02-06",
      "headline": "Varun Chakravarthy, Gongadi Trisha nominated for ICC Player Of The Month awardsVarun Chakravarthy and Gongadi Trisha were nominated for the ICC men's and women's Player Of The Month awards for their incredible performances in January. Varun impressed against England in T20Is while Trisha was the star of the show for India in their U-19 Women's T20 World Cup triumph. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-first-odi-virat-kohli-fitness-test-video-nagpur-2675726-2025-02-06",
      "headline": "Watch: Virat Kohli tries his best in fitness test before missing Nagpur ODIInd vs Eng: Virat Kohli was seen trying his best to prove his fitness before the start of the Nagpur ODI on Thursday, February 6. Kohli was forced to miss the match against England due to a knee injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-lahore-gaddafi-stadium-is-ready-for-champions-trophy-pakistan-board-2675720-2025-02-06",
      "headline": "Lahore's Gaddafi stadium is ready for Champions Trophy: Pakistan Cricket BoardChampions Trophy 2025: The Gaddafi Stadium in Lahore is now ready to host international cricket after undergoing extensive renovations for the Champions Trophy, the Pakistan Cricket Board declared on Thursday.\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-eng-yashasvi-jaiswal-takes-jaw-dropping-catch-on-odi-debut-to-dismiss-ben-duckett-2675712-2025-02-06",
      "headline": "Watch: Yashasvi Jaiswal's jaw-dropping catch on ODI debut to dismiss DuckettIndia batter Yashasvi Jaiswal took a breathtaking catch on his ODI debut to dismiss Ben Duckett during the first match against England in Nagpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-odi-joe-root-fails-ravindra-jadeja-nagpur-2675699-2025-02-06",
      "headline": "IND vs ENG: Joe Root fails on ODI return, outfoxed by Ravindra Jadeja for 19Joe Root failed on his return to the ODI team for England as he was dismissed for 19 runs in the match in Nagpur against India. Ravindra Jadeja was able to trap Root in front of the stumps as England continued to falter in the 1st ODI after a strong start. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-player-of-the-month-awards-varun-chakravarthy-gongadi-trisha-2675761-2025-02-06",
      "headline": "Varun Chakravarthy, Gongadi Trisha nominated for ICC Player Of The Month awardsVarun Chakravarthy and Gongadi Trisha were nominated for the ICC men's and women's Player Of The Month awards for their incredible performances in January. Varun impressed against England in T20Is while Trisha was the star of the show for India in their U-19 Women's T20 World Cup triumph. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-first-odi-virat-kohli-fitness-test-video-nagpur-2675726-2025-02-06",
      "headline": "Watch: Virat Kohli tries his best in fitness test before missing Nagpur ODIInd vs Eng: Virat Kohli was seen trying his best to prove his fitness before the start of the Nagpur ODI on Thursday, February 6. Kohli was forced to miss the match against England due to a knee injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-lahore-gaddafi-stadium-is-ready-for-champions-trophy-pakistan-board-2675720-2025-02-06",
      "headline": "Lahore's Gaddafi stadium is ready for Champions Trophy: Pakistan Cricket BoardChampions Trophy 2025: The Gaddafi Stadium in Lahore is now ready to host international cricket after undergoing extensive renovations for the Champions Trophy, the Pakistan Cricket Board declared on Thursday.\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-eng-yashasvi-jaiswal-takes-jaw-dropping-catch-on-odi-debut-to-dismiss-ben-duckett-2675712-2025-02-06",
      "headline": "Watch: Yashasvi Jaiswal's jaw-dropping catch on ODI debut to dismiss DuckettIndia batter Yashasvi Jaiswal took a breathtaking catch on his ODI debut to dismiss Ben Duckett during the first match against England in Nagpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-odi-joe-root-fails-ravindra-jadeja-nagpur-2675699-2025-02-06",
      "headline": "IND vs ENG: Joe Root fails on ODI return, outfoxed by Ravindra Jadeja for 19Joe Root failed on his return to the ODI team for England as he was dismissed for 19 runs in the match in Nagpur against India. Ravindra Jadeja was able to trap Root in front of the stumps as England continued to falter in the 1st ODI after a strong start. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-zim-vs-ire-johnathan-campbell-captaincy-test-debut-rare-list-2675692-2025-02-06",
      "headline": "Zimbabwe legend's son Johnathan Campbell captains on Test debut, joins rare clubZIM vs IRE, only Test: Son of legendary Zimbabwe opener Alistair Campbell, Johnathan, became only the sixth cricketer in the last 50 years to lead his team on debut in Test cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-injury-how-many-times-has-virat-kohli-missed-matches-due-to-injury-ind-vs-eng-2675684-2025-02-06",
      "headline": "How often has Virat Kohli missed cricket matches due to injury concernsVirat Kohli injury: Star India batter Virat Kohli missed the first ODI against England due to a knee injury, making it a rare occasion in international cricket. Here's a look at the few instances when Kohli's injury forced him to miss matches: "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-pat-cummins-out-injury-josh-hazlewood-australia-replacements-2675669-2025-02-06",
      "headline": "Pat Cummins, World Cup-winning Australia captain, ruled out of Champions Trophy Champions Trophy 2025: Australia will miss their World Cup-winning captain Pat Cummins in the marquee eight-team tournament. Australia confirmed Cummins was not able to recover in time from an ankle injury. Fast bowler Josh Hazlewood was also ruled out along with Marcus Stoinis and Mitchell Marsh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-rishabh-pant-kl-rahul-virat-kohli-india-vs-england-1st-odi-nagpur-2675647-2025-02-06",
      "headline": "IND vs ENG, 1st ODI: Rishabh Pant left out as KL Rahul gets nod as wicketkeeperIndia vs England ODI: India wicketkeeper batter Rishabh Pant failed to find a place in the Indian Playing XI for the first ODI against England as KL Rahul was preferred over him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-india-vs-england-virat-kohli-injury-first-odi-nagpur-rohit-sharma-2675636-2025-02-06",
      "headline": "Virat Kohli misses first ODI in Nagpur due to right knee problem, says Rohit SharmaIndia vs England, 1st ODI: Virat Kohli missed the first ODI in Nagpur due to a knee injury, confirmed captain Rohit Sharma at the toss. Yashasvi Jaiswal was handed a debut as the left-hander replaced the star batter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-harshit-rana-odi-debuts-india-vs-england-nagpur-2675632-2025-02-06",
      "headline": "Yashasvi Jaiswal and Harshit Rana handed ODI debuts in NagpurIndia vs England, 1st ODI: India handed maiden ODI caps to opener Yashasvi Jaiswal and fast bowler Harshit Rana before the toss in the first ODI in Nagpur on Thursday, February 6. Meanwhile, Virat Kohli will miss the first ODI due to a knee injury, captain Rohit Sharma confirmed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-rishabh-pant-kl-rahul-virat-kohli-india-vs-england-1st-odi-nagpur-2675647-2025-02-06",
      "headline": "IND vs ENG, 1st ODI: Rishabh Pant left out as KL Rahul gets nod as wicketkeeperIndia vs England ODI: India wicketkeeper batter Rishabh Pant failed to find a place in the Indian Playing XI for the first ODI against England as KL Rahul was preferred over him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-india-vs-england-virat-kohli-injury-first-odi-nagpur-rohit-sharma-2675636-2025-02-06",
      "headline": "Virat Kohli misses first ODI in Nagpur due to right knee problem, says Rohit SharmaIndia vs England, 1st ODI: Virat Kohli missed the first ODI in Nagpur due to a knee injury, confirmed captain Rohit Sharma at the toss. Yashasvi Jaiswal was handed a debut as the left-hander replaced the star batter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-harshit-rana-odi-debuts-india-vs-england-nagpur-2675632-2025-02-06",
      "headline": "Yashasvi Jaiswal and Harshit Rana handed ODI debuts in NagpurIndia vs England, 1st ODI: India handed maiden ODI caps to opener Yashasvi Jaiswal and fast bowler Harshit Rana before the toss in the first ODI in Nagpur on Thursday, February 6. Meanwhile, Virat Kohli will miss the first ODI due to a knee injury, captain Rohit Sharma confirmed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-odi-live-score-ind-eng-updates-virat-rohit-buttler-nagpur-2675595-2025-02-06",
      "headline": "1st ODI LIVE: Shreyas, Gill rattle England with aggressive partnershipIndia (IND) vs England (ENG) 1st ODI LIVE Updates: Yashasvi Jaiswal and Rohit Sharma have fallen in quick succession. Shreyas Iyer and Shubman Gill are at the crease and are dominating the chase with some fantastic stroke-making against both pacers and spinners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-marcus-stoinis-announces-retirement-from-odis-ahead-of-champions-trophy-2025-2675591-2025-02-06",
      "headline": "Marcus Stoinis announces retirement from ODIs ahead of Champions Trophy 2025Australia all-rounder Marcus Stoinis announced his retirement from ODIs ahead of Champions Trophy 2025. Stoinis' last appearance came in the series against Pakistan played in November 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-wicketkeeper-england-odis-kl-rahul-rishabh-pant-sanjay-bangar-2675583-2025-02-06",
      "headline": "Rahul should be India's first-choice wicketkeeper ahead of Pant: Sanjay BangarIndia vs England: Former India batting coach Sanjay Bangar has backed KL Rahul to be India's first-choice wicketkeeper in ODIs ahead of Rishabh Pant.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-shreyas-iyer-ind-vs-eng-india-vs-england-icc-champions-trophy-2025-2675580-2025-02-06",
      "headline": "Hungry Shreyas Iyer ready to pounce on England on India return after long gapIND vs ENG: Star India batter Shreyas Iyer reflected on his long gap from international cricket as he marks his comeback after six months in the upcoming series against England. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}