{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/sanjay-malhotra-appointed-as-new-rbi-governor-2647273-2024-12-09",
      "headline": "Sanjay Malhotra appointed as new RBI GovernorThe government on Monday appointed Revenue Secretary Sanjay Malhotra as the next Reserve Bank of India (RBI) Governor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanjay-malhotra-appointed-new-reserve-bank-of-india-governor-who-is-he-2647229-2024-12-09",
      "headline": "1990-batch IAS, IITian: Meet Sanjay Malhotra, newly-appointed RBI GovernorCurrently serving as the Revenue Secretary in the Ministry of Finance, Malhotra has over 33 years of diverse experience spanning finance, taxation, power, information technology, and mining."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/aditya-birla-group-set-to-invest-rs-50000-crore-in-rajasthan-says-kumar-mangalam-birla-2647172-2024-12-09",
      "headline": "Aditya Birla Group set to invest Rs 50,000 crore in Rajasthan: Kumar Mangalam BirlaAddressing the Rising Rajasthan Summit in the presence of Prime Minister Narendra Modi, Kumar Mangalam Birla said, \"Across our businesses, we are committed to significantly scaling up our investments. I foresee the Group investing over Rs 50,000 crore in the next few years.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/aditya-birla-group-to-invest-rs-50000-crore-in-rajasthan-kumar-mangalam-birla-2647184-2024-12-09",
      "headline": "Aditya Birla Group to invest Rs 50,000 crore in Rajasthan: Kumar Mangalam BirlaSpeaking at the Rising Rajasthan Summit in the presence of PM Narendra Modi, Kumar Mangalam Birla highlighted the state's potential driven by its mineral wealth, infrastructure, tourism, and renewable energy capacity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/revenue-secretary-sanjay-malhotra-appointed-new-rbi-governor-2647171-2024-12-09",
      "headline": "Sanjay Malhotra appointed new RBI Governor, to succeed Shaktikanta DasRevenue Secretary Sanjay Malhotra has been appointed as the new Reserve Bank of India Governor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-places-order-to-purchase-100-more-airbus-aircraft-2647167-2024-12-09",
      "headline": "Air India places order to purchase 100 more Airbus aircraftThis new purchase comes in addition to the 470 aircraft already ordered from Airbus and Boeing in 2023, boosting Air India's total Airbus orders this year to 350 aircraft."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-hikes-mclr-for-short-term-loans-what-borrowers-need-to-know-2647075-2024-12-09",
      "headline": "HDFC Bank hikes MCLR for short-term loans. What borrowers need to knowHDFC Bank raises MCLR for short-term loans by 5 bps, affecting borrowing costs and EMIs, while long-term rates remain unchanged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-as-fmcg-stocks-witness-decline-godrej-consumer-shares-down-9-percent-2647104-2024-12-09",
      "headline": "Sensex, Nifty end lower as FMCG stocks witness decline; Godrej Consumer down 9%The S&P BSE Sensex lost 200.66 points to close at 81,508.46, while the NSE Nifty50 was down 58.80 points to end at 24,619.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-announces-rs-75-lakh-crore-plan-to-boost-rajasthan-economy-karan-adani-2647053-2024-12-09",
      "headline": "Adani Group unveils Rs 7.5 lakh crore investment plan for RajasthanKaran Adani, Managing Director of Adani Ports & Special Economic Zone, made the announcement while addressing the Rising Rajasthan Global Investment Summit held in Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dabur-marico-godrej-consumer-why-major-fmcg-stocks-are-tumbling-today-2647051-2024-12-09",
      "headline": "Dabur, Marico, Godrej Consumer: Why major FMCG stocks are tumbling todayGodrej Consumer Products shares declined as much as 11% in early trade and was the top loser among all major FMCG companies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/banking-laws-amendment-bill-2024-four-nominees-in-bank-accounts-what-it-means-for-you-2647035-2024-12-09",
      "headline": "Banking Laws (Amendment) Bill 2024: What it means for youThe 2024 Banking Laws Amendment Bill allows multiple nominees, and grants banks more flexibility in auditor remuneration, fostering a more inclusive and efficient banking system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nisus-finance-services-ipo-allotment-check-status-latest-gmp-and-other-details-2647043-2024-12-09",
      "headline": "Nisus Finance Services IPO allotment: Check status, latest GMP and other details Investors can check the allotment status on the Bombay Stock Exchange (BSE) website or via the registrar, Skyline Financial Services. The company's shares are expected to list on the BSE SME platform on December 11, Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-ceat-shares-hit-rs-4000-brokerages-bet-big-on-camso-acquisition-2647017-2024-12-09",
      "headline": "Can CEAT shares hit Rs 4,000? Brokerages bet big on Camso acquisitionWith the stock rallying sharply by 12% today, market watchers are keenly assessing whether CEAT can sustain its momentum and inch closer to the coveted Rs 4,000 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-nhpc-share-price-rose-5-in-early-trade-today-2647007-2024-12-09",
      "headline": "Explained: Why NHPC share price rose 5% in early trade todayNHPC's share price rose nearly 5% in early trade on Monday, touching a day's high of Rs 88.82 on the Bombay Stock Exchange. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/assigned-two-uans-here-how-you-can-rectify-it-by-epfo-guideline-2642403-2024-12-09",
      "headline": "Assigned two UANs? Here's how you can rectify it Resolve the issue of being assigned two UANs by following these simple steps to consolidate your EPF details into a single account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/godrej-consumer-products-shares-falls-10-percent-today-brokerage-target-price-fmcg-stock-2646993-2024-12-09",
      "headline": "Godrej Consumer shares tank 10% today. Should you buy FMCG stock?Godrej Consumer recently flagged subdued demand in India's FMCG market, citing inflationary pressures and adverse weather conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-rishi-parti-man-who-bought-rs-190-crore-ultra-luxury-penthouse-in-gurugram-2646983-2024-12-09",
      "headline": "Rishi Parti: Man Behind Gurugram's Rs 190 Crore PenthouseA Rs 190 crore penthouse sale in Gurugram marks India's most expensive high-rise deal, cementing the city's elite property market status."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ceat-share-price-rises-11-percent-all-time-high-should-you-buy-brokerage-views-2646960-2024-12-09",
      "headline": " CEAT share price rises 11% to hit record high. Should you buy? CEAT shares reached an all-time high of Rs 3,466.40 during the day before settling slightly lower. The stock has rallied 28% since the start of the year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-rise-above-rs-1000-today-3-things-you-need-to-know-2646951-2024-12-09",
      "headline": "Paytm shares rise above Rs 1,000 today. 3 things you need to knowPaytm's share price crossed Rs 1,000 mark in early trade after rising 3% on the Bombay Stock Exchange. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-rise-3-percent-hit-52-week-high-rally-paypay-corporation-softbank-vision-fund-2-2646923-2024-12-09",
      "headline": "Paytm share price rose 3% to go past Rs 1,000. What's driving the rally?Paytm stocks: Paytm shares climbed 3.19% in early trade to reach Rs 1,007 on the Bombay Stock Exchange (BSE) in early trade. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangladesh-india-ties-foreign-secretary-vikram-misri-muhammad-yunus-2647357-2024-12-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India ties solid, Hasina's remarks raise tensions: Yunus to Foreign SecretaryDuring his meeting with Foreign Secretary Vikram Misri in Dhaka, Muhammad Yunus asked India to \"clear the clouds\", which \"cast a shadow\" over the ties between the two neighbours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/sm-krishna-former-karnataka-chief-minister-and-ex-external-affairs-minister-dies-at-92-2647415-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ex-Karnataka Chief Minister SM Krishna dies at 92SM Krishna, remembered for shaping Karnataka's growth and his influential role in Indian diplomacy, passed away at 92. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-elect-donald-trump-names-indian-american-lawyer-harmeet-k-dhillon-assistant-attorney-general-civil-rights-2647412-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump picks Chandigarh-born lawyer Harmeet Dhillon for top Justice Department jobHarmeet K Dhillon, born in Chandigarh in 1969, specialises in several key areas of law, including commercial litigation, employment law, First Amendment rights and election law."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russia-global-call-centre-cyber-fraud-scam-targeting-lakhs-of-people-including-indians-operatives-detained-2647408-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Russia thwarts global call centre scam targeting 1 lakh people, including IndiansAccording to Russia's FSB, the fake call centres, linked to former Georgian Defence Minister D Kazerashvili, who is currently based in London, were operated under the guise of investment schemes to defraud people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/who-is-luigi-mangione-unitedhealthcare-ceo-brian-thompsons-suspected-murderer-back-surgery-2647414-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Luigi Mangione: Ivy League graduate, now suspect in insurance chief's killingLuigi Mangione, 26, accused in UnitedHealthcare CEO's murder, faces scrutiny over strained ties to the medical industry, a pivotal back surgery, and his year-long disappearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-leader-kiren-rijiju-on-shashi-tharoor-old-post-about-friend-george-soros-cant-fool-india-2647376-2024-12-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can't fool India: BJP on Shashi Tharoor's old post about 'friend' George SorosKiren Rijiju shared an old tweet of Shashi Tharoor's, where the Congress MP referred to billionaire George Soros as an \"old friend\", to criticise him in light of recent BJP allegations linking Congress to Soros."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maha-vikas-aghadi-leader-of-opposition-maharashtra-elections-mva-congress-sena-ubt-ncp-sp-2647400-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rift in Maha Vikas Aghadi over Maharashtra Leader of Opposition post?The Shiv Sena (UBT), Congress and Sharad Pawar-led NCP, which collectively won 46 of 288 seats in last month's Maharashtra Assembly polls, are all eyeing the post of the Leader of Opposition, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/adani-fraud-case-us-panel-seeks-joint-hearing-of-case-along-with-former-azure-directors-bribery-probe-2647291-2024-12-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US market regulator seeks joint hearing of cases against Adani, ex-Azure DirectorThe application, filed by the SEC on December 5, seeks to treat the two cases as related, citing overlapping evidence and shared transactional links between the allegations in both matters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/video/mumbai-best-bus-veered-off-road-rams-auto-rickshaw-pedestrians-killed-injured-cctv-footage-2647375-2024-12-09?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Video: Moment Mumbai bus rams auto-rickshaw, veers off road before killing 3CCTV footage showed a BEST bus ramming an auto-rickshaw and veering towards the left side of the road in Mumbai's Kurla as onlookers rushed towards the accident spot on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-leader-in-global-business-education-2643394-2024-12-02?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Leader in Global Business EducationCombining top-ranked MSc programmes with practical knowledge for future corporate leaders.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/unitedhealthcare-ceo-brian-thompson-suspect-arrested-manifesto-insurance-companies-pennsylvania-2647406-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UnitedHealthcare CEO murder: Suspect arrested, manifesto slammed 'corporate America'Police said a fake New Jersey ID card, matching the one the suspect, Luigi Mangione, 26, had used to check into the New York City hotel before UnitedHealthcare CEO Brian Thompson's murder, was found in his possession."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-d-gukesh-vs-ding-liren-game-12-world-chess-championship-reactions-2647288-2024-12-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bad games happen: D Gukesh upbeat despite Ding Liren's strong comebackWorld Chess Championship: Indian Grandmaster D Gukesh conceded it was disappointing to lose to Ding Liren, a day after he took the lead in the 14-game match. Liren produced a dominant comeback to level the match at 6-6 on Monday in Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-raghav-chadha-criticism-lavish-wedding-cost-2647122-2024-12-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Parineeti Chopra on criticism over lavish wedding: If I married an actor, people…Parineeti Chopra and Raghav Chadha dismissed rumours about their wedding expenses, attributing criticism to public perception and double standards. Parineeti called out the scrutiny of her finances post-marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/aditya-birla-group-set-to-invest-rs-50000-crore-in-rajasthan-says-kumar-mangalam-birla-2647172-2024-12-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Aditya Birla Group set to invest Rs 50,000 crore in Rajasthan: Kumar Mangalam BirlaAddressing the Rising Rajasthan Summit in the presence of Prime Minister Narendra Modi, Kumar Mangalam Birla said, \"Across our businesses, we are committed to significantly scaling up our investments. I foresee the Group investing over Rs 50,000 crore in the next few years.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-best-bus-accident-kurla-andheri-dead-injured-2647360-2024-12-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "3 dead in Mumbai as bus hits pedestrians and vehicles, brake failure suspectedThe bus, which was travelling from Kurla to Andheri, lost control in the Ambedkar Nagar area and ran over several pedestrians and hit vehicles. Three people died and 20 were injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chhattisgarh-400-vehicles-meant-for-emergency-aid-lie-in-dust-as-bjp-congress-trade-blame-2647312-2024-12-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "400 vehicles meant for emergency aid lie in dust as BJP, Congress trade blameAcquired by the Congress-led government for Rs 40 crore, these vehicles were intended to expand emergency response coverage to 33 of 34 district in Chhattisgarh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-pakistan-india-alternative-onion-potato-imports-violence-hindu-atrocities-2647407-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bangladesh eyes Pak over India as alternative for onion, potato imports: ReportBangladesh is seeking to get potato and onion imports from Pakistan over India in a move to reduce reliance on New Delhi, its traditional partner. Rising prices in the Indian market have reportedly prompted the search for new suppliers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/fired-yesmadam-employee-reacts-amid-backlash-over-startup-decision-2647219-2024-12-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fired YesMadam employee reacts amid backlash over startup's decisionA YesMadam employee claimed she was among those fired after an email revealed the company let go of staff who admitted feeling stressed in a survey it conducted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manipur-violence-update-mobile-internet-services-districts-restored-imphal-valley-2647402-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mobile internet services back in 9 violence-hit Manipur districts after 23 daysThe decision to restore mobile internet services came after a comprehensive review of the prevailing law and order situation in Imphal West, Imphal East, Bishnupur, Thoubal, Kakching, Jiribam, Churachandpur, Kangpokpi and Pherzawl districts in Manipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/syria-civil-war-update-bashar-al-assad-flees-moscow-pm-mohammed-jalali-power-rebels-2647411-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After Syria's Assad flees to Russia, his PM agrees to hand power to rebelsMohammed Jalali, who served as Syrian Prime Minister to ousted President Bashar al-Assad, said he agreed to hand power to the rebel-led Salvation Government after opposition forces captured Damascus and forced Assad to flee to Moscow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/payal-kapadia-all-we-imagine-as-light-2-nominations-golden-globes-2025-2647239-2024-12-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Golden Globes 2025: Payal Kapadia's All We Imagine As Light gets 2 nominationsPayal Kapadia's All We Imagine As Light bagged two nominations in Golden Globe Awards 2025, including Best Director (Motion Picture) and Best Non-English Language Motion Picture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/one-nation-one-election-bill-to-be-tabled-present-next-parliament-session-2647183-2024-12-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "One Nation One Election bill likely in this Parliament session: SourcesThe bill, aimed at synchronising elections for the Lok Sabha and state assemblies, has received cabinet approval based on the recommendations of the former President Ram Nath Kovind-led committee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/vladimir-putin-nuclear-weapons-threat-nagasaki-survivor-atomic-bomb-nobel-peace-prize-ceremony-2647394-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Putin not aware of nuke weapons' threat: Nagasaki survivor before Nobel ceremonyTerumi Tanaka, a 92-year-old survivor of the atomic bombing of Nagasaki, asserted that Russian President Vladimir Putin doesn't \"truly understand what nuclear weapons are for human beings\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/pawan-kalyan-andhra-pradesh-deputy-chief-minister-death-threat-call-residence-2647289-2024-12-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pawan Kalyan gets death threat call at residence, probe launchedPolice have been informed about the call and an investigation has been launched into the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/payal-kapadia-on-golden-globes-nomination-for-all-we-imagine-as-light-deeply-honoured-2647296-2024-12-09",
      "headline": "Payal Kapadia on Golden Globes nomination for All We Imagine...: Deeply honouredDirector Payal Kapadia is 'deeply honoured' as her film All We Imagine As Light bagged two nominations for the 2025 Golden Globes, including Best Director (Motion Picture) and Best Non-English Language Motion Picture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/khushi-kapoor-anurag-kashyap-opt-for-sequins-at-aaliyah-kashyap-shane-gregoires-cocktail-bash-2647293-2024-12-09",
      "headline": "Khushi, Anurag Kashyap opt for sequins at Aaliyah-Shane's cocktail bashAaliyah Kashyap-Shane Gregoire's cocktail bash is being held today in Mumbai. The couple's friends, like Khushi Kapoor, were present, along with celebrities like Imtiaz Ali and Vikramaditya Motwane, who are close to Anurag Kashyap."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/taylor-swifts-eras-tour-ends-its-historic-run-after-two-years-2647290-2024-12-09",
      "headline": "Taylor Swift's Eras Tour ends its historic run after two yearsTaylor Swift's Eras Tour, a massive cultural and economic success, is set to conclude in Vancouver on December 15, after captivating audiences worldwide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/katrina-kaif-posts-photos-with-dil-jaan-vicky-kaushal-on-3rd-anniversary-2647278-2024-12-09",
      "headline": "Katrina Kaif posts photos with 'dil, jaan' Vicky Kaushal on 3rd anniversaryKatrina Kaif and Vicky Kaushal celebrated their third wedding anniversary with a heartfelt Instagram post. The couple shared a joyful picture, marking their special milestone with love and warmth."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-city-premier-league-breach-charges-case-concludes-verdict-awaited-2647390-2024-12-09",
      "headline": "City vs Premier League case concludes as verdict awaited on 115 chargesManchester City's hearing on 115 Premier League rule breaches concluded, with a verdict not expected until 2025. The independent panel's decision could significantly impact City, with potential penalties including relegation or other severe sanctions looming over the reigning champions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aryna-sabalenka-crowned-wta-player-of-the-year-2024-2647388-2024-12-09",
      "headline": "Aryna Sabalenka crowned WTA Player of the Year 2024Aryna Sabalenka has been named the WTA Player of the Year 2024, capping off a stellar season highlighted by two Grand Slam titles and her ascent to World No. 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifpro-world-eleven-erling-haaland-mpabbe-vinicius-jr-lamine-yamal-snubbed-no-messi-2647373-2024-12-09",
      "headline": "Haaland-Mbappe-Vinicius, but no Lamine Yamal: FIFPRO announce their World 11The FIFAPro World XI for 2024 celebrated football's elite but ignited debate over surprising omissions like Lamine Yamal, Federico Valverde, and Cole Palmer, while inclusions like Kevin De Bruyne raised questions about prioritising legacy over current performance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/rohit-sharma-blunders-india-loss-pink-ball-test-vs-australia-sledging-room-podcast-video-2647372-2024-12-09",
      "headline": "Rohit Sharma's blunders and India's limp loss in pink-ball Test vs Australia Not many expected India to suffer a limp loss like they did in the second Test of the Border-Gavaskar Trophy. After hammering Australia by 295 runs in Perth under Jasprit Bumrah's captaincy, India were humbled by 10 wickets in Adelaide. India conceded the momentum after a one-sided defeat in the pink-ball Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jonathan-trott-to-continue-as-afghanistan-coach-for-2025-2647362-2024-12-09",
      "headline": "Jonathan Trott to continue as Afghanistan coach for 2025The Afghanistan Cricket Board (ACB) has confirmed the extension of Jonathan Trott's contract as the head coach of the national cricket team through 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/david-coote-referee-premier-league-sacked-disciplinary-investigation-2647355-2024-12-09",
      "headline": "Premier League referee David Coote sacked after disciplinary investigationDavid Coote's Premier League refereeing career ended abruptly after PGMOL sacked him for breaching professional conduct following investigations into his Liverpool comments and alleged substance use, signalling a strong stance on maintaining integrity within English football officiating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sanath-jayasuriya-rues-slipped-chances-sri-lanka-lose-gqeberha-test-vs-sa-2647330-2024-12-09",
      "headline": "Sanath Jayasuriya rues slipped chances after Sri Lanka lose Gqeberha Test vs SASri Lanka head coach Sanath Jayasuriya rued his team's failure to seize crucial moments during their 109-run loss to South Africa in the second Test at St. George's Park, Gqeberha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/dcs-new-recruit-vipraj-takes-up-to-syed-mushtaq-ali-t20-trophy-quarters-2647297-2024-12-09",
      "headline": "DC's new recruit Vipraj takes UP to Syed Mushtaq Ali T20 Trophy quartersRinku Singh remained composed, but the lesser-known Vipraj Nigam stole the spotlight as both players showcased superb finishing skills to lead Uttar Pradesh into the quarter-finals of the Syed Mushtaq Ali T20 Trophy. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/lewis-hamilton-ferrari-season-starts-when-mercedes-last-race-abu-dhabi-grand-prix-2647294-2024-12-09",
      "headline": "When Lewis Hamilton will start his chapter with Ferrari in Formula 1Lewis Hamilton bid an emotional farewell to Mercedes, marking the end of an unparalleled 12-year partnership as fans eagerly awaited his transition to Ferrari in 2025, a move that could redefine his legacy in Formula 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-d-gukesh-vs-ding-liren-game-12-world-chess-championship-reactions-2647288-2024-12-09",
      "headline": "Bad games happen: D Gukesh upbeat despite Ding Liren's strong comebackWorld Chess Championship: Indian Grandmaster D Gukesh conceded it was disappointing to lose to Ding Liren, a day after he took the lead in the 14-game match. Liren produced a dominant comeback to level the match at 6-6 on Monday in Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/alisson-becker-liverpool-returns-training-long-injury-absence-diogo-jota-arne-slot-2647277-2024-12-09",
      "headline": "Premier League: Alisson back in Liverpool training after almost two monthsLiverpool received a timely morale boost as Alisson Becker and Diogo Jota returned to training, enhancing their prospects for the UEFA Champions League clash against Girona. Alisson's fitness and Jota's availability added much-needed depth to Arne Slot's squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sanath-jayasuriya-rues-slipped-chances-sri-lanka-lose-gqeberha-test-vs-sa-2647330-2024-12-09",
      "headline": "Sanath Jayasuriya rues slipped chances after Sri Lanka lose Gqeberha Test vs SASri Lanka head coach Sanath Jayasuriya rued his team's failure to seize crucial moments during their 109-run loss to South Africa in the second Test at St. George's Park, Gqeberha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/dcs-new-recruit-vipraj-takes-up-to-syed-mushtaq-ali-t20-trophy-quarters-2647297-2024-12-09",
      "headline": "DC's new recruit Vipraj takes UP to Syed Mushtaq Ali T20 Trophy quartersRinku Singh remained composed, but the lesser-known Vipraj Nigam stole the spotlight as both players showcased superb finishing skills to lead Uttar Pradesh into the quarter-finals of the Syed Mushtaq Ali T20 Trophy. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/lewis-hamilton-ferrari-season-starts-when-mercedes-last-race-abu-dhabi-grand-prix-2647294-2024-12-09",
      "headline": "When Lewis Hamilton will start his chapter with Ferrari in Formula 1Lewis Hamilton bid an emotional farewell to Mercedes, marking the end of an unparalleled 12-year partnership as fans eagerly awaited his transition to Ferrari in 2025, a move that could redefine his legacy in Formula 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-d-gukesh-vs-ding-liren-game-12-world-chess-championship-reactions-2647288-2024-12-09",
      "headline": "Bad games happen: D Gukesh upbeat despite Ding Liren's strong comebackWorld Chess Championship: Indian Grandmaster D Gukesh conceded it was disappointing to lose to Ding Liren, a day after he took the lead in the 14-game match. Liren produced a dominant comeback to level the match at 6-6 on Monday in Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/alisson-becker-liverpool-returns-training-long-injury-absence-diogo-jota-arne-slot-2647277-2024-12-09",
      "headline": "Premier League: Alisson back in Liverpool training after almost two monthsLiverpool received a timely morale boost as Alisson Becker and Diogo Jota returned to training, enhancing their prospects for the UEFA Champions League clash against Girona. Alisson's fitness and Jota's availability added much-needed depth to Arne Slot's squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-harry-brook-is-the-best-player-in-the-world-joe-root-2647259-2024-12-09",
      "headline": "Harry Brook is the best player in the world: Joe Root England star Joe Root reckons Harry Brook is by far and away the best player in the world. Root, 33, currently holds the top spot in the ICC rankings for batters, with Brook just one place below him.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-rohit-sharma-kapil-dev-pressure-captaincy-adelaide-2647238-2024-12-09",
      "headline": "Don't doubt Rohit Sharma's captaincy, his ability to bounce back: Kapil DevAustralia vs India: Legendary Kapil Dev said he is confident of Rohit Sharma's ability to bounce back from setbacks. Rohit is under considerable pressure after India lost the second Test in Adelaide by 10 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-d-gukesh-loses-lead-after-stunning-comeback-from-ding-liren-in-game-12-2647214-2024-12-09",
      "headline": "Gukesh loses lead after stunning comeback from Liren in Game 12World Chess Championship: Indian challenger D. Gukesh suffered a setback in the 12th game of the World Chess Championship, losing to defending champion Ding Liren of China. The victory allowed Ding to bounce back and level the match at six points apiece on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-curran-zimbabwe-maiden-call-up-afghanistan-odi-series-fifth-family-member-sam-curran-2647209-2024-12-09",
      "headline": "Ben Curran, brother of Sam and Tom Curran, earns maiden Zimbabwe call-upBen Curran's maiden Zimbabwe call-up continues the Curran family's remarkable cricketing legacy, following in the footsteps of his father and aligning with the stellar contributions of his brothers representing England. His domestic form has earned him this monumental opportunity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-wanna-win-champions-league-with-real-madrid-rough-start-laliga-2647177-2024-12-09",
      "headline": "Mbappe promises to get over rough Real Madrid start: Wanna win the UCLKylian Mbappé reflected on his slow start at Real Madrid but reaffirmed his commitment to overcoming challenges and achieving his dream of UEFA Champions League glory with Los Blancos in the crucial months ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-should-rohit-sharma-open-brisbane-test-dodda-ganesh-2647175-2024-12-09",
      "headline": "Rohit will be like lamb to slaughterhouse if he opens at Gabba: Ex-India pacerAustralia vs India: Former Indian pacer Dodda Ganesh feels captain Rohit Sharma should not open the batting for India in the third Test at the Gabba, likening the move to sending \"a lamb to the slaughterhouse.\" \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-vinod-kambli-needs-to-help-himself-go-back-to-rehab-kapil-dev-2647163-2024-12-09",
      "headline": "Vinod Kambli needs to help himself, go back to rehab: Kapil DevIndia's legendary 1983 World Cup-winning captain, Kapil Dev, has expressed his readiness to support former cricketer Vinod Kambli but stressed that the Mumbai star must first take the initiative to address his struggles.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-sri-lanka-temba-bavuma-not-taking-win-granted-world-test-championship-2647156-2024-12-09",
      "headline": "South Africa top WTC Table: Temba Bavuma not taking things for grantedSouth Africa triumphed in a decisive series win over Sri Lanka, topping the World Test Championship table and inching closer to a Lord's final berth. Temba Bavuma hailed the victory but urged his team to remain focused for their upcoming Test series against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-wanna-win-champions-league-with-real-madrid-rough-start-laliga-2647177-2024-12-09",
      "headline": "Mbappe promises to get over rough Real Madrid start: Wanna win the UCLKylian Mbappé reflected on his slow start at Real Madrid but reaffirmed his commitment to overcoming challenges and achieving his dream of UEFA Champions League glory with Los Blancos in the crucial months ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-should-rohit-sharma-open-brisbane-test-dodda-ganesh-2647175-2024-12-09",
      "headline": "Rohit will be like lamb to slaughterhouse if he opens at Gabba: Ex-India pacerAustralia vs India: Former Indian pacer Dodda Ganesh feels captain Rohit Sharma should not open the batting for India in the third Test at the Gabba, likening the move to sending \"a lamb to the slaughterhouse.\" \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-vinod-kambli-needs-to-help-himself-go-back-to-rehab-kapil-dev-2647163-2024-12-09",
      "headline": "Vinod Kambli needs to help himself, go back to rehab: Kapil DevIndia's legendary 1983 World Cup-winning captain, Kapil Dev, has expressed his readiness to support former cricketer Vinod Kambli but stressed that the Mumbai star must first take the initiative to address his struggles.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-sri-lanka-temba-bavuma-not-taking-win-granted-world-test-championship-2647156-2024-12-09",
      "headline": "South Africa top WTC Table: Temba Bavuma not taking things for grantedSouth Africa triumphed in a decisive series win over Sri Lanka, topping the World Test Championship table and inching closer to a Lord's final berth. Temba Bavuma hailed the victory but urged his team to remain focused for their upcoming Test series against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-mohammed-siraj-travis-head-icc-penalises-send-off-adelaide-2647154-2024-12-09",
      "headline": "Siraj fined 20 percent of his match fee, Head penalised for Adelaide spatBorder-Gavaskar Trophy, Australia vs India: Fast bowler Mohammed Siraj was fined 20 percent of his match fee for his on-field spat with Travis Head. While Head was also sanctioned, both players escaped suspension. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-david-wanrner-not-impressed-marnus-labuschagne-adelaide-test-2647110-2024-12-09",
      "headline": "AUS vs IND: Warner 'not convinced' with Labuschagne despite Adelaide 64David Warner critiqued Marnus Labuschagne's inconsistent performances in the Border-Gavaskar Trophy, despite his half-century in Adelaide. The former opener praised Steve Smith and Usman Khawaja's resilience, setting high expectations for Labuschagne ahead of the crucial Gabba Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sa-vs-sl-2nd-test-series-win-wtc-final-temba-bavuma-keshav-maharaj-2647092-2024-12-09",
      "headline": "Temba Bavuma inspires 2-0 sweep as South Africa close in on WTC finalSouth Africa vs Sri Lanka, 2nd Test: Keshav Maharaj spun a web around the Sri Lankan batters as South Africa successfully defended a 348-run target to win the 2nd Test and complete a 2-0 win. Temba Bavuma led from the front scoring a hundred and three fifties in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-updated-wtc-points-table-south-africa-vs-sri-lanka-india-final-chances-australia-2647082-2024-12-09",
      "headline": "WTC Points Table: South Africa go top with 2-0 win, Australia, India followWorld Test Championship Points Table: Temba Bavuma's South Africa climbed up to the top of the points table after their 2-0 cleansweep against Sri Lanka. Australia and India follow at 2 and 3 respectively.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}