{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sudeep-pharma-shares-rise-nearly-29-percent-over-ipo-price-what-should-investors-do-2827446-2025-11-28",
      "headline": "Sudeep Pharma shares rise nearly 29% over IPO price. What should investors do?Sudeep Pharma's strong debut has impressed investors, but with valuations now stretched, is this the right moment to book profits or should investors stay put and ride the long-term story?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-ipo-price-band-gmp-company-details-all-you-need-to-know-2827438-2025-11-28",
      "headline": "From GMP to price band: 5 things to know about Meesho IPOThe SoftBank-backed e-commerce platform has set a price band of Rs 105 to Rs 111 per share, valuing the company at nearly Rs 50,100 crore at the upper end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-your-pension-stop-after-november-30-check-now-2827427-2025-11-28",
      "headline": "Will your pension stop after November 30? Check nowThe deadline to submit the annual Life Certificate is almost here, and missing it could put your pension on hold. Pensioners must complete the process by 30 November to avoid any interruption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-labour-codes-benefits-challenges-payroll-impact-take-home-pay-2827422-2025-11-28",
      "headline": "New labour codes bring major employee benefits, but what are the big challenges?The new labour codes promise stronger protection and wider benefits for workers, but the real test begins now as businesses brace for higher costs, major restructuring and a challenging transition across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-is-tax-department-sending-sms-alerts-to-25000-taxpayers-about-foreign-assets-2827404-2025-11-28",
      "headline": "Why is tax department sending SMS alerts to 25,000 taxpayers about foreign assets?Tax officials examined data received from foreign jurisdictions through the Automatic Exchange of Information (AEOI) system. This international framework allows countries to share details of financial accounts held abroad by their residents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-ipo-opening-december-3-price-band-gmp-listing-expectations-2827389-2025-11-28",
      "headline": "Meesho IPO opening on December 3: What investors need to knowMeesho IPO is all set to open for subscription, backed by strong GMP cues and rising investor interest, but can the value-commerce giant turn pre-listing hype into sustained market performance? Here is all you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-your-money-lying-unclaimed-here-is-how-delhis-new-campaign-help-you-recover-it-2827382-2025-11-28",
      "headline": "Is your money lying unclaimed? Here's how Delhi's new campaign help you recover itThe move is part of the Centre's ongoing 'Apki Punji, Apka Adhikar' campaign, which focuses on returning such funds to their rightful owners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sudeep-pharma-share-price-strong-ipo-listing-hold-sell-book-profit-2827376-2025-11-28",
      "headline": "Sudeep Pharma makes strong market debut. Hold or book profit now?A blockbuster debut has rewarded Sudeep Pharma IPO investors. Should you cash out while sentiment is high or hold on for the company's expansion and export growth story?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sudeep-pharma-ipo-listing-23-percent-premium-in-strong-stock-market-debut-2827332-2025-11-28",
      "headline": "Sudeep Pharma shares list at 23% premium in strong market debutThe Rs 895-crore issue, which was subscribed an extraordinary 93.71 times between November 21 and 25, opened at Rs 730 on the NSE and Rs 725 on the BSE, against the upper-end IPO price of Rs 593. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gail-share-price-today-pipeline-tariff-hike-impact-psu-stock-falls-2827323-2025-11-28",
      "headline": "GAIL share price tumbles 6%. Here's why the PSU stock is falling todayThe slump in GAIL's share price reflects investor disappointment over a tariff hike that landed far below expectations. With a full review pushed to 2028, the market is recalibrating its outlook on earnings support for the PSU major."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-pause-record-highs-2827304-2025-11-28",
      "headline": "Sensex, Nifty take breather after hitting record highsThe S&P BSE Sensex was up 65.92 points at 85,786.30 around 9:22 am, while the NSE Nifty50 slipped 16.65 points to 26,232.20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-zerodha-founder-and-ceo-nithin-kamath-says-crypto-derivatives-need-urgent-regulation-2827073-2025-11-27",
      "headline": "Why Zerodha's Nithin Kamath says crypto derivatives need urgent regulationKamath described the current state of crypto derivative exchanges as \"a bit like Schrödinger's cat — neither fully regulated nor unregulated.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-refund-still-pending-here-is-how-to-check-your-status-using-pan-2826992-2025-11-27",
      "headline": "ITR refund still pending? Here's how to check your status using PANIf your ITR refund for FY24–25 hasn't arrived yet, you're not alone. Many taxpayers are seeing longer delays this year. The good news: you can quickly check your refund status online using just your PAN."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-codes-5-key-benefits-you-must-know-2826962-2025-11-27",
      "headline": "New labour codes: 5 key benefits you must knowWith the new labour codes, gig and platform workers are now officially recognised, giving them entry into an organised safety net that includes insurance, PF benefits and pension provisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-nifty-sensex-record-high-2026-outlook-explained-2826943-2025-11-27",
      "headline": "Markets at record high: Is a bigger bull run coming in 2026?After 14 months of waiting, domestic markets have finally broken past their earlier ceilings. Strong flows, better earnings and a powerful technical breakout now raise a bigger question about whether 2026 becomes the real breakout year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-all-time-high-gdp-data-friday-financial-shares-rise-2826938-2025-11-27",
      "headline": "Sensex, Nifty touch all-time highs before cooling off, investors await GDP dataThe S&P BSE Sensex added 110.87 points to end at 85,720.38, while the NSE Nifty50 gained 10.25 points to close at 26,215.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/flexible-work-places-why-corporates-are-preferring-over-permanent-office-commercial-real-estate-2826911-2025-11-27",
      "headline": "Why more companies are choosing flexible offices over owning spaceCorporations are now intentionally reallocating portions of their real estate portfolios into flexible and fully serviced workspaces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-wedding-insurance-is-becoming-the-next-big-trend-in-india-2826875-2025-11-27",
      "headline": "Why wedding insurance is becoming the next big trend in IndiaIndian weddings are getting grander, costlier and far more unpredictable. As families pour months of planning and significant savings into these celebrations, a single last-minute disruption can derail everything. This rising uncertainty is quietly driving a new trend—wedding insurance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/crypto-futures-and-options-trade-hidden-tax-trap-young-investors-2826869-2025-11-27",
      "headline": "From crypto to F&O: The hidden tax trap young investors keep missingYoung investors are trading faster than ever, but many overlook how crypto and F&O profits are taxed. Strict rules, tougher scrutiny and poor record-keeping are turning quick gains into unexpected tax headaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/psu-bank-merger-government-plan-finance-minister-nirmala-sitharaman-employee-problems-salary-promotion-hr-2826868-2025-11-27",
      "headline": "PSU bank mergers: Do bigger banks mean happier employees?India's tryst with PSB (public sector bank) consolidation dates back more than three decades. The first post-nationalisation merger took place in 1993, when Punjab National Bank (PNB) absorbed the New Bank of India. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-details-7-year-effort-to-restore-crime-thriller-shiva-at-iffi-goa-2025-2827400-2025-11-28",
      "headline": "Nagarjuna details 7-year effort to restore crime-thriller Shiva at IFFI Goa 2025 Nagarjuna and the Annapurna Studios team detailed the seven-year odyssey of restoring the crime-thriller 'Shiva' for 4K release, including the miracle of retrieving missing audio from prints stored by passionate exhibitors across Telugu states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-recalls-making-dharmendra-watch-lahore-1947-says-he-loved-the-script-2827426-2025-11-28",
      "headline": "Aamir Khan says Dharmendra watched Sunny Deol's Lahore 1947, loved script Aamir Khan recalled his recent meetings with Dharmendra, including sharing Lahore 1947 with the late actor. He also spoke about their connection at the International Film Festival of India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-emotional-poem-ikkis-an-ode-to-his-beloved-pind-village-watch-jaideep-ahlawat-2827396-2025-11-28",
      "headline": "Dharmendra's emotional poem in Ikkis is an ode to his beloved pind. Watch Makers of Ikkis released a video featuring a special poem recited by veteran actor Dharmendra. The clip is a special tribute to the veteran actor who died on November 24.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/gustaakh-ishq-movie-review-naseeruddin-shah-vijay-varma-fatima-sana-shaikh-old-school-romance-is-too-sweet-for-taste-2827390-2025-11-28",
      "headline": "Gustaakh Ishq review: Naseeruddin Shah anchors love that grows too sugary too soonRelease Date:Fri Nov 28, 2025 Gustaakh Ishq depends heavily on old-school romance, offering a world drenched in nostalgia and slow-brewing affection. Naseeruddin Shah delivers a towering performance that lifts the film every time he appears on-screen. But this is too much sweetness, even for lovers of love story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-sidharth-malhotra-introduce-daughter-saraayah-2827368-2025-11-28",
      "headline": "Kiara Advani-Sidharth Malhotra share first pic of daughter, reveal her name Kiara Advani and Sidharth Malhotra have shared the first photo of their daughter and revealed her name. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/revolver-rita-review-keerthy-suresh-black-comedy-lacks-novelty-impact-2827325-2025-11-28",
      "headline": "Revolver Rita review: Keerthy Suresh's black comedy falls flatRelease Date:Fri Nov 28, 2025 Revolver Rita movie review: Directed by JK Chandru, Revolver Rita, starring Keerthy Suresh, Radhika Sarathkumar, and Sunil, is pegged as a black comedy revolving around a crime. The film is neither dark nor funny, just flat as discarded cardboard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-deepika-padukone-next-ayan-mukerji-based-on-raj-kapoor-nargis-chori-chori-sources-2827340-2025-11-28",
      "headline": "Ranbir-Deepika's next to be based on Raj Kapoor-Nargis' Chori Chori: Sources Deepika Padukone and Ranbir Kapoor fans will rejoice as the two actors are set to reunite after a decade for Aya Mukerji's next project. India Today has exclusively learnt that the film is loosely adapted from Raj Kapoor and Nargis's 1956 classic Chori Chori."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hema-malini-posts-family-pics-of-dharmendra-in-new-emotional-tribute-on-instagram-2827329-2025-11-28",
      "headline": "Hema Malini posts family pics of Dharmendra in new emotional tribute on Instagram Hema Malini posted rare family moments with late husband Dharmendra. The photos featured Dharmendra with Hema, and their daughters Ahana and Esha Deol.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ashlesha-savant-sandeep-baswana-marry-after-23-years-spiritual-bond-vrindavan-wedding-2827322-2025-11-28",
      "headline": "Ashlesha-Sandeep on getting married after 23 years: Happened when it was meant to Actors Ashlesha Savant and Sandeep Baswana got married after 23 years of companionship. In a conversation with India Today, the couple opened up about their intimate wedding in Vrindavan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kevin-spacey-faces-three-civil-sexual-assault-lawsuits-london-trial-october-2026-2827303-2025-11-28",
      "headline": "Actor Kevin Spacey sued again, three new sexual assault cases head to UK court Three men have brought separate civil claims of sexual assault against Kevin Spacey in London, covering incidents alleged to have taken place between 2000 and 2013. The Oscar-winning actor has denied two of the new claims, with a trial date provisionally set for October 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/eternity-review-rom-com-love-choices-afterlife-elizabeth-olsen-2827300-2025-11-28",
      "headline": "Eternity review: A tender, tidy rom-com with its heart in the right afterlifeRelease Date:Fri Nov 28, 2025 Eternity movie review: Eternity is a rom-com set in a whimsical afterlife where an elderly woman chooses her eternity. The film explores love, memory, and the difficult decisions that shape life without villainising any character, says our review."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-personality-rights-protection-delhi-high-court-interim-order-ai-deepfake-misuse-aishwarya-rai-karan-johar-2827276-2025-11-28",
      "headline": "Delhi High Court backs Ajay Devgn's personality rights, orders deepfake takedown The Delhi High Court has granted interim relief to actor Ajay Devgn, restraining unauthorised use of his personality traits and ordering removal of obscene content, following allegations of misuse through commercial merchandise and artificial intelligence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-reveals-friend-sasidharan-origin-famous-name-manorama-event-2827282-2025-11-28",
      "headline": "How Mohammed Kutty became Mammootty? Actor introduces friend who named him At a recent event in Kerala, Mammootty publicly introduced his friend Sashidharan as the person who gave him the name that made him a household figure, clarifying longstanding speculation about the origin of his stage name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/delhi-cm-rekha-gupta-grants-tax-free-status-to-farhan-akhtar-120-bahadur-2827262-2025-11-28",
      "headline": "Delhi Chief Minister grants tax-free status to Farhan Akhtar's 120 Bahadur Delhi CM Rekha Gupta announced a tax exemption for the film 120 Bahadur, which honours the bravery of Charlie Company during the 1962 Sino-Indian War. She also praised the actors for their portrayal of Major Shaitan Singh Bhati and his regiment's sacrifice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-honoured-iffi-2025-closing-ceremony-goa-50-years-indian-cinema-2827257-2025-11-28",
      "headline": "Rajinikanth arrives in Goa to accept IFFI honour on completing 50 years in cinema Superstar Rajinikanth reached Goa ahead of the 56th International Film Festival of India closing event, where he will be recognised for five decades of contribution to the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/taylor-swift-hugh-jackman-saw-ryan-reynolds-slam-justin-baldoni-for-fat-shaming-blake-lively-reports-2827244-2025-11-28",
      "headline": "Taylor Swift saw Ryan Reynolds slam Justin Baldoni for fat-shaming Lively: Reports A meeting at Ryan Reynolds and Blake Lively's New York penthouse in April 2023 saw tensions rise between the former and Justin Baldoni over concerns about comments on Lively's weight. Taylor Swift and Hugh Jackman were also present, according to court documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/avihitham-womens-agency-village-moral-policing-malayalam-film-2826939-2025-11-28",
      "headline": "The invisible women of Avihitham: How a film on men is all about women's agency Avihitham is a Malayalam film that explores women's agency through a male-centric narrative. It critiques patriarchal voyeurism and highlights the social double standards faced by women in rural communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/millie-bobby-brown-updates-on-her-bond-with-stranger-things-co-star-david-harbour-2827241-2025-11-28",
      "headline": "Millie Bobby Brown updates on her bond with Stranger Things co-star David Harbour Millie Bobby Brown has spoken about her relationship with David Harbour after reports of a 'harassment and bullying claim' surfaced. The pair addressed feud rumours, appearing together at the Season 5 premiere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/regai-tamil-crime-series-zee5-whodunnit-review-2827159-2025-11-28",
      "headline": "Regai review: Familiar but engaging Tamil whodunnit that is short and simpleRelease Date:Fri Nov 28, 2025 ZEE5's Regai is a six-episode Tamil murder mystery series inspired by Rajesh Kumar's work. Despite technical flaws and familiar tropes, it remains an engaging and easy watch for crime fans."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/death-toll-in-hong-kong-high-rise-blaze-rises-to-128-after-more-bodies-are-recovered-news-agency-ap-2827442-2025-11-28",
      "headline": "Deaths in Hong Kong high-rise blaze rise to 128 as more bodies recoveredThe death toll has climbed again as police make arrests over alleged safety lapses at the site. With more bodies recovered and three construction officials now in custody, the scale of the disaster continues to deepen."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-migration-pause-third-world-countries-list-is-india-among-them-2827423-2025-11-28",
      "headline": "Trump's migration pause: What are Third World countries? Is India among them?Third World Countries: US President Donald Trump, escalating his hardline immigration rhetoric, said he will 'permanently pause' migration from all Third World countries. What do Third World countries mean? Is India on the list?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/russian-president-vladimir-putin-to-visit-india-on-december-4-5-for-annual-summit-2827464-2025-11-28",
      "headline": "Russian President Vladimir Putin to visit India on December 4-5 for annual summitThe Ministry of External Affairs on Friday announced that Putin will visit India on December 4 and 5. The visit aims to strengthen India-Russia ties and discuss key regional and global issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/india-unveils-new-quake-map-entire-himalayas-in-highest-risk-danger-zone-2827495-2025-11-28",
      "headline": "India's new quake map puts entire Himalayas in highest danger zoneThis marks one of the most significant shifts in seismic hazard assessment in decades, revealing that 61% of the country now falls under moderate to high hazard zones.​"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/history-sindh-partition-1947-rajnath-singh-why-joined-pakistan-congress-muslim-league-politics-culture-explained-2827222-2025-11-28",
      "headline": "Why wasn't Sindh, like Bengal and Punjab, partitioned between India and Pak?Unlike Punjab or Bengal, where the Partition in 1947 gave parts to India and Pakistan, Sindh went completely to the Islamic nation. Its rivers, cities, and centuries of shared culture left behind and uprooted Sindhi Hindus from their homeland. Why isn't any part of Sindh, which finds mention in India's National Anthem, in India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-orders-review-of-green-cards-from-19-countries-after-national-guard-shooting-glbs-2827236-2025-11-28",
      "headline": "Trump orders review of Green Cards from 19 countries after National Guard shootingTrump ordered a review of Biden-era asylum approvals and Green Cards from 19 high-risk countries. USCIS issued new rules allowing officers to treat origin countries as negative factors in immigration screening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/national-guard-shooting-suspect-rahmanullah-lakanwal-cia-ties-glbs-2827235-2025-11-28",
      "headline": "National Guard shooting suspect Rahmanullah Lakanwal worked with CIA in AfghanistanRahmanullah Lakanwal, an ex-CIA unit member, attacked National Guard members near the White House. One of the members, Sarah Beckstrom, has died while the other remains in critical condition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-accident-insurance-cover-only-for-online-ticket-buyer-supreme-court-asks-railways-2827488-2025-11-28",
      "headline": "Why accident cover only for online train bookings, Supreme Court asks RailwaysThe Supreme Court has been dealing with the issue of safety of Railway system and passengers after concerns were raised in a railway accident compensation case.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/why-indians-are-suddenly-obsessed-with-black-friday-sales-2827420-2025-11-28",
      "headline": "Why Indians are suddenly obsessed with Black Friday salesBlack Friday may have begun in 1960s Philadelphia, but how did it suddenly turn into a shopping festival Indians now wait all year for?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjp-leaders-gather-to-bless-up-couple-wedding-stage-collapses-video-goes-viral-2827291-2025-11-28",
      "headline": "BJP leaders gather to bless UP couple, stage collapses; video goes viralA wedding reception in Ballia, Uttar Pradesh, turned chaotic when the stage collapsed under the weight of senior BJP leaders, causing the bride, groom and guests to fall. Thankfully, no serious injuries were reported in this unexpected mishap that has now gone viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/ai-agent-leaks-startup-secret-then-emails-zoho-ceo-sridhar-vembu-to-apologise-for-its-own-slip-2827408-2025-11-28",
      "headline": "AI agent leaks startup secret, then emails Zoho CEO Vembu to apologise for slipA startup's AI agent accidentally leaked confidential acquisition details to Zoho CEO Sridhar Vembu and then  even bizarrely emailed an apology on its own. The incident has sparked fresh concerns over how much autonomy AI tools should really have in sensitive business conversations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shinde-sena-badlapur-family-dynasty-politics-row-maharashtra-bjp-2827064-2025-11-27",
      "headline": "Shinde Sena gives 6 tickets to a family for Maharashtra civic polls, ally BJP fumesShiv Sena gave six Badlapur Municipal Council tickets to members of the influential Mhatre family, drawing BJP's accusations of blatant nepotism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/will-permanently-pause-migration-from-third-world-countries-donald-trump-2827336-2025-11-28",
      "headline": "Will permanently pause migration from Third World countries: Donald TrumpDonald Trump announced US's plans to permanently halt migration from 'Third World countries' and review residency and naturalisation measures following a shooting near the White House by an Afghan national. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-sidharth-malhotra-introduce-daughter-saraayah-2827368-2025-11-28",
      "headline": "Kiara Advani-Sidharth Malhotra share first pic of daughter, reveal her nameKiara Advani and Sidharth Malhotra have shared the first photo of their daughter and revealed her name. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/from-serenity-to-celebration-gujarat-in-all-its-shades-2823221-2025-11-20",
      "headline": "From Serenity to Celebration - Gujarat in All Its ShadesAnother destination that has stood the test of time and modernisation is Vadnagar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazons-siddharth-bhagat-breaks-down-indias-new-beauty-economy-from-global-trends-to-tech-led-discovery-2825952-2025-11-26",
      "headline": "Amazon's Siddharth Bhagat Breaks Down India's New Beauty Economy—From Global Trends to Tech-Led DiscoveryTracing India's changing beauty codes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/news/story/iit-bombay-renaming-row-maharashtra-to-approach-centre-to-seek-iit-mumbai-name-2826984-2025-11-27",
      "headline": "IIT Bombay to be renamed? Maharashtra to approach Centre for name changeThe Maharashtra government has decided to formally request the Centre to rename IIT Bombay as IIT Mumbai after a political row erupted over Union minister Jitendra Singh's comments on the institute's name. The move has triggered sharp reactions from opposition leaders, reigniting debates on Marathi identity and historical nomenclature."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-virat-kohli-viral-video-ranchi-car-ride-india-vs-sa-odi-2827260-2025-11-28",
      "headline": "Watch: MS Dhoni drives Virat Kohli in his car after their meet-up in RanchiMS Dhoni and Virat Kohli enjoyed a car ride together after the Indian cricket team stars met their former captain at his residence in Ranchi ahead of the start of the ODI series against South Africa. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-minister-periyakaruppan-controversy-dance-udayanidhi-stalin-birthday-2827270-2025-11-28",
      "headline": "Row over minister applauding obscene dance at Udananiydhi Stalin's birthday partyA video showed Tamil Nadu Minister S Periyakaruppan allegedly inviting young female performers to dance closer at Deputy Chief Minister Udayanidhi Stalin's birthday event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cyclone-ditwah-and-senyar-live-updates-rain-alert-tamil-nadu-puducherry-andhra-pradesh-2827299-2025-11-28",
      "headline": "Live: Cyclone Ditwah kills 56 in Sri Lanka; set to make landfall in India on weekendCyclone Ditwah Live Updates: The India Meteorological Department (IMD) said Cyclonic Storm Ditwah is moving toward the coasts of Tamil Nadu, Puducherry, and southern Andhra Pradesh and is expected to make landfall on November 30. The storm originated over the southwest Bay of Bengal near Pottuvil in Sri Lanka and is moving north-northwest. Ditwah made landfall early Friday morning on Sri Lanka's eastern coast and moved northwest toward India, causing widespread damage and killing 56 people in Sri Lanka. It is currently classified as a cyclonic storm, with no forecast of intensifying into a severe cyclone. Tamil Nadu has issued a red alert for four districts and an orange alert for five districts in preparation for the storm. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kapil-sharma-restaurant-shooting-kaps-cafe-canada-bandhu-maan-singh-sekhon-2827359-2025-11-28",
      "headline": "Key conspirator in Kapil Sharma cafe firing arrested, flew to India from CanadaSuspected gangster, Bandhu Maan Singh Sekhon, has allegedly arranged guns and logistics for the shooters who targeted Kapil Sharma's Kap's Cafe multiple times since its opening in July this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/are-these-four-countries-set-to-dominate-indias-2025-study-abroad-trend-2825142-2025-11-28",
      "headline": "Are these four countries set to dominate India's 2025-26 study abroad trend?With over a million Indians currently studying overseas, global education trends are undergoing a major reset this year. Policy changes, affordability concerns and diplomatic developments are now reshaping where students choose to go.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-auction-highlights-team-analysis-biggest-buys-2827248-2025-11-28",
      "headline": "MI play it smart, Gujarat Giants struggle: How teams fared in WPL 2026 mega auctionWPL 2026 auction: MI managed to retain the core of their title-winning squad, while Gujarat struggled to make an impact in the auction. DC once again had an excellent auction, maintaining their reputation for smart buys. UP Warriors and RCB also had a decent day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-delhi-kolkata-india-biggest-cities-dropped-in-un-populous-city-ranking-despite-adding-millions-population-megacities-explained-2827290-2025-11-28",
      "headline": "Delhi, Kolkata added millions but fell in UN megacities ranking. Here's whyThe UN's new way of defining cities' growth has jumbled up the megacity rankings. Delhi and Kolkata slipped, and Jakarta and Dhaka moved up on the most populous cities rankings. India still has five cities in the global Top 20, but the updated method shows that size on the map, not just the population, now decides who leads the list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-details-7-year-effort-to-restore-crime-thriller-shiva-at-iffi-goa-2025-2827400-2025-11-28",
      "headline": "Nagarjuna details 7-year effort to restore crime-thriller Shiva at IFFI Goa 2025Nagarjuna and the Annapurna Studios team detailed the seven-year odyssey of restoring the crime-thriller 'Shiva' for 4K release, including the miracle of retrieving missing audio from prints stored by passionate exhibitors across Telugu states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-recalls-making-dharmendra-watch-lahore-1947-says-he-loved-the-script-2827426-2025-11-28",
      "headline": "Aamir Khan says Dharmendra watched Sunny Deol's Lahore 1947, loved scriptAamir Khan recalled his recent meetings with Dharmendra, including sharing Lahore 1947 with the late actor. He also spoke about their connection at the International Film Festival of India."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smat-2025-sanju-samson-abhishek-sharma-fail-kerala-punjab-defeats-2827500-2025-11-28",
      "headline": "India T20I stars Sanju Samson, Abhishek Sharma flop in second round of SMAT Sanju Samson and Abhishek Sharma didn't have the best of times during the second round of the Syed Mushtaq Ali Trophy on Friday, November 28. Samson and Abhishek flopped with the bat as Kerala and Punjab faced defeats. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-backs-indian-batters-after-test-series-loss-against-south-africa-2827456-2025-11-28",
      "headline": "India batters can't play spin? De Villiers calls for calm amid intense criticism Legendary cricketer AB de Villiers supports Indian batters after their recent Test series defeat to South Africa. He emphasised that they're full of talent and are just suffering from a mental block."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-women-cricket-team-t20i-series-sri-lanka-december-2025-2827429-2025-11-28",
      "headline": "After World Cup win, India women to return to action for 5 T20Is vs Sri Lanka The Indian women's cricket team will play a five-match T20I series against Sri Lanka starting December 21, which will mark the beginning of preparations for the T20 World Cup 2026."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-u19-squad-announced-asia-cup-ayush-mhatre-captain-vaibhav-suryavanshi-recalled-2827428-2025-11-28",
      "headline": "Vaibhav Suryavanshi named in Ayush Mhatre-led India squad for U19 Asia Cup The BCCI on Friday announced the India squad for U19 Men's Asia Cup 2025, starting December 12 in Dubai. The tournament will serve as a platform for preparing for next year's U19 World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-worst-slump-71-years-fight-to-recover-losing-streak-2827415-2025-11-28",
      "headline": "We will fight on: Liverpool manager Arne Slot vows to turn around slump in form Liverpool manager Arne Slot has said that his side will continue to fight on despite their poor run of form in recent times. Liverpool find themselves away from challenging for the title following their recent run. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-fifty-maharashtra-vs-hyderabad-smat-ipl-auction-2827399-2025-11-28",
      "headline": "SMAT: Prithvi Shaw hits 23-ball fifty as form peaks before IPL auction Syed Mushtaq Ali Trophy 2025: Prithvi Shaw made a statement, weeks before the IPL 2026 auction, smashing a 36-ball 66 while leading Maharashtra's chase against Hyderabad in Kolkata on Friday, November 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/junior-mens-hockey-world-cup-2025-pr-sreejesh-india-preparation-2827377-2025-11-28",
      "headline": "Be on your toes, play your game: Sreejesh's message to India ahead of World Cup opener PR Sreejesh has told the Indian team to be on their toes and play to their strengths if they want to go far in the Jr.Men's World Cup. India have won the title twice in their history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-temba-bavuma-ms-dhoni-captaincy-ab-de-villiers-2827355-2025-11-28",
      "headline": "Temba Bavuma calm like Dhoni, his success as captain surprised me: De Villiers India vs South Africa: Temba Bavuma's calm authority and remarkable rise as South Africa's Test captain have stunned even AB de Villiers, who admits he once doubted the appointment that has since transformed the Proteas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-to-continue-india-head-coach-south-africa-test-whitewash-2827354-2025-11-28",
      "headline": "Gambhir to remain coach for all formats despite South Africa whitewash: Report Gautam Gambhir will remain India head coach despite a 0-2 Test series loss to South Africa at home, news agency ANI has reported. There have been calls to remove Gambhir from his role in the longest format after India's continuous poor show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/simon-harmer-redemption-story-kolpak-exile-south-africa-india-test-comeback-2827313-2025-11-28",
      "headline": "Once a Kolpak outcast, Simon Harmer rediscovers himself as SA's hero in India Tests Once discarded after a bruising India tour in 2015, Simon Harmer rebuilt himself through Kolpak exile, county grit and quiet reinvention. In India, he returned transformed, taking 17 wickets and pulling the strings like a master puppeteer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-ruled-out-brisbane-test-australia-unchanged-squad-ashes-2025-26-2827301-2025-11-28",
      "headline": "Ashes 2025: Cummins to miss Brisbane Test as Australia name unchanged squad Pat Cummins continues to remain on the sidelines as Australia named an unchanged squad for the second Ashes 2025-26 Test in Brisbane. Cummins will travel with the squad to step up his recovery process. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/junior-mens-hockey-world-cup-2025-pr-sreejesh-india-preparation-2827377-2025-11-28",
      "headline": "Be on your toes, play your game: Sreejesh's message to India ahead of World Cup opener PR Sreejesh has told the Indian team to be on their toes and play to their strengths if they want to go far in the Jr.Men's World Cup. India have won the title twice in their history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-temba-bavuma-ms-dhoni-captaincy-ab-de-villiers-2827355-2025-11-28",
      "headline": "Temba Bavuma calm like Dhoni, his success as captain surprised me: De Villiers India vs South Africa: Temba Bavuma's calm authority and remarkable rise as South Africa's Test captain have stunned even AB de Villiers, who admits he once doubted the appointment that has since transformed the Proteas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-to-continue-india-head-coach-south-africa-test-whitewash-2827354-2025-11-28",
      "headline": "Gambhir to remain coach for all formats despite South Africa whitewash: Report Gautam Gambhir will remain India head coach despite a 0-2 Test series loss to South Africa at home, news agency ANI has reported. There have been calls to remove Gambhir from his role in the longest format after India's continuous poor show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/simon-harmer-redemption-story-kolpak-exile-south-africa-india-test-comeback-2827313-2025-11-28",
      "headline": "Once a Kolpak outcast, Simon Harmer rediscovers himself as SA's hero in India Tests Once discarded after a bruising India tour in 2015, Simon Harmer rebuilt himself through Kolpak exile, county grit and quiet reinvention. In India, he returned transformed, taking 17 wickets and pulling the strings like a master puppeteer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-ruled-out-brisbane-test-australia-unchanged-squad-ashes-2025-26-2827301-2025-11-28",
      "headline": "Ashes 2025: Cummins to miss Brisbane Test as Australia name unchanged squad Pat Cummins continues to remain on the sidelines as Australia named an unchanged squad for the second Ashes 2025-26 Test in Brisbane. Cummins will travel with the squad to step up his recovery process. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-auction-why-alyssa-healy-went-unsold-coaches-explain-2827295-2025-11-28",
      "headline": "Why Alyssa Healy went unsold in WPL 2026 auction? Team coaches explain callWPL team coaches explained the reason why Australia captain Alyssa Healy went unsold during the 2026 auction on Thursday, November 27. Despite having a base price of Rs. 50 Lakh, none of the teams bid for Healy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/adani-ahmedabad-marathon-ashok-parmar-inspiring-para-athlete-journey-2827197-2025-11-28",
      "headline": "Against all odds: Ashok Parmar dreams of glory for India on international stageDespite being affected by polio at a young age, para-athlete Ashok Parmar continues to defy all odds and excel in the field of weightlifting and marathon running. Ahead of the Adani Ahmedabad Marathon, Ashok talks about getting into sports and the dream of representing India on the international stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-press-conference-india-test-crisis-contradictions-india-vs-south-africa-2827268-2025-11-28",
      "headline": "Gautam Gambhir's press conference of contradictionsIndia lost their second Test match against South Africa by a record margin of 408 runs. Just when everyone thought that this was as bad as it gets, head coach Gautam Gambhir attended the press conference and said some bizarre things in the aftermath of the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-virat-kohli-viral-video-ranchi-car-ride-india-vs-sa-odi-2827260-2025-11-28",
      "headline": "Watch: MS Dhoni drives Virat Kohli in his car after their meet-up in RanchiMS Dhoni and Virat Kohli enjoyed a car ride together after the Indian cricket team stars met their former captain at his residence in Ranchi ahead of the start of the ODI series against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-auction-highlights-team-analysis-biggest-buys-2827248-2025-11-28",
      "headline": "MI play it smart, Gujarat Giants struggle: How teams fared in WPL 2026 mega auctionWPL 2026 auction: MI managed to retain the core of their title-winning squad, while Gujarat struggled to make an impact in the auction. DC once again had an excellent auction, maintaining their reputation for smart buys. UP Warriors and RCB also had a decent day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/9-year-old-indian-origin-talent-urban-negi-signs-evertons-youth-academy-2827220-2025-11-28",
      "headline": "9-year-old Indian-origin talent Urban Negi signs for Everton's youth academyIndian-origin youngster Urban Negi, aged nine, has signed with Everton's youth academy after impressing in London. His progress brings hope for greater Indian representation in elite football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-virat-kohli-rishabh-pant-attendance-ms-dhoni-home-ranchi-get-together-2827211-2025-11-27",
      "headline": "Kohli, Pant attend MS Dhoni's high-profile get-together in RanchiVirat Kohli, Rishabh Pant and other Indian players visited MS Dhoni's Ranchi home ahead of the ODI series against South Africa as the team regroups after the Test defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-auction-deepti-sharma-most-expensive-player-up-warriorz-signings-2827196-2025-11-27",
      "headline": "From Sophie Ecclestone to Kranti Goud: 5 steal deals in WPL 2026 mega auctionThe WPL 2026 auction delivered high drama as franchises spent Rs 40.8 crore to reshuffle squads, headlined by Deepti Sharma's record Rs 3.2 crore return to UP Warriorz and several surprise bargains and omissions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-auction-highlights-team-analysis-biggest-buys-2827248-2025-11-28",
      "headline": "MI play it smart, Gujarat Giants struggle: How teams fared in WPL 2026 mega auctionWPL 2026 auction: MI managed to retain the core of their title-winning squad, while Gujarat struggled to make an impact in the auction. DC once again had an excellent auction, maintaining their reputation for smart buys. UP Warriors and RCB also had a decent day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/9-year-old-indian-origin-talent-urban-negi-signs-evertons-youth-academy-2827220-2025-11-28",
      "headline": "9-year-old Indian-origin talent Urban Negi signs for Everton's youth academyIndian-origin youngster Urban Negi, aged nine, has signed with Everton's youth academy after impressing in London. His progress brings hope for greater Indian representation in elite football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-virat-kohli-rishabh-pant-attendance-ms-dhoni-home-ranchi-get-together-2827211-2025-11-27",
      "headline": "Kohli, Pant attend MS Dhoni's high-profile get-together in RanchiVirat Kohli, Rishabh Pant and other Indian players visited MS Dhoni's Ranchi home ahead of the ODI series against South Africa as the team regroups after the Test defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-auction-deepti-sharma-most-expensive-player-up-warriorz-signings-2827196-2025-11-27",
      "headline": "From Sophie Ecclestone to Kranti Goud: 5 steal deals in WPL 2026 mega auctionThe WPL 2026 auction delivered high drama as franchises spent Rs 40.8 crore to reshuffle squads, headlined by Deepti Sharma's record Rs 3.2 crore return to UP Warriorz and several surprise bargains and omissions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-auction-full-list-of-indians-sold-deepti-sharma-shikha-pandey-shree-charani-2827180-2025-11-27",
      "headline": "44 Indians headline blockbuster WPL auction as franchises cash in on homegrown starsThe 2026 WPL mega auction was dominated by Indian talent, with 44 players earning contracts led by Deepti Sharma's joint-record RTM signing. Franchises focused heavily on homegrown strength, shaping what could be the most competitive WPL season yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-auction-full-players-sold-unsold-list-most-expensive-buys-2827166-2025-11-27",
      "headline": "WPL Auction: Full list of players sold, updated squads ahead of 2026 seasonWPL Auction: The Women's Premier League mega auction concluded with the franchise buying a total of 67 players. Deepti Sharma was the most expensive buy of the day, while Alyssa Healy and Alana King made headlines due to shocking omissions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-rohit-sharma-virat-kohli-practice-session-video-2827156-2025-11-27",
      "headline": "Virat Kohli, Rohit Sharma lead India's practice in Ranchi ahead of 1st ODIVirat Kohli and Rohit Sharma had their first net session in Ranchi ahead of India's first ODI against South Africa. The star duo return for their first international game since playing the 3-match ODI series in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-rohit-virat-kohli-sunil-gavaskar-2827142-2025-11-27",
      "headline": "Stop saying India would've beaten South Africa with Kohli, Rohit: Sunil GavaskarIND vs SA: Would India have avoided the Test series disaster against South Africa if Rohit Sharma and Virat Kohli were still around? Legendary Sunil Gavaskar makes strong remarks on the burning question that has been floating on social media since the defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-modi-meets-indian-blind-womens-cricket-team-historic-t20-world-cup-win-2827137-2025-11-27",
      "headline": "PM Modi meets Indian blind women's cricket team after historic T20 World Cup triumphPM Narendra Modi met the Indian women's blind cricket team after their unbeaten run to the inaugural Blind Women's T20 World Cup title, celebrating their historic win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-jr-mens-hockey-world-cup-2025-preview-squad-schedule-2826864-2025-11-27",
      "headline": "Jr. Men's Hockey World Cup: PR Sreejesh's young India chase third titleThe Indian team will be aiming to win their third title as they step on to the field for the Jr.men's Hockey World Cup in Chennai and Madurai, starting from November 28. With PR Sreejesh at the helm and filled with HIL stars, India will look to end a nine-year wait for the crown. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-auction-shikha-pandey-24-crore-up-warriorz-2827126-2025-11-27",
      "headline": "Old is gold: Ageless Shikha Pandey bags Rs 2.4 crore move to UP WarriorzShikha Pandey has been keeping herself active by taking part in leagues across the globe. This experience has certainly upped her stocks, which resulted in a Rs 2.4 crore deal with the UP Warriorz at the WPL 2026 mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/tanvi-sharma-stuns-nozomi-okuahara-syed-modi-international-upsets-indian-shuttlers-2827097-2025-11-27",
      "headline": "16-year-old Tanvi shocks ex-world champ, Prannoy beaten by teen compatriotTanvi Sharma upset former world champion Nozomi Okuhara to reach Syed Modi International quarterfinals in Lucknow on Thursday. Meanwhile, 19-year-old Manraj Singh defeated HS Prannoy in men's singles second round."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}