{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-kekius-maximus-memecoin-elon-musk-new-identity-on-x-price-of-kekius-2657805-2024-12-31",
      "headline": "What is Kekius Maximus? Elon Musk's new identity on XBy adopting the name 'Kekius Maximus' on X, Musk sent the KEKIUS memecoin soaring 500%, sparking renewed interest in the crypto market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-end-marginally-lower-in-last-trading-session-of-2024-2657803-2024-12-31",
      "headline": "Sensex, Nifty end marginally lower in last trading session of 2024The S&P BSE Sensex fell by 109.12 points to settle at 78,139.01, while the Nifty50 edged down by 0.10 points, closing at 23,644.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-in-2025-sensex-and-nifty-dalal-street-turbulence-continue-experts-2657741-2024-12-31",
      "headline": "Sensex and Nifty in 2025: Will Dalal Street's turbulent run continue?Following a volatile 2024 that saw significant gains in the first half before moderating, market experts anticipate single-digit returns in the coming year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/itr-filing-deadline-extended-for-belated-revised-return-cbdt-new-date-income-tax-check-all-details-stmp-2657711-2024-12-31",
      "headline": "ITR filing deadline extended for belated/revised return. Check all detailsUnion Minister of State for Finance Pankaj Chaudhary recently revealed in Parliament that only 6.68% of India's population filed ITRs in the fiscal year 2023-24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-2025-investment-tips-top-9-stocks-portfolio-new-year-shriram-finance-fortis-doms-airtel-2657699-2024-12-31",
      "headline": "Looking to invest in stocks in 2025? 9 picks for your portfolio this New YearThe year 2024 has been decent for Indian stock markets. Both key market indices - the NSE Nifty 50 and the S&P BSE Sensex - went up by 9% during the year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-rites-share-price-surged-10-percent-today-explained-stmp-2657681-2024-12-31",
      "headline": "Explained: Why RITES share price surged 10% todayRITES stock price: The stock opened at Rs 267.15 and soared to an intraday high of Rs 302.80, supported by increased investor interest and heightened trading activity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-department-extends-vivad-se-vishwas-scheme-2024-deadline-to-january-31-key-penalty-interest-details-2657664-2024-12-31",
      "headline": "Income Tax extends Vivad Se Vishwas deadline to January 31. Key penalty detailsThe Income Tax Department has extended the Vivad Se Vishwas Scheme deadline to January 31, 2025, offering taxpayers a chance to settle disputes at reduced rates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-share-price-rebounds-after-falling-in-previous-session-explained-stmp-2657653-2024-12-31",
      "headline": "Dam Capital share price rebounds after Monday's slump. Here's whyDam Capital stock price:  By 11 am, the shares were trading 3.60% higher at Rs 385.70, recovering some ground lost during Monday's profit booking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iti-share-price-continues-positive-rally-reaches-all-time-high-stmp-2657642-2024-12-31",
      "headline": "ITI share price hits record high as positive rally continuesITI share price: The recent rally has propelled ITI Ltd. above its 5-day, 20-day, 50-day, 100-day, and 200-day moving averages, underlining its robust performance across short- and long-term benchmarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/easy-trip-planners-share-price-stock-falls-10-percent-on-promoter-nishant-pitti-stake-sale-stmp-2657636-2024-12-31",
      "headline": " Explained: Why Easy Trip Planners shares tanked 10% today The shares hit a low of Rs 15.42 on the NSE, a decline of 9.51%. The stock saw a turnover of Rs 127.43 crore on the NSE during the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unimech-aerospace-ipo-listing-share-price-90-percent-premium-rs-1491-bse-bumper-debut-multibagger-2657628-2024-12-31",
      "headline": "Unimech Aerospace IPO listing: Shares make bumper debut. Lists at 90% premiumUnimech Aerospace IPO stock: Unimech Aerospace shares listed at Rs 1,491 per share, reflecting an 89.94% premium over their issue price on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-in-red-it-stocks-decline-last-session-of-2024-adani-enterprises-down-over-1-percent-2657617-2024-12-31",
      "headline": "Sensex, Nifty drop as IT stocks weigh on markets in last session of 2024The S&P BSE Sensex lost 392.61 points to 77,855.52, while the NSE Nifty50 was down by 107.80 points to 23,537.10 as of 9:28 AM. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indo-farm-equipment-ipo-open-for-bidding-check-latest-gmp-price-band-issue-size-all-details-2657609-2024-12-31",
      "headline": "Indo Farm Equipment IPO opens for bidding: Check GMP, price band, issue sizeIndo Farm Equipment IPO: The IPO is a book-built issue valued at Rs 260.15 crore. It includes a fresh issue of 86 lakh shares, amounting to Rs 184.90 crore, and an offer for sale (OFS) of 35 lakh shares, valued at Rs 75.25 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unimech-aerospace-ipo-listing-gmp-declines-will-it-make-strong-market-debut-today-2657598-2024-12-31",
      "headline": " Unimech Aerospace IPO GMP declines: Will it make strong market debut today? The initial public offering (IPO) of Unimech Aerospace and Manufacturing Limited garnered an overwhelming response, with a subscription rate of 174.93 times by the final day of bidding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-adani-enterprises-adani-wilmar-easemytrip-itc-zomato-unimech-aerospace-2657590-2024-12-31",
      "headline": "Stocks to watch today: Adani Enterprises, Adani Wilmar, EaseMyTrip, ITC, ZomatoShares of Adani Enterprises, Adani Wilmar, Zoamto, EaseMyTrip, etc will be in the spotlight today due to various developments when markets open for trading. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-income-tax-itr-filing-will-the-old-tax-regime-face-the-axe-2657339-2024-12-30",
      "headline": "Budget 2025: Will the old tax regime face the axe?With Budget 2025 approaching, debates intensify over the potential scrapping of the Old Tax Regime amidst tax reforms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-to-sell-entire-adani-wilmar-stake-in-usd-2-billion-deal-lence-pte-ltd-divestment-2657295-2024-12-30",
      "headline": "Adani Enterprises to sell entire Adani Wilmar stake in $2 billion dealAdani Enterprises and its wholly-owned subsidiary, Adani Commodities LLP (ACL), have entered into an agreement with Lence Pte Ltd, a fully-owned subsidiary of Wilmar International."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-over-450-points-nifty-declines-adani-enterprises-jumps-7-percent-2657286-2024-12-30",
      "headline": "Sensex falls over 450 points, Nifty declines; Adani Enterprises jumps 7%The S&P BSE Sensex ended 450.94 points lower at 78,248.13, while the NSE Nifty50 settled 168.50 points lower at 23,644.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/greaves-cotton-share-price-jumps-13-percent-52-week-high-today-why-vijay-kedia-greaves-electric-mobility-ipo-stmp-2657274-2024-12-30",
      "headline": "Greaves Cotton share price surges 13% to hit 52-week high today. Here's why Greaves Cotton share price hit 52-week high. The share which had closed at Rs 281.83 on Friday, opened at Rs 288.70 on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/are-fixed-deposits-still-the-best-bet-for-indian-investors-is-fd-safe-2657273-2024-12-30",
      "headline": "Are fixed deposits still the best bet for Indian investors?Fixed deposits are safe but face risks like limited protection, reinvestment challenges, and low post-tax real returns."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manipur-ethnic-violence-kuki-meitei-biren-singh-chief-minister-apologises-forgive-forget-2657774-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chief Minister Biren Singh apologises for Manipur violence: Forgive and forgetBiren Singh, who has come under fire from the opposition over his handling of the violence, emphasised that peace was being restored in Manipur and hoped for restoration of normalcy in 2025. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/cm-pinarayi-calls-maharashtra-minister-nitesh-ranes-kerala-mini-pakistan-remark-rss-hate-campaign-2657760-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pinarayi Vijayan calls Maharashtra Minister's 'mini Pakistan' remark hate tacticChief Minister Pinarayi Vijayan said Nitesh Rane calling Kerala a \"mini Pakistan\" was provocative and condemnable. He accused the Mahashtra fisheries minister of echoing Sangh Parivar's hate campaigns to alienate Kerala and called for his resignation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/new-zealand-welcomes-new-year-2025-first-country-auckland-2657827-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New Zealand welcomes 2025 with spectacular New Year's Eve fireworksNew Zealand was among the first countries in the world to usher in New Year 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/suchir-balaji-testimony-shaken-openai-microsoft-mother-suicide-case-foul-play-2657683-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Big claim by Suchir Balaji's mother: Testimony would have shaken OpenAI, MicrosoftSuchir Balaji Death: Suchir Balaji's mother said her son was found dead a week after being named as a potential witness in a lawsuit brought against OpenAI by The New York Times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/can-living-apart-together-marriages-be-a-hit-in-india-2657775-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can 'Living Apart Together' marriages be a hit in India?Living Apart Together (LAT), a growing trend among committed and married couples in the West, refers to couples intentionally avoiding cohabitation in order to keep the spark alive."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-bjp-mocks-chunavi-hindu-arvind-kejriwal-rs-18000-honorarium-priests-granthis-2657673-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP's 'chunavi Hindu' dig at Arvind Kejriwal with a Bhool Bhulaiyaa twistDelhi Election: Taking to X, the Delhi BJP shared a poster mocking Arvind Kejriwal, portraying him with rudraksha beads, flower garlands, and vermilion covering his body, while incense sticks were tucked behind his ears."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-must-strict-h1b-visa-change-stance-maga-civil-war-indian-it-professional-american-companies-donald-trump-2657712-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Elon Musk has backpedalled on H-1B visa after MAGA falloutDays after Elon Musk defended the H-1B visa, he shifted his stance, calling the program \"broken\" and calling for major reforms, including higher salaries and additional costs to make hiring overseas workers more expensive. What's the change in Musk's position driven by? Is it MAGA-fuelled scepticism, or economic pragmatism, or concerns over US companies exploiting the visa program?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-says-he-is-leaving-mumbai-for-the-south-2657659-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Anurag Kashyap says he is leaving Mumbai for the South: Disgusted by my industryFilmmaker-actor Anurag Kashyap critiqued Bollywood's profit-centric mindset and obsession with remakes. He also revealed his plans to relocate to the South. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/ram-kapoor-55-kg-transformation-how-to-lose-weight-without-pills-surgery-2657817-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ram Kapoor shed 55 kg in 1.5 years: How to do it without pills, surgeryActor Ram Kapoor's weight-loss journey defies quick-fix methods like taking pills and surgery. Know what public health experts consider what healthy weight loss looks like."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-covid-origin-wuhan-lab-who-data-origin-global-scale-studies-beijing-2657716-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "China says Covid data already shared as WHO calls for transparencyThe Chinese government claimed that more clues regarding the source of the virus are emerging on the global scale and that studies tracing its origin should be approached from a global perspective."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/bullocks-tow-rajasthan-leader-electric-car-after-it-breaks-down-viral-video-2657742-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Bullocks tow Rajasthan leader's electric car after it breaks downA video of a high-tech electric car that belonged to an Opposition leader of a Rajasthan municipality being towed by bullocks went viral online.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-odi-series-jasprit-bumrah-rest-virat-kohli-rohit-sharma-selection-2657800-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jasprit Bumrah to be rested for England ODIs ahead of Champions Trophy: SourcesIndia vs England, 2025: Star pacer Jasprit Bumrah is likely to be rested for the white-ball series against England. India will play five ODIs and three T20Is against a visiting England side from January 22 to February 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/park-sung-hoon-porn-parody-squid-game-faces-backlash-team-responds-2657797-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Park Sung-hoon faces backlash over sharing porn parody of Squid Game 2The Squid Game actor Park Sung-hoon found himself in soup after accidentally uploading an adult Squid Game parody post on Instagram amidst a national tragedy in South Korea. His agency confirmed the mistake, prompting an apology from the actor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/south-korea-plane-crash-haunting-final-photo-three-year-old-boy-youngest-victim-thailand-holiday-2657622-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Haunting final photo of boy, 3, youngest victim in South Korea plane crashKang Ko, his wife Jin Lee Seon, and their son were killed when the Jeju Air Boeing 737-800 crashed on Sunday. The family was returning from a holiday in Thailand, the boy's first and only foreign trip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/yemen-kerala-nurse-nimisha-priya-death-sentence-sanction-foreign-ministry-extending-all-help-2657626-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Extending all help: India after Yemen sanctions death penalty for Kerala nurseThe official spokesperson of the External Affairs Ministry, in a statement, said that the Centre was extending all help necessary and looking at all options for Nimisha Priya. The Kerala nurse's death sentence was sanctioned by Yemen's President."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-thief-caught-after-passing-out-drunk-after-breaking-into-liquor-shop-2657791-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Thief breaks into Telangana liquor shop, gets drunk and passes outA thief broke into a wine shop in Telangana, stealing cash and disabling CCTV cameras. However, he also drank while on the job and passed out drunk on the shop floor. The police found him unconscious the next morning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/indian-films-releasing-in-2025-emergency-chhaava-coolie-thug-life-2657782-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "From Emergency to Thug Life: Films to watch out for in 2025The year 2025 is packed with exciting releases from Bollywood and South Indian cinema, featuring historical dramas, action-packed thrillers, and anticipated sequels. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-navjot-sindhu-slams-travis-head-celebration-pant-insult-indian-2657635-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Navjot Sidhu wants Travis Head punished for conduct so 'no one dares follow suit'Australia vs India: Former Indian batter Navjot Singh Sidhu has slammed Travis Head's 'obnoxious' celebration after Rishabh Pant's dismissal in the recent Boxing Day Test. Sidhu labeled the act as \"obnoxious behavior\", saying the celebration insulted not just Pant but the entire Indian population of 1.5 billion.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angelina-jolie-brad-pitt-divorce-settlement-8-years-2657643-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Angelina Jolie, Brad Pitt finalise divorce, reach settlement after 8 yearsAngelina Jolie and Brad Pitt have reached a settlement eight years after filing for divorce. Jolie's lawyer conveyed her relief."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/itr-filing-deadline-extended-for-belated-revised-return-cbdt-new-date-income-tax-check-all-details-stmp-2657711-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "ITR filing deadline extended for belated/revised return. Check all detailsUnion Minister of State for Finance Pankaj Chaudhary recently revealed in Parliament that only 6.68% of India's population filed ITRs in the fiscal year 2023-24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mumbai-graphic-designer-14-years-experience-turns-auto-rickshaw-driver-after-losing-job-2657705-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mumbai graphic designer turns auto-rickshaw driver after losing job, narrates journeyKamlesh Kamtekar, a seasoned assistant creative manager with 14 years of experience in graphic design, found himself unemployed five months ago, thrust into a challenging job market. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-changes-name-x-twitter-kekius-maximus-pepe-frog-what-it-means-2657743-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk changes name on X to 'Kekius Maximus'. What it meansElon Musk, known for his quirky antics and posts on X, also replaced his profile picture with the popular 'Pepe the Frog' meme."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/west-bengal/story/bengal-businessman-tulu-mandal-daughter-lavish-wedding-sparks-row-over-funding-source-2657623-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengal businessman's daughter's lavish wedding sparks row over funding sourceThe wedding ceremony took place in Birbhum's Suri city and the venue was a replica of the five-star Taj Lake Palace hotel in Udaipur. All hotels in the city and district were booked for the guests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/this-new-maruti-model-is-challenging-the-legendary-baleno-not-swift-or-dzire-2657709-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "This new Maruti model is challenging the legendary Baleno. Not Swift or DzireAlthough based on the Baleno, this new Maruti car is attracting many customers due to its SUV positioning, among others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/allu-arjun-darshan-arrest-nayanthara-dhanush-row-salman-khan-firing-controversies-of-2024-2657773-2024-12-31",
      "headline": "Allu Arjun's arrest to firing at Salman Khan's house: Big controversies of 2024While 2024 saw many superhit films, it also witnessed many controversies. From Allu Arjun and Darshan's arrest to the firing outside Salman Khan's residence, many incidents made headlines. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/top-stories/story/laughter-chefs-zee-horror-show-tv-shows-to-entertain-in-2025-2657732-2024-12-31",
      "headline": "Laughter Chefs to Zee Horror Show, TV shows that will keep you entertained in 2025In 2025, television continues to promise diverse entertainment with a mix of family dramas, horror shows, and celebrity cooking competitions across major Indian channels. As audiences seek engaging content, channels like Colors, ZEE, Sony, and Star Plus are set to deliver captivating stories and thrilling experiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/park-sung-hoon-porn-parody-squid-game-faces-backlash-team-responds-2657797-2024-12-31",
      "headline": "Park Sung-hoon faces backlash over sharing porn parody of Squid Game 2The Squid Game actor Park Sung-hoon found himself in soup after accidentally uploading an adult Squid Game parody post on Instagram amidst a national tragedy in South Korea. His agency confirmed the mistake, prompting an apology from the actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/indian-films-releasing-in-2025-emergency-chhaava-coolie-thug-life-2657782-2024-12-31",
      "headline": "From Emergency to Thug Life: Films to watch out for in 2025The year 2025 is packed with exciting releases from Bollywood and South Indian cinema, featuring historical dramas, action-packed thrillers, and anticipated sequels. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/wayne-rooney-plymouth-argyle-coach-mutual-termination-seven-months-efl-championship-2657822-2024-12-31",
      "headline": "Wayne Rooney's time as Plymouth Argyle coach ends after just 7 monthsWayne Rooney's struggles as a manager continued, with his seven-month stint at Plymouth Argyle ending after a poor run of results left the club languishing at the bottom of the Championship table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ms-dhoni-pr-good-cricket-social-media-era-2657814-2024-12-31",
      "headline": "If you play good cricket, you don't need PR: MS Dhoni on 'social media' era  MS Dhoni opened up about his views on social media, saying that if players perform well on the ground, they should not need a PR. At the age of 43, Dhoni is set to play in his 18th season of the Indian Premier League (IPL). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-odi-series-jasprit-bumrah-rest-virat-kohli-rohit-sharma-selection-2657800-2024-12-31",
      "headline": "Jasprit Bumrah to be rested for England ODIs ahead of Champions Trophy: SourcesIndia vs England, 2025: Star pacer Jasprit Bumrah is likely to be rested for the white-ball series against England. India will play five ODIs and three T20Is against a visiting England side from January 22 to February 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-jasprit-bumrah-best-bowler-ever-seen-darren-lehmann-glenn-mcgrath-wasim-akram-2657799-2024-12-31",
      "headline": "Bumrah best bowler I have ever seen: Lehmann compares pacer legendsDarren Lehmann compared Jasprit Bumrah to cricket legends Glenn McGrath and Wasim Akram, praising his extraordinary impact in the Border-Gavaskar Trophy and backing him as a future India captain.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-vs-newcastle-united-ruben-amorim-joshua-zirkzee-substitution-explains-2657786-2024-12-31",
      "headline": "Amorim explains decision to sub off Zirkzee after 33 minutes vs NewcastleRuben Amorim justified substituting Joshua Zirkzee after 33 minutes in Manchester United's 2-0 defeat to Newcastle, emphasising it was a tactical decision amidst growing concerns over United's relegation battle after their third consecutive Premier League loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-sanjay-manjrekar-aus-vs-ind-border-gavaskar-trophy-2024-25-2657779-2024-12-31",
      "headline": "Rishabh Pant should be criticized for his failures, not how he fails: ManjrekarFormer India cricketer turned commentator Sanjay Manjkrekar feels India wicketkeeper batter Rishabh Pant shouldn't be criticised for his mode of dismissals but only his failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/darren-lehmann-rohit-sharma-virat-kohli-replacements-aus-vs-ind-border-gavaskar-trophy-2024-25-2657756-2024-12-31",
      "headline": "Finding Rohit and Virat's replacements will not be a big worry for India: LehmannFormer Australia cricketer and head coach Darren Lehmann feels Indian cricket has enough depth to replace star batters Virat Kohli and Rohit Sharma, should they decide to retire after the end of the ongoing series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-mcg-test-personal-decision-aakash-chopra-2657713-2024-12-31",
      "headline": "Rohit prioritised himself over team's best interests at MCG, says ex-openerAustralia vs India, 4th Test: Former India opener Aakash Chopra said Rohit Sharma prioritised himself over the team's best interests for the first time in his captaincy career when he returned to open the batting and left out Shubman Gill from the XI in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-sanjana-ganesan-angad-aus-vs-ind-border-gavaskar-trophy-2024-25-2657697-2024-12-31",
      "headline": "Jasprit Bumrah's wife's adorable post featuring son Angad: Proud of you DaddaIndia fast bowler Jasprit Bumrah's wife Sanjana Ganesan shared an adorable post for his husband featuring their son Angad, to acknowledge his bowling performances in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-reddy-better-hardik-pandya-test-sunil-gavaskar-stmp-2657680-2024-12-31",
      "headline": "Nitish Reddy definitely better than Hardik in Test cricket: Sunil GavaskarFormer India captain Sunil Gavaskar has reserved high praise for Nitish Kumar Reddy's credentials in Test cricket, calling him a better batter than Hardik Pandya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-awards-nominees-full-list-jasprit-bumrah-test-odi-emerging-2657658-2024-12-31",
      "headline": "Jasprit Bumrah dominates nominations for ICC Awards 2024: Full list ICC Awards 2024: Jasprit Bumrah, Harry Brook and Joe Root earned multiple nominations for the annual awards. Ashdeep Singh, Smriti Manahdna and Shreyanka Patil were the other Indians on the shortlist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/darren-lehmann-rohit-sharma-virat-kohli-replacements-aus-vs-ind-border-gavaskar-trophy-2024-25-2657756-2024-12-31",
      "headline": "Finding Rohit and Virat's replacements will not be a big worry for India: LehmannFormer Australia cricketer and head coach Darren Lehmann feels Indian cricket has enough depth to replace star batters Virat Kohli and Rohit Sharma, should they decide to retire after the end of the ongoing series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-mcg-test-personal-decision-aakash-chopra-2657713-2024-12-31",
      "headline": "Rohit prioritised himself over team's best interests at MCG, says ex-openerAustralia vs India, 4th Test: Former India opener Aakash Chopra said Rohit Sharma prioritised himself over the team's best interests for the first time in his captaincy career when he returned to open the batting and left out Shubman Gill from the XI in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-sanjana-ganesan-angad-aus-vs-ind-border-gavaskar-trophy-2024-25-2657697-2024-12-31",
      "headline": "Jasprit Bumrah's wife's adorable post featuring son Angad: Proud of you DaddaIndia fast bowler Jasprit Bumrah's wife Sanjana Ganesan shared an adorable post for his husband featuring their son Angad, to acknowledge his bowling performances in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-reddy-better-hardik-pandya-test-sunil-gavaskar-stmp-2657680-2024-12-31",
      "headline": "Nitish Reddy definitely better than Hardik in Test cricket: Sunil GavaskarFormer India captain Sunil Gavaskar has reserved high praise for Nitish Kumar Reddy's credentials in Test cricket, calling him a better batter than Hardik Pandya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-awards-nominees-full-list-jasprit-bumrah-test-odi-emerging-2657658-2024-12-31",
      "headline": "Jasprit Bumrah dominates nominations for ICC Awards 2024: Full list ICC Awards 2024: Jasprit Bumrah, Harry Brook and Joe Root earned multiple nominations for the annual awards. Ashdeep Singh, Smriti Manahdna and Shreyanka Patil were the other Indians on the shortlist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vinod-kambli-dance-chak-de-video-thane-hospital-room-health-update-2657644-2024-12-31",
      "headline": "Watch: Vinod Kambli dances to 'Chak De' at Thane hospital, video goes viral Former India cricketer Vinod Kambli was seen dancing to the tunes of 'Chak De India' at his hospital room in Thane. Doctors said on Monday that the cricketer's health was improving. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-navjot-sindhu-slams-travis-head-celebration-pant-insult-indian-2657635-2024-12-31",
      "headline": "Navjot Sidhu wants Travis Head punished for conduct so 'no one dares follow suit'Australia vs India: Former Indian batter Navjot Singh Sidhu has slammed Travis Head's 'obnoxious' celebration after Rishabh Pant's dismissal in the recent Boxing Day Test. Sidhu labeled the act as \"obnoxious behavior\", saying the celebration insulted not just Pant but the entire Indian population of 1.5 billion.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pat-cummins-india-vs-australia-boxing-day-test-melbourne-2657511-2024-12-31",
      "headline": "Captain fantastic: Cummins steps up to haunt India againBoxing Day Test, IND vs AUS: Pat Cummins has been a thorn in the flesh for India over the last one and a half years. On Monday, he captained Australia to a 2-1 series lead with an 184-run win at the Melbourne Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-mitchell-starc-injury-update-new-year-test-sydney-andrew-mcdonald-2657633-2024-12-31",
      "headline": "Mitchell Starc to miss Sydney Test? Australia head coach gives injury updateAustralia vs India: Australia head coach Andrew McDoland remained optimistic about Mitchell Starc's chances of playing the fifth Test, starting January 3 in Sydney. The left-arm pacer picked up an upper-body concern in Australia's 184-run win in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sam-konstas-david-warner-jasprit-bumrah-brave-batting-2657624-2024-12-31",
      "headline": "Warner praises Konstas, questions senior Australian batters' approach vs BumrahFormer opener David Warner praised Sam Konstas for his brave batting approach against India's ace pacer Jasprit Bumrah. However, Warner also questioned why it took a 19-year-old to show the initiative that senior players failed to display.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-lose-another-appeal-to-register-dani-olmo-before-deadline-2657592-2024-12-31",
      "headline": "Barcelona lose another appeal to register Dani Olmo before deadlineBarcelona have lost another appeal for the registration of Dani Olmo for the rest of the season on Monday, one day before the deadline to register the Spanish international.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-virat-kohli-test-comparison-fab-four-williamson-smith-root-2657490-2024-12-31",
      "headline": "No more Fab 4: Virat Kohli fails to keep up with ever-evolving peers IND vs AUS: Virat Kohli has struggled to find his form in Test cricket over the last five years, while the other members of the Fab-Four, Steve Smith, Kane Williamson and Steve Smith, have kept hammering runs all around the globe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-coach-defends-mitchell-marsh-poor-form-india-test-series-2657583-2024-12-31",
      "headline": "Australia coach defends Mitchell Marsh amid widespread calls to drop all-rounderBorder-Gavaskar Trophy: Australian coach Andrew McDonald has defended the role of out-of-form all-rounder Mitchell Marsh in the team ahead of the fifth and final Test against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sam-konstas-david-warner-jasprit-bumrah-brave-batting-2657624-2024-12-31",
      "headline": "Warner praises Konstas, questions senior Australian batters' approach vs BumrahFormer opener David Warner praised Sam Konstas for his brave batting approach against India's ace pacer Jasprit Bumrah. However, Warner also questioned why it took a 19-year-old to show the initiative that senior players failed to display.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-lose-another-appeal-to-register-dani-olmo-before-deadline-2657592-2024-12-31",
      "headline": "Barcelona lose another appeal to register Dani Olmo before deadlineBarcelona have lost another appeal for the registration of Dani Olmo for the rest of the season on Monday, one day before the deadline to register the Spanish international.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-virat-kohli-test-comparison-fab-four-williamson-smith-root-2657490-2024-12-31",
      "headline": "No more Fab 4: Virat Kohli fails to keep up with ever-evolving peers IND vs AUS: Virat Kohli has struggled to find his form in Test cricket over the last five years, while the other members of the Fab-Four, Steve Smith, Kane Williamson and Steve Smith, have kept hammering runs all around the globe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-coach-defends-mitchell-marsh-poor-form-india-test-series-2657583-2024-12-31",
      "headline": "Australia coach defends Mitchell Marsh amid widespread calls to drop all-rounderBorder-Gavaskar Trophy: Australian coach Andrew McDonald has defended the role of out-of-form all-rounder Mitchell Marsh in the team ahead of the fifth and final Test against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/emma-raducanu-pulls-out-of-australian-open-warmup-with-back-niggle-2657577-2024-12-31",
      "headline": "Emma Raducanu pulls out of Australian Open warmup with back niggleGrand Slam champion Emma Raducanu has withdrawn from this week's WTA event in Auckland due to a back issue. However, Raducanu has decided to travel to Melbourne to continue her preparations for the Australian Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-threat-relegation-ruben-amorim-newcastle-loss-2657569-2024-12-31",
      "headline": "Manchester United face clear threat of relegation, admits Ruben AmorimRuben Amorim admitted that it is \"really clear\" Manchester United are being drawn into a relegation battle following their 2-0 defeat to Newcastle at Old Trafford. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sunil-gavaskar-cannot-read-crystal-ball-virat-kohli-rohit-sharma-test-future-2657484-2024-12-30",
      "headline": "Cannot read the crystal ball: Gavaskar on Rohit, Kohli's Test futureSunil Gavaskar emphasised how Virat Kohli and Rohit Sharma have given underwhelming performances in the Border-Gavaskar Trophy, highlighting that their lack of impactful contributions has significantly hindered India's chances of success against a dominant Australian side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-five-reasons-why-india-lost-melbourne-test-yashasvi-jaiswal-dropped-catches-2657469-2024-12-30",
      "headline": "Why Jaiswal's drops are not the only reason for India's MCG Test lossIndia's defeat in the Melbourne Test exposed glaring flaws, from senior players' failures to tactical errors, while Yashasvi Jaiswal's dropped catches, though costly, were far from the sole reason for their precarious position in the Border Gavaskar Trophy."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}