{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-pulls-out-chinese-staff-from-plants-south-india-iphone-production-takes-hit-report-2749935-2025-07-03",
      "headline": "Inside China's quiet move to disrupt iPhone production in IndiaThe latest model, the iPhone 17, was to be a huge step in Apple's plans to make India its second home for high-end production. That roadmap now looks uncertain as Foxconn has pulled out Chinese staff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-soham-parekh-the-indian-techie-accused-of-moonlighting-in-us-2749908-2025-07-03",
      "headline": "Who is Soham Parekh, the Indian techie accused of moonlighting by US startups?Soham Parekh, who is believed to be based in India, is alleged to have simultaneously worked at up to four or five startups—many of them backed by Y Combinator—raising questions about hiring practices in remote-first tech culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-157-points-higher-nifty-above-25500-eternal-up-2-percent-2749901-2025-07-03",
      "headline": "Sensex, Nifty struggle for direction as markets await India-US deal newsThe S&P BSE Sensex was down by 13.01 points to 83,396.68, while the NSE Nifty50 lost 3.70 points to 25,449.70 as of 9:29 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-expectation-sensex-nifty-trading-setup-bse-nse-us-vietnam-trade-deal-china-2749878-2025-07-03",
      "headline": "Will Sensex, Nifty open higher amid US–Vietnam trade deal impact?Gift Nifty futures were trading at 25,584 points at 8:18 am, suggesting an increase from the previous close of 25,574.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-july-3-nse-bse-trading-nykaa-rvnl-nestle-yes-bank-dmart-pnb-2749874-2025-07-03",
      "headline": "Stocks to watch on July 3: Nykaa, RVNL, Nestle, Yes Bank, Dmart, PNBInvestors are now watching company announcements for the April–June quarter results, while developments related to a possible trade deal between India and the United States are also being closely followed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retiring-without-children-here-is-how-to-plan-for-a-comfortable-and-secure-future-2749583-2025-07-02",
      "headline": "Retiring without children? Here's how to plan for a comfortable and secure futureToday, more and more Indians are choosing to remain child-free or find themselves without direct heirs for various reasons. For them, retirement planning isn't just about saving money and building a corpus, it's about securing comfort, care, dignity, and independence in their golden years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-288-points-lower-nifty-settles-below-25-500-tata-steel-down-4-percent-2749530-2025-07-02",
      "headline": "Sensex ends 288 points lower, Nifty settles below 25, 500; Tata Steel down 4%The S&P BSE Sensex was down 287.60 points to end at 83,409.69, while the NSE Nifty50 lost 88.40 points to end at 25,453.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/need-your-uan-heres-how-to-get-it-and-manage-your-pf-smoothly-2749480-2025-07-02",
      "headline": "Need your UAN? Here's how to get it and manage your PF smoothlyThe biggest advantage of a UAN is its permanence. It doesn't change when you change jobs. It ties together all your PF accounts, making fund tracking and management simple and paperless."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/57-percent-of-indians-call-skills-critical-but-skill-frameworks-still-lag-report-2749444-2025-07-02",
      "headline": "57% of Indians call skills critical, but relevant frameworks still lag: ReportAon's 2025 APAC Skills Impact Survey reveals what really matters for Indian firms today. It reveals that for the next two to three years, Indian firms are prioritising talent retention, leadership pipelines, and workforce agility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-expert-explains-how-rs-7-lakh-profit-led-to-a-rs-74000-shock-for-investor-2749447-2025-07-02",
      "headline": "Investor earns Rs 7 lakh, faces Rs 74,000 tax despite Rs 12 lakh limit. Know whySujit Bangar, founder of TaxBuddy.com and a former IRS officer, shared the example on LinkedIn to warn investors against a common misconception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-finance-epfo-pf-account-balance-check-regularly-company-deposit-kyc-issue-money-savings-2749438-2025-07-02",
      "headline": "Don't ignore your EPF: Here's why checking it regularly mattersExperts warn that many salaried employees don't realise until it's too late that their employer hasn't been depositing funds, or that a simple KYC error has locked their money away."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-holidays-july-2025-here-is-what-traders-should-know-nse-bse-holiday-list-2749379-2025-07-02",
      "headline": "Stock market holidays July 2025: Here's what traders should knowBefore you plan your next trade or check your stocks, it helps to know if the market is open. Here's a quick look at whether the NSE and BSE will have any holidays this July."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ekta-kapoor-reacts-smriti-irani-refusing-kyunki-saas-bhi-kabhi-bahu-thi-2-2014-2749934-2025-07-03",
      "headline": "Ekta Kapoor reacts to Smriti Irani's claim of refusing Kyunki 2 in 2014Ekta Kapoor reacted to Smriti Irani's comment on refusing the sequel to 'Kyunki Saas Bhi Kabhi Bahu Thi' in 2014. The show's reboot was originally scheduled for July 3 this year, but has now been postponed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-kbc-was-a-media-quake-says-shows-producer-siddhartha-basu-exclusive-2749933-2025-07-03",
      "headline": "KBC turns 25: Amitabh Bachchan-show was a media quake, says creator Siddhartha Basu'Kaun Banega Crorepati', which launched in 2000, revolutionised Indian television and revitalised Amitabh Bachchan's career. As it marked 25 years, its creator Siddhartha Basu reflected on the show's enduring appeal and its impact on countless lives across the nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-ranbir-kapoor-sai-pallavi-1st-glimpse-today-cast-budget-when-and-where-to-watch-the-epic-promo-2749895-2025-07-03",
      "headline": "Ramayana 1st glimpse today: Cast, budget, when and where to watch the epic promoThe much-anticipated Bollywood reimagining of 'Ramayana', featuring Ranbir Kapoor and Sai Pallavi, promises to captivate audiences with its grand scale, ahead of its first glimpse reveal across nine Indian cities. Here's all you need to know ahead of the mega promo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-fans-photo-london-ramayana-part-1-2749905-2025-07-03",
      "headline": "Ramayana actor Ranbir Kapoor delights fans with photo op in LondonRanbir Kapoor recently made fans' day by taking a photo with them during his holiday in London. The actor has finished shooting for 'Ramayana Part 1' and is currently on vacation with his wife Alia Bhatt, daughter Raha Kapoor and mother Neetu Kapoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kpop-demon-hunters-saja-boys-huntrix-global-reach-bts-2749902-2025-07-03",
      "headline": "KPop Demon Hunters' Saja Boys, Huntrix go global, Even BTS can't resist the hype'KPop Demon Hunters', a Netflix original, has captivated fans worldwide with its unique blend of K-pop culture and fantasy. BTS's endorsement has further boosted its popularity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/post-malone-falls-mid-show-arizona-continues-show-unharmed-2749884-2025-07-03",
      "headline": "Singer Post Malone falls mid-show in Arizona, continues show unharmedSinger Post Malone fell off the stage during his performance at the Arizona concert. A fan captured the moment in the viral clip. The singer escaped unharmed during the incident. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-and-sreeleela-step-out-for-dinner-pose-solo-for-paps-2749891-2025-07-03",
      "headline": "Kartik Aaryan and Sreeleela step out for dinner, pose solo for paps. WatchKartik Aaryan and Sreeleela were seen dining out in Mumbai, stirring interest among fans. They recently wrapped up shooting for their romantic musical with Anurag Basu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vignesh-shivan-slammed-for-working-with-choreographer-jani-master-fans-call-out-nayanthara-2749879-2025-07-03",
      "headline": "Nayanthara, Vignesh Shivan slammed for working with sexual assault accusedTamil director Vignesh Shivan was criticised for working with choreographer Jani Master, who was accused of sexual assault in POCSO case. A few fans pulled up his actor-wife and producer Nayanthara to provide a platform for abusers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sean-diddy-combs-denied-bail-after-mixed-verdict-in-sex-crimes-trial-glbs-2749837-2025-07-03",
      "headline": "Sean 'Diddy' Combs denied bail after mixed verdict in sex crimes trialSean \"Diddy\" Combs remains in custody after a split jury verdict. Acquitted of sex trafficking, he was convicted of transporting individuals for prostitution and faces up to 10 years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/deepika-padukone-makes-history-with-hollywood-walk-of-fame-in-2026-glbs-2749830-2025-07-03",
      "headline": "Deepika Padukone scripts history, to get a star on Hollywood Walk of Fame in 2026Actor Deepika Padukone became the first Indian actress to make it to the Hollywood Walk of Fame's Class of 2026 list, marking a historic achievement in global cinema and representation of Indian talent.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/elnaaz-norouzi-prepared-for-six-months-the-traitors-read-psychology-books-karan-johar-2749643-2025-07-02",
      "headline": "The Traitors: Actor Elnaaz Norouzi prepared for six months, read psychology booksActor Elnaaz Norouzi opened up about her six-month preparation for 'The Traitors' in a recent YouTube video. The actor disclosed reading several books on human psychology. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shanaya-kapoor-opens-up-on-trolls-says-she-reads-negative-comments-to-get-better-2749661-2025-07-02",
      "headline": "Shanaya Kapoor opens up on trolls, says she reads negative comments to get betterAhead of her debut in 'Aankhon Ki Gustaakhiyan', Shanaya Kapoor shared that she actively reads negative comments to understand audience feedback and improve her craft. Despite facing brutal remarks about her appearance, she filters the noise and takes criticism positively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/siddharth-anand-reacts-comparison-of-brad-pitt-f1-with-ta-ra-rum-pum-saif-ali-khan-2749654-2025-07-02",
      "headline": "Internet compares Brad Pitt's F1 to Ta Ra Rum Pum: Director Siddharth Anand reactsDirector Siddharth Anand responded to social media memes that 'Ta Ra Rum Pum' inspired Brad Pitt's 'F1'. The Hollywood drama released in theatres on June 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apoorva-mukhija-on-life-after-the-traitors-i-want-to-get-married-2749676-2025-07-02",
      "headline": "Apoorva Mukhija on life after The Traitors: I want to get marriedApoorva Mukhija shared that she now wants to get married and take a break from reality shows and content creation. Currently, a part of the OTT reality show 'The Traitors', she joked about having a swayamvar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/sean-diddy-combs-convicted-in-sex-abuse-case-but-acquitted-of-trafficking-charges-2749678-2025-07-02",
      "headline": "Sean 'Diddy' Combs not guilty of sex trafficking, convicted on lesser chargeSean 'Diddy Combs' was convicted of a prostitution-related felony but acquitted of sex trafficking and racketeering charges that could have led to a life sentence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-denies-border-2-exit-sardaar-ji-row-shares-video-from-set-2749675-2025-07-02",
      "headline": "Diljit Dosanjh's BTS video dismisses Border 2 exit buzz amid Sardaar Ji 3 backlashDiljit Dosanjh refuted rumours of being replaced in 'Border 2'. The actor shared a video from the sets of the upcoming film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-part-1-laxman-ravi-dubey-most-expensive-indian-film-budget-835-crore-not-vicky-kaushal-ranveer-singh-2749652-2025-07-02",
      "headline": "Meet engineer who is playing main role in India's 1st Rs 835 crore epic filmAn actor known for donning many hats, who transitioned from engineering to television shows, will next be seen in the most expensive Indian film. Married to a famous Indian actor and his business partner, he is not Ranveer Singh or Vicky Kaushal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/heads-of-state-x-review-priyanka-chopra-john-cena-idris-alba-film-perfect-popcorn-action-flick-2749462-2025-07-02",
      "headline": "Heads of State X review: Priyanka Chopra's film is a perfect popcorn action flickMost of the social media users gave 'Heads of State' featuring Priyanka Chopra, John Cena and Idris Alba a thumbs up on X. The film premiered on Prime Video today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/priyanka-chopra-on-her-heads-of-state-role-director-felt-important-to-have-a-woman-2749638-2025-07-02",
      "headline": "Priyanka Chopra on her Heads of State role: Director felt important to have a womanPriyanka Chopra, in an exclusive interview with India Today, spoke about her role in the latest release, 'Heads of State'. The actor even spoke about female-driven roles in cinema. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jaishankar-us-bill-tariffs-countries-buying-oil-russia-sanctions-india-impact-2749920-2025-07-03",
      "headline": "Have to cross that bridge: Jaishankar on US plan to tax top Russian oil buyersThe new US bill, introduced in the Senate, proposes a 500% tariff on countries that import from Russia. India is a large importer of crude oil from Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amid-backlash-ban-on-several-pak-social-media-accounts-reinstated-day-after-restrictions-were-lifted-2749865-2025-07-03",
      "headline": "Ban on Pak social media accounts reinstated again amid backlashThe Instagram and Twitter profiles of Pakistani celebrities such as Hania Aamir, Shahid Afridi and Mahira Khan once again became inaccessible to Indian users."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/mark-zuckerberg-oval-office-visit-asked-to-leave-white-house-denies-facebook-trump-2749914-2025-07-03",
      "headline": "Did Mark Zuckerberg gatecrash Oval Office meeting? White House explains incidentMark Zuckerberg allegedly stepped into an Oval Office F-47 briefing in March but was told to wait outside over security concerns — a claim the White House denied, calling the incident 'mischaracterised'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/tech-layoffs-microsoft-ibm-intel-continue-to-cut-jobs-over-1-lakh-jobs-slashed-in-2025-2749906-2025-07-03",
      "headline": "Microsoft, IBM, Intel continue to cut jobs, over 1 lakh jobs slashed in 2025More than 100,000 tech jobs have been lost in 2025 so far, with major players like Microsoft, Intel, and Google making deep cuts amid cost pressures, restructuring, and AI-driven transformation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-shubman-gill-edgbaston-century-classic-2749873-2025-07-03",
      "headline": "Shubman Gill's symphony at Edgbaston: Abbey Road, not autotuneENG vs IND, 2nd Test: At Edgbaston, Shubman Gill crafted a well-compiled 114  not out off 216 balls, leading India's batting charge on a topsy-turvy day. Calm and unhurried, Gill batted with remarkable control to bring up his second century as Test captain in as many matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/pune/story/man-posing-as-delivery-agent-rapes-pune-woman-clicks-selfie-on-her-phone-2749947-2025-07-03",
      "headline": "Man posing as delivery agent rapes Pune woman, clicks selfie to threaten herThe man also took a selfie on the woman's mobile phone and allegedly wrote a threatening message, according to DCP Shinde."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-bound-air-india-dreamliner-flight-held-back-during-vienna-fuel-stop-after-check-throws-up-issue-2749913-2025-07-03",
      "headline": "US-bound Air India flight grounded in Vienna after issue detected during fuel stopRoutine checks during a planned Vienna fuel stop forced Air India's Delhi-Washington flight to stay grounded, leaving passengers stranded."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/disguised-as-rider-maharashtra-minister-busts-illegal-bike-taxis-in-mumbai-2749910-2025-07-03",
      "headline": "Disguised as rider, Maharashtra minister busts illegal bike taxis in MumbaiMinister booked a ride under an unknown name through the Rapido app and within ten minutes, a bike arrived at Shaheed Babu Genu Chowk in Mantralaya. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/many-indian-abroad-us-uk-reject-label-south-asian-heres-why-pakistan-bangladesh-achievement-crime-bias-2749472-2025-07-03",
      "headline": "Snatching Diwali, giving sex-gang tag: Indians abroad reject South-Asian labelThe Indian diaspora in the UK and the US are rejecting the term 'South Asian', calling it reductive and misleading. They argue it erases India's distinct civilisational identity, lumps together vastly different communities, and leads to both cultural appropriation and unfair blame for organised crimes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/unified-gcc-tourist-visa-for-six-gulf-nations-to-launch-soon-what-to-know-glbs-2749831-2025-07-03",
      "headline": "Unified GCC tourist visa for six Gulf nations to launch soon: What to knowA single-entry visa that permits visitors to enter six Gulf nations with a single permit is being introduced by the Gulf Cooperation Council (GCC). It will be valid for 30 to 90 days. A valid passport, a photo, travel information, and evidence of housing and financial support are required for online applications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indians-abducted-amid-al-qaeda-linked-terrorist-attack-in-mali-government-calls-for-safe-release-2749854-2025-07-03",
      "headline": "3 Indians abducted by Al Qaeda-linked terrorists in Mali, rescue efforts underwayAl-Qaeda-linked Jama'at Nusrat al-Islam wal-Muslimin, suspected in the Mali abduction, has carried out multiple attacks across the West African nation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-zohran-mamdani-hits-back-deportation-threats-us-new-york-2749900-2025-07-03",
      "headline": "He is attacking me because…: Zohran Mamdani on Trump's deportation threatMamdani posted a video on his social media handle and vowed not to back down, declaring that he would continue his work and \"fight back\" against Trump's efforts to silence dissent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-pulls-out-chinese-staff-from-plants-south-india-iphone-production-takes-hit-report-2749935-2025-07-03",
      "headline": "Inside China's quiet move to disrupt iPhone production in IndiaThe latest model, the iPhone 17, was to be a huge step in Apple's plans to make India its second home for high-end production. That roadmap now looks uncertain as Foxconn has pulled out Chinese staff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/rs-800-crore-joining-bonus-once-in-accenture-iitian-trapit-bansal-has-joined-meta-ai-superintelligence-team-2749437-2025-07-02",
      "headline": "Rs 800 crore bonus? Top IITian Trapit Bansal joins Meta AI superintelligence teamTrapit Bansal, an IIT-Kanpur alumnus and former OpenAI researcher, has joined Meta's new AI superintelligence team, bringing his deep learning and reasoning expertise to Zuckerberg's ambitious frontier model effort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/woman-teen-son-found-dead-in-delhis-lajpat-nagar-servant-arrested-2749915-2025-07-03",
      "headline": "Househelp murders woman, teen in Delhi's Lajpat Nagar after she scolds himThe main suspect, identified as Mukesh, 24, originally from Bihar and currently residing in nearby Amar Colony, was employed by the Sewanis as a driver and helper in their shop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/deepika-padukone-makes-history-with-hollywood-walk-of-fame-in-2026-glbs-2749830-2025-07-03",
      "headline": "Deepika Padukone scripts history, to get a star on Hollywood Walk of Fame in 2026Actor Deepika Padukone became the first Indian actress to make it to the Hollywood Walk of Fame's Class of 2026 list, marking a historic achievement in global cinema and representation of Indian talent.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kpop-demon-hunters-saja-boys-huntrix-global-reach-bts-2749902-2025-07-03",
      "headline": "KPop Demon Hunters' Saja Boys, Huntrix go global, Even BTS can't resist the hype'KPop Demon Hunters', a Netflix original, has captivated fans worldwide with its unique blend of K-pop culture and fantasy. BTS's endorsement has further boosted its popularity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-yashasvi-jaiswal-achilles-heel-pujara-2749918-2025-07-03",
      "headline": "What's Yashasvi Jaiswal's Achilles heel? Cheteshwar Pujara weighs inENG vs IND: Yashasvi Jaiswal scored 87 runs off 107 balls as India posted 310 for five at Stumps on Day 1 of their second Test at the Edgbaston in Birmingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/west-bengal-bar-council-cancels-license-of-kolkata-rape-accused-manojit-mishra-2749866-2025-07-03",
      "headline": "Kolkata rape accused Manojit Mishra's lawyer license cancelledThe Bar Council acted seven days after receiving a formal complaint regarding the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-congratulates-ncb-busting-global-drug-cartel-us-thanks-india-2749847-2025-07-03",
      "headline": "Amit Shah congratulates narcotics bureau for busting global drug cartelAmit Shah congratulated the Narcotics Control Bureau (NCB) global drug cartel bust in which eight people were arrested. The US and Australia acted on India's leads in Operation Med Max involving crypto, drop-shipping and digital trafficking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/teacher-organises-ramp-walk-for-students-in-classroom-adorable-video-goes-viral-2749492-2025-07-02",
      "headline": "Teacher organises ramp walk for students in classroom. Adorable video goes viralThe viral video shows students taking turns strutting down the aisle between desks like a runway, while their classmates cheered for them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-receives-ghanas-national-honour-officer-of-the-order-of-the-star-2749838-2025-07-03",
      "headline": "PM Modi receives Ghana's national honour 'Officer of the Order of the Star'PM Narendra Modi received Ghana's national honour 'Officer of the Order of the Star' for global leadership during the historic state visit, the first by an Indian PM in three decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vignesh-shivan-slammed-for-working-with-choreographer-jani-master-fans-call-out-nayanthara-2749879-2025-07-03",
      "headline": "Nayanthara, Vignesh Shivan slammed for working with sexual assault accusedTamil director Vignesh Shivan was criticised for working with choreographer Jani Master, who was accused of sexual assault in POCSO case. A few fans pulled up his actor-wife and producer Nayanthara to provide a platform for abusers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-soham-parekh-the-indian-techie-accused-of-moonlighting-in-us-2749908-2025-07-03",
      "headline": "Who is Soham Parekh, the Indian techie accused of moonlighting by US startups?Soham Parekh, who is believed to be based in India, is alleged to have simultaneously worked at up to four or five startups—many of them backed by Y Combinator—raising questions about hiring practices in remote-first tech culture."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-yashasvi-jaiswal-press-conference-2nd-test-day-1-2749929-2025-07-03",
      "headline": "Shubman Gill has been an amazing captain, says Yashasvi JaiswalENG vs IND, 2nd Test: Yashasvi Jaiswal praised captain Shubman Gill, who scored a dogged hundred off 199 balls. It was his back-to-back centuries for the Indian skipper, having scored one on his Test captaincy debut in Leeds.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-yashasvi-jaiswal-achilles-heel-pujara-2749918-2025-07-03",
      "headline": "What's Yashasvi Jaiswal's Achilles heel? Cheteshwar Pujara weighs inENG vs IND: Yashasvi Jaiswal scored 87 runs off 107 balls as India posted 310 for five at Stumps on Day 1 of their second Test at the Edgbaston in Birmingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-chris-woakes-umpiring-calls-edgbaston-2749912-2025-07-03",
      "headline": "Chris Woakes not happy with close umpiring calls in Edgbaston TestENG vs IND: Chris Woakes was not happy with a couple of umpiring decisions that didn't go in his favour on the opening day of the second Test in Birmingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-gautam-gambhir-selection-calls-edgbaston-2749893-2025-07-03",
      "headline": "Tough talk, tame tactics: Gambhir faces heat over Edgbaston Test selection callsEngland vs India, 2nd Test: India head coach Gautam Gambhir's bold words after the Headingley Test defeat rang hollow at Edgbaston, where India's defensive team selection for the Edgbaston Test exposed a growing gap between his statements and actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-2nd-test-steve-smith-finger-injury-slip-cordon-2749880-2025-07-03",
      "headline": "Steve Smith back for second Test after speedy finger injury recoverySteve Smith is named in Australia's playing XI for the second Test against West Indies after a swift recovery from a dislocated finger. Australia will be playing in Grenada for the first time in Test cricket history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-shubman-gill-edgbaston-century-classic-2749873-2025-07-03",
      "headline": "Shubman Gill's symphony at Edgbaston: Abbey Road, not autotuneENG vs IND, 2nd Test: At Edgbaston, Shubman Gill crafted a well-compiled 114  not out off 216 balls, leading India's batting charge on a topsy-turvy day. Calm and unhurried, Gill batted with remarkable control to bring up his second century as Test captain in as many matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-yashasvi-jaiswal-captain-shubman-gill-2749859-2025-07-03",
      "headline": "Shubman Gill has clear plans, there's no confusion: Yashasvi on selection chatterENG vs IND, 2nd Test: Yashasvi Jaiswal said that captain Shubman Gill has clear plans for the Indian team and there is no confusion regarding team selection for the Edgbaston Test. Jasprit Bumrah was rested for the game and Kuldeep Yadav was left out, leading to a lot of noise on Day 1 regarding the call."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-jasmine-paolini-carlos-alcaraz-emma-raducanu-2749820-2025-07-03",
      "headline": "Jasmine Paolini stunned in Round 2, Alcaraz, Raducanu progressWimbledon 2025: Kamilla Rakhimova handed Jasmine Paolini a shock defeat, winning in three sets. Emma Raducanu and Carlos Alcaraz secured their berths in the third round of the grass court major. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-rohan-bopanna-yuki-bhambri-rithvik-bollipalli-2749816-2025-07-03",
      "headline": "Rohan Bopanna crashes out, Yuki Bhambri, Rithvik Bollipalli advanceWimbledon 2025: Yuki Bhambri and Rithvik Bollipalli made their way through to the second round of men's doubles, but veteran Rohan Bopanna failed to go beyond the opening round. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/carlsen-questions-gukesh-rapid-blitz-skills-superunited-rapid-blitz-croatia-2025-2749804-2025-07-02",
      "headline": "Carlsen makes bold assessment of Gukesh at Grand Chess: One of weaker playersMagnus Carlsen has made a bold statement about reigning world champion Gukesh, questioning the teenager's credentials in faster formats by saying the youngest classical world champion in history \"hasn't done anything to indicate he's going to do well in such a tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-day-1-report-shubman-gill-hundred-edgbaston-2749791-2025-07-02",
      "headline": "Day 1: Shubman Gill's hundred takes spotlight off selection scrutinyEngland vs India, 2nd Test: Captain Shubman Gill scored a superb century to help India recover from a mini-collapse at the start of the final session. India ended Day 1 on 310 for 5, with Gill and Ravindra Jadeja (41) sharing a crucial 99-run unbeaten partnership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-yashasvi-jaiswal-captain-shubman-gill-2749859-2025-07-03",
      "headline": "Shubman Gill has clear plans, there's no confusion: Yashasvi on selection chatterENG vs IND, 2nd Test: Yashasvi Jaiswal said that captain Shubman Gill has clear plans for the Indian team and there is no confusion regarding team selection for the Edgbaston Test. Jasprit Bumrah was rested for the game and Kuldeep Yadav was left out, leading to a lot of noise on Day 1 regarding the call."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-jasmine-paolini-carlos-alcaraz-emma-raducanu-2749820-2025-07-03",
      "headline": "Jasmine Paolini stunned in Round 2, Alcaraz, Raducanu progressWimbledon 2025: Kamilla Rakhimova handed Jasmine Paolini a shock defeat, winning in three sets. Emma Raducanu and Carlos Alcaraz secured their berths in the third round of the grass court major. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-rohan-bopanna-yuki-bhambri-rithvik-bollipalli-2749816-2025-07-03",
      "headline": "Rohan Bopanna crashes out, Yuki Bhambri, Rithvik Bollipalli advanceWimbledon 2025: Yuki Bhambri and Rithvik Bollipalli made their way through to the second round of men's doubles, but veteran Rohan Bopanna failed to go beyond the opening round. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/carlsen-questions-gukesh-rapid-blitz-skills-superunited-rapid-blitz-croatia-2025-2749804-2025-07-02",
      "headline": "Carlsen makes bold assessment of Gukesh at Grand Chess: One of weaker playersMagnus Carlsen has made a bold statement about reigning world champion Gukesh, questioning the teenager's credentials in faster formats by saying the youngest classical world champion in history \"hasn't done anything to indicate he's going to do well in such a tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-day-1-report-shubman-gill-hundred-edgbaston-2749791-2025-07-02",
      "headline": "Day 1: Shubman Gill's hundred takes spotlight off selection scrutinyEngland vs India, 2nd Test: Captain Shubman Gill scored a superb century to help India recover from a mini-collapse at the start of the final session. India ended Day 1 on 310 for 5, with Gill and Ravindra Jadeja (41) sharing a crucial 99-run unbeaten partnership."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}