{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-credit-history-how-lenders-are-opening-doors-for-new-borrowers-2777127-2025-08-26",
      "headline": "No credit history? How lenders are opening doors for new borrowersFor decades, a blank credit history meant a closed door to loans. Now, fintechs and banks are rewriting the rules—using digital footprints and alternative data to bring first-time borrowers into the fold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pmo-holds-high-level-meet-on-us-tariff-impact-explores-relief-for-exporters-2777081-2025-08-26",
      "headline": "PM holds high-level meet on US tariff impact, explores relief for exportersThe PMO on Tuesday held a high-level meeting with senior ministers and officials from the Finance and Commerce Ministries to frame India's response to the US decision to double tariffs on Indian goods to 50% from Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-acts-password-override-privacy-threat-or-necessary-power-2777086-2025-08-26",
      "headline": "New Income Tax Act's password override: Privacy threat or necessary power?India's new tax law brings a digital twist; officials can now override passwords during raids. Supporters say it's just enforcement in the digital age, but privacy advocates worry about unchecked surveillance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-us-tariff-sensex-loses-849-points-nifty-below-24750-tata-steel-down-3-percent-2777012-2025-08-26",
      "headline": "Sensex slumps 849 points, Nifty below 24,750; Tata Steel down 3%The S&P BSE Sensex tanked 849.37 points to close at 80,786.54, while the NSE Nifty50 lost 255.70 points to end at 24,712.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-notice-rs-258-crore-recuced-to-zero-money-saving-section-54-land-sell-property-buy-2776992-2025-08-26",
      "headline": "Woman got tax notice of Rs 2.58 crore. Here's how she reduced it to Rs 0Seema found herself staring at a tax notice of Rs 2.58 crore after selling a piece of land in Patna. The confusion arose due to a simple error in her tax return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-25-percent-august-27-impact-economy-export-pmo-meeting-modi-government-textile-gems-pharma-2776931-2025-08-26",
      "headline": "Trump's 50% tariff takes effect tomorrow: Who wins, who losesThe United States government has issued a draft notification confirming the step, which will be applied through a supplementary 25% duty on top of existing tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-india-really-needs-to-become-viksit-bharat-by-2047-2776887-2025-08-26",
      "headline": "What India really needs to become 'Viksit Bharat' by 2047IndiaToday.in reached out to leading economists to understand what India must do over the next two decades to achieve its 'Viksit Bharat' vision. Here's what they had to say."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdfc-bank-shares-crash-over-50-percent-why-bonus-issue-did-it-really-fall-2776872-2025-08-26",
      "headline": "HDFC Bank share crash explained: Did it actually fall over 50%?HDFC Bank's shares appeared to have tanked over 50% compared to the previous close on Dalal Street in early trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/switching-from-ups-unified-pension-scheme-to-nps-national-pension-scheme-here-is-what-employees-must-know-2776864-2025-08-26",
      "headline": "Switching from UPS to NPS? Here's what employees must knowCentral government employees now have a one-time chance to switch from the Unified Pension Scheme (UPS) to the National Pension System (NPS). But the move comes with strict rules, deadlines, and conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/simplified-new-tax-rules-and-formswhat-you-need-to-know-2776823-2025-08-26",
      "headline": "Simplified, new tax rules and forms: What you need to knowThe Income Tax department is working on new rules and forms under the Income-tax Act, 2025, which will be notified by December-end to ensure a smoother, simpler process for taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-farming-crisis-india-farmers-low-prices-production-fall-pest-msp-govt-prices-yield-2776817-2025-08-26",
      "headline": "Once 'white gold', cotton turns into burden for India's farmersAt present, cotton cultivation area, production, and productivity are all going down. In just two years, the cotton cultivation area has fallen by 14.8 lakh hectares, while production has dropped by 42.35 lakh bales. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-down-why-us-tariff-august-27-pharma-financial-shares-decline-pmo-meet-modi-2776775-2025-08-26",
      "headline": "Sensex crashes 900 points: Why is stock market down today?The BSE Sensex showed a negative start as trading commenced today, with most stocks tanking at the opening bell. Sensex and Nifty fell nearly 1% a few minutes after opening for trading. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/harry-styles-and-zoe-kravitz-dating-rome-walk-2777019-2025-08-26",
      "headline": "Are Harry Styles and Zoe Kravitz dating? Their Rome walk has fans guessingSinger Harry Styles and actor Zoe Kravitz were seen holding hands in Rome, setting off dating rumours after a paparazzi video made the rounds on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-the-epic-teaser-ss-rajamouli-prabhas-rana-daggubati-anushka-shetty-tamannaah-bhatia-2777108-2025-08-26",
      "headline": "Baahubali The Epic teaser: Prabhas-starrer is a trip down memory laneThe teaser for 'Baahubali: The Epic', starring Prabhas, Rana Daggubati, Anushka Shetty and Tamannaah Bhatia, was released on Tuesday. Directed by SS Rajamouli, the film is set for a release on October 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hridayapoorvam-trailer-mohanlal-next-is-a-festive-mix-of-comedy-love-and-emotion-2777146-2025-08-26",
      "headline": "Hridayapoorvam trailer: Mohanlal's next is a festive mix of comedy, love and emotionMohanlal's latest film 'Hridayapoorvam' promises a feel-good narrative, releasing on August 28 during Onam festivities. The trailer hints at a humorous yet touching journey post heart surgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-bollywood-couples-arent-waiting-too-long-to-start-families-anymore-2777010-2025-08-26",
      "headline": "Why Bollywood couples aren't waiting too long to start families anymoreParineeti Chopra-Raghav Chadha joining the new wave of Bollywood couples embracing early parenthood reflects a broader shift in attitudes towards balancing career and family life. This change, influenced by evolving societal norms and post-pandemic perspectives, celebrates openness and the choice to prioritise love and legacy without delay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonam-bajwa-akeli-laila-baaghi-4-song-tiger-shroff-2777009-2025-08-26",
      "headline": "Sonam Bajwa is Bollywood's Akeli Laila in Baaghi 4 dance number. WatchActor Sonam Bajwa featured in the latest song of 'Baaghi 4' titled 'Akeli Laila', which released on Tuesday. The dance number also gives a glimpse into the action sequences of Tiger Shroff. 'Baaghi 4' is scheduled for a theatrical release on September 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sophie-turner-defends-game-of-thrones-controversial-rape-scene-on-women-struggles-patriarchy-trigger-warnings-2777038-2025-08-26",
      "headline": "Sophie Turner says Game of Thrones rape scene was triggering, highlighted patriarchySophie Turner reflected on the controversial rape scene in 'Game of Thrones'. She supported the show's portrayal of women's struggles, and suggested adding trigger warnings if released today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-anniversary-wish-for-kirron-has-outlander-twist-2776958-2025-08-26",
      "headline": "Anupam Kher's loving anniversary wish for Kirron has Outlander twist. WatchAnupam Kher and Kirron Kher celebrated their 40th wedding anniversary with Instagram posts, recalling cherished memories and their journey together. Anupam shared a special Outlander video that once uplifted Kirron, while she called him her best friend and life partner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-shares-note-on-privacy-photos-of-under-construction-home-go-viral-2777079-2025-08-26",
      "headline": "Alia Bhatt shares note on privacy as pics of her under construction home go viralActor Alia Bhatt shared a note on privacy and consent after photos of her under-construction home went viral. She called out the paparazzi with regard to a serious privacy and security breach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/farrhana-bhatt-bigg-boss-19-kashmir-image-change-2777061-2025-08-26",
      "headline": "Farrhana Bhatt hopes Bigg Boss 19 changes Kashmir's perceptionFarrhana Bhatt joins 'Bigg Boss 19' to represent Kashmir and its unique culture. In an exclusive chat with India Today, Bhatt said that she aims to change the state's image while embracing the show's political theme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rima-kallingal-kerala-film-critics-award-theatre-the-myth-of-reality-media-focus-amma-2777022-2025-08-26",
      "headline": "Rima Kallingal slams media focus on Malayalam film body: I'm an artist firstMalayalam actor Rima Kallingal has voiced her frustration at the media for overlooking her Kerala Film Critics Award win for 'Theatre: The Myth of Reality'. Despite her acclaimed performance, questions centred on AMMA's internal matters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-directorial-debut-yogi-babu-film-launches-production-house-2777050-2025-08-26",
      "headline": "Actor Ravi Mohan turns director with Yogi Babu film, announces production line-upActor Ravi Mohan launched his production house, Ravi Mohan Studios, with various projects. He will also direct his first film under his banner, which will feature Yogi Babu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/madharaasi-can-sivakarthikeyan-and-ar-murugadoss-break-tamil-cinemas-star-curse-2777044-2025-08-26",
      "headline": "Madhuaraasi: Can Sivakarthikeyan and AR Murugadoss break Tamil cinema's star curse?As big-budget star vehicles falter in Tamil cinema, all eyes turn to Sivakarthikeyan and AR Murugadoss' 'Madharaasi', which will hit theatres on September 5. Will the film strike gold at the box office?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-viral-moment-elderly-woman-tells-amitabh-bachchan-honeymoon-wedding-plans-2776934-2025-08-26",
      "headline": "KBC 17 viral moment: Elderly woman tells Big B honeymoon-wedding plans, wins heartsAn elderly woman, who was a contestant on 'Kaun Banega Crorepati 17', is winning hearts on social media for her adorable plans to spend the prize money. The contestant expressed her desire to have a destination wedding to mark her 42nd anniversary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyami-kher-joins-akshay-kumar-saif-ali-khan-haiwaan-shoot-kochi-priyadarshan-oppam-2776964-2025-08-26",
      "headline": "Actor Saiyami Kher joins Akshay and Saif in Haiwaan: Grateful to be a small partActor Saiyami Kher has joined the cast of director Priyadarshan's 'Haiwaan', while commencing the shoot in Kochi. The film reunites actors Akshay Kumar and Saif Ali Khan 17 years after 'Tashan' (2008)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anupama-parameswaran-defends-paradha-film-criticism-gender-bias-box-office-2776996-2025-08-26",
      "headline": "Anupama Parameswaran calls out criticism of Paradha: Don't be too negativeActor Anupama Parameswaran addressed negative reviews of her film 'Paradha', highlighting perceived biases in film criticism. The film, directed by Praveen Kandregula, is about three women realising their true potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-sathyan-anthikad-hridayapoorvam-release-28-august-malavika-mohanan-2776977-2025-08-26",
      "headline": "Mohanlal, Sathyan Anthikad are dream duo: Hridayapoorvam actor Malavika Mohanan'Petta' actor Malavika Mohanan, who will be starring opposite Malayalam superstar Mohanlal in veteran director Sathyan Anthikad's 'Hridhayapoorvam', called the actor-director duo a dream duo to work with. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/srk-taunts-farah-khan-for-teaching-better-dance-to-her-cook-dilip-2777011-2025-08-26",
      "headline": "Jealous SRK taunts Farah Khan for teaching better dance to her cook DilipActor Shah Rukh Khan reacted to Farah Khan's cook Dilip's dancing skills. He shared a humorous post about not being able to dance like Dilip even after 30 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-learns-bengali-inspired-by-aparna-sen-revealed-shruti-haasan-2776976-2025-08-26",
      "headline": "Kamal Haasan learnt Bengali as he was in love with Aparna Sen, says daughter ShrutiActor Shruti Haasan, in a recent interaction with Sathyaraj, disclosed her father, Kamal Haasan's reason for learning Bengali. She laughed it off, saying that he did not learn Bengali due to love for work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/simran-30-years-cinema-bollywood-challenges-tamil-successes-2776919-2025-08-26",
      "headline": "Simran on work in Bollywood: Still asked for test reels, paid far less than South'Tourist Family' actor Simran recently expressed discontent with her treatment in Bollywood despite having an extensive body of work and a career spanning over 30 years across various film industries in India."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/5-killed-14-injured-due-to-landslides-on-vaishno-devi-yatra-route-amid-heavy-rain-in-jk-2777128-2025-08-26",
      "headline": "5 killed in landslides on Vaishno Devi Yatra route amid heavy rain in J&KA heavy downpour triggered a landslide on the route to the Mata Vaishno Devi shrine atop Jammu and Kashmir's Trikuta hills, leaving at least five dead and 14 injured."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-refused-donald-trump-calls-four-times-in-recent-weeks-german-newspaper-frankfurter-allgemeine-faz-2777026-2025-08-26",
      "headline": "Modi refused Trump's calls 4 times in recent weeks: German newspaperUS President Donald Trump tried to talk to Indian Prime Minister Narendra Modi four times in recent weeks amid a raging trade dispute, but the Indian leader refused to talk, according to German newspaper Frankfurter Allgemeine. This demonstrates the anger and caution in New Delhi, suggests the Mainz-based newspaper of record."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/4-dead-vaishno-devi-yatra-suspended-as-heavy-rains-landslides-hit-india-2777109-2025-08-26",
      "headline": "Floods ravage Himachal, landslides in J&K, Arunachal amid heavy rain; 9 dead Over the past 48 hours, nature's fury has been particularly unforgiving in the hill states of Jammu & Kashmir and Himachal Pradesh, where rivers have surged past danger marks, homes have been swept away, roads washed out, and entire communities cut off. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-collegium-patna-high-court-vm-pancholi-elevation-justice-nagarathna-dissent-regional-seniority-2776981-2025-08-26",
      "headline": "Collegium split over top court pick, dissenting judge cites 'regional imbalance'The Supreme Court Collegium's decision recommending the elevation of Patna High Court Chief Justice VM Pancholi to the top court was reportedly not unanimous, with one of the five members dissenting on grounds of regional representation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/africa-india-map-distortion-global-south-europe-correcting-mercator-equal-earth-projection-campaign-explained-2776606-2025-08-26",
      "headline": "What's wrong with Africa's map? Does it concern India too?The African Union has intensified a campaign for the use of the \"right map of Africa\". In the widely used Mercator map, Africa appears smaller than it is. In a bid to depict the continent's relative size accurately, African leaders are challenging the outdated colonial perspectives for fairer perceptions in education, media, and policy. Should India, which is also depicted smaller than it is, take it up?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/why-donald-trump-silently-switched-laws-in-india-tariff-case-ieepa-us-court-ruling-tax-rate-duties-russia-war-oil-2768888-2025-08-26",
      "headline": "Why Trump was forced to silently switch laws in India tariff caseIn April, US President Trump used a national emergency law from 1977 to impose tariffs against India and other countries. However, a legal challenge, which is ongoing, forced him to silently switch to a 1962 law to enforce the tariffs. Can the case against the use of the 1977 law have bearings on Trump's tariffs?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/samay-raina-apology-india-got-latent-supreme-court-case-disability-2777163-2025-08-26",
      "headline": "No intent to offend: Samay Raina says sorry in Supreme Court for mocking disabledSamay Raina apologised and clarified that his intent was never to ridicule but to promote inclusivity, while pledging greater care in future performances and shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/rss-red-flag-harassment-of-bengali-migrants-a-self-goal-against-mamata-2777138-2025-08-26",
      "headline": "RSS red-flag: Harassment of Bengali migrants a self-goal against MamataFor the RSS, in the run-up to Bengal polls, it is as important to reinforce its ideology on Bangladeshi infiltration as to project sensitivity towards Bengali cultural pride"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/congundrum-why-dk-shivakumar-cant-wont-jump-ship-2777017-2025-08-26",
      "headline": "Cong-undrum: Why DK Shivakumar can't, won't jump shipWhat makes DK Shivakumar stand apart is his identity as a fighter. He is deeply invested in the Congress and involved in its struggles, but his singing of the RSS anthem in the Karnataka Assembly has spawned a tsunami of speculation. Calling the Gandhi family his \"God\", Shivakumar said he was ready to apologise if the recital hurt anyone, while reaffirming his loyalty to the Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/power-optics-xi-to-host-putin-pm-modi-in-show-of-solidarity-amid-trump-trade-war-2776959-2025-08-26",
      "headline": "Xi set to host Putin, PM Modi in show of solidarity amid Trump's tariff threatsAhead of the SCO summit, experts pointed out that while bloc expansion will be a key focus, the mega-event will also serve as Xi Jinping's way of showing the US a mirror of the emerging new world order."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manali-kulli-flood-leh-highway-roads-beas-hotel-houses-dextroyed-himachal-2777025-2025-08-26",
      "headline": "Flood fury in Manali, raging Beas waters wash away portion of Leh highwayHeavy rain in Manali caused the Beas River to overflow, triggering floods and landslides that swept away homes, shops, and a hotel, while cutting off highways and inundating several residential areas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-exclusive-regrets-selection-saurashtra-2777107-2025-08-26",
      "headline": "No regrets over last 2 years, proud to have played 100 Tests for India: PujaraIn an exclusive interview, Cheteshwar Pujara said he took the decision to retire a week after contemplating the big call. The Test specialist added that he has no regrets about his career, including the last two years when he was not selected for the senior national team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/stevia-monk-fruit-jaggery-sugar-sucrose-which-sweetener-belongs-in-your-diet-2777029-2025-08-26",
      "headline": "Stevia, monk fruit, jaggery: Which sugar belongs in your diet?The first thing to understand is that there's no such thing as \"healthy\" sugar. Honey and jaggery are still considered free sugars, which your body processes just like table sugar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/ap-rajahmundry-ragging-case-class-10-student-branded-with-hot-iron-by-hostel-mates-2777164-2025-08-26",
      "headline": "Class 10 Andhra Pradesh boy branded with hot iron by hostel mates in ragging caseA Class 10 student from Andhra Pradesh's Rajahmundry was allegedly tortured by his hostel mates, who branded him with a hot iron box, sparking outrage and a police investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/justice-sharad-kumar-sharma-recuses-nclat-case-judicial-influence-insolvency-2777006-2025-08-26",
      "headline": "Tribunal judge opts out of insolvency case, cites 'higher judiciary' pressureJustice Sharad Kumar Sharma of the National Company Law Appellate Tribunal recused himself from a case after receiving a request for a favourable order from a senior judiciary member, prompting procedural changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-navy-commissions-multi-mission-stealth-frigates-ins-udaygiri-and-ins-himgiri-in-visakhapatnam-2777002-2025-08-26",
      "headline": "Navy commissions two advanced stealth frigates in major boost to defence capabilitiesThe event at the Eastern Naval Command marks the first time that two frontline surface combatants, built at two different Indian shipyards, have been commissioned simultaneously. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-bollywood-couples-arent-waiting-too-long-to-start-families-anymore-2777010-2025-08-26",
      "headline": "Why Bollywood couples aren't waiting too long to start families anymoreParineeti Chopra-Raghav Chadha joining the new wave of Bollywood couples embracing early parenthood reflects a broader shift in attitudes towards balancing career and family life. This change, influenced by evolving societal norms and post-pandemic perspectives, celebrates openness and the choice to prioritise love and legacy without delay."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/noida-dowry-death-accused-husband-vipin-had-an-affair-hit-lover-after-wife-nikki-caught-them-2776804-2025-08-26",
      "headline": "Noida dowry death: Accused husband had an affair, hit lover after wife caught themIn her complaint, the woman alleged that Vipin and his friend Tushar called her outside her village, forced her into their vehicle, and drove away. She further claimed that they physically assaulted her, verbally abused her, and snatched her phone. She also stated that Vipin and his friend threatened to kill her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/viral-video-links-amul-girl-to-shobha-tharoor-srinivasan-but-heres-what-the-brand-says-2776963-2025-08-26",
      "headline": "The real story behind Amul's utterly butterly girlA viral rumour claimed the Amul Girl was modelled after Shobha Tharoor Srinivasan, the sister of politician Shashi Tharoor. But Amul confirmed that she was the unique creation of Sylvester daCunha and his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/a-pet-for-your-lonely-soul-must-dos-before-adopting-one-2777126-2025-08-26",
      "headline": "A pet for your lonely soul? Must-dos before adopting oneA study says most Indians feel pets boost mental wellbeing, but experts caution that an unprepared pet parent might end up more stressed than happy"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/new-world-screwworm-flesh-eating-parasite-infection-first-human-case-confirmed-in-us-from-el-salvador-travel-2777072-2025-08-26",
      "headline": "First human case of flesh-eating parasite confirmed in US: What is it?The US has confirmed its first human case of New World screwworm parasite infestation. Authorities warn of potential livestock risks and advise travellers to take precautions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-goa-india-host-schedule-2777165-2025-08-26",
      "headline": "Goa to host Chess World Cup as showpiece event returns to India after 23 yearsThe Chess World Cup has returned to India after 23 years with Goa set to host the upcoming event later this year from October 30 to November 27. 206 participants are set to battle for a massive USD 2,000,000 prize money. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/long-before-the-silk-road-indias-golden-road-to-china-2775857-2025-08-26",
      "headline": "Cholas and Pallavas traded with China centuries ago, coins tell the storyCoins found in the territories of the Cholas (Thanjavur, Thallikottai) recall an age when the Bay of Bengal was a maritime highway, carrying silk and spices, and connecting the Tamil shores with China. The maritime route not only flourished with trade but also carried cultural influence across Southeast Asia. This route may well be described as the 'Golden Road' that transformed the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/will-delhis-fee-regulation-bill-bring-an-end-to-parents-fee-woes-2777049-2025-08-26",
      "headline": "Delhi's anti-fee hike law is here. But will parents really feel the change?School fees in Delhi are rising faster than report cards, but parents are finally getting some relief thanks to the new fee regulation bill. But will the new anti-fee hike law really stop the pinch?"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-buchi-babu-back-to-back-centuries-india-selectors-comeback-2777172-2025-08-26",
      "headline": "Sarfaraz sends message to India selectors with successive Buchi Babu 100s\fBack-to-back centuries in the Buchi Babu Tournament have reignited Sarfaraz Khan's push for an India Test comeback. The Mumbai batter is seizing opportunities amid middle-order vacancies ahead of the home series against the West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-beats-kaloyana-nalbantova-second-round-bwf-world-championships-2025-2777171-2025-08-26",
      "headline": "PV Sindhu shakes off slow start to ease into second roundPV Sindhu came up with a solid show in the opening round of BWF World Championships 2025. After a sluggish start, the 2019 champion outclassed Bulgaria's Kaloyana Nalbantova 23-21, 21-6 to ease into the second round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-goa-india-host-schedule-2777165-2025-08-26",
      "headline": "Goa to host Chess World Cup as showpiece event returns to India after 23 yearsThe Chess World Cup has returned to India after 23 years with Goa set to host the upcoming event later this year from October 30 to November 27. 206 participants are set to battle for a massive USD 2,000,000 prize money. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/cadillac-2026-bottas-perez-lineup-horner-rumours-2777139-2025-08-26",
      "headline": "F1: Cadillac ropes in Bottas and Perez for 2026, squash Horner rumoursCadillac F1 have confirmed Valtteri Bottas and Sergio Perez as their drivers for their maiden Formula One campaign in 2026. The team also denied Christian Horner links, as they decided to back Graeme Lowdon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-real-money-gaming-ban-usman-khawaja-australia-government-push-2777122-2025-08-26",
      "headline": "As India bans real-money gaming, Khawaja urges Australia to curb gambling adsAustralian cricketer Usman Khawaja has urged the government to curb gambling ads in sport, warning of their impact on young fans. His call comes after India banned real-money gaming under the Online Gaming Bill 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-exclusive-regrets-selection-saurashtra-2777107-2025-08-26",
      "headline": "No regrets over last 2 years, proud to have played 100 Tests for India: PujaraIn an exclusive interview, Cheteshwar Pujara said he took the decision to retire a week after contemplating the big call. The Test specialist added that he has no regrets about his career, including the last two years when he was not selected for the senior national team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-on-england-vs-india-test-series-oval-test-2777084-2025-08-26",
      "headline": "Could've played another game in England, can do anything for Test cricket: SirajIndia fast bowler Mohammed Siraj revealed the secret behind his hunger to bowl tireless long spells in Tests and spoke about his love for Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-anthony-gordon-red-card-liverpool-virgil-van-djik-newcastle-united-2777085-2025-08-26",
      "headline": "Anthony Gordon apologises after reckless tackle on Virgil Van DjikAnthony Gordon took to social media to apologise for his horrendous tackle on Virgil van Djik, which resulted in him being sent off. He admitted that he got caught up at the moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-dhruv-jurel-asia-cup-2777083-2025-08-26",
      "headline": "Gautam Gambhir's aura makes everyone feel pumped up: Dhruv JurelDhruv Jurel has praised Gautam Gambhir for the way he motivates players in the dressing room. He also values Gambhir's personal support and advice, which gives him confidence and keeps him determined to make the most of future opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/muhammad-imran-asia-cup-shoaib-akhtar-2777059-2025-08-26",
      "headline": "Meet Muhammad Imran: Oman's 'Shoaib Akhtar' gears up for Asia Cup 2025Fast bowler Mumhammad Imran, who went viral for his Shoaib Akhtar-like action and nuance, will play for Oman in the Asia Cup 2025 to be held from September 9 in the UAE. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-preparation-t20-world-cup-virender-sehwag-2777056-2025-08-26",
      "headline": "Asia Cup, a good opportunity to prepare for T20 World Cup: Virender SehwagFormer India cricketer, Virender Sehwag, believes that the upcoming Asia Cup will serve as the perfect testing ground for the Indian team to build their team for the T20 World Cup, slated to take place next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-on-england-vs-india-test-series-oval-test-2777084-2025-08-26",
      "headline": "Could've played another game in England, can do anything for Test cricket: SirajIndia fast bowler Mohammed Siraj revealed the secret behind his hunger to bowl tireless long spells in Tests and spoke about his love for Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-anthony-gordon-red-card-liverpool-virgil-van-djik-newcastle-united-2777085-2025-08-26",
      "headline": "Anthony Gordon apologises after reckless tackle on Virgil Van DjikAnthony Gordon took to social media to apologise for his horrendous tackle on Virgil van Djik, which resulted in him being sent off. He admitted that he got caught up at the moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-dhruv-jurel-asia-cup-2777083-2025-08-26",
      "headline": "Gautam Gambhir's aura makes everyone feel pumped up: Dhruv JurelDhruv Jurel has praised Gautam Gambhir for the way he motivates players in the dressing room. He also values Gambhir's personal support and advice, which gives him confidence and keeps him determined to make the most of future opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/muhammad-imran-asia-cup-shoaib-akhtar-2777059-2025-08-26",
      "headline": "Meet Muhammad Imran: Oman's 'Shoaib Akhtar' gears up for Asia Cup 2025Fast bowler Mumhammad Imran, who went viral for his Shoaib Akhtar-like action and nuance, will play for Oman in the Asia Cup 2025 to be held from September 9 in the UAE. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-preparation-t20-world-cup-virender-sehwag-2777056-2025-08-26",
      "headline": "Asia Cup, a good opportunity to prepare for T20 World Cup: Virender SehwagFormer India cricketer, Virender Sehwag, believes that the upcoming Asia Cup will serve as the perfect testing ground for the Indian team to build their team for the T20 World Cup, slated to take place next year. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}