{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcl-technologies-q2-fy25-net-profit-revenue-rs-12-interim-dividend-declared-2616703-2024-10-14",
      "headline": "HCLTech Q2 results: Net profit jumps 11% to Rs 4,235 crore, dividend declaredHCLTech declared another interim dividend of Rs 12 per share, taking the total interim dividend for the fiscal year so far to Rs 42 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-increases-549-per-cent-september-2616687-2024-10-14",
      "headline": "Retail inflation jumps to 5.49% in September amid surging food pricesFood prices saw an even more significant spike, with the Consumer Food Price Index (CFPI) recording a year-on-year inflation rate of 9.24%. Rural areas faced food inflation of 9.08%, while urban areas experienced an increase of 9.56%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-opens-tomorrow-latest-gmp-price-band-brokerage-views-subscribe-or-not-2616672-2024-10-14",
      "headline": "Hyundai Motor IPO opens tomorrow: Check latest GMP, brokerage reviews and moreHyundai Motor India IPO: Priced between Rs 1,865 and Rs 1,960 per share, the IPO is expected to raise Rs 27,856 crore through an offer for sale of 14.2 crore shares, representing a 17.5% stake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-update-sensex-600-points-nifty-above-25000-hdfc-wipro-reliance-industries-2616626-2024-10-14",
      "headline": "Sensex ends 600 points higher, Nifty gains; Wipro, HDFC Bank stocks rallyThe S&P BSE Sensex was up 591.69 points to 81,973.05 at the closing bell, while the NSE Nifty50 gained 163.70 points to settle at 25, 127.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/daron-acemoglu-simon-johnson-james-a-robinson-award-nobel-economics-prize-2616586-2024-10-14",
      "headline": "Daron Acemoglu, Simon Johnson, James A. Robinson awarded Nobel Economics Prize 2024Nobel Economics Prize 2024: This year's laureates provide valuable insights into how institutions are formed and their crucial role in fostering sustainable development and prosperity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hike-update-before-diwali-central-government-employees-pensioners-october-31-2616535-2024-10-14",
      "headline": "DA hike before Diwali? Big update for central government employeesDearness Allowance (DA) is revised twice a year, providing employees with financial support that helps maintain their purchasing power as living costs rise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-14-2024-precious-metals-witness-dip-on-mcx-latest-rates-2616463-2024-10-14",
      "headline": "Gold, silver price today, October 14, 2024: Precious metals witness dip on MCXGold Price Today October 14, 2024: Both gold and silver are trading on the lower side of the Multi Commodity Exchange (MCX) on Monday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-share-price-jump-q2-results-investors-buy-or-sell-2616443-2024-10-14",
      "headline": "HDFC Bank shares rise 2% ahead of Q2 results. What should investors do? HDFC Bank share price: Investors are showing increased interest in HDFC Bank shares, anticipating a positive performance in the upcoming quarterly results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dmart-avenue-supermarts-share-price-plunges-q2-results-brokerage-downgrades-2616419-2024-10-14",
      "headline": "Explained: Why DMart shares plunged 9% in early trade todayThe sharp decline in shares came after DMart's second-quarter earnings failed to meet the market's expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-update-sensex-nifty-gain-wipro-hdfc-dmart-shares-in-focus-inflation-data-q2-results-2616404-2024-10-14",
      "headline": "Sensex jumps 500 points, Nifty above 25,000; Wipro, HDFC Bank gain The S&P BSE Sensex was up 409.75 points to 81,791.11 at 10:20 am, while the NSE Nifty50 rose 126.45 points to trade at 25,090.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-wars-how-hinduja-brothers-went-from-all-for-one-to-each-for-himself-ashok-prakash-srichand-gopichand-2616025-2024-10-13",
      "headline": "Succession Wars: The Hinduja family's bitter battle for controlAt the heart of the Hinduja family's success was their ethos of shared ownership, but this same principle ultimately sparked their multi-billion dollar feud, endangering an empire built on unity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-17000-job-cuts-factory-strike-finances-delay-first-777x-delivery-2615682-2024-10-12",
      "headline": "Boeing to cut 17,000 jobs as losses deepen amid factory strikeThe planemaker will also delay the delivery of its first 777X jet by a year. Boeing CEO Kelly Ortberg said that the comapny must shrink its workforce \"to align with financial reality\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-richest-mukesh-ambani-gautam-adani-jindal-cross-usd-1-trillion-mark-amid-market-rally-pm-modi-win-2615476-2024-10-11",
      "headline": "Fortunes soar: India's richest cross $1 trillion mark amid market rallyForbes' analysis shows that India's 100 richest individuals now have a total net worth of $1.1 trillion, more than doubling their wealth since 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-trent-to-titan-noel-tatas-journey-to-the-top-of-tata-trust-2615449-2024-10-11",
      "headline": "From Trent to Titan: Noel Tata's journey to the top of Tata TrustNoel Tata, born to Naval Tata and Simone Tata, has been a key figure in the Tata Group for many years. He holds several senior positions within the conglomerate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nariman-point-revival-office-rents-expected-to-nearly-double-by-2030-report-2615402-2024-10-11",
      "headline": "Nariman Point's revival: Office rents expected to nearly double by 2030The report, titled 'South Mumbai – A Renaissance', attributes this expected surge to ongoing infrastructure improvements and rising demand for premium office space in the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-named-tata-trusts-chairman-carry-forward-ratan-tata-legacy-2615368-2024-10-11",
      "headline": "Noel Tata on being named Tata Trusts Chairman: Will carry on legacy of Ratan TataNoel Tata was named Tata Trusts Chairman after a board meeting held in Mumbai on October 11, where the decision was unanimously agreed upon by the trustees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/financial-crisis-likely-in-delhi-additional-expenditures-to-put-national-capital-in-revenue-deficit-this-fiscal-year-2615347-2024-10-11",
      "headline": "Financial crisis looms in Delhi as extra spending tips city into revenue deficitSeveral departments have underscored additional resource needs, which strain the budget further. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-as-foreign-investment-fizzles-tata-group-shares-gain-2615327-2024-10-11",
      "headline": "Sensex, Nifty end lower as foreign investment fizzles; Tata Group shares gainThe S&P BSE Sensex was down by 230.05 points to close at 81,381.36, while the Nifty50 declined by 34.20 points to end at 24,964.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trent-tata-chemicals-tata-investment-corporation-surge-3-percent-as-noel-tata-takes-charge-at-tata-trusts-2615300-2024-10-11",
      "headline": "Tata group stocks surge 3% as Noel Tata takes charge at Tata TrustsNoel Tata's appointment came after the death of Ratan Tata, former chairman of Tata Sons, on October 9 at the age of 86. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/noel-tata-appointed-chairman-of-tata-trusts-succeed-ratan-tata-2615252-2024-10-11",
      "headline": "Appointed Chairman of Tata Trusts, Noel Tata to succeed Ratan Tata Noel Tata has been appointed as the new Chairman of Tata Trusts, effective October 11, following the death of his half-brother Ratan Tata on October 9 at the age of 86. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/diplomat-stewart-wheeler-summoned-mea-india-canada-diplomatic-row-2616716-2024-10-14",
      "headline": "India summons Canadian diplomat after Ottawa's action against Indian envoyCanadian diplomat Stewart Wheeler summoned by External Affairs Ministry over latest diplomatic tussle"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/opposition-mps-walk-out-of-joint-parliamentary-committee-meeting-over-waqf-bill-2616696-2024-10-14",
      "headline": "Opposition MPs walk out of Waqf Bill committee meeting, cite 'personal attacks'Opposition MPs staged a boycott of the parliamentary committee meeting on the Waqf (Amendment) Bill, citing procedural violations and unwarranted personal allegations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/lawrence-bishnoi-targets-hit-list-salman-khan-gangsters-baba-siddique-murder-nia-2616570-2024-10-14",
      "headline": "Exclusive: Lawrence Bishnoi reveals who's on his hit-listIndia Today has exclusively accessed details from the NIA questioning, revealing that gangster Lawrence Bishnoi had identified five key targets, including Bollywood actor Salman Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-increases-549-per-cent-september-2616687-2024-10-14",
      "headline": "Retail inflation jumps to 5.49% in September amid surging food pricesFood prices saw an even more significant spike, with the Consumer Food Price Index (CFPI) recording a year-on-year inflation rate of 9.24%. Rural areas faced food inflation of 9.08%, while urban areas experienced an increase of 9.56%. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/lawrence-bishnoi-power-murder-baba-siddique-from-jail-gang-members-shield-how-operating-suraksha-kavach-2616491-2024-10-14",
      "headline": "What is Lawrence Bishnoi's suraksha kavach?After Delhi and Punjab, the Lawrence Bishnoi gang is making its presence felt in Mumbai. The Bombay underworld was run from abroad after the Bombay blasts of 1993. However, Lawrence Bishnoi has been running his gang from jail with impunity for the last decade. That brings up the question -- what is his suraksha kavach (shield)?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/communal-clashes-in-bharaich-uttar-pradesh-durga-immersion-processon-dead-injured-yogi-aditynath-takes-note-2616372-2024-10-14",
      "headline": "Bahraich clashes: Cops seal borders, drones deployed after hospital, shops torchedTension erupted in Uttar Pradesh's Bahraich after clashes during a Durga idol immersion procession left a 22-year-old man dead. Heavy police forces were deployed, internet services were suspended, and multiple arrests were made to control the situation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/no-bail-for-actor-darshan-co-accused-pavithra-gowda-renukaswamy-murder-case-2616701-2024-10-14",
      "headline": "No bail for actors Darshan, Pavithra Gowda in Renukaswamy murder caseThe Sessions Court rejected the bail pleas of Darshan, Pavitra Gowda, Nagaraj, and Lakshman, while accused no. 8, Ravishankar, and accused no. 13, Deepak, were granted bail. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/man-shot-alongside-baba-siddique-writhes-pain-2616620-2024-10-14",
      "headline": "Video: Man shot alongside Baba Siddique writhes in painA video has emerged showing the individual who was shot alongside Baba Siddique. At the time the shots were fired, this person was passing by and was hit in the leg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/rising-cancer-rates-in-india-mouth-and-breast-cancer-cases-surge-icmr-study-2616566-2024-10-14",
      "headline": "Rising cancer rates in India: Mouth and breast cancer cases surgeIndia is grappling with rising cancer rates, especially mouth cancer among men and breast cancer among women, as highlighted by a comparative study by ICMR."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/rajasthan-the-royal-canvas-for-dream-weddings-2615738-2024-10-12",
      "headline": "Rajasthan: The Royal Canvas for Dream WeddingsWhether it's the grandeur of a palace wedding in Udaipur, the mystique of a desert wedding in Jaisalmer, or the creativity of a themed wedding in Jaipur, Rajasthan offers a wedding experience that is truly out of the ordinary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/iit-delhis-technology-ai-leadership-programme-shaping-the-future-of-tech-leadership-2616457-2024-10-14",
      "headline": "IIT Delhi's Technology & AI Leadership Programme: Shaping the Future of Tech LeadershipAdvance your career with IIT Delhi's Technology & AI Leadership Programme. Designed for aspiring tech leaders, this programme offers cutting-edge insights, practical experience, and strategic acumen to navigate the digital era. Gain the skills to drive innovation, lead digital transformations, and position yourself as a visionary in technology leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/daron-acemoglu-simon-johnson-james-a-robinson-award-nobel-economics-prize-2616586-2024-10-14",
      "headline": "Daron Acemoglu, Simon Johnson, James A. Robinson awarded Nobel Economics Prize 2024Nobel Economics Prize 2024: This year's laureates provide valuable insights into how institutions are formed and their crucial role in fostering sustainable development and prosperity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chinese-construction-near-pangong-lake-satellite-pics-show-narendra-modi-xi-jingping-2616513-2024-10-14",
      "headline": "Satellite pics show new Chinese settlement under construction near Pangong LakeSatellite imagery accessed by India Today shows significant Chinese construction activity, 38 km from the 2020 standoff point, raising fresh concerns over border infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-canada-spat-suggesting-indian-high-commissioner-person-of-interest-probe-2616558-2024-10-14",
      "headline": "Smearing India for political gains: Government on Canada's move against envoyIndia blasted Canada over allegations that the Indian High Commissioner was a 'person of interest' in a murder investigation, ascribing Ottawa's move to the Trudeau government's political agenda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lawrence-bishnoi-gang-salman-khan-vendetta-history-threats-killings-timeline-baba-siddique-murder-2616509-2024-10-14",
      "headline": "Target Salman Khan: How Lawrence Bishnoi has tried to terrorise the actorGangster Lawrence Bishnoi's vendetta against Salman Khan, driven by a deep-seated grudge over the blackbuck hunting incident, has manifested in a series of threatening letters and violent attacks, with politician Baba Siddique's murder being the biggest hit so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-top-leadership-warns-maharashtra-leaders-against-overconfidence-after-haryana-assembly-poll-debacle-2616639-2024-10-14",
      "headline": "Congress's big warning to Maharashtra leaders after Haryana debacleThe Congress leadership warned Maharashtra leaders against overconfidence after the Haryana poll setback, according to party sources. At a key meeting, they emphasised unity and hard work for the upcoming Maharashtra Assembly election.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/do-patti-trailer-kajol-stuck-in-messed-up-love-story-involving-2-kriti-sanon-2616520-2024-10-14",
      "headline": "Do Patti trailer: Kajol stuck in messed up love story involving '2' Kriti SanonThe makers of Do Patti released the trailer of the mystery thriller online on Monday, October 14. The film stars Kriti Sanon in a double role, alongside Kajol and Shaheer Sheikh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hezbollah-attack-mirsad-one-iron-dome-defence-system-rockets-drones-israel-iran-hamas-lebanon-war-2616531-2024-10-14",
      "headline": "How Hezbollah's drone pierced Israel's Iron DomeA Hezbollah drone hoodwinked Israel's much-vaunted Iron Dome air-defence system late on Sunday and killed four soldiers and injured 60 others. There are two reasons why it is likely that Israel's famed Iron Dome, so effective against rockets, missed the drone fired from Lebanon by Hezbollah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/maharashtra-government-light-motor-vehicles-entering-mumbai-assembly-polls-2616435-2024-10-14",
      "headline": "No toll for cars, SUVs entering Mumbai from tonight: Eknath Shinde's big moveAhead of the Maharashtra Assembly polls, Chief Minister Eknath Shinde announced that light motor vehicles need not pay toll at Mumbai's five toll booths."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/hyderabad-muthyalamma-temple-in-secunderabad-vandalised-protest-durga-idol-2616485-2024-10-14",
      "headline": "Protest in Secunderabad after idol vandalised, BJP's Madhavi Latha detainedThe idol at the Muthyalamma temple in Secunderabad was allegedly desecrated, and locals caught the miscreant. A protest was held outside the temple, and BJP leaders who joined the agitation were detained."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/this-non-maruti-hyundai-mahindra-suv-scores-4-star-safety-rating-french-phenom-2616564-2024-10-14",
      "headline": "This non-Maruti, Hyundai, Mahindra SUV scores 4-star safety rating, French phenomThe Basalt is the only non-Tata model whose Bharat NCAP safety test result has been announced as of now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-generals-plan-starve-hamas-northern-gaza-military-zone-benjamin-netanyahu-2616345-2024-10-14",
      "headline": "Netanyahu considers 'surrender or starve' plan for northern Gaza: ReportThe General's Plan, proposed to Netanyahu and the Israeli parliament, aims to starve out Hamas militants and force them to surrender by cutting off essential supplies to the population in northern Gaza."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/lawrence-bishnoi-gangster-baba-siddique-murder-mumbai-police-salman-khan-house-firing-2616406-2024-10-14",
      "headline": "Why Mumbai Police is unable to get gangster Lawrence Bishnoi's custodyLawrence Bishnoi is lodged in Sabarmati Central Jail in Gujarat. His gang has claimed responsibility for the murder of NCP's Baba Siddique."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-assam-tata-tea-1997-allegation-helping-ulfa-militants-cm-prafulla-kumar-mahanta-2615334-2024-10-14",
      "headline": "When Ratan Tata was caught between a CM and militantsIn the late 90s, when militancy was at its peak in Assam, there was a storm in the Tata Tea cup. Then Assam CM Prafulla Kumar Mahanta alleged Tata Group's links with militant outfit Ulfa. Then came the leaked Tata Tapes. This is the time when Ratan Tata led the group through a crisis and emerged unscathed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sushmita-sen-lakme-fashion-week-daughter-renee-gives-shout-out-rashi-kapoor-2616692-2024-10-14",
      "headline": "Sushmita Sen owns the runway at fashion show, daughter Renee gives shout-outSushmita Sen turned showstopper for designer Rashi Kapoor at Lakme Fashion Week in Delhi. While the actor impressed fans with her presence, her daughter Renee praised Sushmita's charm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/shreya-ghoshal-sunidhi-chauhan-unite-for-chhaila-by-salim-sulaiman-fans-hail-it-as-historic-bhoomi-2024-2616616-2024-10-14",
      "headline": "Shreya Ghoshal, Sunidhi Chauhan unite for Chhaila, fans hail it as historicIconic singers Shreya Ghoshal and Sunidhi Chauhan have teamed up for a new song titled Chhaila, part of Salim-Sulaiman's Bhoomi 2024 project. The collaboration has been hailed historic and has generated immense excitement among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kriti-sanon-auditioned-ten-actors-selecting-shaheer-sheikh-do-patti-2616670-2024-10-14",
      "headline": "Do Patti: Kriti Sanon auditioned with 10 actors before selecting Shaheer SheikhWriter Kanika Dhillon recently revealed that Kriti Sanon auditioned with ten actors before choosing Shaheer Shaikh for their upcoming film, Do Patti. The film's trailer was released on October 14.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/unstoppable-with-nbk-4-promo-nandamuri-balakrishna-aha-2616661-2024-10-14",
      "headline": "Unstoppable with NBK 4 promo: Balakrishna transforms into an animated superheroThe trailer for Unstoppable with NBK Season 4 has been released, featuring Balakrishna as a superhero who brings hope and joy to a struggling community, marking his 50 years in the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/openai-reveals-how-cybercriminals-are-asking-chatgpt-to-write-malware-2616704-2024-10-14",
      "headline": "OpenAI reveals how cybercriminals are asking ChatGPT to write malwareOpenAI's latest report reveals how cybercriminals are exploiting ChatGPT to write malware and conduct cyber-attacks, raising concerns over AI misuse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/yann-lecun-chief-ai-scientist-at-meta-says-warnings-about-ai-being-a-hazard-are-complete-nonsense-2616686-2024-10-14",
      "headline": "Meta chief AI scientist says warnings about AI are complete nonsenseThe man who plays a big role behind the artificial intelligence that we see today has reportedly said that we exaggerate the pros and cons of AI. Yann LeCun, chief AI scientist at Meta says AI doesn't even have the intelligence of our pets, let alone the humans'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-is-said-to-launch-four-products-later-this-month-here-are-the-details-2616681-2024-10-14",
      "headline": "Apple is said to launch four products later this month, here are the detailsAccording to reports, Apple is set to host a major launch event at the end of October. The company is tipped to introduce at least four new products, which are said to be released on November 1. Here are the details."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/realme-gt-6t-available-with-flat-discount-of-rs-5000-on-amazon-check-out-the-deal-2616668-2024-10-14",
      "headline": "Realme GT 6T available with flat discount of Rs 5000 on Amazon: Check out the deal Realme GT 6T returns to the Indian market with attractive discounts, offering cutting-edge specifications at a competitive price point."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-england-head-coach-rumours-not-true-manchester-city-premier-league-2616682-2024-10-14",
      "headline": "Pep Guardiola rubbishes England head coach rumors: It's not truePep Guardiola has denied rumours about taking over as England's head coach, stating that he hasn't made any decisions regarding his future beyond his current Manchester City contract, which expires in the summer of 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rachin-ravindra-past-experience-world-cup-ipl-india-test-series-2616674-2024-10-14",
      "headline": "Rachin Ravindra banking on past exploits in World Cup, IPL for India Test seriesNew Zealand all-rounder Rachin Ravindra is gearing up for a challenging Test series in India, relying on his past performances in the subcontinent to guide him. Despite no practice matches ahead, the Black Caps are hopeful of leveraging their recent experiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-second-test-babar-azam-dropped-ben-stokes-reacts-2616662-2024-10-14",
      "headline": "Ben Stokes reacts to Babar Azam getting dropped: It is Pakistan's issueEngland captain Ben Stokes dismissed concerns over Babar Azam's omission from Pakistan's squad, focusing solely on his team's preparations for the second Test, while Pakistan faces backlash over dropping three key players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-second-test-squad-babar-azam-replaces-kamran-ghulam-debut-2616654-2024-10-14",
      "headline": "PAK vs ENG: Debutant Kamran Ghulam replaces Babar Azam for second TestPakistan's playing XI for the second Test against England includes Kamran Ghulam, Noman Ali, and Zahid Mehmood as replacements for Babar Azam, Shaheen Afridi, and Naseem Shah, signalling a spin-heavy strategy in the crucial match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-schedule-india-women-odi-series-vs-new-zealand-2616646-2024-10-14",
      "headline": "BCCI announces schedule for India women's ODI series vs New ZealandThe Board of Control for Cricket in India announced the fixtures for India's (Senior Women) upcoming three-match ODI series against New Zealand. The series, to be played at the Narendra Modi Stadium in Ahmedabad, is part of the ICC Women's Championship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-dropped-pakistan-decision-right-or-not-sachin-tendulkar-virat-kohli-2616577-2024-10-14",
      "headline": "Is Babar Azam too big to be dropped? Decoding Pakistan cricket's latest bombshellIn one of Pakistan cricket's boldest moves, Babar Azam was left out of the squad for the last two Tests against England at home. The decision has left the cricket world divided. Were the selectors right in 'resting' Babar? Has it dented his aura?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-ben-stokes-reacts-second-test-same-pitch-used-advantage-2616614-2024-10-14",
      "headline": "PAK vs ENG: 2nd Test to be played on Day 6 pitch? Ben Stokes reactsBen Stokes acknowledged the unusual decision to reuse the Multan pitch for the second Test against Pakistan, saying it could favour both teams, despite Pakistan's surprising choice after their heavy defeat in the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-2nd-test-babar-azam-rested-azhar-mahmood-press-conference-multan-2616600-2024-10-14",
      "headline": "'No.1 player' Babar Azam not dropped but rested for England Tests: Azhar MahmoodPakistan assistant coach Azhar Mahmood has claimed that star batter Babar Azam has been rested and not dropped from the squad for the remainder of the England Test series. Babar has been struggling to find form in Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-test-adaptable-approach-gautam-gambhir-2616567-2024-10-14",
      "headline": "'Adaptable' India can score 400 in 1 day and also bat 2 days for draw: GambhirIND vs NZ: India head coach Gautam Gambhir hailed his team's ability to adapt to conditions in a Test match. Gambhir said that India can not only score 400 runs in one day but can also bat long hours for a draw in to save a Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-virat-kohli-ever-hungry-india-vs-new-zealand-australia-tour-2616565-2024-10-14",
      "headline": "Gautam Gambhir backs 'ever-hungry' Virat Kohli to find form in New Zealand TestsHead coach Gautam Gambhir, speaking to the press in Bengaluru on his 43rd birthday, said he is confident that Virat Kohli will return to peak form in the upcoming three-Test series against New Zealand. Kohli has not hit a fifty in three Tests played in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-playing-xi-ben-stokes-returns-matthew-potts-multan-2616538-2024-10-14",
      "headline": "PAK vs ENG: Ben Stokes returns as England make 2 changes for 2nd TestBen Stokes has returned to the playing XI as England announced their team for the second Test against Pakistan in Multan, which will begin from October 15, Tuesday. Stokes is one of the 2 changes made by England for the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-ben-stokes-reacts-second-test-same-pitch-used-advantage-2616614-2024-10-14",
      "headline": "PAK vs ENG: 2nd Test to be played on Day 6 pitch? Ben Stokes reactsBen Stokes acknowledged the unusual decision to reuse the Multan pitch for the second Test against Pakistan, saying it could favour both teams, despite Pakistan's surprising choice after their heavy defeat in the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-2nd-test-babar-azam-rested-azhar-mahmood-press-conference-multan-2616600-2024-10-14",
      "headline": "'No.1 player' Babar Azam not dropped but rested for England Tests: Azhar MahmoodPakistan assistant coach Azhar Mahmood has claimed that star batter Babar Azam has been rested and not dropped from the squad for the remainder of the England Test series. Babar has been struggling to find form in Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-test-adaptable-approach-gautam-gambhir-2616567-2024-10-14",
      "headline": "'Adaptable' India can score 400 in 1 day and also bat 2 days for draw: GambhirIND vs NZ: India head coach Gautam Gambhir hailed his team's ability to adapt to conditions in a Test match. Gambhir said that India can not only score 400 runs in one day but can also bat long hours for a draw in to save a Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-virat-kohli-ever-hungry-india-vs-new-zealand-australia-tour-2616565-2024-10-14",
      "headline": "Gautam Gambhir backs 'ever-hungry' Virat Kohli to find form in New Zealand TestsHead coach Gautam Gambhir, speaking to the press in Bengaluru on his 43rd birthday, said he is confident that Virat Kohli will return to peak form in the upcoming three-Test series against New Zealand. Kohli has not hit a fifty in three Tests played in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-playing-xi-ben-stokes-returns-matthew-potts-multan-2616538-2024-10-14",
      "headline": "PAK vs ENG: Ben Stokes returns as England make 2 changes for 2nd TestBen Stokes has returned to the playing XI as England announced their team for the second Test against Pakistan in Multan, which will begin from October 15, Tuesday. Stokes is one of the 2 changes made by England for the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-bgt-who-is-sam-konstas-batting-prodigy-in-contention-for-australian-opening-spot-2616536-2024-10-14",
      "headline": "Who is Sam Konstas? Batting prodigy in contention for Australian opening spot19-year-old Sam Konstas has been called up for the tour games against India. Konstas who has played just 5 first-class matches so far comes in with a lot of promise and is one of the wildcards for the vacant opening position in the Australian Test team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-eng-shaheen-afridi-break-silence-after-getting-dropped-from-test-team-2616527-2024-10-14",
      "headline": "PAK vs ENG: Shaheen Afridi breaks silence after Pakistan axePakistan fast bowler Shaheen Shah Afridi broke his silence with a short tweet after getting dropped from the Test team. Shaheen was one among 4 Pakistan players rested for the 2nd and 3rd Test matches vs England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-2024-25-first-round-day-4-baroda-vs-mumbai-report-bhargav-bhatt-2616526-2024-10-14",
      "headline": "Ranji Trophy: Defending champions Mumbai stunned by Baroda in opening roundBhargav Bhatt rocked the Mumbai batting order with a six-wicket haul in the second innings as Baroda stunned the defending champions to win the first round match by 82 runs on October 14, Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-tamil-nadu-hand-jaydev-unadkats-saurashtra-innings-defeat-2616514-2024-10-14",
      "headline": "Ranji Trophy: Tamil Nadu hand Jaydev Unadkat's Saurashtra innings defeatTamil Nadu beat Saurashtra by an innings and 70 runs in Round 1 of the Ranji Trophy. Medium pacer Gurjapneet Singh ran through the Saurashtra batting order to hand them a heavy defeat.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-2nd-test-babar-azam-dropped-nasser-hussain-multan-2616481-2024-10-14",
      "headline": "Babar Azam dropped: Nasser Hussain says England won't mind Pakistan's callNasser Hussain feels that England would be pleased to have seen Pakistan drop Babar Azam for the remainder of the Test series on Sunday, October 13. Babar has been struggling with his form in Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-abhimanyu-easwaran-continues-test-team-push-with-century-vs-up-2616460-2024-10-14",
      "headline": "Ranji Trophy: Easwaran continues Test team push with century vs UPRanji Trophy: Abhimanyu Easwaran continued to knock on the door of the Indian Test team with a century against Uttar Pradesh in the first Ranji Trophy match of the season. This was Easwaran's 4th hundred in the last 4 games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-shashi-tharoor-meeting-ponnada-thiruvananthapuram-century-2616458-2024-10-14",
      "headline": "Shashi Tharoor welcomes Sanju Samson with 'ponnada' in ThiruvananthapuramCongress MP Shashi Tharoor presented Sanju Samson with a blue shawl after the superstar wicketkeeper returned to Thiruvananthapuram.  Samson hit his maiden T20I hundred on Saturday in Hyderabad in India's record-breaking win over Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-season-11-telugu-titans-swot-analysis-pawan-sehrawat-2616441-2024-10-14",
      "headline": "Pawan Sehrawat Telugu Titans' hope for revival in season 11After struggling in the past few seasons, Telugu Titans will be looking at Pawan Sehrawat to lead their revival in season 11 of the Pro Kabaddi League this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-2nd-test-babar-azam-dropped-nasser-hussain-multan-2616481-2024-10-14",
      "headline": "Babar Azam dropped: Nasser Hussain says England won't mind Pakistan's callNasser Hussain feels that England would be pleased to have seen Pakistan drop Babar Azam for the remainder of the Test series on Sunday, October 13. Babar has been struggling with his form in Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-abhimanyu-easwaran-continues-test-team-push-with-century-vs-up-2616460-2024-10-14",
      "headline": "Ranji Trophy: Easwaran continues Test team push with century vs UPRanji Trophy: Abhimanyu Easwaran continued to knock on the door of the Indian Test team with a century against Uttar Pradesh in the first Ranji Trophy match of the season. This was Easwaran's 4th hundred in the last 4 games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-shashi-tharoor-meeting-ponnada-thiruvananthapuram-century-2616458-2024-10-14",
      "headline": "Shashi Tharoor welcomes Sanju Samson with 'ponnada' in ThiruvananthapuramCongress MP Shashi Tharoor presented Sanju Samson with a blue shawl after the superstar wicketkeeper returned to Thiruvananthapuram.  Samson hit his maiden T20I hundred on Saturday in Hyderabad in India's record-breaking win over Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-season-11-telugu-titans-swot-analysis-pawan-sehrawat-2616441-2024-10-14",
      "headline": "Pawan Sehrawat Telugu Titans' hope for revival in season 11After struggling in the past few seasons, Telugu Titans will be looking at Pawan Sehrawat to lead their revival in season 11 of the Pro Kabaddi League this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-2024-season-worst-grand-slam-2616428-2024-10-14",
      "headline": "Djokovic ends 2024 without Grand Slam, calls it his 'worst-performing season'Legendary Novak Djokovic has called the 2024 season as one of his worst-performing ones. Djokovic finished 2024 without a single Grand Slam but won the Olympic gold medal by beating Carlos Alcaraz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-england-interim-manager-lee-carsley-remains-coy-on-taking-full-time-job-2616418-2024-10-14",
      "headline": "England interim manager Lee Carsley remains coy on taking full-time jobEngland's interim boss Lee Carsley has remained coy about taking the full-time job after their UEFA Nations League win over Finland on Sunday, October 13. Carsley has lost just one game since taking over from Gareth Southgate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-steve-smith-will-not-open-in-border-gavaskar-trophy-confirms-george-bailey-2616398-2024-10-14",
      "headline": "Steve Smith will not open in Test series vs India: George BaileyAustralia batter Steve Smith will not open the innings vs India, confirmed Australia chief selector George Bailey. The announcement comes nearly a month ahead of the first Test match of the Border Gavaskar Trophy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-test-series-babar-azam-shaheen-afridi-naseem-shah-dropped-hasan-ali-2616394-2024-10-14",
      "headline": "Hasan Ali backs 'brothers' Babar, Shaheen and Naseem after Pakistan axeHasan Ali has backed 'brothers' and 'champions' Babar Azam, Shaheen Shah Afridi and Naseem Shah to bounce back after the trio was dropped from the Pakistan squad for the remainder of the England Test series on Sunday, October 13. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}