{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/renewable-energy-stocks-could-make-you-greener-ntpc-suzlon-jsw-adani-5-reasons-why-market-tips-2641640-2024-11-28",
      "headline": "Renewable energy stocks could make you greener? 5 reasons whyWith the global shift towards clean energy, renewable energy stocks have proven to be rewarding for many, delivering strong returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-ltim-hcltech-tcs-information-technology-stocks-sensex-nifty-2641611-2024-11-28",
      "headline": "Infosys, LTIM, HCLTech, TCS: Why IT stocks are tumbling todayInfosys led the decline with a 3% drop, while Tech Mahindra and LTIMindtree were down by 2.5%. HCLTech, MPhasis, and TCS also recorded losses exceeding 2%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/grain-to-glass-how-this-firm-pernod-ricard-india-distillery-blending-sustainability-india-alcohol-industry-2641594-2024-11-28",
      "headline": "How this firm is blending sustainability in India's alcohol industryThe company's innovative approach, dubbed 'Grain to Glass', is transforming how businesses can contribute to environmental and social development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-jump-today-shajapur-solar-project-exchange-filing-2641576-2024-11-28",
      "headline": "Explained: Why newly-listed NTPC Green Energy shares gained 5% todayNTPC Green Energy share price: The latest surge follows NTPC Green Energy's announcement regarding the commercial operation of the first phase of its Shajapur Solar Project in Madhya Pradesh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/suraksha-diagnostic-ipo-opens-tomorrow-details-check-price-band-issue-size-latest-gmp-2641573-2024-11-28",
      "headline": "Suraksha Diagnostic IPO opens tomorrow: Check price band, issue size, GMPSuraksha Diagnostic IPO: The IPO will open for bidding on Friday and is expected to list on the stock exchanges on December 6, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-rally-rise-above-rs-90-citi-target-is-it-time-to-buy-2641559-2024-11-28",
      "headline": "Ola Electric shares continue positive rally, rise above Rs 90. Time to buy?Ola Electric share price: With this, the stock has gained over 35% in the last five sessions and has surpassed the Rs 90 target set by Citi on November 26."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-nearly-800-points-nifty-declines-4-factors-behind-stock-market-weakness-today-2641503-2024-11-28",
      "headline": "Bloodbath on Dalal Street: 4 reasons why Sensex plunged over 1,000 points todayAt 1:20 pm, the S&P BSE Sensex was down 1035.82 points at 79,198.26, while the NSE Nifty50 fell 299.65 points to 23,975.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-share-price-today-report-buying-half-of-manipalcigna-health-insurance-2641479-2024-11-28",
      "headline": "Explained: Why LIC share price gained nearly 4% in early trade  LIC Stock Price: LIC share price gained nearly 4% in early trade despite a sharp drop in the benchmark stock market indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-share-price-rises-after-aircastle-drops-insolvency-case-2641478-2024-11-28",
      "headline": "SpiceJet share price rises after Aircastle drops insolvency caseIn September, SpiceJet announced the resolution of a $23.39 million dispute with Aircastle (Ireland) Designated Activity Company and Wilmington Trust SP Services (Dublin) Limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-total-gas-share-price-jumps-early-trade-broad-based-recovery-key-factors-behind-rally-2641472-2024-11-28",
      "headline": "Adani Total Gas share price jumps 16% in early trade. What's driving the rally?Adani Total Gas share price: The stock touched an intraday high of Rs 823.30 before settling at Rs 787, up 13.36% at 10:51 am."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-energy-solutions-enterprise-green-energy-shares-gain-up-to-10-percent-2641448-2024-11-28",
      "headline": "Adani group stocks extend winning streak, rally up to 12% todayAdani Group stocks such as Adani Green Energy Ltd, Adani Power Ltd, Adani Energy Solutions Ltd, and Adani Enterprises Ltd gained as much as 12% after the recent clarification on the US bribery charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-adani-group-shares-gain-up-to-3-percent-in-early-trade-2641437-2024-11-28",
      "headline": "Sensex, Nifty open flat; Adani group shares gain up to 10% in early tradeThe S&P BSE Sensex lost 17.08 points to 80,217.00, while the NSE Nifty50 gained 8.05 points to 24,282.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-engineers-listing-share-price-does-latest-gmp-signal-a-strong-market-debut-2641423-2024-11-28",
      "headline": "Enviro Infra Engineers listing: Does latest GMP signal a strong market debut? Enviro Infra Engineers listing: The initial public offering (IPO) of Enviro Infra Engineers saw strong investor interest through its 3-day bidding process as it was oversubscribed by 89.90 times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-adani-group-shares-waaree-renewable-pcbl-vedanta-godrej-properties-2641402-2024-11-28",
      "headline": "Stocks to watch today: Adani, Waaree, PCBL, Vedanta, Godrej Properties Stocks to watch: In today's trade, shares of Adani Group, Waaree Renewable Technologies, Godrej Properties, Vedanta, and PCBL, among others, will be in focus due to various developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/this-is-a-hatchet-job-mahesh-jethmalani-on-adanis-us-indictment-2641154-2024-11-27",
      "headline": "This is a hatchet job: Mahesh Jethmalani on Adani's US indictmentIn an exclusive interview with India Today TV, senior advocate and former BJP Rajya Sabha MP Mahesh Jatmalani defended Gautam Adani and called the US indictment a 'hatchet job'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-share-price-rally-clarification-us-bribery-charges-should-you-buy-avoid-stocks-2641085-2024-11-27",
      "headline": "Adani shares rally after clarification on US bribery charges. Is the worst over? Adani Power shares closed 20% higher at Rs 525.30, Adani Total Gas gained 19.76% to Rs 694.25, and Adani Enterprises rose 11.56% to Rs 2,398.35. These were the top gainers among all the listed Adani Group companies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-higher-as-adani-group-stocks-rally-up-to-20-percent-2641039-2024-11-27",
      "headline": "Sensex, Nifty end higher as Adani stocks rally up to 20% The S&P BSE Sensex added 230.02 points to close at 80,234.08, while the NSE NIfty50 gained 82.20 points to end at 24,276.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-life-insurance-faces-cyberattack-fraudsters-steal-customer-data-demand-extortion-2641013-2024-11-27",
      "headline": "HDFC Life faces cyberattack: Fraudsters steal customer data, demand extortionThe breach occurred between November 19 and November 21, 2024 and the cybercriminals managed to steal personal information about HDFC Life's customers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-jumps-18-percent-should-you-buy-now-or-wait-2640982-2024-11-27",
      "headline": "Ola Electric share price jumps 18%: Should you buy now or wait?The rally in Ola Electric shares followed the company's announcement of its new electric scooter lineup, which aims to make EVs more accessible across various segments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pan-20-project-uses-existing-old-pan-card-valid-need-to-upgrade-expert-views-2640953-2024-11-27",
      "headline": "PAN 2.0: Will existing PAN card remain valid or do you need to upgrade?PAN 2.0: With an investment of Rs 1,435 crore, the government aims to introduce advanced Digital PAN/TAN services as part of this e-governance reform."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sambhal-violence-mosque-survey-audio-clip-mob-mobilised-weapons-2641548-2024-11-28",
      "headline": "Sambhal violence: Audio clip reveals how more people were mobilised with armsSambhal violence: The investigation team recovered the audio clip from mobile phones that were seized from the suspects. In the clip, an unidentified person can be heard giving a call for more people to be mobilised near the Shahi Jama Masjid."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/lashkar-e-taiba-linked-terrorist-accused-funding-bengaluru-based-modules-extradited-cbi-from-rwanda-2641562-2024-11-28",
      "headline": "Lashkar terrorist, accused of funding terrorism in India, extradited from RwandaSalman Rehman Khan is accused of involvement in criminal conspiracy, membership in a terrorist organisation, and providing material support to the Pakistan-based LeT. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-nearly-800-points-nifty-declines-4-factors-behind-stock-market-weakness-today-2641503-2024-11-28",
      "headline": "Bloodbath on Dalal Street: 4 reasons why Sensex plunged over 1,000 points todayAt 1:20 pm, the S&P BSE Sensex was down 1035.82 points at 79,198.26, while the NSE Nifty50 fell 299.65 points to 23,975.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-chief-minister-suspense-mahayuti-delhi-meeting-devendra-fadnavis-eknath-shinde-ajit-pawar-bjp-sena-ncp-2641392-2024-11-28",
      "headline": "Mahayuti's Delhi meet today, Devendra Fadnavis billed as favourite for top postFive days after the Mahayuti swept the Maharashtra polls, top leaders of the alliance will meet Union Home Minister Amit Shah in Delhi today with Devendra Fadnavis being viewed as the possible choice to become the next Chief Minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vir-das-americans-indian-name-raj-international-emmy-monologue-2641528-2024-11-28",
      "headline": "At Emmys, Vir Das pun on Elon Musk in Trump 2.0: Self-driving but I have controlComedian Vir Das shared his International Emmy's opening monologue on social media. He scripted history by being the first Indian to host the ceremony. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-india-vs-pakistan-pcb-chief-mohsin-naqvi-2641443-2024-11-28",
      "headline": "India not playing cricket in Pakistan is unacceptable: Mohsin NaqviPakistan Cricket Board chairman Mohsin Naqvi has said that India not wanting to play cricket in Pakistan is unacceptable. Naqvi has said that India should honour gesture when Pakistan went to play in India during the World Cup, despite political differences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/watch-rahul-gandhi-captures-priyankas-parliament-debut-in-candid-moment-2641623-2024-11-28",
      "headline": "Watch: Rahul Gandhi captures Priyanka's Parliament debut in candid momentRahul Gandhi was seen clicking the picture of her sister Priyanka Gandhi as she began her journey as a Member of Parliament from the Wayanad constituency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-election-voter-turnout-data-variation-election-commission-sy-quraishi-2641458-2024-11-28",
      "headline": "Worrying: Ex-poll body chief on big variation in Maharashtra final turnout dataMaharashtra Election: In Maharashtra, which went to polls on November 20, the voting figures at 5 pm was 55%. The final voter turnout, released the next day, saw it go up to 67%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-indian-team-meets-australian-prime-minister-in-canberra-ahead-of-2nd-test-2641601-2024-11-28",
      "headline": "Team India meets Anthony Albanese, Australian PM reveals message to PM ModiAUS vs IND: The Indian team met the Australian Prime Minister, Anthony Albanese, in Canberra. The Indian team will face Australia Prime Minister's XI in a two-day practice match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/priyanka-gandhi-vadra-rahul-gandhi-sonia-gandhi-oath-mp-lok-sabha-rajya-sabha-parliament-winter-session-wayanad-raebareli-2641433-2024-11-28",
      "headline": "Priyanka Gandhi Vadra, in Kerala Kasavu saree, takes oath as Wayanad MPWith 52-year-old Priyanka Gandhi Vadra's entry into the Lok Sabha after her massive victory in Kerala's Wayanad, Parliament now has three members of the Gandhi family for the first time in decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-prashant-vihar-pvr-explosion-heard-police-rush-to-spot-investigation-underway-2641544-2024-11-28",
      "headline": "Blast at shop near PVR in Delhi, white powder-like substance found on spotA loud explosion was heard near a PVR multiplex in Delhi today, prompting the police to rush to the spot and investigate the cause of the blast. A white powder-like substance was found at the spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/maharashtra/story/uddhav-sena-wont-leave-maha-vikas-aghadi-sanjay-raut-denies-post-election-rift-rumours-2641522-2024-11-28",
      "headline": "Uddhav Sena won't leave Maha Vikas Aghadi: Sanjay Raut denies rift rumoursThe Uddhav Sena leader's remarks came less than a week after the ruling BJP-led Mahayuti in Maharashtra secured a stunning victory in the recently-concluded Assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-techie-experience-ordering-food-zomato-mumbai-pune-train-his-verdict-2641504-2024-11-28",
      "headline": "Bengaluru techie shares experience of ordering food via Zomato on train. His verdict During his journey, Sunny R Gupta happened to open Zomato on his phone as a prompt on the app asked him to enter his Passenger Name Record (PNR). He thought of trying it and placed an order for a Triple Schezwan Rice. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-australian-pm-anthony-albanese-spice-banter-jasprit-bumrah-canberra-2641632-2024-11-28",
      "headline": "Watch: Virat Kohli, Australian PM engage in 'spicy' banter over Perth TestBorder-Gavaskar Trophy: Australian Prime Minister Anthony Albanese praised Jasprit Bumrah and Virat Kohli for their match-winning efforts in the Perth Test. PM Anthony hosted the Indian team at the Parliament House in Canberra on Thursday, November 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-us-president-meta-ceo-mark-zuckerberg-dine-mar-a-logo-golf-club-resort-2641584-2024-11-28",
      "headline": "End of enmity? Trump, Mark Zuckerberg dine at US President-elect's resortA spokesperson for Meta confirmed that Zuckerberg and Trump met on Wednesday, saying he was invited for dinner with the President-elect and other members of his team to talk about the incoming administration."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/jharkhand/story/jharkhand-butcher-kills-live-in-partner-chops-body-into-50-pieces-dog-finds-remains-2641434-2024-11-28",
      "headline": "Jharkhand butcher kills live-in partner, chops body into 50 piecesJharkhand Murder: According to the police, Naresh Bhengra and Gangi Kumari had been in a live-in relationship for the past few years, but he got married to another woman in Khunti without informing Kumari. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-celebrates-thanksgiving-with-a-smoked-turkey-meal-in-space-2641553-2024-11-28",
      "headline": "Sunita Williams celebrates Thanksgiving with a smoked turkey mealSunita Williams noted that Nasa has prepared a Thanksgiving-inspired menu to ensure they can celebrate the occasion meaningfully."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-sunk-sharad-pawars-ncp-independents-blowing-their-own-trumpet-2641019-2024-11-27",
      "headline": "What sunk Sharad Pawar's NCP? Independents blowing their own 'trumpet'Contestants with the 'trumpet' symbol—closely resembling the NCP (SCP)'s 'tutari'—secured crucial votes in seats that Pawar's party lost narrowly in the Maharashtra polls\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/ceasefire-israel-will-be-relieved-hezbollah-cant-be-believed-opinion-2641341-2024-11-28",
      "headline": "Ceasefire: Israel will be relieved, Hezbollah can't be believedThe Israeli Cabinet has approved a US-French-backed ceasefire with Lebanon, bringing hope to southern Lebanon after months of conflict. Yet, concerns remain over Hezbollah's commitment and future stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/priyanka-gandhi-vadra-honors-keralas-heritage-with-iconic-kasavu-saree-2641527-2024-11-28",
      "headline": "Priyanka Gandhi Vadra honours Kerala's heritage with the iconic Kasavu sareeWhite and gold Kasavu sarees, often associated with the vibrant festival of Onam, hold profound cultural significance in Kerala's heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/kolkata-yellow-taxis-farewell-over-fifty-percent-exit-roads-2641592-2024-11-28",
      "headline": "Goodbye yellow taxis: Kolkata to lose over half of its iconic fleetKolkata's iconic yellow taxis, cherished symbols of the city's character and charm, are now on the brink of a major transformation, with over half of the fleet set to retire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-royal-challengers-bengaluru-face-backlash-over-launch-of-social-media-page-in-hindi-2641426-2024-11-28",
      "headline": "Royal Challengers Bengaluru face backlash over launch of X account in HindiIPL Auction: Royal Challengers Bengaluru have faced backlash from home fans and pro-Kannada activists for launching social media accounts in Hindi. Many have called out the RCB's move by alleging that the franchise is imposing Hindi down their throats."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cyclone-fengal-name-origin-set-to-intensify-landfall-time-tamil-nadu-weather-2641471-2024-11-28",
      "headline": "Cyclone Fengal set to intensify, heavy rainfall in several Tamil Nadu districts  Live UpdatesCyclone Fengal is expected to intensify and cross Tamil Nadu-Puducherry coasts by November 30. The Indian Navy is actively preparing for relief and rescue operations to mitigate the storm's impact. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/enforcement-directorate-team-attacked-in-delhi-cyber-fraud-money-laundering-case-raid-fir-registered-2641456-2024-11-28",
      "headline": "ED team attacked in Delhi during raids in cyber fraud case, officer injuredThe ED had registered an FIR in connection with the case pertaining to cyber app fraud linked to the UAE-based Pyypl payment aggregator."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-arhaan-khan-new-restaurant-scarlett-house-2641643-2024-11-28",
      "headline": "Inside Malaika Arora-Arhaan Khan's new restaurant: Vintage, warm and cosyMalaika Arora and son Arhaan Khan have opened Scarlett House, a chic restaurant in Mumbai. Housed in a vintage Portuguese bungalow, it features cosy interiors and a menu blending healthy and indulgent dishes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/dua-lipa-mumbai-concert-zomato-singer-secret-india-trip-shah-rukh-khan-2641622-2024-11-28",
      "headline": "Dua Lipa's Mumbai concert: Throwback to singer's secret India trip Singer Dua Lipa is set to perform in Mumbai on November 30. Ahead of her rocking show, let us delve into the time when she secretly visited India with her friends.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saqib-saleem-on-memorable-awkward-kiss-with-randeep-hooda-in-bombay-talkies-2641595-2024-11-28",
      "headline": "Saqib Saleem on 'memorable, awkward' kiss with Randeep Hooda in Bombay TalkiesActor Saqib Saleem discussed his experience filming the kissing scene with Randeep Hooda in Bombay Talkies. Both Saqib and Randeep shared screen space in the 2013 anthology film's first short film, Ajeeb Dastan Hai Yeh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-advance-booking-can-allu-arjun-beat-kgf-2-jawan-to-rule-at-box-office-2641633-2024-11-28",
      "headline": "Pushpa 2 advance booking: Can Allu Arjun beat KGF 2, Jawan to rule at box office?Pushpa 2: The Rule has registered a solid start in advance booking overseas. Back home, this Allu Arjun-starrer is aiming at beating the pre-sales records set by Yash's KGF 2, and Shah Rukh Khan's Jawan. Check the detailed report here. "
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/world-test-championship-is-confusing-england-captain-ben-stokes-2641650-2024-11-28",
      "headline": "World Test Championship is confusing: England captain Ben StokesEngland captain Ben Stokes said that he was quite confused by the format of the World Test Championship. Stokes' England are currently at the 6th position in the points table and are unlikely to make it to the final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-captain-rohit-sharmas-full-speech-at-australian-parliament-2641635-2024-11-28",
      "headline": "Watch: India captain Rohit Sharma's full speech at Australian parliamentIndia captain Rohit Sharma gave a lovely speech at the Australian parliament on Thursday, 28 November. Sharma spoke highly about the relations that both countries share and called Australia a proud and competitive nation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-australian-pm-anthony-albanese-spice-banter-jasprit-bumrah-canberra-2641632-2024-11-28",
      "headline": "Watch: Virat Kohli, Australian PM engage in 'spicy' banter over Perth TestBorder-Gavaskar Trophy: Australian Prime Minister Anthony Albanese praised Jasprit Bumrah and Virat Kohli for their match-winning efforts in the Perth Test. PM Anthony hosted the Indian team at the Parliament House in Canberra on Thursday, November 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bajrang-punia-four-year-doping-ban-not-surprised-will-be-lifted-if-join-bjp-2641626-2024-11-28",
      "headline": "My doping ban will be lifted if I join BJP: Bajrang PuniaBajrang Punia was handed a four-year ban by the National Anti-Doping Agency on Tuesday. The Tokyo Olympics bronze medalist accused the Bharatiya Janata Party of targeting him for having been one of the faces of the wrestlers' protest against Brij Bhushan Sharan Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kl-rahul-bengaluru-fc-parth-jindal-delhi-capitals-ipl-2025-auction-2641617-2024-11-28",
      "headline": "KL Rahul to Bengaluru FC? Cricketer sends a message to Parth Jindal after IPL auctionStar India batter KL Rahul asked his new owner Parth Jindal about any openings in his football team Bengaluru FC after exhibiting his football skills on the cricket ground during the first Test against Australia in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-indian-team-meets-australian-prime-minister-in-canberra-ahead-of-2nd-test-2641601-2024-11-28",
      "headline": "Team India meets Anthony Albanese, Australian PM reveals message to PM ModiAUS vs IND: The Indian team met the Australian Prime Minister, Anthony Albanese, in Canberra. The Indian team will face Australia Prime Minister's XI in a two-day practice match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ben-stokes-england-wtc-standings-brendon-mccullum-2641591-2024-11-28",
      "headline": "Stokes-McCullum need series win vs IND or AUS to call Bazball a success: CookFormer England captain Alastair Cook said that Brendon McCullum and Ben Stokes need a marquee series win under their belt - either against Australia or India. Cook made on the sidelines of the opening Test match between England and New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/first-time-since-2018-kane-williamson-departs-in-nervous-nineties-vs-england-2641566-2024-11-28",
      "headline": "First time since 2018: Kane Williamson departs in nervous nineties vs EnglandKane Williamson narrowly missed out on his 33rd Test hundred as he was dismissed by 93 by Gus Atkinson. This was the first time since 2018 when Williamson departed in nervous nineties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-manchester-united-willing-to-help-macrucs-rashford-ruben-amorim-2641552-2024-11-28",
      "headline": "Man United willing to help Marcus Rashford: Amorim on struggling starManchester United manager Ruben Amorim has said that the club is willing to help struggling forward Marcus Rashford if the player wants to get better. Amorim made his comments after Man United's 1-1- draw vs Ipswich."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ben-stokes-england-wtc-standings-brendon-mccullum-2641591-2024-11-28",
      "headline": "Stokes-McCullum need series win vs IND or AUS to call Bazball a success: CookFormer England captain Alastair Cook said that Brendon McCullum and Ben Stokes need a marquee series win under their belt - either against Australia or India. Cook made on the sidelines of the opening Test match between England and New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/first-time-since-2018-kane-williamson-departs-in-nervous-nineties-vs-england-2641566-2024-11-28",
      "headline": "First time since 2018: Kane Williamson departs in nervous nineties vs EnglandKane Williamson narrowly missed out on his 33rd Test hundred as he was dismissed by 93 by Gus Atkinson. This was the first time since 2018 when Williamson departed in nervous nineties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-manchester-united-willing-to-help-macrucs-rashford-ruben-amorim-2641552-2024-11-28",
      "headline": "Man United willing to help Marcus Rashford: Amorim on struggling starManchester United manager Ruben Amorim has said that the club is willing to help struggling forward Marcus Rashford if the player wants to get better. Amorim made his comments after Man United's 1-1- draw vs Ipswich."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/despite-kane-williamsons-93-england-dominate-day-1-of-1st-test-vs-new-zealand-2641523-2024-11-28",
      "headline": "Despite Kane Williamson's 93, England dominate Day 1 of 1st Test vs New ZealandNZ vs ENG: Kane Williamson scored a brilliant 93 as New Zealand ended Day 1 at 319/8. Shoaib Bashir was the pick among the English bowlers with four wickets at Hagley Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-champions-league-kylian-mbappe-real-madrid-vs-liverpool-2641508-2024-11-28",
      "headline": "Mbappe lacking in confidence: Real Madrid boss after loss vs LiverpoolReal Madrid forward Kylian Mbappe is struggling to score due to lack of confidence, feels coach Carlo Ancelotti. The coach made his comments after his team's 0-2 loss vs Liverpool."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-delhi-capitals-rishabh-pant-wants-to-captain-india-bgt-ind-vs-aus-2641489-2024-11-28",
      "headline": "Rishabh Pant's ambitions are clear, he wants to captain India: Parth JindalDelhi Capitals co-owner Parth Jindal said that Rishabh Pant is very clear in his ambition. Jindal said that Pant one day, wants to captain the Indian cricket team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-fans-play-cricket-take-pics-on-ground-during-lunch-break-of-nz-vs-eng-2641476-2024-11-28",
      "headline": "Watch: Fans play cricket, take pics on ground during lunch break of NZ vs ENGNZ vs ENG 1st Test: The Hagley Oval stadium witnessed fans coming on to the ground, playing cricket and clicking pictures on Day 1 of the Test match during lunch break. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/rcbs-hindi-instagram-sparks-controversy-ytvd-2641432-2024-11-28",
      "headline": "RCB's launch of Hindi Instagram stirs controversy among fansRCB's Hindi Instagram launch faces backlash from fans and Kannada activists, sparking a language debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-beau-webster-uncapped-australian-all-rounder-added-to-adelaide-test-squad-2641461-2024-11-28",
      "headline": "Who is Beau Webster: Uncapped Australian all-rounder added to Adelaide Test squadAUS vs IND: Tasmanian all-rounder Beau Webster has been added to Australia's squad for the 2nd Test vs India. He came into the squad amid fitness concerns for Mitchell Marsh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-rohit-sharma-all-smiles-as-indian-team-lands-in-canberra-for-2nd-test-2641450-2024-11-28",
      "headline": "Watch: Rohit Sharma all smiles as Indian team lands in Canberra for 2nd TestThe Indian team travelled from Perth to Canberra for the 2nd Test match, set to be played in Adelaide. The Pink ball Test will begin on December 6, Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-india-vs-pakistan-pcb-chief-mohsin-naqvi-2641443-2024-11-28",
      "headline": "India not playing cricket in Pakistan is unacceptable: Mohsin NaqviPakistan Cricket Board chairman Mohsin Naqvi has said that India not wanting to play cricket in Pakistan is unacceptable. Naqvi has said that India should honour gesture when Pakistan went to play in India during the World Cup, despite political differences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/rcbs-hindi-instagram-sparks-controversy-ytvd-2641432-2024-11-28",
      "headline": "RCB's launch of Hindi Instagram stirs controversy among fansRCB's Hindi Instagram launch faces backlash from fans and Kannada activists, sparking a language debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-beau-webster-uncapped-australian-all-rounder-added-to-adelaide-test-squad-2641461-2024-11-28",
      "headline": "Who is Beau Webster: Uncapped Australian all-rounder added to Adelaide Test squadAUS vs IND: Tasmanian all-rounder Beau Webster has been added to Australia's squad for the 2nd Test vs India. He came into the squad amid fitness concerns for Mitchell Marsh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-rohit-sharma-all-smiles-as-indian-team-lands-in-canberra-for-2nd-test-2641450-2024-11-28",
      "headline": "Watch: Rohit Sharma all smiles as Indian team lands in Canberra for 2nd TestThe Indian team travelled from Perth to Canberra for the 2nd Test match, set to be played in Adelaide. The Pink ball Test will begin on December 6, Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-india-vs-pakistan-pcb-chief-mohsin-naqvi-2641443-2024-11-28",
      "headline": "India not playing cricket in Pakistan is unacceptable: Mohsin NaqviPakistan Cricket Board chairman Mohsin Naqvi has said that India not wanting to play cricket in Pakistan is unacceptable. Naqvi has said that India should honour gesture when Pakistan went to play in India during the World Cup, despite political differences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kl-rahul-hopes-to-win-ipl-with-dc-wants-love-and-respect-parth-jindal-2641440-2024-11-28",
      "headline": "KL Rahul hopes to win IPL with DC, wants love and respect: Parth JindalDelhi Capitals co-owner Parth Jindal has said that KL Rahul told him that he wants to win the IPL with the franchise. Jindal said that KL Rahul wants love and respect from the management and the fans.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-royal-challengers-bengaluru-face-backlash-over-launch-of-social-media-page-in-hindi-2641426-2024-11-28",
      "headline": "Royal Challengers Bengaluru face backlash over launch of X account in HindiIPL Auction: Royal Challengers Bengaluru have faced backlash from home fans and pro-Kannada activists for launching social media accounts in Hindi. Many have called out the RCB's move by alleging that the franchise is imposing Hindi down their throats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-bgt-virat-kohli-rahul-dravid-warns-australia-2641404-2024-11-28",
      "headline": "Virat Kohli will have a big series, Dravid warns AustraliaStar India batter Virat Kohli will have a big series in Australia, said Rahul Dravid ahead of the 2nd Test match at Adelaide. Dravid said that Kohli has been batting really well overseas and getting a hundred early against Australia will free him up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/new-zealand-sri-lanka-south-africa-india-wtc-final-2641036-2024-11-28",
      "headline": "India back in contention: 5 teams in home stretch of race to WTC FinalIndia, Australia, Sri Lanka, South Africa and New Zealand are fighting for two spots in the WTC 2023-25 final. India are the table-toppers after beating Australia by 295 runs in the Perth Test. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}