{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/salary-survey-2025-foundit-appraisals-done-not-enough-employees-want-to-change-jobs-2759058-2025-07-21",
      "headline": "Over 85% of employees plan to change jobs after salary hikes in 2025: SurveyMost hikes fell in the 5–10% range, with only a small fraction crossing the 20% mark. Advertising, education, and IT saw the highest share of professionals reporting no hike at all, while sectors like energy and BFSI offered relatively better payouts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-shock-for-karnataka-vendor-raises-concerns-among-small-upi-users-2759049-2025-07-21",
      "headline": "GST shock for Karnataka vendor raises concerns among small UPI usersThe incident shows why small traders might stop taking UPI payments out of fear. Many would rather handle cash than deal with confusing tax demands. This goes against the government's aim of building a cashless economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/real-estate-homes-under-rs-1-crore-metro-city-property-price-rs-1-crore-new-delhi-mumbai-bangalore-2759033-2025-07-21",
      "headline": "Affordable homes are vanishing. Can you still get a 2BHK for Rs 1 crore?Real estate prices across major metros have surged due to strong demand, high construction costs, and a steady flow of luxury housing projects. Yet, there are still locations in both Tier-1 and Tier-2 cities where a 2BHK under Rs 1 crore is within reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-442-points-nifty-ends-above-25000-eternal-jumps-over-7-2759031-2025-07-21",
      "headline": "Sensex gains 442 points, Nifty ends above 25,000; Eternal jumps over 7%The S&P BSE Sensex gained 442.61 points to close at 82,200.34, while the NSE Nifty50 added 122.30 points to end at 25,090.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/have-not-got-your-tax-refund-yet-here-is-why-it-may-be-delayed-wrong-hra-claims-mismatch-itr-ais-data-2758954-2025-07-21",
      "headline": "Haven't got your tax refund yet? Here's why it may be delayedSometimes, taxpayers claim deductions like HRA or medical insurance without having proper proof. If the tax department finds something suspicious, they may stop your refund and send you a notice for more details."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-now-hosts-over-half-the-worlds-gccs-led-by-bengaluru-2758930-2025-07-21",
      "headline": "India now hosts over half the world's GCCs, led by BengaluruFrom cost-saving outposts to strategic anchors, India's GCC evolution is reshaping global operations. As Tier-2 cities gear up, the next big wave might come from smaller, smarter urban bets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-in-lok-sabha-today-how-it-impacts-you-2758892-2025-07-21",
      "headline": "New income tax bill in Lok Sabha today: How it impacts youThe Bill aims to make clearer rules for exemptions, TDS, TCS, and not-for-profit organisations. All this, the government hopes, will cut down on confusion and save everyone time and trouble."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karnataka-vegetable-vendor-hit-with-rs-29-lakh-gst-notice-here-is-why-2758841-2025-07-21",
      "headline": "Karnataka vegetable vendor hit with Rs 29 lakh GST notice. Here's whySelling veggies for four years and accepting UPI has landed Shankargouda with a Rs 29 lakh GST notice on Rs 1.63 crore turnover."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/anthem-biosciences-share-price-nse-bse-27-percent-premium-market-debut-review-2758793-2025-07-21",
      "headline": "Anthem Biosciences share price: Stock lists at 27% premium on market debutAnthem Biosciences stock price: The company's shares opened at Rs 723.05 on the NSE and Rs 723.10 on the BSE. This was about 27% higher than its issue price of Rs 570."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/burger-singh-hilariously-debunks-rs-47-crore-funding-report-clatification-goes-viral-2758780-2025-07-21",
      "headline": "Burger Singh debunks Rs 47 crore funding claim with viral statementIn a statement that's equal parts denial and stand-up comedy set, the homegrown burger chain responded to reports that it had secured a Rs 47.15 crore investment round, calling the claims premature, misleading, and just plain wrong—at least for now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-below-25000-ril-reliance-shares-falls-2-percent-2758766-2025-07-21",
      "headline": "Sensex opens flat, Nifty below 25,000; RIL falls 2%The S&P BSE Sensex was down by 130.29 points to 81,627.44, while the NSE Nifty50 lost 48.95 points to 24,919.45 as of 9:22 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coindcx-hacked-usd-44-million-lost-cyberattack-what-crypto-platform-said-user-money-wallet-2758748-2025-07-21",
      "headline": "CoinDCX loses $44 million in cyberattack: Here's what the crypto platform saidThis is the second large-scale hack involving an Indian crypto exchange in the past year. In July 2024, WazirX lost $234 million when one of its wallets hosted on Liminal was compromised."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prithviraj-praises-ibrahim-ali-khan-sarzameen-debut-criticism-comparison-2759042-2025-07-21",
      "headline": "Prithviraj on Ibrahim Ali Khan facing flak: Even SRK gets criticisedPrithviraj Sukumaran praises Ibrahim Ali Khan as a well-prepared debutant in 'Sarzameen'. He compares the criticism Ibrahim faces to that of Shah Rukh Khan, emphasising the continuous challenges actors encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pushpa-stree-makers-congratulate-saiyaara-team-box-office-success-2759056-2025-07-21",
      "headline": "Pushpa, Stree makers congratulate Saiyaara team on success, call film a sensationMakers of the 'Pushpa' starring Allu Arjun, Mythri Movie Makers, and 'Stree' makers, Maddock Films, congratulated the box office success of Mohit Suri's latest romantic musical drama 'Saiyaara'. The film crossed Rs 100 crore worldwide during its opening weekend."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohan-babu-on-friendship-with-rajinikanth-i-call-him-bloody-thalaiva-2759043-2025-07-21",
      "headline": "I call him bloody Thalaiva: Mohan Babu on friendship with RajinikanthOver the last fifty years, Mohan Babu and Rajinikanth have shared more than just screen space; theirs is a friendship rooted in simplicity and banter. Recalling their bond, Mohan Babu said he affectionately refers to the superstar as \"bloody Thalaiva,\" a nickname born out of friendship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-makes-startling-claim-i-do-not-rank-as-high-as-other-heroes-2758983-2025-07-21",
      "headline": "I don't rank as high as other heroes: Pawan Kalyan makes startling claimActor and politician Pawan Kalyan spoke honestly about the struggles behind 'Hari Hara Veera Mallu', praising his team and downplaying his own stardom. He said that his movies do not rake in numbers as other films featuring big heroes do."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/love-insurance-kompany-release-delayed-budget-dispute-vignesh-shivan-pradeep-ranganathan-krithi-shetty-sj-suryah-2759009-2025-07-21",
      "headline": "Vignesh Shivan's Love Insurance Kompany postponed to 2026 due to budget issuesThe release of director ignesh Shivan's romantic comedy 'Love Insurance Kompany' has been delayed. The postponement is reportedly due to budget overruns and production disputes, impacting post-production and the initial release schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-launches-her-fragrance-brand-vijay-deverakonda-cheers-2758913-2025-07-21",
      "headline": "Rashmika Mandanna launches perfume brand, Vijay Deverakonda gives a shout-outActor Rashmika Mandanna launched her fragrance line, Dear Diary, on Monday, calling the project very close to her heart. On the occasion, actor Vijay Deverakonda showed his support on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-worldwide-box-office-collection-day-3-detailed-report-yrf-smashes-rs-100-crore-biggest-ever-for-debutants-2759011-2025-07-21",
      "headline": "Saiyaara worldwide box office Day 3: Rs 100 crore done, biggest ever for debutants'Saiyaara' is on its way to being a clean blockbuster at the box office. The YRF biggie has recorded the biggest opening weekend worldwide for a Hindi film starring debutants, and a Bollywood love story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-confronts-fan-for-filming-without-permission-later-agrees-to-selfie-2758972-2025-07-21",
      "headline": "Akshay Kumar confronts fan for filming without permission, later agrees to selfieAkshay Kumar confronted a fan in London for recording him without permission but later calmed down and posed for a selfie. The incident sparked debate online about respecting celebrities' privacy in public spaces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vir-das-netflix-special-fool-volume-indian-freelancers-creative-control-2758975-2025-07-21",
      "headline": "Vir Das's Fool Volume spotlights Indian crew in global Netflix specialVir Das's Netflix special Fool Volume features 65 Indian freelancers earning first credits. The special challenges western narratives by focusing on Indian creative control and talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jeethu-joseph-delays-hindi-drishyam-3-to-prioritise-malayalam-version-2758937-2025-07-21",
      "headline": "Drishyam director recalls issuing warning to makers of Ajay Devgn starrerJeethu Joseph, director of the Mohanlal starrer 'Drishyam' movies, recently revealed having to prevent the makers of Ajay Devgn's Hindi version from getting an early start. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-bulks-up-sweats-it-out-in-the-gym-ahead-of-peddi-shoot-viral-pic-2758910-2025-07-21",
      "headline": "Ram Charan bulks up, sweats it out in the gym for Peddi. Viral picRam Charan's transformation for 'Peddi' has set social media abuzz. A new gym photo shared by the actor gives fans a glimpse into the intense prep behind his rugged look, with a crucial schedule of the film starting this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kashmiri-artistes-behind-saiyaara-soul-stirring-faheem-abdullah-arslan-nizami-with-mohit-suri-tanishk-bagchi-starring-ahaan-panday-aneet-padda-2758944-2025-07-21",
      "headline": "Meet two Kashmiri artistes who are behind Saiyaara's soul-stirring music'Saiyaara' gave India a melody to hum, but it also gave us two Kashmiri artistes - Faheem Abdullah and Arslan Nizami. Their Bollywood debut is like a representation of talent and dreams rooted in the mountains, finally finding flight in Mumbai's skies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kartik-aaryan-anurag-basu-film-delayed-2026-saiyaara-success-impact-2758865-2025-07-21",
      "headline": "Kartik Aaryan's film delayed due to Saiyaara? Anurag Basu breaks silenceKartik Aaryan and Anurag Basu's upcoming musical-drama film release has been postponed to 2026. The delay is reportedly due to the success of Saiyaara and the need to avoid thematic comparisons with it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/replace-nutan-sharma-name-ai-generated-turban-scene-government-directs-6-tweaks-in-udaipur-files-movie-2758965-2025-07-21",
      "headline": "Government directs 6 tweaks to Udaipur Files: Nutan Sharma name, AI turban sceneIndia Today has accessed the Ministry's order dated July 21, which accepted the report submitted by the committee on July 19 and instructed the Central Board of Film Certification (CBFC) and the producer of the film to take necessary action on the proposed changes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-adhik-ravichandran-ak64-film-collaboration-racing-interest-2758887-2025-07-21",
      "headline": "Ajith to reunite with director Adhik Ravichandran after Good Bad Ugly's successDuring a recent press meet, 'Good Bad Ugly' director Adhik Ravchandran confirmed that he will be collaborating with Tamil actor Ajith once again. He said that 'AK64' would be a treat for the fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-rescues-snake-with-bare-hands-urges-to-call-experts-in-such-situations-2758929-2025-07-21",
      "headline": "Sonu Sood rescues snake with bare hands, urges public to call expertsSonu Sood calmly rescued a non-venomous snake from his Mumbai society with bare hands. He shared the video on social media and urged people to call experts in such situations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-video-rangeen-series-release-july-25-comedy-drama-betrayal-self-discovery-2758891-2025-07-21",
      "headline": "Rangeen trailer: Viineet Siingh turns gigolo in wild revenge comedyPrime Video released the trailer of its upcoming series 'Rangeen' today. Created by Amardeep Galsin and Amir Rizvi,  the series stars Viineet Kumar Siingh, Rajshri Deshpande, Taaruk Raina, and Sheeba Chaddha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-troupe-known-star-trek-mission-impossible-dies-97-2758876-2025-07-21",
      "headline": "Veteran actor Tom Troupe, known for Star Trek and Mission Impossible, dies at 97Veteran actor Tom Troupe, renowned for his celebrated career on Broadway and appearances in over 75 television shows, has died due to natural causes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vir-das-promotes-fool-volume-with-hilarious-poha-twist-on-new-york-street-2758854-2025-07-21",
      "headline": "Vir Das promotes his new show with hilarious Poha twist on New York street. VideoVir Das promoted his Netflix special 'Fool Volume' with a funny video on the streets of New York, where he pretended to be Rajinder Poha, the heir to India's iconic snack. The creative promo left fans in splits and got people talking about Poha and his comedy."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-air-force-aircraft-crashes-on-school-building-in-dhaka-during-training-sortie-many-feared-dead-2758970-2025-07-21",
      "headline": "19 dead as Bangladesh Air Force jet crashes into Dhaka schoolA China-made F-7 training jet of the Bangladesh Air Force crashed into a school in Dhaka, killing 16 people and injuring 70 others. A one-day state mourning was declared on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/former-kerala-chief-minister-vs-achuthanadan-dies-at-101-2759060-2025-07-21",
      "headline": "Ex-Kerala Chief Minister and veteran communist leader VS Achuthanadan dies at 101Veteran communist leader and former Kerala Chief Minister VS Achuthanandan passed away at 101. He led CPI(M) to power in 2006 and fought for workers, environment, and the poor. Known for his integrity, he inspired generations of Left activists.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/impeachment-of-justice-varma-moves-ahead-145-mps-submit-memorandum-to-speaker-2759034-2025-07-21",
      "headline": "Cash row: Impeachment of Justice Varma moves ahead as over 200 MPs submit motionMore than 200 MPs have submitted notices to Lok Sabha Speaker Om Birla and Rajya Sabha chairman Jagdeep Dhankhar seeking the removal of Justice Yashwant Varma, who is accused of misconduct after piles of unaccounted cash were found at his residence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-administration-weighed-h1b-indians-visa-system-ending-lottery-based-model-maga-2758931-2025-07-21",
      "headline": "Weighted H-1B visa system might end lottery-based model after DHS proposalThe Trump administration has proposed a weighted selection system for H-1B visas, moving away from the current random lottery model. The change would affect the 85,000 statutorily capped visas and prioritise factors like salary or qualifications. Indians, who make up the majority of H-1B recipients, might be impacted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karnataka-vegetable-vendor-hit-with-rs-29-lakh-gst-notice-here-is-why-2758841-2025-07-21",
      "headline": "Karnataka vegetable vendor hit with Rs 29 lakh GST notice. Here's whySelling veggies for four years and accepting UPI has landed Shankargouda with a Rs 29 lakh GST notice on Rs 1.63 crore turnover."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/strategic-daulat-beg-oldie-road-construction-ladakh-lac-bypass-china-surveillance-2758960-2025-07-21",
      "headline": "Border game changer: Strategic 'China-proof' road near LAC to be ready next yearThe new road will reduce the distance from Leh to Daulat Beg Oldie by 79 km and cut down the travel time dramatically from two days to just 11-12 hours. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/siddaramaiah-supreme-court-rejects-ed-appeal-against-wife-in-muda-case-karnataka-congress-centre-2758968-2025-07-21",
      "headline": "Centre misused ED, CBI for vendetta: Siddaramaiah after Supreme Court clears wifeSiddaramaiah hailed Supreme Court's dismissal of the ED's appeal to probe Siddaramaiah's wife over the Mysuru Urban Development Authority (Muda) site case as justice and slammed BJP's misuse of agencies. He demanded apologies from BJP and JD(S) leaders.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/mapping-conflict-and-its-flawed-characters-2757921-2025-07-18",
      "headline": "Mapping conflict and its 'flawed' characters'The Company of Violent Men' chronicles interesting vignettes of investigative reporting from the subcontinent, spotlighting lives branded 'good and evil' by the news cycle\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/why-young-indian-couples-are-putting-on-the-kilos-icmr-study-obesity-overweight-2758914-2025-07-21",
      "headline": "Why young Indian couples are putting on the kilosYoung urban Indian couples are increasingly gaining weight together due to lifestyle changes and food app culture. This trend raises concerns about rising obesity and related health complications in newly married couples."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/betting-app-case-ed-issues-fresh-summons-to-google-meta-for-july-28-after-no-show-today-2759053-2025-07-21",
      "headline": "Betting app case: ED summons Google, Meta again for July 28 after no-showBoth tech giants have been accused of promoting betting apps and giving prominence to advertisements and websites related to online betting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/2006-mumbai-train-blast-convicts-acquitted-bombay-high-court-torture-unreliable-witnesses-2758830-2025-07-21",
      "headline": "Why all 12 convicts of 2006 Mumbai train blasts walked freeNearly 19 years after the train blasts that killed 189, the Bombay High Court has acquitted all 12 convicts, citing torture, unreliable witnesses and botched evidence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/mumbai-man-shreds-lehenga-with-knife-after-fiance-dispute-with-shopkeeper-viral-video-2758988-2025-07-21",
      "headline": "Video: Mumbai man shreds lehenga with knife after fiancee's dispute with shopkeeperA man from Mumbai shredded a Rs 32,000 bridal lehenga with a knife inside a store in Kalyan after his fiancee had a heated argument with the shopkeeper."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-origin-astrologer-held-for-duping-senior-citizen-woman-evil-spirit-claim-hicksville-new-york-hemanth-kumar-muneppa-us-crime-2758874-2025-07-21",
      "headline": "Evil spirits and a scam: Indian-origin astrologer arrested in New YorkA 33-year-old Indian-origin astrologer was arrested in New York for scamming a 68-year-old woman out of tens of thousands of dollars. The woman believed she was being haunted by \"evil spirits\", and Hemanth Kumar Muneppa convinced her he had a cure. He now faces multiple charges, including grand larceny and a rarely used fortune-telling fraud statute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-bias-in-crash-report-india-decoded-black-box-for-1st-time-aviation-minister-in-rajya-sabha-2758870-2025-07-21",
      "headline": "No bias in crash report, western media pushing own narrative: Aviation Minister Live UpdatesRam Mohan Naidu said the probe into the Air India crash was being carried out in a transparent manner and castigated the Western media for trying to promote its own viewpoint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/lid-blows-off-excise-scam-in-jharkhand-whats-brewing-2757977-2025-07-18",
      "headline": "Lid blows off excise scam in Jharkhand: What's brewing?Rs 38 crore lost, the scam has exposed a network of forged guarantees, policy manipulation and bureaucratic connivance\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-recalls-sreesanths-daughter-slapgate-incident-2758734-2025-07-21",
      "headline": "Harbhajan Singh recalls Sreesanth's daughter confronting him: You hit my fatherFormer India cricketer Harbhajan Singh recalled his infamous slapgate incident with Sreesanth and how the latter's daughter confronted him for his mistake years later."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/not-a-fun-day-at-work-delta-pilots-aggressive-maneuver-evades-b-52-bomber-collision-glbs-2758709-2025-07-21",
      "headline": "Not a fun day: Delta pilot's 'aggressive manoeuvre' evades B-52 bomber collisionThe flight, operated by SkyWest as Delta Connection Flight 3788, was heading to its destination when the military jet suddenly appeared on a converging path. The pilot of the commercial Embraer 175 aircraft immediately took action to avoid the US bomber."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-flight-from-kochi-veers-off-mumbai-airport-runway-amid-heavy-rain-2758894-2025-07-21",
      "headline": "Air India flight from Kochi veers off runway in Mumbai amid heavy rainDespite skidding off Mumbai's main runway amid heavy rain, the Air India Airbus A320 taxied safely to the bay, leaving minor runway damage, officials said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/i-am-leader-of-opposition-not-being-allowed-to-speak-in-parliament-rahul-gandhi-alleges-bias-2758882-2025-07-21",
      "headline": "Rahul Gandhi claims he was gagged as Parliament session kicks off amid chaosBoth Houses of Parliament witnessed heated scenes, adjournments, and walkouts on the first day of the Monsoon Session, as the Opposition demanded a discussion on Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/the-rise-of-gpt-tutors-classroom-chatbots-and-what-it-means-for-real-educators-2758936-2025-07-21",
      "headline": "Can AI replace teachers?As AI tutors enter classrooms from California to Kerala, educators and parents are asking the big question: Can artificial intelligence really replace the human touch in teaching?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/why-carrying-your-own-cup-while-travelling-can-protect-you-from-microplastics-2758821-2025-07-21",
      "headline": "Why carrying your own cup could protect your brain, heart, hormonesIf you usually drink tea or coffee from a paper cup, it's a good idea to start using your own cup. Tejaswini AnanthKumar, who leads the Board of Governors at the Indian Institute of Engineering Science and Technology (IIEST), recently shared a post asking people to carry their own cups when they travel.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nimisha-priya-yemen-execution-postponed-musliyar-govt-row-kerala-christian-nurse-2757962-2025-07-21",
      "headline": "Nimisha Priya isn't off the hook, but politics of credit has peakedKerala nurse Nimisha Priya's execution in Yemen has been deferred after intervention by Sheikh Abubakr Ahmad Musliyar, the Grand Mufti of India. Her fate, however, remains uncertain. Meanwhile, a battle, political in nature, over the Musliyar hogging credit for the reprieve has erupted in Kerala. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/chief-justice-br-gavai-pulls-up-lawyer-for-calling-cash-row-judge-yashwant-varma-just-varma-is-he-your-friend-2758961-2025-07-21",
      "headline": "Is he your friend? Chief Justice pulls up lawyer for calling cash row judge 'Varma'A bench comprising Chief Justice of India BR Gavai and Justice K Vinod Chandran expressed strong disapproval as lawyer Mathews Nedumpara repeatedly referred to Allahabad High Court judge Yashwant Varma as just 'Varma'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/untamed-review-eric-bana-shines-in-netflix-emotional-crime-thriller-stunning-visuals-of-wild-2758842-2025-07-21",
      "headline": "Untamed review: Eric Bana shines in soulful crime-thriller set in the wildRelease Date:Thu Jul 17, 2025Untamed series review: 'Untamed' featuring Eric Bana is streaming on Netflix. The crime-thriller series blends a shocking murder mystery with emotional depth and human sensitivity. Is the miniseries worth your binge-list? Here's our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prithviraj-praises-ibrahim-ali-khan-sarzameen-debut-criticism-comparison-2759042-2025-07-21",
      "headline": "Prithviraj on Ibrahim Ali Khan facing flak: Even SRK gets criticisedPrithviraj Sukumaran praises Ibrahim Ali Khan as a well-prepared debutant in 'Sarzameen'. He compares the criticism Ibrahim faces to that of Shah Rukh Khan, emphasising the continuous challenges actors encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pushpa-stree-makers-congratulate-saiyaara-team-box-office-success-2759056-2025-07-21",
      "headline": "Pushpa, Stree makers congratulate Saiyaara team on success, call film a sensationMakers of the 'Pushpa' starring Allu Arjun, Mythri Movie Makers, and 'Stree' makers, Maddock Films, congratulated the box office success of Mohit Suri's latest romantic musical drama 'Saiyaara'. The film crossed Rs 100 crore worldwide during its opening weekend."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohan-babu-on-friendship-with-rajinikanth-i-call-him-bloody-thalaiva-2759043-2025-07-21",
      "headline": "I call him bloody Thalaiva: Mohan Babu on friendship with RajinikanthOver the last fifty years, Mohan Babu and Rajinikanth have shared more than just screen space; theirs is a friendship rooted in simplicity and banter. Recalling their bond, Mohan Babu said he affectionately refers to the superstar as \"bloody Thalaiva,\" a nickname born out of friendship."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-ruben-amorim-manchester-united-india-test-team-old-trafford-2759051-2025-07-21",
      "headline": "Kuldeep on talking tactics with Amorim: Asked if he sticks with 3-4-3Kuldeep Yadav was more than excited as he had the chance to speak with Manchester United's manager, Ruben Amorim. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-steve-harmison-on-kuldeep-yadav-and-washington-sundar-2759026-2025-07-21",
      "headline": "Should India drop Sundar for Kuldeep in Manchester? Steve Harmison answersFormer England fast bowler Steve Harmison has shared his thoughts on Kuldeep Yadav's inclusion in the Indian playing XI for the fourth Test against England at Old Trafford, Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/nepal-cricket-team-bcci-centre-of-excellence-bengaluru-t20-world-cup-qualifiers-2758998-2025-07-21",
      "headline": "Nepal to train at BCCI's Centre of Excellence for T20 World Cup qualifiersThe Nepal men's cricket team will take part in a 15-day camp at the BCCI's Centre of Excellence (COE) as part of their preparations for the T20 World Cup qualifiers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lancashire-to-honour-farokh-engineer-and-clive-lloyd-with-stands-at-old-trafford-2758967-2025-07-21",
      "headline": "Lancashire to honour Farokh Engineer and Clive Lloyd with stands at Old TraffordLegendary West Indies captain Clive Lloyd and former India wicketkeeper batter Farokh Engineer are set to be honoured by Lancashire cricket club with stands named after them at Old Trafford in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/freestyle-chess-grand-slam-levon-arnonian-arjun-erigaisi-r-praggnanddhaa-2758951-2025-07-21",
      "headline": "Freestyle Chess Grand Slam: Aronian wins, Erigasi, Praggnanandhaa finish 6th and 7thIn the Freestyle Chess Grand Slam in Las Vegas, Levon Aronian went on to win the entire tournament and take a cash prize of 200,000 USD."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-wasim-akram-asian-wickets-record-india-vs-england-manchester-test-2758943-2025-07-21",
      "headline": "Jasprit Bumrah targets Wasim Akram's twin Test records in EnglandJasprit Bumrah is on the verge of surpassing Wasim Akram's long-held record of 53 Test wickets in England, adding even more significance to his role in the high-stakes fourth Test starting 23 July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-mitchell-owen-emulates-ricky-ponting-and-david-warner-2758950-2025-07-21",
      "headline": "Mitchell Owen emulates Ponting and Warner's feat after remarkable debut vs WIAustralia batter Mitchell Owen emulated Ricky Ponting and David Warner's feat after his remarkable debut in the first T20I against West Indies in Jamaica."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-owen-t20i-debut-reaction-fifty-wicket-australia-win-west-indies-2758920-2025-07-21",
      "headline": "Mitchell Owen calls dream Australia debut against West Indies really specialMitchell Owen described his dream T20I debut for Australia against the West Indies as \"really special\" after delivering a match-winning all-round performance in Jamaica."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-2025-india-host-october-to-november-2758897-2025-07-21",
      "headline": "India to host Chess World Cup 2025 in October-NovemberIndia will host this year's chess World Cup from October 30 to November 27 with a host city for the event to be named in \"due course\", the sport's global governing body FIDE announced on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mikel-arteta-arsenal-thomas-partey-sexual-assault-charges-2758884-2025-07-21",
      "headline": "Arteta backs Arsenal's approach on Partey amid sexual assault chargesMikel Arteta highlighted how he backed Arsenal to have followed all the right processes regarding Thomas Partey, who was charged with multiple counts of rape and sexual assault. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hashim-amla-excludes-sachin-tendulkar-names-virat-de-villiers-richards-best-batters-2758872-2025-07-21",
      "headline": "Sachin Tendulkar missing from Hashim Amla's list of top 3 greatest battersFormer South Africa captain Hashim Amla surprised fans by leaving out Sachin Tendulkar while naming his three greatest batters of all time. Amla revealed his picks ahead of the India Champions' clash in the World Championship of Legends in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-mitchell-owen-emulates-ricky-ponting-and-david-warner-2758950-2025-07-21",
      "headline": "Mitchell Owen emulates Ponting and Warner's feat after remarkable debut vs WIAustralia batter Mitchell Owen emulated Ricky Ponting and David Warner's feat after his remarkable debut in the first T20I against West Indies in Jamaica."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-owen-t20i-debut-reaction-fifty-wicket-australia-win-west-indies-2758920-2025-07-21",
      "headline": "Mitchell Owen calls dream Australia debut against West Indies really specialMitchell Owen described his dream T20I debut for Australia against the West Indies as \"really special\" after delivering a match-winning all-round performance in Jamaica."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-2025-india-host-october-to-november-2758897-2025-07-21",
      "headline": "India to host Chess World Cup 2025 in October-NovemberIndia will host this year's chess World Cup from October 30 to November 27 with a host city for the event to be named in \"due course\", the sport's global governing body FIDE announced on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mikel-arteta-arsenal-thomas-partey-sexual-assault-charges-2758884-2025-07-21",
      "headline": "Arteta backs Arsenal's approach on Partey amid sexual assault chargesMikel Arteta highlighted how he backed Arsenal to have followed all the right processes regarding Thomas Partey, who was charged with multiple counts of rape and sexual assault. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hashim-amla-excludes-sachin-tendulkar-names-virat-de-villiers-richards-best-batters-2758872-2025-07-21",
      "headline": "Sachin Tendulkar missing from Hashim Amla's list of top 3 greatest battersFormer South Africa captain Hashim Amla surprised fans by leaving out Sachin Tendulkar while naming his three greatest batters of all time. Amla revealed his picks ahead of the India Champions' clash in the World Championship of Legends in England."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}