{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/manappuram-finance-shares-crash-16-today-explained-brokerage-downgrade-asirvad-micro-finance-rbi-2618979-2024-10-18",
      "headline": "Explained: Why Manappuram Finance shares crashed 16% todayAt around 10:30 am shares of Manappuram Finance were down 16.15% to Rs 148.75 on the Bombay Stock Exchange (BSE).\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-stock-market-update-early-trade-shares-to-watch-manappuram-finance-wipro-infosys-2618970-2024-10-18",
      "headline": "Sensex, Nifty decline in early trade; Manappuram Finance tanks 15%Manappuram Finance Share Price: The S&P BSE Sensex was down 400.17 points to 80,606.44 at 10:12 am, while the NSE Nifty50 declined 96.85 points to trade at 24,653. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-allotment-today-check-status-online-guide-latest-gmp-shows-weak-listing-kfin-2618948-2024-10-18",
      "headline": "Hyundai IPO allotment today: Check status online; GMP shows weak listingHyundai Motor India IPO allotment: Investors can check their allotment status online. They can log in to either the BSE website or the website of Kfin Technologies Limited, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-details-10-things-to-know-before-subscribing-issue-size-price-band-gmp-2618649-2024-10-17",
      "headline": "Waaree Energies IPO: 10 things to know before subscribingWaaree Energies Limited (WEL), founded in 1990 and headquartered in Mumbai, is India's leading manufacturer and exporter of solar modules. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-allotment-details-check-latest-subscription-expected-listing-gains-gmp-2618590-2024-10-17",
      "headline": "Hyundai IPO allotment tomorrow: Check final subscription, expected listing gainsHyundai Motor India IPO: The public issue was initially met with hesitation from investors, but by the close on Thursday, October 17, it had been subscribed more than twice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wipro-q2-results-it-firm-announces-11-bonus-share-issue-for-shareholders-financial-results-net-profit-2618542-2024-10-17",
      "headline": "Wipro Q2 results: IT firm announces 1:1 bonus share issue for shareholdersWipro reported a 21% increase in net profit, reaching Rs 3,209 crore for the quarter ending in September, compared to Rs 2,646 crore in the same period last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-declares-interim-dividend-q2fy25-results-net-profit-revenue-2618510-2024-10-17",
      "headline": "Infosys declares interim dividend of Rs 21 for shareholders. Check key details Infosys interim dividend: The Bengaluru-based IT giant has set October 29, 2024, as the record date, with the payout scheduled for November 8, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wipro-q2-results-net-profit-jumps-21-percent-to-rs-3209-crore-consolidated-revenue-falls-2618501-2024-10-17",
      "headline": "Wipro Q2 results: Net profit jumps 21% to Rs 3,209 croreWipro's consolidated revenue for the July-September quarter decreased by 1%, amounting to Rs 22,302 crore, down from Rs 22,543 crore in the same quarter the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-q2fy25-results-net-profit-5-percent-rs-6505-crore-interim-dividend-21-2618495-2024-10-17",
      "headline": "Infosys Q2 results: Net profit up 5% to Rs 6,506 crore; Rs 21 dividend declaredInfosys Q2FY25 results: Revenue from operations for India's second-largest software services company also grew by 5% year-on-year, amounting to Rs 40,986 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-as-auto-stocks-drive-market-correction-2618492-2024-10-17",
      "headline": "Sensex, Nifty end lower as auto stocks drive market correctionThe S&P BSE Sensex was down 494.75 points to close at 81,006.61, while the NSE Nifty50 lost 221.45 points to end at 24,749.85.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-plunges-over-500-points-nifty-below-25000-amid-market-sell-off-2618434-2024-10-17",
      "headline": "Sensex plunges over 500 points, Nifty below 25,000 amid market sell-offThe Sensex fell by 525.34 points, or 0.64%, at 80,976.02. Similarly, the Nifty dropped 222 points, or 0.89%, below the 25,000 mark at 24,749.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/impact-of-bomb-threats-on-airlines-ytvd-2618388-2024-10-17",
      "headline": "How bomb threats affect airlines financiallySanjay Lazar delves into the effects of bomb threats on the aviation industry, examining both financial and emotional impacts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-fully-subscribed-on-day-3-latest-subscription-gmp-allotment-dates-details-2618426-2024-10-17",
      "headline": "Hyundai IPO fully booked: Check latest subscription, GMP, allotment detailsHyundai Motor India IPO: The company's shares are set to be listed on both the BSE and NSE, with a tentative listing date of Tuesday, October 22, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/skipping-hyundai-ipo-over-low-gmp-3-strong-reasons-to-apply-anyway-expert-view-review-analysis-2618362-2024-10-17",
      "headline": "Skipping Hyundai IPO over low GMP? 3 strong reasons to apply anywayHyundai Motor India IPO: Unlike some recent IPOs that experienced high demand, Hyundai's offering has seen limited interest from investors over valuation concerns, with the expected listing gains also taking a hit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-job-cut-whatsapp-instagram-teams-as-tech-layoffs-drag-on-2618337-2024-10-17",
      "headline": "Meta job cuts hit WhatsApp, Instagram teams as tech layoffs drag onThe recent layoffs follow a pattern of restructuring that Meta has been pursuing for more than a year"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bomb-hoaxes-on-flights-air-india-indigo-vistara-aviation-industrys-new-financial-headache-2618314-2024-10-17",
      "headline": "Hoax bomb threat on flights: Aviation industry's new financial headacheIn the past few days, Indian airlines have faced multiple hoaxes, forcing flight diversions and delays, piling up massive operational costs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-latest-gmp-subscription-details-should-you-subscribe-2618291-2024-10-17",
      "headline": "Hyundai IPO: Big drop in GMP on day 3, should you subscribe?Hyundai Motor IPO: Despite concerns about short-term gains, some brokerages are optimistic about Hyundai's future. Read on to know whether you should subscribe to the public issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-acs-alone-will-consume-more-power-than-all-of-mexico-by-2035-energy-consumption-iea-report-2618282-2024-10-17",
      "headline": "'New' India's ACs alone will consume more power than all of Mexico by 2035India's growing demand for energy will soon outpace that of many nations, with air conditioners alone expected to consume more electricity than the entire power usage of Mexico by 2035."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/auto-stocks-see-share-decline-bajaj-auto-hero-motocorp-maruti-mahindra-eicher-motors-2618266-2024-10-17",
      "headline": "Bajaj Auto, Hero MotoCorp, Maruti: Why auto stocks are falling todayAuto stocks, including Bajaj Auto, Hero MotoCorp, Maruti, Eicher Motors, and M&M, saw significant declines in early Thursday trade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bajaj-auto-shares-fall-10-percent-q2-results-explained-weak-sales-outlook-2618253-2024-10-17",
      "headline": "Explained: Why Bajaj Auto shares crashed 10% todayBajaj Auto shares dropped over 10% in early trade, following the company's Q2FY25 financial results."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/salman-khan-new-threat-mumbai-traffic-police-baba-siddique-lawrence-bishnoi-gang-5-crores-demand-2618908-2024-10-18",
      "headline": "New threat for Salman Khan: Pay Rs 5 crore or it'll be worse than Baba Siddique'sSalman Khan gets death threat: The message, received by Mumbai Traffic Police, demanded Rs 5 crore from Salman Khan to end the enmity with Lawrence Bishnoi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-netanyahu-iran-axis-of-terror-hamas-chief-yahya-sinwar-killed-2618904-2024-10-18",
      "headline": "Hamas chief killed, Netanyahu's message to Iran: Axis of terror collapsingAnnouncing the death of Yahya Sinwar, who masterminded the October 7, 2023, attack on Israel, Benjamin Netanyahu said the 'reign of terror' of the Iranian regime would also come to an end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/hardeep-singh-nijjar-murder-ripudaman-malik-nsa-jody-thomas-testifies-india-canada-diplomatic-row-trudeau-2618920-2024-10-18",
      "headline": "Canada's ex-NSA explains how cops changed tack in Nijjar killing probeJody Thomas, who was NSA at the time of Hardeep Singh Nijjar's murder, told the foreign interference inquiry that members of the Canadian Sikh community were not satisfied with the assessment that the killing was a tit-for-tat for Ripudaman Singh Malik's murder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/drone-video-footage-hamas-yahya-sinwar-final-moments-sitting-in-sofa-covered-in-dust-stick-2618929-2024-10-18",
      "headline": "Drone captures Yahya Sinwar's final moments: Sitting on sofa, covered in dustIn the footage, Hamas chief Yahya Sinwar is seen sitting alone in a destroyed apartment in Gaza, covered in dust. He hurls a stick or plank at the approaching Israeli drone."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/canada-hardeep-nijjar-murder-intel-vikash-yadav-former-india-spy-us-indictment-pannun-2618977-2024-10-18",
      "headline": "'Nijjar video shared with CC1': Is this the intel Canada is claiming to have?Canadian Prime Minister Justin Trudeau, earlier this week, said his government only had 'intelligence' and not concrete proof of links between Indian agents and the killing of Khalistani terrorist Hardeep Nijjar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ex-raw-official-charged-in-us-over-plot-to-murder-khalistani-terrorist-pannun-2618922-2024-10-18",
      "headline": "Ex-RAW official charged in US over plot to murder Khalistani terrorist PannunThe indictment claimed that the former Indian RAW official, along with his co-conspirator, plotted to kill Pannun in the summer of 2023 and hired an individual who demanded $100,000 for the job. The individual turned out to be an FBI informant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/is-pouch-milk-safer-than-milk-from-a-tetra-pak-2618288-2024-10-18",
      "headline": "Is pouch milk safer than milk from a tetra pak?Do you prefer milk in a box or a pouch? While we know that tetra pak or UHT milk can be stored for months, does this make it safer than regular pouch milk?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/zayn-malik-emotional-note-brother-liam-payne-death-falling-from-balcony-2618911-2024-10-18",
      "headline": "Zayn Malik remembers 'brother' Liam Payne: Wish to give you a hug one last timeZayn Malik shared an emotional note following the death of his former bandmate Liam Payne. He called him his brother and paid tribute to him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/rajasthan-the-royal-canvas-for-dream-weddings-2615738-2024-10-12",
      "headline": "Rajasthan: The Royal Canvas for Dream WeddingsWhether it's the grandeur of a palace wedding in Udaipur, the mystique of a desert wedding in Jaisalmer, or the creativity of a themed wedding in Jaipur, Rajasthan offers a wedding experience that is truly out of the ordinary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/iit-delhis-technology-ai-leadership-programme-shaping-the-future-of-tech-leadership-2616457-2024-10-14",
      "headline": "IIT Delhi's Technology & AI Leadership Programme: Shaping the Future of Tech LeadershipAdvance your career with IIT Delhi's Technology & AI Leadership Programme. Designed for aspiring tech leaders, this programme offers cutting-edge insights, practical experience, and strategic acumen to navigate the digital era. Gain the skills to drive innovation, lead digital transformations, and position yourself as a visionary in technology leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/yahya-sinwar-killed-prime-target-israel-hamas-chief-tunnel-gaza-metro-ismail-haniyeh-dead-iran-idf-mosad-profile-2615328-2024-10-17",
      "headline": "Who was Yahya Sinwar, 'Butcher of Khan Younis', who plotted October 7 massacreHamas chief Yahya Sinwar was killed in an Israeli operation in Gaza, Israeli Foreign Minister Israel Katz said. From his hiding, Sinwar called for suicide attacks on Israeli targets. Infamous as the 'Butcher of Khan Younis', Sinwar masterminded the October 7 massacre in Israel. Earlier, he survived Israeli jails for 22 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/supermoon-2024-largest-brightest-full-moon-delhi-india-gate-pictures-2618925-2024-10-18",
      "headline": "Year's largest and brightest supermoon dazzles the night sky. See picsThe Hunter's Moon, the year's largest and brightest moon, was witnessed from different parts of India on October 17."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/central-agencies-rope-in-vpn-service-providers-probe-into-bomb-threats-to-indian-flights-2618959-2024-10-18",
      "headline": "Central agencies to rope in VPN providers in probe into bomb threats to flightsCentral agencies will rope in VPN service providers to trace the origins of the bomb threats that were received by around 20 Indian flights this week. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/why-canada-no-evidence-canadian-pm-justin-trudeau-csis-rcmp-age-old-problem-pierre-trudeau-2618585-2024-10-17",
      "headline": "No evidence but egg on face. Canada's age-old problemJustin Trudeau went out on a limb to accuse India of a role in the killing of a Khalistani terrorist. He admitted there was intel but no evidence. The intelligence-to-evidence gap is a decades-old problem, stemming from Canadian police's excesses during the term of Trudeau's father, Pierre Trudeau."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-key-cases-child-marriage-verdict-air-fares-regulation-ram-rahim-acquittal-bhavani-revanna-bail-plea-2618917-2024-10-18",
      "headline": "Air fares regulation to Ram Rahim's acquittal, key cases in Supreme Court todayMeanwhile, the Delhi High Court will hear a matter concerning the alleged black marketing of tickets for the concerts of Punjabi singer Diljit Dosanjh and British band Coldplay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/comedian-kunal-kamra-another-dig-at-ola-ceo-bhavish-aggarwal-x-post-ola-electric-scooters-2618916-2024-10-18",
      "headline": "Kunal Kamra slams Bhavish Aggarwal again: Don't hire me, just fix the issuesIn a post on X, Comedian Kunal Kamra has again schooled Ola CEO Bhavish Aggarwal for failing to address growing customer grievances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/salman-khan-lawrence-bishnoi-code-of-conduct-blackbuck-case-apology-baba-siddique-murder-2618519-2024-10-17",
      "headline": "What is the Bishnoi clan's code of conduct for apology and repentance?If a person prefers to seek an apology from the Bishnoi community, it shall be conducted as per the 29 Niyamas (Code of Conduct) given by Guru Jambheshwar, the 16th-century founder of the Bishnoi Panth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bomb-hoax-threats-to-indian-flights-ip-addresses-in-london-germany-x-handle-2618731-2024-10-17",
      "headline": "Hoax threats to Indian flights traced to IP addresses in London, Germany: SourcesSources stated that the X handle, under probe, was created on Tuesday and used to post seven hoax messages that triggered major air security scares. The handle has since been suspended. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/supreme-court-new-lady-justice-without-blindfold-sword-sanjay-raut-attack-on-cji-chandrachud-calls-bjp-rss-propaganda-2618528-2024-10-17",
      "headline": "Lady Justice sheds blindfold, Sanjay Raut fails to seeThe new statue of Lady Justice in the Supreme Court library holding the Constitution without a blindfold is an attempt at projecting new imagery, shedding the colonial imprint. However, Shiv Sena's Sanjay Raut has gone ballistic with accusations, failing to see reason."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/why-israel-iron-dome-miss-missiles-protect-some-areas-arrow-3-shortage-netanyahu-iran-2618338-2024-10-17",
      "headline": "Why Israel might allow Iron Dome to miss some missilesLike doctors who had to make the cruel choice of letting some patients die during the Covid pandemic, Israel might have to pick which areas it wants to shield and which it doesn't from enemy missiles. With the cost of shooting down all missiles fired at residential areas taking a toll, Israel might have to make a cruel choice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-pakistan-visit-india-pm-modi-nawaz-sharif-sco-meet-exclusive-2618644-2024-10-17",
      "headline": "S Jaishankar's Pak visit a start, would have loved if PM Modi came: Nawaz SharifFormer Pakistan's Prime Minister Nawaz Sharif hoped that with Jaishankar's visit to Islamabad, both India and Pakistan could put the past behind and tackle future problems like energy and climate change, among others."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-injured-rishabh-pant-fails-to-take-field-on-day-3-bcci-to-monitor-fitness-2618949-2024-10-18",
      "headline": "Injured Rishabh Pant fails to take field on Day 3, BCCI to monitor fitnessIndia vs New Zealand: Injured Rishabh Pant failed to take the field for India on Friday, October 18. Pant was injured on Day 2 of the Bengaluru Test after the ball struck him on his left knee. It was the same area where Pant had his surgery done after his road accident.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/odisha-coast-cyclone-indian-ocean-bay-of-bengal-arabian-sea-weather-body-fishing-shipping-alert-2618880-2024-10-18",
      "headline": "Odisha coast may face cyclone next week, weather body issues alertA cyclone may form near the North Andaman Sea around October 20, with the possibility of intensifying as it approaches Odisha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/when-aasif-sheikh-told-salman-khan-to-take-off-his-shirt-as-cop-didnt-recognise-him-2618969-2024-10-18",
      "headline": "When Aasif Sheikh told Salman Khan to take off his shirt as cop didn't recognise himActor Aasif Sheikh recalled the fun experiences of working with Salman Khan. He shared that they were once stopped by traffic police. Aasif also praised Salman's genuine personality. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumars-greets-fans-and-asks-about-their-well-being-on-video-call-2618958-2024-10-18",
      "headline": "Watch: Ajith Kumar greets fans and asks about their well-being on video callAjith Kumar's video call with a co-rider's family has been going viral on social media. The actor is presently shooting for his upcoming film, Good Bad Ugly, in Madrid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-says-its-better-to-not-have-a-sense-of-humour-today-2618947-2024-10-18",
      "headline": "Shah Rukh Khan says it's better to 'not have' a sense of humour todayShah Rukh Khan believes it's \"better not to have a sense of humour\" in today's sensitive climate. He also reflects on the challenges of starring in a comedy film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vettaiyan-box-office-day-8-rajinikanth-amitabh-bachchan-film-drops-further-mints-rs-3-crore-2618939-2024-10-18",
      "headline": "Vettaiyan box office Day 8: Rajinikanth's film drops further, mints Rs 3 croreRajinikanth's Vettaiyan, directed by TJ Gnanavel, slipped further on Day 8. The film reportedly earned Rs 3 crore (nett) at the domestic box office in India."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/al-hilal-ceo-slams-netherlands-coach-ronald-koeman-over-saudi-league-comments-2618978-2024-10-18",
      "headline": "Al Hilal CEO slams Netherlands coach Ronald Koeman over Saudi League commentsAl Hilal CEO Esteve Calzada criticised Netherlands coach Ronald Koeman for underestimating the Saudi Pro League. Calzada's comments came after Koeman refused to select Steven Bergwijn for the Dutch side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/six-kings-slam-carlos-alcaraz-message-rafael-nadal-retirement-davis-cup-2618975-2024-10-18",
      "headline": "Carlos Alcaraz sends emotional message to Rafael Nadal after final matchCarlos Alcaraz sent an emotional message to Rafael Nadal after beating him in their final singles match on October 17, Thursday. Nadal will retire from tennis after the Davis Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-tahlia-mcgrath-feels-australia-didnt-show-up-vs-south-africa-pretty-hard-to-take-2618967-2024-10-18",
      "headline": "Tahlia feels Australia 'didn't show up' vs South Africa: Pretty hard to takeAustralia's stand-in captain Tahlia McGrath felt that Australia 'didn't show up' in their semi-final clash against South Africa in the Women's T20 World Cup 2024. She admitted that the loss was going to be hard to take. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-opening-to-advising-carlos-alcaraz-ready-any-time-he-wants-2618961-2024-10-18",
      "headline": "Nadal willing to advise Alcaraz: Ready any time he wants to call meLegendary Rafael Nadal has said that he is open to advising Carlos Alcaraz in the future. Speaking at the Six Kings Slam 2024, Nadal said that he knew Alcaraz was a special talent when he saw him in 2021."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-injured-rishabh-pant-fails-to-take-field-on-day-3-bcci-to-monitor-fitness-2618949-2024-10-18",
      "headline": "Injured Rishabh Pant fails to take field on Day 3, BCCI to monitor fitnessIndia vs New Zealand: Injured Rishabh Pant failed to take the field for India on Friday, October 18. Pant was injured on Day 2 of the Bengaluru Test after the ball struck him on his left knee. It was the same area where Pant had his surgery done after his road accident.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-laura-wolvaardt-calls-semi-final-victory-south-africa-vs-australia-as-best-win-of-career-2618938-2024-10-18",
      "headline": "Laura Wolvaardt calls semi-final victory vs Australia as 'best win of career'Laura Wolvaardt called the semi-final victory vs Australia 'best win of her career'. South Africa stunned Australia by 8 wickets to storm into the Women's T20 World Cup 2024 final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-46-all-out-aakash-chopra-2618926-2024-10-18",
      "headline": "Aakash Chopra backs India to score 450 in 2nd innings after 46-all-out blunderIND vs NZ: Despite being 46-all-out in the first innings, former India cricketer Aakash Chopra hs backed India to score big runs in the 2nd innings. Chopra has said that India would score 400-450 runs when they next come out to bat.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-confirms-he-is-unlikely-to-return-bangladesh-amidst-protests-2618924-2024-10-18",
      "headline": "Shakib Al Hasan confirms he is unlikely to return Bangladesh amid unrestLegendary all-rounder Shakib Al Hasan has confirmed that he will not be returning to Bangladesh anytime soon. Shakib, who has been accused of murder in his home country, currently lives in the USA.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-south-africa-players-in-tears-after-beating-australia-in-womens-t20-world-cup-2618912-2024-10-18",
      "headline": "South Africa players in tears after beating Australia in T20 World CupWomen's T20 World Cup 2024: South Africa players were in tears after knocking out 6-time champion Australia in the Women's T20 World Cup. A clinical South African side won the semi-final fixture by 8 wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-laura-wolvaardt-calls-semi-final-victory-south-africa-vs-australia-as-best-win-of-career-2618938-2024-10-18",
      "headline": "Laura Wolvaardt calls semi-final victory vs Australia as 'best win of career'Laura Wolvaardt called the semi-final victory vs Australia 'best win of her career'. South Africa stunned Australia by 8 wickets to storm into the Women's T20 World Cup 2024 final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-46-all-out-aakash-chopra-2618926-2024-10-18",
      "headline": "Aakash Chopra backs India to score 450 in 2nd innings after 46-all-out blunderIND vs NZ: Despite being 46-all-out in the first innings, former India cricketer Aakash Chopra hs backed India to score big runs in the 2nd innings. Chopra has said that India would score 400-450 runs when they next come out to bat.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-confirms-he-is-unlikely-to-return-bangladesh-amidst-protests-2618924-2024-10-18",
      "headline": "Shakib Al Hasan confirms he is unlikely to return Bangladesh amid unrestLegendary all-rounder Shakib Al Hasan has confirmed that he will not be returning to Bangladesh anytime soon. Shakib, who has been accused of murder in his home country, currently lives in the USA.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-south-africa-players-in-tears-after-beating-australia-in-womens-t20-world-cup-2618912-2024-10-18",
      "headline": "South Africa players in tears after beating Australia in T20 World CupWomen's T20 World Cup 2024: South Africa players were in tears after knocking out 6-time champion Australia in the Women's T20 World Cup. A clinical South African side won the semi-final fixture by 8 wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indw-vs-nzw-richa-ghosh-to-miss-series-vs-new-zealand-due-to-12th-board-exams-2618855-2024-10-17",
      "headline": "Richa Ghosh to miss ODI series vs New Zealand due to 12th board examsIndia's women wicketkeeper Richa Ghosh will miss upcoming three-match ODI series against New Zealand to appear for her class 12 board exams.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-cricket-board-to-ban-transgender-players-at-elite-level-from-2025-2618850-2024-10-17",
      "headline": "England board to ban transgender in elite domestic cricket from 2025The England and Wales Cricket Board (ECB) will prohibit transgender players from elite-level women's cricket starting in 2025. This decision aligns with ICC's policy and aims to balance fairness, safety, and inclusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-and-south-africa-tours-will-be-tough-for-team-india-sourav-ganguly-2618849-2024-10-17",
      "headline": "Australia, South Africa tour will be tough for India: Sourav Ganguly Former national captain and ex-BCCI president Sourav Ganguly said that India need to be on their toes in their upcoming tours of South Africa and Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-beat-west-indies-win-t20i-series-2-1-2618846-2024-10-17",
      "headline": "Sri Lanka script historic T20I series win over West IndiesSri Lanka vs West Indies, 3rd T20I: Kusal Mendis helped Sri Lanka win their first-ever T20I series against the West Indies with a convincing nine-wicket wicket on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcb-chandika-hathurusinghe-contract-bangladesh-phil-simmons-2618836-2024-10-17",
      "headline": "Bangladesh board terminates coach Hathurusingha's contract officiallyPhil Simmons has officially replaced Chandika Hathurusinghe as the Bangladesh men's head coach after the latter was sacked on Thursday for misconduct and violations of employment terms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-australia-laura-wolvaardt-tahlia-mcgrath-semi-final-report-2618786-2024-10-17",
      "headline": "Clinical South Africa knock Australia out to avenge 2023 final defeat Women's T20 World Cup: South Africa beat Australia by eight wickets and stormed their way into the final of the tournament. The Proteas also defeated the Aussies for the first time in the history of the multi-nation championship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-wanted-to-bat-first-henry-rohit-misjudging-pitch-2618795-2024-10-17",
      "headline": "New Zealand wanted to bat first, says Henry after Rohit admits misjudging pitchPacer Matt Henry admitted that New Zealand too would have batted first had they won the toss in the morning, something that must be music to the ears of Indian skipper Rohit Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-ms-dhoni-to-become-india-second-most-capped-player-2618735-2024-10-17",
      "headline": "Virat Kohli goes past MS Dhoni to become India's second-most-capped player India vs New Zealand, Bengluru Test: Star India batter Virat Kohli has surpassed former captain MS Dhoni to become India's second-most-capped cricketer across all formats. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcb-chandika-hathurusinghe-contract-bangladesh-phil-simmons-2618836-2024-10-17",
      "headline": "Bangladesh board terminates coach Hathurusingha's contract officiallyPhil Simmons has officially replaced Chandika Hathurusinghe as the Bangladesh men's head coach after the latter was sacked on Thursday for misconduct and violations of employment terms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-australia-laura-wolvaardt-tahlia-mcgrath-semi-final-report-2618786-2024-10-17",
      "headline": "Clinical South Africa knock Australia out to avenge 2023 final defeat Women's T20 World Cup: South Africa beat Australia by eight wickets and stormed their way into the final of the tournament. The Proteas also defeated the Aussies for the first time in the history of the multi-nation championship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-wanted-to-bat-first-henry-rohit-misjudging-pitch-2618795-2024-10-17",
      "headline": "New Zealand wanted to bat first, says Henry after Rohit admits misjudging pitchPacer Matt Henry admitted that New Zealand too would have batted first had they won the toss in the morning, something that must be music to the ears of Indian skipper Rohit Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-ms-dhoni-to-become-india-second-most-capped-player-2618735-2024-10-17",
      "headline": "Virat Kohli goes past MS Dhoni to become India's second-most-capped player India vs New Zealand, Bengluru Test: Star India batter Virat Kohli has surpassed former captain MS Dhoni to become India's second-most-capped cricketer across all formats. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-bengaluru-test-matt-henry-5-wickets-2618720-2024-10-17",
      "headline": "New Zealand need to keep the pressure: Henry cautious despite dream dayIndia vs New Zealand: Matt Henry stressed that New Zealand must maintain their intensity after a strong performance on Day 2 to secure a win against India in the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-harmanpreet-kaur-smriti-mandhana-odi-series-2618719-2024-10-17",
      "headline": "Harmanpreet retained as skipper in India squad for New Zealand ODIsThe BCCI named India's squad for their 3-match ODI series against New Zealand. The Women in Blue named Priya Mishra, Sayali Satgare, Saima Thakor and Tejal Hasabnis as their new faces. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-multan-test-salman-ali-agha-shoaib-bashir-2618703-2024-10-17",
      "headline": "Shoiab Bashir, Salman Agha shine as 2nd Test set for thrilling finishPAK vs ENG: The second Test in Multan is set for a thrilling finish as England need 261 more runs to win with eight wickets in hand. Earlier, Salman Ali Agha scored a half-century while Shoaib Bashir picked up a four-wicket haul. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/saff-championship-2024-indian-women-football-team-beat-pakistan-5-2-2618702-2024-10-17",
      "headline": "Indian women's football team hammer Pakistan 5-2 in openerThe Indian women's football team kicked off their SAFF Women's Championship 2024 campaign with an impressive 5-2 win over Pakistan. Standout performances included Grace Dangmei's two goals and Bala Devi's milestone 50th international goal."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}