{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/show-a-single-instance-of-e20-fuel-causing-car-issues-minister-hits-back-at-criticism-of-ethanol-mixed-petrol-2768205-2025-08-08",
      "headline": "Show single instance of E20 causing issues: Minister's dare on ethanol petrol rowSpeaking at a session during the Business Today India@100 Summit, Nitin Gadkari said no complaints had been reported so far and accused detractors of spreading misinformation about the government's ethanol-blending programme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-shares-are-on-a-dream-run-after-listing-should-you-buy-now-2768195-2025-08-08",
      "headline": "NSDL shares are on a dream run after listing. Should you buy now?The NSDL stock, which made its market debut on August 6, has now risen for three straight sessions—prompting IPO investors to ask: is it time to book profits or hold on?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-save-tax-by-claiming-hra-for-rent-paid-to-parents-read-this-first-2768173-2025-08-08",
      "headline": "Want to save tax by claiming HRA for rent paid to parents? Read this firstAccording to tax rules, salaried individuals can claim HRA even if they're living in their parents' home. But the rent must be real, paid regularly, and documented properly. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-may-approve-rs-30000-crore-support-to-maintain-lpg-price-stability-2768148-2025-08-08",
      "headline": "Government may approve Rs 30,000 crore support to maintain LPG price stabilityThis move is aimed at helping oil marketing companies recover losses they have been facing on domestic LPG sales due to high international prices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-down-500-points-key-factors-donald-trump-us-trade-talk-threat-tariffs-2768131-2025-08-08",
      "headline": "Sensex tumbles 500 points: Why is the stock market down today?At 10:07 am, the Sensex was down 496.21 points at 80,127.05, while the Nifty stood at 24,444.55, lower by 151.60 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-likely-dropped-to-an-eight-year-low-in-july-report-2768124-2025-08-08",
      "headline": "Retail inflation likely dropped to an eight-year low in July: ReportDespite uneven monsoons, a strong spring harvest has helped India keep a lid on food prices, extending the country's longest disinflationary streak in more than a decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-150-points-nifty-trades-around-24550-airtel-down-3-2768107-2025-08-08",
      "headline": "Sensex, Nifty tumble as Trump's threat on trade deal spooks Dalal StreetAt the opening bell, the S&P BSE Sensex fell over 150 points and was trading 310.53 points lower at 80,312.73 around 9:35 am. The broader Nifty50 index also slipped 84.55 points to 24,511.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/trump-rules-out-trade-talks-with-india-amid-tariffs-will-dalal-street-face-the-heat-2768103-2025-08-08",
      "headline": "Trump rules out trade talks with India amid tariffs: Will Dalal Street face the heat?With Donald Trump ruling out any negotiations \"until it is resolved,\" Dalal Street could witness a turbulent period as geopolitical tensions spill into the market.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-russia-oil-purchase-impact-india-refiners-crude-putin-india-visit-2767910-2025-08-08",
      "headline": "Trump's tariff: What Indian refiners stand to lose if Russian oil stops flowingFor over two years, Indian refiners have been taking advantage of discounted Russian crude. But with the US tightening its stance, that door may soon begin to close. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-targets-one-kilo-gold-bars-with-new-import-tariffs-glbs-2768038-2025-08-08",
      "headline": "US targets one-kilo gold bars with new import tariffs: ReportFollowing the US government's announcement last week of a broad 39% tariff on imports from Switzerland, this exacerbates already existing trade tensions between Bern and Washington."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariffs-us-consumers-face-price-hikes-across-major-brands-2767858-2025-08-07",
      "headline": "Trump tariffs: US consumers face price hikes across major brandsIn the household goods sector, Procter & Gamble said it plans to raise prices on 25% of its North American products due to the impact of tariffs and product innovation."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mrunal-thakur-vibes-dhanush-song-follows-actor-sisters-on-instagram-amid-dating-rumours-2768213-2025-08-08",
      "headline": "Mrunal Thakur vibes to Dhanush's song, follows his sisters on InstagramIn a throwback video, Mrunal Thakur can be seen vibing to Dhanush's song from 'Idli Kadai'. Amid dating rumours, the 'Sita Ramam' actor followed Dhanush's sisters on Instagram."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-17-year-old-son-hridaan-chased-by-paparazzi-internet-calls-them-creeps-2768211-2025-08-08",
      "headline": "Hrithik's 17-year-old son Hridaan chased by paps, internet slams creepy behaviourHrithik Roshan's son Hridaan steps out of a building but, startled by photographers calling out to him, quickly runs away. The video of the incident has gone viral. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/together-review-allison-brie-dave-francos-creepy-cult-horror-gets-under-your-skin-2768179-2025-08-08",
      "headline": "Together review: Allison Brie, Dave Franco's creepy cult horror gets under your skinRelease Date:Wed Jul 30, 2025'Together' is a unique horror film that explores the complexities of a troubled relationship through a disturbing body horror metaphor, blending dark comedy with emotional depth. With strong performances and striking visuals, it offers a memorable but unsettling cinematic experience that stays with you long after the credits roll."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-anushka-sharma-ate-snake-gourd-dish-on-their-anniversary-all-about-it-2768183-2025-08-08",
      "headline": "Virat Kohli-Anushka Sharma ate snake gourd dish on their anniversary - all about itVirat Kohli and Anushka Sharma's private chef revealed their dietary habits and how he tweaks ingredients in foreign dishes to fit their likes and dislikes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rukmini-vasanth-exudes-royalty-as-kanakavathi-in-kantara-chapter-1-poster-out-2768135-2025-08-08",
      "headline": "Rukmini Vasanth exudes royalty as Kanakavathi in Kantara Chapter 1. Poster outActor Rukmini Vasanth joined Rishab Shetty's much-awaited film 'Kantara Chapter 1' on Friday. Her first-look poster, which exuded royalty, was shared by Shetty on social media. 'Kantara: Chapter 1' will release in cinemas on October 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-steps-out-for-a-family-dinner-in-mumbai-shields-daughter-from-camera-flashes-2768132-2025-08-08",
      "headline": "Allu Arjun steps out for a family dinner in Mumbai, shields daughter from camera flashesAllu Arjun was seen in a protective fatherly role as he shielded his daughter from paparazzi flashes during a family dinner in Mumbai. Videos and pictures from their recent outing, accompanied by Lakshmi Manchu, are now on the internet. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-costar-ahaan-panday-aneet-padda-dating-2768129-2025-08-08",
      "headline": "Are Saiyaara co-stars Ahaan Panday and Aneet Padda dating?'Saiyaara' has shattered box-office records and brought its leads, Ahaan Panday and Aneet Padda, under the media spotlight. They were recently seen at a boutique, which fuelled rumours about their relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/arabia-kadali-review-krish-jagarlamudis-sincere-drama-struggles-to-stay-afloat-2768047-2025-08-08",
      "headline": "Arabia Kadali review: Krish Jagarlamudi's sincere drama struggles to stay afloatRelease Date:Fri Aug 08, 2025'Arabia Kadali' series review: 'Arabia Kadali' presents a heartfelt and sincere retelling of a real-life crisis, combining a grounded human story with thematic depth. While the intent is solid and the performances authentic, the series suffers from dated presentation, occasional cliches, and uneven emotional engagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/robert-pattinson-the-batman-part-ii-to-begin-filming-in-2026-release-pushed-to-2027-2768104-2025-08-08",
      "headline": "Robert Pattinson's Batman Part II to begin filming in 2026, release pushed to 2027Warner Bros Discovery confirmed 'The Batman Part II' to film in 2026, aiming for a 2027 release. Directed by Matt Reeves, it stars Robert Pattinson. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/salakaar-review-naveen-kasturia-spy-thriller-india-pakistan-nuclear-espionage-jiohotstar-2767982-2025-08-08",
      "headline": "Salakaar review: Naveen Kasturia's nuclear spy drama is intriguing but inconsistentRelease Date:Fri Aug 08, 2025Salakaar series review: 'Salakaar' is a spy thriller inspired by real India-Pakistan nuclear espionage events. The series mixes political intrigue with flawed spy characters, offering a slow-burn drama with some logical lapses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/himesh-reshammiya-becomes-first-indian-artist-on-bloombergs-pop-power-list-2768091-2025-08-08",
      "headline": "Himesh Reshammiya becomes first Indian artist on Bloomberg's Pop Power ListHimesh Reshammiya has made history as the first Indian artist to feature on Bloomberg's Pop Power List. He secured the 22nd spot with global pop icons, Post Malone, Bruno Mars and Beyonce leading the list. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hansal-mehta-gandhi-series-premieres-tiff-2025-ar-rahman-music-2768082-2025-08-08",
      "headline": "Hansal Mehta's Gandhi, first ever series, to premiere at Toronto Film festivalHansal Mehta's series 'Gandhi' became the first Indian series to debut at the Toronto International Film Festival. AR Rahman, who has composed the music, announced the news on his official social media pages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokesh-kanagaraj-full-circle-moment-bus-conductor-son-now-directing-one-in-coolie-rajinikanth-2767874-2025-08-08",
      "headline": "Lokesh Kanagaraj's full-circle moment: Once a bus conductor's son, now directing oneDirector Lokesh Kanagaraj's upcoming film, 'Coolie', features Rajinikanth in the lead role. Before the release of the film, let us take a look at the inspiring story of the filmmaker, who, without formal training, managed to direct some of the greats of Tamil cinema.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ms-dhoni-coolie-composer-anirudh-ravichander-padel-chennai-court-viral-video-2768072-2025-08-08",
      "headline": "MS Dhoni and Coolie composer Anirudh play Padel at Chennai court. Viral videoMahendra Singh Dhoni and composer Anirudh Ravichander were seen playing Padel at the cricketer's newly launched court in Chennai. A video of them is going viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/skydance-seals-8-billion-merger-with-paramount-after-lawsuit-deal-glbs-2768029-2025-08-08",
      "headline": "Skydance seals $8 billion merger with Paramount after lawsuit dealSkydance finalised an $8 billion merger with Paramount, gaining control of major media assets. The deal follows political controversy and signals a shift in strategy under new CEO David Ellison.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-refused-to-meet-casting-director-shanoo-sharma-saiyaara-success-mohit-suri-film-2767893-2025-08-08",
      "headline": "Saiyaara casting director Shanoo Sharma reveals why Ahaan Panday refused to meet her'Saiyaara' casting director Shanoo Sharma shared an interesting anecdote about actor Ahaan Panday. Sharma recalled when Panday once refused to meet her due to his own fears."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-meets-pm-modi-seeks-support-for-recognition-of-keeladis-antiquity-2767970-2025-08-07",
      "headline": "Kamal Haasan meets PM Modi, seeks support for recognition of Keeladi's antiquityActor and Rajya Sabha MP, Kamal Haasan met Prime Minister Narendra Modi to seek expedited recognition of Keeladi's antiquity. He highlighted the need to promote Tamil civilisation and language on a global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ib-ministry-notice-khalid-ka-shivaji-marathi-film-controversy-maratha-king-2767952-2025-08-07",
      "headline": "Centre issues notice to Marathi film 'Khalid Ka Shivaji' makers amid ban callsThe I&B ministry has issued a notice to the makers of the Marathi film Khalid Ka Shivaji following protests over the secular portrayal of Chhatrapati Shivaji Maharaj in the movie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/thursday-murder-club-trailer-netflix-eteran-sleuths-lead-probe-mysterious-death-2767921-2025-08-07",
      "headline": "The Thursday Murder Club trailer: Veteran sleuths lead the probe on mysterious deathNetflix released the trailer for The Thursday Murder Club, a mystery film based on Richard Osman's bestselling novel. The story follows four retirees who solve cold cases, leading to a thrilling murder investigation on their doorstep."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/show-a-single-instance-of-e20-fuel-causing-car-issues-minister-hits-back-at-criticism-of-ethanol-mixed-petrol-2768205-2025-08-08",
      "headline": "Show single instance of E20 causing issues: Minister's dare on ethanol petrol rowSpeaking at a session during the Business Today India@100 Summit, Nitin Gadkari said no complaints had been reported so far and accused detractors of spreading misinformation about the government's ethanol-blending programme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-sets-aside-own-order-barring-high-court-judge-from-hearing-criminal-cases-2768154-2025-08-08",
      "headline": "Didn't want to cause embarrassment: Top court recalls order against Allahabad judgeAfter the order came under criticism, the Chief Justice of India BR Gavai, wrote to Justice Pardiwala's bench requesting the reconsideration of the strictures against the High Court Judge."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-state-education-policy-rejects-neps-three-language-formula-and-entrance-exams-ssa-funds-2768168-2025-08-08",
      "headline": "Tamil Nadu unveils State Education Policy, counters NEP with two-language systemTamil Nadu Chief Minister MK Stalin has released the State Education Policy, drafted by a 14-member panel led by Justice Murugesan. The policy rejects key NEP provisions, retains the two-language policy, and prioritises science, AI, and English."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kapil-sharmas-canada-cafe-attacked-over-salman-khan-invite-reveals-audio-clip-of-bishnoi-gang-member-2768150-2025-08-08",
      "headline": "Firing at Kapil Sharma's cafe over invite to Salman, says Bishnoi gang memberIn the audio clip, Bishnoi gang member Harry Boxer warns that any director, producer, or artist working with Salman Khan would be shot in the chest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-mohammed-siraj-vs-jasprit-bumrah-2768137-2025-08-08",
      "headline": "Cheer for Mohammed Siraj, but don't jeer Jasprit Bumrah England vs India: Mohammed Siraj's brilliance at The Oval deserves every decibel of praise. But that celebration need not come at the cost of Jasprit Bumrah, the architect of several Indian triumphs. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/murder-of-actor-huma-qureshis-brother-on-cctv-wife-seen-trying-to-intervene-2768122-2025-08-08",
      "headline": "Murder of actor Huma Qureshi's cousin on CCTV, wife seen trying to interveneActor Huma Qureshi's cousin Asif was stabbed over a parking spot dispute in Delhi. He was then taken to the nearest hospital in a critical condition, where the doctors declared him dead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-tariffs-india-russia-putin-india-visit-modi-china-sco-summit-tighten-ties-push-allies-away-2767834-2025-08-08",
      "headline": "India-Russia bear hug is another Trump self-goalThough India and Russia had strong ties, New Delhi was trying to balance that as relations with the US were on the upswing. However, Donald Trump's tariff bazooka might see India's Russia hug get tighter. Russian President Putin is set to visit New Delhi later this year. Trump has, ironically, driven India towards Russia like the US did with its arms embargo in the mid-60s."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-may-approve-rs-30000-crore-support-to-maintain-lpg-price-stability-2768148-2025-08-08",
      "headline": "Government may approve Rs 30,000 crore support to maintain LPG price stabilityThis move is aimed at helping oil marketing companies recover losses they have been facing on domestic LPG sales due to high international prices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/heart-attack-or-just-pain-how-to-know-when-to-call-an-ambulance-2767799-2025-08-08",
      "headline": "Chest pain, strokes, severe bleeding: These emergencies need an ambulance, not a driveRecognising true medical emergencies can save lives by ensuring timely treatment. Knowing when to call an ambulance versus driving can prevent irreversible harm."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-additional-trump-tariffs-will-be-a-big-pain-point-for-india-2767760-2025-08-07",
      "headline": "Why additional Trump tariffs will be a big pain point for IndiaThe extra 25 per cent 'ad valorem' duty on Indian imports—seen as a new negotiating tactic by the Trump administration—will have a sizeable impact on India's growth in the short term"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/gpt-5-explained-what-it-can-do-and-why-it-matters-for-chatgpt-users-in-5-points-2768117-2025-08-08",
      "headline": "GPT-5 explained: What it can do and why it matters for ChatGPT users in 5 pointsOpenAI's GPT-5 is smarter, more accurate, and more personal than any previous ChatGPT model, bringing major improvements in coding, writing, health advice, and reasoning – plus a Pro version for the toughest challenges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/ap-tirupati-dalit-man-assaulted-bhumana-karunakar-reddy-ysrcp-jagan-mohan-reddy-caste-violence-2768158-2025-08-08",
      "headline": "Dalit man assaulted in Andhra Pradesh, accused tied to Jagan Reddy party's leaderA Dalit youth in Andhra Pradesh's Tirupati was allegedly abducted and assaulted by men linked to YSRCP leader Bhumana Karunakar Reddy. Police arrested two accused while others remain at large. The attack, sparked by a bike dispute, turned into caste violence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-costar-ahaan-panday-aneet-padda-dating-2768129-2025-08-08",
      "headline": "Are Saiyaara co-stars Ahaan Panday and Aneet Padda dating?'Saiyaara' has shattered box-office records and brought its leads, Ahaan Panday and Aneet Padda, under the media spotlight. They were recently seen at a boutique, which fuelled rumours about their relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/watch-indias-shubhanshu-shukla-explains-how-astronauts-digest-food-in-space-2768198-2025-08-08",
      "headline": "Watch: Shux explains how astronauts digest food in spaceWithout gravity, stomach contents float freely and take longer to settle, meaning digestion can slow down for some astronauts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-anushka-sharma-ate-snake-gourd-dish-on-their-anniversary-all-about-it-2768183-2025-08-08",
      "headline": "Virat Kohli-Anushka Sharma ate snake gourd dish on their anniversary - all about itVirat Kohli and Anushka Sharma's private chef revealed their dietary habits and how he tweaks ingredients in foreign dishes to fit their likes and dislikes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/ludhiana-vendor-dips-plastic-pouches-hot-oil-fry-microplastic-pakode-viral-video-sparks-outrage-2768157-2025-08-08",
      "headline": "Ludhiana vendor dips plastic pouches in hot oil to fry pakode, video sparks outrageIn a video shared by food blogger Harry Uppal on Instagram, the vendor is seen dropping sealed plastic oil pouches into a kadhai filled with hot oil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/sholay-at-50-making-of-gabbar-singh-bollywood-greatest-villain-amjad-khan-290-07-08-2025",
      "headline": "Sholay@50: The Making of Gabbar, Bollywood's Greatest VillainWhat made Gabbar Singh the greatest villain in Bollywood history? It wasn't just Amjad's performance, though his raw intensity was undeniable. It was the magic of Salim-Javed's writing, Sippy's vision, and Amjad's ability to transcend the archetype of the Bollywood villain. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/technology/news/story/gemini-has-meltdown-and-calls-itself-a-failure-google-says-it-is-just-a-bug-2768187-2025-08-08",
      "headline": "Gemini has meltdown and calls itself a failure, Google says it is just a bugGoogle's Gemini AI chatbot is experiencing a very dramatic glitch. Many users have flagged that the AI assistant is getting emotional in its responses, even showing  feelings of existential outbursts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/trumpian-tariffs-on-india-who-pays-who-gains-2767955-2025-08-08",
      "headline": "Trumpian Tariffs on India: Who pays? Who gains?Tariff liberalisation has been a factor leading to consumption growth in India, which has again been the prime driver of its economic growth. It is therefore important that India should shed off its protectionist status and rather actively accelerate efforts to diversify trade partners beyond the US and strengthen ties with other global players. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/dining-solo-might-be-the-best-thing-you-do-this-week-2767696-2025-08-08",
      "headline": "Dining solo might be the best thing you do this weekNext time you feel awkward about going on a solo date, know that eating alone can be really refreshing. It helps you slow down, enjoy your food, and connect with yourself."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/together-review-allison-brie-dave-francos-creepy-cult-horror-gets-under-your-skin-2768179-2025-08-08",
      "headline": "Together review: Allison Brie, Dave Franco's creepy cult horror gets under your skinRelease Date:Wed Jul 30, 2025'Together' is a unique horror film that explores the complexities of a troubled relationship through a disturbing body horror metaphor, blending dark comedy with emotional depth. With strong performances and striking visuals, it offers a memorable but unsettling cinematic experience that stays with you long after the credits roll."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-likely-dropped-to-an-eight-year-low-in-july-report-2768124-2025-08-08",
      "headline": "Retail inflation likely dropped to an eight-year low in July: ReportDespite uneven monsoons, a strong spring harvest has helped India keep a lid on food prices, extending the country's longest disinflationary streak in more than a decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-25-extra-tariff-on-india-china-opposes-washingtons-move-says-stance-on-tariff-abuse-consistent-2767924-2025-08-07",
      "headline": "China's opposition clear: India finds an unlikely ally as Beijing slams US tariffsThe strong response came after US President Donald Trump signed an executive order placing an additional 25 per cent tariff on Indian goods, taking the total import duty to 50 per cent."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/secret-service-raised-ohio-river-for-vp-jd-vances-birthday-kayaking-trip-sparking-backlash-glbs-2768055-2025-08-08",
      "headline": "JD Vance went on kayak trip on birthday. Military secretly raised river levelThe Secret Service raised water levels in Ohio's Little Miami river for Vice President JD Vance's birthday kayaking trip, prompting criticism over taxpayer spending and comparisons to past political privileges.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mrunal-thakur-vibes-dhanush-song-follows-actor-sisters-on-instagram-amid-dating-rumours-2768213-2025-08-08",
      "headline": "Mrunal Thakur vibes to Dhanush's song, follows his sisters on InstagramIn a throwback video, Mrunal Thakur can be seen vibing to Dhanush's song from 'Idli Kadai'. Amid dating rumours, the 'Sita Ramam' actor followed Dhanush's sisters on Instagram."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-17-year-old-son-hridaan-chased-by-paparazzi-internet-calls-them-creeps-2768211-2025-08-08",
      "headline": "Hrithik's 17-year-old son Hridaan chased by paps, internet slams creepy behaviourHrithik Roshan's son Hridaan steps out of a building but, startled by photographers calling out to him, quickly runs away. The video of the incident has gone viral. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/together-review-allison-brie-dave-francos-creepy-cult-horror-gets-under-your-skin-2768179-2025-08-08",
      "headline": "Together review: Allison Brie, Dave Franco's creepy cult horror gets under your skinRelease Date:Wed Jul 30, 2025'Together' is a unique horror film that explores the complexities of a troubled relationship through a disturbing body horror metaphor, blending dark comedy with emotional depth. With strong performances and striking visuals, it offers a memorable but unsettling cinematic experience that stays with you long after the credits roll."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-anushka-sharma-ate-snake-gourd-dish-on-their-anniversary-all-about-it-2768183-2025-08-08",
      "headline": "Virat Kohli-Anushka Sharma ate snake gourd dish on their anniversary - all about itVirat Kohli and Anushka Sharma's private chef revealed their dietary habits and how he tweaks ingredients in foreign dishes to fit their likes and dislikes. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/ben-shelton-wins-national-bank-open-youngest-american-masters-champion-2768226-2025-08-08",
      "headline": "Ben Shelton wins biggest crown of career, elated with steely show ahead of US OpenBen Shelton claimed his first ATP 1000 title by winning the National Bank Open in Toronto. This victory makes him the youngest American Masters 1000 champion since 2004 and positions him as a strong contender ahead of the US Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-rajasthan-royals-vaibhav-suryavanshi-kkr-aakash-chopra-2768208-2025-08-08",
      "headline": "Sanju Samson to leave RR due to Vaibhav Suryavanshi's rise? Ex-opener explainsFormer India opener Aakash Chopra believes that Vaibhav Suryavanshi's rise might've played a role in Sanju Samson's reported departure from Rajasthan Royals (RR). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-london-latest-photo-grey-beard-fans-speculation-2768200-2025-08-08",
      "headline": "Virat Kohli spotted in London with greying beard, sparking speculation among fansFormer India captain Virat Kohli was spotted in London sporting a salt-and-pepper look. A section of fans took note of his greying beard, linking it to a remark he made earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-pak-matthew-forde-ruled-out-of-odi-series-johann-layne-2768181-2025-08-08",
      "headline": "WI vs PAK: Matthew Forde ruled out of ODI series due to shoulder injuryWest Indies fast bowler Matthew Forde has been ruled out of the ODI series against Pakistan after dislocating his shoulder practice session. He has been replaced by Johann Layne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-mohammed-siraj-vs-jasprit-bumrah-2768137-2025-08-08",
      "headline": "Cheer for Mohammed Siraj, but don't jeer Jasprit Bumrah England vs India: Mohammed Siraj's brilliance at The Oval deserves every decibel of praise. But that celebration need not come at the cost of Jasprit Bumrah, the architect of several Indian triumphs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/victoria-mboko-beats-naomi-osaka-to-win-canadian-open-2768128-2025-08-08",
      "headline": "18-year-old Victoria Mboko stuns Naomi Osaka to win Canadian OpenVictoria Mboko staged a stunning comeback after losing the first set to beat Naomi Osaka 2-6, 6-4, 6-1 in the final. The 18-year-old became the first Canadian to defeat three former Grand Slam champions in a single WTA event in the Open Era"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhimanyu-easwarans-father-ranganathan-gautam-gambhir-eng-vs-ind-2768112-2025-08-08",
      "headline": "Gambhir assured my son that he will get chances: Abhimanyu Easwaran's fatherAbhimanyu Easwaran's father, Ranganathan Easwaran, has revealed that India head coach Gautam Gambhir has assured his son of getting chances in the playing XI. Abhimanyu couldn't find a place in the playing XI in the five-match Test series against England."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-hits-back-at-jasprit-bumrahs-critics-2768088-2025-08-08",
      "headline": "Dinesh Karthik hits back at Bumrah's critics: India's defeats are not his faultFormer India cricketer turned commentator Dinesh Karthik has slammed Jasprit Bumrah's critics, saying that it's not his fault that India lost Test matches in England despite his presence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-fast-bowling-transition-test-bumrah-siraj-akash-arshdeep-prasidh-anshul-harshit-2768067-2025-08-08",
      "headline": "Who after Bumrah and Siraj? Is India's fast-bowling assembly line drying up?With Jasprit Bumrah and Mohammed Siraj now past 30, the big question looms: who takes over as the leader of India's pace attack? Among the frontrunners are Arshdeep Singh, Akash Deep, Prasidh Krishna, and Harshit Rana - all promising, but yet to fully cement their place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-suspends-haider-ali-uk-police-investigation-2768021-2025-08-07",
      "headline": "Pakistan Cricket Board suspends Haider Ali amid UK criminal investigation: ReportThe Pakistan Cricket Board (PCB) has provisionally suspended cricketer Haider Ali after it emerged that the 24-year-old batter is under criminal investigation by Greater Manchester Police in the United Kingdom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chennai-grandmasters-2025-arjun-erigaisi-dominant-win-sahrin-loses-2768018-2025-08-07",
      "headline": "Chennai Grandmasters 2025: Erigaisi takes dominant win, Keymer downs SarinArjun Erigaisi kicked off his Chennai Grandmasters campaign with a dominant win over Awonder Liang, while Vincent Keymer stunned Nihal Sarin in the opening round of this high-stakes tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhimanyu-easwarans-father-ranganathan-gautam-gambhir-eng-vs-ind-2768112-2025-08-08",
      "headline": "Gambhir assured my son that he will get chances: Abhimanyu Easwaran's fatherAbhimanyu Easwaran's father, Ranganathan Easwaran, has revealed that India head coach Gautam Gambhir has assured his son of getting chances in the playing XI. Abhimanyu couldn't find a place in the playing XI in the five-match Test series against England."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-hits-back-at-jasprit-bumrahs-critics-2768088-2025-08-08",
      "headline": "Dinesh Karthik hits back at Bumrah's critics: India's defeats are not his faultFormer India cricketer turned commentator Dinesh Karthik has slammed Jasprit Bumrah's critics, saying that it's not his fault that India lost Test matches in England despite his presence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-fast-bowling-transition-test-bumrah-siraj-akash-arshdeep-prasidh-anshul-harshit-2768067-2025-08-08",
      "headline": "Who after Bumrah and Siraj? Is India's fast-bowling assembly line drying up?With Jasprit Bumrah and Mohammed Siraj now past 30, the big question looms: who takes over as the leader of India's pace attack? Among the frontrunners are Arshdeep Singh, Akash Deep, Prasidh Krishna, and Harshit Rana - all promising, but yet to fully cement their place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-suspends-haider-ali-uk-police-investigation-2768021-2025-08-07",
      "headline": "Pakistan Cricket Board suspends Haider Ali amid UK criminal investigation: ReportThe Pakistan Cricket Board (PCB) has provisionally suspended cricketer Haider Ali after it emerged that the 24-year-old batter is under criminal investigation by Greater Manchester Police in the United Kingdom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chennai-grandmasters-2025-arjun-erigaisi-dominant-win-sahrin-loses-2768018-2025-08-07",
      "headline": "Chennai Grandmasters 2025: Erigaisi takes dominant win, Keymer downs SarinArjun Erigaisi kicked off his Chennai Grandmasters campaign with a dominant win over Awonder Liang, while Vincent Keymer stunned Nihal Sarin in the opening round of this high-stakes tournament."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}