{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-reduces-repo-rate-by-25-basis-points-banks-passing-them-on-home-loan-cheaper-emis-low-2706783-2025-04-10",
      "headline": "RBI is cutting key rates, but are banks passing them on?RBI announced a cut in the repo rate by 25 basis points, bringing it down to 6% on Wednesday. The decision was made after the central bank's Monetary Policy Committee (MPC), led by Governor Sanjay Malhotra, finished its three-day meeting which started on April 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-currency-yuan-falls-17-year-low-donald-trump-us-tariff-125-percent-2706769-2025-04-10",
      "headline": "China's Yuan falls to 17-year low after Trump tariffs kick inThe decline in Yuan comes as a trade war between the world's two largest economies escalates. US President Donald Trump's \"reciprocal\" tariffs on dozens of countries took effect on Wednesday, including massive 104% duties on Chinese goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-market-wall-street-nikkei-jump-donald-trump-hits-pause-90-days-on-reciprocal-tariffs-2706732-2025-04-10",
      "headline": "Global markets jump as Donald Trump hits pause on tariffsGlobal markets rise: The S&P 500 and the Nasdaq saw their biggest daily percentage rises in over 10 years, adding over $1.5 trillion in market value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-stock-market-close-holiday-mahavir-jayanti-sensex-nifty-no-trading-nse-bse-global-market-2706727-2025-04-10",
      "headline": "Mahavir Jayanti holiday: Are Sensex and Nifty open for trading today?Stock market holiday: According to the official stock market holiday list, Mahavir Jayanti is one of three holidays in April. The other two are on April 14 for Dr Baba Saheb Ambedkar Jayanti and April 18 for Good Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/msc-turkiye-world-biggest-green-cargo-ship-docks-at-adani-vizhinjam-port-2706724-2025-04-10",
      "headline": "World's biggest green cargo ship, MSC Turkiye docks at Adani's Vizhinjam PortMSC Turkiye: The vessel is 399.9 metres long, 61.3 metres wide, and has a depth of 33.5 metres. It has the capacity to carry 24,346 twenty-foot equivalent units (TEUs), making it one of the largest container ships ever built."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-surges-as-trump-hits-pause-on-tariffs-dow-jumps-over-2300-points-glbs-2706665-2025-04-09",
      "headline": "Wall Street surges as Trump hits pause on tariffs, Dow jumps over 2,300 pointsWall Street jumped after President Trump paused new tariffs for 90 days, easing trade worries. Big tech companies like Apple and Nvidia led the gains. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-falls-over-350-points-nifty-below-22500-banking-stocks-down-2706416-2025-04-09",
      "headline": "Sensex falls over 350 points, Nifty below 22,500; banking stocks downThe S&P BSE Sensex was down 379.73 points to close at 73,847.15, while the NSE Nifty50 lost 136.70 points to end at 22,399.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-rajdhani-to-vande-bharat-investor-criticises-india-lag-in-train-tech-2706391-2025-04-09",
      "headline": "From Rajdhani to Vande Bharat: Investor criticises India's lag in train techWhen Rajdhani was launched in 1969, it placed India among Asia's fastest rail nations, second only to Japan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meet-governor-sanjay-malhotra-us-tariff-impact-worried-over-growth-than-inflation-2706354-2025-04-09",
      "headline": "RBI Governor says US tariff impact on growth bigger worry than inflationThe RBI's rate cut comes at a time when inflation appears to be under control, but economic growth faces risks from global uncertainty after US tariffs imposed by President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-rate-cut-impact-market-banking-stocks-down-reason-here-why-bank-margins-2706331-2025-04-09",
      "headline": "RBI rate cut brings relief for borrowers, but banking stocks tumble. Here's whyBanking stocks, especially public sector lenders, took a sharp hit after the rate cut announcement. The Nifty Bank index was down nearly 1%, with major losers including Bank of Baroda, Canara Bank, Punjab National Bank, and SBI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-monetary-policy-6-key-takeaways-from-mpc-meeting-governor-sanjay-malhotra-announces-april-9-2025-2706322-2025-04-09",
      "headline": "RBI monetary policy: 6 key takeaways from MPC meetingWith the repo rate cut, borrowing costs for home and personal loans are likely to fall. This would provide a big relief to the homebuyers and could boost the housing market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-5-key-development-reforms-you-must-know-2706284-2025-04-09",
      "headline": "RBI MPC meeting: 5 key development reforms you must knowCurrently, UPI payments are mostly capped at Rs 1 lakh for both P2P and P2M. The RBI has suggested that National Payments Corporation of India (NPCI) may now review and revise these limits based on evolving user needs. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-bad-ugly-x-twitter-reviews-ajith-kumar-trisha-krishnan-adhik-ravichandran-fans-praise-dialgues-action-sequences-2706782-2025-04-10",
      "headline": "Good Bad Ugly X reviews: Fans hail dialogues, Ajith's mass entry, call it 'peak vibe'Internet declared Ajith Kumar's Good Bad Ugly a winner. While some raved about the dialogues between him and Simran Bagga, others highlighted the mass entry scene and peppy songs. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-day-11-box-office-salman-khans-film-struggles-to-keep-up-2706760-2025-04-10",
      "headline": "Sikandar Day 11 box office: Salman Khan's film struggles to keep upSalman Khan's much-anticipated film Sikandar has seen a decline in box office earnings on its 11th day. The film now faces stiff competition from new releases - Jaat and Good Bad Ugly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/khushboo-sundar-wishes-george-clooney-ajith-kumar-good-bad-ugly-release-2706754-2025-04-10",
      "headline": "Khushbhoo Sundar sends wishes to Ajith for Good Bad Ugly: My George Clooney is backKhushboo Sundar gave a shout-out to her 'George Clooney' Ajith Kumar ahead of Good Bad Ugly release. The high-octane action comedy, directed by Adhik Ravichandran, released in theatres on April 10. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/phule-film-release-postponed-censor-board-calls-cuts-edits-after-brahmin-community-concerns-2706733-2025-04-10",
      "headline": "Pratik Gandhi's Phule release postponed amid controversy over caste representationThe release of Ananth Mahadevan's film Phule has been delayed due to concerns from the Brahmin community about their representation in the movie. The CBFC has requested several edits, including the removal of caste-related references, before approving the film for release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/l2-empuraan-box-office-day-14-mohanlal-prithviraj-sukumaran-film-eyes-rs-260-crore-globally-2706742-2025-04-10",
      "headline": "Empuraan box office Day 14: Mohanlal's film eyes Rs 260 crore globallyMohanlal and Prithviraj Sukumaran-starrer L2: Empuraan has crossed the Rs 250-crore mark worldwide in no time. It is gearing up to enter the Rs 260-crore club soon. The film is the sequel to 2019's hit Lucifer. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-snaps-at-disrespectful-paps-in-viral-clip-not-caring-about-humans-2706731-2025-04-10",
      "headline": "Justin Bieber snaps at 'disrespectful' paps in viral clip: Not caring about humansA video going viral online shows singer Justin Bieber losing his cool with the paparazzi, labelling them 'money-hungry' and disrespectful. He further criticised them for showing no regard for basic human decency.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/vidyapati-movie-review-nagabhushana-carries-a-shaky-screenplay-banking-on-emotions-2706688-2025-04-10",
      "headline": "Vidyapati review: Nagabhushana carries a shaky screenplay banking on emotionsReleased-Thu Apr 10, 2025Vidyapati movie film review: This Kannada film, produced by Dhananjaya's Daali Pictures, is a comedy entertainer starring Nagabhushana, Malaika Vasupal and Garuda Ram in the lead. The film, despite having potential, falls short in being impressive.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/supermodel-gigi-hadid-reveals-how-she-met-her-current-boyfriend-bradley-cooper-glbs-2706693-2025-04-10",
      "headline": "Supermodel Gigi Hadid reveals how she met her current boyfriend Bradley CooperGigi Hadid opens up in Vogue about how she met Bradley Cooper at a backyard party, sharing insights into their low-key romance and the challenges of dating in the spotlight.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tracee-ellis-ross-wows-in-burnt-orange-leather-on-good-morning-america-glbs-2706692-2025-04-10",
      "headline": "Tracee Ellis Ross wows in burnt orange leather on Good Morning AmericaTracee Ellis Ross stunned on Good Morning America in a burnt orange leather ensemble and Bottega Veneta heels while promoting Black Mirror Season 7 with Rashida Jones, impressing fashion watchers once again.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/beyonce-fans-can-win-concert-tickets-in-cowboy-carter-fashion-sweepstakes-glbs-2706691-2025-04-10",
      "headline": "Beyoncé fans can win concert tickets in Cowboy Carter fashion sweepstakesBeyoncé's Cowboy Carter album has inspired a handmade fashion sweepstakes by MakerPlace. Fans can design outfits for a chance to win concert tickets and $3,000. Entries close this Friday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tahira-kashyap-shares-health-update-after-breast-cancer-relapse-2706663-2025-04-09",
      "headline": "Back home, recovering: Tahira Kashyap shares health update after cancer relapseFilmmaker Tahira Kashyap shared a post and updated fans about her health after her breast cancer relapse. She thanked her fans anf followers for their unconditional support. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-grooves-to-dhol-at-son-sunny-deols-jaat-premiere-2706651-2025-04-09",
      "headline": "Dharmendra grooves to dhol beat at son Sunny Deol's Jaat premiere. WatchVeteran actor Dharmendra stole the limelight with his dance at son Sunny Deol's Jaat premiere in Mumbai. The film will release in theatres on April 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-mari-selvaraj-reunite-after-four-years-for-d56-2706640-2025-04-09",
      "headline": "Dhanush, Mari Selvaraj reunite after four years for 'D56'Dhanush has teamed up with director Mari Selvaraj for his next film. Tentatively titled D56, the movie will be produced by Ishari Ganesh under Vels Films International. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-2-in-works-brad-pitt-production-plan-b-entertainment-in-talks-with-netflix-for-sequel-2706624-2025-04-09",
      "headline": "Adolescence 2 in works? Brad Pitt's production in talks with Netflix for sequelNetflix's popular series, Adolescence, is in talks for a second season. The producers are in discussions with the streaming giant for the second season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tabu-haider-reunion-with-shahid-kapoor-vishal-bhardwaj-2706579-2025-04-09",
      "headline": "Tabu's Haider reunion with 'Laqt-e-jigars' Shahid Kapoor, Vishal BhardwajThe versatile Tabu on Wednesday shared a reunion photo from her meeting with Haider cast, including former co-star Shahid Kapoor and director Vishal Bhardwaj. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-sidharth-malhotra-nail-veer-pahariya-viral-one-leg-dance-maddock-2706595-2025-04-09",
      "headline": "Varun Dhawan, Sidharth Malhotra nail Veer Pahariya's viral one-leg dance. WatchVarun Dhawan and Sidharth Malhotra's video from Maddock's success bash has gone viral. The two actors aced Veer Pahariya's viral one-leg dance step. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-prithviraj-sukumaran-starts-filming-for-nobody-mahurat-parvathy-thiruvothu-2706577-2025-04-09",
      "headline": "After Empuraan, Prithviraj Sukumaran starts filming for Nobody. See mahurat picsPrithviraj Sukumaran has finally begun for his next film, titled Nobody, after Empuraan. The actor shared pictures from the mahurat ceremony on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/black-warrant-actor-paramvir-singh-calls-border-2-co-star-sunny-deol-shy-2706560-2025-04-09",
      "headline": "Black Warrant actor Paramvir Singh calls Border 2 co-star Sunny Deol shy, humbleBlack Warrant actor Paramvir Singh Cheema is excited about making his big Bollywood debut with Varun Dhawan and Sunny Deol. The actor was last seen in Chamak 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apoorva-mukhija-breaks-down-in-first-video-since-latent-row-says-she-felt-unsafe-2706562-2025-04-09",
      "headline": "Apoorva Mukhija breaks down in first video since Latent row, says she felt unsafeSocial media sensation Apoorva Mukhija broke down during her first Instagram video after the India's Got Latent controversy. The YouTuber spoke about how she felt unsafe after the row. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-china-us-tariff-war-pause-90-day-india-canada-2706648-2025-04-09",
      "headline": "Do not retaliate: Trump hits China with 125% tariffs, announces pause for othersDonald Trump paused his reciprocal tariffs on all countries for 90 days, retaining a reduced 10% rate. But he hit China with 125% tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trumps-buy-stocks-tip-before-tariffs-pause-raises-calls-for-insider-trading-probe-2706713-2025-04-10",
      "headline": "Trump's 'good time to buy' tweet minutes before tariff pause sparks calls for probeShortly after markets opened, President Trump took to his Truth Social platform with a pair of upbeat posts. \"BE COOL! Everything is going to work out well. The USA will be bigger and better than ever before!\" he wrote, followed closely by a more direct appeal to investors: \"THIS IS A GREAT TIME TO BUY!!! DJT.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-tariff-pause-strategy-isolate-china-countries-dialogue-negotiation-trade-deficit-art-of-the-deal-2706725-2025-04-10",
      "headline": "Tariff trap? Trump rewards allies, punishes China in 'art of the deal' strategyWhile the decision to impose across-the-board tariffs triggered panic in financial markets, the Trump administration is now suggesting it was part of a deliberate strategy aimed squarely at isolating China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/2611-tahawwur-rana-mumbai-terror-attack-accused-extradited-reach-india-special-flight-to-be-kept-in-tihar-jail-2706720-2025-04-10",
      "headline": "Tahawwur Rana on way to India on special flight, to be kept in Tihar jail: SourcesTahawwur Rana is being brought to India after his last-ditch attempt to evade extradition failed as the US Supreme Court justices rejected his application."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/los-angeles-olympics-cricket-six-teams-90-players-details-2706771-2025-04-10",
      "headline": "LA Olympics 2028: Cricket to feature 6 teams, 90 players on Games returnCricket will return to the Olympic Games for the first time since 1900. Six men's teams and as many women's teams will be part of the Games in Los Angeles in 2028. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-mumbai-26-11-attack-case-narender-mann-special-public-prosecutor-2706759-2025-04-10",
      "headline": "Centre appoints Narender Mann to lead legal proceedings in Tahawwur Rana caseMumbai terror attack plotter Tahawwur Hussain Rana, who has been extradited from the US, will be lodged in a high-security ward in Tihar jail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-currency-yuan-falls-17-year-low-donald-trump-us-tariff-125-percent-2706769-2025-04-10",
      "headline": "China's Yuan falls to 17-year low after Trump tariffs kick inThe decline in Yuan comes as a trade war between the world's two largest economies escalates. US President Donald Trump's \"reciprocal\" tariffs on dozens of countries took effect on Wednesday, including massive 104% duties on Chinese goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/story/iphone-may-cost-three-times-more-up-to-rs-3-lakh-if-made-in-us-glbs-2706710-2025-04-10",
      "headline": "iPhone may cost three times more, up to Rs 3 lakh, if made in US: ReportIf Apple started making iPhones entirely in the US, the price could shoot up to $3,500(Rs 3 lakh) — that's nearly triple the current cost. Experts say while the goal is to bring jobs back home, it could end up hitting consumers' pockets hard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/michelle-obama-barack-obama-divorce-rumours-chose-to-do-whats-best-for-me-2706773-2025-04-10",
      "headline": "Michelle Obama opens up about divorce rumours: Chose to do what's best for meAddressing divorce rumours, Michelle Obama explained that she's simply taking more control over her schedule and prioritising personal well-being over societal expectations of women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/woman-mother-of-three-children-marries-class-12-student-third-marriage-uttar-pradesh-amroha-2706641-2025-04-09",
      "headline": "Mother of three converts to marry Class 12 student in third marriage in UPThe woman divorced her second husband and left her three children in his custody to marry a Class 12 student."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congresss-bid-to-reclaim-sardar-vallabhbhai-patel-be-asardar-or-is-it-too-little-too-late-bjp-narendra-modi-gujarat-2706504-2025-04-09",
      "headline": "Congress at Patel chowk, will it take the revival turn?With an AICC meeting in Gujarat after 64 years, the Congress is trying to make the state a laboratory for its revival. With symbolism and a resolution, the Congress is trying to reclaim the legacy of Sardar Patel, who has been co-opted by the BJP, and used against the Nehru-Gandhi family. Is the Congress's bid too little too late?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/live-panangottai-fish-held-in-mouth-kills-tn-man-2706734-2025-04-10",
      "headline": "Tamil Nadu man catches fish, puts it inside his mouth, chokes to deathA 29-year-old man from Chengalpattu, Tamil Nadu, choked to death after a live fish he held in his mouth wriggled into his throat while he was bare-hand fishing in a local lake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/phule-film-release-postponed-censor-board-calls-cuts-edits-after-brahmin-community-concerns-2706733-2025-04-10",
      "headline": "Pratik Gandhi's Phule release postponed amid controversy over caste representationThe release of Ananth Mahadevan's film Phule has been delayed due to concerns from the Brahmin community about their representation in the movie. The CBFC has requested several edits, including the removal of caste-related references, before approving the film for release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-reservation-sc-st-obc-50-per-cent-cap-caste-census-ahmedabad-session-congress-2706632-2025-04-09",
      "headline": "Rahul Gandhi vows to 'demolish' wall limiting reservations to 50%Rahul Gandhi vowed to dismantle the 50 per cent cap on reservations for SCs, STs, and OBCs in education and government jobs, citing Telangana's model and calling for a nationwide caste census to ensure greater representation for marginalised communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/watch-donald-trump-explains-90-day-tariff-pause-says-people-were-getting-yippy-glbs-2706696-2025-04-10",
      "headline": "Tariff U-turn on 90 countries? Trump says people were getting 'yippy'President Trump hit pause on reciprocal tariffs for 90 days, saying it was a move to ease market nerves. China retaliated with higher tariffs, while the US signalled it would pursue one-on-one talks with its allies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/chennai/story/chennai-minor-teen-driving-fathers-car-accident-crash-auto-pedestrian-2706772-2025-04-10",
      "headline": "Chennai: 14-year-old takes father's car for joyride, crashes into auto; 2 injuredA 14-year-old boy crashed his father's car into a stationary auto in Chennai's Kumaran Nagar, injuring the driver and a bystander. Police seized the car and detained the boy's father."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tahira-kashyap-shares-health-update-after-breast-cancer-relapse-2706663-2025-04-09",
      "headline": "Back home, recovering: Tahira Kashyap shares health update after cancer relapseFilmmaker Tahira Kashyap shared a post and updated fans about her health after her breast cancer relapse. She thanked her fans anf followers for their unconditional support. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/can-india-close-the-stealth-gap-in-air-defence-2706286-2025-04-09",
      "headline": "Can India close the stealth gap in air defence?It's a race against time to ready a fifth-generation stealth fighter jet and modernise the Indian Air Force as US and China redefine aerial warfare\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sanju-samson-fined-slow-over-rate-gt-vs-rr-2706726-2025-04-10",
      "headline": "Sanju Samson fined for RR's slow over rate, joins penalised captains listSanju Samson was hit with a Rs 24 lakh fine for a slow over rate against Gujarat Titans, adding to Rajasthan Royals' early-season troubles as the team finds itself mid-table after a shaky 2-3 start in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pamban-bridge-revive-india-sri-lanka-direct-rail-link-bridge-palk-strait-ram-setu-explain-history-tamil-nadu-2706361-2025-04-09",
      "headline": "Pamban Bridge revives age-old dream, a direct train from Chennai to ColomboAn India-Sri Lanka direct rail or road link needs just a 25-km-long bridge. The Pamban Bridge, recently inaugurated by PM Narendra Modi, completes a crucial part of a direct train from Chennai to Colombo. Planned by the British, and brought to the drawing table time and again, an India-Lanka rail link would boost both ties and trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-grooves-to-dhol-at-son-sunny-deols-jaat-premiere-2706651-2025-04-09",
      "headline": "Dharmendra grooves to dhol beat at son Sunny Deol's Jaat premiere. WatchVeteran actor Dharmendra stole the limelight with his dance at son Sunny Deol's Jaat premiere in Mumbai. The film will release in theatres on April 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/kash-patel-removed-as-acting-atf-director-replaced-by-daniel-driscoll-glbs-2706694-2025-04-10",
      "headline": "Kash Patel removed as acting chief of firearms, alcohol regulatory body: ReportFBI Director Kash Patel has been removed as acting ATF chief and replaced by Army Secretary Daniel Driscoll. The Justice Department says the move wasn't performance-related, but no reason was given.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/amid-tariff-hikes-amazon-cuts-some-inventory-orders-from-china-glbs-2706679-2025-04-10",
      "headline": "Amazon scales back inventory orders from China as tariff tensions escalateAmazon has abruptly cancelled product orders from China and other Asian countries, likely in response to new US tariffs. This has left sellers with extra products that they can't sell easily."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-mumbai-attacks-plotter-2611-delhi-tihar-jail-extradition-us-david-headley-2706682-2025-04-10",
      "headline": "From Pak Army doctor to 26/11 attacks plotter: Who is Tahawwur RanaTahawwur Rana, a former Pakistan Army doctor accused of plotting the 2008 Mumbai terror attacks, is set to land in Delhi on Thursday afternoon. He was arrested by the FBI in 2009 and was lodged in a prison in the US before his extradition to India."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-vs-borussia-dormund-not-qualified-yet-hansi-flick-champions-league-2706781-2025-04-10",
      "headline": "Barcelona have not qualified yet: Flick urges caution despite Dortmund winBarcelona head coach Hansi Flick urged caution after his side's 4-0 win over Borussia Dortmund, warning that the Champions League quarter-final tie isn't over yet. Flick stressed the need for complete focus ahead of the return leg in Germany."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-rr-gujarat-titans-assistant-coach-parthiv-patel-press-conference-2706774-2025-04-10",
      "headline": "Had to drag Sudharsan out of nets: GT coach Parthiv praises opener's work ethicsGujarat Titans assistant coach Parthiv Patel has praised Sai Sudharsan's superb run with the bat in the ongoing Indian Premier League (IPL) 2025. Sudharsan starred with the bat again, scoring 82 from 53 deliveries against the Rajasthan Royals with eight boundaries and three sixes at a strike rate of 154.72."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/los-angeles-olympics-cricket-six-teams-90-players-details-2706771-2025-04-10",
      "headline": "LA Olympics 2028: Cricket to feature 6 teams, 90 players on Games returnCricket will return to the Olympic Games for the first time since 1900. Six men's teams and as many women's teams will be part of the Games in Los Angeles in 2028. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-sai-sudharsan-elite-list-chris-gayle-kane-williamson-2706751-2025-04-10",
      "headline": "GT vs RR: Sai Sudharsan goes past Gayle, Williamson in elite IPL listSai Sudharsan's brilliant 82 against Rajasthan Royals not only powered Gujarat Titans to a commanding win but also took him past IPL greats like Chris Gayle and Kane Williamson on the elite run-scorers list after 30 innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-why-no-washington-sundar-parthiv-patel-explains-2706741-2025-04-10",
      "headline": "Why no Washington Sundar for GT vs RR: Parthiv Patel explains bold callGT batting coach Parthiv Patel has explained the reason why Washington Sundar wasn't part of the playing XI for their win over RR on April 9. Sundar's omission didn't sit well with a lot of fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/robin-uthappa-on-ashish-nehra-effect-on-mohammed-siraj-and-prasidh-krishna-2706680-2025-04-10",
      "headline": "Ashish Nehra's guidance has done a world of good to Siraj and Prasidh: Robin UthappaFormer India cricketer turned commentator Robin Uthappa has credited Gujarat Titans (GT) coach Ashish Nehra for helping Mohammed Siraj and Prasidh Krishna return to form in the ongoing Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sanju-samson-fined-slow-over-rate-gt-vs-rr-2706726-2025-04-10",
      "headline": "Sanju Samson fined for RR's slow over rate, joins penalised captains listSanju Samson was hit with a Rs 24 lakh fine for a slow over rate against Gujarat Titans, adding to Rajasthan Royals' early-season troubles as the team finds itself mid-table after a shaky 2-3 start in IPL 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-robin-uthappa-slams-rajasthan-royals-for-releasing-jos-buttler-2706676-2025-04-10",
      "headline": "Robin Uthappa slams Rajasthan Royals for releasing Jos Buttler for mega auctionFormer India cricketer turned commentator Robin Uthappa has slammed Rajasthan Royals (RR) for letting go of Jos Buttler ahead of the mega auction for the ongoing Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-lack-of-partnerships-winning-team-chasing-siraj-bahutule-2706723-2025-04-10",
      "headline": "RR lacked partnerships vs GT, want to win games chasing: Spin bowling coachRajasthan Royals suffered a heavy defeat at the hands of Gujarat Titans, with coach Sairaj Bahutule calling for sharper batting partnerships and adaptability. RR's inability to chase down 218 now poses key questions for their middle-order consistency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-sai-sudharsan-india-next-all-format-star-2706714-2025-04-10",
      "headline": "IPL 2025: GT's Sudharsan shows he is ready to be India's next all-format starWith maturity beyond his age, Sai Sudharsan is showing that he has all the tools needed to be India's next all-format star in the coming years. The TN batter has been in fine form for GT this season and is continuing to make fans with his smart gameplay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/badminton-asia-championship-pv-sindhu-second-round-ester-wardoyo-2706674-2025-04-10",
      "headline": "Badminton Asia Championship: Sindhu reaches 2nd round with straight-sets winIndia's PV Sindhu made it to the second round of the Badminton Asia Championship on Wednesday, April 9. Sindhu defeated Ester Wardoyo of Indonesia in straight sets to make it to the next round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sanju-samson-fined-slow-over-rate-gt-vs-rr-2706726-2025-04-10",
      "headline": "Sanju Samson fined for RR's slow over rate, joins penalised captains listSanju Samson was hit with a Rs 24 lakh fine for a slow over rate against Gujarat Titans, adding to Rajasthan Royals' early-season troubles as the team finds itself mid-table after a shaky 2-3 start in IPL 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-robin-uthappa-slams-rajasthan-royals-for-releasing-jos-buttler-2706676-2025-04-10",
      "headline": "Robin Uthappa slams Rajasthan Royals for releasing Jos Buttler for mega auctionFormer India cricketer turned commentator Robin Uthappa has slammed Rajasthan Royals (RR) for letting go of Jos Buttler ahead of the mega auction for the ongoing Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-lack-of-partnerships-winning-team-chasing-siraj-bahutule-2706723-2025-04-10",
      "headline": "RR lacked partnerships vs GT, want to win games chasing: Spin bowling coachRajasthan Royals suffered a heavy defeat at the hands of Gujarat Titans, with coach Sairaj Bahutule calling for sharper batting partnerships and adaptability. RR's inability to chase down 218 now poses key questions for their middle-order consistency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-sai-sudharsan-india-next-all-format-star-2706714-2025-04-10",
      "headline": "IPL 2025: GT's Sudharsan shows he is ready to be India's next all-format starWith maturity beyond his age, Sai Sudharsan is showing that he has all the tools needed to be India's next all-format star in the coming years. The TN batter has been in fine form for GT this season and is continuing to make fans with his smart gameplay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/badminton-asia-championship-pv-sindhu-second-round-ester-wardoyo-2706674-2025-04-10",
      "headline": "Badminton Asia Championship: Sindhu reaches 2nd round with straight-sets winIndia's PV Sindhu made it to the second round of the Badminton Asia Championship on Wednesday, April 9. Sindhu defeated Ester Wardoyo of Indonesia in straight sets to make it to the next round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-crashes-out-of-monte-carlo-masters-after-loss-vs-alejandro-tabilo-2706673-2025-04-10",
      "headline": "Djokovic crashes out of Monte Carlo masters after 2nd straight loss to TabiloNovak Djokovic crashed out of the Monte Carlo Masters following a 3-6, 4-6 loss against unseeded Alejandro Tabilo in the second round on Wednesday. Following his win, Tabilo maintained a remarkable 100% win record over Djokovic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-sanju-samson-chasing-ahmedabad-2706672-2025-04-10",
      "headline": "GT vs RR: Rajasthan skipper Samson defends decision to bowl first in AhmedabadRajasthan Royals skipper Sanju Samson defended the decision to bowl first in Ahmedabad after their loss to Gujarat Titans on Wednesday, April 9. RR lost their third game in the IPL 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-sudharsan-prasidh-krishna-shimron-hetmyer-gt-vs-rr-2706654-2025-04-09",
      "headline": "IPL 2025 GT vs RR: All-round Gujarat Titans hammer Rajasthan Royals to top tableGujarat Titans (GT) continued their winning run in the Indian Premier League 2025 (IPL 2025), beating Rajasthan Royals (RR) by 58 runs at the Narendra Modi Stadium in Ahmedabad. Sai Sudharsan was the star of the show with his magnificent innings of 82 (53) while Prasidh Krishna emerged as the pick of the bowlers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/los-angeles-olympics-2028-archery-compund-mixed-team-medal-added-2706659-2025-04-09",
      "headline": "Compound archery added to Olympics 2028: Why it's a big boost to India's hopesThe Los Angeles Olympics in 2028 will feature the mixed team compound archery event in addition to the five recurve events. For the first time since the reintroduction of archery in 1972 in the Olympics, a new bow style has been added to the Games. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-riyan-parag-angry-dismissal-ahmedabad-2706652-2025-04-09",
      "headline": "GT vs RR: Riyan Parag smashes bat in anger following controversial dismissalRiyan Parag was left fuming and smashed his bat in anger after being dismissed in controversial fashion against Gujarat Titans on April 9. Riyan was dismissed for 26 runs during the tough run chase against GT. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-yashasvi-jaiswals-catch-ruins-rashid-khans-no-look-shot-2706639-2025-04-09",
      "headline": "Watch: Yashasvi Jaiswal's spectacular catch ruins Rashid Khan's 'no-look' shotRajastha Royals batter Yashasvi Jaiswal took a stunning diving catch to dismiss Rashid Khan during Match 23 of the Indian Premier League 2025 (IPL 2025) against Gujarat Titans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/weve-upper-hand-over-dc-theyre-only-relying-on-only-3-players-jitesh-sharma-2706625-2025-04-09",
      "headline": "We've upper hand over DC, they're only relying on 3 players: Jitesh SharmaRoyal Challengers Bengaluru (RCB) wicketkeeper batter feels his team has the upper hand over Delhi Capitals (DC) in their upcoming clash at the M. Chinnaswamy Stadium in Bengaluru as they're not dependent on only three players like DC. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jitesh-sharma-on-dinesh-karthik-rcb-vs-dc-2706604-2025-04-09",
      "headline": "Jitesh Sharma aiming to become 360-degree player under Dinesh Karthik at RCBRoyal Challengers Bengaluru (RCB) wicketkeeper batter Jitesh Sharma has opened up on his training regime under batting coach and mentor Dinesh Karthik, who wants to make him a 360-degree player."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-riyan-parag-angry-dismissal-ahmedabad-2706652-2025-04-09",
      "headline": "GT vs RR: Riyan Parag smashes bat in anger following controversial dismissalRiyan Parag was left fuming and smashed his bat in anger after being dismissed in controversial fashion against Gujarat Titans on April 9. Riyan was dismissed for 26 runs during the tough run chase against GT. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-yashasvi-jaiswals-catch-ruins-rashid-khans-no-look-shot-2706639-2025-04-09",
      "headline": "Watch: Yashasvi Jaiswal's spectacular catch ruins Rashid Khan's 'no-look' shotRajastha Royals batter Yashasvi Jaiswal took a stunning diving catch to dismiss Rashid Khan during Match 23 of the Indian Premier League 2025 (IPL 2025) against Gujarat Titans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/weve-upper-hand-over-dc-theyre-only-relying-on-only-3-players-jitesh-sharma-2706625-2025-04-09",
      "headline": "We've upper hand over DC, they're only relying on 3 players: Jitesh SharmaRoyal Challengers Bengaluru (RCB) wicketkeeper batter feels his team has the upper hand over Delhi Capitals (DC) in their upcoming clash at the M. Chinnaswamy Stadium in Bengaluru as they're not dependent on only three players like DC. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jitesh-sharma-on-dinesh-karthik-rcb-vs-dc-2706604-2025-04-09",
      "headline": "Jitesh Sharma aiming to become 360-degree player under Dinesh Karthik at RCBRoyal Challengers Bengaluru (RCB) wicketkeeper batter Jitesh Sharma has opened up on his training regime under batting coach and mentor Dinesh Karthik, who wants to make him a 360-degree player."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-dc-kl-rahul-batting-spot-matthew-mott-press-conference-2706601-2025-04-09",
      "headline": "RCB vs DC: Class player KL Rahul has ability to bat anywhere, says Matthew MottDelhi Capitals assistant coach Matthew Mott feels that KL Rahul has the ability to bat anywhere in the lineup for the team ahead of their clash against RCB on April 10. Rahul has batted at No.4 and then opened the batting for DC in their win against CSK. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mlb-caratini-delivers-winning-hit-for-houston-astros-against-seattle-mariners-glbs-2706593-2025-04-09",
      "headline": "MLB: Caratini delivers winning hit for Houston Astros against Seattle MarinersThe Houston Astros defeated the Seattle Mariners on Tuesday, April 8 after Victor Caratini hit the winning RBI single in the top of the 12th innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/badmiton-asia-championships-round-one-lakshya-sen-hs-prannoy-2706588-2025-04-09",
      "headline": "Badminton Asia Championships: Lakshya Sen, HS Prannoy crash out in Round 1India's Lakshya Sen and HS Prannoy suffered early exits from the Badminton Aisa Championships on Wednesday, April 9. Aakarshi Kashyap and Anupama Upadhyaya also lost their opening round matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammad-kaif-slams-practice-of-retiring-out-players-2706582-2025-04-09",
      "headline": "Mohammad Kaif slams practice of retiring out players in ongoing IPLFormer India cricketer turned commentator Mohammad Kaif has slammed the practice of retiring out players in the ongoing Indian Premier League 2025 (IPL 2025) calling it a move of desperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hayley-matthews-cramps-batting-women-world-cup-qualifier-west-indies-2706584-2025-04-09",
      "headline": "Watch: Hayley Matthews stretchered off, returns to hit hundred in WWC qualifierWest Indies captain Hayley Matthews was stretchered off the pitch in their Women's World Cup Qualifier match vs Scotland. Matthews battled cramps to score a heroic 114* in losing cause."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-washington-sundar-left-out-ashish-nehra-shubman-gill-2706583-2025-04-09",
      "headline": "Where is Sundar? Fans stunned as GT star left on bench for RR clashFans were stunned to see Washington Sundar miss out on making it to the playing XI for GT's clash against RR on Wednesday, April 9. Sundar was one of the stars of the show for GT in their win against SRH. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-lebron-james-becomes-first-ever-athlete-barbie-kenbassador-with-signature-doll-glbs-2706575-2025-04-09",
      "headline": "NBA: LeBron James becomes first-ever athlete Barbie 'Kenbassador' with signature dollNBA legend and four-time champion LeBron James has officially added a new title to his storied legacy: Barbie's first-ever \"Kenbassador.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-wanindu-hasaranga-rr-vs-gt-2706572-2025-04-09",
      "headline": "Hasaranga pulls out of match vs Gujarat Titans due to personal reasonsRajasthan Royals spinner Wanindu Hasaranga pulled out of the team's match against Gujarat Titans due to personal reasons. Rajasthan replaced Hasaranga with Afghan pacer Fazalhaq Farooqi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-manchester-united-vs-lyon-andre-onana-nemanja-matic-2706561-2025-04-09",
      "headline": "Lyon's Matic hits back at Onana: Worst keeper in Man United historyLyon midfielder Nemanja Matic has hit back at Manchester United goalkeeper Andre Onana ahead of the teams' clash in the Europa League. Matic has called Onana the worst keeper in United history.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-dc-axar-patel-faf-du-plessis-matthew-mott-2706540-2025-04-09",
      "headline": "DC captain Axar Patel doesn't want to be only voice in team: Assistant coach MottDC assistant coach Matthew Mott heaped praise on captain Axar Patel, claiming that he doesn't want to be the only voice in the team. Axar has enjoyed a fine start to life as DC skipper in IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kolkata-knight-riders-abhishek-dalhor-ispl-2706515-2025-04-09",
      "headline": "Street cricket to IPL: Abhishek Dalhor roped in as KKR net bowler for ongoing seasonIndian Street Premier League star Abhishek Dalhor has been roped in by Kolkata Knight Riders to be one of their net bowlers for the ongoing season of the IPL. Dalhor has been a star performer in ISPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hasan-ali-says-people-will-watch-psl-over-ipl-if-they-perform-well-2706493-2025-04-09",
      "headline": "People will choose to watch PSL over IPL if we perform well: Hasan AliPakistan fast bowler Hasan Ali has made a bold statement that if they perform well in the upcoming Pakistan Super League (PSL) viewers will choose to watch them over IPL. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}