{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-lta-exempt-under-the-new-tax-regime-what-you-should-know-2730656-2025-05-26",
      "headline": "Is LTA exempt under the New Tax Regime? What you should knowLeave Travel Allowance (LTA) is a common perk in many salary packages, yet with two tax regimes in place, people often ask if the exemption holds true in the new tax regime. Let's find out in this article."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/supreme-court-puts-bhushan-power-liquidation-on-hold-amid-jsw-review-plea-2730641-2025-05-26",
      "headline": "Supreme Court puts Bhushan Power liquidation on hold as JSW seeks reviewThis interim order effectively pauses the liquidation process of BSPL, offering JSW a window to pursue legal recourse and protect its investment interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-for-2025-here-is-why-you-must-verify-your-ais-and-form-26as-first-2730625-2025-05-26",
      "headline": "Filing ITR for 2025? Here's why you must verify your AIS and Form 26AS firstOne of the most important things you should do before filing your return is to check your Annual Information Statement (AIS) and Form 26AS. These documents contain details of your income and financial transactions during the year. If you forget to report something, you could end up receiving a notice from the tax department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radico-khaitan-launches-trikal-and-morpheus-premium-whiskies-2730624-2025-05-26",
      "headline": "Radico Khaitan launches TRIKĀL and Morpheus whiskiesWith the new launches, the company's goal is to dominate both the luxury and super-premium categories, building on the global success of its flagship Rampur Indian Single Malt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-utilities-not-live-yet-will-the-e-filing-deadline-be-extended-2730597-2025-05-26",
      "headline": "ITR utilities not live yet: Will the e-filing deadline be extended?Many taxpayers are wondering if the delay in these filing tools means the return filing deadline will be pushed. But that's unlikely. The deadline for those who don't need to get their accounts audited remains July 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/belrise-industries-ipo-allotment-status-online-guide-check-latest-gmp-listing-date-2730551-2025-05-26",
      "headline": "Belrise Industries IPO allotment: Step-by-step guide to check statusThe IPO received a good response from all types of investors. By the end of the three-day bidding period on May 23, it was subscribed 43.14 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nibe-share-price-rise-5-percent-upper-circuit-why-reason-new-order-israel-2730514-2025-05-26",
      "headline": "Explained: Why NIBE share price surged 5% to hit upper circuit todayNIBE share price: The shares of NIBE Ltd surged 5% to hit the upper circuit. The stock has lost 4.43% in the last 5 days, but has gained 18.22% in the past month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/aegis-vopak-terminals-ipo-open-bidding-subscribe-skip-details-expert-review-gmp-today-2730498-2025-05-26",
      "headline": "Aegis Vopak Terminals IPO: Subscribe or skip Rs 2,800 crore listing? Check GMPBefore the public issue opened, the company raised Rs 1,259.99 crore from 32 anchor investors. This money was raised at the upper end of the price band, which is Rs 235 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-zomato-share-price-falling-today-global-index-msci-ftse-cut-weights-explained-2730494-2025-05-26",
      "headline": "Eternal shares tumble over 3% in early trade. Why is the stock falling?The Zomato stock was trading 3.17% lower on the NSE at 9:38 am, making it the only significant laggard among Nifty50 constituents during morning trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-gain-why-is-stock-market-rising-3-reasons-why-tariff-pause-4th-largest-economy-rbi-dividend-monsoon-2730489-2025-05-26",
      "headline": "Sensex gains 750 points: 3 reasons why stock market is rising todayStock market rally: Sensex surged over 700 points to 82,437.76 in early trade, while Nifty gained over 200 points to 25,063.65 as of 9:50 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-over-500-points-nifty-crosses-25000-eternal-falls-over-3-2730482-2025-05-26",
      "headline": "Sensex jumps over 600 points, Nifty crosses 25,000; Eternal tumbles 3%The BSE Sensex rose 704.45 points to 82,425.53 around 9:53 am while the Nifty50 gained 218.10 points to 25,071.25. Broader market indices were also in the green, reflecting widespread bullish sentiment on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/leela-hotels-ipo-open-bidding-subscribe-skip-latest-gmp-opening-date-market-view-2730473-2025-05-26",
      "headline": "Leela Hotels IPO opens for bidding: Should you subscribe? Check latest GMPLeela Hotels plans to raise Rs 2,500 crore by issuing 5.75 crore fresh equity shares. An additional Rs 1,000 crore will be raised through the offer for sale (OFS) route, where existing shareholders will sell 2.30 crore shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-prediction-trading-setup-sensex-nifty-today-may-26-nse-bse-2730462-2025-05-26",
      "headline": "Stock market today: Will Sensex, Nifty open higher on May 26?Market experts believe Nifty may continue to trade in a narrow range, with some key support and resistance levels in focus. Gift Nifty futures were trading at 24,935.5 around 8:09 am, which is above Friday's closing level of 24,853.15 for Nifty50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-share-market-news-may-26-hyundai-swiggy-eternal-paytm-ntpc-green-2730455-2025-05-26",
      "headline": "Stocks to watch on May 26: Hyundai, Swiggy, Eternal, Paytm, NTPC GreenHyundai Motor India, NTPC Green Energy, Swiggy, and Waaree Energies will be added to the FTSE global equity indices under the largecap category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-overtakes-japan-become-worlds-4th-largest-economy-in-world-niti-aayog-2730164-2025-05-25",
      "headline": "India overtakes Japan to become fourth-largest economy: Niti AayogIndia has overtaken Japan to become the world's 4th largest economy, with a GDP of $4 trillion. NITI Aayog projects India will become the 3rd largest economy in the next 2-3 years, surpassing Germany. Factors contributing to this growth include infrastructure development, Make in India initiative, GST implementation, and fiscal discipline during the COVID-19 pandemic. The country has reduced extreme poverty to less than 5% and is poised for rapid growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-becomes-fourth-largest-economy-ahead-of-japan-niti-aayog-ceo-2730153-2025-05-25",
      "headline": "India now fourth-largest economy, ahead of Japan: Niti Aayog CEOIndia's GDP has reached $4 trillion, placing it behind only the US, China, and Germany, according to IMF data cited by NITI Aayog CEO BVR Subrahmanyam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-samsung-mobiles-apple-iphone-tariffs-india-manufacturing-2729791-2025-05-24",
      "headline": "Trump targets Samsung after tax threat to Apple for India shift: Wouldn't be fairThe US President warned that Samsung, and not only Apple, would face a 25% import tax if its phones were not manufactured in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-proposes-50-tariff-on-eu-goods-from-june-1-2729562-2025-05-23",
      "headline": "Trump proposes 50% tariff on EU goods from June 1Trump criticised the EU for maintaining restrictive trade practices, levying high taxes, and taking legal action against US companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-declares-rs-268-lakh-crore-dividend-to-support-government-fiscal-goals-2729528-2025-05-23",
      "headline": "RBI to pay Rs 2.69 lakh crore to government as dividend for FY25The RBI has approved a large dividend of Rs 2.69 lakh crore for the financial year 2025, which is higher than Rs 2.1 lakh crore given last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-india-or-anyplace-else-trump-warns-apple-of-25-tariff-if-iphones-not-manufactured-in-us-2729506-2025-05-23",
      "headline": "Not India or anyplace else: Trump's 25% tariff warning if iPhones not made in USDonald Trump's statement on levying 25% tariff on iPhones has caused Apple shares to fall by 2.5% in premarket trading, and US stock futures also slipped. However, it's still unclear whether Trump actually has the legal power to impose a tariff on one specific company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-revival-primary-market-upcoming-public-listings-should-investors-put-money-leela-hotel-lg-ril-2729465-2025-05-23",
      "headline": "Fresh IPOs likely to flood Dalal Street: Time to ride the wave?Four IPOs are lined up to open in the last week of May. These include Scoda Tubes, Prostarm Info Systems, Leela Hotels (Schloss Bangalore Limited), and Aegis Vopak Terminals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-10-crore-for-child-education-edelweiss-ceo-and-md-radhika-gupta-maths-and-message-2729440-2025-05-23",
      "headline": "Rs 10 crore for child's education? Edelweiss' Radhika Gupta's maths and messageRadhika Gupta explained that the current cost of a full higher education in the US is around Rs 2.5 crore. Now, if you consider average inflation of 5% and currency depreciation of 4% every year, the value of that education will go up a lot over the next 16 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-769-points-higher-nifty-above-24800-eternal-ends-with-3-percent-gain-fmcg-it-banking-2729441-2025-05-23",
      "headline": "Sensex, Nifty close higher over US-China trade hopes despite FII outflow fearsThe S&P BSE Sensex added 769.09 points to close at 81,721.08, while the NSE Nifty50 gained 243.45 points to end at 24,853.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-google-and-more-cut-over-61000-jobs-in-2025-here-is-why-2729361-2025-05-23",
      "headline": "Microsoft, Google and more cut over 61,000 jobs in 2025: Here's why?One of the biggest cuts came from Microsoft, which let go of 6,000 employees, its largest round of job losses since 2023. Nearly 2,000 of these were in Washington state alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-power-rpower-share-price-rise-18-percent-why-reason-should-you-buy-2729360-2025-05-23",
      "headline": "Reliance Power Ltd share price rises over 18%. Should you buy?Reliance Power has gained 20.77% in the last month, 51.98% over the last six months, and 99.13% over the past year. Over the last five years, it has gone up by a massive 2,820.56%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-plans-to-let-us-other-foreign-firms-bid-for-government-contracts-report-2729355-2025-05-23",
      "headline": "India plans to let US, other foreign firms bid for government contracts: ReportContracts worth over $50 billion, primarily issued by federal agencies, could soon be accessible to US companies as part of a broader effort to strike a limited trade agreement with Washington by early July."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bajaj-auto-acquisition-to-take-over-ktm-800-million-euro-deal-financial-trouble-2729351-2025-05-23",
      "headline": "Bajaj Auto to take over KTM with massive €800 million dealThe move is aimed at helping KTM recover from financial trouble and marks a major step forward for Bajaj, which has been a minority investor in KTM since 2007."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/data-can-be-misleading-zerodha-founder-and-ceo-nithin-kamath-on-rise-of-tier-2-and-3-city-investors-2729307-2025-05-23",
      "headline": "'Data can be misleading': Nithin Kamath on rise of Tier 2 and 3 city investorsZerodha's Nithin Kamath explained that if you look at the addresses provided by users during their KYC process, it appears many traders are from Tier 2 and Tier 3 towns. However, this can be misleading because most people don't update their address when they move to a new city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-share-price-rises-rising-today-today-check-brokerage-views-should-you-buy-sell-hold-2729293-2025-05-23",
      "headline": "ITC share price rises 3% today. Check brokerage views and what should investors do?The stock was trading 2.78% higher at Rs 437.95, recovering from Thursday's close of Rs 426.10, as investors appeared to focus on the company's long-term fundamentals rather than short-term headwinds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/some-individuals-do-not-need-to-file-an-itr-are-you-one-of-them-2729270-2025-05-23",
      "headline": "Some individuals don't need to file an ITR. Are you one of them?As the 2025–26 financial year begins, the Income Tax Department has released all the seven ITR forms along with the ITR-U form.  But did you know not everyone is required to file a return?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-to-invest-rs-50000-crore-in-northeast-over-next-decade-says-gautam-adani-2729269-2025-05-23",
      "headline": "Adani Group to invest Rs 50,000 crore in Northeast over next decadeThe fresh investment commitment comes just months after the Adani Group pledged Rs 50,000 crore in Assam alone, targeting sectors like airports, aero cities, city gas distribution, transmission, cement, and road infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-loan-bailout-package-pakistan-usd-1-billion-why-reason-india-objection-terror-11-conditions-2729243-2025-05-23",
      "headline": "Explained: Why IMF gave Pakistan $1 billion despite India's objectionsThe IMF agreed to support Pakistan with a total of $7 billion under the EFF programme. So far, it has given $2.1 billion in two separate instalments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bse-shares-appear-65-percent-lower-trading-apps-has-multibagger-stock-crashed-2729212-2025-05-23",
      "headline": "Have BSE shares really crashed? Here's why some apps show a 66% fallThe apparent crash was just a technical adjustment following the company's 2:1 bonus issue, which turned the stock ex-bonus today. Some trading platforms may not have accounted for this corporate action in their price charts, leading to misleading visuals of a steep 65% drop. In reality, the share price simply adjusted to reflect the bonus allotment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rising-today-key-reasons-behind-sensex-nifty-rebound-explained-2729199-2025-05-23",
      "headline": "Sensex jumps 900 points: Why stock market is rising today and what next?Market watchers suggest the current bounce is likely driven by a 'buy-on-dips' strategy that many investors have adopted amid recent volatility. Despite concerns about the global macro environment, the strength in domestic fundamentals seems to be offering support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/honasa-consumer-share-price-rise-13-percent-revenue-rise-decline-in-q4-net-profit-reason-why-2729197-2025-05-23",
      "headline": "Honasa shares rise 13% despite decline in Q4 net profitThe company's revenue from operations went up by 13% year-on-year (YoY), reaching Rs 534 crore in Q4FY25. However, despite the rise in revenue, Honasa's consolidated net profit fell by 18% YoY."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-sensex-opens-flat-nifty-below-24700-sun-pharma-falls-5-2729185-2025-05-23",
      "headline": "Sensex, Nifty move up in early session despite concerns over FII flowsThe S&P BSE Sensex went up by 289.27 points to 81,241.26, while the NSE Nifty50 added 119.15 points to 24,728.85 as of 9:29 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-allotment-how-to-check-status-listing-date-expectation-gmp-online-guide-2729182-2025-05-23",
      "headline": "Borana Weaves IPO allotment: Step-by-step guide to check statusBorana Weaves IPO opened for subscription on May 20 and closed on May 22. The IPO saw strong demand from all investor groups. It was subscribed 147.85 times in total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-change-tax-slab-revamp-talks-begin-government-officials-report-2729163-2025-05-23",
      "headline": "GST rates may change soon as fresh revamp talks begin: ReportGST, which was launched in July 2017, brought together many indirect taxes into one system and created a single national market. The latest round of talks follows the government's introduction of a bill in February this year to simplify income tax laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-may-23-trading-setup-sensex-nifty-nse-bse-2729159-2025-05-23",
      "headline": "Sensex, Nifty opening: Stock market likely to open higher today. Here's whyStock market opening: The Nifty50 index may open slightly above its previous close. Gift Nifty futures were trading at 24,692.5 at 7:59 am, showing a possible rise from Thursday's close of 24,609.7."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-expresses-admiration-for-fahadh-faasil-at-cannes-aavesham-is-my-favourite-2730682-2025-05-26",
      "headline": "Alia Bhatt expresses admiration for Fahadh Faasil: Aavesham is my favouriteAlia Bhatt, who made her debut at Cannes, recently expressed her admiration for Malayalam actor Fahadh Faasil and said that she would definitely be interested in working with him. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-ishaan-khatter-on-feeling-safe-shooting-intimate-scenes-with-naughty-tabu-2730675-2025-05-26",
      "headline": "Ishaan Khatter on 'feeling safe' shooting intimate scenes with 'naughty' TabuActor Ishaan Khatter recently recalled her 'A Suitable Boy' days with co-star Tabu. The actor appreciated Tabu for being supportive while filming intense scenes. He will next be seen in Neeraj Ghaywan's 'Homebound.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-says-raha-has-transformed-her-emotionally-everyone-pain-affects-you-2730644-2025-05-26",
      "headline": "Alia Bhatt says Raha has transformed her emotionally: Everyone's pain affects youActor Alia Bhatt talked about motherhood bringing a whirlwind of changes in her. She mentioned feeling more empathetic and concerned about people's feelings, and looking at the world from a whole new perspective. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/retro-ott-release-when-and-where-to-watch-suriyas-gangster-drama-2730606-2025-05-26",
      "headline": "Retro OTT release: When and where to watch Suriya's gangster dramaSuriya and director Karthik Subbaraj's 'Retro' had a decent run at the box office. The film is all set to stream on an OTT platform later this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gurmeet-choudhary-debina-bonnerjee-hina-khan-rocky-jaiswal-colors-tv-pati-patni-aur-panga-2730632-2025-05-26",
      "headline": "Gurmeet-Debina, Hina-Rocky star in new show Pati, Patni Aur PangaColors TV is set to launch a new reality show, 'Pati, Patni Aur Panga', featuring popular celebrity couples. The show promises exciting challenges and a fresh take on couples competing together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yg-2025-blueprint-blackpink-treasure-baby-monster-new-rookies-unveiled-2730556-2025-05-26",
      "headline": "Blackpink headlines YG's 2025 Blueprint featuring Treasure, BabyMonsterYG's executive producer, Yang Hyun-suk unveiled a new plan to boost activities for artists like Blackpink, Baby Monster, and Treasure, while also accelerating the debut of new talents. He announced the upcoming projects of Blackpink and the release of their new album and world tour 'Deadline' following the teaser release on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-to-have-a-30-minute-extended-cameo-in-kannappa-reveals-vishnu-manchu-2730571-2025-05-26",
      "headline": "Prabhas to have a 30-minute extended cameo in Kannappa, reveals Vishnu ManchuTelugu actor Vishnu Manchu's upcoming fantasy film, 'Kannappa', has been generating buzz due to its star-studded cameo appearances, which include Prabhas, Mohanlal and Akshay Kumar. In a recent interview, Vishnu revealed more details about the film and these characters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/woman-injured-as-theatre-ceiling-crashes-down-at-final-destination-screening-2730586-2025-05-26",
      "headline": "Final Destination turns real as Aregntina theatre ceiling collapses, injures womanFiamma Villaverde's 29th birthday ended up being a real-life 'Final Destination' when she got injured while watching the sixth instalment of the American horror franchise. The theatre ceiling in Argentina collapsed mid-screening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/joju-george-kamal-haasan-oscar-thug-life-mani-ratnam-2730592-2025-05-26",
      "headline": "Kamal Haasan's praise is my Oscar, Mollywood co-workers hurt me: Actor Joju GeorgeActor Joju George was moved to tears when Kamal Haasan praised him at the 'Thug Life' audio launch. The actor shared the video on his Instagram and called Haasan's appreciation his Oscar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-jackie-chan-teaser-karate-kid-legends-hindi-release-2730574-2025-05-26",
      "headline": "You fight, I dance: Jackie Chan tells Ajay Devgn as they promote Karate KidThe teaser of Ajay Devgn and Jackie Chan's conversation was unveiled ahead of Karate Kid: Legends release. The martial arts icon showed keen interest in doing a Bollywood film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/puzzled-sanjay-dutt-asks-karn-as-paps-mention-rasha-thadani-watch-viral-video-2730570-2025-05-26",
      "headline": "Puzzled Sanjay Dutt asks 'kaun' as paps mention Rasha Thadani. WatchActor Sanjay Dutt was asking the paparazzi to leave the place since it was raining when they informed him that they were waiting to click Rasha Thadani at the venue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/typical-hindi-heroine-bipasha-basu-says-jism-changed-how-bollywood-saw-women-2730557-2025-05-26",
      "headline": "'Typical Hindi heroine' Bipasha Basu says Jism changed how Bollywood saw womenActor Bipasha Basu recalled how she was looked at as a 'typical Hindi film heroine' until 'Jism' happened, and changed the perception of Bollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-praises-gram-chikitsalay-and-calls-it-a-must-watch-2730503-2025-05-26",
      "headline": "Sidharth Malhotra praises Gram Chikitsalay, calls it a must watchBollywood actor Sidharth Malhotra is thoroughly impressed with Prime Video's 'Gram Chikitsalay'. The series features Amol Parashar and Vinay Pathak. It premiered on the OTT platform on May 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-gauri-spratt-son-azadl-lunch-date-2730502-2025-05-26",
      "headline": "Aamir Khan, partner Gauri Spratt and son Azad step out for special lunch dateAamir Khan, his partner Gauri Spratt and his son Azad were seen visiting a plush restaurant in Mumbai for lunch. The trio were seen exiting the restaurant in a viral video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-chuk-maaf-box-office-day-3-detailed-report-rajkummar-rao-heartland-comedy-wraps-up-decent-1st-weekend-2730500-2025-05-26",
      "headline": "Bhool Chuk Maaf box office Day 3: Heartland comedy wraps up decent 1st weekend Despite receiving mixed reviews, Rajkummar Rao's 'Bhool Chuk Maaf' collected decently in its opening weekend. The film is set against the backdrop of a wedding and time loop. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/game-changer-editor-shameer-muhammed-director-shankar-unprofessionalism-2730487-2025-05-26",
      "headline": "Game Changer editor slams director Shankar's work ethics: Had terrible experience'Game Changer' editor Shameer Muhammed called out director Shankar's unprofessionalism in a recent interview. He said that the filmmaker would turn up 10 days late for editing and called it a 'terrible experience'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mission-impossible-8-the-final-reckoning-box-office-day-9-detailed-report-tom-cruise-film-fails-to-hit-rs-100-crore-after-2nd-weekend-2730484-2025-05-26",
      "headline": "Mission Impossible 8 box office Day 9: Fails to hit Rs 100 crore after 2nd weekendTom Cruise's 'Mission Impossible - The Final Reckoning' is eyeing Rs 110 crore - the lifetime collection of the previous film in the franchise. However, the film has slowed down with current collection in the range of Rs 72 crore after nine days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-salutes-indian-agniveers-celebrates-countrys-booming-gdp-2730472-2025-05-26",
      "headline": "Amitabh Bachchan salutes India's Agniveers, celebrates country's booming GDP Actor Amitabh Bachchan shared a series of posts on social media, praising India's rise as the fourth-largest economy in the world. He also shared a tribute to the Indian army. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/super-singer-junior-10-winner-gayathri-nasreen-1st-runner-up-kamal-haasan-ar-rahman-2730464-2025-05-26",
      "headline": "Gayathri lifts Super Singer Junior 10 trophy, wins villa worth Rs 60 lakhGayathri won the title of Vijay Television's Super Singer Junior 10, while Nasreen became the first runner-up. Kamal Haasan and AR Rahman were the chief guests for the musical night."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/heavy-rain-batters-mumbai-pune-monsoon-advances-high-alert-karnataka-2730461-2025-05-26",
      "headline": "Rain red alert in Mumbai, roads flooded, local trains and flights hit Live UpdatesMumbai weather: Several low-lying areas, local trains and flight operations have been affected after heavy rain and thunderstorms lashed Mumbai."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-rain-breaks-107-year-record-may-rainfall-monsoon-earliest-arrival-25-years-2730640-2025-05-26",
      "headline": "107-year May rain record broken as monsoon makes earliest arrival in 25 yearsMonsoon in Mumbai has made its earliest arrival in 25 years as rainfall breaks the 107-year record for May"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/covid-19-cases-cross-delhi-kerala-mumbai-fresh-infections-2730577-2025-05-26",
      "headline": "India reports over 1,000 active Covid cases; spikes in Kerala, Maharashtra, DelhiDelhi has registered over 100 cases of Covid-19 with 99 cases recorded in the past week. 750 fresh infections have been reported in the last week in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-gifts-pm-chinese-drill-photo-to-celebrate-own-strikes-against-india-2730549-2025-05-26",
      "headline": "Asim Munir passes off pic of Chinese drill as strike on India, gifts it to Pak PMThe photo was reportedly presented at a high-profile dinner hosted by Pakistan Field Marshal Asim Munir, Chief of Army Staff. It quickly became the subject of widespread mockery on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/no-foreign-wife-shopping-china-warns-against-marriage-scams-in-bangladesh-2730474-2025-05-26",
      "headline": "No 'foreign wife' shopping: China warns against marriage scams in BangladeshThe Chinese embassy in Bangladesh warned its citizens not to fall for deceptive \"cross-border dating\" content on short video platforms or seek out so-called \"foreign wives\" through informal networks or commercial matchmaking agencies,"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-spy-nia-crpf-personnel-delhi-spying-for-pakistan-2730652-2025-05-26",
      "headline": "CRPF personnel from Delhi arrested for spying for Pakistan since 2023A CRPF personnel, Moti Ram Jat, was arrested in Delhi for allegedly sharing classified national security information with Pakistan Intelligence Officers since 2023. \r\n\r\n\r\n\r\n\r\n\r\n4o\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-polices-economic-offences-wing-questions-actor-dino-morea-in-rs-65-crore-mithi-river-cleaning-scam-2730642-2025-05-26",
      "headline": "Actor Dino Morea questioned by Mumbai Police in Rs 65-crore Mithi river scamMumbai Police's Economic Offences Wing questioned actor Dino Morea in Rs 65-crore Mithi river cleaning scam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/india-covid-new-subvariants-nb-1-8-1-lf-7-detection-mild-cases-booster-advice-2730543-2025-05-26",
      "headline": "New Covid-19 variants detected in India: Should you be worried?India has detected new Covid-19 subvariants NB.1.8.1 and LF.7 in Tamil Nadu and Gujarat. Experts say cases remain mild but advise boosters and caution for high-risk groups."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-rain-newly-inaugurated-underground-metro-station-in-worli-flooded-2730676-2025-05-26",
      "headline": "Video: Mumbai's brand-new underground metro station flooded in heavy rainOperational since May 10, the Acharya Atre Chowk underground metro station on Aqua Line 3 got submerged after incessant rain in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-rain-weather-news-live-early-monsoon-thunderstorms-heavy-rain-imd-forecast-traffic-local-trains-waterlogging-2730541-2025-05-26",
      "headline": "Live: Venture out only if necessary, warns Maharashtra Minister amid red alertMumbai weather live update: Thunderstorms with lightning and gusty winds lashed Mumbai on Monday morning, disrupting suburban train services and slowing road traffic amid poor visibility, officials said. The India Meteorological Department (IMD) announced that the southwest monsoon has arrived in Maharashtra nearly ten days ahead of schedule — the earliest since 1990. Civic officials reported continuous rainfall since Sunday night, with some low-lying areas experiencing flooding. The IMD has forecast light to moderate rain in parts of the city over the next 24 hours. Stay with IndiaToday.in for live updates:"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-shopping-spree-drones-launchers-after-india-operation-sindoor-sources-2730580-2025-05-26",
      "headline": "Pak on shopping spree for drones, launchers after India's Op Sindoor: SourcesAfter India's Operation Sindoor, Pakistan is purchasing 30 Wing Loong unmanned aerial vehicles (Chinese killer drones), as per sources. It is also renewing a 2021 defence agreement with a Turkish company, sources added."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/quick-vitals-app-noninvasive-blood-test-anemia-screening-india-no-needle-2730654-2025-05-26",
      "headline": "Inside India's first AI-driven blood test that doesn't require bloodA new app called Quick Vitals offers blood test results by scanning the face without needles. This innovation aims to improve early health screening, especially for anaemia in pregnant women and children, across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/tariff-fallout-check-the-companies-that-will-raise-prices-in-us-higher-prices-in-america-import-goods-2730576-2025-05-26",
      "headline": "Groceries, diapers, toilet paper get costlier as Trump tariffs punish AmericansFrom detergents and diapers to toilet paper and groceries, Americans are going to shell out more for everyday items because companies, including Procter & Gamble and Adidas, and retailers like Walmart have decided to pass on the impact of Trump's tariffs to American consumers. Here's a list of products that are likely to get costlier for consumers in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/17-women-cadets-to-graduate-from-nda-for-the-first-time-on-may-30-2730693-2025-05-26",
      "headline": "NDA's first batch of women cadets to pass out with 300 male cadets on May 30In a historic first for India's armed forces, 17 women cadets will graduate from the National Defence Academy (NDA) alongside 300 male cadets on May 30, marking a major moment in military history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/satellite-images-warn-of-intensifying-rainfall-as-monsoon-swamps-mumbai-2730637-2025-05-26",
      "headline": "Satellite images warn of intensifying rainfall as monsoon swamps MumbaiThe India Meteorological Department (IMD) confirmed on May 26, that the Southwest Monsoon has further advanced into several key regions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tunnel-documents-hamas-gaza-used-october-7-massacre-derail-israel-saudi-arabia-normalisation-yahya-sinwar-2727088-2025-05-26",
      "headline": "Hamas carried out Oct 7 massacre to derail Israel-Saudi deal, reveal tunnel papersA new set of documents recovered by the Israeli army reveal what had long been suspected. The October 7 Hamas massacre of people in Israel was a calculated move to sabotage the normalisation of ties between Israel and Saudi Arabia. It was the \"extraordinary act\" needed to keep the two nations from formalising ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/saudi-arabia-lifts-alcohol-ban-major-rules-ahead-world-cup-2034-wine-beer-cider-2026-heres-what-happened-2730627-2025-05-26",
      "headline": "Saudi Arabia to lift alcohol ban in 2026 ahead of World CupSaudi Arabia, an ultra-conservative country, is planning to legalise alcohol at 600 tourist spots ahead of hosting the 2034 World Cup. It will allow the sale of wine, beer, and cider at licensed locations, such as five-star hotels. Saudi Arabia believes that allowing alcohol at certain tourist sites will help the country compete with the UAE and Bahrain."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/new-satellite-image-shows-pakistans-murid-airbase-damaged-indian-airstrike-2730463-2025-05-26",
      "headline": "New satellite images show damage to Pak's Nur Khan, Murid bases in Indian strikeNew satellite images reveal damage caused to the Pakistan Air Force bases in Murid and Nur Khan after the Indian Air Force's precise strike - Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/all-party-indian-delegation-operation-sindoor-bahrain-pakistan-is-aggressor-not-victim-of-terror-2730403-2025-05-25",
      "headline": "Pak the aggressor, not victim of terror: Team Owaisi tells Bahrainian leadersThe delegation, led by BJP MP Bijayant Panda and also comprising Nishikant Dubey, Phangnon Konyak, Rekha Sharma, Ghulam Nabi Azad, Satnam Singh Sandhu and Harsh Singhla, arrived in Bahrain on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/when-cinema-was-a-carnival-a-love-letter-to-indias-single-screen-theatres-2730614-2025-05-26",
      "headline": "When cinema was a carnival: A love letter to India's single-screen theatresBefore recliners, multiplex food courts, and QR-coded tickets, going to the movies in India meant stepping into a world of shared joy, grand architecture, and community celebration. The single-screen cinemas weren't just movie halls - they were temples of dreams where stories came alive in 70mm, and life slowed down for three blissful hours.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/putins-chopper-epicenter-ukrainian-drone-attack-claims-russian-commander-2730538-2025-05-26",
      "headline": "Putin's chopper was 'at epicentre' of Ukrainian drone attack, claims Russian commanderA Russian military commander has claimed that President Vladimir Putin's helicopter was 'at the epicentre' of the Ukrainian drone attack on May 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/coastal-karnataka-see-heavy-rains-schools-shut-in-mysuru-kodagu-as-krishna-river-swells-major-inflow-almatti-reservoir-2730533-2025-05-26",
      "headline": "Heavy rain lashes coastal Karnataka, Mysuru, Kodagu, light showers in BengaluruThe Met department has issued a red alert for coastal Karnataka, warning of extremely heavy rain, thunderstorms, and lightning. North interior Karnataka is on orange alert with very heavy rain forecast over the next two days. On Monday, Bengaluru saw light drizzles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/liberian-cargo-vessel-sinking-off-kollam-locals-advised-stay-away-from-washed-ashore-hazardous-chemical-carbide-containers-concerns-2730645-2025-05-26",
      "headline": "10 containers from sunken ship wash ashore Kerala coast, locals told to stay awayAuthorities in Kerala are urging locals to be cautious after a cargo ship carrying hazardous materials sank off Kochi coast. Now containers from the sunken vessel are washing ashore, prompting concerns about public safety and environmental risks."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-visits-kamakhya-temple-ahead-of-england-tour-2730643-2025-05-26",
      "headline": "Gambhir visits Kamakhya temple in Guwahati to seek blessings for England tourIndian cricket team head coach Gautam Gambhir visited Maa Kamakhya temple in Guwahati ahead of the upcoming tour of England. India are set to play five Tests against England beginning from June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-robin-uthappa-comments-on-ms-dhonis-ipl-future-2730620-2025-05-26",
      "headline": "Uthappa comments on Dhoni's IPL Future: His fire to win tournaments still burnsFormer India cricketer-turned commentator Robin Uthappa has shared his thoughts on MS Dhoni's future and said that the fire to win tournaments still burns bright in him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gujarat-titans-chennai-super-kings-vikram-solanki-press-conference-2730605-2025-05-26",
      "headline": "GT must be better, no two ways around it: Vikram SolankiIPL 2025, GT vs CSK: Gujarat Titans Director of Cricket Vikram Solanki said that his team needs to play better cricket following the heavy 83-run defeat to the Chennai Super Kings on Sunday at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/vidarbha-hockey-supreme-court-india-plea-2730598-2025-05-26",
      "headline": "Vidarbha's plea for associate membership at Indian Hockey rejectedThe Supreme Court has refused to hear Vidarbha Hockey Association's plea for recognition, citing rules allowing only one state association. It questioned Vidarbha's inaction after derecognition by Maharashtra Hockey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-mi-will-jacks-full-pre-match-press-conference-2730585-2025-05-26",
      "headline": "I've been given lot of confidence in my bowling by captain and coach: Will JacksMumbai Indians (MI) all-rounder Will Jacks has thanked captain Hardik Pandya and head coach Mahela Jayawardene for instilling confidence in his bowling. Jacks has been handy with the ball in the ongoing IPL 2025 having scalped six wickets from seven innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-csk-sridharan-sriram-full-post-match-press-conference-2730575-2025-05-26",
      "headline": "Delighted to finish season on a winning note: CSK bowling coach after win vs GTChennai Super Kings (CSK) bowling coach Sridharan Sriram was delighted with his team finishing the season on a winning note. CSK beat Gujarat Titans by 83 runs in their last fixture in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jos-buttler-vikram-solanki-press-conference-2730567-2025-05-26",
      "headline": "Will Jos Buttler's absence affect GT in playoffs? Vikram Solanki opens upIPL 2025, GT vs CSK: On Jos Buttler's departure after the playoffs, Vikram Solanki said that the Gujarat Titans don't depend on one or two individuals. The Titans have roped in Kusal Mendis as Buttler's replacement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-preview-jaipur-conditions-preview-2730560-2025-05-26",
      "headline": "Top spot at stake as Mumbai Indians face off against Punjab KingsMumbai Indians (MI) are set to take on Punjab Kings (PBKS) in an all-important clash of the Indian Premier League 2025 (IPL 2025), which will guarantee a top two finish for either of the sides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-ajinkya-rahane-press-conference-srh-vs-kkr-2730540-2025-05-26",
      "headline": "Not easy winning a title and then defending it: Ajinkya RahaneIPL 2025: Ajinkya Rahane said that the Knight Riders struggled in the batting department, although their bowlers did reasonably well throughout. On Sunday, the Knights lost to Sunrisers Hyderabad by 110 runs in New Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-preview-carlos-alcaraz-rafael-nadal-2730518-2025-05-26",
      "headline": "Who can challenge Carlos Alcaraz on clay in the post-Nadal era? French Open 2025 ushers in a new era with Carlos Alcaraz poised to defend his crown. With Sinner surging, Djokovic seeking redemption, and dark horses in the mix, Paris is set for a gripping battle to decide the next ruler of Roland Garros."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-kkr-heinrich-klaasen-srh-season-review-2730512-2025-05-26",
      "headline": "SRH's final game serves a reminder of an IPL season that could have beenSRH beat KKR with a scintillating display of batting in their final game of the IPL 2025. The performance served a reminder of the season that could have been for SRH."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jos-buttler-vikram-solanki-press-conference-2730567-2025-05-26",
      "headline": "Will Jos Buttler's absence affect GT in playoffs? Vikram Solanki opens upIPL 2025, GT vs CSK: On Jos Buttler's departure after the playoffs, Vikram Solanki said that the Gujarat Titans don't depend on one or two individuals. The Titans have roped in Kusal Mendis as Buttler's replacement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-preview-jaipur-conditions-preview-2730560-2025-05-26",
      "headline": "Top spot at stake as Mumbai Indians face off against Punjab KingsMumbai Indians (MI) are set to take on Punjab Kings (PBKS) in an all-important clash of the Indian Premier League 2025 (IPL 2025), which will guarantee a top two finish for either of the sides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-ajinkya-rahane-press-conference-srh-vs-kkr-2730540-2025-05-26",
      "headline": "Not easy winning a title and then defending it: Ajinkya RahaneIPL 2025: Ajinkya Rahane said that the Knight Riders struggled in the batting department, although their bowlers did reasonably well throughout. On Sunday, the Knights lost to Sunrisers Hyderabad by 110 runs in New Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-preview-carlos-alcaraz-rafael-nadal-2730518-2025-05-26",
      "headline": "Who can challenge Carlos Alcaraz on clay in the post-Nadal era? French Open 2025 ushers in a new era with Carlos Alcaraz poised to defend his crown. With Sinner surging, Djokovic seeking redemption, and dark horses in the mix, Paris is set for a gripping battle to decide the next ruler of Roland Garros."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-kkr-heinrich-klaasen-srh-season-review-2730512-2025-05-26",
      "headline": "SRH's final game serves a reminder of an IPL season that could have beenSRH beat KKR with a scintillating display of batting in their final game of the IPL 2025. The performance served a reminder of the season that could have been for SRH."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}