{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-buying-bonanza-kicks-off-cars-lead-the-way-2792113-2025-09-23",
      "headline": "GST buying bonanza kicks off, cars lead the wayPM Narendra Modi described GST 2.0 as \"a reform dedicated to the people of India,\" and for many, the benefits were felt immediately. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-your-income-tax-refund-less-than-rs-10000-here-is-why-it-might-reach-you-faster-2792027-2025-09-23",
      "headline": "Is your income tax refund less than Rs 10,000? Here's why it might reach you fasterMany taxpayers are frustrated with refund delays. But here's the catch, simpler refunds tend to move more quickly through the system than bigger claims.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/share-market-news-festive-season-stock-picks-sectors-best-bet-right-now-expert-view-2792047-2025-09-23",
      "headline": "Festive season stock picks: Which sectors are the best bet right now?Autos have already seen a sharp rally, while consumer durables, FMCG, PSU banks, and infrastructure are also emerging as areas to watch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-and-nifty-end-flat-as-it-losses-offset-consumer-stock-gains-2792033-2025-09-23",
      "headline": "Sensex and Nifty end flat as IT losses offset consumer stock gainsThe S&P BSE Sensex slipped 11.83 points to 82,102.1, while the NSE Nifty50 settled 32.85 points lower at 25,169.50. The broader small- and mid-cap indices also lagged, declining 0.5% and 0.4%, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/indian-origin-srinivas-gopalan-rahul-goyal-appointed-as-ceos-of-two-big-us-companies-2791848-2025-09-23",
      "headline": "Indian-origin Srinivas Gopalan, Rahul Goyal appointed as CEOs of two big US companiesTwo major US companies have appointed Indian-origin CEOs. Telecom giant T-Mobile announced Srinivasan Gopalan will take over as CEO from November 1. Beverage major Molson Coors has chosen Rahul Goyal as its new CEO, effective October 1. Gopalan's appointment comes as the US wireless market faces challenges, including slowing subscriber growth and fierce competition. Goyal, a company veteran, has previously served in key roles including CFO of Molson Coors India. These appointments are notable amidst discussions around the H1B visa program in the US. A reporter noted, \"Desi CEO for US Giants is the biggest news in the day for Telecom and IT space as well.\" This highlights the significance of these leadership changes in the corporate world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-rises-to-all-time-high-3-reasons-behind-its-strength-2791956-2025-09-23",
      "headline": "Gold rises to all-time high. 3 reasons behind its strengthInvestors are flocking to gold as it climbs to record highs, supported by currency weakness, economic uncertainty, and inflationary pressures. Here are the three main drivers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-health-insurance-crisis-denied-claims-rejections-financial-mental-stress-2791939-2025-09-23",
      "headline": "Denied, delayed, dismissed: Inside India's broken health insurance systemIn this special report, part of our 'CLAIM DENIED' series, we uncover why health insurance in India has become a gamble for families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sip-vs-swp-how-to-turn-your-retirement-corpus-into-reliable-income-2791903-2025-09-23",
      "headline": "SIP vs SWP: How to turn your retirement corpus into reliable incomeAccumulating wealth through SIPs is just the beginning of retirement planning. The real challenge is turning that corpus into a steady income. Here's how you can do it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-withdrawal-rule-change-relaxation-government-housing-marriage-education-report-2791915-2025-09-23",
      "headline": "PF pre-retirement withdrawal rules likely to be relaxed: ReportAt present, EPFO members can withdraw their entire corpus only after reaching the retirement age of 58, or if they remain unemployed for more than two months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/launching-a-startup-this-government-scheme-simplifies-early-funding-2791851-2025-09-23",
      "headline": "Launching a startup? This government scheme simplifies early fundingStarting a startup is exciting but securing funds at the initial stage is often a hurdle. This government scheme provides seed funding through incubators, giving you the financial boost to test, prototype, and launch your product."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-5-and-itr-7-filing-opens-online-who-can-file-and-by-when-2791813-2025-09-23",
      "headline": "ITR-5 and ITR-7 filing opens online. Who can file and by when?The Income Tax Department has opened online filing for ITR-5 and ITR-7 forms for AY 2025–26. These forms are not meant for individuals but for specific entities. Here's a quick look at who needs to file and the deadlines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-srini-gopalan-t-mobile-ceo-net-worth-profile-education-experience-indian-origin-2791808-2025-09-23",
      "headline": "Who is Srini Gopalan, T-Mobile's new Indian-origin CEOSrini Gopalan will take over from Mike Sievert, who has been named Vice Chairman. Mike Sievert, the outgoing CEO, said that Gopalan was the natural choice to take T-Mobile forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/gold-all-time-high-festive-season-buy-safe-to-invest-expert-view-silver-yellow-metal-price-today-2791785-2025-09-23",
      "headline": "Gold shines at an all-time high, but is it safe to invest?The yellow metal, traditionally seen as a safe haven in uncertain times, has surged sharply in the past year, supported by global factors ranging from geopolitical tensions to central bank buying. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/take-that-maga-two-indian-origin-ceos-us-companies-h1b-crackdown-2791772-2025-09-23",
      "headline": "Take that, MAGA. Two big US firms appoint Indian-origin CEOs amid H-1B crackdownAmid H-1B tensions, two Indian-origin executives, Srinivas Gopalan and Rahul Goyal, rise to top US leadership roles, defying Make America Great Again (MAGA) hardliners and reshaping America's corporate landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-up-100-points-nifty-above-25200-maruti-jumps-over-2-2791752-2025-09-23",
      "headline": "Markets edge higher, auto stocks lead early gains; volatility loomsThe Sensex climbed nearly 100 points in early trade, while the Nifty50 hovered above 25,200. Broader indices, however, struggled to find traction as pockets of profit booking introduced early volatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-gifting-festive-season-ministry-of-finance-bans-notice-orders-all-departments-to-comply-2791723-2025-09-23",
      "headline": "Ministry of Finance bans spending on Diwali gifts, orders all to complyThe latest notice from the Ministry of Finance comes as part of the government's continuing efforts to enforce fiscal discipline and restrict non-essential spending."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/nvidia-invest-100-billion-dollars-openai-next-gen-ai-growth-glbs-2791630-2025-09-22",
      "headline": "Nvidia to invest $100 billion in OpenAI for next-gen AI infrastructureThe companies unveiled a letter of intent for a landmark strategic partnership to deploy at least 10 gigawatts of Nvidia chips for OpenAI's AI infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-noida-is-emerging-as-indias-next-hotspot-for-branded-residences-2791571-2025-09-22",
      "headline": "Why Noida is emerging as India's next hotspot for branded residencesNoida is shedding its image as just a satellite city of Delhi. With luxury developers entering the market, it's fast becoming India's go-to destination for branded residences that promise prestige, comfort, and modern living."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indusind-bank-ex-cfo-gobind-jain-records-statement-accounting-lapse-probe-2791491-2025-09-22",
      "headline": "IndusInd Bank's ex-CFO records statement in accounting lapse probeMumbai Police's Economic Offences Wing (EOW) has so far recorded statements of seven to eight employees of the bank. Ex-CFO Gobind Jain recorded his statement today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-refund-claim-rejected-ca-explains-how-to-rectify-and-reapply-itr-refund-2025-2791446-2025-09-22",
      "headline": "Income tax refund claim rejected? CA explains how to rectify and reapplyGetting your income tax refund rejected can be unsettling, especially after filing on time. But in most cases, the issues are minor and fixable. Here's a look at why rejections occur and how to reapply successfully."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/gold-silver-stock-market-where-should-you-invest-right-now-invest-2791440-2025-09-22",
      "headline": "Gold, silver or equity: Where should you invest right now?Gold prices touched a fresh record high on the 1st day of Navrartri, once again sparking the age-old debate among investors: where should money be parked during this time, gold, silver, or equity?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/union-minister-ashwini-vaishnaw-discusses-gst-msme-benefits-key-reforms-2791387-2025-09-22",
      "headline": "Union Minister Ashwini Vaishnaw discusses GST, MSME benefits, key reformsUnion Minister Ashwini Vaishnaw held a press conference, detailing the benefits of GST reform. The Minister explained how GST advantages extend to all states, estimating a saving of Rs 3,500 for a middle-class family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-it-shares-closing-bell-2791406-2025-09-22",
      "headline": "Sensex falls over 450 points, Nifty settles lower as IT stocks tumbleThe sell-off was led by information technology stocks, which tumbled nearly 2% after President Donald Trump announced a $100,000 fee for new H-1B visa applications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-500-points-why-is-the-stock-market-falling-today-2791392-2025-09-22",
      "headline": "Sensex tumbles 500 points: Why is the stock market falling todayThe S&P BSE Sensex was down 503.31 points at 82,122.92 by 2:55 pm, while the NSE Nifty50 slipped 143.80 points to 25,183.20. Volatility surged across broader market segments, with most indices in the red. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/h1b-visa-fee-hike-indian-it-sector-demand-slowdown-investor-caution-2791384-2025-09-22",
      "headline": "IT sector faces H-1B visa jitters: Should you keep your money parked or sell?Recent changes to the H-1B visa programme have triggered new worries for Indian IT companies, already facing weaker client demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/turning-50-here-how-to-protect-your-retirement-savings-explains-financial-advisor-2791255-2025-09-22",
      "headline": "Turning 50? Here's how to protect your retirement savings, explains financial advisorHitting 50 can be a mix of pride and worry, especially when it comes to money. Even after years of saving and investing, many fear their retirement funds may not last as long as planned. Here are expert tips to safeguard your savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/errors-in-itr-filing-3-simple-ways-to-fix-it-revise-rectify-or-update-2791213-2025-09-22",
      "headline": "Errors in ITR filing? 3 simple ways to fix it: Revise, rectify or updateWorried about spotting a mistake in your ITR after filing? You're not alone. Errors happen to many taxpayers. Thankfully, the system gives you not one but three ways to fix them. Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/stock-market-tip-still-bet-on-it-stocks-h-1b-visa-worries-information-technology-shares-2791227-2025-09-22",
      "headline": "Should you still bet on IT stocks as H-1B visa worries resurface?The US move on H-1B visa has stirred fears of rising costs and tighter restrictions on tech firms that rely on sending skilled workers to client locations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/gst-20-rate-cut-groceries-electronic-items-get-cheaper-this-festive-season-2791141-2025-09-22",
      "headline": "GST 2.0 rate cut: Groceries, electronic items get cheaper this festive seasonThis report examines the impact of GST rate changes on household budgets, focusing on groceries and electronics. Items like chocolates and shampoos are now cheaper, with shampoos moving from an 18% to a 5% tax bracket. In contrast, aerated drinks are subject to a 'sin tax'. The report highlights significant savings, noting, \"an average saving of 10% will mean 5000 rupees per month saving\" for a consumer with a monthly income of one lakh rupees. The changes are presented as a \"festive gift from the Modi government,\" with major electronics also seeing price drops. Televisions over 32 inches, previously in a 28% slab, are now taxed at 18%, resulting in substantial savings for consumers looking to upgrade. Washing machines, refrigerators, and dishwashers also benefit from a 10% tax reduction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-gst-rates-goods-and-services-cheaper-live-updates-pm-modi-business-2791149-2025-09-22",
      "headline": "Live: GST 2.0 kicks off, BJP urges traders to pass on relief to consumersThe GST Council has approved major tax reforms effective today, September 22, introducing a simplified two-rate structure of 5% and 18% to ease compliance and lower costs. Essential items like soaps, shampoos, bicycles, and packaged foods will now attract 5% GST, while appliances such as ACs and large TVs will be taxed at 18%, down from 28%. Luxury and sin goods, including tobacco and high-end cars, will continue to face a 40% levy plus compensation cess. Follow Indiatoday.in for latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tech-mahindra-tcs-infosys-why-are-it-stocks-falling-today-h1b-visa-stricter-norms-fees-2791142-2025-09-22",
      "headline": "Tech Mahindra, TCS, Infosys: Why are IT stocks falling today?Tech Mahindra was the worst hit, sliding nearly 5% in early trade. Infosys, Tata Consultancy Services (TCS), HCLTech and Wipro also fell more than 2.5% each. The Nifty IT index shed almost 3%, making it one of the day's worst-performing sectoral indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-down-346-points-nifty-below-25300-tech-mahindra-tanks-6-percent-2791136-2025-09-22",
      "headline": "Sensex down 346 points, Nifty below 25,300; Tech Mahindra tanks 6%The S&P BSE Sensex was down by 267.56 points to 82,358.67, while the NSE Nifty50 lost 48.60 points to 25,278.45​​​​​​​ as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/h-1-b-visa-kunal-bahl-radhika-gupta-consoles-techies-return-to-india-work-here-trump-2791133-2025-09-22",
      "headline": "Kunal Bahl, rejected for H-1B, consoles techies: I did well in India, didn't I?While India has long been the biggest beneficiary of H-1B visas, accounting for 71% of all approvals last year, uncertainty has cast a shadow over careers, education plans and the information technology industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-reforms-today-price-changes-everyday-goods-milk-dairy-sin-ultra-luxury-pm-modi-india-tax-2791115-2025-09-22",
      "headline": "GST 2.0 kicks in: What changes in your shopping bill from today Live UpdatesThe government expects GST 2.0 to reduce compliance challenges, cut disputes, and make goods and services cheaper for households. Read on to know which items get cheaper and which turn costlier from today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-gst-rates-from-september-22-cheaper-costlier-list-of-products-list-2790847-2025-09-21",
      "headline": "GST 2.0 comes into effect: What's cheaper and costlier from todayAs the new rates under GST 2.0 come into effect from Monday, Prime Minister Narendra Modi said the reforms will boost savings for households, farmers, shopkeepers, and businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-refund-delay-under-processin-how-to-check-status-and-what-to-do-next-2790817-2025-09-21",
      "headline": "ITR refund under processing? Here's how to check status and what to do nextIf your refund remains under processing, first ensure your ITR has been e-verified, as refunds cannot be processed without this step. You can also check Form 26AS to verify if the refund has already been credited to your account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-grocery-runs-to-gym-sessions-what-today-homebuyers-really-want-2790798-2025-09-21",
      "headline": "From grocery runs to gym sessions: What today's homebuyers really wantToday's urban buyers want more than a home, they seek a lifestyle where comfort, convenience, and community come together, and daily needs, work, and wellness coexist effortlessly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-leads-indian-delegation-us-trade-talks-september-22-2025-2790679-2025-09-20",
      "headline": "Piyush Goyal to visit US for trade talks on September 22 amid tariff, H-1B tensionsThe minister will visit New York and will be accompanied by special secretary in the ministry Rajesh Agrawal and other officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-h1b-visa-fee-hike-100000-panic-indian-professionals-travel-disruption-diwali-2790663-2025-09-20",
      "headline": "H-1B visa holders cancel trips to India for weddings, Diwali amid new fee hikeWhile many cancelled plans to travel at the last minute while waiting to board flights to India, several others already in India are scrambling to return amid lack of clarity after Trump on Friday signed a proclamation to raise the H-1B visa fees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amul-cuts-prices-of-700-products-ghee-cheaper-by-rs-40-per-litre-from-september-22-mother-dairy-gst-rate-cuts-2790620-2025-09-20",
      "headline": "Amul cuts prices of 700 products, ghee cheaper by Rs 40 per litre from Sept 22Amul, marketed by the Gujarat Cooperative Milk Marketing Federation (GCMMF), on Saturday announced a price reduction for over 700 products, including ghee, butter, ice cream, cheese, and frozen snacks. The move comes after a GST rate cut, with the company passing the benefits to consumers."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-national-film-award-best-actor-jawan-suhana-khan-message-2792190-2025-09-23",
      "headline": "This silver is gold: Suhana, Aryan's sweet note for papa SRK's National Award winSuhana Khan and Aryan Khan posted a sweet message for their father Shah Rukh Khan after he received the National Film Award for Best Actor for 'Jawan'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-security-officer-duped-rs-42-lakh-domestic-help-family-chennai-scam-2792171-2025-09-23",
      "headline": "Actor Suriya's security officer duped of Rs 42 lakh by his domestic help's familyActor Suriya's PSO was cheated of Rs 42 lakh by his domestic help's family. The scam has wider implications as police uncover a Rs 2 crore fraud racket in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vidhu-vinod-chopra-on-12th-fails-national-award-win-real-fear-is-within-2792175-2025-09-23",
      "headline": "Real fear is within: Vidhu Vinod Chopra on 12th Fail's National Award winDirector Vidhu Vinod Chopra's film '12th Fail', depicting Manoj Kumar Sharma's inspiring rise from poverty to the IPS, won a National Award in New Delhi. The filmmaker, in an exclusive interview with AajTak, emphasised that his cinema is about truth and inner conviction, hoping audiences engage deeply with his work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/poonam-pandey-removed-from-mandodari-role-in-delhi-ramlila-amid-objections-2792087-2025-09-23",
      "headline": "Poonam Pandey removed from Mandodari role in Delhi Ramlila amid objectionsThe Luv Kush Ramlila Committee has removed actor Poonam Pandey from playing Mandodari at Delhi's Red Fort after facing objections from political and religious groups. The committee said the decision was made to ensure the event's core purpose of spreading Lord Ram's message is upheld."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rani-mukerji-wears-necklace-with-daughter-adira-initials-at-national-awards-2792160-2025-09-23",
      "headline": "Rani Mukerji wears necklace with daughter Adira's initials at National Awards. PicRani Mukerji won the Best Actress award at the 71st National Film Awards for 'Mrs Chatterjee vs Norway' and added a personal touch to her look with a gold chain featuring her daughter Adira's initials. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-oscar-selection-sparks-rule-debate-ffi-chairman-responds-2792151-2025-09-23",
      "headline": "Exclusive: Homebound Oscar selection sparks rule debate, FFI chairman responds'Homebound' has been selected as India's official entry for the Oscars 2026. The decision sparked debate over the film's theatrical release and screening timeline compliance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/janaawar-ott-when-and-where-to-watch-bhuvan-aroras-crime-series-2792050-2025-09-23",
      "headline": "Janaawar OTT: When and where to watch Bhuvan Arora's crime seriesBhuvan Arora leads 'Janaawar – The Beast Within', a gritty crime drama about a tribal sub-inspector drawn into a dangerous investigation of murder, greed, and betrayal. The series premieres on ZEE5 on September 26, following the trailer launch on September 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-heaps-praise-on-teja-sajja-mirai-calls-it-technical-brilliance-2792131-2025-09-23",
      "headline": "Allu Arjun heaps praise on Teja Sajja's Mirai, calls it technical brillianceTeja Sajja's 'Mirai' has emerged as a box-office success, earning praise from industry mains including Allu Arjun, for its passion, scale, and technical excellence. With global collections crossing Rs 100 crore and continuous fan support, the film is set to enjoy a strong theatrical run ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-dadasaheb-phalke-award-winning-full-speech-content-from-71st-national-award-video-cinema-is-the-heartbeat-of-my-soul-2792121-2025-09-23",
      "headline": "Cinema is the heartbeat of my soul: Mohanlal after Dadasaheb Phalke winMohanlal accepted the Dadasaheb Phalke Award at the 71st National Awards with a stirring speech, calling the honour \"not a dream-come-true but something sacred,\" and dedicating it to Malayalam cinema and its legendary fore-runners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/katrina-kaif-fatherhood-parenting-childhood-pregnancy-vicky-kaushal-2792005-2025-09-23",
      "headline": "When Katrina Kaif reflected on childhood and her hopes as a future motherKatrina Kaif shared her thoughts on fatherhood, the absence of a father figure during her upbringing, and her hopes for her future children. The actor and her husband Vicky Kaushal are expecting their first child."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-nails-star-power-in-the-bads-of-bollywood-with-no-wasted-cameos-2792015-2025-09-23",
      "headline": "Aryan Khan nails star power in The Ba***ds of Bollywood with no wasted cameosAryan Khan's directorial debut with 'The Ba***ds of Bollywood' shines with 21 Bollywood cameos, sharp storytelling, and a vision that proves he's more than just Shah Rukh Khan's son."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-kbc-17-navratri-pallavi-niphadkar-prize-2791830-2025-09-23",
      "headline": "KBC 17: Amitabh Bachchan recalls time when wife Jaya played host on the showOn 'Kaun Banega Crorepati 17', Big B shared Navratri greetings and welcomed contestant Pallavi Niphadkar. Bachchan recalled an episode where his wife Jaya hosted, and he became the contestant, describing himself as speechless."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mastiii-4-teaser-og-boys-vivek-riteish-aftab-promise-four-times-laughter-and-fun-2792004-2025-09-23",
      "headline": "Mastiii 4 teaser: OG trio Vivek, Riteish, Aftab promise four times laughter and funThe teaser of 'Mastiii 4' starring Vivek Oberoi, Aftab Shivdasani and Riteish Deshmukh is out. The film is slated to release in theatres on November 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-youtube-channel-baby-bump-life-updates-2791941-2025-09-23",
      "headline": "Parineeti Chopra back on YouTube with baby bump and life updates. WatchActor Parineeti Chopra on Tuesday announced her YouTube comeback eight months after starting her channel. The latest video featured the actor exploring different ideas and genres for her channel and reacting to viral memes, while giving a baby bump update."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nana-patekar-extend-support-to-pakistan-shelling-victims-in-jammu-and-kashmir-2791844-2025-09-23",
      "headline": "Nana Patekar offers support to Pak shelling victims, provides Rs 42 lakh aidActor Nana Patekar's Nirmala Gajanan Foundation, in collaboration with the Indian Army, distributed Rs 42 lakh rehabilitation aid to 117 families affected by cross-border shelling in Rajouri and Poonch in the aftermath of Operation Sindoor. Patekar called it a collective responsibility of citizens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kumar-sanu-ex-wife-rita-bhattacharya-alleges-abuse-during-pregnancy-2791932-2025-09-23",
      "headline": "Kumar Sanu's ex-wife Rita alleges abuse during pregnancy: They locked kitchenKumar Sanu's ex-wife, Rita Bhattacharya, alleged that she faced abuse from the singer and his family while pregnant with their son, Jaan Kumar Sanu. She also claimed his behaviour changed after he gained fame with 'Aashiqui', and highlighted instances of mistreatment and neglect during their marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-raj-nidimoru-spotted-together-mumbai-gym-relationship-rumours-2791965-2025-09-23",
      "headline": "Samantha and rumoured boyfriend Raj Nidimoru hit the gym together in MumbaiSamantha Ruth Prabhu and Raj Nidimoru were seen together at a Bandra gym in Mumbai. Their joint appearance has fuelled ongoing rumours about their relationship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-security-threat-travis-kelce-home-justin-baldoni-lawsuit-2791850-2025-09-23",
      "headline": "Taylor Swift has intruder arrested at Travis Kelce's house over Justin Baldoni caseTaylor Swift faced a security incident at fiance Travis Kelce's house after a man was arrested for trespassing. The man was attempting to serve legal documents related to a lawsuit involving actor Justin Baldoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johars-joke-on-farah-khans-cook-dilip-steals-spotlight-at-homebound-premiere-2791865-2025-09-23",
      "headline": "Karan Johar's joke on Farah Khan's cook Dilip steals spotlight at Homebound premiereKaran Johar and Farah Khan's witty banter stole the spotlight at the Mumbai premiere of Neeraj Ghaywan's 'Homebound', even amid a star-studded turnout. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/i-ended-7-unendable-wars-including-india-and-pakistan-trump-at-un-general-assembly-2792162-2025-09-23",
      "headline": "I ended 7 unendable wars including India and Pak: Trump at UN General AssemblyAt the UN General Assembly session, US President Donald Trump repeated his claim that he had a hand in solving the military flare-up between India and Pakistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/jaffar-express-derails-after-blast-in-balochistans-mastung-rescue-ops-underway-for-trapped-passengers-2792212-2025-09-23",
      "headline": "Jaffar Express derails after blast in Pak's Balochistan, rescue ops underwayThe incident occurred just hours after Pakistani security forces clearing railway tracks in the same area were targeted with explosives. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/kolkata-heavy-rain-record-rain-floods-city-days-before-durga-puja-metro-services-impacted-2791750-2025-09-23",
      "headline": "Record rain brings Kolkata to knees; 9 dead, 91 flights cancelled  Live UpdatesKolkata reels under record rainfall, with streets and homes submerged, and nine dead in rain-related incidents. Chief Minister Mamata Banerjee said authorities were working round the clock to restore normalcy amid widespread flooding and disrupted festive preparations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-donald-trump-plans-h1b-visa-overhaul-prioritise-higher-salaries-advanced-skills-workers-india-economy-techies-maga-2792157-2025-09-23",
      "headline": "US govt proposes new H-1B visa system, favours high-skilled, high-waged workersThe Trump administration's H-1B visa overhaul, prioritising high-skilled, well-paid workers, follows a hefty $100,000 fee hike. Aimed at curbing the visa programme's alleged misuse, the move has sparked a debate about whether it would really protect American jobs or drive talent abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshadeep-singh-asia-cup-gesture-india-wins-sign-language-war-pakistan-cricket-field-operation-sindoor-military-strike-2792153-2025-09-23",
      "headline": "India destroy Pakistan's mujahid cricket team in sign-language warIndia's dominance over mujahid mentality-infested Pakistan spans both the battlefield and cricket field. It has turned Pakistani provocations into opportunities to assert control. From Operation Sindoor to Arshdeep Singh's viral on-field gesture, India's evidence-backed strikes and measured retorts on the field have left Pakistan outplayed in every arena."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/after-naming-india-china-trump-blasts-europe-for-buying-russian-products-2792174-2025-09-23",
      "headline": "India, China funding Ukraine war: Trump slams Russian oil purchase in UN speechDonald Trump told delegates that Russia's ongoing offensive was being propped up by revenue from energy sales. He directly named India and China, saying their imports were financing Moscow's campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/french-president-macron-stopped-new-york-trump-convoy-viral-video-2792016-2025-09-23",
      "headline": "Everything closed for you: Macron, stopped for Trump convoy, dials US PresidentAs Macron was returning to the French embassy after his UN speech, he was stopped by the New York police to let US President Donald Trump's convoy pass. Read on to find out what unfolded later. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-inaugurate-durga-puja-pandals-virtually-after-kolkata-floods-west-bengal-2792222-2025-09-23",
      "headline": "Mamata Banerjee to inaugurate Durga Puja pandals virtually amid Kolkata rain woesWest Bengal Chief Minister Mamata Banerjee will inaugurate Durga Puja pandals virtually after heavy rains and flooding crippled Kolkata, leaving nine dead and disrupting flights and transport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-oscar-selection-sparks-rule-debate-ffi-chairman-responds-2792151-2025-09-23",
      "headline": "Exclusive: Homebound Oscar selection sparks rule debate, FFI chairman responds'Homebound' has been selected as India's official entry for the Oscars 2026. The decision sparked debate over the film's theatrical release and screening timeline compliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/allow-limited-vehicle-movement-through-bengaluru-wipro-campus-to-ease-congestion-siddaramaiah-to-azim-premji-2791925-2025-09-23",
      "headline": "A Siddaramaiah appeal to Wipro's Azim Premji amid Bengaluru's traffic troublesKarnataka Chief Minister Siddaramaiah wrote to Wipro founder Azim Premji to allow limited vehicular movement through the campus, aiming to ease traffic on Bengaluru's Outer Ring Road. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ulips-mutual-funds-why-you-need-both-for-a-balanced-portfolio-2789465-2025-09-19",
      "headline": "ULIPs & Mutual Funds: Why you need both for a balanced portfolioULIPs give you protection and discipline for the long haul, while mutual funds give you liquidity and flexibility for the near term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-un-speech-live-updates-general-assembly-2025-unga-india-new-york-2792141-2025-09-23",
      "headline": "Live: Europe invaded by force of aliens, in serious trouble, says TrumpDonald Trump UN Speech Live: Donald Trump will deliver his speech at the 80th session of UN General Assembly today, his first appearance at the general debate since 2020. The president will address the assembly after UK, France, Belgium, Canada, Australia and Portugal recognised the Palestinian state, a move opposed by Washington. White House Press Secretary Karoline Leavitt said Trump will highlight the renewal of American strength around the world, including claims of ending seven international conflicts. Follow Indiatoday.in for the latest updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-high-court-caste-references-police-records-liquor-case-2792023-2025-09-23",
      "headline": "A car full of booze and an unlikely HC ruling on caste. What's the connection?What began as a liquor smuggling case in Uttar Pradesh turned into a deeper judicial reflection on caste. A High Court judge used the moment to question why caste still features in police records and public life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-zubeen-garg-death-assam-life-exposes-tragedy-of-india-diversity-jubin-nautiyal-puneeth-rajkumar-kalpana-patowary-2791978-2025-09-23",
      "headline": "How Zubeen Garg's life and death expose the tragedy of India's diversityRest of India was left surprised as lakhs of people descended on the streets of Assam to mourn singer Zubeen Garg's death. Though immensely popular in Assam and Bengal, Zubeen was little-known in other parts of India. It was the same story in case of Puneeth Rajkumar. Zubeen's life and death exposes the dichotomy of India's diversity where icons like Puneeth, Sharda Sinha and Soumitra Chatterjee die without wide national recognition they deserve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-fiery-gesture-asia-cup-2025-india-pakistan-super-4-2792011-2025-09-23",
      "headline": "Asia Cup: Arshdeep Singh's response to Haris Rauf's fighter-jet celebration goes viralIndia's Arshdeep Singh made headlines with a fiery gesture which could likely have come during the game against Pakistan in the Asia Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/moldova-nato-launch-european-union-plotting-occupation-russian-intelligence-kremlin-vladimir-putin-elections-2791998-2025-09-23",
      "headline": "Nato troops near Ukraine, ready to occupy Moldova, says RussiaThe tiny European nation of Moldova could emerge as a big flashpoint in the Nato-Kremlin conflict. A Russian intelligence agency said Nato was plotting a \"landing\" in Ukraine, in the European Union's bid to \"occupy\" Moldova. Moldovan authorities have arrested over 70 people linked to a Russian uprising plot ahead of the September 28 election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/take-that-maga-two-indian-origin-ceos-us-companies-h1b-crackdown-2791772-2025-09-23",
      "headline": "Take that, MAGA. Two big US firms appoint Indian-origin CEOs amid H-1B crackdownAmid H-1B tensions, two Indian-origin executives, Srinivas Gopalan and Rahul Goyal, rise to top US leadership roles, defying Make America Great Again (MAGA) hardliners and reshaping America's corporate landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-health-insurance-crisis-denied-claims-rejections-financial-mental-stress-2791939-2025-09-23",
      "headline": "Denied, delayed, dismissed: Inside India's broken health insurance systemIn this special report, part of our 'CLAIM DENIED' series, we uncover why health insurance in India has become a gamble for families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ed-attaches-properties-worth-rs-744-crore-linked-to-ex-delhi-minister-satyendar-jain-2792091-2025-09-23",
      "headline": "Ex-Delhi minister Satyendar Jain's assets worth Rs 7.44 crore attached by EDThe ED's money laundering probe stems from a CBI case filed in 2017, which accused Satyendar Jain of amassing disproportionate assets between February 2015 and May 2017 while serving as a minister in the AAP-led Delhi government. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/woman-charlie-kirk-go-to-starbucks-order-us-ohio-gets-racists-fav-drink-cup-2792077-2025-09-23",
      "headline": "Woman opts for Charlie Kirk's go-to Starbucks order, gets 'Racist's Fav Drink' cupA Starbucks location in Ohio has come under fire after a customer said an employee wrote \"racist's fav drink\" on her order when she requested a beverage to honour Charlie Kirk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/microdosing-exercises-the-fitness-shortcut-of-the-year-2791498-2025-09-23",
      "headline": "Microdosing exercises: The fitness shortcut of the yearMaking time for a full-blown 30–45-minute gym session or workout routine can be challenging. But how about microdosing on it? Just like munching on a snack in between meals throughout the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-dadasaheb-phalke-award-winning-full-speech-content-from-71st-national-award-video-cinema-is-the-heartbeat-of-my-soul-2792121-2025-09-23",
      "headline": "Cinema is the heartbeat of my soul: Mohanlal after Dadasaheb Phalke winMohanlal accepted the Dadasaheb Phalke Award at the 71st National Awards with a stirring speech, calling the honour \"not a dream-come-true but something sacred,\" and dedicating it to Malayalam cinema and its legendary fore-runners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/best-chapter-of-our-lives-katrina-kaif-vicky-kaushal-announce-pregnancy-2791886-2025-09-23",
      "headline": "Best chapter of our lives: Katrina Kaif, Vicky Kaushal announce pregnancyBollywood's favourite couple, Katrina Kaif and Vicky Kaushal, are set to welcome their first child, stepping into a joyous new chapter that has fans and the film world celebrating with them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tdp-andhra-pradesh-nara-lokesh-chandrababu-naidu-son-technology-entrepreneurs-vizag-visakhapatnam-hyderabad-bengaluru-2791603-2025-09-23",
      "headline": "Is Nara Lokesh seeking father of all revenges via Vizag?Nara Lokesh, Andhra Pradesh minister and CM Chandrababu Naidu's son, recently invited a tech entrepreneur to set shop in Vizag. Nara Lokesh has been pitching Vizag as an alternative to Bengaluru and Hyderabad. It seems like the TDP leader is out to avenge his father's loss in the Hyderabad-Bangalore cybercity battle of the 1990s. Bengaluru, having won the IT race and with Hyderabad going to Telangana, Vizag is the port of call for the big daddy of all revenges."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-middle-order-role-asia-cup-2025-india-management-backing-2792199-2025-09-23",
      "headline": "Sanju Samson gets backing from team management despite tough start to new roleAsia Cup 2025: Assistant coach Ryan ten Doeschate said the team management is backing Sanju Samson to find his rhythm in the middle-order. Samson struggled to get going against Pakistan in the Super 4 match in Dubai on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-jofra-archer-mark-wood-return-england-ashes-squad-australia-2025-2792191-2025-09-23",
      "headline": "England announce Ashes squad: Harry Brook named vice-captain, Mark Wood returnsBen Stokes, Mark Wood and Jofra Archer have been named in England's Ashes squad as they continue their injury comebacks, while Chris Woakes misses out ahead of the November series in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/haris-rauf-controversy-india-pakistan-asia-cup-2025-ryan-ten-doeschate-reaction-2792186-2025-09-23",
      "headline": "Saw what Haris Rauf did: India coach responds to fighter-jet gesture controversyIndia assistant coach Ryan ten Doeschate praises the team's calm response to Haris Rauf's provocative gestures during Asia Cup 2025. India beat Pakistan by six wickets in the Super 4 fixture of the tournament in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshadeep-singh-asia-cup-gesture-india-wins-sign-language-war-pakistan-cricket-field-operation-sindoor-military-strike-2792153-2025-09-23",
      "headline": "India destroy Pakistan's mujahid cricket team in sign-language warIndia's dominance over mujahid mentality-infested Pakistan spans both the battlefield and cricket field. It has turned Pakistani provocations into opportunities to assert control. From Operation Sindoor to Arshdeep Singh's viral on-field gesture, India's evidence-backed strikes and measured retorts on the field have left Pakistan outplayed in every arena."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-india-vs-bangladesh-phil-simmons-press-conference-2792152-2025-09-23",
      "headline": "Bangladesh going to ride on the hype of playing against India: Coach Phil SimmonsAsia Cup 2025, IND vs BAN: After their close shave against Sri Lanka, Bangladesh will look to continue their form when they lock horns with Suryakumar Yadav's India on Wednesday at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-litton-das-injury-asia-cup-super-four-clash-india-2792134-2025-09-23",
      "headline": "Litton Das suffers injury scare before Bangladesh's Super 4 clash vs IndiaBangladesh suffered a scare ahead of their Super Four clash against India as skipper Litton Das injured his left rib during practice in Dubai. If ruled out, Parvez Hossain Emon could replace him in the XI. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-a-vs-aus-a-prasidh-krishna-mohammed-siraj-expensive-spell-manav-suthar-2792111-2025-09-23",
      "headline": "IND-A vs AUS-A: Expensive spells from Siraj and Krishna help Australia reach 350Mohammed Siraj and Prasidh Krishna registered expensive figures during Day 1 of the second unofficial Test as Australia A ended at 350-9 against India A. However, Manav Suthar registered his fifth five-wicket haul in first-class cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-slams-pakistan-shaheen-haris-asia-cup-loss-india-2792099-2025-09-23",
      "headline": "Harbhajan Singh slams Shaheen, Haris after Pakistan's Asia Cup loss to IndiaFormer India spinner Harbhajan Singh has questioned the leadership and performance of Pakistan's senior bowlers, Shaheen Afridi and Haris Rauf, after their Asia Cup defeat to India, where the Indian openers dominated despite heated verbal exchanges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dickie-bird-legendary-cricket-umpire-dies-aged-92-2792063-2025-09-23",
      "headline": "Legendary umpire Dickie Bird, who stood in 1983 World Cup final, dies at 92Legendary umpire Dickie Bird died at the age of 92. His ability to command respect while maintaining warmth and humour made him one of the most popular officials in the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-on-tilak-varma-dominates-shaheen-afridi-india-beats-pakistan-2792054-2025-09-23",
      "headline": "Tilak Varma treated Shaheen Afridi like a net-ball spinner: Sunil GavaskarTilak Varma scored an unbeaten 30* off 19 balls vs Pakistan, smashing two fours and as many sixes in his innings. He smashed Afridi for a six followed by a boundary to finish the match in style."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-a-vs-aus-a-prasidh-krishna-mohammed-siraj-expensive-spell-manav-suthar-2792111-2025-09-23",
      "headline": "IND-A vs AUS-A: Expensive spells from Siraj and Krishna help Australia reach 350Mohammed Siraj and Prasidh Krishna registered expensive figures during Day 1 of the second unofficial Test as Australia A ended at 350-9 against India A. However, Manav Suthar registered his fifth five-wicket haul in first-class cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-slams-pakistan-shaheen-haris-asia-cup-loss-india-2792099-2025-09-23",
      "headline": "Harbhajan Singh slams Shaheen, Haris after Pakistan's Asia Cup loss to IndiaFormer India spinner Harbhajan Singh has questioned the leadership and performance of Pakistan's senior bowlers, Shaheen Afridi and Haris Rauf, after their Asia Cup defeat to India, where the Indian openers dominated despite heated verbal exchanges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dickie-bird-legendary-cricket-umpire-dies-aged-92-2792063-2025-09-23",
      "headline": "Legendary umpire Dickie Bird, who stood in 1983 World Cup final, dies at 92Legendary umpire Dickie Bird died at the age of 92. His ability to command respect while maintaining warmth and humour made him one of the most popular officials in the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-on-tilak-varma-dominates-shaheen-afridi-india-beats-pakistan-2792054-2025-09-23",
      "headline": "Tilak Varma treated Shaheen Afridi like a net-ball spinner: Sunil GavaskarTilak Varma scored an unbeaten 30* off 19 balls vs Pakistan, smashing two fours and as many sixes in his innings. He smashed Afridi for a six followed by a boundary to finish the match in style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-argentina-friendly-match-kerala-november-australia-opponent-2792051-2025-09-23",
      "headline": "Lionel Messi-led Argentina likely to face Australia in Kerala friendly this NovemberLionel Messi-led Argentina is likely to play a friendly match against Australia in Kerala this November. The visit is expected to boost local football enthusiasm and includes a multi-city tour across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-women-odi-rankings-smriti-mandhana-career-best-ratings-deepti-sharma-5th-2792025-2025-09-23",
      "headline": "Smriti Mandhana achieves career-best ICC ODI ratings, Deepti Sharma jumps to 5thSmriti Mandhana reached a career-best rating of 818 to consolidate her position at the top of the ICC Women's ODI batting rankings, while Deepti Sharma rose to fifth among bowlers after her consistent performances against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-fiery-gesture-asia-cup-2025-india-pakistan-super-4-2792011-2025-09-23",
      "headline": "Asia Cup: Arshdeep Singh's response to Haris Rauf's fighter-jet celebration goes viralIndia's Arshdeep Singh made headlines with a fiery gesture which could likely have come during the game against Pakistan in the Asia Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-women-cricket-team-fined-slow-over-rate-third-odi-loss-australia-2792001-2025-09-23",
      "headline": "India fined for maintaining slow over rate in high-scoring 3rd ODI vs AustraliaThe Indian women's cricket team was fined for a slow over rate in their third ODI against Australia. Despite Smriti Mandhana's record-breaking century, India lost the match and the series 2-1 ahead of the Women's World Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/wayne-rooney-video-games-manchester-united-communication-success-2791977-2025-09-23",
      "headline": "How gaming led to Man United's success under Sir Alex Ferguson? Wayne Rooney revealsWayne Rooney revealed video games on the team bus helped boost Manchester United's communication. This off-field bonding played a surprising role in the club's success under Sir Alex Ferguson."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-bangladesh-phill-simmons-press-conference-can-beat-rivalry-2791997-2025-09-23",
      "headline": "Bangladesh can beat India, won't focus on past results: Coach Phil SimmonsBangladesh head coach Phil Simmons asserts his team's capability to defeat India in the upcoming Asia Cup Super 4 clash. Emphasising the significance of performance on the day, he remains focused on the present challenge."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/video/fc-goa-vs-al-nassr-sandesh-jhingan-talks-cristiano-ronaldo-cafa-nations-bronze-india-2791949-2025-09-23",
      "headline": "Talking FC Goa vs Al Nassr, CAFA Nations bronze with Sandesh JhinganSandesh Jhingan reflects on India's CAFA Nations Cup bronze and gears up for FC Goa's AFC Champions League clash against Cristiano Ronaldo's Al Nassr. For Jhingan, it's about more than spectacle, it's India's chance to prove grit on a global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-named-india-hong-kong-sixes-2025-ashwin-comeback-2791946-2025-09-23",
      "headline": "Dinesh Karthik named India captain for Hong Kong sixesDinesh Karthik will captain India in the Hong Kong Sixes 2025 tournament, scheduled to be played from November 7 to 9 at the Tin Kwong Road Recreation Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/wayne-rooney-video-games-manchester-united-communication-success-2791977-2025-09-23",
      "headline": "How gaming led to Man United's success under Sir Alex Ferguson? Wayne Rooney revealsWayne Rooney revealed video games on the team bus helped boost Manchester United's communication. This off-field bonding played a surprising role in the club's success under Sir Alex Ferguson."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-bangladesh-phill-simmons-press-conference-can-beat-rivalry-2791997-2025-09-23",
      "headline": "Bangladesh can beat India, won't focus on past results: Coach Phil SimmonsBangladesh head coach Phil Simmons asserts his team's capability to defeat India in the upcoming Asia Cup Super 4 clash. Emphasising the significance of performance on the day, he remains focused on the present challenge."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/video/fc-goa-vs-al-nassr-sandesh-jhingan-talks-cristiano-ronaldo-cafa-nations-bronze-india-2791949-2025-09-23",
      "headline": "Talking FC Goa vs Al Nassr, CAFA Nations bronze with Sandesh JhinganSandesh Jhingan reflects on India's CAFA Nations Cup bronze and gears up for FC Goa's AFC Champions League clash against Cristiano Ronaldo's Al Nassr. For Jhingan, it's about more than spectacle, it's India's chance to prove grit on a global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-named-india-hong-kong-sixes-2025-ashwin-comeback-2791946-2025-09-23",
      "headline": "Dinesh Karthik named India captain for Hong Kong sixesDinesh Karthik will captain India in the Hong Kong Sixes 2025 tournament, scheduled to be played from November 7 to 9 at the Tin Kwong Road Recreation Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/grace-harris-ruled-out-womens-world-cup-2025-calf-strain-heather-graham-replaces-2791904-2025-09-23",
      "headline": "Grace Harris ruled out of Women's World Cup 2025 due to calf strainAustralia's World Cup title defence suffers a blow as Grace Harris is ruled out with a calf strain. Heather Graham steps in as replacement amid multiple injury concerns in the squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-goa-vs-al-nassr-cristiano-ronaldo-sandesh-jhingan-exclusive-afc-champions-league-2-2791908-2025-09-23",
      "headline": "Sandesh Jhingan ready for more than spectacle as FC Goa face Cristiano Ronaldo's Al NassrFC Goa's showdown with Cristiano Ronaldo's Al Nassr is more than a football match, it's a chance for Indian football to showcase their worth on a global stage. Sandesh Jhingan stands ready to lead from the front."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ousmane-dembele-ballon-dor-psg-fc-barcelona-disrespect-panache-2791872-2025-09-23",
      "headline": "From ambulance jibes to Ballon d'Or glory: Dembele's chapter from the book of panacheOusmane Dembele's journey from ridicule at Barcelona to Ballon d'Or glory with PSG epitomizes resilience and redemption. Once mocked as injury-prone, he now stands among football's greats, silencing critics with brilliance on Europe's grandest stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-ilt20-big-bash-league-ricky-ponting-auction-2025-2791814-2025-09-23",
      "headline": "Ashwin set for double-role? Spinner likely to play in ILT20, Big Bash League: ReportThe Indian spin-bowling great, Ravichandran Ashwin, is reportedly almost certain to feature in both the ILT20 in the UAE and the Big Bash League in Australia despite the overlapping schedules. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ind-vs-pak-india-outclass-pakistan-dubai-super-4-2791765-2025-09-23",
      "headline": "Asia Cup: Even on rare off-days, India outclass Pakistan, says Sanjay ManjrekarAsia Cup 2025: Former India cricketer, Sanjay Manjrekar, believes that even when India are not at their best, their talent-stacked players somehow find a way to wi,n showcasing the gap in levels with Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shahid-afridi-slams-umpire-fakhar-zaman-dismissal-india-asia-cup-2025-2791740-2025-09-23",
      "headline": "Shahid Afridi slams umpire for Fakhar Zaman dismissal vs India: They need the IPL jobAsia Cup 2025: Former Pakistan captain, Shahid Afridi indicated that the umpires might be biased to favour India after his cheeky comment, reacting to Fakhar Zaman's dismissal in the recent IND vs PAK clash in the Super 4 stages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-clow-courts-favour-carlos-alcaraz-jannik-sinner-grand-slam-finals-laver-cup-2791731-2025-09-23",
      "headline": "Tennis rigged? Roger Federer says courts slowed to favour Alcaraz, SinnerRoger Federer has criticised modern tennis for uniform, slower courts, saying they favour stars like Alcaraz and Sinner. He urges tournament directors to reintroduce surface variety to keep matches unpredictable and exciting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-sri-lanka-asia-cup-super-4-match-abu-dhabi-spin-battle-preview-2791651-2025-09-23",
      "headline": "Pakistan, Sri Lanka desperate for redemption after poor Super 4 startsPakistan and Sri Lanka face a high-stakes Super 4 clash in the Asia Cup on September 23, where a win keeps their campaign alive and a loss could end it. Both teams need to address key issues after losses to India and Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-misses-india-a-vs-australia-a-second-unofficial-test-dhruv-jurel-captain-2791712-2025-09-23",
      "headline": "Shreyas Iyer ruled out of 2nd unofficial Test, Dhruv Jurel to lead India AShreyas Iyer has withdrawn from the second unofficial Test against Australia A in Lucknow. Wicketkeeper Dhruv Jurel will lead India A, stepping into the captaincy after his century in the opening game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-chahar-joins-surrey-county-championship-final-vs-hampshire-washington-sundar-2791704-2025-09-23",
      "headline": "Rahul Chahar joins Surrey for County Championship finale against HampshireIndian spinner Rahul Chahar has joined Surrey for their decisive County Championship clash against Hampshire. His late inclusion bolsters Surrey's depleted spin department as they chase a fourth successive domestic title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ballon-d-or-full-list-of-winners-2791688-2025-09-23",
      "headline": "Ballon d'Or 2025: Full list of winners in ParisOusmane Dembele and Aitana Bonmati were named the best players at the 2025 Ballon d'Or ceremony in Paris. Here are the full list of winners from the ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psgs-ousmane-dembele-ballon-dor-lamine-yamal-2791684-2025-09-23",
      "headline": "PSG's Ousmane Dembele beats Lamine Yamal to win his first Ballon d'Or trophyParis Saint-Germain's Ousmane Dembele lifted his first Ballon d'Or award on Monday, September 22 in Paris. The Champions League winner beat Barcelona's Lamine Yamal to finally deliver on the promise of his legacy."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}