{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/what-education-sector-wants-from-budget-2026-skills-quality-and-jobs-2853181-2026-01-16",
      "headline": "What education sector wants from Budget 2026: Skills, quality and jobsWith India's youth population at the centre of its growth story, the education sector sees Budget 2026 as a chance to invest in better teachers, relevant skills and stronger pathways to jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-technologies-q3-profit-plunges-96-on-one-time-labour-code-charge-2853126-2026-01-16",
      "headline": "Tata Technologies' Q3 profit plunges 96% on one-time labour code chargeThe new labour rules, which came into effect in November, require employee wages to make up at least 50% of the total cost to company. Benefits such as provident fund and gratuity must now be calculated based on wages, raising costs for employers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-and-silver-etfs-at-record-highs-should-you-sell-now-or-buy-more-2853089-2026-01-16",
      "headline": "Gold and silver ETFs at record highs: Should you sell now or buy more?Gold and silver prices have climbed to record highs, pulling their ETFs up sharply as well. With returns looking attractive, investors are now facing a key question, i.e., is this the right time to book profits or stay invested? Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/will-gold-prices-stay-near-record-highs-despite-easing-safe-haven-demand-2853057-2026-01-16",
      "headline": "Will gold prices stay near record highs despite easing safe-haven demand?Gold prices are hovering near record highs even as some safe-haven demand fades, raising questions about whether support from interest rate cut expectations and global uncertainty will be enough to keep prices elevated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-sensex-ends-188-points-higher-nifty-above-25700-infosys-gains-6-percent-2853036-2026-01-16",
      "headline": "Sensex, Nifty end higher driven by IT stocks; Infosys gains 6%The S&P BSE Sensex added 187.74 points to settle at 83,570.35, while the NSE Nifty50 was up 28.75 points to close at 25,694.35​​​​​​​. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-what-indias-middle-class-is-really-asking-for-2852977-2026-01-16",
      "headline": "Budget 2026: What India's middle class is really asking forWith Budget 2026 around the corner, India's middle class is hoping for relief that actually touches daily life, from jobs and inflation to housing and healthcare, so what is it really asking the government to deliver?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/how-market-holidays-affect-india-global-investors-mumbai-bmc-election-nithin-kamath-2852997-2026-01-16",
      "headline": "Are frequent market holidays holding India back as a global investment hub?In a post on X, Kamath said that shutting stock exchanges for a local municipal election shows poor planning, especially at a time when Indian markets have strong international linkages and global investor participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bccl-ipo-listing-date-changed-new-debut-date-january-19-expected-profit-share-price-2852929-2026-01-16",
      "headline": "BCCL IPO listing date changed: Check new debut date, GMP and expected profitBCCL share price: Expectations around listing gains remain strong, as the grey market premium, or GMP, has moved higher. However, the stock's listing has been delayed, pushing the debut to a later date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-a-key-growth-engine-for-the-global-economy-imf-spokesperson-2852926-2026-01-16",
      "headline": "IMF likely to upgrade India's GDP forecast after Q3 growth exceeds expectationsIndia's third-quarter growth turned out to be better than expected. This has increased the chances of an upward revision in the IMF's outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/can-budget-2026-address-tax-talent-and-cost-pressures-in-tourism-and-hospitality-2852871-2026-01-16",
      "headline": "Can Budget 2026 address tax, talent and cost pressures in tourism and hospitality?Industry voices highlight the need for skilling reforms, tax incentives, and policy support to drive growth and innovation in India's tourism and hospitality sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/amagi-media-labs-ipo-should-investors-apply-2852839-2026-01-16",
      "headline": "Amagi Media Labs IPO: Should investors apply?Amagi Media Labs has stepped into the IPO market, drawing attention from investors keen on the fast-growing connected TV and streaming space. With positive brokerage views and steady grey market signals, the key question is whether the issue is worth subscribing to."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-share-price-rises-q3-fy26-results-guidance-upgrade-should-you-buy-2852803-2026-01-16",
      "headline": "Infosys shares rally after Q3 FY26 results: Should you buy now?Infosys stock: The stock opened at Rs 1,670.30, touched an intraday high of Rs 1,683.45 and a low of Rs 1,654.55. The 52-week high of the stock stands at Rs 1,967.75, while the 52-week low is Rs 1,307.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-600-points-today-infosys-q3-fy26-it-stocks-rally-corporate-earnings-nifty-up-tech-mahindra-hcl-2852784-2026-01-16",
      "headline": "Sensex jumps 700 points: Why is the stock market rising todayAt around 10:09 am, the S&P BSE Sensex was up 410.60 points at 83,793.31. The NSE Nifty50 also moved higher and was trading up 99.80 points at 25,765.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-share-price-jumps-q3-fy26-results-revenue-guidance-hike-explainer-2852767-2026-01-16",
      "headline": "Infosys share price jumps 5%: Why is the IT stock rising todayInfosys reported deal wins worth $4.8 billion in the third quarter, a sharp jump from $3.1 billion in the previous quarter. Around 57% of these deals were classified as net new, indicating fresh business additions rather than renewals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-over-150-points-nifty-above-25700-infosys-tech-mahindra-up-2852757-2026-01-16",
      "headline": "Sensex, Nifty rally as IT stocks jump in early trade; Infosys gains 5%The S&P BSE Sensex added 358.23 points to 83,740.94, while the NSE Nifty50 was up 87.55 points to 25,753.25 as of 9:54 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-headcount-falls-it-sector-job-crisis-india-fy26-infosys-ai-automation-upskill-2852752-2026-01-16",
      "headline": "TCS headcount dips sharply: Why is India's IT sector facing a job crisisAt the end of Q3 FY26, Tata Consultancy Services said its total headcount stood at 582,163, down by 11,151 employees from 593,314 at the end of the September quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-why-indian-markets-may-open-higher-infosys-earnings-gift-nifty-2852742-2026-01-16",
      "headline": "Sensex, Nifty today: Stock markets likely to open higher. Here's why?Market participants are now waiting for earnings announcements from other large companies. Results from firms such as Reliance Industries, Wipro, HDFC Bank and ICICI Bank are expected later on Friday and on Saturday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/not-so-strait-hormuz-iran-and-the-global-oil-trade-2852653-2026-01-15",
      "headline": "Not so 'strait': Hormuz, Iran, and the global oil tradeAround 84 per cent of the crude oil and condensate transported through this strait goes to Asian markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-from-mental-health-to-medtech-healthcare-seeks-policy-push-2852556-2026-01-15",
      "headline": "Budget 2026: From mental health to medtech, healthcare seeks policy pushAhead of Union Budget 2026, voices from across the healthcare ecosystem are drawing attention to long-standing gaps. While funding has improved in recent years, experts say sharper policy focus is needed on mental health, medtech and early diagnosis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tiger-global-will-have-to-pay-tax-in-india-on-16-billion-flipkart-stake-sale-to-walmart-supreme-court-2852416-2026-01-15",
      "headline": "Supreme Court rules Tiger Global must pay tax on $1.6 billion Flipkart-Walmart dealThe top court ruled that Tiger Global is not entitled to claim tax exemption under the India–Mauritius treaty. It agreed with the Income Tax Department's view that the structure used for the transaction was aimed at avoiding tax liability in India."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-2-release-date-confirmed-march-19-box-office-clash-toxic-2853198-2026-01-16",
      "headline": "Dhurandhar 2: Check out what Aditya Dhar said about film's release date Director Aditya Dhar has confirmed that 'Dhurandhar 2' will be released on March 19 as scheduled, dismissing rumours regarding a postponement. The film, starring Ranveer Singh, is set to compete with Yash's 'Toxic: A Fairytale For Grown-Ups' at the box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-saba-azad-mediterranean-dining-barcelona-sas-birthday-2853166-2026-01-16",
      "headline": "Hrithik–Saba's new 'Ro & Sa' series dives into their Barcelona food trail Hrithik Roshan and Saba Azad continue to share moments from their travels, recently spotlighting a memorable dining experience in Spain. The couple's culinary adventures, shared as part of their 'Ro & Sa Recommend' series, have engaged their followers as they document their relationship and journeys."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-rahman-on-ramayana-music-hans-zimmer-is-jewish-i-am-muslim-story-is-hindu-2853163-2026-01-16",
      "headline": "AR Rahman on Ramayana music: Hans Zimmer is Jewish, I am Muslim, story is Hindu AR Rahman spoke about his admiration for 'Ramayana' and 'Mahabharata' since they were part of his education while growing up. He praised the values and ideas of the Indian epics that focus on \"higher ideals.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-spirit-set-for-march-2027-release-confirms-sandeep-reddy-vanga-2853180-2026-01-16",
      "headline": "Prabhas' Spirit set for March 2027 release, confirms Sandeep Reddy Vanga Director Sandeep Reddy Vanga has officially confirmed the theatrical release date of Spirit, starring Prabhas, with the film now locked for a March 2027 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-rahman-calls-chhaava-divisive-thinks-core-of-the-film-is-to-show-bravery-2853164-2026-01-16",
      "headline": "AR Rahman calls Chhaava divisive, thinks core of the film is to show bravery AR Rahman spoke about working in an increasingly divided film industry. During an interview, he highlighted the importance of choosing projects thoughtfully and curating music for Chhaava, a film that he called \"divisive.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-41st-birthday-intimate-celebration-kiara-advani-2853090-2026-01-16",
      "headline": "On Sidharth Malhotra's birthday, Kiara sings for daughter Saraayah's favourite human Actor Sidharth Malhotra marked his 41st birthday on January 16 with a private midnight gathering attended by close friends and family. Kiara Advani posted a heartfelt message and shared moments from the celebration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hum-to-tere-hi-liye-the-shahid-triptii-capture-aching-love-in-o-romeo-new-song-2853084-2026-01-16",
      "headline": "Hum To Tere Hi Liye The: Shahid, Triptii capture aching love in O'Romeo new song The romantic song 'Hum To Tere Hi Liye The' from Vishal Bhardwaj's 'O'Romeo' has been released. The song depicts the unrequited romance between Shahid Kapoor and Triptii Dimri's characters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/his-hers-netflix-brings-its-most-clever-whodunit-in-recent-years-best-crime-thriller-show-2026-2853095-2026-01-16",
      "headline": "His & Hers: Netflix brings its most clever whodunit in recent years Netflix's His & Hers reinvents the modern whodunit by placing its protagonists at the centre of suspicion. Smartly written and morally ambiguous, the series keeps questioning your instincts until its devastating final reveal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-rip-review-matt-damon-ben-affleck-bring-back-old-school-hollywood-action-2853088-2026-01-16",
      "headline": "The Rip review: Matt Damon, Ben Affleck bring back old-school Hollywood actionRelease Date:Fri Jan 16, 2026 The Rip is a fast, old-school action thriller with great Matt Damon–Ben Affleck chemistry. Set in Miami, it mixes flashy action with a familiar crime plot, making it an easy, late-night watch that Indian audiences will enjoy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/border-2-trailer-release-trends-online-karan-johar-praises-cast-performances-2853038-2026-01-16",
      "headline": "KJo, Kartik Aaryan's shout-out to Border 2 trailer, call it emotional and patriotic Karan Johar praised Sunny Deol's 'Border 2' trailer and commented on the quality of performances in the film. The film is slated to release in theatres on January 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-sethupathi-slum-dog-33-temple-road-1st-look-packs-a-gritty-punch-2853041-2026-01-16",
      "headline": "Vijay Sethupathi's Slum Dog 33 Temple Road 1st look packs a gritty punch Makers revealed the first-look poster and title of Slum Dog 33 Temple Road, starring Vijay Sethupathi and Samyuktha, as the film wraps up shooting and moves to post-production ahead of a multi-language release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-mahendran-slams-jana-nayagan-row-stalling-vijay-film-against-free-speech-2853014-2026-01-16",
      "headline": "Actor Mahendran slams Jana Nayagan row: Stalling Vijay's film against free speech Tamil Actor Mahendran criticised the move to stall the release of 'Jana Nayagan'. He said that the move is against India's strong tradition of freedom of speech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/which-language-is-oldest-javed-akhtar-shuts-down-urdu-vs-sanskrit-argument-2853043-2026-01-16",
      "headline": "Which language is oldest? Javed Akhtar shuts down Urdu vs Sanskrit argument Javed Akhtar shared insights on language, family, and evolving trends in the film industry during a recent session. The popular poet-lyricist schooled a man asking him to choose between Sanskrit and Urdu as the oldest language."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/gandhi-talks-teaser-vijay-sethupathi-arvind-swami-aditi-rao-hydari-promise-gripping-silent-film-2853031-2026-01-16",
      "headline": "Gandhi Talks teaser: Vijay Sethupathi, Arvind Swami promise a gripping silent film The teaser of Vijay Sethupathi, Arvind Swamy, and Aditi Rao Hydari's upcoming film 'Gandhi Talks' is out. The silent film is slated to release in theatres on January 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-joins-2016-nostalgia-club-with-throwbacks-featuring-abram-suhana-2853002-2026-01-16",
      "headline": "Ananya Panday joins 2016 nostalgia club with throwbacks featuring AbRam, Suhana Ananya Panday joins the '2026 is the new 2016' trend, sharing a series of throwback photos on Instagram that reflect her childhood memories and close friendships, sparking reactions from friends and fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tu-yaa-main-song-fame-us-shanaya-kapoor-adarsh-gourav-groove-to-mumbai-vibe-2852976-2026-01-16",
      "headline": "Tu Yaa Main song Fame Us: Shanaya Kapoor, Adarsh Gourav groove to Mumbai's vibe The party song 'Fame Us' from 'Tu Yaa Main' has been released. The music video features the lead actors Shanaya Kapoor and Adarsh Gourav."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/28-years-later-bone-temple-review-ralph-fiennes-humanises-horror-in-violent-sequel-2852876-2026-01-16",
      "headline": "28 Years Later Bone Temple review: Ralph Fiennes humanises horror in violent sequelRelease Date:Fri Jan 16, 2026 Nia DaCosta's direction breathes fresh energy into the franchise as the focus shifts from zombies to intense human conflict, with Ralph Fiennes, Jack O'Connell, and Alfie Williams at their best. The movie released globally on January 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ek-din-teaser-junaid-khan-sai-pallavi-promise-to-bring-back-old-school-romance-2852864-2026-01-16",
      "headline": "Ek Din teaser: Junaid Khan, Sai Pallavi promise to bring back old-school romance The teaser of Junaid Khan and Sai Pallavi's romantic-drama, 'Ek Din', was unveiled on January 16, 2026. The film is set for a theatrical release on May 1, 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-reignites-debate-over-hindi-vs-marathi-at-bmc-polls-yeh-maharashtra-hai-2852887-2026-01-16",
      "headline": "Aamir Khan reignites debate over Hindi vs Marathi at BMC polls: Yeh Maharashtra hai Actor Aamir Khan reignited the language debate on being asked to repeat his message in Hindi. The Internet has been divided over the remarks he made after casting his vote at the Brihanmumbai Municipal Corporation (BMC) elections."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/mumbai-to-get-bjp-sena-mayor-as-alliance-sweeps-civic-polls-fort-thackeray-falls-after-30-years-2853008-2026-01-16",
      "headline": "Mahayuti seizes Mumbai crown, Fort Thackeray falls after 28 years Live UpdatesBMC Election Results: After the BJP's historic performance in the Mumbai civic body, Chief Minister Devendra Fadnavis has emerged as the man of the moment. Under his leadership, the BJP has surpassed its previous high of 82 seats in 2017, winning or leading in 88 of the 227 wards in the BMC so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/municipal-corporation/story/devendra-fadnavis-maharashtra-bmc-mumbai-corporation-election-results-2853079-2026-01-16",
      "headline": "'Dhurandhar' Fadnavis is Hero No. 1 in BJP's Friday Maharashtra blockbusterThe wily Devendra Fadnavis has delivered a Friday blockbuster for the BJP, steering the party towards a near sweep in the civic polls as well as in the BMC, marking the end of the Thackeray family's nearly three-decade dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/municipal-corporation/story/maharashtra-civic-polls-mumbai-bmc-bjp-devendra-fadnavis-eknath-shinde-sena-uddhav-thackeray-pawars-result-2026-2853147-2026-01-16",
      "headline": "Mumbai goes BJP's way, Thackeray reunion fails to stop Mahayuti's Maha sweepIn Maharashtra, the BJP emerged as the single largest party statewide, winning or leading in 1,267 seats, far ahead of its rivals. The Eknath Shinde-led Shiv Sena secured 330 seats, strengthening the Mahayuti's overall dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/maharashtra-has-given-blessings-to-ndas-pro-people-good-governance-agenda-pm-on-mahayutis-civic-poll-win-2853197-2026-01-16",
      "headline": "Maharashtra blessed NDA's good governance: PM hails Mahayuti's civic poll winPrime Minister Narendra Modi congratulated the BJP-led Mahayuti alliance over the massive civic poll success in Maharshtra"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/municipal-corporation/story/bjp-shinde-sena-maharashtra-civic-polls-sweep-thackerays-reunion-ineffective-rajdeep-sardesai-key-takeaways-2853066-2026-01-16",
      "headline": "12 Rajdeep Sardesai takeaways from Mahayuti's big show in civic pollsHeld after a nine-year gap amid fractured alliances and an intense contest over Marathi identity, the Maharashtra civic polls result demonstrated a clear shift in voter preferences. Here are key takeaways from BJP-Shinde Sena sweep of the civic polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/municipal-corporation/story/maharashtra-local-body-poll-result-ncp-sharad-pawar-ajit-pawar-bjp-dominance-pimpri-chinchwad-pune-bmc-2853206-2026-01-16",
      "headline": "Massive Pawar outage across Maharashtra citiesA rare reunion of Sharad Pawar and Ajit Pawar, meant to salvage a splintered NCP, failed in the local body elections in Maharashtra. From Pimpri-Chinchwad to Pune and Mumbai, the BJP steamrolled Pawar bastions. Cities like Pimpri-Chinchwad and Pune, once seen as impregnable NCP strongholds, were won by the BJP."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/edappadi-k-palaniswami-aiadmk-tamil-nadu-polls-bjp-alliance-slams-dmk-mk-stalin-2853199-2026-01-16",
      "headline": "Stalin govt worst in India: EPS says AIADMK-BJP will win 210 seats in Tamil NaduIn an interview with India Today TV, Edappadi K Palaniswami said the AIADMK-BJP alliance would \"win about 210 seats\" in the upcoming Tamil Nadu polls, asserting that people were \"very upset\" with the ruling dispensation and determined to remove it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-iran-news-iranian-regime-is-harsh-at-home-but-it-refuses-to-kneel-american-antics-donald-trump-ayatollah-khamenei-israel-2853004-2026-01-16",
      "headline": "Why the US can batter Iran, but can't bend itThe US has tried it all against Iran, a Shia Muslim country it accuses of trying to get a nuclear bomb. It has crippled its economy with sanctions, struck its nuclear sites and backed its rivals, but Tehran stands defiant. Even a full-blown military strike, what President Trump threatened the Khamenei regime with, won't make Iranians bow down. Here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/instant-delivery-apps-10-minutes-makar-sankranti-maggi-noodles-quick-commerce-industry-india-2852563-2026-01-16",
      "headline": "Living in a post-Blinkit India: What's the hurry? Slow it downIndia is done with the \"instant\" insanity. Blinkit and Zomato cannot Swiggy by in 10 minutes any longer. Even if they do, they cannot make a virtue out of it. India is not known for doing pretty much anything fast. But now that the government has spoken, we must learn to fill time into a handful of \"instant\" activities we developed the dangerous habit for."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/anti-pollution-restrictions-under-grap-stage-3-reimposed-in-delhi-ncr-as-pollution-levels-soar-2853139-2026-01-16",
      "headline": "GRAP-III restrictions reimposed in Delhi-NCR as pollution levels soarThe decision was taken as Delhi's air quality deteriorated further, with the Air Quality Index, AQI, crossing the 350 mark and entering the 'severe' category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-badminton-world-championships-bai-secretary-2853113-2026-01-16",
      "headline": "World Champs will be a festival, doubters will regret it: Badminton India secyBadminton Association of India general secretary Sanjay Mishra dismissed the intense scrutiny surrounding the India Open, reiterating that the tournament is being staged as a test event for the World Championships, set to return to India after a 16-year gap. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-gg-live-score-wpl-2026-royal-challengers-bengaluru-vs-gujarat-giants-match-2853182-2026-01-16",
      "headline": "RCB vs GGW Live Score: Bengaluru in trouble as Smriti Mandhana departsRoyal Challengers Bengaluru (RCB) vs Gujarat Giants Women (GGW), WPL 2026 Live Score: Gujarat have won the toss and opted to bowl first in Navi Mumbai. Shivani Singh is making her WPL debut for the Giants, replacing Ayushi Soni, while RCB are unchanged from their win over the Warriorz. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/darbhanga-dynasty-and-its-last-queen-a-tale-of-wealth-mystery-and-decline-2853047-2026-01-16",
      "headline": "Darbhanga dynasty and its last queen: A tale of wealth, mystery, and declineThe Darbhanga Raj's opulent legacy ended with Maharani Kamsundari Devi's recent death at 96, closing a chapter of wealth, intrigue, and quiet tragedy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/cm-fadnavis-dials-state-bjp-chief-after-big-mahayuti-win-in-bmc-polls-to-address-party-workers-shortly-2853025-2026-01-16",
      "headline": "This BMC win tastes different, Devendra Fadnavis tells Maharashtra BJP chiefMaharashtra Chief Minister Devendra Fadnavis spoke with the state BJP chief following the party's massive win Maharashtra. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/which-language-is-oldest-javed-akhtar-shuts-down-urdu-vs-sanskrit-argument-2853043-2026-01-16",
      "headline": "Which language is oldest? Javed Akhtar shuts down Urdu vs Sanskrit argumentJaved Akhtar shared insights on language, family, and evolving trends in the film industry during a recent session. The popular poet-lyricist schooled a man asking him to choose between Sanskrit and Urdu as the oldest language."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indian-medicines-replacing-pakistani-drugs-in-afghanistan-pakistan-pharmaceuticals-banned-islamabad-kabul-clashes-2852022-2026-01-16",
      "headline": "Replacing medicines, India giving Pak a bitter pill to swallow in AfghanistanAn Afghan vlogger has claimed that Indian medicines that are cheaper and work better are fast-replacing Pakistani drugs. India has sent tonnes of medical assistance to Afghanistan even as the Taliban-led regime's ties with Pakistan hit rock bottom. Earlier, Pakistan-made drugs accounted for 70% of all medicines in the Afghan market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/iran-protest-ayatollah-khamenei-human-rights-abuse-killings-persia-cyrus-the-great-cylinder-shah-pahlavi-2852810-2026-01-16",
      "headline": "How the pre-Islamic Cyrus Cylinder shames rulers of modern-day IranIran's Ayatollah Ali Khamenei's regime is facing scrutiny for widespread human rights violations amid weeks-long protests. Thousands have been killed and tens of thousands have been jailed. But it is the same land that gave the world the first charter of human rights around 2,500 years ago. Here's all about the conqueror, Cyrus the Great, who freed slaves, and his Cyrus Cylinder."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/woman-alleges-child-walked-into-their-hyatt-jaipur-room-found-staff-inside-hotel-responds-2852855-2026-01-16",
      "headline": "Woman alleges child walked into their Hyatt room, found staff inside; hotel respondsA woman claimed that two hotel staff members entered their room using a master key, despite the room having already been cleaned earlier in the day and no housekeeping or service request having been made. She said her six-year-old niece walked into the room moments later and found two unknown adults inside. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/municipal-corporation/story/maharashtra-thane-municipal-election-result-triple-win-mhatre-family-2852925-2026-01-16",
      "headline": "One family, three parties: Rare triple win in Maharashtra civic pollsThane TMC municipal corporation: In the Thane municipal corporation elections, the Mhatre family has scripted a unique electoral feat, winning three wards by contesting on tickets of three rival parties."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/why-pakistan-sending-drones-into-india-jammu-kashmir-sindoor-2852869-2026-01-16",
      "headline": "Why Pakistan is once again sending drones into IndiaThe UAVs being sent by Pakistan are not the suicide drones that were deployed during the hostilities in May last year. These are mostly small, reconnaissance-oriented drones flying at very low altitudes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/rahu-ketu-movie-review-a-mythological-misfire-that-forgets-its-own-story-starring-pulkit-sharma-varun-sharma-2852975-2026-01-16",
      "headline": "Rahu Ketu review: A mythological misfire that forgets its own storyRelease Date:Fri Jan 16, 2026Rahu Ketu movie review: The Pulkit Samrat and Varun Sharma starrer struggles to justify its ambitious mythological premise, collapsing under weak writing, confused mythology and a narrative that goes nowhere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/priya-kapur-moves-supreme-court-to-access-karisma-sanjay-divorce-settlement-details-2852699-2026-01-16",
      "headline": "Supreme Court notice to Karisma Kapoor over Priya Kapur's plea for divorce recordsPriya Kapur has sought access to the said divorce records to ascertain the financial and child custody arrangements made by her late former husband."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-rahman-calls-chhaava-divisive-thinks-core-of-the-film-is-to-show-bravery-2853164-2026-01-16",
      "headline": "AR Rahman calls Chhaava divisive, thinks core of the film is to show braveryAR Rahman spoke about working in an increasingly divided film industry. During an interview, he highlighted the importance of choosing projects thoughtfully and curating music for Chhaava, a film that he called \"divisive.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/thane-tmc-results-live-updates-shinde-sena-bjp-shiv-sena-ubt-thackerays-ncp-sharad-pawar-ajit-pawar-2852872-2026-01-16",
      "headline": "Thane TMC results: Shinde Sena leads in stronghold, Thackerays struggleBesides the Thane Municipal Corporation (TMC) of Thane, the counting of votes is also underway for 28 other urban civic bodies across Maharashtra, including the high-stakes Brihanmumbai Municipal Corporation (BMC) of Mumbai."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-babar-azam-sydney-sixers-win-bbl-2853200-2026-01-16",
      "headline": "Babar Azam wasn't too happy: Steve Smith on turning down single in BBL clash BBL 2025-26: Steve Smith said a tactical decision to turn down a single briefly caused tension with Babar Azam during the Sixers–Thunder clash as he opted to keep the strike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpools-arne-slot-happy-to-welcome-mohamed-salah-back-from-afcon-2853186-2026-01-16",
      "headline": "Liverpool's Slot happy to welcome Salah back from AFCON despite earlier rift Liverpool coach Arne Slot said he was delighted to welcome Mohamed Salah back from Africa Cup of Nations duty, playing down reports of a rift between them just weeks ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-gg-live-score-wpl-2026-royal-challengers-bengaluru-vs-gujarat-giants-match-2853182-2026-01-16",
      "headline": "RCB vs GGW Live Score: Kashvee Gautam removes Grace Harris after blazing start Royal Challengers Bengaluru (RCB) vs Gujarat Giants Women (GGW), WPL 2026 Live Score: Gujarat have won the toss and opted to bowl first in Navi Mumbai. Shivani Singh is making her WPL debut for the Giants, replacing Ayushi Soni, while RCB are unchanged from their win over the Warriorz. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-badminton-delhi-pollution-mia-blichfeldt-2853143-2026-01-16",
      "headline": "Hard to see how Delhi can host World Champs: Shuttler doubles down on criticism India Open: Danish shuttler Mia Blichfeldt has once again criticised the India Open Super 750 competition. In yet another scathing comment, the shuttler said that she was unsure whether Delhi had the ability to host the World Championships later this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-badminton-world-championships-bai-secretary-2853113-2026-01-16",
      "headline": "India Open critics will regret doubts: Badminton India secretary Badminton Association of India general secretary Sanjay Mishra dismissed the intense scrutiny surrounding the India Open, reiterating that the tournament is being staged as a test event for the World Championships, set to return to India after a 16-year gap. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-bbl-century-41-balls-sydney-derby-fastest-sixers-record-2853086-2026-01-16",
      "headline": "Steve Smith goes berserk in BBL, smashes 107-metre six, joint second-fastest century Steve Smith smashed a sensational 41-ball century, including a 107-metre six, in the Sydney Derby against the Thunder, recording the fastest BBL century for the Sydney Sixers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-ryan-ten-doeschate-nitish-reddy-odi-2853074-2026-01-16",
      "headline": "Play him first: Nitish Reddy finds support after merciless ten Doeschate attack IND vs NZ: India assistant coach Ryan ten Doeschate slammed all-rounder Nitish Reddy after the team's 2nd ODI loss against New Zealand. However, many, including a former India player, found ten Doeschate's criticism bizarre and slammed the assistant coach for his words."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/manoj-tiwary-kolkata-safe-venue-bangladesh-t20-world-cup-2853075-2026-01-16",
      "headline": "Kolkata is safe for Bangladesh cricketers, Sheikh Hasina stayed here: Manoj Tiwary Manoj Tiwary said Kolkata is safe to host Bangladesh's T20 World Cup matches, stressing that security concerns are unfounded and politics will not interfere with sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/vishwanathan-anand-lightning-kid-childhood-chess-lessons-for-players-2853071-2026-01-16",
      "headline": "Some bad moves end the game, some teach you: Vishwanathan Anand on life and chess At the Jaipur Lit Fest 2026, Vishwanathan Anand spoke about his new book Lightning Kid, sharing stories of childhood, rapid chess, and lessons learned along the way. From family support to handling mistakes, resilience, and modern youth talent, Anand's insights inspire young players to explore the joy of chess while navigating life's challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-removal-odi-captain-manoj-tiwary-disappointment-india-leadership-changes-2852941-2026-01-16",
      "headline": "Jay Shah should have stopped Rohit Sharma's removal as ODI captain: Manoj Tiwary Former India cricketer Manoj Tiwary has raised concerns over the decision to replace Rohit Sharma with Shubman Gill as India's ODI captain. The former Bengal cricketer said Jay Shah should have intervened and stopped the removal of Rohit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-support-ashwin-game-time-gautam-gambhir-indian-cricket-2853005-2026-01-16",
      "headline": "Give Arshdeep Singh the place he deserves, let him walk with head held high: Ashwin Ravichandran Ashwin has expressed his concerns about Arshdeep Singh's exclusion from the first two ODIs, raising questions over team selection policies and the impact on bowler confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-ai-cameras-crowd-management-chinnaswamy-stadium-ipl-2026-2853003-2026-01-16",
      "headline": "IPL: RCB proposes AI cameras for crowd control amid talks of exiting BengaluruThe Royal Challengers Bengaluru has proposed installing 300 to 350 AI-enabled cameras at the Chinnaswamy Stadium to enhance crowd safety ahead of IPL 2026. This move follows last year's tragic stampede and aims to reassure stakeholders about safer matchday operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-sophie-devine-gujarat-giants-review-boundary-sizes-womens-cricket-2852987-2026-01-16",
      "headline": "Sophie Devine urges review of fielding rules and boundary lengths in women's cricketNew Zealand captain Sophie Devine has called for major changes to fielding restrictions and boundary dimensions in women's cricket, stating current regulations unduly favour batters and hinder bowlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/gukesh-vs-praggnanandhaa-india-host-chess-world-championship-final-2026-2852972-2026-01-16",
      "headline": "Gukesh vs Pragg? India may host Chess World Championship if all-Indian clashAn all-Indian World Chess Championship between D Gukesh and R Praggnanandhaa could bring the showpiece back to India, with Viswanathan Anand saying the clash would be emotionally charged and possibly held in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/england-world-cup-2026-thomas-tuchel-players-talent-social-skills-2852870-2026-01-16",
      "headline": "England's World Cup squad must have balance of talent and social skills: TuchelThomas Tuchel has stressed that raw talent alone will not be enough to earn a place in England's World Cup squad, insisting players must also possess the right \"social skills\" and personality if the team is to have any chance of lifting the trophy this summer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-odis-easy-format-harbhajan-singh-sanjay-manjrekar-wild-claim-2852880-2026-01-16",
      "headline": "Does Kohli play ODIs because it's easy? Harbhajan responds to Manjrekar's wild claimHarbhajan Singh defended Virat Kohli after Sanjay Manjrekar called ODIs the \"easiest\" format, saying greatness isn't about formats and that Kohli remains a match-winner for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-delegation-visit-bangladesh-t20-world-cup-participation-venue-dispute-2852873-2026-01-16",
      "headline": "ICC delegation likely to visit Bangladesh for T20 World Cup talksA delegation from the International Cricket Council (ICC) is expected to visit Bangladesh soon for in-person discussions regarding the country's participation in the ICC Men's T20 World Cup, scheduled to be hosted by India and Sri Lanka from February 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/henil-patel-five-wicket-haul-leads-india-to-six-wicket-victory-over-usa-in-u19-world-cup-2852842-2026-01-16",
      "headline": "Who is Henil Patel? Dale Steyn fan is India's 5-star hero in World Cup openerU19 World Cup 2026: 18-year-old Henil Patel made a mark on the opening day of the tournament, picking up a five-wicket haul. The fast bowler from Gujarat idolises Dale Steyn. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-harleen-deol-retired-out-drama-coaching-communication-gap-abhishek-nayar-2852822-2026-01-16",
      "headline": "Harleen Deol retired-out saga revealed communication gap in coaching: Abhishek NayarUP Warriorz coach Abhishek Nayar said the Harleen Deol retired-out episode exposed a communication gap, admitting that coaching in the WPL has been more hands-on and challenging than expected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-roger-federer-vs-casper-ruud-warmup-tiebreak-video-2852811-2026-01-16",
      "headline": "Roger Federer returns to Australian Open, beats World No. 12 in tie-breaker: WatchRoger Federer made a highly anticipated return to Melbourne Park with a spirited practice session against Casper Ruud. The 20-time Grand Slam champion will compete in an exhibition match on Saturday, a day before the main draw of the Australian Open gets underway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-match-today-gujarat-giants-royal-challengers-bengaluru-navi-mumbai-preview-2852813-2026-01-16",
      "headline": "Royal Challengers Bengaluru look to stay perfect against Gujarat GiantsWPL 2026: Royal Challengers Bengaluru face Gujarat Giants in a key WPL 2026 clash, with RCB eyeing a third straight win as Gujarat look to fix bowling issues at DY Patil Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-u19-world-cup-detrimental-bcci-big-picture-prodigy-india-2852756-2026-01-16",
      "headline": "Vaibhav Suryavanshi's U19 run could hurt him: Ex-India cricketer makes bold statementFormer India cricketer WV Raman has sparked debate by questioning whether Under-19 cricket is the right pathway for teenage prodigy Vaibhav Suryavanshi despite his rapid rise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-open-badminton-controversy-delhi-olympics-hopes-hosting-ready-2852751-2026-01-16",
      "headline": "India wants the Olympics, but is it truly ready to host the world?The India Open exposed more than polluted air. It revealed recurring failures in how India plans, manages and acknowledges hosting shortcomings, failures the country must confront before its Olympic ambitions can be taken seriously.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-aryna-sabalenka-heal-old-wounds-final-heartbreak-melbourne-park-2852720-2026-01-16",
      "headline": "One year on, Aryna Sabalenka seeks to heal old wounds at the Australian OpenAustralian Open 2026: Aryna Sabalenka suffered a shock defeat to Madison Keys in last year's Australian Open final, and the world No. 1 will be eager to reassert her dominance when this year's hard-court showpiece unfolds in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-harleen-deol-up-warriorz-bounces-back-retire-worst-nightmare-2852734-2026-01-16",
      "headline": "Harleen Deol makes her bat do the talking, bounces back from batter's worst nightmareHarleen Deol bounced back from the setback of being retired out by producing a commanding 64 against Mumbai Indians, letting her bat do the talking and reaffirming her value to UP Warriorz."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricketers-boycott-nazmul-islam-public-apology-report-2852724-2026-01-16",
      "headline": "Bangladesh cricketers to end boycott if ex-director issues public apology: ReportBangladesh's cricketers have made a public apology from former BCB chairman Nazmul Islam a key condition for ending their boycott, with domestic competitions remaining affected as talks with the board continue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-ravindra-jadeja-odi-career-axar-patel-waiting-2852717-2026-01-16",
      "headline": "Clock's ticking on Ravindra Jadeja's ODI career as Axar Patel waits on the sidelinesIND vs NZ: India's loss in the 2nd ODI has intensified scrutiny on Ravindra Jadeja, whose recent struggles with both bat and ball have raised concerns about his place in the side. With Axar Patel's rapid rise, Jadeja's days in the ODI setup look numbered as the all-rounder is in a race against time to prove his worth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harleen-deol-up-warriorz-retire-out-mumbai-indians-wpl-2026-2852689-2026-01-15",
      "headline": "Harleen Deol reacts to retire out saga after heroics vs Mumbai IndiansWPL 2026: 24 hours after being retired out against Delhi Capitals, Harleen Deol starred with an unbeaten 64 as UP Warriorz secured their first win, defeating Mumbai Indians by seven wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vidarbha-beats-karnataka-vijay-hazare-trophy-semi-final-aman-mokhade-138-2852684-2026-01-15",
      "headline": "Vidharbha storm in Vijay Hazare Trophy final, knock defending champion Karnataka outVidarbha outplayed defending champions Karnataka with a dominant all-round display, clinching a six-wicket win to book their place in the Vijay Hazare Trophy final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harleen-deol-up-warriorz-mumbai-indians-nat-sciver-brunt-report-2852655-2026-01-15",
      "headline": "Retire out to heroics: Harleen Deol seals UP Warriorz maiden win of WPL 2026WPL 2026, MI vs UPW: Harleen Deol scored an unbeaten 64 as the UP Warriorz opened their account with a seven-wicket win over Mumbai Indians on Thursday in Navi Mumbai. \r\n\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}