{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-touches-new-lifetime-high-of-rs-113-lakh-per-10-grams-in-delhi-2785898-2025-09-11",
      "headline": "Gold touches new lifetime high of Rs 1.13 lakh per 10 grams in DelhiGold prices surged to a new lifetime high of Rs 1,13,100 per 10 grams in Delhi on Thursday. The yellow metal has gained over 43% this year. Experts attribute the surge to central bank buying, exchange-traded funds inflows, and geopolitical tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zupee-lays-off-30-percent-of-staff-as-it-adapts-to-india-online-gaming-act-2785826-2025-09-11",
      "headline": "Zupee lays off 30% of staff as it adapts to India's Online Gaming ActZupee has rolled out a comprehensive relief package for employees affected by the layoffs. The support plan includes financial assistance beyond the standard notice period, with extra compensation based on years of service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/will-diwali-light-up-dalal-street-for-investors-2785768-2025-09-11",
      "headline": "Will Diwali light up Dalal Street for investors?While the festival is often seen as a time for good fortune, experts say the stock market doesn't necessarily follow festive trends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-slides-to-all-time-low-as-us-tariffs-bite-2785745-2025-09-11",
      "headline": "Rupee slides to all-time low as US tariffs biteThe Indian rupee hit a record low of 88.44 against the US dollar on Thursday, pressured by US tariffs and heavy foreign investor outflows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-nifty50-longest-winning-streak-us-india-trade-optimism-oil-gas-gains-2785730-2025-09-11",
      "headline": "Sensex, Nifty extend gains amid optimism over US-India trade dealThe NSE Nifty50 rose by 32.40 points to close at 25,005.5, while the BSE Sensex increased by 123.58 points, settling at 81,548.73."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ups-to-nps-switch-now-allowed-but-rules-apply-unified-pension-scheme-national-pension-scheme-2785701-2025-09-11",
      "headline": "UPS to NPS switch now allowed, but rules applyCentral government employees who opted for the UPS can now switch back to the NPS, the government has announced. However, this flexibility comes with specific rules and conditions that employees must follow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/phone-buying-loan-rbi-new-lone-mobile-lock-small-lenders-bajaj-finance-emi-2785683-2025-09-11",
      "headline": "Buying a phone on loan? Non-payment may lock your deviceCurrently, over one-third of consumer electronics, including mobile phones, are purchased on small-ticket loans in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/should-you-pay-income-tax-with-credit-card-all-you-need-to-know-2785649-2025-09-11",
      "headline": "Should you pay income tax with credit card? All you need to knowAs the tax filing deadline approaches, many taxpayers scramble to pay their dues. While net banking and UPI are common, using a credit card is also an option, but it comes with costs and benefits you should know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-even-small-income-slips-can-trigger-big-tax-notices-explains-tax-advisor-2785585-2025-09-11",
      "headline": "Why even small income slips can trigger big tax notices, explains tax advisorThink a small slip in your tax return won't matter? Think again. Even missing Rs 5,000 bank interest has invited income tax notices. A tax advisor breaks down why AIS mismatches are a growing headache."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pf-in-limbo-why-so-many-employees-struggle-to-access-their-savings-2785558-2025-09-11",
      "headline": "PF crisis: What makes withdrawing your own money so difficultFor decades, the Provident Fund has been seen as a loyal companion, quietly growing with every paycheque, waiting to support employees in tough times or after retirement. But when the time comes to withdraw it, many workers discover that accessing their savings is anything but simple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/looking-to-invest-in-it-stocks-here-are-the-top-picks-2785577-2025-09-11",
      "headline": "Looking to invest in IT stocks? Here are the top picksDespite recent concerns around tariffs announced by US President Donald Trump in April, experts remain positive on the IT sector's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-rejection-star-health-medical-emergency-claim-denied-series-2785009-2025-09-11",
      "headline": "Denied in crisis: Inside a family's year-long battle to claim health insuranceFor Vipin Vishnu Ajayan and his family, the year-long fight for his father's treatment was more than paperwork. It meant sleepless nights, borrowed money, and unanswered calls. What should have been a safety net in a medical crisis turned into a draining battle that tested their strength, faith and dignity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-usd-1-trillion-pay-tesla-targets-to-achieve-top-ceo-salary-world-economy-gdp-2785528-2025-09-11",
      "headline": "Elon Musk's $1 trillion salary vs the worldElon Musk's proposed $1 trillion compensation package from Tesla is drawing attention not only for its sheer size but also for the ambitious targets the world's richest person needs to fulfil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-net-worth-world-richest-larry-elisson-oracle-open-ai-partnership-2785501-2025-09-11",
      "headline": "World's richest race: Elon Musk reclaims No.1 spot from Larry EllisonElon Musk has largely remained at the top of the global wealth chart since first claiming the position in 2021. Though he was overtaken briefly by LVMH's Bernard Arnault in 2021 and by Amazon founder Jeff Bezos in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-narendra-modi-india-us-trade-tariff-trouble-avoid-masala-deal-2785495-2025-09-11",
      "headline": "Donald Trump's hot-and-cold tariff game: Why India must avoid a 'MASALA' dealDonald Trump is giving India mixed signals on trade and tariffs, hot one moment and cold the next. The risk? Falling for MASALA deals. Read to know what they are, and why India must resist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-flat-nifty-above-24950-eternal-adani-ports-among-top-gainers-2785464-2025-09-11",
      "headline": "Sensex, Nifty gain after flat opening amid US rate cut optimismThe S&P BSE Sensex gained over 100 points after a flat start, while the NSE Nifty50 briefly crossed the 25,000 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-dev-accelerator-shringar-house-of-mangalsutra-ipo-subscription-profit-gmp-today-2785445-2025-09-11",
      "headline": "3 IPOs in focus: Urban Company leads, but where's the bigger listing gain?Urban Company's was fully subscribed within a few hours, indicating high demand. Alongside Urban Company, two other IPOs, Dev Accelerator and Shringar House of Mangalsutra, are also open for bidding this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oracle-larry-ellison-surpasses-elon-musk-to-become-worlds-richest-person-2785281-2025-09-10",
      "headline": "Oracle's Larry Ellison surpasses Elon Musk to become world's richest personEllison's net worth jumped by an unprecedented $101 billion in a single day after Oracle Corp. delivered blowout quarterly results, sparking a record surge in its stock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-20s-to-retirement-how-bonds-strengthen-your-finances-2785155-2025-09-10",
      "headline": "From 20s to retirement: How bonds strengthen your financesBonds don't grab headlines like stocks, but they quietly strengthen your finances across life stages. From building discipline in your 20s to ensuring stability in retirement, they remain a steady anchor for wealth creation. Here's how they work for you."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-crypto-regulation-document-government-no-plans-legal-report-2785132-2025-09-10",
      "headline": "Document shows India resisting complete crypto regulation: ReportWhile some countries like Japan and Australia are developing frameworks to regulate digital assets carefully, India remains cautious. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-extend-gains-on-us-trade-deal-hopes-and-fed-cut-buzz-2785124-2025-09-10",
      "headline": "Sensex, Nifty extend gains on US trade deal hopes and Fed rate cut buzzThe NSE Nifty 50 climbed 104.50 points to close at 24,973.10, while the BSE Sensex added 323.83 points, ending at 81,425.15. The Nifty has now gained for six straight sessions, with the Sensex rising in five of the last six trading days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/festive-season-stocks-that-you-should-add-to-your-portfolio-mahindra-nykaa-swiggy-maruti-dixon-2785106-2025-09-10",
      "headline": "Festive season stocks that you should add to your portfolioWith people ready to spend on home appliances, beauty products, lifestyle goods, and automobiles, investors are now looking for stocks that could benefit from this surge in demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-your-credit-score-falling-here-is-how-to-fix-it-2785104-2025-09-10",
      "headline": "Is your credit score falling? Here's how to fix itHas your credit score recently taken a hit? You're not alone. Many people discover a drop only when applying for a loan or credit card. The good news is, most reasons are easy to fix with a few smart steps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fitch-rating-india-raises-outlook-economic-growth-7-percent-q2-performance-gst-reforms-rbi-rate-cut-2785047-2025-09-10",
      "headline": "Fitch raises India's growth forecast to 6.9% for FY26 on strong Q2 performanceThe revision comes after India's real GDP grew by 7.8% in the April–to-June quarter, surpassing expectations and marking an acceleration from the 7.4% growth seen in the previous three months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/delhi-high-court-asks-priya-kapur-to-list-sunjay-kapurs-assets-2784953-2025-09-10",
      "headline": "Delhi High Court asks Priya Kapur to list Sunjay Kapur's assetsThe legal dispute over the estate of the late businessman Sanjay Kapoor has reached the Delhi High Court. A suit has been filed by Karishma Kapoor's two children, who claim they are entitled to their father's personal assets as legal heirs. The High Court has registered the suit and will hear the matter on the 9th of October to decide on an interim stay. The children contend they have been informed they are not beneficiaries under Sanjay Kapoor's will, which they are now questioning and allege has been forged. In response, Priya Kapoor's counsel has told the court that the children \"have already been given 1900 crore worth of assets six days before the suit was even filed.\" The Delhi High Court has directed Priya Kapoor to file a list of all movable and immovable assets of Sanjay Kapoor known to her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/this-crypto-exchange-eyes-3-billion-ipo-with-nasdaq-backing-2785006-2025-09-10",
      "headline": "This crypto exchange eyes $3 billion IPO with Nasdaq backingThe company, backed by the Winklevoss twins, plans to sell 16.67 million shares at a price between $24 and $26 each, up from its previous range of $17 to $19 per share. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-affordable-housing-demand-is-slowing-down-in-india-2784968-2025-09-10",
      "headline": "Why affordable housing demand is slowing down in IndiaAffordable housing was once the backbone of India's housing dream, offering budget-friendly options to urban families. But today, demand in this segment is slipping, as buyers increasingly feel these homes don't match their needs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karisma-kapoor-children-sunjay-kapoor-rs-30000-crore-empire-hearing-case-samaira-kiaan-2784884-2025-09-10",
      "headline": "Can Karisma Kapoor's children get a part of Sunjay Kapur's Rs 30,000 crore empire?The lawsuit from Karisma Kapoor's children accuses their stepmother Priya Sachdeva of withholding critical information and details about Sunjay Kapur's will. The hearing for this case is scheduled for today, September 10, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/in-suit-filed-by-karisma-kapoors-children-stepmother-priya-asked-to-list-late-sunjay-kapurs-assets-2784893-2025-09-10",
      "headline": "Court asks Priya Kapur to list Sunjay Kapur's assets after lawsuitDelhi High Court has asked Priya Sachdev Kapur to submit a detailed list of all movable and immovable assets belonging to the late Sunjay Kapur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-on-gold-jewellery-here-is-all-you-need-to-know-2784886-2025-09-10",
      "headline": "Tax on gold jewellery? Here's all you need to knowWondering if your gold jewellery attracts income tax? The answer depends on whether you simply own it or decide to sell it. Here's a quick look at how the tax rules work in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/novo-nordisk-cuts-9000-jobs-to-save-126-billion-annually-2784864-2025-09-10",
      "headline": "Novo Nordisk cuts 9,000 jobs to save $1.26 billion annuallyThe company, which employs nearly 78,400 people globally, said around 5,000 of the job losses will take place in Denmark. The decision comes as Novo faces increasing pressure from its US rival Eli Lilly and slowing demand for Wegovy in key markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/it-stocks-rally-big-on-fed-cut-optimism-where-to-invest-now-2784853-2025-09-10",
      "headline": "IT stocks rally big on Fed cut optimism Where to invest nowThe main driver behind IT sector rally is growing hope that the US Federal Reserve will cut interest rates soon. Lower rates would reduce costs for global businesses and boost demand for IT services. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/homebuyer-expectations-in-2025-pirce-affordability-location-luxury-2784839-2025-09-10",
      "headline": "What are homebuyers most worried about in 2025? Hint: It's not just priceThe 2025 housing market signals a clear shift. Buyers are moving beyond affordability, prioritising quality, timely delivery, and livability, even if it means paying more for premium and luxury homes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-300-points-nifty-above-24950-lt-bel-among-top-gainers-2784817-2025-09-10",
      "headline": "Sensex up nearly 400 points, Nifty nears 25,000 on hopes of India-US trade talksThe S&P BSE Sensex rose over 350 points in early trade, while the Nifty50 edged close to the 25,000 mark around 9:30 am. Both indices reflected improved sentiment after five straight sessions of gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-ipo-review-open-bidding-today-latest-gmp-should-you-invest-2784793-2025-09-10",
      "headline": "Urban Company IPO open for bidding today: Should you invest as GMP doubles?Ahead of the public subscription, Urban Company raised Rs 854 crore from anchor investors. Notable institutions participating in the anchor round included Government Pension Fund Global, Nomura Funds Ireland, etc. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/oracle-cuts-over-100-jobs-in-india-as-ai-reshapes-workforce-2784544-2025-09-09",
      "headline": "Oracle cuts over 100 jobs in India as AI reshapes workforceOracle, which employs around 30,000 people in India, reported a revenue of Rs 20,459 crore in the year ended March 2024, a 20% jump from the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/backpacking-on-a-budget-smart-forex-tips-for-young-travellers-2784521-2025-09-09",
      "headline": "Backpacking on a budget: Smart forex tips for young travellersFor young backpackers, every rupee counts. While cheap flights and hostels often top the checklist, the way you manage foreign exchange could quietly decide whether your trip stays on budget, or slips into overspending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-south-2025/video/hyderabad-on-track-to-become-a-global-tech-hub-d-sridhar-babu-2784471-2025-09-09",
      "headline": "Hyderabad on track to become a global tech hub: D Sridhar BabuHyderabad is aiming to become a global technology hub, focusing on innovation, start-ups, and talent development. At the India Today Conclave South 2025, D Sridhar Babu, Minister for IT, E&C, Industries & Commerce, outlined the city's vision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-314-points-higher-nifty-above-24850-infosys-gains-5-percent-it-stocks-2784437-2025-09-09",
      "headline": "Sensex ends 314 points higher, Nifty above 24,850; Infosys gains 5%The S&P BSE Sensex was up 314.02 points to close at 81,101.32, while the NSE Nifty50 added 95.45 points to end at 24,868.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karishma-kapoor-kids-samaira-kiaan-legal-battle-sunjay-kapur-rs-30000-crore-wealth-2784430-2025-09-09",
      "headline": "Karisma Kapoor's children vs stepmother Priya in lawsuit over Sunjay Kapur's willSunjay Kapur's children, identified as the legal heirs, have filed a suit in Delhi High Court seeking partition of the estate, rendition of accounts, and a permanent injunction"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/siddharth-joins-freida-pinto-netflix-family-drama-unaccustomed-earth-2785979-2025-09-12",
      "headline": "Siddharth joins Freida Pinto for Netflix family drama Unaccustomed EarthActor Siddharth will lead Netflix's 'Unaccustomed Earth' alongside Freida Pinto. The family-drama series explores complex relationships within an Indian American community of Cambridge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ed-sheeran-says-watching-om-shanti-om-like-introducing-someone-to-star-wars-2785900-2025-09-11",
      "headline": "Ed Sheeran says watching Om Shanti Om is like introducing someone to Star WarsEd Sheeran expressed his admiration for actor Shah Rukh Khan's 'Om Shanti Om' and India's cultural diversity. His reflections highlight the rich talents and unique cinematic experiences across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/vampire-diaries-nina-dobrev-shaun-white-split-5-years-after-engagement-report-2785880-2025-09-11",
      "headline": "Vampire Diaries' Nina Dobrev and Shaun White split 5 years after engagement: ReportAmerican snowboarder Shaun White and 'The Vampire Diaries' actor Nina Dobrev have ended their engagement, according to reports. The duo dated for five years before getting engaged in 2024"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aamir-khan-next-with-lokesh-kanagaraj-shelved-report-2785746-2025-09-11",
      "headline": "After Coolie cameo, Aamir Khan's next with Lokesh Kanagaraj shelved: ReportThe much-anticipated Aamir Khan–Lokesh Kanagaraj superhero project is reportedly shelved, leaving fans wondering about the director's next moves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/photo/tamannaah-bhatia-diana-penty-glam-up-do-you-wanna-partner-screening-2785862-2025-09-11",
      "headline": "Tamannaah Bhatia, Diana Penty glam up Do You Wanna Partner screeningActors Tamannaah Bhatia and Diana Penty made a stylish appearance at the screening of 'Do You Wanna Partner.' The supporting cast, including Shweta Tiwari, Nakuul Mehta, Rannvijay Singha, Jasleen Royal and Sufi Motiwala, were also seen at the screening. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/punjabi-artistes-are-indias-passport-to-world-because-beats-break-borders-2785724-2025-09-11",
      "headline": "Punjabi artistes are India's passport to world, because beats break bordersPunjabi beats are rewriting pop culture's playlist globally. If you see that the world's dancing to it now, it's purely because of the global dominance of Punjabi artistes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/baseer-ali-awez-darbar-fight-bigg-boss-19-captaincy-task-2785773-2025-09-11",
      "headline": "Awez Darbar warns Baseer Ali to lower his tone in Bigg Boss 19. Watch promoYou know the upcoming episode of a reality show is going to be an interesting one when a contestant ends his silence with a roar. A promo for the upcoming episode of 'Bigg Boss 19' promises exactly that and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-were-once-kicked-out-of-new-zealand-cafe-says-jemimah-rodrigues-2785788-2025-09-11",
      "headline": "Anushka-Virat were once kicked out of New Zealand cafe, says Jemimah RodriguesDuring their visit to New Zealand, Virat Kohli and Anushka Sharma were reportedly asked to leave a cafe after a lengthy conversation with Indian women cricketers Jemimah Rodrigues and Smriti Mandhana. The incident was shared by Rodrigues in a latest interview. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-rip-teaser-matt-damon-ben-affleck-stuck-in-money-morality-and-mayhem-2785721-2025-09-11",
      "headline": "The Rip teaser: Matt Damon, Ben Affleck stuck in money, morality and mayhemHollywood's BFF Ben Affleck and Matt Damon are reuniting in the crime thriller 'The Rip'. The crime thriller is set to release on Netflix in January 2025, exploring themes of trust and betrayal among Miami police officers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-infinity-castle-advance-booking-latest-update-and-box-office-records-burst-through-the-roof-in-india-2785757-2025-09-11",
      "headline": "Demon Slayer: Infinity Castle advance booking bursts through the roof in India'Demon Slayer: Infinity Castle' advance booking smashes records in India, set to redefine animated film success. The pre-sales in India crossed Rs 10 crore, breaking non-Hollywood records and signalling the anime's growing box office impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mimi-chakraborty-bikini-bengali-nandita-roy-shiboprosad-mukherjee-bold-raktabeej-2-2785709-2025-09-11",
      "headline": "Mimi Chakraborty becomes first actor to wear bikini in a Bengali filmMimi Chakraborty has made headlines by becoming the first Bengali actor to shoot in a bikini for a Bengali film. She was seen in a swimwear for a song titled 'Choker Neele'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-dilip-royal-treatment-udaipur-mewar-king-youtube-vlog-2785638-2025-09-11",
      "headline": "Dilip's royal treatment from King of Mewar leaves Farah Khan speechless. WatchFilmmaker Farah Khan's latest vlog captured a unique experience with the King of Mewar. The video featured her cook Dilip receiving royal attention as she was humorously sidelined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-song-tenu-ki-pata-manoj-pahwa-diljit-dosanjh-badshah-2785684-2025-09-11",
      "headline": "The Ba***ds of Bollywood song Tenu Ki Pata: Manoj Pahwa is star of Diljit's song 'Tenu Ki Pata' is the third song released from Aryan Khan's upcoming series 'The Ba***ds of Bollywood'. Sung by Diljit Dosanjh, the track prominently features Manoj Pahwa and has further raised anticipation for the series' premiere."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-dead-girls-review-netflix-mexican-show-is-wickedly-funny-bloodbath-you-wont-see-coming-2785624-2025-09-11",
      "headline": "The Dead Girls review: A wickedly funny bloodbath you won't see comingRelease Date:Wed Sep 10, 2025Netflix's 'The Dead Girls' is a darkly funny crime thriller from Mexico based on true events. Packed with murder, satire and stellar performances, it's a must-watch.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/financial-detriment-harming-dignity-delhi-high-court-protects-aishwarya-rais-personality-rights-2785687-2025-09-11",
      "headline": "No misuse of name, image: High Court protects Aishwarya Rai's personality rightsThe Delhi High Court has granted Bollywood actor Aishwarya Rai Bachchan protection over her personality rights, ruling that unauthorised commercial use of her name, image, or likeness violates her right to live with dignity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kaantha-release-delayed-after-lokah-chapter-1-box-office-success-2785673-2025-09-11",
      "headline": "Dulquer Salmaan's Kaantha postponed due to Lokah's success, new date to be outDulquer Salmaan and Rana Daggubati announced the postponement of 'Kaantha' to allow 'Lokah' to continue its successful run. New release date will be announced soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanjay-gupta-says-bollywood-star-was-fired-from-south-film-due-to-high-entourage-2785663-2025-09-11",
      "headline": "Sanjay Gupta says a Bollywood star was fired from South film due to high entourageDirector Sanjay Gupta revealed a Bollywood star was fired from a South film due to costly entourage demands. The producer scrapped the project after discovering hidden expenses from multiple vans brought from Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/the-summer-i-turned-pretty-why-millennial-women-are-bingeing-belly-jeremiah-conrad-love-story-like-teenagers-2785631-2025-09-11",
      "headline": "Why millennial women are bingeing on The Summer I Turned Pretty like teenagersMillennial women can't get enough of 'The Summer I Turned Pretty'. Between Belly's endless love triangle, Conrad vs Jeremiah debates, and the nostalgia of teenage summers, the Prime Video hit has become the ultimate guilty pleasure - bills and burnout be damned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shiva-rajkumar-shoots-rajinikanth-jailer-2-poses-pictures-with-fans-2785658-2025-09-11",
      "headline": "Shiva Rajkumar shoots for Rajinikanth's Jailer 2, poses for pics with fansKannada actor Shiva Rajkumar, whose cameo in Rajinikanth's 2023 blockbuster 'Jailer' had gone viral, will be reprising his role in the sequel. He has started shooting for the film."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/fbi-releases-new-photos-of-person-of-interest-in-charlie-kirks-assassination-glbs-2786013-2025-09-12",
      "headline": "FBI releases new photos of person of interest in Charlie Kirk's assassinationThe FBI released new photos of a person of interest in Charlie Kirk's assassination at Utah Valley University and urged the public to send tips through its portal.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-india-ambassador-nominee-touts-warm-us-india-ties-sees-tariff-deal-soon-glbs-2785988-2025-09-12",
      "headline": "US, India not that far apart on tariffs, says Trump's envoy pick Sergio GorSergio Gor, a close Trump aide and director of the White House Presidential Personnel Office, said that despite recent disagreements over tariffs and India's purchases of Russian oil, the US-India relationship continues to be \"warm and strategically important.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/benjamin-netanyahu-signs-west-bank-expansion-plan-there-will-be-no-palestinian-state-hamas-gaza-attack-2786014-2025-09-12",
      "headline": "Netanyahu vows there will be no Palestinian state: This place is oursBenjamin Netanyahu ruled out a Palestinian state while signing an agreement to advance the contentious E1 settlement project, which would divide the occupied West Bank and expand housing in Maale Adumim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-to-push-g7-for-higher-tariffs-on-india-china-over-russian-oil-report-glbs-2786009-2025-09-12",
      "headline": "US to push G7 for higher tariffs on India, China over Russian oil: ReportG7 finance ministers will debate new US proposals for tougher economic measures on Russia, as Washington urges allies to escalate pressure and accelerate Europe's shift from Russian energy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kulman-ghising-who-ended-nepal-blackout-backed-by-gen-z-protesters-interim-head-2785863-2025-09-11",
      "headline": "Who is Kulman Ghising, Nepal's India-educated 'power saviour' in race for top job?Gen Zers have proposed the name of Kulman Ghising, the man widely credited with ending Nepal's power outages, as a candidate for the interim Prime Minister."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/dallas-motel-murder-case-suspect-used-machete-beheaded-victim-front-family-glbs-2785981-2025-09-11",
      "headline": "Indian-origin man attacked, beheaded with machete after argument at US motelA gruesome murder at a Dallas motel has shocked the city. Yordanis Cobos-Martinez used a machete to fatally attack 50-year-old Chandra Mouli Nagamallaiah after an argument. The victim was killed in front of his wife and son."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/qatar-backstab-hamas-israel-trump-theories-coordinated-strike-gaza-war-2785596-2025-09-11",
      "headline": "Did Qatar backstab Hamas? 3 theories behind the brazen Israeli attackIsrael targeting Hamas's political leadership in Qatar was brazen as well as unprecedented. There are three major theories on why the strike could have possibly been a coordinated plot. We explain the different perspectives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ex-president-jair-bolsonaro-sentenced-in-coup-plot-for-27-years-2786001-2025-09-12",
      "headline": "Brazil's top court sentences Bolsonaro to 27 years in prison for coup plotA five-judge panel of Brazil's Supreme Court convicted Jair Bolsonaro and handed him a 27-year sentence, making the 70-year-old the first ex-president found guilty of attacking democracy.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/is-this-asian-spring-arab-awakening-nepal-gen-z-protests-bangladesh-agitation-explained-2785513-2025-09-11",
      "headline": "Is this the Asian Spring?In the 2010s, mass protests in African and West Asian countries resulted in the Arab Spring. Nepal is among the South Asian countries, like Bangladesh, Indonesia, Sri Lanka, Thailand and Pakistan, that has witnessed large-scale, youth-led agitations. The issues are similar. Is this an Asian Spring?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-leader-udit-raj-nepal-like-situation-in-india-remark-triggers-bjp-backlash-2785974-2025-09-11",
      "headline": "Congress leader's 'Nepal-like situation in India' remark triggers BJP backlashCongress leader Udit Raj has drawn fire from the BJP after suggesting that India could face a Nepal-like situation if not for the strength of its Constitution."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-naval-academy-on-lockdown-after-reported-shooting-at-dormitory-glbs-2786005-2025-09-12",
      "headline": "US Naval Academy on lockdown after reported shooting at dormitoryThe US Naval Academy in Annapolis was locked down Thursday after a dismissed midshipman reportedly opened fire inside Bancroft Hall, the school's main dormitory, officials said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-will-sort-out-trade-deal-with-india-after-it-stops-buying-russian-oil-lutnick-2785879-2025-09-11",
      "headline": "US will sort out trade deal with India after it stops buying Russian oil: LutnickHoward Lutnick had previously taken a far tougher line on India, stating that New Delhi would soon be \"saying sorry\" and return to the negotiating table to resolve trade issues with the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/british-vlogger-nepal-is-on-fire-video-makes-internet-say-it-will-script-history-harry-gen-z-protests-2785836-2025-09-11",
      "headline": "British vlogger's 'Nepal is on fire' video makes Internet say it will script historyThe British vlogger, who has been documenting his experiences on his social media account 'wehatethecold', was in for a shock once he arrived in Nepal amid the chaos and destruction that has gripped the country since September 8."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/siddaramaiahs-proposal-to-name-shivajinagar-metro-station-bengaluru-after-st-mary-sparks-row-2785933-2025-09-11",
      "headline": "Shivajinagar metro station to be named after St Mary? Row over Siddaramaiah's planSiddaramaiah's announcement that he would recommend naming an upcoming metro station in Bengaluru's Shivajinagar after St Mary has sparked a massive row."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-litton-das-fifty-bangladesh-beat-hong-kong-2785980-2025-09-11",
      "headline": "Litton helps Bangladesh kickstart campaign with easy win over Hong KongAsia Cup: Litton Das played a captain's knock to help Bangladesh gun down the 144-run target against Hong Kong without any hiccups and secure a seven-wicket win in their campaign opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/two-men-hunt-python-cook-its-meat-in-kerala-kannur-arrested-2785984-2025-09-12",
      "headline": "2 men hunt python and cook its meat in Kerala, arrestedTwo men, Pramod and Bineesh, were arrested in Panapuzha for killing a python and cooking its meat. A case under the Wildlife Protection Act has been filed, and they were remanded in judicial custody."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/north-korea-kim-jong-un-likely-to-name-daughter-successor-kim-ju-ae-nis-heres-more-beti-bachao-beti-padhao-2785706-2025-09-11",
      "headline": "Beti badhao in North Korea: Kim Jong Un likely to name daughter successorNorth Korean leader Kim Jong Un will most likely name his daughter, Kim Ju Ae, his successor, said South Korea's spy agency. The Korean society is highly patriarchal, and Kim's move will be a Beti Badhao, or promote the daughter, initiative. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-ticket-sale-update-slow-2785966-2025-09-11",
      "headline": "India vs Pakistan tickets yet to sell out, premium seats at Rs 4 lakhAsia Cup 2025: Tickets for the highly anticipated India vs Pakistan clash remain unsold, contrary to expectations. In an unprecedentedly slow uptake, seats are still available in nearly half the stands of the 25,000-capacity Dubai International Cricket Stadium for Sunday's game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/5-killed-10-injured-after-roadways-bus-loses-control-overturns-in-lucknow-2785910-2025-09-11",
      "headline": "4 killed as bus hits water tanker, falls into 20-foot-deep ditch in LucknowLocals said the bus was on its way from Hardoi when the driver lost control, hitting a water tanker before plunging into a 20-foot-deep ditch in Lucknow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/suman-khulbe-indian-origin-doctor-canada-found-guilty-sexual-misconduct-licence-suspended-glbs-2785868-2025-09-11",
      "headline": "Drugged patients, had oral sex: Indian-origin doctor in Canada guilty of abuseThe College of Physicians and Surgeons of Ontario (CPSO) announced the decision after a tribunal concluded that Khulbe engaged in sexual acts with one male patient and maintained unprofessional relationships with two others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/janhvi-kapoor-tiff-2025-homebound-prada-saree-jamwar-dejhur-miu-miu-2785760-2025-09-11",
      "headline": "Janhvi Kapoor and the art of being fashionably 'Homebound'Janhvi Kapoor is making waves at the Toronto International Film Festival with her meaningful, India-centric sartorial choices - a signature move whenever she represents the country on an international platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/bjp-tn-chief-nainar-nagendran-slams-mk-stalin-government-hospital-patient-son-dragging-video-wheelchair-2785765-2025-09-11",
      "headline": "Video: Coimbatore man drags ailing father after 'hospital denies wheelchair'Tamil Nadu BJP accused state government of neglecting healthcare after a viral video showed a man dragging his ailing father at Coimbatore Government General Hospital as wheelchair was not provided despite a two-hour wait."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/charlie-kirk-will-get-presidential-medal-of-freedom-trump-after-influencer-shot-dead-in-utah-college-campus-2785865-2025-09-11",
      "headline": "Charlie Kirk to get US's highest honour after being killed at college rally: TrumpThe US President, Donald Trump, said that he will posthumously award Charlie Kirk the Presidential Medal of Freedom after the activist was fatally shot at a Utah college. Authorities are investigating the targeted attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/911-anniversary-trump-attends-new-york-yankees-game-draws-boos-and-cheers-glbs-2786008-2025-09-12",
      "headline": "9/11 anniversary: Trump attends New York Yankees game, draws boos and cheersUnited States President Donald Trump has drawn mixed reactions from spectators while attending the New York Yankees game, after honouring the memories of the victims at the Pentagon. During the National Anthem, Trump was shown on the stadium jumbotron and received boos from some in the crowd, cheers from others."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wood-brothers-backyard-cricket-youtube-drs-red-bull-showdown-community-2784763-2025-09-12",
      "headline": "Backyard cricket goes viral: Wood brothers blend nostalgia and competitionMark and Jacob Wood transformed backyard cricket into a viral YouTube sensation during the COVID lockdown. Their backyard cricket content has helped them build a community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-shubman-gill-sachin-tendulkar-virat-kohli-cricket-idols-2785990-2025-09-12",
      "headline": "Shubman Gill on idols: Tendulkar shaped him first, Kohli's hunger drove him onShubman Gill reveals his two cricketing idols are Sachin Tendulkar and Virat Kohli. The India Test captain says Tendulkar inspired him early, while Kohli's passion and hunger shaped his approach as a maturing player."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-team-cafa-nations-cup-khalid-jamil-consistency-bhaichung-bhutia-2785983-2025-09-11",
      "headline": "CAFA bronze a start, but coach Khalid Jamil must build consistency: Bhaichung BhutiaIndia's CAFA Nations Cup bronze under Khalid Jamil brought promise, but Bhaichung Bhutia has warned that inconsistency could derail bigger ambitions. With AFC Asian Cup 2027 qualifiers ahead, India must show maturity and stability against stronger opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-ticket-sale-update-slow-2785966-2025-09-11",
      "headline": "India vs Pakistan tickets yet to sell out, premium seats at Rs 4 lakhAsia Cup 2025: Tickets for the highly anticipated India vs Pakistan clash remain unsold, contrary to expectations. In an unprecedentedly slow uptake, seats are still available in nearly half the stands of the 25,000-capacity Dubai International Cricket Stadium for Sunday's game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-litton-das-fifty-bangladesh-beat-hong-kong-2785980-2025-09-11",
      "headline": "Litton helps Bangladesh kickstart campaign with easy win over Hong KongAsia Cup: Litton Das played a captain's knock to help Bangladesh gun down the 144-run target against Hong Kong without any hiccups and secure a seven-wicket win in their campaign opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-india-pakistan-cricket-ties-relations-asia-cup-2785967-2025-09-11",
      "headline": "No cricket between India and Pakistan until bilateral relations improve: HarbhajanFormer India spinner Harbhajan Singh said India and Pakistan should improve their relations before playing cricket against each other. India will take on Pakistan in their second group clash of the ongoing Asia Cup T20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-2027-finals-madrid-estadio-metropolitano-warsaw-national-stadium-2785944-2025-09-11",
      "headline": "Madrid and Warsaw to host men's and women's Champions League finals in 2027UEFA has designated Madrid's Estadio Metropolitano for the 2027 men's Champions League final, while the women's competition will conclude at Warsaw's National Stadium. Both selections signify UEFA's strategy to broaden event sites and further both men's and women's tournaments across Europe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-net-practice-video-return-bcci-logo-fit-india-vs-australia-odi-2785931-2025-09-11",
      "headline": "Watch: Rohit Sharma flaunts BCCI logo on helmet, looks crisp in training videoRohit Sharma looked sharp and focused in a recent training video, proudly flaunting the BCCI logo on his helmet. The India ODI captain is gearing up for his return against Australia after nearly eight months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-mike-hesson-comment-mohammad-nawaz-spinner-2785908-2025-09-11",
      "headline": "Mind games begin: Before India clash, Pakistan coach brands Nawaz World No. 1 spinnerAsia Cup 2025: Pakistan head coach Mike Hesson branded Mohammad Nawaz as the world's best spinner ahead of their clash with India. The unfounded claim carried the air of a psychological ploy ahead of the big-ticket contest in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ange-postecoglou-tottenham-sacking-fan-support-nottingham-forest-manager-2785888-2025-09-11",
      "headline": "Ange Postecoglou admits he knew Spurs would sack him before Europa League winAnge Postecoglou said he knew Tottenham would sack him before their Europa League win in Bilbao, but the fact that Spurs fans wanted to \"hug me and take me home for dinner\" showed he had succeeded."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/balwan-punia-father-of-olympian-wrestler-bajrang-punia-dies-2785891-2025-09-11",
      "headline": "Bajrang Punia's father, Balwan Punia, dies after prolonged lung illnessBalwan Punia, father of Olympian wrestler Bajrang Punia, has died after battling lung complications. Bajrang shared the news on social media, expressing his grief and the profound impact of his father's demise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-2027-finals-madrid-estadio-metropolitano-warsaw-national-stadium-2785944-2025-09-11",
      "headline": "Madrid and Warsaw to host men's and women's Champions League finals in 2027UEFA has designated Madrid's Estadio Metropolitano for the 2027 men's Champions League final, while the women's competition will conclude at Warsaw's National Stadium. Both selections signify UEFA's strategy to broaden event sites and further both men's and women's tournaments across Europe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-net-practice-video-return-bcci-logo-fit-india-vs-australia-odi-2785931-2025-09-11",
      "headline": "Watch: Rohit Sharma flaunts BCCI logo on helmet, looks crisp in training videoRohit Sharma looked sharp and focused in a recent training video, proudly flaunting the BCCI logo on his helmet. The India ODI captain is gearing up for his return against Australia after nearly eight months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-mike-hesson-comment-mohammad-nawaz-spinner-2785908-2025-09-11",
      "headline": "Mind games begin: Before India clash, Pakistan coach brands Nawaz World No. 1 spinnerAsia Cup 2025: Pakistan head coach Mike Hesson branded Mohammad Nawaz as the world's best spinner ahead of their clash with India. The unfounded claim carried the air of a psychological ploy ahead of the big-ticket contest in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ange-postecoglou-tottenham-sacking-fan-support-nottingham-forest-manager-2785888-2025-09-11",
      "headline": "Ange Postecoglou admits he knew Spurs would sack him before Europa League winAnge Postecoglou said he knew Tottenham would sack him before their Europa League win in Bilbao, but the fact that Spurs fans wanted to \"hug me and take me home for dinner\" showed he had succeeded."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/balwan-punia-father-of-olympian-wrestler-bajrang-punia-dies-2785891-2025-09-11",
      "headline": "Bajrang Punia's father, Balwan Punia, dies after prolonged lung illnessBalwan Punia, father of Olympian wrestler Bajrang Punia, has died after battling lung complications. Bajrang shared the news on social media, expressing his grief and the profound impact of his father's demise. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}