{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-flipkart-and-major-smartphone-brands-samsung-xiaomi-motorola-face-antitrust-heat-report-2600139-2024-09-15",
      "headline": "Amazon, Flipkart and major smartphone brands face antitrust heat: ReportThe Competition Commission of India (CCI) has found that these companies have been involved in exclusive product launches on their platforms, which may have restricted competition and harmed smaller businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rent-vs-buy-expert-views-smarter-financial-move-for-you-2599981-2024-09-15",
      "headline": "Rent vs buy: What's the smarter financial move for you?Renting offers the freedom to move, explore career opportunities, and invest in other ventures. Buying a home, on the other hand, offers long-term security, a sense of ownership, and equity building. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/centre-approves-madhya-pradeshs-request-for-soybean-procurement-at-msp-2599830-2024-09-14",
      "headline": "Centre approves Madhya Pradesh's request for soybean procurement at MSPUnion Agriculture and Farmer Welfare Minister Shivraj Singh Chouhan confirmed that the proposal from the Madhya Pradesh government was received and approved late Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/minimum-export-price-limit-basmati-rice-onion-outbound-shipments-and-enhance-farmers-income-2599748-2024-09-14",
      "headline": "Centre lifts minimum export price cap on onion, basmati riceThe $950 per tonne minimum export price for basmati rice has been removed while the export duty on onion has been cut to 20 per cent from 40 per cent, in effect from September 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-expected-listing-gains-double-investors-wealth-latest-gmp-2599745-2024-09-14",
      "headline": "Bajaj Housing Finance IPO: Will it double investors' wealth on market debut?Bajaj Housing Finance IPO listing: With the GMP indicating a significant upside, all eyes are now on whether the shares will live up to the hype and deliver the bumper listing gains many expect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-election-2024-trump-allies-plan-to-privatise-fannie-and-freddie-says-report-2599379-2024-09-13",
      "headline": "Trump allies plan to privatise Fannie and Freddie, says reportThe discussions involve prominent figures close to Trump, including Larry Kudlow, the former director of the National Economic Council, and John McEntee, who previously worked in the White House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-chief-madhabi-puri-buch-dhaval-address-conflict-of-interest-charges-3-big-clarifications-joint-statemet-2599223-2024-09-13",
      "headline": "Sebi chief addresses conflict of interest allegations with 3 big clarificationsThe Buchs firmly denied any wrongdoing, offering detailed explanations to counter allegations tied to consulting roles, rental income, and Madhabi Puri Buch's ICICI Bank stock options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-share-market-strong-rally-break-bajaj-finance-finserv-2599227-2024-09-13",
      "headline": "Sensex, Nifty end lower as markets take breather after strong rallyThe S&P BSE Sensex fell 135.83 points to 82,926.88, while the NSE Nifty50 settled 43 points lower at 25,345.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-listing-gains-hype-with-big-returns-investor-profit-latest-gmp-2599196-2024-09-13",
      "headline": "Bajaj Housing Finance IPO: Cash in on listing day or wait for long-term gain? Brokerages tracking the IPO have already indicated that the IPO is set for a positive listing, with the grey market premium (GMP) indicating that investors will see their money double on listing day."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sebi-chief-madhabi-puri-buch-rejects-allegations-conflict-of-interest-statement-false-malicious-defamatory-breaks-silence-2599190-2024-09-13",
      "headline": "Sebi chief, husband reject conflict of interest charges, call it false, motivatedIn a joint statement, Sebi chief Madhabi Puri Buch and husband Dhaval Buch rejected recent allegations of conflict of interest as \"false, malicious, and defamatory.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-finance-bajaj-finserv-shares-gain-amid-housing-unit-ipo-buzz-2599120-2024-09-13",
      "headline": "Bajaj Finance, Bajaj Finserv shares gain amid housing unit IPO buzzThe buzz around the Bajaj Housing Finance IPO, which is set to make its stock market debut on September 16, has led traders on Dalal Street to snap up shares of other publicly traded Bajaj companies, hoping to capitalise on the momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/western-carriers-ipo-opens-for-bidding-subscribe-or-skip-good-or-bad-key-details-gmp-expert-view-2599104-2024-09-13",
      "headline": "Western Carriers IPO opens for bidding: Should you subscribe or skip? Western Carriers (India) Limited has allocated 85,96,743 equity shares to 15 anchor investors, raising Rs 148 crore before its proposed IPO."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-shares-surge-9-percent-what-fueling-the-rally-and-will-it-continue-2599086-2024-09-13",
      "headline": "SpiceJet shares surge 9%: What's fuelling the rally and will it continue?SpiceJet share price: Despite regulatory challenges, the airline's shares have surged recently. Will the rally hold?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pn-gadgil-jewellers-ipo-allotment-check-application-status-latest-gmp-bse-bigshare-services-2599066-2024-09-13",
      "headline": "PN Gadgil Jewellers IPO allotment: Step-by-step guide to check statusPN Gadgil Jewellers IPO allotment: If you've applied for the IPO, you can check the allotment status online in a few simple steps through the websites of the BSE and Bigshare Services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-allotment-expected-listing-gains-110-percent-gmp-2599039-2024-09-13",
      "headline": "Bajaj Housing Finance IPO: Got allotment? Check expected listing gainsBrokerages tracking the IPO have already indicated that the IPO is set for a positive listing, with the grey market premium (GMP) indicating that investors will see their money double on listing day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-shares-drop-after-hindenburg-fresh-allegations-2599025-2024-09-13",
      "headline": "Adani Group shares drop after Hindenburg's fresh allegationsHindenburg Research claimed that Swiss authorities had frozen over $310 million across several Swiss bank accounts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-fall-record-highs-bajaj-finserv-finance-shares-gain-2599020-2024-09-13",
      "headline": "Sensex, Nifty pause rally near record highs; Bajaj twins gainThe S&P BSE Sensex fell 134.05 points to 82,828.66 at 10:28 am, while the NSE Nifty50 fell 44.30 points to 25,344.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindenburg-research-swiss-authorities-freeze-310-million-funds-adani-group-probe-2598886-2024-09-12",
      "headline": "Adani Group rejects Hindenburg claim of Swiss banks' $310 million funds freezeHindenburg cited a Swiss media outlet, Gotham City, which alleged that more than $310 million belonging to an alleged frontman for billionaire Gautam Adani is sequestered in six Swiss banks. The Adani Group \"unequivocally\" rejected the claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-flipkart-violating-indian-competition-laws-competition-commission-of-india-report-2598813-2024-09-12",
      "headline": "Amazon, Flipkart found violating Indian competition laws: ReportA probe by the Competition Commission of India (CCI) found that e-commerce giants Amazon and Flipkart engaged in anti-competitive practices by favouring select sellers on their platforms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/understanding-circle-rates-a-simple-guide-for-homebuyers-and-sellers-2598648-2024-09-12",
      "headline": "Understanding circle rates: A simple guide for homebuyers and sellersUnderstanding the concept of circle rates, and how they influence property valuations, has become critical for anyone navigating the real estate market."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-firing-near-florida-golf-club-safe-campaign-2600338-2024-09-16",
      "headline": "Trump safe after 'attempted assassination' at Florida golf club, suspect arrestedDonald Trump was reportedly golfing at the course when the gunshots took place. The Secret Service agents then escorted him to a holding room at the club."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-elections-donald-trump-assassination-attempt-ryan-wesley-routh-gunman-ak-47-rifle-fbi-2600349-2024-09-16",
      "headline": "Who is Ryan Routh, Ukraine supporter arrested for shooting at Trump in FloridaThe alleged gunman, whom authorities have identified as 58-year-old Ryan Wesley Routh, earlier on social media stated that \"democracy is on the ballot\" this year and \"we cannot lose.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-delhi-chief-minister-resignation-announcement-atishi-kailash-gahlot-sunita-kejriwal-gopal-rai-2600253-2024-09-15",
      "headline": "Who will succeed Arvind Kejriwal as Delhi Chief Minister? Top contendersAs Arvind Kejriwal surprisingly announced his decision to resign as Delhi Chief Minister, here are some of the possible contenders for the top post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-nda-government-bill-one-nation-one-election-current-term-sources-2600291-2024-09-15",
      "headline": "Centre to bring bill on One Nation One Election during its current term: SourcesDuring his Independence Day speech, PM Modi urged people to come together for One Nation One Election legislation, calling it \"need of the hour\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/story/emmy-awards-live-updates-winners-the-bear-shogun-2599213-2024-09-13",
      "headline": "Emmy Awards 2024: The Bear, Baby Reindeer lead the packEmmys 2024: The 76th Primetime Emmys, honouring the best in American TV, is being held in Los Angeles. The Bear and Shogun are leading the race with the highest number of wins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/joe-biden-donald-trump-assassination-florida-golf-club-2600348-2024-09-16",
      "headline": "Biden on Trump's 'attempted assassination': No place for political violence in USIn a statement, Joe Biden said that he was relieved to know that Donald Trump was unharmed in the possible \"assassination attempt\", adding that federal law enforcement agencies have launched an investigation into the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/76th-emmy-awards-full-winners-list-jeremy-allen-white-liza-colon-win-big-2600347-2024-09-16",
      "headline": "76th Emmy Awards full winners list: Jeremy Allen White, Liza Colon win bigThe 76th Primetime Emmy Awards took place on September 16 (IST) in Los Angeles, hosted by Eugene and Dan Levy. The event featured unexpected wins and notable omissions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-chief-minister-eknath-shinde-assembly-election-date-november-2600345-2024-09-16",
      "headline": "Maharashtra Assembly polls likely by November second week: Eknath ShindeMaharashtra Chief Minister Eknath Shinde stated that the state assembly elections are likely to be held in the second week of November, adding a two-phase election would be preferable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kate-winslet-underwent-testosterone-replacement-therapy-to-feel-sexy-again-2600212-2024-09-15",
      "headline": "Kate Winslet says she underwent testosterone replacement therapy to 'feel sexy again'Kate Winslet disclosed she underwent testosterone replacement therapy to boost her libido. She spoke about it on a podcast. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/elon-musk-post-tweet-spacex-polaris-dawn-mission-crew-safe-return-to-earth-historic-journey-2600353-2024-09-16",
      "headline": "Elon Musk's post after Polaris Dawn returns from historic spacewalk missionSpaceX CEO Elon Musk welcomed the safe return of Polaris Dawn astronauts from their historic five-day  mission by sharing a picture of the four-member crew on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-kc-venugopal-ravneet-bittu-rahul-gandhi-terrorist-remark-sikh-turban-vienna-bjp-2600307-2024-09-15",
      "headline": "Congress slams Union Minister for calling Rahul Gandhi 'No. 1 terrorist'Reacting to Union Minister Ravneet Bittu's comments, Congress general secretary KC Venugopal said that the \"minimum qualification\" to become a minister in the Modi government was to make \"personal attacks\" on Rahul Gandhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/sam-pitroda-was-shocked-too-india-today-reporter-on-assault-by-congress-workers-2600240-2024-09-15",
      "headline": "Sam Pitroda a nice guy, was shocked at my assault: India Today reporterThe chief of Indian Overseas Congress Sam Pitroda apologised to India Today journalist Rohit Sharma after a recent incident in the United States, where members of Leader of the Opposition Rahul Gandhi's team were involved in an attack on Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/photo/jeremy-allen-white-mindy-kaling-andrew-scott-selena-gomez-stars-shine-at-76th-primetime-emmys-2600346-2024-09-16",
      "headline": "Jeremy Allen White to Selena Gomez, stars shine at 76th Primetime EmmysTelevision's premier event kicked off with a star-studded red carpet. Celebrities ranging from Jeremy Allen White to Steve Martin graced the 76th Primetime Emmys with their presence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-on-donald-trump-second-assassination-joe-biden-kamala-harris-2600352-2024-09-16",
      "headline": "No one is even trying to assassinate...: Elon Musk on Trump Florida shooting In a post on X, tech billionaire Elon Musk made a controversial statement targeting the Biden-Harris administration and questioned why no one is trying to assassinate US President Joe Biden and Vice President Kamala Harris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/watch-indian-f2-driver-kush-maini-survives-scary-crash-in-baku-2600318-2024-09-15",
      "headline": "Watch: Indian F2 driver Kush Maini survives scary crash in BakuIndian F2 driver Kush Maini survived a horrifying crash on Sunday, September 15 after he stalled at the starting grid at Azerbaijan. The back end of Maini's car was completely destroyed due to collision."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-ganesh-idol-setup-in-secunderabad-controversy-muslim-ganpati-theme-2600256-2024-09-16",
      "headline": "Ganesh idol setup in Telangana sparks row over 'Muslim-like' appearanceA Ganesh idol setup in Telangana's Secunderabad has sparked a controversy over its theme, with a section on social media calling it a 'Muslim Ganpati'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/from-maruti-suzuki-evx-to-hyundai-creta-ev-and-mahindra-be05-india-set-for-electric-rush-2600336-2024-09-16",
      "headline": "From eVX to Creta EV and BE.05, India set for electric rushThe EV adoption rate is currently very low in the Indian car market, hovering around 2%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-us-presidential-election-republican-gunshots-firing-florida-golf-club-2600339-2024-09-16",
      "headline": "I will never surrender, says Donald Trump after firing near his golf club US presidential candidate Donald Trump assured supporters that he is safe following a gunfight near his Florida golf club and vowed that nothing will stop him or make him surrender."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/mba-student-suicide-seventh-floor-ip-university-delhi-ggsipu-2600314-2024-09-15",
      "headline": "Student jumps off seventh floor of university hostel in DelhiA first-year student died by suicide when he jumped off from the seventh floor of his hostel at Delhi's Guru Gobind Singh Indraprastha University (GGSIPU). No suicide note was found on the spot."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/indore/story/indore-women-rammed-bmw-scooter-wrong-direction-driver-arrested-cctv-footage-2600272-2024-09-15",
      "headline": "2 women killed after BMW coming from wrong direction rams their scooterA speeding BMW rammed a scooter in which two women were riding in Madhya Pradesh's Indore. The victims were rushed to a hospital with serious injuries but died during treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-vignesh-shivan-share-romantic-moment-at-siima-2024-2600355-2024-09-16",
      "headline": "Pics: Nayanthara, Vignesh Shivan share romantic moment at SIIMA 2024Nayanthara and Vignesh Shivan twinned in black at SIIMA 2024, held in Dubai on September 15. The couple shared a romantic moment on stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-navy-globe-circumnavigation-navika-sagar-parikrama-roopa-a-dilna-k-2600285-2024-09-15",
      "headline": "Two female Indian Navy officers to embark on global sailing expeditionThe Navy said that the two officers, Lieutenant Commodore Roopa A and Lieutenant Commodore Dilna K, would embark on the 'extraordinary expedition' as part of the second Navika Sagar Parikrama onboard the INSV Tarini soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-shooting-florida-golf-club-assassination-attempt-2600342-2024-09-16",
      "headline": "Donald Trump was target of apparent assassination attempt in Florida, says FBIDonald Trump survived an attempted assassination at his West Palm Beach golf club, where a gunman armed with an AK-style rifle was apprehended after fleeing the scene, though the former president was unharmed and later assured supporters of his safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/haryana-polls-for-the-congress-why-the-battle-lies-within-2600280-2024-09-15",
      "headline": "Haryana polls: For the Congress, why the battle lies withinThe party aims to leverage Bhupinder Hooda's Jat influence while simultaneously using Kumari Selja to tap the Dalit vote"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-vignesh-shivan-share-romantic-moment-at-siima-2024-2600355-2024-09-16",
      "headline": "Pics: Nayanthara, Vignesh Shivan share romantic moment at SIIMA 2024Nayanthara and Vignesh Shivan twinned in black at SIIMA 2024, held in Dubai on September 15. The couple shared a romantic moment on stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/the-bears-liza-colon-becomes-first-latina-to-win-best-supporting-emmy-76th-primetime-emmy-awards-2600354-2024-09-16",
      "headline": "The Bear's Liza Colon becomes 1st Latina to win Best Supporting EmmyLiza Colon-Zayas' win at the 76th Primetime Emmy Awards represented a major milestone for Latino representation in television. In her speech, she highlighted the importance of voting and underscored themes of representation and advocacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/76th-emmy-awards-full-winners-list-jeremy-allen-white-liza-colon-win-big-2600347-2024-09-16",
      "headline": "76th Emmy Awards full winners list: Jeremy Allen White, Liza Colon win bigThe 76th Primetime Emmy Awards took place on September 16 (IST) in Los Angeles, hosted by Eugene and Dan Levy. The event featured unexpected wins and notable omissions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/photo/jeremy-allen-white-mindy-kaling-andrew-scott-selena-gomez-stars-shine-at-76th-primetime-emmys-2600346-2024-09-16",
      "headline": "Jeremy Allen White to Selena Gomez, stars shine at 76th Primetime EmmysTelevision's premier event kicked off with a star-studded red carpet. Celebrities ranging from Jeremy Allen White to Steve Martin graced the 76th Primetime Emmys with their presence."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jos-buttler-brendon-mccullum-england-cricket-ecb-2600358-2024-09-16",
      "headline": "Jos Buttler excited for Brendon McCullum era in white-ball cricketEngland white-ball captain Jos Buttler is looking forward to working with Brendon McCullum. The Test team head coach was named the boss in all formats earlier in the month of September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/liam-livingstone-eng-vs-aus-t20i-series-old-trafford-manchester-2600356-2024-09-16",
      "headline": "Liam Livingstone wants to continue batting up the order after stellar AUS seriesEngland all-rounder Liam Livingstone has expressed his desire to continue batting up the order after his remarkable performance in the recent T20I series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-womens-t20-world-cup-2024-indias-only-centurion-in-wt20is-2600350-2024-09-16",
      "headline": "Do You Know? Harmanpreet is India's only centurion in WT20 World CupWomen's T20 World Cup: Harmanpreet Kaur notched a hundred against New Zealand at the Providence Stadium in 2018 and helped India win by 34 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-punjab-fc-vs-kerala-blasters-2600334-2024-09-15",
      "headline": "ISL: Punjab FC clinch stoppage-time thriller vs Kerala BlastersTwo stoppage time goals, one each from Kerala Blasters and Punjab FC saw a thrilling finish to the game in the clubs' opener in the Indian Super League on Sunday, September 15. Punjab FC eked out a 2-1 win over Kerala."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ire-vs-eng-england-women-history-landmark-t20i-ireland-2600331-2024-09-15",
      "headline": "England Women make history with landmark T20I against IrelandIRE vs ENG: England Women played their 600th match in limited-overs cricket, but ended up losing by five wickets at the Castle Avenue in Dublin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/phil-salt-enjoying-responsibility-england-t20i-skipper-2600327-2024-09-15",
      "headline": "Phil Salt enjoying 'added responsibility' as England T20I skipperENG vs AUS: Phil Salt said that he enjoyed captaining England in the T20I series against Australia. On Sunday, the Manchester T20I was abadoned due to rain without a ball being bowled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-ban-najmul-shanto-and-co-arrive-in-chennai-2600326-2024-09-15",
      "headline": "IND vs BAN: Najmul Shanto and Co. arrive in ChennaiThe Bangladesh cricket team arrived in Chennai on Sunday, September 15 for their 2-match Test series against India. Bangladesh are coming into the series after their historic Test series win against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-barcelona-vs-girona-highlights-match-report-lamine-yamal-dani-olmo-2600324-2024-09-15",
      "headline": "Barcelona continue LaLiga dominance with 4-1 thrashing of GironaFC Barcelona continued their stellar LaLiga season with a sensational 4-1 win over Girona on Sunday, September 15. Lamine Yamal scored a brace, while Dani Olmo and Pedri were also on the scoresheet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/watch-indian-f2-driver-kush-maini-survives-scary-crash-in-baku-2600318-2024-09-15",
      "headline": "Watch: Indian F2 driver Kush Maini survives scary crash in BakuIndian F2 driver Kush Maini survived a horrifying crash on Sunday, September 15 after he stalled at the starting grid at Azerbaijan. The back end of Maini's car was completely destroyed due to collision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-aus-jos-buttler-open-to-leaving-wicketkeeping-to-improve-captaincy-2600309-2024-09-15",
      "headline": "ENG vs AUS: Jos Buttler open to leaving wicketkeeping to improve captaincyEngland white-ball captain Jos Buttler said that he is open to leaving wicketkeeping if that helps him captain England better. Buttler, under whom England has played 3 ICC tournaments is currently injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-shahnawaz-dahani-champions-cup-stallions-markhors-2600308-2024-09-15",
      "headline": "Watch: Babar cracks 5 fours in a row in stunning show at Champions CupChampions Cup: Babar Azam hit Shahnawaz Dahani for five fours in a row, but the Stallions lost to Markhors by 126 runs at the Iqbal Stadium in Faisalabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-ban-najmul-shanto-and-co-arrive-in-chennai-2600326-2024-09-15",
      "headline": "IND vs BAN: Najmul Shanto and Co. arrive in ChennaiThe Bangladesh cricket team arrived in Chennai on Sunday, September 15 for their 2-match Test series against India. Bangladesh are coming into the series after their historic Test series win against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-barcelona-vs-girona-highlights-match-report-lamine-yamal-dani-olmo-2600324-2024-09-15",
      "headline": "Barcelona continue LaLiga dominance with 4-1 thrashing of GironaFC Barcelona continued their stellar LaLiga season with a sensational 4-1 win over Girona on Sunday, September 15. Lamine Yamal scored a brace, while Dani Olmo and Pedri were also on the scoresheet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/watch-indian-f2-driver-kush-maini-survives-scary-crash-in-baku-2600318-2024-09-15",
      "headline": "Watch: Indian F2 driver Kush Maini survives scary crash in BakuIndian F2 driver Kush Maini survived a horrifying crash on Sunday, September 15 after he stalled at the starting grid at Azerbaijan. The back end of Maini's car was completely destroyed due to collision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-aus-jos-buttler-open-to-leaving-wicketkeeping-to-improve-captaincy-2600309-2024-09-15",
      "headline": "ENG vs AUS: Jos Buttler open to leaving wicketkeeping to improve captaincyEngland white-ball captain Jos Buttler said that he is open to leaving wicketkeeping if that helps him captain England better. Buttler, under whom England has played 3 ICC tournaments is currently injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-shahnawaz-dahani-champions-cup-stallions-markhors-2600308-2024-09-15",
      "headline": "Watch: Babar cracks 5 fours in a row in stunning show at Champions CupChampions Cup: Babar Azam hit Shahnawaz Dahani for five fours in a row, but the Stallions lost to Markhors by 126 runs at the Iqbal Stadium in Faisalabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/manchester-t20i-rain-spoilsport-england-australia-2600304-2024-09-15",
      "headline": "Rain plays spoilsport in Manchester as T20I series ends at 1-1ENG vs AUS: The third and final T20I at the Old Trafford in Manchester was abandoned without a ball being bowled. The focus now shifts to the ODIs, starting September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-arsenal-vs-tottenham-hotspur-north-london-derby-gabriel-magalhaes-2600292-2024-09-15",
      "headline": "Gabriel gives Arsenal 1-0 win over fireless Tottenham HotspurGabriel Magalhaes's header secured a 1-0 victory for Arsenal over Tottenham in a quiet North London derby, keeping the Gunners second in the Premier League table, while Spurs suffered their third home derby defeat under Ange Postecoglou."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-najmul-shanto-chennai-2600293-2024-09-15",
      "headline": "Watch: Bangladesh team arrives in Chennai for Test series against IndiaThe Bangladesh cricket team arrived in India on Sunday, September 15 for their 2-match Test series against India. The team posted a video of their arrival via their social media accounts.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-one-azerbaijan-grand-prix-oscar-piastri-mclaren-charles-leclerc-ferrari-2600265-2024-09-15",
      "headline": "Oscar Piastri beats Charles Leclerc to win Azerbaijan Grand PrixOscar Piastri's Azerbaijan Grand Prix win pushed McLaren to the top of the constructors' standings, 20 points ahead of Red Bull. The race concluded with a virtual safety car after a collision between Carlos Sainz and Sergio Perez."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/davis-cup-india-sweden-n-sriram-balaji-ramkumar-ramanathan-results-2600262-2024-09-15",
      "headline": "India slump to sixth straight defeat against Sweden, go down 4-0 Davis Cup 2024: India lost 4-0 to Sweden in the World Group 1. India conceded the tie after N Sriram Balaji and Ramkumar Ramanathan could not win their doubles match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/watch-formula-1-sergio-perez-carlos-sainz-crash-in-final-moments-of-baku-gp-2600261-2024-09-15",
      "headline": "Watch: Sergio Perez, Carlos Sainz crash in final moments of Baku GPFormula 1: Sergio Perez and Carlos Sainz crashed into the final moments of the Azerbaijan GP on Sunday, September 15. Perez and Sainz, who were racing at 3-4 finished the race without any points.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-virat-kohli-breaks-chepauk-wall-during-practice-session-in-chennai-2600258-2024-09-15",
      "headline": "Virat Kohli breaks Chepauk wall during practice session in ChennaiSenior India batter Virat Kohli broke a part of the wall in Chepak during the practice session on Sunday, September 15. One of Kohli's shots crashed into the wall near the dressing rooms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-india-vs-korea-semi-final-live-streaming-channel-2600254-2024-09-15",
      "headline": "India vs Korea, Asian Champions Trophy semi-final: All you need to knowIndia will face Korea in the Asian Champions Trophy semi-final on September 16, aiming to maintain their unbeaten run. Defending champions India have dominated throughout the tournament, while Korea, fueled by a confident draw, seeks redemption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/davis-cup-india-sweden-n-sriram-balaji-ramkumar-ramanathan-results-2600262-2024-09-15",
      "headline": "India slump to sixth straight defeat against Sweden, go down 4-0 Davis Cup 2024: India lost 4-0 to Sweden in the World Group 1. India conceded the tie after N Sriram Balaji and Ramkumar Ramanathan could not win their doubles match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/watch-formula-1-sergio-perez-carlos-sainz-crash-in-final-moments-of-baku-gp-2600261-2024-09-15",
      "headline": "Watch: Sergio Perez, Carlos Sainz crash in final moments of Baku GPFormula 1: Sergio Perez and Carlos Sainz crashed into the final moments of the Azerbaijan GP on Sunday, September 15. Perez and Sainz, who were racing at 3-4 finished the race without any points.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-virat-kohli-breaks-chepauk-wall-during-practice-session-in-chennai-2600258-2024-09-15",
      "headline": "Virat Kohli breaks Chepauk wall during practice session in ChennaiSenior India batter Virat Kohli broke a part of the wall in Chepak during the practice session on Sunday, September 15. One of Kohli's shots crashed into the wall near the dressing rooms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-india-vs-korea-semi-final-live-streaming-channel-2600254-2024-09-15",
      "headline": "India vs Korea, Asian Champions Trophy semi-final: All you need to knowIndia will face Korea in the Asian Champions Trophy semi-final on September 16, aiming to maintain their unbeaten run. Defending champions India have dominated throughout the tournament, while Korea, fueled by a confident draw, seeks redemption."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/jos-buttler-ruled-out-australia-odis-harry-brook-england-captain-2600249-2024-09-15",
      "headline": "Jos Buttler ruled out of Australia ODIs, Harry Brook named captain    ENG vs AUS: Harry Brook will lead the England ODI squad for their upcoming series against Australia after Jos Buttler was ruled out due to a calf injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shams-mulani-duleep-trophy-india-a-vs-d-2600248-2024-09-15",
      "headline": "Veteran Shams Mulani credits experience behind all-round show in Duleep TrophyIndia A beat India D in the second round of the Duleep Trophy on Sunday, September 15. Shams Mulani was named the player of the match for his all-round show with bat and ball.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/inspired-daughter-kainat-imtiaz-saleema-imtiaz-umpire-pakistan-cricket-2600237-2024-09-15",
      "headline": "Inspired by daughter, Saleema Imtiaz breaks new ground in Pakistan cricketPakistan cricketer Kainat Imtiaz's mother Saleema became the first Pakistani female umpire to be included in the ICC International Development Panel of Umpires. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-nottingham-forest-vs-liverpool-anfield-2600224-2024-09-15",
      "headline": "Many of the fans were not even born in 1969: Nottingham coach after Anfield winNottingham Forest manager Nuno Espirito Santo said that he was proud of the team's victory against Liverpool. Forest beat Liverpool at Anfield for the first time in 55 years."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}