{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/luxury-evs-may-get-costlier-as-tax-panel-proposes-steep-gst-hike-report-2780736-2025-09-02",
      "headline": "Luxury EVs may get costlier as tax panel proposes steep GST hike: ReportThe proposal, if approved, would hit global brands such as Tesla, Mercedes-Benz, BMW and BYD the hardest, just as they ramp up their India play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-climate-change-is-driving-up-indias-food-prices-2780716-2025-09-02",
      "headline": "How extreme weather is driving up India's food pricesExperts warn that climate change is making such weather events more frequent, leading to higher volatility in vegetable prices and overall food inflation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-206-points-nifty-below-24600-dr-reddys-mm-among-top-losers-2780710-2025-09-02",
      "headline": "Sensex, Nifty end in red as financial stocks fall; all eyes on GST Council meetThe S&P BSE Sensex was down 206.61 points to 80,157.88 at the closing bell, while the NSE Nifty50 settled 45.45 points lower at 24,579.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-much-should-you-save-in-an-emergency-fund-here-is-the-answer-2780690-2025-09-02",
      "headline": "How much should you save in an emergency fund? Here's the answerWhen crisis knocks, credit cards and loans only add stress. An emergency fund keeps you afloat without debt. The tricky part is figuring out how much you should save. Let's break it down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/brass-city-in-crisis-us-tariff-threatens-livelihoods-of-over-2-lakh-artisans-in-moradabad-2780605-2025-09-02",
      "headline": "Brass city in crisis: Jobs of over 2 lakh Moradabad artisans at risk from US tariffsUS tariffs have struck Moradabad's export-reliant brass industry, freezing shipments, cutting jobs, and throwing the livelihoods of thousands of artisans and workers into immediate jeopardy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-in-trade-talks-with-us-says-piyush-goyal-day-after-modi-meets-xi-putin-sco-summit-tianjin-china-trump-tariffs-2780601-2025-09-02",
      "headline": "India in trade talks with US: Piyush Goyal after Trump's 'one-sided disaster' jibeCommerce Minister Piyush Goyal on Tuesday said India is holding talks with the United States on a bilateral trade agreement, day after Trump called ties with India \"one-sided diaster\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-to-take-a-loan-against-mutual-fund-follow-these-steps-2780584-2025-09-02",
      "headline": "How to take a loan against mutual fund? Follow these stepsNeed quick cash but don't want to sell your mutual funds? You can now take a loan against your investments and get instant funds while keeping your portfolio intact. Here's how."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-salaried-employees-change-tax-regimes-while-filing-itr-old-and-new-tax-regime-2780547-2025-09-02",
      "headline": "Can salaried employees change tax regimes while filing ITR?As tax season nears, a common question among employees is whether they can switch from the old tax regime to the new one, or vice versa, while filing their ITR. Understanding the rules can help maximise tax savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/earnings-from-online-gaming-here-is-how-to-file-itr-2780517-2025-09-02",
      "headline": "Earnings from online gaming? Here's how to file ITRThe September 15 ITR deadline is around the corner, and if you earned money from online games like fantasy cricket, rummy, or poker in FY25, it's time to report your winnings to the tax department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-issues-new-rules-for-intraday-derivatives-trading-check-details-2780496-2025-09-02",
      "headline": "Sebi sets new intraday limits for equity derivatives from October 1. Details hereThe move comes after Sebi's action against US-based high-frequency trading firm Jane Street for using strategies deemed manipulative and harmful to retail investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-real-estate-developers-eye-big-sales-as-debt-hits-historic-low-2780470-2025-09-02",
      "headline": "Top real estate developers eye Rs 1.5 lakh crore sales as debt hits historic lowFresh data from ANAROCK Research shows that the top 10 listed players have already achieved nearly 30% (Rs 44,317 crore) of their combined Rs 1.49 lakh crore pre-sales target for FY26 in just the first quarter. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-200-points-nifty-above-24600-reliance-gains-over-1-2780452-2025-09-02",
      "headline": "Sensex, Nifty open higher ahead of GST Council meet as investors eye major tax cutsThe S&P BSE Sensex gained around 200 points in early trade, while the NSE Nifty50 hovered above 24,600. Broader markets mirrored the upbeat sentiment, extending gains from the previous session."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokesh-kanagaraj-addresses-rajinikanth-coolie-box-office-run-audience-hype-2780740-2025-09-02",
      "headline": "Lokesh Kanagaraj addresses Rajinikanth's Coolie box office run, audience hypeDirector Lokesh Kanagaraj addresses the underperformance of his film Coolie, describing the challenges of audience expectations and the film's global reception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pranit-more-veer-pahariya-controversy-not-the-reason-to-do-bigg-boss-2780741-2025-09-02",
      "headline": "Pranit More on Veer Pahariya controversy: Not the reason to do Bigg BossIn an exclusive interaction with India Today, comedian Pranit More addressed his controversy around Veer Pahariya. He stated that the row was not the reason behind his 'Bigg Boss 19' entry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-makers-apology-to-remove-dialogue-demeaning-bengaluru-women-2780733-2025-09-02",
      "headline": "Lokah makers apologise, to remove dialogue demeaning Bengaluru womenDulquer Salmaan's Wayfarer Films issued an apology to the people of Karnataka over a dialogue demeaning Bengaluru women in 'Lokah Chapter 1: Chandra'. They also promised to remove the dialogue and expressed regret."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suris-saiyaara-holds-strong-with-rs-581-crore-collection-amid-big-releases-2780626-2025-09-02",
      "headline": "Mohit Suri's Saiyaara holds strong with Rs 581 crore collection amid big releasesMohit Suri's 'Saiyaara', starring Ahaan Panday and Aneet Padda, has emerged as a box office sensation, grossing Rs 581 crore worldwide in seven weeks. Despite competition from big releases, the romantic musical continues its strong run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jackson-wang-kicks-off-magic-man-2-tour-india-stop-in-talks-2780711-2025-09-02",
      "headline": "Jackson Wang kicks off sold-out Magic Man 2 World Tour, eyes India stop in 2026Singer Jackson Wang is launching his 'Magic Man 2' World Tour starting with sold-out shows in Bangkok. Fans in India await confirmation of his first-ever concert in the country, highlighting growing demand and excitement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-recalls-meeting-filmmaker-woody-allen-like-a-dream-come-true-2780654-2025-09-02",
      "headline": "Anupam Kher recalls meeting filmmaker Woody Allen: Like a dream come trueAnupam Kher recalled his once-in-a-lifetime experience of working with Woody Allen in the 2010 film 'You Will Meet a Tall Dark Stranger'. The actor shared how he cleverly managed to meet the reclusive filmmaker and their amusing first conversation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/nagma-mirajkar-gauahar-khan-advice-bigg-boss-19-2780597-2025-09-02",
      "headline": "Nagma Mirajkar reveals why Gauahar did not give her any advice before Bigg Boss 19Influencer Nagma Mirajkar shared the conversation she had with 'Bigg Boss 7' winner Gauahar Khan before entering the reality show this year. She also shared that participating in the show with her boyfriend, Awez Darbar, was unplanned. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-dubai-reel-sparks-dating-rumours-raj-nidimoru-2780660-2025-09-02",
      "headline": "Did Samantha hold Raj Nidimoru's hands in Dubai reel? Fans hint at soft launchSamantha Ruth Prabhu's latest Instagram reel sparked new rounds of speculation of a romantic link with filmmaker Raj Nidimoru. She gave a glimpse of her work day in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/athiya-shetty-kl-rahul-grih-pravesh-puja-new-home-2780524-2025-09-02",
      "headline": "Athiya Shetty and KL Rahul perform Grih Pravesh puja, photo goes viralCelebrity couple Athiya Shetty and KL Rahul marked a new milestone by performing a grih pravesh puja at their new home. They welcomed a baby girl named Evaarah in March."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shraddha-kapoor-linkedin-profile-delights-fans-worst-barista-bagel-boston-2780643-2025-09-02",
      "headline": "Worst barista to bagel pro: Shraddha Kapoor's LinkedIn profile delights fansShraddha Kapoor's LinkedIn profile, detailing her journey from part-time jobs in Boston to co-founding a jewellery brand, has captured widespread attention online. Her honest and relatable posts have sparked both amusement and admiration from fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/esha-deol-and-bharat-takhtani-divorce-leaves-dharmendra-sad-2780569-2025-09-02",
      "headline": "Dharmendra wanted Esha Deol and Bharat to reconsider divorce: ReportEsha Deol and Bharat Takhtani ended their 11-year marriage in February 2024, calling it a mutual and amicable decision. Reports claimed Dharmendra was saddened by the separation and hoped the couple would reconsider for the sake of their children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dances-with-wolves-actor-graham-greene-dies-at-age-73-2780632-2025-09-02",
      "headline": "Dances with Wolves actor Graham Greene dies at 73Canadian actor Graham Greene, who received an Academy Award nomination for his role in the 1990 film 'Dances with Wolves', has died at the age of 73."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-chapter-1-chandra-outperformed-mohanlal-film-malayalm-superhero-film-2780596-2025-09-02",
      "headline": "How Malayalam's first female superhero film Lokah outperformed Mohanlal's film'Lokah Chapter 1: Chandra' marks a revolutionary moment in Indian cinema as the first female superhero film that outperforms Mohanlal's 'Hridayapoorvam'. Blending Western superhero themes with Indian folklore, it sets a new standard for storytelling in Malayalam cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-runarounds-review-jonas-pate-teen-band-drama-hits-some-flat-notes-2780558-2025-09-02",
      "headline": "The Runarounds review: Jonas Pate's teen band drama hits some flat notesRelease Date:Mon Sep 01, 2025The Runarounds series review: 'Outer Banks' director Jonas Pate's new young adult music drama 'The Runarounds' is about a real band chasing stardom. From celebrity lookalikes to catchy original songs and chaotic storytelling, here's whether the teen coming-of-age series is worth your time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/raj-kundra-punjabi-film-debut-mehar-release-date-cast-2780587-2025-09-02",
      "headline": "Raj Kundra gears up for Punjabi debut film Mehar. Check out trailer, release dateRaj Kundra is making his Punjabi cinema debut with the film 'Mehar', portraying Karamjeet Singh in a heartfelt story of family and resilience. The movie, releasing on September 5, 2025, co-stars Geeta Basra in a pivotal role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/manish-malhotra-bun-tikki-saali-mohabbat-chicago-south-asian-film-festival-2025-2780573-2025-09-02",
      "headline": "Manish Malhotra's Bun Tikki, Saali Mohabbat chosen for Chicago film festivalManish Malhotra's 'Bun Tikki' and 'Saali Mohabbat' have been selected for the Chicago South Asian Film Festival 2025. The fashion icon-turned-producer celebrated the milestone on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/demon-slayer-star-takahiro-sakurai-shares-his-love-for-rajinikanth-rrr-2780527-2025-09-02",
      "headline": "Rajinikanth has a presence I can't dub, says Demon Slayer star Takahiro SakuraiJapanese voice actor Takahiro Sakurai expressed his admiration for Indian superstar Rajinikanth and praised Indian films like 'RRR' and 'Baahubali' for their global appeal. 'Demon Slayer: Infinity Castle Part 1' releases in India on September 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/film-producers-body-slams-influencers-for-extortion-over-negative-reviews-iftpc-2780531-2025-09-02",
      "headline": "Film producers' body slams influencers for extortion over negative reviewsThe Indian Film and Television Producers Council (IFTPC) has accused some social media influencers of extorting producers by demanding money to avoid negative reviews."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-urges-mamata-banerjee-not-to-ban-the-bengal-files-2780495-2025-09-02",
      "headline": "Vivek Agnihotri urges Mamata Banerjee not to ban The Bengal FilesFilmmaker Vivek Agnihotri requested West Bengal CM Mamata Banerjee to permit the release of 'The Bengal Files' in the state. The film is slated for a theatrical release on September 5."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/sharjeel-imam-umar-khalid-bail-denied-2020-delhi-riots-7-accused-high-court-2780682-2025-09-02",
      "headline": "No bail for Umar Khalid, Sharjeel Imam, 7 others in 2020 Delhi riots caseImam and Khalid were accused of being part of a larger conspiracy that led to the communal violence in northeast Delhi. The violence left over 50 dead and hundreds injured."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/kcr-daughter-k-kavitha-suspended-from-brs-days-after-comments-against-party-2780653-2025-09-02",
      "headline": "KCR suspends daughter K Kavitha from BRS over remarks against partyBRS on Tuesday suspended K Kavitha with immediate effect for alleged anti-party activities, a day after she blamed her cousins, ex-irrigation minister T Harish Rao and former MP J Santosh Rao, for investigation against her father KCR."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/my-dead-mother-abused-from-rjd-congress-stage-an-insult-to-nations-mothers-daughters-pm-modi-2780604-2025-09-02",
      "headline": "Nation's mothers insulted: PM tears into RJD-Congress over abuse to dead motherPrime Minister Narendra Modi on Tuesday attacked the RJD and Congress for hurling expletives at him and his late mother during a rally in Bihar, calling the incident an insult to all women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/mood-of-the-nation-three-alarm-bells-nda-should-be-worried-about-2780613-2025-09-02",
      "headline": "Mood of the Nation: Three alarm bells NDA should be worried aboutThe latest Mood of the Nation survey signals rising voter anger over the economy, inequality, and corruption, posing a looming challenge for the NDA despite welfare schemes and past electoral successes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/shanghai-cooperation-organisation-sco-china-boost-trump-tariffs-quad-struggles-relevance-2780614-2025-09-02",
      "headline": "Trump has given SCO a renewed purpose. Quad stands defangedVisuals of leaders of some of the most populous and influential countries posing for photographs and engaging in candid conversations at the SCO summit in Xi Jinping's backyard were bound to rattle the US. Not too long ago, China found itself in a similar situation, fretting over the re-emergence of the Quad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-strict-foreigners-illegal-migrants-new-rules-home-ministry-empower-immigration-bureau-aliens-fake-visa-passport-2780644-2025-09-02",
      "headline": "India gets strict foreigners rules, Immigration Bureau to deport illegal aliensIndia has enacted the Immigration and Foreigners Act, 2025, which aims to tighten passport and visa rules. The new law has also armed the Bureau of Immigration with enhanced powers to track, detain and deport illegal migrants. Illegal immigration is not just a security risk, but a drain on Indian resources."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/aap-mlas-mps-donate-one-month-salary-punjab-flood-relief-kejriwal-appeals-national-support-2780720-2025-09-02",
      "headline": "AAP MLAs, MPs to donate 1-month salary for Punjab flood relief: Arvind KejriwalArvind Kejriwal, in a video message posted on X, urged all political parties and the central government to provide aid to the people of Punjab who have been affected by the floods in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/what-is-vikram-32-bit-chip-presented-to-pm-modi-at-semicon-india-2025-2780582-2025-09-02",
      "headline": "First Made-in-India chip presented to PM Modi: What is Vikram-32?The initial lot of Vikram 3201 devices was successfully validated in space during the PSLV-C60 mission, demonstrating its reliability for future space missions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-chapter-1-chandra-outperformed-mohanlal-film-malayalm-superhero-film-2780596-2025-09-02",
      "headline": "How Malayalam's first female superhero film Lokah outperformed Mohanlal's film'Lokah Chapter 1: Chandra' marks a revolutionary moment in Indian cinema as the first female superhero film that outperforms Mohanlal's 'Hridayapoorvam'. Blending Western superhero themes with Indian folklore, it sets a new standard for storytelling in Malayalam cinema."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manoj-jarange-maratha-quota-protest-azad-maidan-clean-up-bmc-police-notice-protesters-vacate-site-hunger-strike-2780461-2025-09-02",
      "headline": "Cases against Maratha quota protesters to be withdrawn, says Manoj JarangeThe Bombay High Court ordered Maratha quota protestors to vacate Mumbai streets by Tuesday noon. Following this, the civic body said it conducted a \"deep cleaning\" drive at Azad Maidan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/toppers-skip-the-new-iits-old-iits-rule-2780534-2025-09-02",
      "headline": "9 IITs see no admissions from top 2,000 rankers: Why are toppers skipping themThe Joint Implementation Committee's (JIC) 2025 seat allotment data based on JEE Advanced shows most of the best scorers choose only a handful of older IITs. Nine IITs have no admits inside rank 2,000. Government is expanding seats, but quality and placements decide long-term value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/death-toll-in-september-1-afghanistan-earthquake-rises-to-1411-over-300-injured-2780727-2025-09-02",
      "headline": "Death toll in September 1 Afghanistan earthquake rises to 1,411, over 3,000 injuredTaliban spokesperson Zabihullah Mujahid confirmed in a post on X that the tremors, the strongest of which measured magnitude 6.0, also destroyed more than 5,400 houses, leaving thousands of families homeless in the hardest-hit areas.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/brass-city-in-crisis-us-tariff-threatens-livelihoods-of-over-2-lakh-artisans-in-moradabad-2780605-2025-09-02",
      "headline": "Brass city in crisis: Jobs of over 2 lakh Moradabad artisans at risk from US tariffsUS tariffs have struck Moradabad's export-reliant brass industry, freezing shipments, cutting jobs, and throwing the livelihoods of thousands of artisans and workers into immediate jeopardy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pawan-khera-dual-epic-numbers-voter-ids-delhi-amit-malviya-vote-chori-charge-2780460-2025-09-02",
      "headline": "BJP's big claim against Pawan Khera after Rahul Gandhi's 'hydrogen bomb' remarkThe EPIC details shared by Amit Malviya on X show that Congress spokesperson Pawan Khera is registered as a voter in two Assembly constituencies in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aap-mla-harmeet-pathanmajra-escapes-punjab-police-custody-rape-charges-open-fire-on-cops-2780516-2025-09-02",
      "headline": "Rebel AAP MLA, arrested for rape, flees from custody after opening fire on copsPunjab AAP legislator Harmeet Singh Pathanmajra, arrested on rape and cheating charges, escaped police custody in Karnal after allegedly firing at officers and running over a policeman with a vehicle. Police teams are pursuing him, and a manhunt is underway."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/north-india-heavy-rain-waterlogging-flood-warning-yamuna-danger-mark-forecast-deaths-flights-punjab-delhi-uttarakhand-jammu-kashmir-2780502-2025-09-02",
      "headline": "Rain paralyses north India, dozens dead, key roads flooded, houses washed awayThe water level of the River Yamuna breached the danger mark on Tuesday morning as Delhi-NCR tackled the aftermath of relentless rain with floodwaters entering people's homes. In Punjab, meanwhile, several people died in the \"worst flood in recent history\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejashwi-yadav-dances-with-youth-patna-marine-drive-voter-adhikar-yatra-2780633-2025-09-02",
      "headline": "Dance, tea and reels: Tejashwi Yadav's night out with nephew after Bihar marchAfter concluding the Voter Adhikar Yatra, Tejashwi Yadav shared a light moment dancing with youngsters in Patna. This reflects his effort to connect with youth amid a charged political atmosphere in Bihar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/latest-auto-news/story/teslas-india-sales-fall-short-of-expectations-with-600-orders-report-2780657-2025-09-02",
      "headline": "Tesla's India sales fall short of expectations with 600 orders: ReportTesla's India debut has hit a slow start, with just over 600 Model Y orders since July launch, according to reports, falling short of expectations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/dharmasthala-mass-burial-claims-ed-case-whistleblower-karnataka-foreign-funding-2780570-2025-09-02",
      "headline": "ED to probe alleged Dharmasthala conspiracy, NGOs under foreign funds scannerThe Enforcement Directorate is set to probe the Dharmasthala mass burial case after receiving documents from police. The focus is on NGOs Odanadi and Samvada for alleged foreign funding violations. Banks have been asked to share account details and transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-floods-rain-hoshiarpur-aap-bhagwant-mann-pm-modi-relief-rescue-funds-2780436-2025-09-02",
      "headline": "Punjab floods may worsen: Bhagwant Mann as 29 dead, thousands lose homes in a weekPunjab Flood: Fresh rains on Monday worsened flooding in already affected areas in Punjab. Such was the severity of the crisis that PM Modi, on his return from China, called up Bhagwant Mann to take stock of the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/what-is-buying-luxury-on-emi-doing-to-gen-z-and-millennials-2780106-2025-09-02",
      "headline": "What is buying luxury on EMI doing to Gen Z and millennials?Been eyeing those expensive shoes for a while? Luxury isn't as far away as it once seemed. Today, even high-priced items can be yours by breaking them into small EMIs that fit into your monthly budget. And that's exactly what Gen Z and millennials are doing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/grammar-vocabulary/story/common-grammar-mistakes-people-make-and-how-to-correct-them-2780702-2025-09-02",
      "headline": "The grammar rules you break every day (without realising it)Many people unknowingly make common grammar mistakes in daily conversations. Understanding these errors can improve clarity and communication skills"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-gdp-growth-challenges-economic-selfishness-pm-narendra-modi-us-president-donald-trump-tariffs-veiled-dig-2780594-2025-09-02",
      "headline": "7.8% growth despite challenges from economic selfishness: PM's veiled dig at TrumpPrime Minister Narendra Modi took a veiled dig at US President Donald Trump amid the latter's tariffs as he praised India's 7.8 per cent GDP growth in the first quarter of the current fiscal year amid challenges posed by \"economic selfishness\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/tiny-indian-computer-credit-card-sized-to-catch-faint-signals-from-early-universe-2780707-2025-09-02",
      "headline": "Credit-card-sized Indian computer to unlock secrets of the universePRATUSH is a space payload concept that envisions orbiting the Moon's far side, the quietest radio environment in the inner Solar System, free from Earth's radio noise and ionospheric distortions. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-chirag-shetty-bwf-world-championships-2780737-2025-09-02",
      "headline": "Special to be in company of Saina and Sindhu: Chirag ShettySatwiksairaj Rankireddy and Chirag Shetty won their second BWF World Championship medal in 2025. Chirag, speaking to PTI relished the fact they were in the elite company of PV Sindhu and Saina Nehwal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-bans-dream11-crypto-from-jersey-sponsorship-rights-ad-2780679-2025-09-02",
      "headline": "Crypto, online money gaming firms barred from BCCI sponsorship raceThe Indian Cricket Board (BCCI) floated the advertisement for lead sponsorship rights on Tuesday, September 2. The body explicitly mentioned that all companies were not allowed to apply as the jersey sponsor of the Indian team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brad-haddin-reaction-indian-cricket-sunil-gavaskar-criticism-2780668-2025-09-02",
      "headline": "After Gavaskar criticism, Haddin defends his stance on Shreyas's Asia Cup snubFormer Australia wicketkeeper Brad Haddin has responded to Sunil Gavaskar after the former Indian great criticised overseas cricketers for commenting on Indian cricket matters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-bcci-advertisement-india-cricekt-lead-sponsor-dream-11-2780667-2025-09-02",
      "headline": "After Dream11 exit, BCCI invites bids for lead sponsor; deadline September 16The BCCI invited bids for Team India's lead sponsorship rights. The Indian cricket banned applications from real-money gaming platforms and crypto companies in the aftermath of the recently-passed online gaming bill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/erik-ten-hag-reaction-bayer-leverkusen-shock-exit-two-matches-2780638-2025-09-02",
      "headline": "Erik ten Hag shocked as Leverkusen sack him after two matchesErik ten Hag said Bayer Leverkusen's decision to dismiss him after just two Bundesliga matches in charge came as a complete surprise, adding that the club's hierarchy had not shown him sufficient trust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-2025-china-mens-hockey-rise-india-favourites-roelant-oltmans-2780647-2025-09-02",
      "headline": "Chinese revolution: Why China could be India's biggest threat to Asia Cup gloryThe China men's hockey team continues to make heads turn with their gritty and determined performances across the turf. With an all-round attack and rugged defence, are the Chinese side India's biggest threat to Asia Cup glory?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/hockey-asia-cup-china-coach-exclusive-interview-2780618-2025-09-02",
      "headline": "China are improving, but India clear favourites to win Asia Cup: Roelant OltmansFormer India coach and current China assistant coach Roelant Oltmans feels that India are the clear favourites to win the Asia Cup in Rajgir. Oltmans feels that the rise of the Chinese men's team was inevitable and they're building towards LA Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/paddy-upton-exclusive-hockey-asia-cup-virat-kohli-2780634-2025-09-02",
      "headline": "Only Virat Kohli can last half of hockey team's training session: Paddy UptonHockey Asia Cup 2025: Mental conditioning coach Paddy Upton, speaking to India Today, discussed his latest stint with the senior men's hockey team. Upton, who worked with the Indian cricket team in the past, talked up the fitness levels of the Hamanpreet Singh-led hockey team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/hockey-asia-cup-daily-digest-india-make-it-3-out-of-3-as-forwards-finally-click-2780595-2025-09-02",
      "headline": "Hockey Asia Cup daily digest: India make it 3 out of 3 as forwards finally clickIndia produced a statement performance to dismantle Kazakhstan 15-0 to end the pool phase with a 100 percent win record. Ahead of the crucial Super 4s stage, the Indian forwards finally found their groove with field goals finally coming for the hosts in Rajgir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pujara-retires-shubman-gill-joe-root-avoid-no-3-old-school-test-batting-2780574-2025-09-02",
      "headline": "Shubman Gill, Joe Root are reluctant to bat at No. 3, says Nasser HussainNasser Hussain stated that with Cheteshwar Pujara's retirement, the game has lost a one-of-a-kind old-school batter. He added that Shubman Gill and Joe Root are reluctant to take on the challenging No. 3 position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-floods-shubman-gill-mourns-victims-stars-aid-relief-2780559-2025-09-02",
      "headline": "Shubman Gill heartbroken by devastation in Punjab due to floods: We will rise upShubman Gill took to social media to mourn the loss of lives and devastation due to floods in Punjab. The Test captain is in Bengaluru, preparing for Asia Cup 2025, starting September 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/hockey-asia-cup-china-coach-exclusive-interview-2780618-2025-09-02",
      "headline": "China are improving, but India clear favourites to win Asia Cup: Roelant OltmansFormer India coach and current China assistant coach Roelant Oltmans feels that India are the clear favourites to win the Asia Cup in Rajgir. Oltmans feels that the rise of the Chinese men's team was inevitable and they're building towards LA Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/paddy-upton-exclusive-hockey-asia-cup-virat-kohli-2780634-2025-09-02",
      "headline": "Only Virat Kohli can last half of hockey team's training session: Paddy UptonHockey Asia Cup 2025: Mental conditioning coach Paddy Upton, speaking to India Today, discussed his latest stint with the senior men's hockey team. Upton, who worked with the Indian cricket team in the past, talked up the fitness levels of the Hamanpreet Singh-led hockey team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/hockey-asia-cup-daily-digest-india-make-it-3-out-of-3-as-forwards-finally-click-2780595-2025-09-02",
      "headline": "Hockey Asia Cup daily digest: India make it 3 out of 3 as forwards finally clickIndia produced a statement performance to dismantle Kazakhstan 15-0 to end the pool phase with a 100 percent win record. Ahead of the crucial Super 4s stage, the Indian forwards finally found their groove with field goals finally coming for the hosts in Rajgir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pujara-retires-shubman-gill-joe-root-avoid-no-3-old-school-test-batting-2780574-2025-09-02",
      "headline": "Shubman Gill, Joe Root are reluctant to bat at No. 3, says Nasser HussainNasser Hussain stated that with Cheteshwar Pujara's retirement, the game has lost a one-of-a-kind old-school batter. He added that Shubman Gill and Joe Root are reluctant to take on the challenging No. 3 position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-floods-shubman-gill-mourns-victims-stars-aid-relief-2780559-2025-09-02",
      "headline": "Shubman Gill heartbroken by devastation in Punjab due to floods: We will rise upShubman Gill took to social media to mourn the loss of lives and devastation due to floods in Punjab. The Test captain is in Bengaluru, preparing for Asia Cup 2025, starting September 9."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}