{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-is-trumps-big-deal-claim-a-pressure-tactic-experts-weigh-in-2747356-2025-06-27",
      "headline": "India-US trade deal: Is Trump's 'big deal' claim a pressure tactic? Experts weigh inUS President Donald Trump on Thursday announced a trade deal with China on rare earths and hinted at a 'very big' trade agreement with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-rallies-nasdaq-sp-500-record-highs-ai-stocks-fed-policy-recession-fears-ease-2747331-2025-06-27",
      "headline": "Wall Street rallies to record highs as AI stocks soar, recession fears easeUS stock markets hit all-time highs on Friday thanks to an AI boom and Fed hints at looser policy ahead. Trade deals with the UK and China have also fuelled market hopes that a global recession could be avoided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-slashes-fd-and-savings-rates-again-in-june-details-here-2747224-2025-06-27",
      "headline": "HDFC Bank slashes FD and savings rates again in June. Details hereHDFC Bank's latest changes signal that deposit rates could remain soft if the RBI continues its rate-cutting cycle. Depositors should review their plans, stay updated with rate changes, and make informed decisions before booking new FDs or RDs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-may-soon-allow-direct-epf-withdrawals-via-atms-and-upi-2747195-2025-06-27",
      "headline": "EPFO may soon allow direct EPF withdrawals via ATMs and UPIThe EPFO recently increased the auto-settlement limit from Rs 1 lakh to Rs 5 lakh. This means members can get up to Rs 5 lakh cleared automatically within three days for things like medical expenses, education, housing, or marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-300-points-higher-nifty-above-25600-jio-financial-shares-jump-4-2747184-2025-06-27",
      "headline": "Sensex ends 300 points higher, Nifty above 25,600; Jio Financial shares jump 4%The S&P BSE Sensex ended 303.03 points higher at 84,058.90, while the NSE Nifty50 rose 88.80 to settle at 25,637.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/switched-jobs-this-year-here-is-how-to-file-your-itr-right-got-salary-from-two-employers-2747138-2025-06-27",
      "headline": "Switched jobs this year? Here's how to file your ITR rightIf you worked for more than one employer in the same year, make sure to report each salary and related deductions separately in the ITR form. Don't mix them up; each employer's income should be shown in its own section. This helps avoid overlaps and mistakes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-indias-ultra-rich-families-investing-in-2025-2747127-2025-06-27",
      "headline": "Where are India's ultra-rich families investing in 2025?A new EY–Julius Baer report, The Indian Family Office Playbook, reveals that many family offices are moving away from traditional wealth preservation and diving into global markets, private credit, and real assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-45-lakh-for-raising-a-child-why-parenting-feels-like-a-luxury-now-2747066-2025-06-27",
      "headline": "Rs 45 lakh for raising a child? Why parenting feels like a luxury nowRising everyday expenses, pricey education and costly healthcare are forcing many young couples to think twice about kids. According to a startup founder, starting a family is personal, but money has become a key factor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-hc-supports-sbi-decision-cancelling-circle-based-officer-appointment-over-cibil-report-anomalies-bad-credit-score-2747020-2025-06-27",
      "headline": "Madras High Court backs bank appointment cancellation over adverse CIBIL reportThe Madras High Court upheld SBI's decision to cancel a candidate's appointment due to adverse credit history, stressing that financial discipline is essential for roles involving public money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-guarantees-in-mutual-funds-investment-adviser-warns-against-risky-pf-advice-2747011-2025-06-27",
      "headline": "No guarantees in mutual funds: Investment adviser warns against risky PF adviceAn investment adviser explains why PF money should not be used for risky bets like mutual funds with \"guaranteed returns.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-saving-30-percent-of-your-income-is-not-always-possible-ca-explains-2746968-2025-06-27",
      "headline": "Why saving 30% of your income isn't always possible, CA explainsFor those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, explains CA Abhishek Walia. For those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, he says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-in-july-will-sensex-nifty-hit-record-high-explained-2746951-2025-06-27",
      "headline": "Will Sensex and Nifty hit record highs in July? Here's all you need to knowWith domestic flows steady and global risks fading, July could be the moment markets break through resistance. But with key events ahead, will momentum hold or falter?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/video/shefali-jariwala-husband-parag-tyagi-emotional-appeal-2747743-2025-06-28",
      "headline": "Pray for my Pari: Shefali Jariwala's husband Parag Tyagi's emotional appealFollowing the final rites, Shefali Jariwala's husband, Parag Tyagi, appeared visibly distraught. Addressing the paparazzi with folded hands, he urged everyone to pray for his \"Pari.\" Holding back emotion, he said, \"Please pray for her - that wherever she is, she's happy and at peace.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-backs-diljit-dosanjh-amid-sardaar-ji-3-row-2747729-2025-06-28",
      "headline": "Javed Akhtar backs Diljit Dosanjh amid Sardaar Ji 3 row: What can the poor guy doJaved Akhtar defended Diljit Dosanjh amid backlash over 'Sardaar Ji 3', which features Pakistani actor Hania Aamir. He noted the film was shot before recent tensions and urged sensitivity, while advising against such casting in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-death-shreyas-talpade-sunidhi-chauhan-rashami-desai-pay-tribute-2747716-2025-06-28",
      "headline": "Shreyas Talpade, Sunidhi Chauhan, Rashami Desai pay tribute to late ShefaliActor Shefali Jariwala died at the age of 42 at her Mumbai home on Friday night. Celebrities including Shreyas Talpade, Sunidhi Chauhan, Rashami Desai, among others, paid their tributes to her at her home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-cremated-in-mumbai-husband-parag-tyagi-bids-emotional-goodbye-2747684-2025-06-28",
      "headline": "Shefali Jariwala cremated in Mumbai, husband Parag Tyagi bids emotional goodbyeActor-model Shefali Jariwala was cremated at the Oshiwara Crematorium on Saturday. She died of cardiac arrest at 42. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-dies-at-42-old-video-hinting-sudden-death-resurfaces-2747710-2025-06-28",
      "headline": "Shefali Jariwala dies at 42: Old clip hinting at actor's sudden death resurfacesActor Shefali Jariwala died of cardiac arrest at 42, leaving fans and the industry in shock. An old video of her discussing epilepsy and astrological reading about her \"sudden death\" has resurfaced, which has gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-ex-husband-harmeet-singh-brother-in-law-manmeet-singh-meet-bros-mourns-her-death-2747714-2025-06-28",
      "headline": "Absolutely shattered: Shefali Jariwala's ex-husband Harmeet Singh mourns her deathMeet Bros' Harmeet Singh, who is also Shefali Jariwala's ex-husband, mourned her untimely death. Sharing an emotional tribute on social media, the singer reflected on the time they had spent together and extended his heartfelt condolences to her family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-praises-abhishek-bachchan-as-he-completes-25-years-in-film-industry-2747665-2025-06-28",
      "headline": "Amitabh Bachchan praises son Abhishek as he completes 25 years in film industryAmitabh Bachchan celebrated son Abhishek Bachchan's 25 years in Bollywood with a heartfelt post on social media, calling him \"worthy of praise.\" The tribute followed a fan-made video showcasing Abhishek's memorable roles and journey in the industry."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/photo/shefali-jariwala-dies-at-42-sunidhi-chauhan-rashami-desai-and-celebs-pay-tribute-2747679-2025-06-28",
      "headline": "Sunidhi Chauhan, Rashami Desai and celebs pay tribute to Shefali JariwalaActor Shefali Jariwala died at the age of 42 on Friday, June 27. Her funeral will take place today at the Oshiwara Crematorium. After the postmortem, the actor's body was brought to her home, where friends and industry colleagues are arriving to bid her a final goodbye."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/video/shefali-jariwala-mother-sunita-inconsolable-as-she-arrives-at-daughters-residence-2747668-2025-06-28",
      "headline": "Shefali Jariwala's mother inconsolable as she arrives at daughter's residenceTV actor Shefali Jariwala's mother, Sunita, was inconsolable as she arrived at her daughter's residence along with other relatives. The actor died on Friday night at her home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-srikanth-odela-the-paradise-shooting-begins-40-day-schedule-in-hyderabad-2747647-2025-06-28",
      "headline": "Nani begins shooting for Srikanth Odela's The Paradise, 40-day schedule underwayActor Nani and director Srikanth Odela's upcoming film, 'The Paradise', has gone on floors. A 40-day schedule in Hyderabad is currently underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaanta-laga-music-director-harry-anand-on-shefali-jariwala-death-2747632-2025-06-28",
      "headline": "My heart sank: Kaanta Laga music director Harry Anand on Shefali Jariwala's deathMusic director Harry Anand, who launched Shefali Jariwala in Kaanta Laga, expressed deep shock over her sudden death. In an exclusive chat, he recalled their iconic collaboration and the memories they shared from the early 2000s remix era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vidya-balan-slams-pretentious-cinema-says-shah-rukh-khan-romance-worked-because-of-emotion-2747591-2025-06-28",
      "headline": "Vidya Balan slams pretentious cinema, says SRK's romance worked because of emotionActor Vidya Balan criticised the growing disconnect in today's filmmaking, saying many new directors lack an understanding of Indian storytelling. She praised Shah Rukh Khan for winning hearts through emotional scenes, not just his iconic romantic pose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-celebrates-35-years-of-days-of-thunder-supports-brad-pitts-f1-release-2747572-2025-06-28",
      "headline": "Tom Cruise celebrates 35 years of Days of Thunder, supports Brad Pitt's F1 releaseActor Tom Cruise celebrated 35 years of 'Days of Thunder' while sharing a series of nostalgic photos on X. He also supported the release of Brad Pitt's new racing film 'F1'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/video/hindustani-bhau-remembers-shefali-jariwala-phone-nahi-bajega-2747610-2025-06-28",
      "headline": "Emotional Hindustani Bhau remembers Shefali Jariwala: Phone nahi bajegaPopular content creator Hindustani Bhau visited Cooper Hospital where Shefali Jariwala's body was brought for postmortem. While leaving the hospital, he addressed the media and got emotional as he remembered Shefali, who used to tie him Rakhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywood-2025-mid-year-box-office-chhaava-won-sikandar-lost-any-lessons-learnt-2747601-2025-06-28",
      "headline": "Bollywood 2025 mid-year box office: Chhaava won, Sikandar lost - any lessons learnt?The first half of 2025 has been a reality check for Bollywood. While 'Chhaava' emerged as a runaway success, along with 'Sitaare Zameen Par', which is still running in theatres - proving that emotionally grounded storytelling still works, big-ticket spectacles like 'Sikandar' failed to strike a chord with audiences. The question is - has the industry finally started listening, or is it still betting on outdated formulas and star power?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-slams-diljit-dosanjh-in-border-2-2747546-2025-06-28",
      "headline": "Rupali Ganguly slams Diljit Dosanjh, praises Border 2 makers for dropping himRupali Ganguly indirectly criticised Diljit Dosanjh for his involvement in 'Border 2', calling it disheartening and praising the makers for allegedly removing him. However, sources close to the production have denied any plans to replace the actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-latest-picture-fauji-set-leaked-fans-reminded-of-his-look-from-mirchi-2747578-2025-06-28",
      "headline": "Prabhas's pic from his new film Fauji leaked, fans reminded of Mirchi lookA new picture of Prabhas, which appears to be from the sets of his upcoming film, 'Fauji', is doing the rounds on the internet. Excited fans commented that they were reminded of the actor's look from the hit film, 'Mirchi'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-old-clip-goes-viral-2747542-2025-06-28",
      "headline": "Want to be known as Kaanta Laga girl till I die: Shefali Jariwala's old clip goes viralActor Shefali Jariwala became an overnight sensation in the early 2000s after the release of her music video 'Kaanta Laga'. She later appeared in Salman Khan's film 'Mujhse Shaadi Karogi'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/video/shefali-jariwala-husband-parag-tyagi-requests-paps-to-stop-with-folded-hands-2747550-2025-06-28",
      "headline": "Please mat karo: Shefali Jariwala's husband requests paps with folded handsShefali Jariwala reportedly died of a cardiac arrest last night. Her body was brought to Cooper Hospital for postmortem. Shefali's husband, Parag Tyagi, was photographed as he arrived at the hospital. He was seen requesting the media with folded hands. \"Please, mat karo,\" the actor was heard telling the paparazzi."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mahua-moitra-bjp-kolkata-student-rape-case-trinamool-congress-different-it-condemns-misogyny-2747751-2025-06-28",
      "headline": "Misogyny across parties: Mahua Moitra's post throws shade at Trinamool leadersMahua Moitra was referring to a Trinamool Congress statement dissociating from party leaders Kalyan Banerjee and Madan Mitra's controversial comments with regard to the law student's gang-rape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-gang-rape-survivor-medical-report-abrasion-mark-on-neck-no-laceration-woman-body-2747733-2025-06-28",
      "headline": "Marks on neck, chest, assault not ruled out: Kolkata law student's medical reportAccording to the medical report's findings, there was an abrasion mark around the woman's neck, and a few marks on her chest. The report added that there were no lacerations (cuts) on her body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-rejects-pakistan-waziristan-attack-claim-suicide-bombing-killed-injured-hafiz-gul-bahadur-group-2747782-2025-06-29",
      "headline": "Deserves contempt: India rejects Pakistan's claim linking it to Waziristan attackIndia strongly rejected Pakistan's accusation linking it to a deadly suicide bombing in North Waziristan that killed 13 soldiers. The attack was claimed by the Hafiz Gul Bahadur group, amid rising militant violence in Pakistan's border regions.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-college-rape-horror-student-forced-guard-room-cctv-confirms-rape-allegation-trinamool-congress-student-leader-2747799-2025-06-29",
      "headline": "Kolkata law college CCTV shows student being dragged, confirms allegations: CopsThe footage, which also captured moments leading up to the June 25 incident, shows the first-year law student being forced into the guard's room."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-1st-t20i-smriti-mandhana-hundred-shree-charani-trent-bridge-2747757-2025-06-28",
      "headline": "Smriti Mandhana's hundred powers India to statement win over England in 1st T20ISmriti Mandhana's hundred and Shree Charani's sensational bowling effort on debut helped India secure a crushing win over England in the first women's T20I on Saturday, June 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/eric-trump-hints-at-possible-white-house-run-after-fathers-term-glbs-2747779-2025-06-29",
      "headline": "Eric Trump hints at possible White House run after father's termEric Trump hinted at a future presidential run, saying the Trump family could re-enter politics after Donald Trump's second term, despite legal battles and personal tolls from years in the spotlight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/magnitude-55-earthquake-strikes-pakistan-injuries-casualties-glbs-2747788-2025-06-29",
      "headline": "Magnitude 5.5 earthquake strikes PakistanA magnitude 5.5 earthquake hit central Pakistan on Sunday, with the epicentre 149 km west of Multan and a shallow depth of 10 km, according to GFZ and EMSC.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhar-slams-congress-for-addition-of-socialist-secular-words-in-preamble-to-the-constitution-2747699-2025-06-28",
      "headline": "Travesty: Vice President backs call to drop 'secular', 'socialist' from PreambleDhankhar slammed the Congress for including the words 'socialist' 'secular' and 'integrity' in the Preamble to the Constitution during the Emergency, calling it a 'travesty of justice' and 'sacrilege to the spirit of Sanatana'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/asi-ancient-civilisation-rajasthan-human-skeleton-utensils-statues-metal-weapons-bharatpur-2747678-2025-06-28",
      "headline": "Buried for 4,500 years: Rajasthan dig uncovers evidence of lost civilisationThe ASI has discovered a 4,500-year-old civilisation in Rajasthan's Deeg district and unearthed statues, utensils and metal weapons from the Mahabharata era and the Maurya and Shunga dynasties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) SystemThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/utterly-insane-elon-musk-slams-senate-draft-of-trump-big-beautiful-bill-glbs-2747787-2025-06-29",
      "headline": "Utterly insane: Elon Musk renews attack on Trump's 'Big Beautiful Bill'Elon Musk criticised the Senate draft of Trump's 'Big Beautiful Bill' as 'utterly insane, warning it would destroy jobs, harm US strategy, and undermine future-focused industries like clean energy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cloudburst-triggers-flash-floods-in-uttarakhands-uttarkashi-9-missing-2747798-2025-06-29",
      "headline": "9 missing after cloudburst hits Uttarakhand's Uttarkashi, rescue operations onA cloudburst caused severe damage to an under-construction hotel site in Baligarh, where 8-9 workers were reportedly missing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/inside-jeff-bezos-lauren-sanchez-wedding-kim-kardashian-who-wore-what-2747702-2025-06-28",
      "headline": "Inside the star-studded Jeff Bezos and Lauren Sanchez wedding: Who wore whatWhile Jeff Bezos and Lauren Sanchez naturally soaked up most of the spotlight, their A-list guests made sure the fashion meter stayed firmly in the red. Here's a look at what some of the best-dressed guests brought to the aisle-side runway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/bjps-bypoll-reality-check-central-ambitions-need-stronger-local-groundwork-2747580-2025-06-28",
      "headline": "BJP's bypoll reality check: Central ambitions need stronger local groundworkAt a time when every seat is like a mini‑general election, the BJP must rediscover the precision, urgency and resonance that brought it to national dominance\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-cop-slaps-hearing-impaired-elderly-man-speaking-loud-tone-kanpur-2747795-2025-06-29",
      "headline": "UP cop slaps hearing-impaired elderly man for speaking in loud toneA Kanpur policeman slapped and beat a hearing-impaired elderly man during a routine inquiry over a DJ board. The incident, caught on CCTV, went viral and is now under investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-slams-israeli-prosecutors-over-netanyahu-corruption-trial-glbs-2747792-2025-06-29",
      "headline": "Let Bibi go: Trump slams Israeli prosecutors over Netanyahu's corruption trialUS President Donald Trump once again condemned Israeli prosecutors over Prime Minister Netanyahu's corruption trial, calling it a \"witch hunt\" that undermines key negotiations with Hamas and Iran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywood-2025-mid-year-box-office-chhaava-won-sikandar-lost-any-lessons-learnt-2747601-2025-06-28",
      "headline": "Bollywood 2025 mid-year box office: Chhaava won, Sikandar lost - any lessons learnt?The first half of 2025 has been a reality check for Bollywood. While 'Chhaava' emerged as a runaway success, along with 'Sitaare Zameen Par', which is still running in theatres - proving that emotionally grounded storytelling still works, big-ticket spectacles like 'Sikandar' failed to strike a chord with audiences. The question is - has the industry finally started listening, or is it still betting on outdated formulas and star power?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-500-27-06-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-2747764-2025-06-28",
      "headline": "Man objects to wife's affair, she kills him after chilli attack, foot on his neckA woman allegedly killed her 50-year-old husband after he objected to her relationship with her lover in Karnataka's Tumakuru district. The accused threw chilli into the victim's eyes, beat him with a stick and pressed her foot against his neck, killing him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-passenger-abuses-flyer-on-amritsar-delhi-flight-minutes-before-landing-2747731-2025-06-28",
      "headline": "Air India passenger abuses flyer in mid-air drama before flight lands in DelhiA passenger misbehaved and abused another flyer aboard an Air India flight from Amritsar to Delhi minutes before the plane was to land in the national capital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/employee-main-to-jaa-rahi-hoon-mail-stuns-gurugram-ceo-internet-reacts-2747701-2025-06-28",
      "headline": "Employee's 'Main to jaa rahi hoon' mail stuns CEO, delights the InternetA light-hearted leave email with the subject line \"Main to jaa rahi hoon\" left a CEO confused and the internet grinning at its hilarious tone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-expels-uttarakhand-ex-mla-second-marriage-congress-seeks-action-under-ucc-2747785-2025-06-29",
      "headline": "BJP expels Uttarakhand ex-MLA over second marriage, Congress seeks action under UCCThe BJP has expelled ex-MLA Suresh Rathore for six years over a second marriage controversy, prompting Congress to demand legal action under Uttarakhand's Uniform Civil Code. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-cremated-in-mumbai-husband-parag-tyagi-bids-emotional-goodbye-2747684-2025-06-28",
      "headline": "Shefali Jariwala cremated in Mumbai, husband Parag Tyagi bids emotional goodbyeActor-model Shefali Jariwala was cremated at the Oshiwara Crematorium on Saturday. She died of cardiac arrest at 42. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/pm-modi-interacts-with-astronaut-shubhanshu-shukla-who-is-aboard-international-space-station-2747686-2025-06-28",
      "headline": "India looks grand from space, Shubhanshu Shukla tells PM from Space StationPrime Minister Narendra Modi interacted with Group Captain and Axiom-4 mission pilot Shubhanshu Shukla, who scripted history by becoming the first Indian on the International Space Station."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-night-of-champions-2025-full-results-winners-john-cena-cm-punk-riyadh-2747780-2025-06-29",
      "headline": "WWE Night Of Champions results: Cena retains with Rollins' help, new champion crownedJohn Cena retained his WWE Championship thanks to some help from Seth Rollins, while Solo Sikoa became the new US Champion as a debuting superstar came to his aid at Night Of Champions 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ligue-1-paul-pogba-returns-to-professional-football-as-new-as-monaco-signing-2747776-2025-06-29",
      "headline": "Paul Pogba returns to professional football as new AS Monaco signingPaul Pogba has made a return to professional football by becoming a new AS Monaco player on Saturday, June 28. Pogba returns to football after his doping ban has come to an end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/inter-miami-vs-psg-fifa-club-world-cup-lionel-messi-livestreaming-where-to-watch-india-2747765-2025-06-28",
      "headline": "Inter Miami vs PSG, FIFA Club World Cup: Live-streaming in IndiaLionel Messi is set to face former club PSG for the first time since his departure, as Inter Miami take on the reigning European champions in a high-stakes Club World Cup Round of 16 clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-1st-t20i-smriti-mandhana-hundred-shree-charani-trent-bridge-2747757-2025-06-28",
      "headline": "Smriti Mandhana's hundred powers India to statement win over England in 1st T20ISmriti Mandhana's hundred and Shree Charani's sensational bowling effort on debut helped India secure a crushing win over England in the first women's T20I on Saturday, June 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-south-africa-day-1-bulawayo-test-report-lhuan-dre-pretorius-corbin-bosch-century-2747753-2025-06-28",
      "headline": "Centuries from Pretorius, Bosch flip the scrpt for South Africa on Day 1South Africa recovered from a top-order collapse on Day 1 of the first Test against Zimbabwe, thanks to debutant Lhuan-dre Pretorius' stunning 153 and Corbin Bosch's maiden century that powered them past 400."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-harpreet-brar-nets-session-edgbaston-birmingham-test-2747750-2025-06-28",
      "headline": "Watch: Harpreet Brar joins India's nets session ahead of Edgbaston TestPunjab Kings spinner Harpreet Brar was seen bowling at India's nets ahead of the second Test in Birmingham, sparking speculation about changes in India's spin strategy following their defeat in the first Test at Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-aryna-sabalenka-coco-gauff-friends-french-open-comments-2747744-2025-06-28",
      "headline": "Aryna Sabalenka says she has cleared the air with Coco Gauff: We are friendsAryna Sabalenka said that she has cleared the air with Coco Gauff and they're good friends off the court. Sabalenka was slammed for her comments after being beaten by Gauff in the final of the French Open earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumra-talking-to-all-of-us-prasidh-krishna-2747735-2025-06-28",
      "headline": "Jasprit Bumrah talking to all of us: Prasidh Krishna on pacer's leadershipPrasidh Krishna praised Jasprit Bumrah's leadership within the Indian Test side ahead of the second Test in Birmingham, as questions loom over Bumrah's availability due to workload management following India's loss in Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-womens-t20i-smriti-mandhana-hundred-trent-bridge-2747734-2025-06-28",
      "headline": "Smriti Mandhana becomes 2nd Indian to score hundred in women's T20IsSmriti Mandhana lit up the crowd in Nottingham as she became the second Indian in women's T20Is to score a hundred on Saturday, June 28. Mandhana joined Harmanpreet Kaur in the elite list with her knock on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-w-vs-ind-w-smriti-mandhana-shafali-verma-break-world-record-for-50-plus-partnership-2747730-2025-06-28",
      "headline": "Mandhana, Shafali Verma break world record with stellar partnership vs EnglandIndia batters Smriti Mandhana and Shafali Verma broke the world record for most fifty-plus partnerships in women's T20Is during the first game against England in Nottingham."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/yash-dayal-harassment-allegation-marriage-rcb-2747728-2025-06-28",
      "headline": "RCB pacer Yash Dayal accused of exploitation, assault on pretext of marriageYash Dayal has found himself in trouble as a woman has accused him of alleged harassment under the false pretext of marriage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-aryna-sabalenka-coco-gauff-friends-french-open-comments-2747744-2025-06-28",
      "headline": "Aryna Sabalenka says she has cleared the air with Coco Gauff: We are friendsAryna Sabalenka said that she has cleared the air with Coco Gauff and they're good friends off the court. Sabalenka was slammed for her comments after being beaten by Gauff in the final of the French Open earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumra-talking-to-all-of-us-prasidh-krishna-2747735-2025-06-28",
      "headline": "Jasprit Bumrah talking to all of us: Prasidh Krishna on pacer's leadershipPrasidh Krishna praised Jasprit Bumrah's leadership within the Indian Test side ahead of the second Test in Birmingham, as questions loom over Bumrah's availability due to workload management following India's loss in Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-womens-t20i-smriti-mandhana-hundred-trent-bridge-2747734-2025-06-28",
      "headline": "Smriti Mandhana becomes 2nd Indian to score hundred in women's T20IsSmriti Mandhana lit up the crowd in Nottingham as she became the second Indian in women's T20Is to score a hundred on Saturday, June 28. Mandhana joined Harmanpreet Kaur in the elite list with her knock on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-w-vs-ind-w-smriti-mandhana-shafali-verma-break-world-record-for-50-plus-partnership-2747730-2025-06-28",
      "headline": "Mandhana, Shafali Verma break world record with stellar partnership vs EnglandIndia batters Smriti Mandhana and Shafali Verma broke the world record for most fifty-plus partnerships in women's T20Is during the first game against England in Nottingham."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/yash-dayal-harassment-allegation-marriage-rcb-2747728-2025-06-28",
      "headline": "RCB pacer Yash Dayal accused of exploitation, assault on pretext of marriageYash Dayal has found himself in trouble as a woman has accused him of alleged harassment under the false pretext of marriage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-pooled-alongside-pakistan-in-junior-mens-hockey-world-cup-2025-2747717-2025-06-28",
      "headline": "India pooled alongside Pakistan in Junior Men's Hockey World Cup 2025Hosts India have been grouped alongside Pakistan in Pool B for the upcoming Junior Men's Hockey World Cup. The tournament is all set to take place towards the end of 2026. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sa-lhuan-dre-pretorius-slams-fastest-century-on-test-debut-by-south-african-2747708-2025-06-28",
      "headline": "Lhuan-dre Pretorius slams fastest century on Test debut by South African batterSouth Africa's Lhuan-dre Pretorius registered the fastest hundred by a South African batter on Test debut during Day 1 of the first match against Zimbabwe in Bulawayo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-second-test-shubman-gill-captaincy-prasidh-krishna-2747698-2025-06-28",
      "headline": "Shubman Gill's captaincy debut praised by Prasidh Krishna: He rotated bowlers wellPrasidh Krishna jumped to the defence of Shubman Gill's captaincy after the loss to England in the first Test in Leeds. Gill's captaincy skills came under the scanner after India slipped to a five-wicket loss against England at Headingley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-ahmedabad-can-host-lords-stadium-ravi-shastri-2747691-2025-06-28",
      "headline": "Ahmedabad casn host the WTC Final, but England is good for now: Ravi ShastriRavi Shastri backed Lord's as the current ideal host for the WTC Final, stating that iconic venues like Ahmedabad and MCG can take over once the fixture garners enough global popularity and crowd pull."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-bowls-with-full-intensity-in-nets-2747675-2025-06-28",
      "headline": "Bumrah bowls with full intensity in nets, sparks hopes of playing 2nd TestIndia fast bowler Jasprit Bumrah was seen bowling with full intensity during practice session ahead of the second Test against England set to begin from July 2 at Headingley, Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-alastair-cook-defends-shubman-gill-with-ben-stokes-example-2747662-2025-06-28",
      "headline": "ENG vs IND: Cook jumps to Shubman Gill's defence with Ben Stokes' exampleLegendary England batter Alastair Cook has jumped to Shubman Gill's defence following India's loss in the first Test against England at Headingley, Leeds. England beat India by five wickets in the series opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-on-verge-of-joining-bradman-dravid-and-lara-2747639-2025-06-28",
      "headline": "ENG vs IND: Rishabh Pant on verge of joining Bradman, Dravid and Lara in elite listIndia wicketkeeper batter Rishabh Pant is on the verge of joining Sir Don Bradman, Rahul Dravid and Brian Lara in an elite list during the second Test against England set to begin from July 2 at Edgbaston, Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-ahmedabad-can-host-lords-stadium-ravi-shastri-2747691-2025-06-28",
      "headline": "Ahmedabad casn host the WTC Final, but England is good for now: Ravi ShastriRavi Shastri backed Lord's as the current ideal host for the WTC Final, stating that iconic venues like Ahmedabad and MCG can take over once the fixture garners enough global popularity and crowd pull."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-bowls-with-full-intensity-in-nets-2747675-2025-06-28",
      "headline": "Bumrah bowls with full intensity in nets, sparks hopes of playing 2nd TestIndia fast bowler Jasprit Bumrah was seen bowling with full intensity during practice session ahead of the second Test against England set to begin from July 2 at Headingley, Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-alastair-cook-defends-shubman-gill-with-ben-stokes-example-2747662-2025-06-28",
      "headline": "ENG vs IND: Cook jumps to Shubman Gill's defence with Ben Stokes' exampleLegendary England batter Alastair Cook has jumped to Shubman Gill's defence following India's loss in the first Test against England at Headingley, Leeds. England beat India by five wickets in the series opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-on-verge-of-joining-bradman-dravid-and-lara-2747639-2025-06-28",
      "headline": "ENG vs IND: Rishabh Pant on verge of joining Bradman, Dravid and Lara in elite listIndia wicketkeeper batter Rishabh Pant is on the verge of joining Sir Don Bradman, Rahul Dravid and Brian Lara in an elite list during the second Test against England set to begin from July 2 at Edgbaston, Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-team-changes-kuldeep-jadeja-2747597-2025-06-28",
      "headline": "Kuldeep for Jadeja: Haddin asks Gill to make bold move in 2nd TestBrad Haddin believes that Shubman Gill, as a captain, has to take more bold moves to ensure they remain in the five-match series against England. One such move he suggested was to bring in Kuldeep Yadav for Ravindra Jadeja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-play-in-2nd-test-vs-india-englands-managing-director-reveals-2747600-2025-06-28",
      "headline": "Will Jofra Archer play in 2nd Test vs India? England's managing director revealsEngland and Wales Cricket Board (ECB) managing director Rob Key recently gave an update on Jofra Archer's availability for the second Test against India in Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rameshbabu-praggnanandhaa-chess-players-ranking-d-gukesh-viswanathan-anand-2747585-2025-06-28",
      "headline": "This one felt special: Praggnanandhaa after overtaking D GukeshRameshbabu Praggnanandhaa has become India's highest-ranked chess player after his win at the UzChess Cup Masters. He overtook D Gukesh for the position and said that it was a special feeling."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-roston-chase-demands-penalty-for-umpires-controversial-decisions-2747566-2025-06-28",
      "headline": "Roston Chase demands penalty for umpires after contentious calls in 1st TestWest Indies captain Roston Chase demanded penalty for umpires after several controversial decisions went against his team during the first Test against Australai in Barbados."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-kl-rahul-batting-abhishek-nayar-rohit-sharma-2747537-2025-06-28",
      "headline": "The KL Rahul comeback: Are India reaping rewards of Abhishek Nayar's work?India batter KL Rahul has regained form with a century in the England Test series. Former India batting coach Abhishek Nayar reveals how he played a crucial role in revamping his technique and mindset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/heinrich-klaasen-mlc-2025-quits-captaincy-seattle-orcas-matthhew-mott-sacked-2747526-2025-06-28",
      "headline": "Klaasen quits Seattle Orcas captaincy midway through MLC 2025, coach Mott sackedHeinrich Klaasen has stepped down from his role as captain of the Seattle Orcas to focus on his batting. Coach Matthew Mott has been sacked from his role by the franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-ban-2nd-test-prabath-jayasuriya-pathum-nissanka-colombo-2747529-2025-06-28",
      "headline": "Prabath Jayasuriya spins Sri Lanka to innings victory over Bangladesh in 2nd TestSri Lanka beat Bangladesh by an innings and 78 runs in the second and final Test and won the series by 1-0. Prabath Jayasuriya picked up his 12th five-wicket haul on Day 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/najmul-hossain-shanto-quits-as-bangladesh-test-captain-2747523-2025-06-28",
      "headline": "Shanto quits as Bangladesh's Test skipper after Sri Lanka series defeatDespite a brilliant performance in the Sri Lanka Test series, Najmul Hossain Shanto has decided to step down as Bangladesh's Test captain. Shanto believes it is not ideal to have separate captains in red ball and white ball formats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/raphinha-hails-nico-williams-barcelona-transfer-signing-2747505-2025-06-28",
      "headline": "Player of highest quality: Raphinha hails Williams amid Barcelona moveRaphinha remains unfazed at Nico Williams' possible signing for Barcelona and wants to continue putting his team first. He will welcome the Spaniard if he follows a similar approach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-arshdeep-singh-practice-session-edgbaston-2747499-2025-06-28",
      "headline": "Arshdeep trains hard as Bumrah skips ahead of Edgbaston TestIndia vs England: Arshdeep Singh had an intensive training session ahead of the second Test at Edgbaston. His potential debut depends on Jasprit Bumrah's fitness and selection decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/steve-smith-returns-australia-second-test-west-indies-grenada-2747484-2025-06-28",
      "headline": "Steve Smith begins batting, hopes to prove fitness for Grenada TestSteve Smith is already eyeing his return to Test cricket after copping an injury during the World Test Championship final. He could possibly make his return in the second Test against the West Indies in Grenada."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}