{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-mark-zuckerberg-internal-memo-reveals-job-cuts-lowest-performers-starting-next-week-layoffs-2676644-2025-02-08",
      "headline": "Meta plans to lay off 'lowest performance' staff next week, internal memo revealsNotices will go out to employees losing their jobs starting at 5 am local time on Monday in most countries, including in the US, according to one of the posts, authored by Meta's Head of People Janelle Gale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-income-tax-bill-approved-cabinet-likely-tabled-lok-sabha-monday-sources-2676509-2025-02-07",
      "headline": "Cabinet clears new income tax bill, likely to be tabled in Lok Sabha Monday: SourcesThe new legislation, which is often referred to as the Direct Tax Code, is aimed at overhauling the existing tax structure, making it more streamlined and transparent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-things-about-mohini-mohan-dutta-the-man-named-in-ratan-tata-will-2676438-2025-02-07",
      "headline": "5 things about Mohini Mohan Dutta: The man named in Ratan Tata's willWhile most anticipated that Ratan Tata's wealth would go towards philanthropy, family members, and other charitable causes, Mohini Mohan Dutta's mention in his will has surprised many."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-clarifies-forceful-layoffs-freshers-get-3-attempts-to-clear-assessment-2676443-2025-02-07",
      "headline": "Infosys clarifies 'forceful' layoffs: Freshers get 3 attempts to clear assessmentInfosys said freshers undergo foundational training at its Mysuru campus and must pass an internal assessment to continue working."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-forcefully-lays-off-700-trainees-in-mysuru-report-2676257-2025-02-07",
      "headline": "Infosys 'forcefully' lays off 700 trainees in Mysuru: ReportMost of the affected recruits were from the engineering batch of 2022, who were onboarded after a wait of about 2.25 years, said sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-after-volatile-session-fmcg-energy-drag-rbi-mpc-2676251-2025-02-07",
      "headline": "Sensex, Nifty end lower after volatile session; FMCG, energy drag marketThe S&P BSE Sensex fell by 197.97 points to end at 77,860.19, while the NSE Nifty50 declined by 43.40 points to close at 23,559.95. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-500-points-after-rbi-mpc-announcement-625-percent-why-is-stock-market-falling-today-2676229-2025-02-07",
      "headline": "Sensex tanks 500 points after RBI MPC: Why is stock market falling todayThe S&P BSE Sensex was down by 539.72 points to 77,516.79, while the NSE Nifty50 declined by 147.50 points to 23,455.60 as of 2:43 PM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/activate-uan-to-avail-epfo-eli-scheme-benefits-before-february-15-check-details-2676213-2025-02-07",
      "headline": "Activate UAN to avail EPFO's ELI scheme benefits before February 15. Check detailsEPFO ELI: UAN or Universal Account Number is a unique 12-digit number allotted by EPFO which is necessary for managing provident fund accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-mohini-mohan-dutta-rs-500-crore-surprise-in-ratan-tata-will-2676202-2025-02-07",
      "headline": "Who is Mohini Mohan Dutta? Rs 500 crore surprise in Ratan Tata's willRatan Tata also left behind a share for his siblings, his butler Subbiah and German Shepherd Tito have also been provided for in his will. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-introduces-bankin-domain-for-indian-banks-to-tackle-financial-fraud-2676141-2025-02-07",
      "headline": "RBI introduces 'bank.in' domain for Indian banks to tackle financial fraudThe move aims to tackle growing financial fraud and cybercrime, prevent malicious activities, and strengthen the country's financial ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-6-key-takeaways-from-mpc-announcement-gdp-growth-inflation-outlook-cheaper-home-loans-women-empowerment-2676118-2025-02-07",
      "headline": "RBI cuts key lending rate after 5 years: 6 takeaways from the announcementThe central bank has announced a reduction in the repo rate by 25 basis points for the first time in nearly five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/after-5-years-rbi-cut-key-lending-rate-by-25-basis-points-to-625-2676083-2025-02-07",
      "headline": "After 5 years, RBI cut key lending rate by 25 basis points to 6.25%This marks the first rate cut since 2020 and the first policy decision under Governor Malhotra's leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-home-loans-to-get-cheaper-as-rbi-cuts-rates-25-basis-points-625-percent-check-details-2676080-2025-02-07",
      "headline": "Home loans to get cheaper as RBI cuts rates. Check detailsThe RBI MPC reduced key lending rates by 25 basis points to 6.25%, the first rate cut in nearly five years under the leadership of newly appointed RBI Governor Sanjay Malhotra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-key-lending-rate-interest-repo-cut-25-basis-points-625-per-cent-first-time-since-2020-2676071-2025-02-07",
      "headline": "RBI reduces key lending rate by 25 basis points to 6.25%The rate cut announced by the committee is the first since 2020. This was also the first policy meeting of Sanjay Malhotra as RBI Governor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-markets-opening-sensex-nifty-flat-as-investors-await-rbi-policy-decision-itc-down-2-percent-2676061-2025-02-07",
      "headline": "Stock markets open flat as investors await RBI policy decision; ITC down 2%The S&P BSE Sensex was down by 23.98 points to 78,034.18, while the NSE Nifty50 lost 7 points to 23,596.35 as of 9:35 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-upi-services-unavailable-on-this-date-get-details-here-2675839-2025-02-06",
      "headline": "HDFC Bank UPI services unavailable on this date. Get details hereDuring the downtime, the UPI transactions on HDFC Bank's current and savings accounts and RuPay credit cards will be affected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-board-approves-company-name-change-to-eternal-ltd-ceo-deepinder-goyal-2675789-2025-02-06",
      "headline": "Zomato to be Eternal? Deepinder Goyal says company name change cleared by boardThe renaming announcement comes weeks after Zomato entered the BSE Sensex on December 23, which coincides with the 17th anniversary of its founding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/default-on-personal-loan-check-consequences-impact-on-credit-score-hefty-penalty-legal-notice-2675670-2025-02-06",
      "headline": "What if you default on personal loan? Check consequencesPersonal loan default consequences: Banks or lenders impose hefty penalties, or late fee charges in case of a missed EMI amount. They may even impose higher interest charges and additional charges for collection efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-redeem-credit-card-points-check-2-simple-ways-online-banking-customer-service-helpline-2675748-2025-02-06",
      "headline": "Want to redeem credit card points? Check these 2 simple ways How to redeem credit card points: The number of credit card points one earns depends on the type of card, whether basic or premium, and the amount spent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-fall-sharply-as-dalal-street-remains-edgy-ahead-of-rbis-rate-decision-2675724-2025-02-06",
      "headline": "Sensex, Nifty fall sharply as D-Street remains edgy ahead of RBI's rate decisionThe S&P BSE Sensex closed 213.12 points lower at 78,058.16 and the NSE Nifty50 settled 92.95 points lower at 23,603.35."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lucky-ali-dreams-of-getting-married-again-2676813-2025-02-08",
      "headline": "Singer Lucky Ali 'dreams of getting married again'Singer Lucky Ali recently graced the Kathakar event where he spoke of his desire to get married again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papn-kaun-mera-song-special-26-completes-12-years-2676762-2025-02-08",
      "headline": "Papon's Kaun Mera song completes 12 years: Humbled by the love it still receivesPapon's soulful track Kaun Mera from Special 26 celebrates 12 years. The song's lasting popularity highlights its emotional depth and enduring appeal in Bollywood music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-6-ott-releases-this-week-the-mehta-boys-mrs-daaku-mahaaraj-game-changer-2676487-2025-02-07",
      "headline": "The Mehta Boys to Mrs: Top 6 OTT releases this weekThis weekend, a variety of highly anticipated South films and original titles are set to release on OTT platforms, offering viewers a diverse selection for binge-watching. Check out the list of the OTT releases of the week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grammy-winner-kendrick-lamar-promises-storytelling-in-super-bowl-act-sza-drake-2676354-2025-02-07",
      "headline": "Grammy winner Kendrick Lamar promises storytelling in Super Bowl act, SZA to joinRapper and Grammy winner Kendrick Lamar will be headlining the Super Bowl halftime show for the first time in his career. Lamar has recently been in the news for winning five Grammys for his diss track Not Like Us, directed at rapper Drake. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/maryade-prashne-when-and-where-watch-the-malayalam-revenge-drama-prime-video-stmp-2676264-2025-02-07",
      "headline": "Maryade Prashne OTT release: When and where to watch the revenge dramaThe revenge family drama Maryade Prashne, which released in November last year, is now available to stream on a major OTT platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-netflix-prosenjit-chatterjee-jeet-saswata-chatterjee-parambrata-chattopadhyay-2676206-2025-02-07",
      "headline": "How Netflix pulled most unexpected casting coup with Khakee The Bengal ChapterNetflix has orchestrated a major casting coup by bringing together top stars of Bengali cinema for its upcoming crime thriller, Khakee: The Bengal Chapter. The show promises to showcase the industry's talent and diversity in a groundbreaking way."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/internet-shreds-elvish-yadav-for-trolling-bigg-boss-18-finalist-chum-darang-2676258-2025-02-07",
      "headline": "Internet shreds Elvish Yadav for trolling Bigg Boss 18 finalist Chum DarangSocial media users have slammed YouTuber contestant Elvish Yadav for making inappropriate remarks about Bigg Boss 18 finalist and actor Chum Darang's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bada-naam-karenge-review-sooraj-barjatya-ott-debut-palash-vaswani-sony-liv-2676217-2025-02-07",
      "headline": "Bada Naam Karenge review: Sweet, familiar and full of sanskaarsReleased-Fri Feb 07, 2025Bada Naam Karenge is a classic Rajshri Productions love story with sweet romance, catchy music, and family drama. While it evokes nostalgia, its simple plot and dated gender roles may not resonate with all. Strong performances and a heartfelt message make it a warm, fulfilling watch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/from-romance-to-revenge-k-drama-star-park-hyung-sik-buried-hearts-2676222-2025-02-07",
      "headline": "From romance to revenge, K-drama star Park Hyung-sik can do it allThere are not many South Korean stars who can boast of having a diverse filmography like Park Hyung-sik. In today's installment of our Weekly K-Fix, we take a quick look at the artiste's short but illustrious career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-greatest-rivalry-india-vs-pakistan-review-reliving-cricket-golden-era-and-its-heroes-2676210-2025-02-07",
      "headline": "The Greatest Rivalry India vs Pakistan: Reliving cricket's golden era and its heroes  Released-Fri Feb 07, 2025The Greatest Rivalry India vs Pakistan review: A new Netflix docu-series revives the legendary India vs Pakistan cricket rivalry, exploring its intense history and iconic players with insights from cricket legends and journalists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/what-makes-netflixs-the-trauma-code-a-breakout-hit-surpassing-squid-game-2-2676127-2025-02-07",
      "headline": "What makes Netflix's The Trauma Code a breakout hit surpassing Squid Game 2The Trauma Code: Heroes on Call has taken Netflix by storm, surpassing Squid Game Season 2 on the global chart. This medical drama captivates with its blend of intense medical scenarios, hospital politics, and humour, offering a fresh take on the genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/triptii-dimri-begins-prep-for-parveen-babi-biopic-despite-not-signing-project-2675939-2025-02-06",
      "headline": "Exclusive: Triptii Dimri begins prep for Parveen Babi biopic, yet to sign projectIndia Today Digital has exclusively learnt that Triptii Dimri has begun preparing for her role as Parveen Babi in a biopic, even before officially signing the project. The series, directed by Shonali Bose, is yet to be announced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-long-note-on-bianca-censori-invisible-dress-grammy-controversy-2675906-2025-02-06",
      "headline": "Kanye West on Bianca Censori's nude dress controversy: Wife is so brave and hotKanye West defends his wife Bianca Censori's controversial invisible dress at the Grammy 2025, sharing a long note on X."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/ram-kapoor-sets-the-record-straight-on-55-kg-weight-loss-no-ozempic-just-hard-work-2675851-2025-02-06",
      "headline": "Ram Kapoor on 55 kg weight loss: No Ozempic, just hard workRam Kapoor's 55 kg weight loss has sparked widespread speculation about the methods he used. However, Kapoor clarified on social media that his transformation was achieved through hard work and dedication, dismissing the use of shortcuts like Ozempic or surgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kinda-pregnant-review-amy-schumers-comedy-netflix-film-barely-delivers-2675690-2025-02-06",
      "headline": "Kinda Pregnant review: Amy Schumer's comedy film barely deliversReleased-Wed Feb 05, 2025Amy Schumer returns with Kinda Pregnant, a comedy that struggles to hit the mark. Despite its premise of friendship and motherhood, it fails to offer fresh laughs or insights."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-wife-hailey-step-out-for-a-date-amid-divorce-rumours-2675733-2025-02-06",
      "headline": "Justin Bieber, wife Hailey step out for a date amid divorce rumoursJustin and Hailey Bieber were seen enjoying a date night in New York City, countering recent divorce rumours. Despite reports of marital strain linked to Justin's legal anxieties, the couple appeared united."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anuja-movie-review-hard-hitting-subject-compelling-watch-2675725-2025-02-06",
      "headline": "Anuja review: Raw performances, hard-hitting subject make it a compelling watchReleased-Thu Feb 06, 2025Anuja movie review: Oscar-nominated Anuja is a gripping short film on child labour and resilience. With stellar performances and a hard-hitting narrative, it is a must-watch on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-night-agent-season-2-review-equal-parts-dramatic-and-delectably-exciting-netflix-series-2675638-2025-02-06",
      "headline": "The Night Agent Season 2 review: Equal parts dramatic and delectably excitingReleased-Thu Jan 23, 2025In The Night Agent Season 2 on Netflix, a spy recruited by the most secretive body of the FBI, gets entangled in the mysteries of state secrets and in-house traitors. Peter Sutherland is back to save his country from falling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kadhalikka-neramillai-on-ott-when-where-to-watch-nithya-menen-ravi-mohan-film-2675609-2025-02-06",
      "headline": "Kadhalikka Neramillai on OTT: When and where to watch Nithya Menen, Ravi Mohan filmNithya Menen and Ravi Mohan's Kadhalikka Neramillai is reportedly gearing up for its OTT debut on Netflix. The film was earlier released in theatres during the Pongal festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-review-sanya-malhotra-nishant-dahiya-kanwaljit-singh-zee5-film-2675594-2025-02-06",
      "headline": "Mrs review: Sanya Malhotra's film is an unsettling watch, for all the right reasonsReleased-Thu Feb 06, 2025ZEE5 film 'Mrs', starring Sanya Malhotra, explores the harsh realities that several women face in marriage. A Hindi adaptation of 'The Great Indian Kitchen', Mrs delves into themes of patriarchy and unfulfilled aspirations."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/unravelling-of-mufflerman-politics-over-promise-arvind-kejriwal-delhi-election-results-2025-2676780-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The Unravelling of the MufflermanPeople in Delhi had pinned their hopes on Arvind Kejriwal, the Mufflerman. He came with promises but left with politics. Projecting himself to be far from the typical politician, Kejriwal played politics on everything, even air and water. This is how the Mufflerman unravelled, and the AAP came unspun with him. With an Unravel-O-Meter inside."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/milkipur-by-election-result-2025-bjp-headed-for-victor-over-samajwadi-party-2676725-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP wins UP's Milkipur in prestige battle against Samajwadi Party The Bharatiya Janata Party (BJP) wrested UP's Milkipur from Samajwadi Party in the battle of prestige."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-elections-priyanka-gandhi-says-people-of-delhi-fed-up-after-bjp-monster-win-2676866-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi was fed up, voted for change: Priyanka Gandhi after BJP's monster winPriyanka Gandhi reacted to INDIA bloc ally AAP's defeat in the Delhi Assembly polls, saying that the people of the national capital were fed up and voted for change. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-cant-defeat-aap-this-lifetime-arvind-kejriwal-old-video-viral-delhi-loss-narendra-modi-2676794-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP can't defeat us in this life: Arvind Kejriwal's old video viral after lossAn old video of AAP chief Arvind Kejriwal from 2023 has gone viral, where he confidently asserted, \"I want to tell Narendra Modi ji that you cannot defeat us in this life, and you will have to take another birth to defeat us in Delhi.\" "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/swati-maliwal-didnt-contest-but-emerged-biggest-winner-delhi-election-results-arvind-kejriwal-2676769-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Swati Maliwal didn't contest but emerged Delhi's biggest winnerSwati Maliwal, who didn't contest the 2025 Delhi Assembly election, has emerged as one of the biggest winners. It was Maliwal who focused the Delhi election on civic issues, which was later coopted by the BJP. Mistreated in Arvind Kejriwal's drawing room, Maliwal made the battle personal. She hit the streets, and hurt the AAP."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/dmk-chandirakumar-ntk-seethalakshmi-fight-erode-east-tamil-nadu-assembly-bypoll-2025-2676753-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DMK eyes easy win in Erode (East) Assembly seat by-election Live UpdatesWith Naam Tamilar Katchi (NTK) being the only party as an opponent, the ruling Dravida Munnetra Kazhagam (DMK) had a huge lead of more than 30,000 votes in the Erode (East) Tamil Nadu Assembly seat by-election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-election-results-aap-arvind-kejriwal-national-ambitions-haryana-goa-gujarat-punjab-2676736-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Never take partner for granted': Dumped by Delhi, lesson for Arvind Kejriwal?Delhi results: A BJP win in Delhi could potentially dismantle the AAP's ambitions of becoming a pan-Indian alternative to the saffron party amid Congress's spree of flop electoral shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/omar-abdullah-meme-aap-congress-delhi-election-result-bjp-win-india-bloc-aur-lado-aapas-mein-2676699-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Omar Abdullah trolls AAP-Congress over Delhi debacle: 'Aur lado aapas mein'Omar Abdullah has been vocal about his dissatisfaction with the internal dynamics of the INDIA bloc, criticising the lack of unity among its member parties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-cryptic-x-post-leaves-internet-worried-2676765-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Amitabh Bachchan's cryptic post leaves internet worried: Time to goSuperstar Amitabh Bachchan recently shared a cryptic X post which left his fans worried. Big B shared a post which simply read, 'time to go.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-pm-shehbaz-sharif-says-beating-india-a-real-task-for-their-team-in-champions-trophy-2676837-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistan PM says beating India 'a real task' for their team in Champions TrophyPakistan Prime Minister Shehbaz Sharif feels that beating India will be a real task for Pakistan team in the upcoming ICC Champions Trophy 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-results-kumar-vishwas-aap-loss-wife-cried-manish-sisodia-arvind-kejriwal-2676864-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "My wife cried when Manish Sisodia lost: Kumar Vishwas's cryptic remark on resultsMy wife cried when Manish Sisodia lost polls: Ex-AAP leader Kumar Vishwas"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/hamas-releases-three-more-israeli-hostages-gaza-ceasefire-deal-red-cross-palestinian-prisoners-swap-deal-2676810-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hamas parades 3 frail hostages in Gaza before release, images shock IsraelisSoon after their release, the international media highlighted the thin and frail images of the Israeli nationals, who were reportedly in a worse state as compared to the 18 hostages freed last month. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-origin-congressman-ro-khanna-us-vice-president-jd-vance-war-of-words-doge-staffer-racist-posts-reinstated-2676620-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congressman, JD Vance's X war as DOGE staffer who quit over racist posts reinstatedMarko Elez resigned from DOGE after the Wall Street Journal published a report linking him to a now-deleted account on X, where he made some racist posts. In one post last September, Elez reportedly said, \"You could not pay me to marry outside of my ethnicity,\"  and in another one, he wrote, \"Just for the record, I was racist before it was cool.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/arvind-kejriwal-bjp-delhi-assembly-elections-concedes-defeat-bjp-aam-aadmi-party-results-2676796-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Accept people's mandate: Arvind Kejriwal concedes defeat in Delhi electionsConceding defeat in the Delhi Assembly elections, Arvind Kejriwal assured that the Aam Aadmi Party (AAP) would play a role of constructive opposition and continue to serve the people. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/kalkaji-election-results-chief-minister-atishi-bjp-ramesh-bidhuri-2676714-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Atishi wins from Kalkaji, saving grace as AAP giants loseKalkaji election results: Atishi, who took over the top job after Arvind Kejriwal resigned months ahead of the Delhi Assembly polls amid corruption charges, won from Kalkaji in her debut election in 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-elections-parvesh-verma-defeats-former-chief-minister-arvind-kejriwal-from-new-delhi-2676824-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will Parvesh Verma, who defeated Arvind Kejriwal, lead Delhi? What he saidBJP candidate Parvesh Verma credited Prime Minister Narendra Modi for his win against Arvind Kejriwal from the New Delhi seat, adding that he wouldn't want to stay in the 'sheeshmahal'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/gurugram-man-seeks-new-relationship-manager-hdfc-bank-reacts-viral-linkedin-post-2676859-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gurugram man asks HDFC Bank to change Relationship Manager. Their hilarious responseIn a now-viral LinkedIn post, a Gurugram man shared that he had asked HDFC Bank to change his Relationship Manager (RM). Instead of resolving the issue, the bank directed him to the very same RM to process the request. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-447-07-02-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-election-results-2025-full-list-of-winners-and-losers-constituency-wise-stmp-2676691-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi Election Results 2025: Full list of winners by constituencyDelhi Assembly election Result 2025: In a surprising turn of events, key Aam Aadmi Party leaders Arvind Kejriwal and Manish Sisodia have admitted to their defeat. Here's the full list of winners from the 70 constituencies. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-donald-trump-joe-biden-security-clearance-classified-files-2676596-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump revokes Biden's security clearances: Joe, you're fired Donald Trump announced he is revoking Joe Biden's security clearance, ending his access to classified information and intelligence briefings. Trump declared the decision on Truth Social, stating, \"Joe, you're fired.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bryan-johnson-advice-to-indians-clean-air-over-curing-cancer-aqi-rant-nikhil-kamath-podcast-2676690-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bryan Johnson shares Taare Zameen Par meme with AQI reference for IndiansAnti-ageing enthusiast Bryan Johnson advised Indians to prioritise \"cleaning the air rather than curing cancer\" as he addressed the debate that ensued online after he walked out of Nikhil Kamath's podcast due to air quality concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-election-results-2025-middle-class-purvanchali-voters-yamuna-bjp-aap-2676682-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Kingmakers' middle class, Purvanchali voters shift to BJP, ditch AAPDelhi election results: The BJP is on course to end its 27-year hiatus in Delhi by overthrowing the Aam Aadmi Party's decade-old regime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-divorce-samantha-why-am-i-treated-like-a-criminal-2676687-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Naga Chaitanya on divorce from Samantha: Why am I treated like a criminalNaga Chaitanya called his divorce from Samantha Ruth Prabhu a 'sensitive' topic. He said he understands the 'repercussions' of a broken family and has now moved on with grace. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/jammu-and-kashmir/story/iltija-mufti-mother-mehbooba-mufti-under-house-arrest-nothing-has-changed-in-kashmir-2676686-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Iltija Mufti claims she, mother under house arrest: Nothing's changed in KashmirAccording to reports, truck driver Waseem Majeed Mir was killed in army firing after he refused to stop at a checkpoint in Baramulla district on Wednesday night.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pratik-gandhi-on-breaking-perceptions-madgaon-express-helped-me-break-free-2676874-2025-02-08",
      "headline": "Pratik Gandhi on breaking perceptions: Madgaon Express helped me break freePratik Gandhi, known for Scam 1992, broke away from intense roles with the comedy-drama Madgaon Express. He shared how people doubted his comedy skills but is excited to explore the genre in Dhoom Dhaam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-and-sai-pallavi-thandel-leaked-online-stmp-2676830-2025-02-08",
      "headline": "Naga Chaitanya, Sai Pallavi's Thandel leaked online Actor Naga Chaitanya and Sai Pallavi's latest venture, Thandel, has leaked online. The film released in cinemas on February 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-sleeps-for-2-hours-2676829-2025-02-08",
      "headline": " Salman Khan sleeps for 2 hours: Can sleep only when there's nothing to do Actor Salman Khan told nephew Arhaan Khan that he sleeps only 2 hours a day and had his best sleep in jail. He advised him to stay enthusiastic, avoid complacency, and share credit for success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/rajkummar-rao-patralekhaa-take-a-holy-dip-at-triveni-sangam-pics-2676782-2025-02-08",
      "headline": "Photos: Rajkummar Rao, Patralekhaa take a holy dip at Triveni SangamActors Rajkummar Rao and Patralekhaa recently visited Mahakumbh and shared photos from the same. In the images, the pair were seen taking a holy dip at the Triveni Sangam. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-pm-shehbaz-sharif-says-beating-india-a-real-task-for-their-team-in-champions-trophy-2676837-2025-02-08",
      "headline": "Pakistan PM says beating India 'a real task' for their team in Champions TrophyPakistan Prime Minister Shehbaz Sharif feels that beating India will be a real task for Pakistan team in the upcoming ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-varun-chakravarthy-india-vs-england-debut-2676821-2025-02-08",
      "headline": "Varun Chakravarthy unlikely to debut in 2nd ODI vs England, feels Zaheer KhanMystery spinner Varun Chakravarthy's ODI debut for India might be delayed feels former India cricketer Zaheer Khan. The former pacer feels that India would focus on winning the series before handing out further debuts.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ravindra-jadeja-r-ashwin-india-vs-england-2nd-odi-match-2676792-2025-02-08",
      "headline": "Indian media fails to appreciate 'Jackpot Jango' Ravindra Jadeja: R AshwinIndia vs England: Spinner Ravichandran Ashwin believes that the Indian media does not appreciate Ravindra Jadeja enough. Ashwin called Jadeja the 'Jackpot Jango' ahead of the 2nd ODI of the 3-match series.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-rohit-sharma-sachin-tendulkar-opener-record-2676783-2025-02-08",
      "headline": "Rohit Sharma nears Sachin Tendulkar's tally in elite openers club IND vs ENG: Rohit Sharma is 50 runs short of becoming the second-highest run-scorer for India as an opener in international cricket. Rohit will have his chance in the second ODI on Sunday at the Barabati Stadium in Cuttack.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-alex-carey-shatters-adam-gilchrist-asia-record-galle-test-2676777-2025-02-08",
      "headline": "Alex Carey shatters Adam Gilchrist's Asia record with 156 vs Sri LankaAlex Carey's record-breaking 156 in Galle surpasses Adam Gilchrist's highest score by an Australian wicketkeeper in Asia, guiding Australia to a strong position in the second Test against Sri Lanka alongside stand-in captain Steven Smith."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-prabath-jayasuriya-muttiah-muralitharan-galle-test-vs-australia-2676771-2025-02-08",
      "headline": "Jayasuriya nears Muralitharan's record with 9th five-wicket haul in GalleSL vs AUS: Prabath Jayasuriya continued his dream run in Test matches at the Galle Stadium after he took his ninth five-wicket haul at the venue during the second Test against Australia. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-unai-emery-aston-villa-not-concerned-about-marcus-rashford-manchester-united-form-2676763-2025-02-08",
      "headline": "Aston Villa boss Unai Emery not concerned about Marcus Rahsford's United slumpMarcus Rashford's loan move to Aston Villa offers him a crucial chance to revive his career, as Unai Emery backs the England forward to rediscover his best form despite his struggles at Manchester United."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bpl-2025-tamim-iqbal-shakib-al-hasan-bangladesh-fans-2676744-2025-02-08",
      "headline": "Tamim Iqbal's strong 'last message' to fans: No Tamimian, no Shakibian, only BangladeshBPL 2025: Tamim Iqbal said that Bangladesh fans need to stay united and shun the fanbases involving him, Shakib Al Hasan and Mashrafe Mortaza. On Friday, Tamim led Fortune Barishal to glory against the Chittagong Kings. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sa20-2025-rashid-khan-1000-t20-wickets-milestone-mi-cape-town-2676731-2025-02-08",
      "headline": "Feel I can get there: Rashid Khan dreams of 1000-wicket feat in T20sSA20 2025: Rashid Khan said that he has a great chance of reaching the landmark of 1000 wickets in T20s. The spinner will lead MI Cape Town in the final on February 8 against Sunrisers Eastern Cape.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-alex-carey-shatters-adam-gilchrist-asia-record-galle-test-2676777-2025-02-08",
      "headline": "Alex Carey shatters Adam Gilchrist's Asia record with 156 vs Sri LankaAlex Carey's record-breaking 156 in Galle surpasses Adam Gilchrist's highest score by an Australian wicketkeeper in Asia, guiding Australia to a strong position in the second Test against Sri Lanka alongside stand-in captain Steven Smith."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-prabath-jayasuriya-muttiah-muralitharan-galle-test-vs-australia-2676771-2025-02-08",
      "headline": "Jayasuriya nears Muralitharan's record with 9th five-wicket haul in GalleSL vs AUS: Prabath Jayasuriya continued his dream run in Test matches at the Galle Stadium after he took his ninth five-wicket haul at the venue during the second Test against Australia. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-unai-emery-aston-villa-not-concerned-about-marcus-rashford-manchester-united-form-2676763-2025-02-08",
      "headline": "Aston Villa boss Unai Emery not concerned about Marcus Rahsford's United slumpMarcus Rashford's loan move to Aston Villa offers him a crucial chance to revive his career, as Unai Emery backs the England forward to rediscover his best form despite his struggles at Manchester United."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bpl-2025-tamim-iqbal-shakib-al-hasan-bangladesh-fans-2676744-2025-02-08",
      "headline": "Tamim Iqbal's strong 'last message' to fans: No Tamimian, no Shakibian, only BangladeshBPL 2025: Tamim Iqbal said that Bangladesh fans need to stay united and shun the fanbases involving him, Shakib Al Hasan and Mashrafe Mortaza. On Friday, Tamim led Fortune Barishal to glory against the Chittagong Kings. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sa20-2025-rashid-khan-1000-t20-wickets-milestone-mi-cape-town-2676731-2025-02-08",
      "headline": "Feel I can get there: Rashid Khan dreams of 1000-wicket feat in T20sSA20 2025: Rashid Khan said that he has a great chance of reaching the landmark of 1000 wickets in T20s. The spinner will lead MI Cape Town in the final on February 8 against Sunrisers Eastern Cape.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-rohit-sharma-not-to-be-desperate-sanjay-bangar-bad-form-2676727-2025-02-08",
      "headline": "Rohit shouldn't be too desperate: Sanjay Bangar suggests amid form slumpFormer India batting coach Sanjay Bangar believes Rohit Sharma needs to simplify his approach and avoid overanalysing his struggles, suggesting self-reflection and trust in his natural game as the best way to regain form ahead of crucial tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/qatar-open-2025-live-streaming-top-seeds-iga-swiatek-aryna-sabalenka-2676717-2025-02-08",
      "headline": "Qatar Open 2025: Top seeds, prize money and all you need to know Qatar Open 2025: Aryna Sabalenka, Iga Swiatek and other major players will be in action when the WTA 1000 tournament takes place from February 9 to 16 at the Khalifa International Tennis and Squash Complex in Doha. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-lockie-ferguson-in-doubt-hamstring-injury-tri-series-pakistan-2676697-2025-02-08",
      "headline": "Lockie Ferguson in doubt for Champions Trophy with injury: ReportsNew Zealand's Champions Trophy plans face uncertainty as Lockie Ferguson's hamstring injury casts doubt over his availability. The experienced pacer's absence could impact their bowling attack, with Jacob Duffy on standby ahead of the February 12 squad deadline."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-vs-leicester-city-rudd-van-nistelrooy-not-fergie-time-offside-time-harry-maguire-2676681-2025-02-08",
      "headline": "Van Nistelrooy takes sly dig on Manchester United's late winner vs LeicesterRuud van Nistelrooy criticised Manchester United's controversial FA Cup winner and the absence of VAR after Harry Maguire's stoppage-time goal, which appeared offside, knocked Leicester City out of the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-freestyle-chess-grand-slam-subtle-start-magnus-carlsen-2676667-2025-02-08",
      "headline": "Gukesh's subtle start in Freestyle Chess Grand Slam amid format controversyWorld champion D Gukesh made a steady start at the Freestyle Chess Grand Slam, adapting to the unique format amid rising tensions between FIDE and organisers, while Magnus Carlsen and other top players experience mixed fortunes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/maaya-rajeshwaran-tennis-prodigy-wta-125-semi-final-rafael-nadal-academy-2676660-2025-02-08",
      "headline": "Who is Maaya Rajeshwaran? 15-year-old tennis prodigy into WTA 125 semi-finalAt just 15, Maaya Rajeshwaran's stunning run at the L&T Mumbai Open has made her the youngest Indian to earn a WTA point, cementing her place as one of the country's brightest tennis prospects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jacob-bethell-ind-vs-eng-rcb-ipl-2025-royal-challengers-bengaluru-2676571-2025-02-08",
      "headline": "They always chant RCB, RCB: Jacob Bethell overwhelmed by support in IndiaEngland all-rounder Jacob Bethell opened up on receiving massive support in India after bagging a Rs 2.60 crore deal with RCB for IPL 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-vs-leicester-city-rudd-van-nistelrooy-not-fergie-time-offside-time-harry-maguire-2676681-2025-02-08",
      "headline": "Van Nistelrooy takes sly dig on Manchester United's late winner vs LeicesterRuud van Nistelrooy criticised Manchester United's controversial FA Cup winner and the absence of VAR after Harry Maguire's stoppage-time goal, which appeared offside, knocked Leicester City out of the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-freestyle-chess-grand-slam-subtle-start-magnus-carlsen-2676667-2025-02-08",
      "headline": "Gukesh's subtle start in Freestyle Chess Grand Slam amid format controversyWorld champion D Gukesh made a steady start at the Freestyle Chess Grand Slam, adapting to the unique format amid rising tensions between FIDE and organisers, while Magnus Carlsen and other top players experience mixed fortunes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/maaya-rajeshwaran-tennis-prodigy-wta-125-semi-final-rafael-nadal-academy-2676660-2025-02-08",
      "headline": "Who is Maaya Rajeshwaran? 15-year-old tennis prodigy into WTA 125 semi-finalAt just 15, Maaya Rajeshwaran's stunning run at the L&T Mumbai Open has made her the youngest Indian to earn a WTA point, cementing her place as one of the country's brightest tennis prospects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jacob-bethell-ind-vs-eng-rcb-ipl-2025-royal-challengers-bengaluru-2676571-2025-02-08",
      "headline": "They always chant RCB, RCB: Jacob Bethell overwhelmed by support in IndiaEngland all-rounder Jacob Bethell opened up on receiving massive support in India after bagging a Rs 2.60 crore deal with RCB for IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-axar-patel-keep-rishabh-pant-on-bench-sanjay-manjrekar-reacts-2676635-2025-02-08",
      "headline": "Could Axar Patel keep Rishabh Pant on bench in Champions Trophy? Manjrekar reactsSanjay Manjrekar feels that Axar Patel's versatility could force Rishabh Pant to spend time on the bench. Axar scored a fine fifty during India's 1st ODI win against England in Nagpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sl-vs-aus-sam-konstas-travis-head-sri-lanka-vs-australia-2676580-2025-02-08",
      "headline": "I understand why Travis Head opened the batting in Sri Lanka: Sam KonstasYoung Australia opener Sam Konstas recently shared his thoughts on not getting an opportunity to play in the ongoing series against Sri Lanka. Konstas warmed the bench in the series as Travis Head opened the innings for Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-vs-new-zealand-tri-series-babar-azam-opening-mohammad-rizwan-2676575-2025-02-07",
      "headline": "King will do it: Rizwan on who will open for Pakistan in tri-series openerPakistan captain Mohammad Rizwan hinted that Babar Azam could be the one opening the batting for his side in the tri-series opener against New Zealand on February 8. Babar is expected to play the role during the ICC Champions Trophy later this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-india-vs-england-2nd-odi-indian-team-england-arrival-bhubaneswar-cuttack-2676555-2025-02-07",
      "headline": "IND vs ENG: Team India, England get grand welcome in Odisha ahead of 2nd ODIThe Indian team and England received a grand welcome from the fans as they reached Bhubaneswar Airport on Friday, February 7 ahead of the second ODI in Cuttack. Fans arrived to get a glimpse of the stars as both teams made their way to the team hotels. India hold a 1-0 lead and will be aiming to wrap it up with a win in the match on Sunday. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}