{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-for-the-first-time-7-common-errors-new-taxpayers-must-avoid-2751883-2025-07-07",
      "headline": "Filing ITR for the first time? 7 common errors new taxpayers must avoidFiling your ITR is not enough. You must verify it too. If you forget, the tax department treats it as if you never filed it at all. You can e-verify using Aadhaar OTP, net banking, or by sending a signed physical copy. Without verification, your return stays incomplete."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/house-rent-above-rs-50000-heres-the-tds-rule-you-need-to-know-2751860-2025-07-07",
      "headline": "House rent above Rs 50,000? Here's the TDS rule you need to knowFor tenants living in high-rent homes, the line between a routine payment and a tax lapse can be thinner than it seems, and ignoring it can invite penalties that quickly snowball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hul-share-price-hindustan-unilever-q1-results-brokerage-views-ubs-nuvama-should-you-buy-2751850-2025-07-07",
      "headline": "HUL shares gain 2% today. Should you buy the FMCG stock?HUL share price: The stock has gained 3.67% in the last five trading sessions. However, when looking at a longer time frame, the stock is still down 7.97% over the past year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lost-rs-18-lakh-in-6-months-financial-advisor-abhishek-walia-warning-on-online-betting-2751836-2025-07-07",
      "headline": "Lost Rs 18 lakh in 6 months: Financial advisor's warning on online bettingWhat begins as casual fun can spiral into secrecy, debt, and broken trust. A financial advisor warns that, without strong regulation, betting apps are fast becoming one of India's biggest financial threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tariffs-steel-auto-aluminium-interim-trade-deal-us-trump-deadline-commerce-2751832-2025-07-07",
      "headline": "Tariffs on steel, auto unlikely in interim trade deal with US: Government sourcesWith the US to soon notify countries of higher tariffs by July 9, with new rates effective August 1, sectoral levies on steel, auto and aluminium are unlikely in the India-US interim trade deal, government sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-100-points-lower-nifty-below-25500-hul-up-1-percent-2751812-2025-07-07",
      "headline": "Sensex opens 100 points lower, Nifty below 25,500; HUL up 2%The S&P BSE Sensex was down by 65.28 points to 83,367.61, while the NSE Nifty50 lost 16.45 points to 25,444.55 as of 9:50 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-trade-letters-india-deal-global-trade-what-to-expect-stock-market-2751802-2025-07-07",
      "headline": "Trump reveals tariff letter plan with a twist: Here's what's coming nextTrump also said that any country supporting what he called the 'Anti-American policies' of the BRICS group will face an additional 10% tariff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-trade-setup-trump-tariff-trade-deal-india-bse-nse-2751784-2025-07-07",
      "headline": "Stock market opening: Will Sensex, Nifty fall as Trump singals delay in tariffs?The Gift Nifty futures were trading at 25,512 as of 8:08 am., suggesting that the Nifty 50 may open around its previous close of 25,461. Sensex and Nifty declined by 0.7% each last week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-stark-irony-of-worlds-4th-largest-economy-with-81-crore-free-mealers-2749762-2025-07-06",
      "headline": "The stark irony of world's 4th largest economy with 81 crore free-mealersIndia's growing wealth gap often sparks despair, but the author, a retired ESIC Regional Director, argues the real solution lies in enforcing India's long-ignored labour laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oxford-india-forum-2025-business-leaders-policymakers-entrepreneurs-kalli-purie-isro-ai-2751203-2025-07-05",
      "headline": "Oxford India Forum 2025 celebrates India's rising influence, youthful ambitionThe Oxford India Forum 2025 brought together a dynamic mix of business leaders, policymakers, entrepreneurs, academics and students to reflect on India's evolving global role and the path forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/the-great-indian-salary-crisis-middle-class-unemployment-job-loss-268-04-07-2025",
      "headline": "The Great Indian Salary CrisisWhite-collar employees in India are caught in a salary spiral where costs keep climbing, pay moves slowly, and financial stability slips further away. On paper, the economy is booming, but the pay cheques of working middle-class Indians tell a very different story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-proposes-retaliatory-duties-at-world-trade-body-against-us-tariffs-on-autos-2750911-2025-07-04",
      "headline": "India proposes retaliatory duties at world trade body against US tariffs on autosIndia has proposed to impose an equivalent amount of duty collected from products originating in the United States."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fool-volume-trailer-vir-das-brings-wit-wisdom-laughter-new-standup-show-2751876-2025-07-07",
      "headline": "Fool Volume trailer: Vir Das brings wit, wisdom and laughter in new standup showThe trailer of 'Vir Das: Fool Volume' released on July 7. The upcoming Netflix standup comedy show is scheduled for a July 18 release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-to-make-a-special-appearance-in-ranveer-singh-don-3-sources-2751923-2025-07-07",
      "headline": "Shah Rukh Khan to make a special appearance in Ranveer Singh's Don 3: SourcesShah Rukh Khan will reportedly make a surprising cameo in Ranveer Singh's 'Don 3'. The film is currently in works. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jennifer-aniston-says-the-morning-show-is-layered-complicated-nothing-like-friends-2751886-2025-07-07",
      "headline": "Jennifer Aniston says The Morning Show is layered, complicatedJennifer Aniston shared insights into the demanding and emotionally charged production of Apple TV's 'The Morning Show'. She also highlighted its difference from her earlier work in 'Friends'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brad-pitt-f1-the-movie-review-opinion-brad-pitt-hans-zimmer-2751527-2025-07-07",
      "headline": "Brad Pitt's F1 is a familiarly unfamiliar ride across your favourite racing circuit'F1 - The Movie' seemed to be like any other sports film that we have seen in the past with the same themes, moments and plot twists. Yet, the Brad Pitt-starrer leaves behind a fresh feeling for a viewer, who may or may not be an ardent fan of Formula One. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nora-fatehi-in-tears-at-mumbai-airport-amid-cryptic-social-media-post-2751839-2025-07-07",
      "headline": "Nora Fatehi in tears at Mumbai airport amid cryptic social media postBollywood actor Nora Fatehi was seen crying at Mumbai airport. Before the incident, she had shared a cryptic post on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-on-bollywood-rejection-nobody-wanted-to-launch-amitabh-bachchan-son-2751857-2025-07-07",
      "headline": "Nobody wanted to launch Amitabh Bachchan's son: Abhishek on industry's rejectionAbhishek Bachchan reflected on his initial days in the industry and shared that he faced initial rejections due to his father's giant film legacy. He said directors were hesitant to launch him, fearing expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aamir-khan-names-vishnu-vishal-jwala-gutta-daughter-mira-hyderabad-ceremony-2751816-2025-07-07",
      "headline": "Aamir Khan travels all the way to Hyderabad to name Vishnu-Jwala Gutta's daughterAamir Khan named the daughter of Vishnu Vishal and Jwala Gutta, Mira, in an emotional ceremony in Hyderabad. The couple shared photos from the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-roaring-with-rage-kantara-chapter-1-birthday-poster-2751830-2025-07-07",
      "headline": "Rishab Shetty roars with rage in birthday poster of Kantara Chapter 1Actor Rishab Shetty's poster from his upcoming fantasy action-thriller 'Kantara: Chapter 1' was unveiled on his birthday. The film is scheduled to release on October 2, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-dismisses-rumours-about-dog-simbas-health-after-shefali-jariwala-death-2751806-2025-07-07",
      "headline": "Parag Tyagi dismisses rumours about dog Simba's health after Shefali Jariwala's deathActor Parag Tyagi addressed rumours about his dog Simba's health after his actor-wife Shefali Jariwala's death. He stated that his pet is doing well and 'performing rituals as a son' to Shefali."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-box-office-collection-day-3-detailed-report-anurag-basu-film-beats-his-life-in-a-metro-in-1st-weekend-2751825-2025-07-07",
      "headline": "Metro In Dino box office Day 3: Basu's film beats his Life in a Metro in 1st weekendAnurag Basu's 'Metro... In Dino' has already surpassed the lifetime earnings of his 2007 romantic classic, 'Life... in a Metro'. The film had an interesting opening weekend, but Monday will determine its true position at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shraddha-kapoor-shares-fun-dance-reel-fans-spot-rahul-mody-behind-the-camera-2751786-2025-07-07",
      "headline": "Shraddha Kapoor shares fun dance reel, but fans spot Rahul Mody behind the cameraActor Shraddha Kapoor shared a playful video with fans spotting her rumoured boyfriend Rahul Mody filming it. The duo is yet to officially confirm their relationship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rashmika-mandanna-deepika-padukone-eight-hour-shift-debate-actor-and-film-team-2751789-2025-07-07",
      "headline": "Rashmika Mandanna on Deepika's 8-hour shift debate: Up to actor and film's teamRashmika Mandanna, in a recent interview, talked about the eight-hour shift debate amid Deepika Padukone's exit from Sandeep Reddy Vanga's over fixed work timings. She explained the working hours in South and Hindi film industries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-arjun-20-year-old-ranveer-singh-40-year-old-dhurandhar-20-year-age-gap-debate-2751768-2025-07-07",
      "headline": "Sara Arjun, 20, romancing Ranveer Singh, 40, in Dhurandhar sparks age-gap debateRanveer Singh's pairing with Sara Arjun in their upcoming film, 'Dhurandhar', has sparked a social media debate about their 20-year age gap. Sara Arjun is a popular actor in Tamil cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vikrant-massey-deepika-padukone-8-hour-shift-request-she-deserves-2751670-2025-07-06",
      "headline": "Vikrant Massey on Deepika Padukone's 8-hour shift request: She deserves itActor Vikrant Massey has backed his 'Chhapaak' (2020) co-star Deepika Padukone's call for shorter work shifts. He also reflected on the importance of flexible timings and financial considerations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-gets-emotional-during-speech-at-us-event-for-telugu-community-2751647-2025-07-06",
      "headline": "Samantha gets emotional during speech at US event for Telugu communityActor Samantha Ruth Prabhu was recently moved to tears during her speech at Telugu Association of North America (TANA) 2025 event. She addressed the North American Telugu community in her speech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/madhavan-praises-priyanka-chopra-heads-of-state-actor-2751617-2025-07-06",
      "headline": "Madhavan gives shout-out to Priyanka's performance in Heads of State, actor reactsActor Priyanka Chopra recently responded to R Madhavan's praise for her performance in 'Heads of State'. The latter expressed pride in her achievements and Hollywood fame."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jackson-wang-joins-vijay-varma-pratik-gandhi-jeetendra-kumar-jaideep-ahlawat-netflix-the-great-indian-kapil-show-watch-viral-video-2751623-2025-07-06",
      "headline": "Jackson Wang to light up Kapil Sharma Show with Vijay Varma, Pratik Gandhi. WatchK-pop idol Jackson Wang is all set to appear in the next episode of Netflix's 'The Great Indian Kapil Show'. He was joined by Vijay Varma, Jeetendra Kumar, Pratik Gandhi, and Jaideep Ahlawat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-takes-a-dig-at-prada-flaunts-og-kolhapuri-footwear-2751597-2025-07-06",
      "headline": "Kareena Kapoor takes a dig at Prada, flaunts her OG Kolhapuri footwearActor Kareena Kapoor flaunted her OG Kolhapuri footwear as she took a dig at Prada following the latest controversy. The luxury brand was called out for copying traditional Kolhapuri chappal designs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-first-look-fans-call-ranveer-singh-beast-new-spy-thriller-2751578-2025-07-06",
      "headline": "Dhurandhar 1st look X review: Fans call Ranveer Singh a beast in new spy-thrillerRanveer Singh surprised fans with the first look of his upcoming film 'Dhurandhar'. The action-packed theme of the spy-thriller received appreciation from fans. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-revelations-nia-custody-mumbai-terror-attacks-26-11-pakistan-connection-2751903-2025-07-07",
      "headline": "Trusted by Pak army, was part of 26/11 plan: Tahawwur Rana's explosive revelationsDuring questioning by the Mumbai Crime Branch in NIA custody, Tahawwur Rana confirmed his presence in Mumbai during the 26/11 attacks and that it was part of the terrorists' plan, sources told India Today TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/any-country-aligning-with-anti-american-policies-of-brics-will-be-charged-additional-10-tariff-warns-trump-2751791-2025-07-07",
      "headline": "Trump warns extra 10% tariff on nations backing Brics' 'anti-American policies'Donald Trump threatened an extra 10 per cent tariff on nations backing Brics' \"anti-American policies\", hours after Brics leaders criticised rising US tariffs but avoided naming him in their Rio Declaration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-disinformation-campaign-rafale-fighter-jets-india-operation-sindoor-pakistan-france-2751769-2025-07-07",
      "headline": "Why China ran disinformation campaign against Rafale jets after India's Op SindoorTo hammer the Rafale fighter jets' reputation, China's foreign missions sought to persuade countries that ordered the French-made fighter not to buy them and encourage others to go for Chinese-made planes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-akash-deep-sister-akhand-jyoti-singh-exclusive-england-vs-india-2751909-2025-07-07",
      "headline": "Don't worry about my cancer, just do well for India: Akash Deep's sisterIndia pacer Akash Deep delivered a remarkable 10-wicket haul at Edgbaston and dedicated it to his sister battling cancer. In an exclusive interview with Aajtak, Akash Deep's sister reacted to her brother's viral interview and her own cancer treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/soham-parekh-is-what-you-get-in-a-world-that-celebrates-hustling-2751895-2025-07-07",
      "headline": "In a world that celebrates hustling, Soham Parekh is what you getEveryone in the IT industry is talking about Soham Parekh. Let's hope more people will now talk about the world of hustling that we have created, a world where people like Soham are just players and not the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/suspicious-boat-another-country-spotted-maharashtra-off-raigad-coast-security-heightened-2751863-2025-07-07",
      "headline": "Suspicious boat, likely from Pak, spotted off Maharashtra coast; state on alertSecurity was heightened after a suspicious boat, believed to bear Pakistani markings, was sighted near the Revdanda coast in Maharashtra's Raigad district."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/special-intensive-revision-sir-electoral-rolls-bihar-citizenship-verification-election-commission-opposition-rjd-congress-2750969-2025-07-07",
      "headline": "Voter rolls revision is legal, moral and essential. So, what's the problem?An intensive vetting of electoral rolls is a must to ensure that only Indian citizens get to decide on the country's politics and policy. If the Election Commission (EC) is mandated to conduct a special intensive revision (SIR) of voter lists, why is there such opposition to the exercise in Bihar from political parties?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-youth-assaulted-made-to-strip-naked-for-sending-obscene-texts-to-ex-girlfriend-actor-darshan-renukaswamy-murder-case-referenced-2751902-2025-07-07",
      "headline": "End up like Darshan case: Man tortured with rods over obscene texts in BengaluruA youth in Bengaluru was abducted, stripped, and brutally assaulted by a group allegedly led by his ex-girlfriend's boyfriend, after he sent obscene messages. The attackers referenced the high-profile Renukaswamy murder case involving actor Darshan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/these-pictures-show-indias-shubhanshu-shukla-is-loving-it-in-space-2751904-2025-07-07",
      "headline": "These pictures show India's Shubhanshu Shukla is loving it in spaceLatest pictures show how Indian astronaut Shubhanshu Shukla is enjoying his stay in zero gravity while working on the science sent from India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-spy-jyoti-malhotra-was-invited-by-kerala-as-state-tourism-influencer-rti-2751875-2025-07-07",
      "headline": "Pak 'spy' Jyoti Malhotra was invited by Kerala as state tourism influencer: RTIAn RTI has revealed that Jyoti Malhotra, now arrested for alleged espionage, toured Kerala as a state-sponsored influencer — raising questions about vetting in the state government's tourism outreach campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-england-test-series-akash-deep-edgbaston-win-2751790-2025-07-07",
      "headline": "Seam, skid and spirit: Akash Deep turns Edgbaston into spectacle of English mayhemEngland vs India, 2nd Test: Akash Deep turned Edgbaston into his personal crime scene, leaving behind a trail of shattered stumps and broken batting egos. Armed with skiddy seamers and a fearless heart, he's rewritten his story: from forgotten backup to India's dangerous weapon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/extradition-process-begins-to-bring-happy-passia-terrorist-behind-punjab-attacks-to-india-from-us-sources-2751833-2025-07-07",
      "headline": "Extradition process begins to bring terrorist Happy Passia to India: SourcesPassia was arrested on April 17 in California's Sacramento by US Immigration and Customs Enforcement following sustained coordination with Indian agencies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-car-hit-and-run-viral-video-defence-colony-lajpat-nagar-flyover-viral-reddit-post-2751917-2025-07-07",
      "headline": "Driver hits auto on Delhi flyover, speeds off. Reddit user shares videoA video of a reckless driver hitting an auto on a Delhi flyover and leaving behind a scene of chaos has gone viral on social media, sparking outrage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-donald-trump-feud-america-party-jabs-back-and-forth-attacks-2751765-2025-07-07",
      "headline": "What's Truth Social? Musk's swipe at Trump after he jabs him over his America PartyTech titan Elon Musk has hit back at US President Donald Trump over his attack on his America Party, questioning about Truth Social and claiming he had never heard of the platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-to-make-a-special-appearance-in-ranveer-singh-don-3-sources-2751923-2025-07-07",
      "headline": "Shah Rukh Khan to make a special appearance in Ranveer Singh's Don 3: SourcesShah Rukh Khan will reportedly make a surprising cameo in Ranveer Singh's 'Don 3'. The film is currently in works. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ghaziabad-woman-beats-elderly-mother-in-law-cctv-video-viral-uttar-pradesh-2751762-2025-07-07",
      "headline": "Video: Elderly woman dragged, beaten by daughter-in-law, her mother in GhaziabadAn elderly woman was dragged and thrashed by her daughter-in-law and her mother in Ghaziabad. A case was registered after CCTV footage came to light."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brad-pitt-f1-the-movie-review-opinion-brad-pitt-hans-zimmer-2751527-2025-07-07",
      "headline": "Brad Pitt's F1 is a familiarly unfamiliar ride across your favourite racing circuit'F1 - The Movie' seemed to be like any other sports film that we have seen in the past with the same themes, moments and plot twists. Yet, the Brad Pitt-starrer leaves behind a fresh feeling for a viewer, who may or may not be an ardent fan of Formula One. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/magnus-carlsen-b-game-chess-win-zagreb-gukesh-2751866-2025-07-07",
      "headline": "My B-game is enough: Magnus Carlsen after winning Grand Chess Tour ZagrebMagnus Carlsen clinched the SuperUnited Rapid and Blitz combined title in Croatia. Carlsen reacted to his win on social media, stating that his B-game was enough to beat the others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-test-captaincy-batting-record-edgbaston-test-2751885-2025-07-07",
      "headline": "Shubman Gill 2.0: How Edgbaston Test marked the rise of a potential India greatENG vs IND: Shubman Gill didn't have a great record outside the subcontinent, but the young India captain has put his best foot forward in the ongoing England tour, scoring runs in heaps and guiding India to a 336-run win at Edgbaston. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-to-hear-pleas-challenging-bihar-voter-rolls-revision-on-thursday-2751870-2025-07-07",
      "headline": "Supreme Court agrees to hear pleas against voter roll revision in poll-bound BiharThe Supreme Court agreed to hear petitions challenging the Special Intensive Revision (SIR) of electoral rolls in Bihar, which will head to polls later this year. The matter will be heard on Thursday (July 10)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fool-volume-trailer-vir-das-brings-wit-wisdom-laughter-new-standup-show-2751876-2025-07-07",
      "headline": "Fool Volume trailer: Vir Das brings wit, wisdom and laughter in new standup showThe trailer of 'Vir Das: Fool Volume' released on July 7. The upcoming Netflix standup comedy show is scheduled for a July 18 release. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/canara-bank-faces-backlash-after-video-shows-staff-unable-to-speak-kannada-to-customer-2751848-2025-07-07",
      "headline": "Don't know English, speak in Kannada: Woman's plea at Canara Bank goes viralA Kannada-speaking woman in Chikkamagaluru was unable to get help from a Canara Bank staffer who didn't speak the language. This triggered public outrage by pro-Kannada groups and renewed demands for Kannada-speaking personnel in rural bank branches."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/heavy-rains-flasg-floods-landslides-himachal-pradesh-uttarakhand-monsoon-2751877-2025-07-07",
      "headline": "78 dead in Himachal, landslide alert in Uttarakhand as heavy rain continuesHeavy rainfall in Uttarakhand and Himachal Pradesh has led to widespread floods, landslides and road closures in several districts, prompting the weather department to issue alerts for more downpour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/f1-nico-hulkenberg-podium-lando-norris-oscar-piastri-ignore-2751837-2025-07-07",
      "headline": "Selfish Norris, Piastri slammed for ignoring Hulkenberg on British GP podiumNico Hulkenberg secured his first ever Formula 1 podium at the British Grand Prix. At the celebrations, he was ignored by both McLaren drivers."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-akash-deep-sister-akhand-jyoti-singh-exclusive-england-vs-india-2751909-2025-07-07",
      "headline": "Don't worry about my cancer, just do well for India: Akash Deep's sisterIndia pacer Akash Deep delivered a remarkable 10-wicket haul at Edgbaston and dedicated it to his sister battling cancer. In an exclusive interview with Aajtak, Akash Deep's sister reacted to her brother's viral interview and her own cancer treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-test-captaincy-batting-record-edgbaston-test-2751885-2025-07-07",
      "headline": "Shubman Gill 2.0: How Edgbaston Test marked the rise of a potential India greatENG vs IND: Shubman Gill didn't have a great record outside the subcontinent, but the young India captain has put his best foot forward in the ongoing England tour, scoring runs in heaps and guiding India to a 336-run win at Edgbaston. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-appoints-sanjog-gupta-as-chief-executive-officer-2751872-2025-07-07",
      "headline": "ICC appoints Sanjog Gupta as Chief Executive OfficerThe International Cricket Council (ICC) has appointed Sanjog Gupta as its new chief executive officer (CEO). He will assume office on July 7, 2025, becoming the seventh CEO in the history of the ICC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/magnus-carlsen-b-game-chess-win-zagreb-gukesh-2751866-2025-07-07",
      "headline": "My B-game is enough: Magnus Carlsen after winning Grand Chess Tour ZagrebMagnus Carlsen clinched the SuperUnited Rapid and Blitz combined title in Croatia. Carlsen reacted to his win on social media, stating that his B-game was enough to beat the others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-flat-tacks-in-england-a-missed-opportunity-for-virat-kohli-2751750-2025-07-07",
      "headline": "Flat tracks on England tour a missed opportunity for Virat Kohli?Did Virat Kohli time his Test retirement right with flat decks on offer on the ongoing England tour? Kohli's childhood coach, Rajkumar Sharma, opened up on the batter's Test retirement in a conversation with India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-criticises-dukes-ball-quality-flat-pitches-england-test-series-2751861-2025-07-07",
      "headline": "Shubman Gill warns declining Dukes ball quality is hurting Test cricket's balanceIndia captain Shubman Gill on Sunday slammed the fast-deteriorating quality of the Dukes ball, while also giving a thumbs down to the trend of flat pitches seen in the first two Tests of the series — despite his own prolific run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-44-birthday-celebrations-cake-ranchi-2751841-2025-07-07",
      "headline": "Watch: MS Dhoni celebrates his 44th birthday with friends, cake and warm wishesMS Dhoni rang in his 44th birthday on Monday with a low-key celebration in Ranchi, surrounded by close friends and familiar faces. A clip from the evening - showing the former India captain in a sleeveless T-shirt, cutting cake and sharing laughs - quickly went viral, giving fans a heartwarming glimpse into the cricketer's special day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/f1-nico-hulkenberg-podium-lando-norris-oscar-piastri-ignore-2751837-2025-07-07",
      "headline": "Selfish Norris, Piastri slammed for ignoring Hulkenberg on British GP podiumNico Hulkenberg secured his first ever Formula 1 podium at the British Grand Prix. At the celebrations, he was ignored by both McLaren drivers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-8-schedule-novak-djokovic-jannik-sinner-iga-swiatek-key-matches-2751824-2025-07-07",
      "headline": "Day 8 schedule: Novak Djokovic, Jannik Sinner, Iga Swiatek take center stageOlympic champion Novak Djokovic and world No. 1 Jannik Sinner headline a star-studded Centre Court line-up on Monday (7 July) as Wimbledon 2025 enters its second week at the All England Club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mexico-wins-10th-concacaf-gold-cup-beating-usa-2-1-2751799-2025-07-07",
      "headline": "Mexico beat USA 2-1 to retain Gold Cup, clinches record-extending 10th titleMexico overcame the United States 2-1 on Sunday at NRG Stadium in Houston, Texas, to successfully defend their CONCACAF Gold Cup trophy and win their 10th title in a thrilling final that was filled with drama from start to finish."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-england-test-series-akash-deep-edgbaston-win-2751790-2025-07-07",
      "headline": "Seam, skid and spirit: Akash Deep turns Edgbaston into spectacle of English mayhemEngland vs India, 2nd Test: Akash Deep turned Edgbaston into his personal crime scene, leaving behind a trail of shattered stumps and broken batting egos. Armed with skiddy seamers and a fearless heart, he's rewritten his story: from forgotten backup to India's dangerous weapon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-44-birthday-celebrations-cake-ranchi-2751841-2025-07-07",
      "headline": "Watch: MS Dhoni celebrates his 44th birthday with friends, cake and warm wishesMS Dhoni rang in his 44th birthday on Monday with a low-key celebration in Ranchi, surrounded by close friends and familiar faces. A clip from the evening - showing the former India captain in a sleeveless T-shirt, cutting cake and sharing laughs - quickly went viral, giving fans a heartwarming glimpse into the cricketer's special day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/f1-nico-hulkenberg-podium-lando-norris-oscar-piastri-ignore-2751837-2025-07-07",
      "headline": "Selfish Norris, Piastri slammed for ignoring Hulkenberg on British GP podiumNico Hulkenberg secured his first ever Formula 1 podium at the British Grand Prix. At the celebrations, he was ignored by both McLaren drivers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-8-schedule-novak-djokovic-jannik-sinner-iga-swiatek-key-matches-2751824-2025-07-07",
      "headline": "Day 8 schedule: Novak Djokovic, Jannik Sinner, Iga Swiatek take center stageOlympic champion Novak Djokovic and world No. 1 Jannik Sinner headline a star-studded Centre Court line-up on Monday (7 July) as Wimbledon 2025 enters its second week at the All England Club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mexico-wins-10th-concacaf-gold-cup-beating-usa-2-1-2751799-2025-07-07",
      "headline": "Mexico beat USA 2-1 to retain Gold Cup, clinches record-extending 10th titleMexico overcame the United States 2-1 on Sunday at NRG Stadium in Houston, Texas, to successfully defend their CONCACAF Gold Cup trophy and win their 10th title in a thrilling final that was filled with drama from start to finish."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-england-test-series-akash-deep-edgbaston-win-2751790-2025-07-07",
      "headline": "Seam, skid and spirit: Akash Deep turns Edgbaston into spectacle of English mayhemEngland vs India, 2nd Test: Akash Deep turned Edgbaston into his personal crime scene, leaving behind a trail of shattered stumps and broken batting egos. Armed with skiddy seamers and a fearless heart, he's rewritten his story: from forgotten backup to India's dangerous weapon."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}