{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/still-waiting-for-your-tax-refund-5-common-itr-errors-and-how-to-correct-them-2833121-2025-12-09",
      "headline": "Still waiting for your tax refund? 5 common ITR errors and how to correct themIf your tax refund is taking longer than usual, you're not the only one. In most cases, the delay isn't due to the system but small filing mistakes that can easily be fixed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cbi-files-criminal-case-against-anil-ambanis-son-jai-anmol-in-rs-228-crore-banking-fraud-case-2833151-2025-12-09",
      "headline": "Anil Ambani's son Jai Anmol named in Rs 228 crore banking fraud case by CBIThe complaint alleges cheating, criminal conspiracy and criminal misconduct that led to a wrongful loss of Rs 228.06 crore to the bank involved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/corona-remedies-wakefit-innovations-ipo-subscription-update-investor-interest-latest-gmp-2833122-2025-12-09",
      "headline": "Wakefit vs Corona: Which IPO offers the best value? Check detailsIn terms of demand, Corona Remedies is witnessing stronger interest from investors. As of December 9, 2025, the Corona Remedies IPO is subscribed 1.78 times overall"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kaynes-technology-shares-rally-over-9-percent-today-why-is-the-stock-rising-2833126-2025-12-09",
      "headline": "Kaynes Technology shares jump over 9% today: Why is the stock rising?The rebound comes amid bargain hunting and selective buying after the recent correction was triggered by a critical report from Kotak, which flagged gaps in disclosures and raised concerns around the company's working capital position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-falling-rupee-liquidity-crunch-dalal-street-under-pressure-2833106-2025-12-09",
      "headline": "Rupee weakness, liquidity stress: Why Sensex and Nifty are under pressureIn the past few sessions, benchmark indices have stayed under pressure. Is the falling rupee to blame, or is foreign selling creating a liquidity squeeze? Here's why Dalal Street is on edge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-gold-maintain-its-upward-momentum-despite-todays-decline-2833059-2025-12-09",
      "headline": "Can gold maintain its upward momentum despite today's decline?Gold and silver prices remain cautious as investors await the US Federal Reserve's interest rate decision, with experts highlighting recent market trends and key support levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/insurance-complaints-under-watch-what-you-need-to-know-about-proposed-ombudsman-rules-2833054-2025-12-09",
      "headline": "Proposed insurance ombudsman rules: What policyholders should knowThe Insurance Regulatory and Development Authority of India (IRDAI) recently released the Draft Internal Insurance Ombudsman Guidelines, 2025. These rules propose a new accountability structure inside insurance companies to speed up dispute resolution and reduce harassment of consumers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-new-itr-forms-coming-before-fy28-heres-what-the-government-says-new-income-tax-act-2833022-2025-12-09",
      "headline": "Are new ITR forms coming before FY28? Here's what the government saysThe Indian government is preparing to implement a new Income Tax Act from April 1, 2026. This article examines the upcoming changes to tax forms, the timeline for notification, and the government's efforts to simplify compliance for taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-down-today-sensex-nifty-foreign-selling-key-reasons-explained-2832981-2025-12-09",
      "headline": "Sensex falls over 700 points: Why is the stock market down today?The Sensex has slipped over 700 points to fall below 84,400, while the Nifty has tumbled below 25,800, led by losses in banking, metal, and IT stocks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-350-points-lower-nifty-below-25900-kotak-bank-down-1-percent-2832965-2025-12-09",
      "headline": "Sensex opens 350 points lower, Nifty below 25,900; Kotak Bank down 1%The S&P BSE Sensex lost 400.82 points to 84,701.87, while the NSE Nifty50 lost 134.80 points to 25,825.75 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-stock-market-trading-setup-nse-bse-rise-or-fall-us-trade-deal-fii-outflows-2832953-2025-12-09",
      "headline": "Sensex, Nifty today: Will stock market fall again?The Gift Nifty futures were trading at 25,964.5 around 8:03 am, hinting that the Nifty 50 might open close to Monday's closing level of 25,960.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-aequs-ipo-listing-december-10-gains-expected-profit-market-debut-latest-gmp-2832939-2025-12-09",
      "headline": "Meesho, Aequs IPO debut: Can these listings make you rich? GMP gives a hintMeesho and Aequs shares are set for their stock market debut on December 10. Both IPOs attracted robust investor attention during the bidding phase. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-allows-nvidia-h200-ai-chip-exports-china-glbs-2832915-2025-12-09",
      "headline": "Trump greenlights Nvidia H200 AI chip sales to China as US gets 25% cutDonlad Trump said that he had informed President Xi Jinping of China, where Nvidia's chips are under government scrutiny, about the move and he \"responded positively,\" according to Trump's post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-considers-tariffs-indian-rice-unfair-dumping-us-farmers-glbs-2832913-2025-12-09",
      "headline": "Trump considers fresh tariffs on Indian rice as US farmers allege unfair dumpingThis comes after US farmers urged tougher action, arguing that subsidised rice imports are battering US markets and pushing domestic prices down. Donald Trump vowed to \"take care\" of the issue and pressed officials to identify countries accused of undercutting US markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/monopolies-duopolies-and-oligopolies-indigos-unique-grip-on-global-market-2832810-2025-12-08",
      "headline": "Monopolies, duopolies and oligopolies: IndiGo's unique grip on global marketNo airline in any major market of the world dominates its home skies like IndiGo does."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paramount-launches-108-billion-hostile-bid-for-warner-bros-discovery-amid-netflixs-merger-plans-2832807-2025-12-08",
      "headline": "Paramount's $108 billion hostile bid for Warner Bros amid Netflix's merger plansNetflix had appeared to clinch the deal on Friday after a weeks-long bidding battle with Paramount and Comcast, securing a $72 billion equity agreement for Warner Bros Discovery's TV, film studio, and streaming businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-your-home-loan-emis-fall-as-hdfc-pnb-and-3-other-banks-cut-lending-rates-2832689-2025-12-08",
      "headline": "Will your home loan EMIs fall as HDFC, PNB, and 3 other banks cut lending rates?With several banks adjusting their lending rates downwards, home loan customers may soon notice a drop in their EMIs. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/credit-negative-moodys-slams-indigo-for-chaos-cites-lapses-in-regulatory-planning-2832637-2025-12-08",
      "headline": "Credit negative: Moody's slams IndiGo for chaos, cites lapses in regulatory planningIndiGo's recent flight chaos has drawn sharp criticism from Moody's, which says the airline failed to prepare for regulatory changes despite having ample time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-betting-everything-on-one-stock-destroy-9-out-of-10-portfolios-2832488-2025-12-08",
      "headline": "Can betting everything on one stock destroy 9 out of 10 portfolios?Can a single stock, no matter how strong it looks, quietly wipe out years of your savings if the market turns? Have a look."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-600-points-lower-nifty-falls-below-26000-as-fii-selling-spooks-d-street-2832542-2025-12-08",
      "headline": "Sensex slides 600 points, Nifty slips below 26,000 as FII selling spooks Dalal StreetThe S&P BSE Sensex plunged 609.68 points to close at 85,102.69, while the NSE Nifty50 slipped 225.90 points to settle at 25,960.55. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-bachchan-clarifies-aaradhya-not-on-social-media-flags-fake-profile-2833155-2025-12-09",
      "headline": "Aishwarya Rai clarifies Aaradhya is not on social media, flags fake profile Actor Aishwarya Rai Bachchan recently addressed speculation regarding her daughter Aaradhya's social media presence. She was speaking to the media on the sidelines of the Red Sea Film Festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-day-92-major-twists-hit-the-house-as-sanjana-lands-in-jail-2833099-2025-12-09",
      "headline": "Bigg Boss Telugu 9 Day 92: Major twists hit the house as Sanjana lands in jail With the finale fast approaching, Bigg Boss Telugu 9 entered a high-pressure phase on Monday, pushing contestants through emotionally charged tasks and unexpected twists that reshaped the race for the next finalist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bhagyalakshmi-resigns-from-kerala-film-body-over-move-to-reinstate-dileep-2833142-2025-12-09",
      "headline": "Actor Bhagyalakshmi resigns from Kerala film body over move to reinstate Dileep Bhagyalakshmi has resigned from FEFKA, protesting the federation's move to reinstate actor Dileep soon after his acquittal in the actor assault case. She criticised film bodies for prioritising influence over survivor support and vowed to leave all organisations that fail to stand with women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranveer-singh-dhurandhar-trailer-karachi-lyari-reactions-2833118-2025-12-09",
      "headline": "What Karachi's Lyari thinks of Dhurandhar and Ranveer Singh? Check this out Ranveer Singh's Dhurandhar trailer has sparked witty reactions in Karachi's Lyari neighbourhood. Locals responded with humour and pride."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/dhurandhar-proves-india-can-handle-the-truth-without-burning-a-bus-2833120-2025-12-09",
      "headline": "Dhurandhar proves India can handle the truth without burning a bus The masses, which were always handled by the kid gloves of the intellectual elite, quarantined from the harsh past lest they revolt, have suddenly started accessing history beyond their textbooks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/indie-singer-sufr-reveals-the-inspiration-behind-his-viral-hit-bargad-2832743-2025-12-09",
      "headline": "Indie singer Sufr reveals the inspiration behind his viral hit Bargad Indie singer Sufr's song 'Bargad', inspired by a real-life love story, is trending across music platforms. The collaboration with influencer-singer Arpit Bala has earned over 5 million views. In an exclusive interview, Sufr shared his muse for the song and busted a few myths."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-unique-style-piyush-mishra-tribute-late-irrfan-khan-indian-cinema-2833028-2025-12-09",
      "headline": "Ranbir doesn't carry 1% of his legacy, that guy is something else: Piyush Mishra During a recent interview, veteran actor Piyush Mishra shared his views on working with Ranbir Kapoor, highlighting the actor's unique disconnection from his cinematic lineage, and reflected on his experiences with the late Irrfan Khan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bhay-the-gaurav-tiwari-mystery-trailer-karan-tacker-kalki-koechlin-starrer-internet-reaction-2833075-2025-12-09",
      "headline": "Bhay – The Gaurav Tiwari Mystery trailer: Internet reacts to Karan, Kalki starrer The trailer for 'Bhay - The Gaurav Tiwari Mystery' starring Karan Tacker and Kalki Koechlin is out now. The upcoming series is inspired by the life of India's first paranormal investigator. Check out how the Internet has reacted to the trailer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-dhurandhar-look-designer-preetisheel-singh-calls-him-man-of-the-hour-2833093-2025-12-09",
      "headline": "Ranveer's Dhurandhar look designer Preetisheel Singh calls him Man of the hour Makeup and character designer Preetisheel Singh D'souza praised Ranveer Singh's dedication in Dhurandhar, sharing heartfelt BTS moments and calling his craft consistently inspiring. She also highlighted their long-standing collaboration, rooted in trust, hard work and creative evolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-in-a-bloody-bathtub-toxic-makers-mark-100-days-to-release-with-fierce-poster-2833076-2025-12-09",
      "headline": "Yash in a bloody bathtub: Toxic makers mark 100 days to release with fierce poster The team behind Toxic: A Fairy Tale for Grown-Ups has marked 100 days before its release by unveiling a new poster. Yash and Geetu Mohandas' actioner will hit theatres in March 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/real-kashmir-football-club-review-kashmir-youth-football-journey-2832904-2025-12-09",
      "headline": "Real Kashmir Football Club review: Kashmir's struggle and hope through footballRelease Date:Tue Dec 09, 2025 Real Kashmir Football Club series review: The SonyLiv series depicts the real-life origin of Kashmir's first professional football team. The series highlights the region's socio-political challenges and the resilience of its youth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-meets-johnny-depp-red-sea-film-festival-iconic-selfie-2833050-2025-12-09",
      "headline": "Jack Sparrow x Rooh Baba: Kartik Aaryan's epic selfie with Johnny Depp goes viral Bollywood actor Kartik Aaryan shared a memorable moment with Hollywood star Johnny Depp at the Red Sea Film Festival, sparking excitement among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-first-look-ahan-shetty-embodies-bravery-in-tense-combat-ready-poster-2833031-2025-12-09",
      "headline": "Border 2 first look: Ahan Shetty embodies bravery in tense combat-ready poster The first look poster of Ahan Shetty from 'Border 2' has been unveiled, showing the actor in a powerful action moment. The poster shows Shetty's character amid combat, adding to the anticipation ahead of the film's January 2026 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshaye-khanna-proves-again-why-he-is-the-dhurandhar-of-actors-in-bollywood-2833030-2025-12-09",
      "headline": "Akshaye Khanna proves again why he is the Dhurandhar of actors in Bollywood If Chhava earlier this year restored Akshaye Khanna to the mainstream conversation, Dhurandhar has pushed the actor firmly into the centre of it"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vijay-varma-opens-up-on-scrutiny-spotlight-and-being-in-a-public-relationship-2833011-2025-12-09",
      "headline": "Felt beyond my control: Vijay Varma on dating in the public eye, its impact Actor Vijay Varma discusses the impact of his public relationship with Tamannaah Bhatia, media scrutiny, and his transition from supporting roles to leading man following a 14-month break from screen appearances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/india-a-powerful-melting-pot-global-majors-are-watching-hybe-chairman-bang-si-hyuk-2833024-2025-12-09",
      "headline": "India a powerful melting pot, global majors are watching: HYBE Chairman Bang Si-Hyuk HYBE, the South Korean label behind BTS, TXT, SEVENTEEN, and ENHYPEN, has formally launched HYBE INDIA this year. Chairman Bang Si-Hyuk shares the company's vision for India, in an India Today Exclusive interview. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tv-actor-zeeshan-khan-minor-car-accident-mumbai-yari-road-senior-citizens-2833020-2025-12-09",
      "headline": "TV actor Zeeshan Khan's car rams into another vehicle in Mumbai TV actor Zeeshan Khan was involved in a minor car accident late last night in Mumbai. Both parties escaped injury, but police are investigating the cause of the collision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/will-dhurandhar-mark-ranveer-singhs-return-as-a-box-office-frontrunner-2832603-2025-12-09",
      "headline": "Will Dhurandhar mark Ranveer Singh's return as a box office frontrunner? After years of noise, misfires and stalled projects, Ranveer Singh needed a reset. Dhurandhar arrives as the first real spark of a shifting narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rhea-chakraborty-opens-up-on-egg-freezing-2833016-2025-12-09",
      "headline": "Your body clock is telling you: Rhea Chakraborty opens up on egg freezing Rhea Chakraborty shared that she is considering egg freezing at 33, reflecting on the pressure women face while balancing biological timelines with career ambitions."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-pilot-roster-norms-non-negotiable-centre-pushing-for-more-new-airlines-aviation-minister-in-parliament-2833079-2025-12-09",
      "headline": "Duty rules non-negotiable: Minister talks tough on IndiGo, bats for new airlinesThe Aviation Minister said IndiGo operations were stabilising across airports even as he firmly underscored that no airline, however large, would be permitted to cause such hardships to passengers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-winter-session-2025-live-updates-vande-mataram-rajya-sabha-debate-electoral-reforms-discussion-rahul-gandhi-congress-bjp-2832949-2025-12-09",
      "headline": "Live: Kharge rebuts Amit Shah, says Congress led freedom struggle, Sangh served BritishParliament Winter Session Live Updates: A day after PM Narendra Modi initiated the Vande Mataram discussion in the Lok Sabha, the Opposition kicked off a debate on election reforms in the Lower House today. While Congress MP Manish Tewari opened the two-day debate, Leader of the Opposition, Rahul Gandhi, is expected to join later. The opposition has been seeking a discussion on the Special Intensive Revision (SIR) of electoral rolls since Parliament's Monsoon Session, but the Centre suggested a broader debate on election reforms, noting that the Election Commission is an independent constitutional body. Stay tuned to indiatoday.in for all the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dmk-submits-impeachment-notice-to-speaker-to-remove-madras-high-court-judge-gr-swaminathan-over-deepam-row-2833148-2025-12-09",
      "headline": "INDIA bloc MPs submit impeachment notice against judge over lamp lighting rowA delegation of INDIA bloc MPs submitted an impeachment notice against Madras High Court Judge Justice GR Swaminathan with 120 signatures. The move followed the Thiruparankundram Karthigai Deepam row. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-set-to-create-new-provinces-experts-warn-more-harm-than-good-governance-issues-2832787-2025-12-09",
      "headline": "After decades, Pakistan to be divided again; more harm than good, say expertsAfter decades of political hesitation, the long-debated proposal of administrative restructuring of Pakistan is back on the table. Pakistani minister Abdul Aleem Khan has said that carving out smaller provinces is now inevitable. However, experts say that the proposal could do more harm than good."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/dhurandhar-proves-india-can-handle-the-truth-without-burning-a-bus-2833120-2025-12-09",
      "headline": "Dhurandhar proves India can handle the truth without burning a busThe masses, which were always handled by the kid gloves of the intellectual elite, quarantined from the harsh past lest they revolt, have suddenly started accessing history beyond their textbooks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-350-players-finalised-for-auction-quinton-de-kock-makes-surprise-entry-2832984-2025-12-09",
      "headline": "350 players in auction shortlist, in-form wicketkeeper makes surprise entryThe BCCI has unveiled the full list of players finalised for the IPL 2026 auction scheduled to be held in Abu Dhabi on December 16. 240 Indians and 110 overseas players will go under the hammer during the bidding event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/monopolies-duopolies-and-oligopolies-indigos-unique-grip-on-global-market-2832810-2025-12-08",
      "headline": "Monopolies, duopolies and oligopolies: IndiGo's unique grip on global marketNo airline in any major market of the world dominates its home skies like IndiGo does."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/usa-strategy-document-national-security-strategy-sees-india-quad-counter-china-beijing-mentions-pakistan-once-indo-pacific-2832774-2025-12-09",
      "headline": "India an ally against China, boost trade: US policy paper dismisses PakThe new US National Security Strategy casts India and the Quad as central to Washington's plan for the Indo-Pacific, while issuing its toughest takedown of China yet. Europe gets a warning to stand on its own feet, and Pakistan appears only once in the US' strategic roadmap document."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshaye-khanna-proves-again-why-he-is-the-dhurandhar-of-actors-in-bollywood-2833030-2025-12-09",
      "headline": "Akshaye Khanna proves again why he is the Dhurandhar of actors in BollywoodIf Chhava earlier this year restored Akshaye Khanna to the mainstream conversation, Dhurandhar has pushed the actor firmly into the centre of it"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cbi-files-criminal-case-against-anil-ambanis-son-jai-anmol-in-rs-228-crore-banking-fraud-case-2833151-2025-12-09",
      "headline": "Anil Ambani's son Jai Anmol named in Rs 228 crore banking fraud case by CBIThe complaint alleges cheating, criminal conspiracy and criminal misconduct that led to a wrongful loss of Rs 228.06 crore to the bank involved."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-court-issues-notice-to-sonia-gandhi-over-name-in-voter-list-before-acquiring-citizenship-2833119-2025-12-09",
      "headline": "Court notice to Sonia Gandhi over name in voter list before acquiring citizenshipA magisterial court on September 11 dismissed Tripathi's plea, saying the fundamental ingredients necessary to constitute the alleged offences against Sonia Gandhi are lacking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-indigo-crisis-flight-cancellations-nda-parliamentary-meetings-laws-dgca-rules-harass-citizens-rijiju-2833045-2025-12-09",
      "headline": "Rules must ease life, not trouble people: PM's message for ministers, MPs at NDA meetPrime Minister Modi told NDA lawmakers that there should not be any such law or rule that unnecessarily troubles the common citizens. He was addressing a meeting of NDA MPs when he made this comment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-danish-pandor-says-akshaye-khannas-viral-dance-was-fully-improvised-2832940-2025-12-09",
      "headline": "Akshaye Khanna's viral Dhurandhar dance was fully spontaneous: Actor Danish PandorAkshaye Khanna's viral entry scene in Dhurandhar has captured the internet, with Danish Pandor sharing that the actor's crowd-pleasing dance was completely improvised. The moment has amplified the film's growing buzz, adding to the praise for its performances and stylish execution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-meltdown-civil-aviation-minister-k-ram-mohan-naidu-centre-meeting-airline-operators-2832923-2025-12-09",
      "headline": "Nearly 500 IndiGo flights cancelled today; Centre cuts airline's routes by 5%In response to the large-scale disruptions, the Ministry of Civil Aviation (MoCA) has directed IndiGo to reduce 5 per cent of its winter schedule flights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-girlfriend-mahieka-sharma-mumbai-photographers-insta-statement-2833143-2025-12-09",
      "headline": "Cheap sensationalism: Hardik Pandya slams paps over girlfriend Mahieka's photoHardik Pandya has criticised paparazzi for invading his girlfriend Mahieka Sharma's privacy when she was returning from a restaurant in Mumbai on Tuesday. He emphasised the need for dignity and boundaries, urging media to act responsibly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/ahmedabad-couples-dispute-over-onion-garlic-ends-in-divorce-after-11-years-of-marriage-2833072-2025-12-09",
      "headline": "Ahmedabad couple's dispute over onion-garlic ends in divorce after 11 years of marriageAn Ahmedabad couple's 11-year marriage ended in divorce over a dispute about onion and garlic use, which led to the wife taking the case to Gujarat High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranveer-singh-dhurandhar-trailer-karachi-lyari-reactions-2833118-2025-12-09",
      "headline": "What Karachi's Lyari thinks of Dhurandhar and Ranveer Singh? Check this outRanveer Singh's Dhurandhar trailer has sparked witty reactions in Karachi's Lyari neighbourhood. Locals responded with humour and pride."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-divorce-cases-forced-centuries-old-bengaluru-temple-stop-conducting-weddings-priests-marriage-witness-courts-rounds-2833097-2025-12-09",
      "headline": "How surge in divorce cases forced Chola-era Bengaluru temple to bar weddingsThe 12th-century Someshwara Temple in Bengaluru has stopped hosting marriages after priests were spending more time in court than in rituals. Rising divorce cases and fake documents from eloping couples prompted the Ulsoor temple, built in the Chola period, to halt ceremonies to protect its image and avoid legal hassles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/saudi-arabia-selling-alcohol-non-muslim-residents-2833051-2025-12-09",
      "headline": "In a 1st, Saudi starts selling booze to non-Muslims. But there is a barThe development marks a notable policy shift in the Islamic country, home to the religion's two holiest sites. Last year, Riyadh got its first liquor store after more than 70 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/mysterious-ghostly-ring-encircles-the-moon-over-canada-heres-what-it-was-2833098-2025-12-09",
      "headline": "Ghostly ring encircles the Moon over Canada. Here's what it wasThe formation, known as a lunar parhelic circle, is among the rarest atmospheric displays. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/horrifying-moment-roof-collapses-in-himachal-village-wedding-guests-tumble-down-2833043-2025-12-09",
      "headline": "Roof packed with wedding guests collapses in Himachal, accident caught on cameraA video of the incident has surfaced online, showing people gathered on the roof moments before it caved in, bringing down dozens of guests who were taking part in the festivities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/why-young-wealthy-gen-z-indians-are-skipping-the-west-for-dubai-2832010-2025-12-07",
      "headline": "Why young, wealthy Indians are skipping the West for DubaiIs Dubai becoming the new dream destination for India's young achievers? What factors are prompting them to look East instead of West? Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/certificate-parenting-india-impact-student-mental-health-learning-2833091-2025-12-09",
      "headline": "FOMO Parenting: Are we sacrificing childhood for a fear of falling behind?Parents across India are increasingly collecting certificates to enhance children's academic profiles. Educators warn this trend causes anxiety and undermines genuine learning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-origin-youtube-leader-neel-mohan-studied-sanskrit-hindi-chosen-as-time-2025-ceo-of-the-year-lucknow-us-google-2833074-2025-12-09",
      "headline": "Indian-origin YouTube head who studied in Lucknow is TIME's 2025 CEO of the YearYouTube head Neal Mohan has been named TIME's 2025 CEO of the Year for shaping the cultural diet of billions. The Indian-American CEO has strengthened YouTube's dominance since 2023, expanding TV viewership and Shorts. He did his high school in Lucknow, studying Hindi and Sanskrit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/video/dileep-casts-vote-in-aluva-a-day-after-being-acquitted-in-2017-actor-assault-case-2833180-2025-12-09",
      "headline": "Dileep casts vote in Aluva, a day after being acquitted in 2017 actor assault caseDileep arrived with Kavya Madhavan to cast their vote in the 2026 Kerala local body elections. His appearance comes a day after being acquitted in the 2017 actor assault case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-bachchan-clarifies-aaradhya-not-on-social-media-flags-fake-profile-2833155-2025-12-09",
      "headline": "Aishwarya Rai clarifies Aaradhya is not on social media, flags fake profileActor Aishwarya Rai Bachchan recently addressed speculation regarding her daughter Aaradhya's social media presence. She was speaking to the media on the sidelines of the Red Sea Film Festival."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samsons-uncertain-spot-india-t20i-squad-jitesh-sharma-finisher-2833152-2025-12-09",
      "headline": "Is Sanju Samson set for another long stint on the bench? Sanju Samson appears likely to miss out on India's playing XI as the team begins its preparations for the T20 World Cup 2026, with Jitesh Sharma emerging as the preferred wicketkeeper-batter option. India will play 10 T20Is — five against South Africa and another five against New Zealand — in the lead-up to the marquee event, starting in February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-girlfriend-mahieka-sharma-mumbai-photographers-insta-statement-2833143-2025-12-09",
      "headline": "Cheap sensationalism: Hardik Pandya slams paps over girlfriend Mahieka's photo Hardik Pandya has criticised paparazzi for invading his girlfriend Mahieka Sharma's privacy when she was returning from a restaurant in Mumbai on Tuesday. He emphasised the need for dignity and boundaries, urging media to act responsibly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pooja-tomar-ufc-exclusive-mma-academy-plan-childhood-battles-2833117-2025-12-09",
      "headline": "Pooja Tomar vows to guide India's next fighters, plans MMA academy she never had Pooja Tomar wants India's next generation of fighters to receive the guidance she never had. Her dream of opening an academy aims to give young athletes real opportunities, structure and support from the very start."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-four-wickets-haryana-syed-mushtaq-ali-trophy-2025-26-2833102-2025-12-09",
      "headline": "Mohammed Shami sends strong message to selectors with 4-wicket haul vs Haryana Mohammed Shami delivered a four-wicket haul against Haryana in the Syed Mushtaq Ali Trophy 2025–26. His consistent domestic performances raise questions about his continued exclusion from the national team despite proven fitness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mark-wood-ruled-out-ashes-tour-knee-injury-matthew-fisher-called-up-2833073-2025-12-09",
      "headline": "Ashes blow for England: Mark Wood ruled out as injury saga rumbles on Fast bowler Mark Wood has been ruled out of the remaining Ashes series after suffering a recurrence of his left knee injury during the first Test in Perth. England will be without their express pacer after having gone 0-2 down in the five-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbai-indians-ipl-2026-mini-auction-strategy-player-targets-2833060-2025-12-09",
      "headline": "Mumbai Indians IPL 2026 auction strategy explained: Five players MI can target Mumbai Indians (MI) will head into the IPL 2026 auction with the lowest purse amount among all ten franchises. However, they have most of their squad fixed and only need to fix a few holes in their otherwise formidable squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-nathan-lyon-ashes-interview-feeling-filthy-reaction-2833047-2025-12-09",
      "headline": "Ashwin drops bombshell: Nathan Lyon is lucky, I can't vent my frustration like him R Ashwin said he can't freely express frustration without backlash, calling Nathan Lyon lucky for openly venting after being dropped. Lyon admitted feeling filthy and angry after missing out on selection for the second Ashes Test against England in Brisbane earlier this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-list-top-price-2-crore-players-list-cameron-green-josh-inglis-steve-smith-2833027-2025-12-09",
      "headline": "Venkatesh Iyer and Steve Smith headline IPL 2026 top prize bracket The IPL 2026 auction's top bracket features 40 players who have listed themselves at the Rs 2 crore base price. From Cameron Green to Venkatesh Iyer, several marquee names headline a high-stakes bidding battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-stats-preview-hardik-pandya-axar-patel-2832684-2025-12-09",
      "headline": "Hardik, Axar on cusp of historic landmarks as India eye T20I series win vs South Africa India and South Africa are set to clash in a five-match T20I series, starting December 9 in Cuttack. After losing the Test series, India bounced back to win the ODI series and will now aim to carry that momentum into the T20Is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-350-players-finalised-for-auction-quinton-de-kock-makes-surprise-entry-2832984-2025-12-09",
      "headline": "350 players in auction shortlist, in-form wicketkeeper makes surprise entry The BCCI has unveiled the full list of players finalised for the IPL 2026 auction scheduled to be held in Abu Dhabi on December 16. 240 Indians and 110 overseas players will go under the hammer during the bidding event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/josh-hazlewood-out-of-ashes-achilles-injury-pat-cummins-fit-for-third-test-2832969-2025-12-09",
      "headline": "Josh Hazlewood ruled out of Ashes, Pat Cummins set to return for Adelaide Test Australia fast bowler Josh Hazlewood has been ruled out of the entire Ashes series due to an Achilles injury. However, captain Pat Cummins is set to return for the third Test, bolstering Australia's pace attack as they hope to secure an unassailable 3-0 series lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-shadul-thakur-feel-comfortable-mumbai-indians-ipl-2026-2832973-2025-12-09",
      "headline": "Rohit Sharma helped me feel comfortable, play freely in early career: Shardul ThakurShardul Thakur said Rohit Sharma helped him play freely during his early years. The Mumbai Indians all-rounder credited Rohit's support for shaping his confidence and comfort as he prepares for a homecoming season in IPL 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohamed-salah-liverpool-future-arne-slot-no-clue-reaction-uefa-champions-league-2832964-2025-12-09",
      "headline": "Has Salah already played his last Liverpool game? Arne Slot has no clueArne Slot's admission that he has \"no clue\" about Mohamed Salah's future deepened Liverpool's ongoing uncertainty. The fallout from Salah's interview has left the club navigating one of its most delicate moments of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-1st-t20i-cuttack-weather-report-rain-prediction-suryakumar-yadav-2832944-2025-12-09",
      "headline": "IND vs SA 1st T20I, Cuttack weather report: Will rain play spoilsport?IND vs SA: India will face South Africa in a five-match T20I series starting December 9 at Barabati Stadium. There are slight chances of rain ahead of the first T20I in Cuttack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-1st-t20i-cuttack-suryakumar-yadav-poor-form-gautam-gambhir-2832928-2025-12-09",
      "headline": "Can Suryakumar Yadav rediscover his best form with T20 World Cup looming large?IND vs SA: Suryakumar Yadav hasn't had the best of years in T20Is, but has a chance to regain his form in India's five-match T20I series against South Africa, starting December 9 in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-live-streaming-1st-t20i-preview-predicted-playing-xis-cuttack-conditions-2832648-2025-12-09",
      "headline": "1st T20I: Coach Gambhir back to his comfort zone as India begin World Cup pushIND vs SA 1st T20I preview: Coach Gautam Gambhir returns to his favourite hunting ground as reigning world champions India begin their official march towards the home T20 World Cup with the opening match of a five-game series against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhanas-latest-instagram-post-viral-calm-isnt-silence-2832902-2025-12-08",
      "headline": "Smriti Mandhana's latest Instagram post goes viral: Calm isn't silenceSmriti Mandhana's latest Instagram post has set the internet ablaze with fans implying that there is more to the caption than what meets the eye. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/caroline-garcia-rejects-betting-sponsorship-tennis-player-wellbeing-2832897-2025-12-08",
      "headline": "Ex-World No.4 turns down 270000-dollar offer from betting company in bold moveFormer World No.4 Caroline Garcia turned down a 270,000 dollars betting sponsorship for her podcast, prioritising athlete welfare and integrity over money.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohamed-salah-omitted-liverpool-squad-inter-milan-champions-league-transfer-speculation-2832884-2025-12-08",
      "headline": "Salah dropped from Liverpool's Champions League squad vs Inter after public outburstMohamed Salah has been left out of Liverpool's squad for their Champions League match against Inter Milan following his public criticism of the club and manager Arne Slot. The Egyptian forward, set to participate in the Africa Cup of Nations with Egypt later this month, was not named among the 19 players travelling to Italy, raising questions about his future at Anfield."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-1st-t20i-hardik-pandya-opts-out-training-shubman-gill-returns-two-hour-net-session-cuttack-2832880-2025-12-08",
      "headline": "Hardik Pandya opts out of training, Gill returns with intense two-hour net sessionIND vs SA, 1st T20I: Hardik Pandya skipped India's training session as a precaution ahead of the T20I opener, while Shubman Gill returned with a long, intense batting stint in Cuttack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-next-scan-december-rehab-plan-after-specialist-review-2832829-2025-12-08",
      "headline": "Shreyas Iyer's next scan in December, rehab plan to follow after specialist reviewAll eyes are on Shreyas Iyer's mid-December scan, which will decide when he can begin rehab at the COE and take his first real step back towards competitive cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-having-to-prove-themselves-is-laughable-ashwin-2832816-2025-12-08",
      "headline": "Virat Kohli, Rohit Sharma having to prove themselves is laughable: R AshwinFormer India off-spinner Ravichandran Ashwin has slammed the critics questioning Virat Kohli and Rohit Sharma, insisting the iconic duo have nothing left to prove at this stage of their careers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smat-2025-sai-sudharsan-hits-100-tamil-nadu-gujarat-titans-ahmedabad-modi-stadium-2832817-2025-12-08",
      "headline": "SMAT 2025: Sai Sudharsan back in T20 mode after poor Test form, hits 100 in AhmedabadSMAT 2025: After a poor run of form in Test cricket, Sai Sudharsan found his mojo in the shorter format, slamming a hundred for Tamil Nadu in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajinkya-rahane-unbeaten-95-mumbai-odisha-syed-mushtaq-ali-trophy-ipl-2832813-2025-12-08",
      "headline": "SMAT: After KKR retention, Ajinkya Rahane makes strong statement with unbeaten 95Ajinkya Rahane sent a strong reminder of his value to KKR with an unbeaten 95 that powered Mumbai to a nine-wicket win over Odisha and secured their top spot in Elite Group A of the Syed Mushtaq Ali T20 Trophy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-brendon-mccullum-ben-stokes-ashes-australia-england-2832803-2025-12-08",
      "headline": "Brendon McCullum echoes Ben Stokes' weak men remark: England can't have a glass jawEngland head coach Brendon McCullum has urged his team to stay tough and fully committed as they face a must-win situation in the Ashes after going 0–2 down in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-aiden-markram-on-how-south-africa-plan-vs-abhishek-sharma-t20is-2832790-2025-12-08",
      "headline": "How South Africa plan to counter in-form Abhishek Sharma in T20I series vs IndiaSouth Africa T20I captain Aiden Markram put a premium on Abhishek Sharma's wicket, saying the new-age Indian opener embodies the fearless and ultra-aggressive style of play that has reshaped the format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-1st-t20i-predicted-xi-sanju-samson-jitesh-sharma-wicketkeeper-race-anrich-nortje-return-cuttack-2832721-2025-12-08",
      "headline": "IND vs SA 1st T20I Predicted XIs: Sanju Samson vs Jitesh Sharma in wicketkeeper raceIND vs SA 1st T20I Predicted XIs: Selection intrigue peaks in Cuttack as India weigh their options for the wicketkeeper with the Samson–Jitesh duel, Gill's return and Nortje's comeback shaping a gripping start to the T20I series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-1st-t20i-aiden-markram-presser-cuttack-rohit-virat-2832755-2025-12-08",
      "headline": "Relieved by Ro-Ko absence, South Africa ready with fresh plans for India: MarkramIND vs SA, 1st T20I: South Africa captain Aiden Markram admitted he is relieved by the absence of Virat Kohli and Rohit Sharma, but maintained that India remain a formidable force in the shortest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-marsh-retires-sheffield-shield-future-test-cricket-uncertain-2832723-2025-12-08",
      "headline": "Mitchell Marsh giving up Test return hopes? Australia star makes big career decisionAustralia all-rounder Mitchell Marsh will retire from Sheffield Shield cricket at the end of the 2025–26 season, putting his future in Test cricket in serious doubt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-press-parth-jindal-aakash-chopra-stop-picking-fight-2832681-2025-12-08",
      "headline": "Gautam Gambhir advised to stop picking fights after jibe at Parth JindalAakash Chopra has urged Gautam Gambhir to moderate his tone following a fiery press conference after India's ODI series win against South Africa. The advice comes amid Gambhir's criticism of media and Delhi Capitals co-owner Parth Jindal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-sa-1st-t20i-toss-trick-suryakumar-yadav-press-conference-cuttack-2832685-2025-12-08",
      "headline": "1st T20I: Suryakumar Yadav continues to be captain cool at pressersIND vs SA, 1st T20I: Suryakumar Yadav once again lived up to his \"captain cool\" persona as he fielded questions with trademark composure on the eve of the first T20I against South Africa. Asked about India's unusual new approach at the toss and the team's recent streak of losses, Suryakumar dismissed any fuss around the method, saying he was more than happy to follow KL Rahul's lead for the series. \"I'll do it with my left hand as well,\" he smiled."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}