{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/astronomer-ceo-andy-byron-quits-after-coldplay-kiss-cam-scandal-2758451-2025-07-20",
      "headline": "Astronomer CEO Andy Byron quits after Coldplay kiss cam scandalDataOps firm Astronomer's CEO, Andy Byron, has resigned following a scandal at a Coldplay concert which also involved the firm's HR head, Kristen Cabot. In a statement, the company announced the board of directors had accepted the resignation, stating that \"the company's standard wasn't met.\" The New York-based unicorn company, founded in 2018, confirmed that a search for a new CEO is underway. The resignation followed a board-initiated investigation after an incident at a Coldplay event involving the CEO went viral. The board said that leaders are expected to set the standard in conduct and accountability. There has been no official update regarding any action taken against the HR head, Kristen Cabot, who is the Chief People's Officer at the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/andy-byron-astronomer-ceo-caught-in-coldplay-kiss-cam-scandal-resigns-glbs-2758389-2025-07-20",
      "headline": "Andy Byron, Astronomer CEO caught in Coldplay kiss cam scandal, resignsAndy Byron resigns as CEO of AI firm Astronomer after a viral 'kiss cam' video with HR chief Kristin Cabot sparked online speculation and prompted an internal review by the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shloka-ambani-interview-she-shares-what-keeps-her-going-career-kids-and-cause-2758378-2025-07-19",
      "headline": "Career, kids and a cause: Shloka Ambani shares what keeps her goingIn a heart-to-heart on Masoom Minawala's podcast, Shloka opened up about her journey—balancing kids, career, and a cause she truly believes in."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/astronomer-ceo-andy-byron-cpo-kristin-cabot-leave-coldplay-concert-video-investigation-statement-2758075-2025-07-19",
      "headline": "Astronomer CEO, HR head sent on leave after Coldplay kiss cam outs 'affair'The company issued an official statement two days after the incident, announcing that its board had initiated an internal investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-sons-forms-ai-171-memorial-trust-ex-gratia-ahmedabad-plane-crash-victims-families-2757926-2025-07-18",
      "headline": "Tata Sons forms AI 171 memorial trust, pledges Rs 1 crore to victims' familiesTata Sons has set up the AI 171 Memorial and Welfare Trust, pledging Rs 1 crore ex gratia per victim and Rs 500 crore in total, to support crash victims, families, and responders. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sold-property-and-want-to-save-tax-this-tax-expert-suggests-a-smarter-way-2757911-2025-07-18",
      "headline": "Sold property and want to save tax? This tax expert suggests a smarter waySelling a property can bring in a tidy profit, but it also comes with a hefty tax bill. Many turn to 54EC bonds to save tax — but tax expert Sujit Bangar says there's a smarter way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-500-points-lower-nifty-below-25000-axis-bank-falls-5-2757793-2025-07-18",
      "headline": "Sensex ends over 500 points lower, Nifty below 25,000; Axis Bank falls 5%The S&P BSE Sensex was down 501.51 points to 81,757.73 at the closing bell, while the NSE Nifty50 settled 143.05 points lower at 24,968.40. Most of the broader market indices also reflected the weak sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/2025-tech-layoffs-amazon-microsoft-google-fuel-job-fears-amid-ai-push-2757700-2025-07-18",
      "headline": "2025 tech layoffs: Amazon, Microsoft, Google fuel job fears amid AI pushThe year 2025 was supposed to be a new chapter. A time when artificial intelligence promised smarter work, faster growth, and a better future. But for tens of thousands of workers across the world, it has meant sleepless nights, and uncertain futures. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/axis-bank-share-price-down-7-percent-why-sell-hold-stock-q1-results-banking-2757697-2025-07-18",
      "headline": "Axis Bank shares tank 7% today. Should you sell or hold the stock?Axis Bank shares: The stock has been on a downward trend in recent times. It has fallen 5.77% in the last five days, 9.14% in the past one month, and 15.27% over the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-retail-acquires-kelvinator-to-expand-appliance-business-2757690-2025-07-18",
      "headline": "Reliance Retail acquires Kelvinator to expand appliance businessReliance believes this move will help it grow faster in the consumer durables sector, connect more closely with customers, and open up bigger long-term opportunities in India's changing market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/wipro-share-price-4-percent-rise-q1-results-revenue-guideline-2757688-2025-07-18",
      "headline": "Explained: Why Wipro shares gained as much as 4% todayThe fourth-largest IT services company in India posted an 11% jump in net profit and a 0.8% rise in revenue—both slightly ahead of market expectations, according to estimates compiled by LSEG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-fd-or-mf-edelweiss-radhika-gupta-shares-3-golden-rules-before-you-invest-2757663-2025-07-18",
      "headline": "Stocks, FD or MF? Edelweiss' Radhika Gupta shares 3 golden rules before you investBefore you begin investing, know how saving and investing are different. Saving keeps your money handy for emergencies or short-term plans, while investing helps it grow for bigger future goals."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-father-sham-suicidal-after-cancer-diagnosis-ready-to-jump-third-floor-2758473-2025-07-20",
      "headline": "Sham Kaushal was suicidal after cancer diagnosis: Wanted to jump from third floorActor Vicky Kaushal's father Sham Kaushal, recalled that following surgery, his doctor had informed him that he might not make it. However, he believes it was his prayers that saw him through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagis-emotional-post-remembers-wife-shefali-jariwala-as-beloved-maasi-2758469-2025-07-20",
      "headline": "Parag Tyagi calls Shefali Jariwala a beloved maasi in emotional postParag Tyagi continues to honour his late wife Shefali Jariwala with touching posts celebrating her loving nature and their cherished memories together. On Sunday, he shared a post remembering the best aunt that she was to her nephew and niece."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/paul-wesley-engaged-to-model-natalie-kuckenburg-after-romantic-italy-trip-2758452-2025-07-20",
      "headline": "Vampire Diaries's Paul Wesley engaged to model-girlfriend Natalie KuckenburgPaul Wesley, known for his role in 'The Vampire Diaries', is engaged to model Natalie Kuckenburg. The couple shared the news privately on Instagram during a trip to Italy, where they have reportedly been visiting since 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-day-2-ahaan-panday-aneet-padda-film-shines-brighter-nears-rs-50-crore-2758434-2025-07-20",
      "headline": "Saiyaara box office Day 2: Ahaan-Aneet's film shines brighter, nears Rs 50 croreMohit Suri's 'Saiyaara' has taken the Indian box office by storm, becoming the biggest surprise hit of the year with a Rs 45 crore collection in just two days. The film's success without star power or heavy promotion signals a strong comeback for romantic dramas, especially among the Gen Z audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-ahaaan-panday-saiyaara-character-casting-story-2758424-2025-07-20",
      "headline": "Exclusive: How a bar night helped Ahaan Panday land Saiyaara, reveals Mohit SuriIn an exclusive conversation with India Today, filmmaker Mohit Suri shared the story behind casting Ahaan Panday in 'Saiyaara'. He said that an unusual test revealed the actor's true character and energy, shaping the film's lead role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/alia-bhatt-gushes-over-saiyaara-stars-ahaan-panday-aneet-padda-calls-film-full-of-soul-2758419-2025-07-20",
      "headline": "Alia Bhatt gushes over Saiyaara stars Ahaan and Aneet, calls film full of soulAlia Bhatt showered heartfelt praise on the film 'Saiyaara' and its lead actors, calling them magical stars and applauding the emotional depth of the story. The film, directed by Mohit Suri and produced by Yash Raj Films, has made a record-breaking debut at the box office, marking a significant success for newcomers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-fans-turn-theatres-into-concert-watch-viral-video-2758336-2025-07-19",
      "headline": "Saiyaara fans turn theatres into concert halls. Videos go viralPlanning to watch Mohit Suri's 'Saiyaara' this weekend? Here's how audiences are reacting to Ahaan Panday and Aneet Padda's big-screen debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hridayapoorvam-teaser-mohanlal-sathyan-anthikad-reunite-feel-good-film-2758324-2025-07-19",
      "headline": "Hridayapoorvam teaser: Mohanlal, Sathyan Anthikad reunite for feel-good filmMohanlal and Sathyan Anthikad reunite to deliver what looks like a heartwarming slice-of-life drama. Take a look at the 'Hridayapoorvam' teaser. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/indian-television-academy-marks-25-years-launch-ita-anthem-2758316-2025-07-19",
      "headline": "Indian Television Academy Awards celebrates 25 years with launch of ITA anthemThe Indian Television Academy completed 25 years in 2025. The academy released an ITA anthem that captures the evolution of Indian television.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-mimics-coldplay-cheating-couple-goes-viral-watch-2758285-2025-07-19",
      "headline": "BTS Jin's funny mimic of Coldplay's cheating couple goes viral. WatchAstronomer CEO Andy Byron and Chief Public Officer Kristin Cabot got caught cheating during a Coldplay concert. BTS member Jin recreated the viral moment on his tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ajay-devgn-son-of-sardaar-2-release-postponed-makes-announce-new-date-2758273-2025-07-19",
      "headline": "Son of Sardaar 2 release postponed, makes announce new dateAjay Devn's 'Son of Sardaar 2' has been postponed. The film was set for a July 25 release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/katy-perry-experiences-mid-air-scare-as-stage-prop-fails-during-show-2758256-2025-07-19",
      "headline": "Katy Perry experiences mid-air scare as stage prop fails during showPop star Katy Perry faced an unexpected glitch during her Lifetimes Tour stop in San Francisco. While performing her hit track 'Roar', the singer was perched on a giant butterfly prop that appeared to malfunction mid-act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-kingdom-hindi-version-titled-saamrajya-to-release-on-july-31-2758251-2025-07-19",
      "headline": "Vijay Deverakonda's Kingdom Hindi version titled Saamrajya, to release on July 31Vijay Deverakonda is all set to make a powerful comeback with 'Kingdom', an action drama releasing on July 31. The film has now been titled 'Saamrajya' in Hindi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angelina-jolie-not-calm-daughter-shiloh-moves-in-with-partner-reports-2758240-2025-07-19",
      "headline": "Angelina Jolie not calm as daughter Shiloh moves in with rumoured partner: ReportsAccording to a recent report, Angelina Jolie's daughter Shiloh has \"temporarily moved in\" with her alleged girlfriend, and it seems the Hollywood star isn't entirely on board with the development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-akon-offers-wild-theories-on-coldplay-astronomer-ceo-andy-byron-kristin-cabot-row-internet-bursts-out-laughing-2758217-2025-07-19",
      "headline": "Singer Akon offers wild theories on Coldplay row, internet bursts out laughingSinger Akon has joined the viral Coldplay concert craze by sharing a hilarious AI-generated video imagining how an embarrassed couple caught on the jumbotron could have avoided their awkward moment. His creative parody has sparked laughter and lively discussions across social media, adding to the ongoing buzz around the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jungkook-teasing-new-solo-music-instagram-comeback-fans-think-so-2758172-2025-07-19",
      "headline": "Is BTS' Jungkook teasing new solo music in cryptic Instagram post? Fans think soBTS member Jungkook made a surprising return to Instagram, unveiling his new handle during a live session with fellow bandmates RM and V. The singer shared his first post under the new username, leaving fans buzzing with speculation about a possible music comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shah-rukh-khan-injured-during-shoot-of-next-release-king-while-attempting-action-sequence-sources-2758171-2025-07-19",
      "headline": "Shah Rukh Khan sustains injury on King sets while filming action sequence: SourcesShah Rukh Khan recently sustained a minor back injury during the shoot of his upcoming film 'King', causing a delay in the production schedule with filming now set to resume in September. Despite the setback, SRK is recuperating well in the UK with his family, and fans remain eager for the film's release featuring a star-studded cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/junior-review-kireeti-reddy-sreeleela-film-is-a-jack-of-all-but-king-of-none-2758167-2025-07-19",
      "headline": "Junior review: Kireeti Reddy's film is a jack of all but king of noneRelease Date:Sat Jul 19, 2025'Junior' film review: This bilingual family drama stars debutant Kireeti Reddy in the lead alongside Genelia Deshmukh and V Ravichandran. While the film showcases all aspects required in a commercial film, there is a sense of half-baked-ness in the final product."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashish-chanchlani-elli-avram-spark-love-in-dreamy-new-track-chandaniyan-2758159-2025-07-19",
      "headline": "Ashish Chanchlani, Elli AvRam spark love in dreamy new track Chandaniyan. WatchAshish Chanchlani and Elli AvRam charm audiences with 'Chandaniyan', a romantic track that beautifully portrays the joy and pain of loving from afar. Their undeniable chemistry in the music video has sparked fan rumours of a real-life romance. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-begins-construction-of-167-billion-mega-dam-over-brahmaputra-in-tibet-2758406-2025-07-20",
      "headline": "China begins construction of $167 billion mega dam over Brahmaputra in TibetThe hydropower project, regarded as the biggest infrastructure project in the world, raised concerns in the lower riparian countries, India and Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-mp-shashi-tharoors-nation-first-message-sometimes-parties-feel-youre-being-disloyal-2758426-2025-07-20",
      "headline": "Sometimes parties feel you're being disloyal: Shashi Tharoor's nation first messageSpeaking at an event in Kochi on 'Peace, Harmony and National Development', Shashi Tharoor said that the nation must come first, and parties are merely vehicles to build a better country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/saudi-arabias-sleeping-prince-al-waleed-bin-khaled-dies-after-20-years-in-coma-2758458-2025-07-20",
      "headline": "Saudi Arabia's 'Sleeping Prince' Al Waleed bin Khaled dies after 20 years in comaBorn in April 1990, Prince Al Waleed was the eldest son of Prince Khaled bin Talal Al Saud, a prominent Saudi royal and nephew of billionaire Prince Al Waleed bin Talal. At the age of 15, while studying at a military college in the UK, the young royal suffered a tragic road accident that left him with severe brain injuries and internal bleeding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-wcl-match-cancelled-after-widespread-outrage-2758407-2025-07-20",
      "headline": "IND vs PAK WCL match called off after players withdraw, organisers apologiseIndia vs Pakistan fixture in the World Championship of Legends has been cancelled after widespread outrage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sunday-special/story/hit-and-run-fauja-singh-road-accident-death-india-capital-ncrb-police-investigation-corruption-delhi-safety-2758365-2025-07-20",
      "headline": "Why India is the land of hit-and-run deathsLegendary marathoner Fauja Singh, 114, was killed in a hit-and-run accident. Over 30,400 people were killed in such accidents in India in 2022. But why do people flee accident spots leaving behind the victim? Fear of being lynched, a sense of impunity, and little value for lives play a role. Police also categorise accidents as hit-and-run to avoid probing them. Can India, where corruption rules, bring down hit-and-run cases?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-leader-rahul-gandhis-i-fight-rss-cpm-ideologically-remark-triggers-india-bloc-rift-2758418-2025-07-20",
      "headline": "Rahul Gandhi's 'I fight RSS, CPM ideologically' remark sparks INDIA bloc riftThe comments, made by Rahul Gandhi at an event in Kerala, were flagged as inappropriate and potentially divisive by leaders of the Left parties, who warned that such statements could send the wrong message to cadres on the ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/rejected-insta-admirer-threatens-married-woman-tries-to-kill-her-kin-in-bengaluru-2758477-2025-07-20",
      "headline": "Rejected Insta 'friend' threatens married woman, tries to kill her kin in BengaluruA man threatened a married woman he befriended on Instagram and tried to kill her kin on a moving bike after she refused to leave her husband."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/can-congresss-haryana-revamp-serve-as-its-template-for-other-states-2757214-2025-07-17",
      "headline": "Can Congress's Haryana revamp serve as its template for other states?The partly democratic, partly high command-driven selection of district chiefs will determine if the party can build real grassroots strength and a future in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/beneath-the-hill-a-lost-world-4000-year-old-settlement-found-in-karnatakas-maski-2758479-2025-07-20",
      "headline": "Beneath the hill, a lost world: 4000-year-old settlement found in Karnataka's MaskiArchaeologists have discovered 4000-year-old artefacts during an excavation near Mallikarjuna Hill and the Anjaneya Swamy Temple in Maski, Raichur district. The findings suggest the presence of an ancient human settlement, highlighting Maski's historical significance once again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jharkhand-minister-irfan-ansaris-sons-hospital-visit-sparks-row-mantri-jis-son-is-here-2758441-2025-07-20",
      "headline": "Mantri ji's son is here: Jharkhand minister's son's hospital inspection sparks rowThe Instagram reel, which quickly went viral, featured Krish walking through the hospital premises flanked by a bodyguard and accompanied by a group of friends. In the clip, he is seen interacting with patients and appearing to listen to their concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/akhilesh-yadav-questions-aniruddhacharya-maharaj-shudra-term-viral-video-caste-debate-india-2758439-2025-07-20",
      "headline": "Akhilesh Yadav, Aniruddhacharya debate on 'Shudra'; Roadside exchange viral nowIn the video, Akhilesh Yadav challenges the use of the term 'Shudra'. Aniruddhacharya Maharaj responds, but his reply appears to leave Yadav unconvinced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/tata-harrierev-review-first-drive-loaded-to-the-gills-with-awd-and-tech-2758449-2025-07-20",
      "headline": "Tata Harrier.ev review, first drive: Loaded to the gills with AWD and techTata has launched the electric version of the Harrier, and this time, it comes with an all-wheel-drive (AWD) option as well. So, is this the electric SUV that enthusiasts have been waiting for? We find out.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/after-launching-raunchy-ai-companions-elon-musk-announces-baby-grok-for-kid-friendly-content-2758460-2025-07-20",
      "headline": "Elon Musk announces 'Baby Grok' for kid-friendly contentElon Musk recently announced that xAI, his AI company and the parent of Grok AI, will bring a new app called Baby Grok. It aims to offer kid-friendly content only. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-father-sham-suicidal-after-cancer-diagnosis-ready-to-jump-third-floor-2758473-2025-07-20",
      "headline": "Sham Kaushal was suicidal after cancer diagnosis: Wanted to jump from third floorActor Vicky Kaushal's father, Sham Kaushal, recalled that after undergoing surgery, his doctor had warned him he might not survive. He believes it was his prayers and faith that helped him pull through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-chief-minister-siddaramaiah-refuses-to-mention-dk-shivakumar-at-party-event-in-mysuru-2758391-2025-07-20",
      "headline": "He's sitting at home: Siddaramaiah refuses to mention DK Shivakumar at party eventStopping his speech midway, Siddaramaiah cited Shivakumar's absence from the event and said that only those present are welcomed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/cricket-football-turf-culture-india-gallant-sports-2758142-2025-07-20",
      "headline": "Play, Connect, Repeat: How turfs are transforming India's sporting spiritThe artificial turf culture is on the rise in India as major cities and states have seen arenas spring up, inviting people to come in and indulge in their favourite sport. But can these turfs bring in a sporting revolution and produce stars?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-506-18-07-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-day-2-ahaan-panday-aneet-padda-film-shines-brighter-nears-rs-50-crore-2758434-2025-07-20",
      "headline": "Saiyaara box office Day 2: Ahaan-Aneet's film shines brighter, nears Rs 50 croreMohit Suri's 'Saiyaara' has taken the Indian box office by storm, becoming the biggest surprise hit of the year with a Rs 45 crore collection in just two days. The film's success without star power or heavy promotion signals a strong comeback for romantic dramas, especially among the Gen Z audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-bloc-opposition-parties-parliament-monsoon-session-raise-pahalgam-terror-justice-trump-ceasefire-bihar-electoral-roll-issues-2758408-2025-07-20",
      "headline": "Pahalgam, Trump claims, Bihar list: INDIA bloc sets Parliament session strategiesThe INDIA bloc plans to raise the Pahalgam attack, Trump's ceasefire claims, concerns over electoral roll revisions in Bihar, the Ahmedabad Air India crash and other key issues in Parliament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-ahaaan-panday-saiyaara-character-casting-story-2758424-2025-07-20",
      "headline": "Exclusive: How a bar night helped Ahaan Panday land Saiyaara, reveals Mohit SuriIn an exclusive conversation with India Today, filmmaker Mohit Suri shared the story behind casting Ahaan Panday in 'Saiyaara'. He said that an unusual test revealed the actor's true character and energy, shaping the film's lead role."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/woman-assistant-sub-inspector-strangled-death-live-in-partner-gujarat-accused-crpf-jawan-2758390-2025-07-20",
      "headline": "CRPF jawan strangles woman cop live-in partner in Gujarat, later surrendersAccused Dilip Dangchia had a heated argument with his live-in partner ASI Aruna Natubhai Jadav and allegedly strangled her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tammy-beaumont-deepti-sharma-obstructing-the-field-law-lords-odi-2758457-2025-07-20",
      "headline": "Why was Tammy Beaumont not given out Obstructing the Field at Lord's: ExplainedENG-W vs IND-W: Tammy Beaumont was at the centre of controversy after India appealed for an Obstructing the Field dismissal against her in the second ODI at the Lord's Cricket Ground. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/andy-byron-astronomer-ceo-caught-in-coldplay-kiss-cam-scandal-resigns-glbs-2758389-2025-07-20",
      "headline": "Andy Byron, Astronomer CEO caught in Coldplay kiss cam scandal, resignsAndy Byron resigns as CEO of AI firm Astronomer after a viral 'kiss cam' video with HR chief Kristin Cabot sparked online speculation and prompted an internal review by the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-father-sham-suicidal-after-cancer-diagnosis-ready-to-jump-third-floor-2758473-2025-07-20",
      "headline": "Sham Kaushal was suicidal after cancer diagnosis: Wanted to jump from third floorActor Vicky Kaushal's father, Sham Kaushal, recalled that after undergoing surgery, his doctor had warned him he might not survive. He believes it was his prayers and faith that helped him pull through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/paul-wesley-engaged-to-model-natalie-kuckenburg-after-romantic-italy-trip-2758452-2025-07-20",
      "headline": "Vampire Diaries's Paul Wesley engaged to model-girlfriend Natalie KuckenburgPaul Wesley, known for his role in 'The Vampire Diaries', is engaged to model Natalie Kuckenburg. The couple shared the news privately on Instagram during a trip to Italy, where they have reportedly been visiting since 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-day-2-ahaan-panday-aneet-padda-film-shines-brighter-nears-rs-50-crore-2758434-2025-07-20",
      "headline": "Saiyaara box office Day 2: Ahaan-Aneet's film shines brighter, nears Rs 50 croreMohit Suri's 'Saiyaara' has taken the Indian box office by storm, becoming the biggest surprise hit of the year with a Rs 45 crore collection in just two days. The film's success without star power or heavy promotion signals a strong comeback for romantic dramas, especially among the Gen Z audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-ahaaan-panday-saiyaara-character-casting-story-2758424-2025-07-20",
      "headline": "Exclusive: How a bar night helped Ahaan Panday land Saiyaara, reveals Mohit SuriIn an exclusive conversation with India Today, filmmaker Mohit Suri shared the story behind casting Ahaan Panday in 'Saiyaara'. He said that an unusual test revealed the actor's true character and energy, shaping the film's lead role."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-anderson-on-sharing-trophy-name-with-sachin-tendulkar-i-feel-out-of-place-2758475-2025-07-20",
      "headline": "James Anderson on sharing trophy name with Sachin Tendulkar: I feel out of placeLegendary England fast bowler James Anderson has said that he feels out of place while sharing his name with Sachin Tendulkar for the England vs India Test series trophy"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-t20i-series-squads-schedule-mitchell-marsh-2758471-2025-07-20",
      "headline": "West Indies vs Australia T20I series: Squads and all you need to knowWI vs AUS: After winning the Test series, Mitchell Marsh's Australia will look to put their best foot forward when they face the Shai Hope-led West Indies in the five-match T20I series. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tammy-beaumont-deepti-sharma-obstructing-the-field-law-lords-odi-2758457-2025-07-20",
      "headline": "Why was Tammy Beaumont not given out Obstructing the Field at Lord's: ExplainedENG-W vs IND-W: Tammy Beaumont was at the centre of controversy after India appealed for an Obstructing the Field dismissal against her in the second ODI at the Lord's Cricket Ground. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-ravichandran-ashwin-address-jealousy-rumours-2758446-2025-07-20",
      "headline": "Was Harbhajan Singh jealous of Ravichandran Ashwin? Spinners address popular beliefFormer India spinners Ravichandran Ashwin and Harbhajan Singh recently addressed the age-old rumour of the latter being jealous of the former during an interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-owen-west-indies-vs-australia-1st-t20i-playing-xi-2758437-2025-07-20",
      "headline": "Mitchell Owen to debut as Australia name XI for 1st T20I vs West IndiesWI vs AUS: After a stellar performance in the BBL 2024-25 and representing Punjab Kings in the IPL, Mitchell Owen will make his debut for Australia in the first T20I against the West Indies in Jamaica. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sanjay-manjrekar-on-shubman-gills-form-2758431-2025-07-20",
      "headline": "Shubman Gill's run-making machine will start running again in Manchester: ManjrekarFormer India cricketer-turned commentator Sanjay Manjrekar has backed Shubman Gill to bounce back to form in the fourth Test against England set to be played from July 23 at Old Trafford in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/cricket-football-turf-culture-india-gallant-sports-2758142-2025-07-20",
      "headline": "Play, Connect, Repeat: How turfs are transforming India's sporting spiritThe artificial turf culture is on the rise in India as major cities and states have seen arenas spring up, inviting people to come in and indulge in their favourite sport. But can these turfs bring in a sporting revolution and produce stars?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-harbhajan-singh-on-jasprit-bumrah-workload-management-2758422-2025-07-20",
      "headline": "Workload management is a new thing: Harbhajan ahead of crucial Manchester TestJasprit Bumrah is one of the most honest cricketers out there and his request for rest should be respected said former cricketer Harbhajan Singh. However, the spinner believes that much is made of the term workload management in international cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-anshul-kamboj-added-to-india-squad-as-cover-for-injured-arshdeep-singh-2758416-2025-07-20",
      "headline": "Anshul Kamboj added to India squad as cover for injured Arshdeep Singh: ReportsHaryana seamer Anshul Kamboj has been added to the India squad for the ongoing Test series against England as cover for the injured Arshdeep Singh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-wcl-match-cancelled-after-widespread-outrage-2758407-2025-07-20",
      "headline": "IND vs PAK WCL match called off after players withdraw, organisers apologiseIndia vs Pakistan fixture in the World Championship of Legends has been cancelled after widespread outrage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-legends-match-wcl-2025-harbhajan-yusuf-sikhar-dhawan-2758388-2025-07-20",
      "headline": "IND vs PAK: Harbhajan Singh, Shikhar Dhawan among stars who pull out of WCL tieHarbhajan Singh, Shikhar Dhawan, Suresh Raina and Yusuf Pathan have withdrawn from the India-Pakistan WCL 2025 match. Their decision comes amid controversy linked to recent geopolitical tensions between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/cricket-football-turf-culture-india-gallant-sports-2758142-2025-07-20",
      "headline": "Play, Connect, Repeat: How turfs are transforming India's sporting spiritThe artificial turf culture is on the rise in India as major cities and states have seen arenas spring up, inviting people to come in and indulge in their favourite sport. But can these turfs bring in a sporting revolution and produce stars?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-harbhajan-singh-on-jasprit-bumrah-workload-management-2758422-2025-07-20",
      "headline": "Workload management is a new thing: Harbhajan ahead of crucial Manchester TestJasprit Bumrah is one of the most honest cricketers out there and his request for rest should be respected said former cricketer Harbhajan Singh. However, the spinner believes that much is made of the term workload management in international cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-anshul-kamboj-added-to-india-squad-as-cover-for-injured-arshdeep-singh-2758416-2025-07-20",
      "headline": "Anshul Kamboj added to India squad as cover for injured Arshdeep Singh: ReportsHaryana seamer Anshul Kamboj has been added to the India squad for the ongoing Test series against England as cover for the injured Arshdeep Singh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-wcl-match-cancelled-after-widespread-outrage-2758407-2025-07-20",
      "headline": "IND vs PAK WCL match called off after players withdraw, organisers apologiseIndia vs Pakistan fixture in the World Championship of Legends has been cancelled after widespread outrage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-legends-match-wcl-2025-harbhajan-yusuf-sikhar-dhawan-2758388-2025-07-20",
      "headline": "IND vs PAK: Harbhajan Singh, Shikhar Dhawan among stars who pull out of WCL tieHarbhajan Singh, Shikhar Dhawan, Suresh Raina and Yusuf Pathan have withdrawn from the India-Pakistan WCL 2025 match. Their decision comes amid controversy linked to recent geopolitical tensions between the two countries."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}