{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-stark-irony-of-worlds-4th-largest-economy-with-81-crore-free-mealers-2749762-2025-07-06",
      "headline": "The stark irony of world's 4th largest economy with 81 crore free-mealersIndia's growing wealth gap often sparks despair, but the author, a retired ESIC Regional Director, argues the real solution lies in enforcing India's long-ignored labour laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oxford-india-forum-2025-business-leaders-policymakers-entrepreneurs-kalli-purie-isro-ai-2751203-2025-07-05",
      "headline": "Oxford India Forum 2025 celebrates India's rising influence, youthful ambitionThe Oxford India Forum 2025 brought together a dynamic mix of business leaders, policymakers, entrepreneurs, academics and students to reflect on India's evolving global role and the path forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/the-great-indian-salary-crisis-middle-class-unemployment-job-loss-268-04-07-2025",
      "headline": "The Great Indian Salary CrisisWhite-collar employees in India are caught in a salary spiral where costs keep climbing, pay moves slowly, and financial stability slips further away. On paper, the economy is booming, but the pay cheques of working middle-class Indians tell a very different story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-proposes-retaliatory-duties-at-world-trade-body-against-us-tariffs-on-autos-2750911-2025-07-04",
      "headline": "India proposes retaliatory duties at world trade body against US tariffs on autosIndia has proposed to impose an equivalent amount of duty collected from products originating in the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/real-estate-vs-mutual-funds-where-should-you-invest-explains-stock-market-expert-2750826-2025-07-04",
      "headline": "Real Estate vs Mutual Funds: Where should you invest, explains stock market expertOwning a house was once every family's dream, but times have changed. With high prices and new ways to invest, is real estate still smart, or are mutual funds better? A stock market expert explains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/video/ankur-mehra-book-pixels-to-profits-creators-must-think-like-startups-not-influencers-2750822-2025-07-04",
      "headline": "Ankur Mehra says creators must think like startups, not influencersAnkur Mehra, in his new book Pixels to Profits, urges creators to stop chasing follower counts and instead build sustainable, multi-platform businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/success-isnt-about-number-of-followers-in-creator-economy-ankur-mehra-2750781-2025-07-04",
      "headline": "Success isn't about number of followers in creator economy: Ankur MehraIn a conversation with Business Today's Sakshi Batra, Ankur Mehra, author of Pixels to Profits, explains what it really takes to succeed in the creator economy, and why chasing viral fame or follower counts may be the wrong metric altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-192-points-higher-nifty-below-25500-infosys-gains-1-percent-2750774-2025-07-04",
      "headline": "Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/prada-kolhapuri-chappal-gi-tag-law-protection-indian-articrafts-artisans-reform-global-policy-fashion-2750757-2025-07-04",
      "headline": "India tags it, West sells it. Can Prada's Kolhapuri row lead to real reform?The luxury brand's new \"toe-ring sandal\" has ignited not just cultural outrage but also legal action in India, with a Public Interest Litigation filed in the Bombay High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-itr-2-and-itr-3-forms-why-they-are-missing-and-what-to-do-income-tax-filing-2750711-2025-07-04",
      "headline": "Where are ITR-2 and ITR-3 forms? Why they're missing and what to doIt's ITR season but many taxpayers can't find the ITR-2 and ITR-3 forms on the Income Tax portal yet. If you have capital gains, foreign income or business income, this delay might worry you. The good news is there's an extended deadline this year. Here's why these forms are missing and what you should do next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sbi-credit-card-rules-changing-from-july-15-here-is-what-cardholders-must-know-2750616-2025-07-04",
      "headline": "SBI credit card rules changing from July 15: Here's what cardholders must knowAt present, many cardholders pay only a small part of their bill to avoid late charges. But now, the way the minimum amount due (MAD) is calculated will change starting July 15, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/exclusive-world-bank-poverty-in-india-measurement-metrics-one-in-four-below-minimum-standard-of-living-2750607-2025-07-04",
      "headline": "One in 4 Indians still below minimum standard of living: World BankDespite a sharp drop in extreme poverty, about one in four Indians still falls below the level needed to meet essential needs and maintain a minimum standard of living."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jackson-wang-joins-vijay-varma-pratik-gandhi-jeetendra-kumar-jaideep-ahlawat-netflix-the-great-indian-kapil-show-watch-viral-video-2751623-2025-07-06",
      "headline": "Jackson Wang to light up Kapil Sharma Show with Vijay Varma, Pratik Gandhi. WatchK-pop idol Jackson Wang is all set to appear in the next episode of Netflix's 'The Great Indian Kapil Show'. He was joined by Vijay Varma, Jeetendra Kumar, Pratik Gandhi, and Jaideep Ahlawat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-takes-a-dig-at-prada-flaunts-og-kolhapuri-footwear-2751597-2025-07-06",
      "headline": "Kareena Kapoor takes a dig at Prada, flaunts her OG Kolhapuri footwearActor Kareena Kapoor flaunted her OG Kolhapuri footwear as she took a dig at Prada following the latest controversy. The luxury brand was called out for copying traditional Kolhapuri chappal designs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-first-look-fans-call-ranveer-singh-beast-new-spy-thriller-2751578-2025-07-06",
      "headline": "Dhurandhar 1st look X review: Fans call Ranveer Singh a beast in new spy-thrillerRanveer Singh surprised fans with the first look of his upcoming film 'Dhurandhar'. The action-packed theme of the spy-thriller received appreciation from fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/richard-gere-14th-dalai-lama-90th-birthday-dharamshala-2751547-2025-07-06",
      "headline": "Actor Richard Gere attends Dalai Lama's 90th birthday, seeks his blessingsActor Richard Gere attended the 14th Dalai Lama's 90th birthday celebrations in Dharamshala. In a heartfelt moment, the Hollywood star was seen receiving blessings from the Tibetan spiritual leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-wishes-lord-of-bling-ranveer-singh-shares-sweet-gesture-wife-deepika-padukone-2751577-2025-07-06",
      "headline": "KJo wishes lord of bling Ranveer Singh, shares his sweet gesture for wife DeepikaKaran Johar shared a special post to celebrate Ranveer Singh's 40th birthday. The filmmaker wrote a heartfelt note and praised the actor's style and what he does to make his wife Deepika Padukone smile. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-reunion-us-allu-arjun-joins-sukumar-sreeleela-recites-iconic-dialogue-2751532-2025-07-06",
      "headline": "Pushpa reunion in US: Allu Arjun joins Sukumar, Sreeleela, recites iconic dialogueAllu Arjun paid tribute to Telugu culture and cinema at the North American Telugu Society (NATS) with his iconic dialogue from 'Pushpa 2'. He also felicitated director K Raghvendra Rao at the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-teaser-ranveer-singh-wreaks-havoc-fierce-new-avatar-r-madhavan-akshaye-khanna-arjun-rampal-aditya-dhar-2751546-2025-07-06",
      "headline": "Dhurandhar first look: Ranveer Singh wreaks havoc in fierce new avatarRanveer Singh shared the gripping first look of his upcoming film 'Dhurandhar'. Also starring R Madhavan, Sanjay Dutt, Akshaye Khanna, and others in key roles, the movie will release in theatres on December 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kaagaz-ke-phool-chronicle-of-guru-dutt-descent-from-hope-to-surrender-pyaasa-2751522-2025-07-06",
      "headline": "Kaagaz Ke Phool: Chronicle of Guru Dutt's descent from hope to surrender'Kaagaz Ke Phool' (1959)explores the contrasting worldviews in Guru Dutt's iconic film 'Pyaasa' (1957). While 'Pyaasa' portrays the artist's defiance against a shallow society, embracing authenticity and love, 'Kaagaz Ke Phool' presents a tragic tale of surrender, loneliness, and despair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-beams-with-pride-abhishek-bachchan-wins-praise-for-kaalidhar-laapata-2751506-2025-07-06",
      "headline": "Big B beams with pride as Abhishek wins praise for Kaalidhar Laapata. See postAmitabh Bachchan shared a heartfelt message for son Abhishek after his latest film 'Kaalidhar Laapata' received an outpouring of love from fans. The veteran actor expressed how his heart swelled with pride seeing the appreciation coming Abhishek's way.\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-emotional-note-for-shefali-jariwala-death-will-find-you-every-time-you-are-born-2751494-2025-07-06",
      "headline": "Parag Tyagi's emotional note for Shefali: Will find you every time you are bornIn an emotional note, actor Parag Tyagi remembered his wife, Shefali Jariwala. He posted old photos together and expressed his love for her in every lifetime.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-box-office-day-2-anurag-basu-film-sara-ali-khan-pankaj-tripathi-ali-fazal-aditya-roy-kapur-saturday-growth-2751474-2025-07-06",
      "headline": "Metro In Dino box office Day 2: Anurag Basu's film shows solid Saturday growthAnurag Basu's 'Metro In Dino' saw a strong jump on day two, raking in Rs 6 crore and pushing its domestic total to Rs 9.5 crore. The boost came largely from evening shows in urban hubs like Pune, NCR, and Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suresh-raina-tamil-cinema-debut-production-no-1-chennai-spirit-2751357-2025-07-05",
      "headline": "Suresh Raina to debut with Tamil film Production No 1: Chennai's spirit with meFormer international cricketer Suresh Raina is all set to make his acting debut with 'Production No 1'. The announcement about Raina's Tamil film was made at a grand event in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-ajay-devgn-clash-with-yrf-son-of-sardaar-felt-helpless-2751336-2025-07-05",
      "headline": "Kajol on Ajay Devgn's clash with YRF over Son of Sardaar: I felt helplessActor Kajol recently recalled how Ajay Devgn's clash with Yash Raj Films over 'Son of Sardaar' (2012) release impacted her. She opened up on how she dealt with it as someone connected to both Ajay and Aditya Chopra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-wipes-instagram-feed-clean-before-40-birthday-dhurandhar-update-aditya-dhar-2751292-2025-07-05",
      "headline": "Ranveer Singh wipes his Instagram feed clean a day before birthday, builds intrigueIn a surprising move, actor Ranveer Singh has cleared his Instagram feed a day before his 40th birthday. This sudden move has left fans speculating the reason behind the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ghaati-release-anushka-shetty-postponed-action-thriller-vikram-prabhu-2751282-2025-07-05",
      "headline": "Anushka Shetty's Ghaati release gets postponed again, producers issue statementThe release date of actor Anushka Shetty's action-drama 'Ghaati' has been postponed yet again. The producers confirmed the same in an official statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-on-paparazzi-culture-nysa-yug-too-young-when-paps-began-chasing-her-2751285-2025-07-05",
      "headline": "Kajol on paparazzi culture: Nysa was too young when paps began chasing herKajol, in a recent interview, opened up about the constant glare of paparazzi and how she's guided her children, Nysa and Yug, to cope with it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-sethupathi-apologises-son-surya-viral-video-controversy-phonenix-release-2751231-2025-07-05",
      "headline": "Vijay Sethupathi apologises over son Surya's viral video: May be unintentionalVijay Sethupathi addressed a recent controversy involving his son Surya at the 'Phoenix' premiere. He offered his clarification on the matter and also apologised to people who were hurt in case of misunderstandings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/freida-pinto-backs-deepika-padukone-hollywood-walk-of-fame-2751204-2025-07-05",
      "headline": "Freida Pinto backs Deepika's spot on Hollywood Walk of Fame: No need for debateActor Freida Pinto recently reacted to Deepika Padukone being named as one of the honouries on the Hollywood Walk of Fame. She slammed the criticism over the same and asked people to take pride in celebrating the South Asian community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/naseeruddin-shah-clarifies-post-backing-diljit-dosanjh-sardaar-ji-3-row-was-taken-down-by-facebook-2751257-2025-07-05",
      "headline": "Naseeruddin Shah says post backing Diljit Dosanjh was taken down by FacebookVeteran actor Naseeruddin Shah recently revealed that his post supporting Diljit Dosanjh amid the 'Sardaar Ji 3' controversy was taken down by Facebook. Shah had earlier shared a strong statement backing the Punjabi actor-singer for proceeding with the release of his film despite the backlash.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-5-weather-updates-edgbaston-2751576-2025-07-06",
      "headline": "Day 5 Live: Akash Deep strikes twice, England staring at defeatEngland (ENG) vs India (IND), 2nd Test Day 5 Live Score and Updates: Akash Deep has dismissed Ollie Pope and Harry Brook in quick succession in his morning spell. England are 5-down and are in deep, deep trouble."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/we-arent-anti-hindi-uddhav-sena-sanjay-raut-distances-from-mk-stalin-imposition-stance-2751579-2025-07-06",
      "headline": "We aren't anti-Hindi: Uddhav Sena distances from Stalin's language stanceClarifying that the Thackeray brothers' stance is only against Hindi imposition in primary schools, Uddhav Sena MP Sanjay Raut wished Stalin luck in his battle, while drawing the line. 'Their stand against the imposition of Hindi means they will not speak Hindi and neither let anyone speak Hindi. But that is not our stand in Maharashtra,' he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/stranded-british-f-35-fighter-jet-moved-from-thiruvananthapuram-airport-after-22-days-2751592-2025-07-06",
      "headline": "Stranded British F-35 jet moved from Thiruvananthapuram airport after 22 daysA team of British technical experts arrived at Thiruvananthapuram airport today to assess the stranded F-35, following which the fighter jet was moved out after 22 days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/chirag-paswan-to-contest-bihar-assembly-polls-bjp-jdu-alliance-faces-new-twist-2751609-2025-07-06",
      "headline": "Chirag Paswan to contest Bihar Assembly polls, NDA alliance faces new twistCurrently, Chirag Paswan is a Lok Sabha MP and a Cabinet minister in Prime Minister Narendra Modi's government under the BJP-led National Democratic Alliance (NDA)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/rice-desi-basmati-supremacy-world-biryani-day-support-kalanamak-joha-gobindobhog-hotel-industry-agriculture-2751240-2025-07-06",
      "headline": "Can Joha, Gobindobhog, Kalanamak beat the basmati-biryani nexus?The long-grain Basmati rice has received government support and surged ahead of other aromatic varieties like UP's Kalanamak, Assam's Joha and West Bengal's Gobindobhog. While basmati acreage and exports have surged, with its long grain suiting the hotel and biryani industry, other aromatic rice varieties await government hand-holding to become bestsellers. Can they beat the basmati-biryani nexus?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-police-constable-vidisha-earned-salary-without-active-duty-probe-ordered-2751622-2025-07-06",
      "headline": "Madhya Pradesh cop earned Rs 28 lakh in 12 years without doing duty. Here's howA police constable from Madhya Pradesh's Vidisha district managed to earn Rs 28 lakh for 12 years without reporting for duty in a single day. When summoned, the constable claimed he was battling mental health issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/supreme-court-seeks-removal-of-d-y-chandrachud-from-official-residence-writes-to-centre-2751543-2025-07-06",
      "headline": "Top court seeks removal of ex-Chief Justice from official home, writes to CentreSupreme Court administration writes to the Ministry of Housing and Urban Affairs, seels removal of former Chief Justice of India, Justice DY Chandrachud from official residence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-7-live-score-updates-carlos-alcaraz-aryna-sabalenka-sonay-kartal-2751607-2025-07-06",
      "headline": "Wimbledon Day 7 Live: Fritz wins 1st set, Sierra vs Siegemund underwayWimbledon Live Score, Day 7: Karen Khachanov advanced to the quarters after beating Kamil Majchrzak of Poland. Later in the day, World No.1 Aryna Sabalenka and five-time Grand Slam champion will be in action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/louis-vuitton-autorickshaw-handbag-drives-internet-into-frenzy-memes-jokes-hilarious-comments-2751524-2025-07-06",
      "headline": "Louis Vuitton's autorickshaw handbag drives Internet into frenzy. Best reactions hereLouis Vuitton's autorickshaw-shaped handbag, blending Indian street culture with luxury, has divided the internet; several call it quirky genius, others see it as cultural appropriation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/reuters-x-account-withheld-in-india-no-official-word-yet-2751427-2025-07-06",
      "headline": "No directive from us: Government on blocking Reuters X account in IndiaThe Centre clarified that no such request to block Reuters's X account was made and said it is working with the microblogging site to resolve the issue."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/rain-with-thunderstorms-lightning-likely-in-delhi-in-coming-hours-orange-alert-issued-2751600-2025-07-06",
      "headline": "Rain with thunderstorms likely in Delhi in coming hours, orange alert issuedGusty winds at maximum surface speeds between 40 and 60 kmph can be expected in the national capital and adjoining areas during this time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/the-great-indian-salary-crisis-middle-class-unemployment-job-loss-268-04-07-2025",
      "headline": "The Great Indian Salary CrisisWhite-collar employees in India are caught in a salary spiral where costs keep climbing, pay moves slowly, and financial stability slips further away. On paper, the economy is booming, but the pay cheques of working middle-class Indians tell a very different story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-teaser-ranveer-singh-wreaks-havoc-fierce-new-avatar-r-madhavan-akshaye-khanna-arjun-rampal-aditya-dhar-2751546-2025-07-06",
      "headline": "Dhurandhar first look: Ranveer Singh wreaks havoc in fierce new avatarRanveer Singh shared the gripping first look of his upcoming film 'Dhurandhar'. Also starring R Madhavan, Sanjay Dutt, Akshaye Khanna, and others in key roles, the movie will release in theatres on December 5."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-serial-killer-ajay-lamba-uttarakhand-murders-cab-drivers-nepal-absconding-hill-2751584-2025-07-06",
      "headline": "Serial killer who killed drivers, dumped bodies in hills, arrested after 24 yearsLamba and his three accomplices posed as customers to book cab rides, directing the drivers to remote Uttarakhand hills where they would murder him and dump his body in deep ravines."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gopal-khemka-murder-rahul-gandhi-crime-capital-blast-at-nitish-kumar-over-patna-tycoon-murder-2751505-2025-07-06",
      "headline": "Patna has become crime capital, says Rahul after tycoon killingThe incident, which was caught on CCTV, has stirred a political row just months ahead of the state assembly elections, with Rahul Gandhi claiming that Bihar needs to be saved from the NDA government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-stark-irony-of-worlds-4th-largest-economy-with-81-crore-free-mealers-2749762-2025-07-06",
      "headline": "The stark irony of world's 4th largest economy with 81 crore free-mealersIndia's growing wealth gap often sparks despair, but the author, a retired ESIC Regional Director, argues the real solution lies in enforcing India's long-ignored labour laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-birmingham-test-historic-win-shubman-gill-edgbaston-2751482-2025-07-06",
      "headline": "India in command, but need a part of history to win Birmingham Test. Here's howENG vs IND: India are in a position of strength in the second Test at Edgbaston in Birmingham with England needing 536 more runs to win while chasing a monumental target of 608. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-502-04-07-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-not-ready-lt-governor-asks-government-to-keep-ban-on-old-vehicles-on-hold-2751581-2025-07-06",
      "headline": "Delhi not ready: Lt Governor asks government to keep ban on old vehicles on holdHe also asked the Delhi government to file a review petition with the Supreme Court and bring to its knowledge the measures undertaken by the government and ask for the reconsideration of its earlier order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kaagaz-ke-phool-chronicle-of-guru-dutt-descent-from-hope-to-surrender-pyaasa-2751522-2025-07-06",
      "headline": "Kaagaz Ke Phool: Chronicle of Guru Dutt's descent from hope to surrender'Kaagaz Ke Phool' (1959)explores the contrasting worldviews in Guru Dutt's iconic film 'Pyaasa' (1957). While 'Pyaasa' portrays the artist's defiance against a shallow society, embracing authenticity and love, 'Kaagaz Ke Phool' presents a tragic tale of surrender, loneliness, and despair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-student-in-china-shares-hostel-tour-youtube-vlog-internet-reacts-2751316-2025-07-05",
      "headline": "Indian student in China shares hostel vlog, Internet says it feels like a C-dramaAn Indian student studying in China shared a hostel tour vlog, offering a glimpse into campus life. The video left viewers comparing it to Chinese dramas."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gopal-khemka-murder-police-suspect-contract-killing-gangster-ajay-verma-suspected-behind-murder-2751530-2025-07-06",
      "headline": "Gangster link, property dispute: What cops are probing in Patna businessman murderThe police suspect that the murder was conducted due to a land dispute and are investigating the case by linking the murder to a contract killing.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/dalai-lama-has-no-authority-to-decide-on-continuation-of-reincarnation-system-chinese-envoy-to-india-2751560-2025-07-06",
      "headline": "Dalai Lama has no authority over reincarnation system: Chinese envoy to IndiaXu Feihong said that the 14th Dalai Lama has already affirmed that the tradition of Dalai Lama succession will go on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-launches-new-political-party-called-america-party-says-we-live-in-one-party-system-glbs-2751435-2025-07-06",
      "headline": "Elon Musk launches America Party to 'give back freedom' after fallout with TrumpElon Musk has announced the formation of the 'America Party', criticising both major US parties as indistinguishable on issues like waste and corruption. He says Americans want real political change."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-martin-zubimendi-transfer-confirmed-real-sociedad-2751624-2025-07-06",
      "headline": "Arsenal sign Spanish midfielder Martin Zubimendi from Real SociedadArsenal have confirmed the incoming transfer of Martin Zubimendi from Real Sociedad. The Spanish midfielder will be a welcome addition and has signed a long-term deal with the London-based club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-7-live-score-updates-carlos-alcaraz-aryna-sabalenka-sonay-kartal-2751607-2025-07-06",
      "headline": "Wimbledon Day 7 Live: Fritz wins 1st set, Sierra vs Siegemund underwayWimbledon Live Score, Day 7: Karen Khachanov advanced to the quarters after beating Kamil Majchrzak of Poland. Later in the day, World No.1 Aryna Sabalenka and five-time Grand Slam champion will be in action. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronald-sister-cryptic-response-diogo-jota-funeral-2751587-2025-07-06",
      "headline": "Why did Ronaldo not show up at Diogo Jota's funeral? Sister clarifiesCristiano Ronaldo's sister issued a cryptic response on social media defending her brother for not turning up to fellow national teammate Diogo Jota's funeral. The two had recently shared the pitch during Portugal's UEFA Nations League final win over Spain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-7-schedule-order-of-play-matches-carlos-alcaras-aryna-sabalenka-2751583-2025-07-06",
      "headline": "Wimbledon Day 7 schedule: Alcaraz vs Rublev, Sabalenka take center-stageWimbledon Day 7 sets up a blockbuster Sunday with Carlos Alcaraz, Aryna Sabalenka, and Sonay Kartal in action. From homegrown heroes to top seeds chasing glory, it's a schedule loaded with high-stakes tennis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-5-weather-updates-edgbaston-2751576-2025-07-06",
      "headline": "Day 5 Live: Akash Deep strikes twice, England five downEngland (ENG) vs India (IND), 2nd Test Day 5 Live Score and Updates: Akash Deep has dismissed Ollie Pope and Harry Brook in quick succession in his morning spell. England are 5-down and are in deep, deep trouble."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-england-batting-coach-marcus-trescothick-fed-up-shubman-gill-batting-birmingham-2751567-2025-07-06",
      "headline": "ENG vs IND: England batting coach fed up with Gill's batting dominanceMarcus Trescothick clearly had more than enough after Shubman Gill put up one of his best performances in whites. He scored a 269 in the first innings and followed it up with 161 to put India in a position of control. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-not-new-to-tough-challenges-608-chase-marcus-trescothick-2751552-2025-07-06",
      "headline": "England not new to tough challenges: Batting coach on 608 chase vs IndiaMarcus Trescothick said England aren't too worried about the 608-run chase, backing the team's belief under Ben Stokes and Brendon McCullum to adapt and fight despite being in a tough position against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/video-lionel-messi-solo-goal-inter-miami-mls-2751544-2025-07-06",
      "headline": "Ankara Messi 2.0: 38-year-old floors 5 defenders to score stunning solo-goalLionel Messi showcased his timeless skill with a stunning solo goal and brace to lead Inter Miami to a 4-1 victory against CF Montreal. The goal reminded fans of his Ankara Messi moment from 2007."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-happy-with-india-pacers-edgbaston-test-morne-morkel-2751539-2025-07-06",
      "headline": "Happy with India pacers, effect of discussions after Leeds Test: Morne MorkelIndia bowling coach Morne Morkel credited strong team discussions after the Leeds loss for the improved bowling display in Edgbaston, praising Mohammed Siraj and Akash Deep for executing their plans with discipline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-5-weather-updates-edgbaston-2751576-2025-07-06",
      "headline": "Day 5 Live: Akash Deep strikes twice, England five downEngland (ENG) vs India (IND), 2nd Test Day 5 Live Score and Updates: Akash Deep has dismissed Ollie Pope and Harry Brook in quick succession in his morning spell. England are 5-down and are in deep, deep trouble."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-england-batting-coach-marcus-trescothick-fed-up-shubman-gill-batting-birmingham-2751567-2025-07-06",
      "headline": "ENG vs IND: England batting coach fed up with Gill's batting dominanceMarcus Trescothick clearly had more than enough after Shubman Gill put up one of his best performances in whites. He scored a 269 in the first innings and followed it up with 161 to put India in a position of control. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-not-new-to-tough-challenges-608-chase-marcus-trescothick-2751552-2025-07-06",
      "headline": "England not new to tough challenges: Batting coach on 608 chase vs IndiaMarcus Trescothick said England aren't too worried about the 608-run chase, backing the team's belief under Ben Stokes and Brendon McCullum to adapt and fight despite being in a tough position against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/video-lionel-messi-solo-goal-inter-miami-mls-2751544-2025-07-06",
      "headline": "Ankara Messi 2.0: 38-year-old floors 5 defenders to score stunning solo-goalLionel Messi showcased his timeless skill with a stunning solo goal and brace to lead Inter Miami to a 4-1 victory against CF Montreal. The goal reminded fans of his Ankara Messi moment from 2007."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-happy-with-india-pacers-edgbaston-test-morne-morkel-2751539-2025-07-06",
      "headline": "Happy with India pacers, effect of discussions after Leeds Test: Morne MorkelIndia bowling coach Morne Morkel credited strong team discussions after the Leeds loss for the improved bowling display in Edgbaston, praising Mohammed Siraj and Akash Deep for executing their plans with discipline."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}