{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-loan-travel-funding-trend-india-expert-advice-holiday-genz-money-tips-2769651-2025-08-11",
      "headline": "Is it smart to use personal loan to fund your next trip?Most of the rise in holiday loans is from non-metro India. In 2025, 71% of borrowers came from Tier-2 and Tier-3 cities, up from 68% in 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-approved-what-is-new-after-withdrawal-of-earlier-draft-2769590-2025-08-11",
      "headline": "New Income Tax Bill approved: What's new after withdrawal of earlier draftThe original Income Tax Bill, 2025, was introduced on February 13 to replace the six-decade-old Income Tax Act, 1961. However, last week, the government decided to pull it back, saying the changes suggested by the Select Committee needed to be included in a fresh draft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icici-bank-minimum-balance-rule-savings-accounts-rbi-governor-sanjay-malhotra-statement-2769568-2025-08-11",
      "headline": "ICICI Bank raises minimum balance to Rs 50,000: What RBI governor saidICICI Bank has raised the minimum balance from Rs 10,000 to Rs 50,000. In semi-urban branches, it has gone up from Rs 5,000 to Rs 25,000. In rural branches, the requirement is now Rs 10,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-to-suspend-delhi-washington-direct-flights-from-september-1-2769548-2025-08-11",
      "headline": "Air India to suspend Delhi-Washington direct flights from September 1Despite the halt of the direct Delhi-Washington service, Air India will continue offering one-stop flights to Washington via partner airlines Alaska Airlines, United Airlines, and Delta Air Lines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-746-points-up-nifty-above-24500-tata-motors-gain-3-percent-2769539-2025-08-11",
      "headline": "Sensex ends 746 points up, Nifty above 24,500; Tata Motors gains 3%The S&P BSE Sensex added 746.29 points to close at 80,604.08, while the NSE Nifty50 gained 221.75 points to end at 24,585.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/equity-mutual-fund-inflows-soar-to-record-high-in-july-key-details-2769533-2025-08-11",
      "headline": "Equity mutual fund inflows soar to record high in July. Check detailsNet flows into equity schemes rose 81% month-on-month to Rs 42,702 crore in July, data from the Association of Mutual Funds in India (AMFI) showed. Overall, assets under management in the mutual fund industry hit a record high at Rs 75.36 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rise-today-why-reasons-amfi-data-sensex-700-points-gain-us-tariff-sbi-shares-2769527-2025-08-11",
      "headline": "Sensex gains 700 points: Why is stock market rising today?The rally was led by public sector banking and auto sector stocks. Banking stocks were in focus after State Bank of India (SBI) posted strong Q1 results, which prompted positive commentary from brokerages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/7-money-myths-that-are-keeping-you-from-maximising-your-financial-worth-2769405-2025-08-11",
      "headline": "From health insurance and tax: 7 money-related myths decodedFrom health insurance and tax filing to investing and retirement planning, understanding the truth behind common myths can help you make confident, well-informed decisions for your future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-5-excel-utility-opens-what-is-it-and-who-must-file-2769440-2025-08-11",
      "headline": "ITR-5 excel utility opens: What is it and who must fileIf filing physically, taxpayers must verify the return by sending the signed ITR-V form to the Centralised Processing Centre (CPC) in Bengaluru within 30 days, unless they choose to e-verify instead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/make-in-india-made-in-china-manufacturing-economics-trade-deficit-report-pm-modi-geopolitical-2769387-2025-08-11",
      "headline": "Why 'Make in India' still depends so much on China-made goodsWhen Prime Minister Narendra Modi launched the 'Make in India' programme in 2014, it was meant to transform India into a global manufacturing hub, create millions of jobs, and reduce dependence on imports, especially from China. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-amd-us-china-semiconductor-chip-sales-agreement-explained-2769358-2025-08-11",
      "headline": "From ban to profit sharing: Inside US deal with Nvidia, AMD on China chip salesThe deal makes the US a direct financial beneficiary of sensitive technology sales to a geopolitical rival. This article looks into the key details of this first-of-its-kind agreement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icici-bank-new-minimum-balance-rules-faqs-charges-and-key-information-2769349-2025-08-11",
      "headline": "ICICI Bank new minimum balance rules: FAQs, charges, and key informationIn metro and urban branches, the minimum average balance will jump from Rs 10,000 to Rs 50,000. For semi-urban areas, it will increase from Rs 5,000 to Rs 25,000."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-coolie-film-anirudh-ravichander-admits-using-chatgpt-creative-block-2769583-2025-08-11",
      "headline": "For Rajinikanth's Coolie, Anirudh admits using ChatGPT to overcome creative blockMusic composer Anirudh Ravichander opened up about his experience of working on the songs for Rajinikanth's latest film, 'Coolie'. He revealed in a recent interview that he used artificial intelligence to overcome a creative block. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-barkha-bisht-entry-tulsi-life-drama-2769605-2025-08-11",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi: Barkha Bisht's stormy entry to create turmoilThe iconic show Kyunki Saas Bhi Kabhi Bahu Thi has returned with a gripping new season. Actor Barkha Bisht's dramatic entry promises to intensify family conflicts and shake Shanti Niketan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-motion-poster-akshay-kumar-arshad-warsi-teaser-launch-2769586-2025-08-11",
      "headline": "Jolly LLB 3 poster: Akshay Kumar and Arshad Warsi's fight begins ahead of teaser launchFeaturing Akshay Kumar and Arshad Warsi, the motion poster of Jolly LLB 3 was released today, ahead of its teaser launch tomorrow (August 12). The upcoming legal comedy-drama is slated for a theatrical release on September 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-shares-cook-dilip-earns-big-from-youtube-vlogs-he-makes-more-than-us-2769637-2025-08-11",
      "headline": "Farah Khan shares cook Dilip earns big from YouTube vlogs: He makes more than usFarah Khan shared that her long-time cook and vlog co-star, Dilip, earns extra for his YouTube appearances, joking that he makes \"more than everyone here put together.\"\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-gets-ua-16-rating-kiara-advani-bikini-scene-trimmed-inappropriate-gesture-cut-2769623-2025-08-11",
      "headline": "War 2 gets U/A 16+ rating, Kiara's bikini scene trimmed, inappropriate gesture cutWar 2 censor details out: The sixth film in YRF's spy universe, starring Hrithik Roshan and Jr NTR, was passed with a U/A 16+ rating by the censor board. The film also saw a few cuts and modifications by the makers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-box-office-prediction-tamil-cinema-rajinikanth-biggest-rs-1000-crore-gamble-2769545-2025-08-11",
      "headline": "Coolie box office prediction: Tamil cinema's biggest Rs 1,000 crore gamble beginsSuperstar Rajinikanth's 'Coolie' is all set to release in theatres on August 14. The film has all the potential to become the Tamil film industry's first Rs 1,000 crore grosser. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-completes-50-years-soorma-bhopali-jailor-dhanno-legendary-characters-2769587-2025-08-11",
      "headline": "Sholay@50: How Soorma, Jailor, Dhanno became legendsIn part 4 of our series celebrating Sholay's 50th anniversary, we spotlight the unforgettable minor characters who, despite brief screen time, became cultural icons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/director-ashwin-kumar-mahavtar-narishimha-success-audiences-spoke-their-hearts-2769599-2025-08-11",
      "headline": "Director Ashwin Kumar on Mahavtar Narishimha success: Audiences spoke their hearts'Mahavtar Narishimha', in an exclusive interview with India Today, spoke about the success of the latest release. He credited the audience for showing their love to the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jonas-brothers-and-demi-lovato-reunite-for-epic-camp-rock-moment-at-metlife-2769509-2025-08-11",
      "headline": "Jonas Brothers and Demi Lovato reunite for epic Camp Rock moment at MetLife. WatchThe Jonas Brothers kicked off their 'JONAS20' tour with a surprise reunion with Demi Lovato, performing iconic 'Camp Rock' songs at MetLife Stadium. The nostalgic moment has reignited fan hopes for a possible 'Camp Rock 3'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-x-reactions-fans-compare-tiger-shroff-film-animal-say-you-cant-ranbir-kapoor-sandeep-reddy-vanga-2769577-2025-08-11",
      "headline": "Baaghi 4 X reactions: Is Tiger being Animal? Fans spot similarities with Ranbir's filmTiger Shroff's 'Baaghi 4' teaser is out. The clip left mixed reactions from fans, with many believing certain scenes were similar to Ranbir Kapoor's 'Animal'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/maluma-schools-mother-for-bringing-1-year-old-baby-to-loud-concert-2769470-2025-08-11",
      "headline": "Singer Maluma schools mother for bringing 1-year-old baby to loud concert. WatchDuring his Mexico City concert, Maluma paused mid-performance to call out a mother for bringing her one-year-old child without ear protection. The singer urged her to be more responsible, stressing that loud concerts can harm children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-fan-once-told-him-he-would-die-for-him-war-2-actor-shares-emotional-story-2769573-2025-08-11",
      "headline": "Jr NTR's fan once told him he'd die for him, War 2 actor shares emotional storyOverwhelmed by the fans' reaction at the 'War 2' event in Hyderabad, Jr NTR recalled how his fans had stood by him for decades - even when he was still making his way into the film industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhadak-2-anubha-fatehpuria-casteism-2769558-2025-08-11",
      "headline": "Dhadak 2 Anubha Fatehpuria: Impossible to be unaware of casteism in today's timeBollywood actor Anubha Fatehpuria shares her experience playing a mother confronting casteism in 'Dhadak 2'. She also discusses the challenges of juggling her acting and architecture careers while highlighting cinema's role in social change."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ibrahim-ali-khan-lacks-depth-says-sarzameen-co-star-piloo-vidyarthi-role-was-edited-2769532-2025-08-11",
      "headline": "Ibrahim Ali Khan lacks depth, says Sarzameen co-star: My role was reduced to nothingActor Piloo Vidyarthi, who recently featured in the action-thriller 'Sarzameen' expressed disappointment over her scenes being trimmed in the final cut. She also reflected on actor Ibrahim Ali Khan's acting skills following the mixed reactions to his performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bosco-martis-war-2-song-janaab-e-aali-choreography-hrithik-roshan-jr-ntr-tiger-shroff-2769536-2025-08-11",
      "headline": "Bosco Martis on Hrithik vs Jr NTR in War 2: It celebrates two incredible performersChereographer Bosco Martis spoke about his experience of working with actors Hrithik Roshan and Jr NTR in 'War 2'. He also opened up about the making of the song 'Janaab-e-Aali', which will be released directly in theatres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jackie-chan-says-big-studios-are-not-filmmakers-they-are-business-guys-2769503-2025-08-11",
      "headline": "Big studios are not filmmakers, they're business guys: Jackie ChanAction star Jackie Chan expressed that modern big-budget productions now seem driven less by passion and more by profit margins. Calling them business guys at an event, Chan said the Hollywood industry is not the same creative playground it used to be. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditya-roy-kapur-opens-up-on-being-praised-more-for-looks-than-acting-2769397-2025-08-11",
      "headline": "Aditya Roy Kapur opens up on being praised more for looks than actingAditya Roy Kapur said people often notice his looks more than his acting, but he doesn't let it affect him. The actor focused on his work, believing that over time, talent will always speak for itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-holland-poses-with-fans-in-bts-moments-from-spider-man-brand-new-day-shoot-2769373-2025-08-11",
      "headline": "Tom Holland poses with fans in BTS moments from Spider-Man: Brand New Day shootTom Holland shared behind-the-scenes moments from the 'Spider-Man: Brand New Day' shoot, enjoying fan interactions on set for the first time. The film, shot in Glasgow, marks his fourth time donning the iconic Spider-Man suit and is set to release in July 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bibliophile-princess-anime-for-girls-who-read-books-2769487-2025-08-11",
      "headline": "Bibliophile Princess: Anime for girls with book in one hand and dream in otherFall in love with 'Bibliophile Princess', the anime every book girl needs. Romance, royalty, and a female lead who'd rather read than mingle."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ukraines-zelenskyy-briefs-pm-modi-on-russian-attacks-discusses-sanctions-both-leaders-to-meet-in-september-2769684-2025-08-11",
      "headline": "Zelenskyy briefs PM Modi on Russian attacks; both leaders to meet in SeptemberZelenskyy, on call with PM Modi, highlighted that at a time when there is finally a diplomatic possibility to end the war, Russia is showing only its desire to continue the occupation and killings instead of demonstrating readiness for a ceasefire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-civic-body-sources-say-no-dog-shelter-sterilise-only-2500-dogs-after-supreme-court-order-2769659-2025-08-11",
      "headline": "No shelter, can sterilise only 2,500 dogs: Delhi civic body sources on court orderDelhi has no dedicated dog shelters and only 20 sterilisation centres with a combined capacity to operate on about 2,500 dogs at a time, sources in the city's civic body said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nuclear-sabre-rattling-paks-stock-in-trade-india-slams-asim-munir-for-will-take-down-half-the-world-threat-2769508-2025-08-11",
      "headline": "Nuclear sabre-rattling Pak's stock-in-trade: India on Asim Munir's threatIndia strongly condemned Pakistan Army Chief Asim Munir's nuclear threat issued from US soil, calling Pakistan's nuclear sabre-rattling a habitual tactic and warning that India will not succumb to such blackmail. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/if-you-come-to-this-country-illegally-you-will-face-detention-and-return-uk-pm-warns-illegal-immigrants-2769640-2025-08-11",
      "headline": "Illegal entry will lead to detention, return: UK PM Keir Starmer's big warningAmid the expansion of the UK's \"deport now, appeal later\" scheme, PM Keir Starmer warned that individuals who enter the country illegally will be subject to immediate detention and deportation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/sholay-completes-50-years-soorma-bhopali-jailor-dhanno-legendary-characters-286-11-08-2025",
      "headline": "Sholay@50: How Soorma, Jailor, Dhanno became legendsIn part 4 of our series celebrating Sholay's 50th anniversary, we spotlight the unforgettable minor characters who, despite brief screen time, became cultural icons."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/congress-high-command-rahul-gandhi-mallikarjun-kharge-voter-fraud-karnataka-kn-rajnna-ec-2769521-2025-08-11",
      "headline": "Karnataka Minister axed over 'voter list revision during Congress rule' remarkKarnataka minister KN Rajanna resigned after voter fraud remarks during the Congress era upset the high command. The controversy coincides with Rahul Gandhi's accusations against the Election Commission for hiding evidence of BJP's vote manipulation in 2024 polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/why-pakistan-army-chief-asim-munir-chose-us-for-nuclear-threat-india-trump-ties-operation-sindoor-south-asia-2769399-2025-08-11",
      "headline": "Why Asim Munir chose the US for his nuclear threat to half the worldPakistan Army chief Asim Munir's nuclear threat from US soil signals more than bluster. It's a calculated move to play to domestic hardliners, try to unsettle India, and leverage warming ties with Donald Trump's Washington DC, just when India-US ties have hit a rough patch. It came on the day the US dropped the atom bomb on Nagasaki, 80 years ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2000-kaun-banega-crorepati-big-bs-small-screen-gamble-25-years-ago-2768914-2025-08-10",
      "headline": "From the India Today archives (2000) | Kaun Banega Crorepati: Big B's small-screen gamble 25 years ago'Lock' the date: August 11 is when Amitabh Bachchan will be on your TV screen hosting the 17th season of Kaun Banega Crorepati"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trump-putin-meet-pm-modi-india-escaped-photo-op-trap-asim-munir-us-president-ukraine-zelenskyy-putin-alaska-2769426-2025-08-11",
      "headline": "How Modi outsmarted Trump, avoided photo-op trapUS President Donald Trump's Nobel Peace Prize ambitions have him collecting photos with warring world leaders. Last week, Trump turned \"peacemaker\" again and got Azerbaijan's President Ilham Aliyev and Armenian PM Nikol Pashinyan in a single frame. He's trying the same for Putin and Zelenskyy in Alaska. However, PM Narendra Modi outsmarted Trump and didn't fall into a photo-op trap with Pakistan's Asim Munir in June."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/man-who-masturbated-in-front-of-model-on-gurugram-road-arrested-days-after-video-went-viral-2769683-2025-08-11",
      "headline": "Man who flashed model on Gurugram road arrested days after video went viralA 32-year-old man, who allegedly masturbated on a model at a busy intersection in Gurugram, has been arrested, days after a video surfaced showing the accused doing the obscene act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-approved-what-is-new-after-withdrawal-of-earlier-draft-2769590-2025-08-11",
      "headline": "New Income Tax Bill approved: What's new after withdrawal of earlier draftThe original Income Tax Bill, 2025, was introduced on February 13 to replace the six-decade-old Income Tax Act, 1961. However, last week, the government decided to pull it back, saying the changes suggested by the Select Committee needed to be included in a fresh draft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/pick-up-stray-dogs-sterilise-do-not-release-supreme-courts-no-compromise-order-for-delhi-ncr-bodies-2769396-2025-08-11",
      "headline": "Top court orders immediate capture of Delhi-NCR stray dogs, warns against interferenceThe Supreme Court ordered Delhi-NCR authorities to urgently catch, sterilise, and permanently relocate stray dogs to shelters, warning that any individual or organisation obstructing the process would face legal action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/can-election-commission-restore-faith-in-the-sanctity-of-the-electoral-process-2769522-2025-08-11",
      "headline": "Can Election Commission restore faith in the sanctity of the electoral process?After the 2024 Lok Sabha polls, a Lokniti-CSDS survey sought citizens' responses on the trust they had in the Election Commission. It showed a sharp decline compared to what was reported five years earlier."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-police-provides-security-cover-to-kapil-sharma-after-two-firing-incidents-at-his-canada-cafe-threats-2769596-2025-08-11",
      "headline": "Kapil Sharma gets security after firings outside his cafe in Canada, threatsMumbai Police has stepped up the security cover for comedian Kapil Sharma following two recent firing incidents at his café in Canada and alleged threats from gangster Lawrence Bishnoi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-h1b-visa-holder-children-at-risk-of-losing-green-card-protection-under-new-policy-trump-administration-uscis-cspa-us-migrants-age-calculation-2769465-2025-08-11",
      "headline": "Children of H-1B visa holders could lose Green Card rights; Indians to be hitStarting August 15, the Trump administration will change how age is calculated under the Child Status Protection Act, impacting thousands of children of H-1B visa holders, mainly Indians. Using the State Department's Final Action Dates chart may cause those turning 21 during processing to lose protected status. Applications filed earlier follow the old rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-bloc-opposition-protest-election-commission-rahul-gandhi-detained-parliament-mahua-moitra-2769438-2025-08-11",
      "headline": "Rahul Gandhi detained, Mahua Moitra faints at chaotic 'vote chori' protestNearly 300 Opposition MPs, led by Rahul Gandhi, marched to the Election Commission in Delhi on Monday over alleged electoral malpractices, but the protest was blocked by the Delhi Police, resulting in several detentions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/i-attended-a-fake-wedding-party-in-delhi-and-this-is-how-it-went-2769336-2025-08-11",
      "headline": "I attended a fake wedding party in Delhi, and this is how it wentLehengas and sarees? Check. Mehndi artist? Check. Marigolds and fairy lights? Check. An elaborate food spread? Umm… not quite. Here's a peek inside a fake wedding event in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-box-office-prediction-tamil-cinema-rajinikanth-biggest-rs-1000-crore-gamble-2769545-2025-08-11",
      "headline": "Coolie box office prediction: Tamil cinema's biggest Rs 1,000 crore gamble beginsSuperstar Rajinikanth's 'Coolie' is all set to release in theatres on August 14. The film has all the potential to become the Tamil film industry's first Rs 1,000 crore grosser. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/are-indias-play-schools-breaking-safety-laws-inside-cramped-unhygienic-classrooms-2769520-2025-08-11",
      "headline": "Flouting laws, risking lives: How unregulated play schools endanger childrenAre our daycares really safe for children?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/blinkit-delivery-agent-get-ready-with-me-video-viral-big-love-celebs-fans-2769582-2025-08-11",
      "headline": "Blinkit delivery agent's Get Ready With Me video gets big love from celebs and fansBlinkit delivery agent Benjamin Ryan Gautam shared the video on his Instagram account with the text overlay: \"Get ready with me because it is my dhandha time.\" "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/anas-al-sharif-terrorist-israel-reporter-al-jazeera-gaza-city-palestine-hamas-israel-idf-war-jounalists-killed-profile-2769423-2025-08-11",
      "headline": "Israel marked Al Jazeera reporter Anas al-Sharif for death a year agoAnas Al Sharif was killed in an Israeli airstrike in Gaza City alongside four other Al Jazeera journalists. Sharif was a Palestinian journalist known for reporting from northern Gaza during the Israel-Hamas conflict. But the Israeli Defence Force (IDF) accused him of being a Hamas operative way back in October 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-barkha-bisht-entry-tulsi-life-drama-2769605-2025-08-11",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi: Barkha Bisht's stormy entry to create turmoilThe iconic show Kyunki Saas Bhi Kabhi Bahu Thi has returned with a gripping new season. Actor Barkha Bisht's dramatic entry promises to intensify family conflicts and shake Shanti Niketan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/man-carries-wife-body-bike-fatal-accident-nagpur-video-2769561-2025-08-11",
      "headline": "Video: Man carries wife's body on bike after fatal accident in NagpurThe man said he pleaded with passing motorists to help him take his wife to the hospital after the accident, but no one stepped forward to help."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-craze-in-us-man-confused-over-avenger-like-popularity-of-rajini-indians-give-him-a-rajinikanth-power-class-2769499-2025-08-11",
      "headline": "US man confused over Coolie craze, Indians give him a Rajinikanth power class When a US man stumbled upon sold-out 'Coolie' shows and sky-high ticket prices, he turned to X for answers, and Rajinikanth fans happily schooled him on the Superstar's God-like craze."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-coolie-film-anirudh-ravichander-admits-using-chatgpt-creative-block-2769583-2025-08-11",
      "headline": "For Rajinikanth's Coolie, Anirudh admits using ChatGPT to overcome creative blockMusic composer Anirudh Ravichander opened up about his experience of working on the songs for Rajinikanth's latest film, 'Coolie'. He revealed in a recent interview that he used artificial intelligence to overcome a creative block. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-barkha-bisht-entry-tulsi-life-drama-2769605-2025-08-11",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi: Barkha Bisht's stormy entry to create turmoilThe iconic show Kyunki Saas Bhi Kabhi Bahu Thi has returned with a gripping new season. Actor Barkha Bisht's dramatic entry promises to intensify family conflicts and shake Shanti Niketan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-motion-poster-akshay-kumar-arshad-warsi-teaser-launch-2769586-2025-08-11",
      "headline": "Jolly LLB 3 poster: Akshay Kumar and Arshad Warsi's fight begins ahead of teaser launchFeaturing Akshay Kumar and Arshad Warsi, the motion poster of Jolly LLB 3 was released today, ahead of its teaser launch tomorrow (August 12). The upcoming legal comedy-drama is slated for a theatrical release on September 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-shares-cook-dilip-earns-big-from-youtube-vlogs-he-makes-more-than-us-2769637-2025-08-11",
      "headline": "Farah Khan shares cook Dilip earns big from YouTube vlogs: He makes more than usFarah Khan shared that her long-time cook and vlog co-star, Dilip, earns extra for his YouTube appearances, joking that he makes \"more than everyone here put together.\"\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-india-womens-world-cup-2025-home-pressure-2769655-2025-08-11",
      "headline": "Be in the moment: Yuvraj Singh's golden advice for India ahead of Women's World CupWomen's World Cup 2025: Former all-rounder Yuvraj Singh urged the Indian women's team to focus on processes rather than results as they try to deal with the burden of playing a major event at home. Harmanpreet Kaur's side will begin their campaign against Sri Lanka in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jack-grealish-everton-loan-move-manchester-city-pep-guardiola-david-moyes-2769675-2025-08-11",
      "headline": "Man City's Jack Grealish set for season-long loan to Everton: ReportManchester City's Jack Grealish is reportedly on the verge of a season-long move to David Moyes' Everton. The English midfielder could be the one that revitalises the attack which underperformed last season.,who"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kingsley-coman-al-nassr-transfer-bayern-munich-reports-saudi-pro-league-2769670-2025-08-11",
      "headline": "Coman completes Saudi move to Al Nassr from Bayern Munich: ReportsKingsley Coman is set to swap Bayern Munich for Al-Nassr in a 30 million euros deal, joining Cristiano Ronaldo and Sadio Mané in Saudi Arabia's star-studded squad as they chase domestic and continental glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-on-test-return-ipl-2025-performance-2025-champions-trophy-2769636-2025-08-11",
      "headline": "Rashid Khan blames early Test return for poor show in Champions Trophy and IPLRashid Khan has said that returning to Test cricket too soon after surgery took a toll on his body. He feels that the decision led to a disappointing Champions Trophy and a below-par IPL 2025 campaign."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/jos-buttler-late-father-emotional-note-the-hundred-2769641-2025-08-11",
      "headline": "Jos Buttler remembers late father with emotional note after playing The HundredJos Buttler has paid tribute to his late father, who passed away a week ago, in a heartfelt post shared on Monday. The England batter uploaded a photograph on Instagram showing the two of them holding the ICC Men's Cricket World Cup trophy from England's 2019 triumph, captioned simply: \"Rest in peace Dad, thank you for everything.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/crystal-palace-lose-cas-appeal-uefa-europa-league-demotion-2769627-2025-08-11",
      "headline": "Why Crystal Palace lost CAS appeal against UEFA on Europa League demotion?Crystal Palace have lost their appeal to the CAS regarding UEFA's decision to demote them from the Europa League. The London-based club are exploring their legal options as it remains firm on its stance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/national-sports-bill-anti-doping-amendment-bill-passed-lok-sabha-2769585-2025-08-11",
      "headline": "National Sports Bill passed in Lok Sabha: What does it mean?The Union Government passed the National Sports Governance Bill and the National Anti-Doping Amendment Bill in the Lok Sabha, amid loud protests from the opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-south-africa-glenn-maxwell-rickleton-catch-legal-icc-new-rules-2769567-2025-08-11",
      "headline": "Was Maxwell's sensational catch vs SA legal according to new ICC rules?Glenn Maxwell's jaw-dropping boundary catch against South Africa sparked debate under the ICC's updated fielding laws. Here's how his effort stacked up against the new one-touch rule — and why it was perfectly legal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-went-down-wrong-path-and-spoilt-his-career-dinesh-lad-2769557-2025-08-11",
      "headline": "Prithvi Shaw went down wrong path and spoilt his career: Rohit Sharma's coachRohit Sharma's childhood coach Dinesh Lad recently recalled Prithvi Shaw's rise to international cricket and said that he went down the wrong path to destroy his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-on-sri-lanka-south-africas-chances-for-wtc-final-2027-2769523-2025-08-11",
      "headline": "South Africa may not reach WTC final 2027, Sri Lanka have better chance: ChopraFormer India cricketer Aakash Chopra said that Sri Lanka have a better chance of reaching the World Test Championship (WTC) final in 2027 than defending champions South Africa. He believes that sub-continent tours will pose a threat to South Africa in this cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-2036-olympics-bid-continuous-dialogue-ioc-host-selection-pause-2769517-2025-08-11",
      "headline": "India in continuous dialogue phase with IOC about 2036 Olympic bid: Sports MinistryIndia's bid to host the 2036 Olympics is currently in the continuous dialogue phase with the IOC's Future Host Commission. The host selection process is paused as the IOC reassesses future election procedures amid doping concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/national-sports-bill-anti-doping-amendment-bill-passed-lok-sabha-2769585-2025-08-11",
      "headline": "National Sports Bill passed in Lok Sabha: What does it mean?The Union Government passed the National Sports Governance Bill and the National Anti-Doping Amendment Bill in the Lok Sabha, amid loud protests from the opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-south-africa-glenn-maxwell-rickleton-catch-legal-icc-new-rules-2769567-2025-08-11",
      "headline": "Was Maxwell's sensational catch vs SA legal according to new ICC rules?Glenn Maxwell's jaw-dropping boundary catch against South Africa sparked debate under the ICC's updated fielding laws. Here's how his effort stacked up against the new one-touch rule — and why it was perfectly legal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-went-down-wrong-path-and-spoilt-his-career-dinesh-lad-2769557-2025-08-11",
      "headline": "Prithvi Shaw went down wrong path and spoilt his career: Rohit Sharma's coachRohit Sharma's childhood coach Dinesh Lad recently recalled Prithvi Shaw's rise to international cricket and said that he went down the wrong path to destroy his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-on-sri-lanka-south-africas-chances-for-wtc-final-2027-2769523-2025-08-11",
      "headline": "South Africa may not reach WTC final 2027, Sri Lanka have better chance: ChopraFormer India cricketer Aakash Chopra said that Sri Lanka have a better chance of reaching the World Test Championship (WTC) final in 2027 than defending champions South Africa. He believes that sub-continent tours will pose a threat to South Africa in this cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-2036-olympics-bid-continuous-dialogue-ioc-host-selection-pause-2769517-2025-08-11",
      "headline": "India in continuous dialogue phase with IOC about 2036 Olympic bid: Sports MinistryIndia's bid to host the 2036 Olympics is currently in the continuous dialogue phase with the IOC's Future Host Commission. The host selection process is paused as the IOC reassesses future election procedures amid doping concerns."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}