{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/governments-favourite-baby-investment-banker-on-indias-real-estate-boom-2748193-2025-06-30",
      "headline": "Government's favourite baby: Investment banker on India's real estate boomInvestment banker Sarthak Ahuja says India's real estate sector isn't in a bubble—it's backed by policy, jobs, and demographics, making it a long-term priority for the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jb-chemicals-shares-plunged-over-6-percent-today-torrent-pharma-explained-2748183-2025-06-30",
      "headline": "Explained: Why JB Chemicals shares plunged over 6% todayThe market reaction came swiftly after Torrent Pharmaceuticals announced it will acquire a controlling 46.39% stake in JB Pharma from global investment firm KKR, with plans to subsequently merge the two companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-to-raise-rs-1000-crore-via-retail-bonds-2748176-2025-06-30",
      "headline": "Adani Enterprises to raise Rs 1,000 crore via retail bondsThe proposed bonds have been rated AA- by both ICRA and Care Ratings, signalling a relatively stable credit outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/finfluencer-startup-found-akshat-shrivastava-corrupt-real-estate-housing-crisis-middle-class-2748173-2025-06-30",
      "headline": "Most corrupt I've seen: Finfluencer on Indian metro real estate marketFinfluencer Akshat Shrivastava is calling metro real estate a \"financial ruin,\" warning middle-class buyers to stop chasing low-yield properties bankrolled by black money and billionaire hoarders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-100-points-nifty-down-slightly-jio-financial-rises-1-2748161-2025-06-30",
      "headline": "Sensex falls over 100 points, Nifty down slightly; Jio Financial rises 1%The BSE Sensex was trading 56.62 points lower at 84,002.28 around 9:24 am. It had fallen over 100 points right after opening. The NSE Nifty50 also fell and was trading 10.55 points lower at 25,627.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-gautam-adani-celebrates-three-birthdays-every-year-2748051-2025-06-29",
      "headline": "Why Gautam Adani celebrates three birthdays every yearBaffling as it may seem, apart from the day he was born, Adani celebrates two other dates. They are dates when he actually snatched life from the jaws of death. These were times when he repeatedly stared down the abyss and emerged unscathed, yet profoundly transformed. Here then is the story of Adani's three birthdays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-is-trumps-big-deal-claim-a-pressure-tactic-experts-weigh-in-2747356-2025-06-27",
      "headline": "India-US trade deal: Is Trump's 'big deal' claim a pressure tactic? Experts weigh inUS President Donald Trump on Thursday announced a trade deal with China on rare earths and hinted at a 'very big' trade agreement with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-rallies-nasdaq-sp-500-record-highs-ai-stocks-fed-policy-recession-fears-ease-2747331-2025-06-27",
      "headline": "Wall Street rallies to record highs as AI stocks soar, recession fears easeUS stock markets hit all-time highs on Friday thanks to an AI boom and Fed hints at looser policy ahead. Trade deals with the UK and China have also fuelled market hopes that a global recession could be avoided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-slashes-fd-and-savings-rates-again-in-june-details-here-2747224-2025-06-27",
      "headline": "HDFC Bank slashes FD and savings rates again in June. Details hereHDFC Bank's latest changes signal that deposit rates could remain soft if the RBI continues its rate-cutting cycle. Depositors should review their plans, stay updated with rate changes, and make informed decisions before booking new FDs or RDs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-may-soon-allow-direct-epf-withdrawals-via-atms-and-upi-2747195-2025-06-27",
      "headline": "EPFO may soon allow direct EPF withdrawals via ATMs and UPIThe EPFO recently increased the auto-settlement limit from Rs 1 lakh to Rs 5 lakh. This means members can get up to Rs 5 lakh cleared automatically within three days for things like medical expenses, education, housing, or marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-300-points-higher-nifty-above-25600-jio-financial-shares-jump-4-2747184-2025-06-27",
      "headline": "Sensex ends 300 points higher, Nifty above 25,600; Jio Financial shares jump 4%The S&P BSE Sensex ended 303.03 points higher at 84,058.90, while the NSE Nifty50 rose 88.80 to settle at 25,637.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/switched-jobs-this-year-here-is-how-to-file-your-itr-right-got-salary-from-two-employers-2747138-2025-06-27",
      "headline": "Switched jobs this year? Here's how to file your ITR rightIf you worked for more than one employer in the same year, make sure to report each salary and related deductions separately in the ITR form. Don't mix them up; each employer's income should be shown in its own section. This helps avoid overlaps and mistakes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-indias-ultra-rich-families-investing-in-2025-2747127-2025-06-27",
      "headline": "Where are India's ultra-rich families investing in 2025?A new EY–Julius Baer report, The Indian Family Office Playbook, reveals that many family offices are moving away from traditional wealth preservation and diving into global markets, private credit, and real assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-45-lakh-for-raising-a-child-why-parenting-feels-like-a-luxury-now-2747066-2025-06-27",
      "headline": "Rs 45 lakh for raising a child? Why parenting feels like a luxury nowRising everyday expenses, pricey education and costly healthcare are forcing many young couples to think twice about kids. According to a startup founder, starting a family is personal, but money has become a key factor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-hc-supports-sbi-decision-cancelling-circle-based-officer-appointment-over-cibil-report-anomalies-bad-credit-score-2747020-2025-06-27",
      "headline": "Madras High Court backs bank appointment cancellation over adverse CIBIL reportThe Madras High Court upheld SBI's decision to cancel a candidate's appointment due to adverse credit history, stressing that financial discipline is essential for roles involving public money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-guarantees-in-mutual-funds-investment-adviser-warns-against-risky-pf-advice-2747011-2025-06-27",
      "headline": "No guarantees in mutual funds: Investment adviser warns against risky PF adviceAn investment adviser explains why PF money should not be used for risky bets like mutual funds with \"guaranteed returns.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-saving-30-percent-of-your-income-is-not-always-possible-ca-explains-2746968-2025-06-27",
      "headline": "Why saving 30% of your income isn't always possible, CA explainsFor those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, explains CA Abhishek Walia. For those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, he says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-in-july-will-sensex-nifty-hit-record-high-explained-2746951-2025-06-27",
      "headline": "Will Sensex and Nifty hit record highs in July? Here's all you need to knowWith domestic flows steady and global risks fading, July could be the moment markets break through resistance. But with key events ahead, will momentum hold or falter?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jsw-paints-to-acquire-majority-stake-in-akzo-nobel-india-2746932-2025-06-27",
      "headline": "JSW Paints to acquire majority stake in Akzo Nobel IndiaWith this move, JSW Paints will take sole control of Akzo Nobel India, which operates under the Dulux brand, and emerge as the fourth-largest player in the decorative paints segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-140-points-higher-nifty-above-25600-it-stocks-gain-2746923-2025-06-27",
      "headline": "Sensex, Nifty open higher for 4th straight session as global cues aid momentumThe BSE Sensex opened with a gain of over 140 points and was trading 89.06 points higher at 83,844.93 around 9:22 am. The NSE Nifty50 breached the 25,600-mark at the open before paring some gains to trade 25.35 points up at 25,574.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/online-job-portals-careerbuilder-monster-file-for-bankruptcy-2746877-2025-06-27",
      "headline": "Once-dominant online job boards CareerBuilder, Monster go bankruptCreated through the September merger of CareerBuilder and Monster, the Chicago-based company said it agreed to sell its job board operations, its most recognisable business, to JobGet, which has an app for so-called gig workers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filed-the-wrong-itr-form-penalties-missed-refunds-and-what-to-do-next-2746644-2025-06-26",
      "headline": "Filed the wrong ITR form? Penalties, missed refunds and what to do nextWhether you're a salaried professional, freelancer, or a business owner, choosing the right ITR (Income Tax Return) form is important. Getting it wrong might mean missed refunds, penalties, or worse, your return being treated as invalid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-2025-high-sensex-ends-1000-points-higher-nifty-above-25500-tata-steel-gains-3-percent-2746581-2025-06-26",
      "headline": "Sensex ends 1,000 points higher, Nifty above 25,500; Tata Steel gains 3%The S&P BSE Sensex jumped 1,000.36 points to end at 83,755.87, while the NSE Nifty50 gained 304.25 points to close at 25,549.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-phones-to-partners-8-money-lessons-to-learn-before-30-2746518-2025-06-26",
      "headline": "From phones to partners: 8 money lessons to learn before 30Managing money isn't just about making budgets, it's about making better choices, every single day. CA Nitin Kaushik shares eight crucial money lessons that everyone should grasp by the age of 30."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saving-money-ppf-nsc-rate-cut-government-review-june-30-investors-tip-2746530-2025-06-26",
      "headline": "Are your savings at risk? Government may slash PPF, NSC rates next weekSo far this year, interest rates for schemes such as Sukanya Samriddhi Yojana (SSY), Senior Citizens Savings Scheme (SCSS), and Post Office term deposits have remained unchanged. However, this may not continue in the next quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/housing-sales-india-quarter-2025-trends-high-prices-buyers-wait-2746520-2025-06-26",
      "headline": "Housing sales drop 20% across top 7 cities in Q2 2025 as prices stay highA sluggish Q2 masked early signs of recovery in India's housing market, with rising prices, cautious buyers, and skewed supply dampening sales—but softening rates and easing tensions may turn the tide.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hiding-income-or-making-wrong-claims-your-itr-could-attract-a-200-percent-penalty-2746447-2025-06-26",
      "headline": "Hiding income or making wrong claims? Your ITR could attract a 200% penaltyThe recent changes in Income Tax Return (ITR) regulations highlight stricter penalties for incorrect filings, including a potential 200% penalty on false claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/affordable-housing-crisis-india-sharp-decline-rising-property-costs-2746134-2025-06-26",
      "headline": "Roti, kapda, but no makaan? The disappearing dream of affordable housingAffordable housing is vanishing from India's cities, and the crisis runs deeper than shrinking supply. In this deep dive, we explore how rising costs, fading supply, and policy gaps are shutting the door on millions chasing the ownership dream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-expensive-a-house-should-you-buy-investment-banker-shares-these-6-rules-2746421-2025-06-26",
      "headline": "How expensive a house should you buy? Investment banker shares these 6 rulesAn investment banker lays down six clear, conservative rules for home buying to help first-time buyers avoid the trap of overleveraged homeownership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/received-form-16-do-not-file-your-itr-without-checking-these-points-2746414-2025-06-26",
      "headline": "Received Form 16? Don't file your ITR without checking these pointsForm 16 is a certificate your employer gives you every year. It shows how much salary you earned in the financial year and how much tax was deducted from it. This tax is called TDS (Tax Deducted at Source)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/world-most-valuable-company-nvidia-market-cap-ai-chip-maker-share-price-microsoft-apple-tesla-us-aramco-2746366-2025-06-26",
      "headline": "Nvidia overtakes Microsoft as world's most valuable company after 4% surgeNvidia's shares touched a new record high of $154.10, after climbing 4.33% during the trading session. This rally followed a positive report from Loop Capital, which raised its price target for Nvidia from $175 to $250. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-rally-dalal-street-optimism-israel-iran-ceasefire-domestic-factors-stock-market-rising-today-2746359-2025-06-26",
      "headline": "Sensex rises over 500 points, crosses 83,000: Why is stock market rising today?By 9:59 am, the Sensex had gained 549 points to touch 83,305.06, while the Nifty rose by 172.75 points to 25,417.50. The mood across the broader market was upbeat, and volatility remained surprisingly muted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-bitcoin-reserve-signals-a-shift-an-opening-for-india-2746346-2025-06-26",
      "headline": "US Bitcoin Reserve signals a shift: An opening for IndiaIndia stands at a pivotal juncture. A measured Bitcoin strategy—perhaps a reserve pilot—could strengthen economic resilience and project modernity. As the US advances and nations like Bhutan adapt, India has a unique opportunity to lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-127-points-higher-nifty-above-25200-eternal-gains-1-percent-2746333-2025-06-26",
      "headline": "Sensex opens 127 points higher, Nifty above 25,200; Eternal gains 1%The S&P BSE Sensex was up 364.24 points to 83,119.75, while the NSE Nifty50 added 114.95 points to 25,359.70 as of 9:31 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-fine-bse-rs-25-lakh-why-reason-for-unequal-data-access-failure-in-oversight-order-trading-rights-2746330-2025-06-26",
      "headline": "Sebi penalises BSE Rs 25 lakh for unequal data access, failure in oversightSebi called the failure by BSE 'laxity and negligence' and pointed out that BSE, being a first-level regulator, has a duty to maintain a clean and fair trading environment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-june-26-trading-setup-nse-bse-rise-fall-2746310-2025-06-26",
      "headline": "Sensex, Nifty opening on June 26: Will stock market rise again today?As of 8:24 am, the Gift Nifty futures were trading at 25,287 points. This suggests that the Nifty50 could open around its previous close of 25,244.75."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-26-share-market-tips-nse-bse-trading-sbi-tata-steel-mobikwik-adani-2746300-2025-06-26",
      "headline": "Stocks to watch on June 26: SBI, Tata Steel, One Mobikwik, Adani EnterprisesStrong global signals and a steady flow of news from domestic companies helped keep investor sentiment upbeat as Sensex and Nifty gained nearly 1% in the last session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-total-gas-and-reliance-jio-bp-partner-to-expand-fuel-access-across-india-2746044-2025-06-25",
      "headline": "Adani Total Gas and Jio-bp partner to expand fuel access across IndiaThis collaboration will see Jio-bp's premium petrol and diesel sold at select Adani fuel outlets, according to ATGL's statement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-700-points-higher-nifty-above-25200-titan-up-4-mahindra-infosys-2746018-2025-06-25",
      "headline": "Sensex closes 700 points higher, Nifty above 25,200, Titan up 4%The S&P BSE Sensex added 700.40 points to end at 82,755.51, while the NSE Nifty50 gained 200.40 points to close at 25,244.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/jewellery-vs-gold-etfs-how-to-make-make-money-shine-not-just-wrists-explains-ca-2745981-2025-06-25",
      "headline": "Jewellery vs gold ETFs: How to make make money shine, not just wrists, explains CAGold jewellery may look beautiful, but it often comes with hidden costs, resale hassles, and emotional attachment that cloud financial judgement."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannappa-box-office-collection-day-3-detailed-report-vishnu-manchu-film-wraps-up-a-decent-1st-weekend-2748191-2025-06-30",
      "headline": "Kannappa box office Day 3: Vishnu Manchu's film wraps up a decent 1st weekend'Kannappa' finished its opening weekend at the box office on a decent note, collecting more than all the fresh releases in India. The film is now looking at passing the crucial Monday test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/f1-box-office-day-3-brad-pitt-film-races-to-144-million-worldwide-2748184-2025-06-30",
      "headline": "F1 box office Day 3: Brad Pitt's racing drama off to a roaring $144 million startBrad Pitt's 'F1' is racing into the hearts of audiences. Directed by Joseph Kosinski, the film is climbing the box office charts, earning impressive numbers along the way.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-season-3-controversy-over-birth-scene-all-you-need-to-know-about-netflix-show-criticism-2748175-2025-06-30",
      "headline": "Squid Game Season 3 is receiving backlash over a birth scene. Here's all about itThe latest season of Netflix's 'Squid Game' is facing criticism for Kim Jun Hee's childbirth scene. The childbirth happens during a challenge in the series. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sitaare-zameen-par-box-office-collection-day-10-detailed-report-aamir-khan-film-beats-ghajini-creates-new-record-in-2nd-weekend-2748172-2025-06-30",
      "headline": "Sitaare Zameen Par box office Day 10: Aamir's film beats Ghajini, creates new recordAamir Khan's 'Sitaare Zameen Par' recorded a fabulous second weekend at the box office, and collected around Rs 122 crore in ten days. It also surpassed the lifetime earnings of Khan's sixth highest-grossing film, 'Ghajini'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-wife-aarti-share-birthday-posts-for-son-aarav-this-year-hasnt-been-easy-2748167-2025-06-30",
      "headline": "Ravi Mohan, wife Aarti share birthday posts for son Aarav: This year hasn't been easyRavi Mohan and Aarti Ravi shared moving birthday notes for their son Aarav. While Aarti reflected on the year gone by, Ravi described his sons as his pride.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/beyonce-manages-scary-mid-air-malfunction-during-houston-show-watch-viral-video-2748139-2025-06-30",
      "headline": "Beyonce manages scary mid-air malfunction during Houston show. WatchBeyonce handled a terrifying stage malfunction during her performance. The incident happened during her first of two shows in Houston."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-returns-to-hera-pheri-3-calls-akshay-kumar-his-longtime-friend-2748153-2025-06-30",
      "headline": "Paresh Rawal returns to Hera Pheri 3, calls Akshay Kumar his longtime friendActor Paresh Rawal confirmed that he was back to lead 'Hera Pheri 3' with Akshay Kumar and Suniel Shetty. The actor's announcement came over a month after his abrupt exit from the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fast-and-furious-11-paul-walker-could-return-says-vin-diesel-2748145-2025-06-30",
      "headline": "Fast and Furious 11: Paul Walker could return, says Vin DieselVin Diesel has made a promising revelation about the upcoming 'Fast and Furious' installment. At a recent event, the actor shared that Paul Walker's character, Brian O'Conner, could potentially return to the franchise.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-calls-out-media-for-insensitive-coverage-of-shefali-jariwala-death-2748030-2025-06-29",
      "headline": "Varun Dhawan calls out media for insensitive coverage of Shefali Jariwala's deathVarun Dhawan criticised the media for insensitively covering Shefali Jariwala's funeral, urging respect for the grieving family. Priyanka Chopra called the news shocking and extended condolences to Shefali's family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/while-battling-depression-aamir-khan-found-a-friend-in-salman-khan-2748046-2025-06-29",
      "headline": "Aamir found a friend in Salman while battling depression: Became less judgementalAamir Khan reflects on his evolving friendships with Salman Khan and Shah Rukh Khan. He also shares a humorous incident involving Tiger Shroff's fans outside his home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-recalls-refusing-underworld-party-invite-despite-threats-i-said-no-2748050-2025-06-29",
      "headline": "Aamir Khan recalls refusing underworld party invite despite threats: I said noAamir Khan recalled he was once invited to a party hosted by the underworld in Dubai in the 90s but firmly refused despite pressure and threats. He shared how the experience left him scared for his family's safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khans-girlfriend-gauri-spratt-says-theres-room-for-improvement-in-his-acting-2748039-2025-06-29",
      "headline": "Aamir Khan's girlfriend Gauri Spratt says there's room for improvement in his actingAamir Khan's girlfriend Gauri Spratt made a rare appearance during his interview, where she playfully said there's always room for improvement in his acting. Her comment and their candid exchange quickly went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-on-struggle-after-divorce-with-reena-dutta-tried-to-kill-myself-with-alcohol-2747996-2025-06-29",
      "headline": "Aamir Khan on struggle after divorce with Reena: Tried to kill myself with alcoholAamir Khan opened up about his painful separation from Reena Dutta, sharing he turned to alcohol and depression during that time. Despite the success of 'Lagaan', the actor said he felt lost and broken, calling it one of the darkest phases of his life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-sardaar-ji-3-gets-overwhelming-love-in-pakistan-2747971-2025-06-29",
      "headline": "Amid backlash in India, Sardaar Ji 3 gets overwhelming love in Pak; Diljit reactsDiljit Dosanjh's 'Sardaar Ji 3' skipped its India release amid controversy but opened to packed theatres in Pakistan. Despite the backlash, the film has been receiving an overwhelming response in Pakistan, earning an estimated $500,000 on its first day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-kimetsu-no-yaiba-infinity-castle-trailer-india-september-release-2747970-2025-06-29",
      "headline": "Tanjiro's final war begins: Infinity Castle trailer brings fire and revengeThe trailer for 'Demon Slayer: Kimetsu no Yaiba – Infinity Castle' has finally dropped—and it's all heat, heartbreak, and hands. Tanjiro vs Akaza is on the cards, and with revenge in his eyes, Tanjiro looks ready to finish what Rengoku started."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-body-shaming-response-workout-video-2747954-2025-06-29",
      "headline": "Samantha hits back at trolls calling her skinny, sickly with fierce workout videoSamantha Ruth Prabhu made it clear via Instagram Stories that she had no patience for comments about her body or health. She challenged body-shamers with a fierce workout video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-gushes-over-f1-star-brad-pitt-2747953-2025-06-29",
      "headline": "Brad Pitt. That's It: Deepika Padukone gushes over F1 star Bollywood actor Deepika Padukone shared her excitement after watching Brad Pitt's sports drama 'F1'. Her cheeky Instagram post quickly caught attention and felt like a fun tribute to the Hollywood actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-enjoys-a-day-out-at-park-with-sons-ibrahim-ali-khan-taimur-and-jeh-2747935-2025-06-29",
      "headline": "Saif Ali Khan enjoys a day out at the park with sons Ibrahim, Taimur, and JehIbrahim Ali Khan shared heartwarming photos from a fun day out at the park with his father Saif Ali Khan and younger brothers Taimur and Jeh. The pataudi brothers were seen enjoying nature and playing cricket in the park."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-sudden-death-arti-singh-tribute-social-media-made-plans-2747933-2025-06-29",
      "headline": "We made plans just a week back: Arti Singh mourns Shefali Jariwala's sudden deathActor Arti Singh expressed deep sorrow over the sudden death of her friend and Bigg Boss 13 co-contestant Shefali Jariwala. The actor also extended condolences to Shefali's family,"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trade-deal-between-india-and-us-likely-to-be-announced-before-july-8-pm-modi-donald-trump-2748136-2025-06-30",
      "headline": "Terms agreed and locked, India-US trade deal likely before July 8The much-awaited deal comes just in the nick of time, as Trump's deadline for imposing reciprocal tariffs on countries worldwide ends on July 9. Last week, Trump said his administration was looking to remove all trade barriers, which he called 'unthinkable'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/op-sindoor-iaf-lost-fighter-jets-political-constraints-indian-defence-attache-indonesia-embassy-clarification-congress-attacks-government-2748084-2025-06-29",
      "headline": "Defence attache says jets lost to Pak due to constraints. Then, a clarificationIndia's defence attache to Indonesia admitted that the Air Force lost \"some aircraft\" early on in Operation Sindoor. The remark stoked controversy back home, prompting the Indian Embassy in Jakarta to issue a sternly-worded clarification."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/newlywed-tn-tiruppur-woman-dies-by-suicide-over-alleged-dowry-harassment-husband-inlaws-in-custody-2748168-2025-06-30",
      "headline": "Newlywed bride ends life over dowry torture, had given Volvo car, 800 gm goldA 27-year-old newlywed woman died by suicide allegedly due to dowry-related harassment by her husband and in-laws. Police found her body in a parked car after she consumed pesticide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-puts-three-language-policy-on-hold-amid-backlash-forms-panel-to-decide-implementation-framework-2748032-2025-06-29",
      "headline": "Maharashtra withdraws 3-language policy order amid Hindi 'imposition' backlashMaharashtra Chief Minister Devendra Fadnavis announced the cancellation of the controversial government resolutions concerning the three-language policy in primary schools."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-preview-aryna-sabalenka-coco-gauff-iga-swiatek-2748120-2025-06-30",
      "headline": "Can Aryna Sabalenka, Iga Swiatek, Coco Gauff finally conquer the grass?Wimbledon 2025: Eyes will be on Aryna Sabalenka, Coco Gauff and Iga Swiatek as they are set to take part in the grass-court major, which starts on Monday. Barbora Krejcikova, in the meantime, will be looking to defend her crown. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/enemies-will-be-avenged-irans-top-cleric-issues-fatwa-against-trump-netanyahu-2748134-2025-06-30",
      "headline": "Enemies of God: Iran's top cleric issues fatwa against Trump, NetanyahuShirazi called on Muslims across the world to unite and strongly oppose these enemies, American and Israeli leaders, and their actions. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/massive-protest-in-dhaka-after-hindu-woman-cumilla-raped-by-bangladesh-nationalist-party-politician-2748118-2025-06-30",
      "headline": "Massive protest in Bangladesh after Hindu woman raped by local politicianA video of one of the protests showed students clapping and shouting slogans, demanding 'direct action' against the perpetrators. So far, the police have arrested five individuals, including the main accused, Fazor Ali-a member of the Khaleda Zia-led Bangladesh Nationalist Party (BNP)-in connection with the rape of a 21-year-old woman in Cumilla."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-man-kills-son-play-in-rain-stabs-2748108-2025-06-30",
      "headline": "10-year-old boy wanted to play in rain, father stabbed him to death in DelhiA 10-year-old boy in Delhi was fatally stabbed by his father after insisting on playing in the rain. The accused, a daily wage labourer, has been arrested and a murder case has been filed.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/while-battling-depression-aamir-khan-found-a-friend-in-salman-khan-2748046-2025-06-29",
      "headline": "Aamir found a friend in Salman while battling depression: Became less judgementalAamir Khan reflects on his evolving friendships with Salman Khan and Shah Rukh Khan. He also shares a humorous incident involving Tiger Shroff's fans outside his home."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-college-gang-rape-monojit-mishra-history-harassment-targeted-women-campus-violence-tmcp-2747992-2025-06-29",
      "headline": "Kolkata rape accused has history of harassing women, campus violence: Ex-friendTitas Manna, a former friend of Kolkata gangrape accused Monojit Mishra, alleged that the TMCP leader had been involved in multiple incidents targeting women during their time at the college, but that survivors were afraid to lodge formal complaints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/finfluencer-startup-found-akshat-shrivastava-corrupt-real-estate-housing-crisis-middle-class-2748173-2025-06-30",
      "headline": "Most corrupt I've seen: Finfluencer on Indian metro real estate marketFinfluencer Akshat Shrivastava is calling metro real estate a \"financial ruin,\" warning middle-class buyers to stop chasing low-yield properties bankrolled by black money and billionaire hoarders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-wimbledon-2025-hat-trick-titles-2748157-2025-06-30",
      "headline": "Carlos Alcaraz targets historic Wimbledon three-peat, chases place among legendsCarlos Alcaraz will begin his quest for a rare Wimbledon three-peat on Monday, aiming to join an exclusive club of legends when the 2025 Championships get underway at the All England Lawn Tennis and Croquet Club in London."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-season-3-controversy-over-birth-scene-all-you-need-to-know-about-netflix-show-criticism-2748175-2025-06-30",
      "headline": "Squid Game Season 3 is receiving backlash over a birth scene. Here's all about itThe latest season of Netflix's 'Squid Game' is facing criticism for Kim Jun Hee's childbirth scene. The childbirth happens during a challenge in the series. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-could-enrich-uranium-again-despite-strikes-says-international-atomic-energy-agencys-chief-glbs-2748097-2025-06-30",
      "headline": "Iran could resume uranium enrichment in matter of months: UN nuclear body chiefIAEA chief Rafael Grossi says Iran could resume uranium enrichment within months, despite US-Israel strikes. He warns that Iran's nuclear knowledge remains intact and can't be erased by attacks.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-returns-to-hera-pheri-3-calls-akshay-kumar-his-longtime-friend-2748153-2025-06-30",
      "headline": "Paresh Rawal returns to Hera Pheri 3, calls Akshay Kumar his longtime friendActor Paresh Rawal confirmed that he was back to lead 'Hera Pheri 3' with Akshay Kumar and Suniel Shetty. The actor's announcement came over a month after his abrupt exit from the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-rape-case-two-accused-recorded-assault-on-phones-to-blackmail-survivor-police-source-2748192-2025-06-30",
      "headline": "2 accused filmed assault to blackmail survivor: Police source on Kolkata rape caseThe accused admitted to capturing the brutal incident and confessed that the videos and images were intended to be used as tools to blackmail the survivor into silence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-preview-novak-djokovic-jannik-sinner-carlos-alcaraz-2747912-2025-06-29",
      "headline": "Wimbledon 2025 preview: Who are the favourites and what's new this year?Wimbledon 2025 Preview: The prestigious grass-court Grand Slam runs from June 30 to July 13. Carlos Alcaraz enters the tournament fresh off his French Open triumph, aiming for a third consecutive Wimbledon title. On the women's side, the singles field remains wide open, continuing the recent trend of unpredictability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-sardaar-ji-3-gets-overwhelming-love-in-pakistan-2747971-2025-06-29",
      "headline": "Amid backlash in India, Sardaar Ji 3 gets overwhelming love in Pak; Diljit reactsDiljit Dosanjh's 'Sardaar Ji 3' skipped its India release amid controversy but opened to packed theatres in Pakistan. Despite the backlash, the film has been receiving an overwhelming response in Pakistan, earning an estimated $500,000 on its first day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/two-firefighters-shot-dead-in-idaho-wildfire-response-manhunt-underway-for-gunman-glbs-2748112-2025-06-30",
      "headline": "Sniper attack kills 2 firefighters in prolonged gun battle in US's IdahoTwo firefighters were fatally shot while responding to a wildfire in northern Idaho. Law enforcement faces sniper fire as a manhunt continues. The fire remains active with evacuations ongoing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-on-struggle-after-divorce-with-reena-dutta-tried-to-kill-myself-with-alcohol-2747996-2025-06-29",
      "headline": "Aamir Khan on struggle after divorce with Reena: Tried to kill myself with alcoholAamir Khan opened up about his painful separation from Reena Dutta, sharing he turned to alcohol and depression during that time. Despite the success of 'Lagaan', the actor said he felt lost and broken, calling it one of the darkest phases of his life."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/stampedes-plane-crash-war-natural-disasters-indias-turbulent-2025-so-far-2747982-2025-06-29",
      "headline": "Stampedes, plane crash, war, natural disasters: India's turbulent 2025 so farFirst Kumbh stampede, then Delhi station stampede, then India-Pak conflict, Air India crash and now the Puri stampede - the first half of 2025 has been one of India's most turbulent in recent memory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-can-kuldeep-yadav-dismantle-england-in-birmingham-2748033-2025-06-30",
      "headline": "Can Kuldeep dismantle England? India's spin gamble against Bazball in BirminghamHaving lost the first Test despite dominating the majority of the match has left India questioning their team combination and on-field tactics. Could Kuldeep Yadav emerge as the knight in the shining armour to take down England's Bazball during the second Test at Edgbaston, Birmingham."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bharatiya-janta-party-congress-hit-kejriwal-slum-demolition-row-aam-aadmi-party-2748098-2025-06-30",
      "headline": "Desperate stunt: BJP, Congress slam Kejriwal over slum demolition protestThe BJP and Congress slammed Arvind Kejriwal for alleged hypocrisy over his protest against slum demolitions, accusing him of political theatrics and neglecting slum dwellers during his tenure. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/bezos-blue-origin-launches-six-customers-on-brief-joyride-to-space-2748064-2025-06-29",
      "headline": "Bezos's Blue Origin launches six customers on brief joyride to spaceBlue Origin's New Shepard rocket on the NS-33 mission carried six paying passengers, marking the company's 13th crewed space tourism flight since 2021."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-yashasvi-jaiswal-rahul-dravid-record-2748194-2025-06-30",
      "headline": "Yashasvi Jaiswal eyes Rahul Dravid's historic 26-year-old recordENG vs IND: Yashasvi Jaiswal can become the fastest Indian to 2000 Test runs in the second Test starting July 2 at the Edgbaston in Birmingham. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-bumrah-workload-management-england-test-series-2748187-2025-06-30",
      "headline": "A Bumrah surprise? AB de Villiers offers optimistic take on ENG vs IND Test seriesEngland vs India: Former South Africa captain AB de Villiers said India should have managed Jasprit Bumrah's workload better and had him ready to play all five Tests in the Anderson-Tendulkar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-dark-horses-bublik-medvedev-draper-to-watch-out-for-2747667-2025-06-30",
      "headline": "From Bublik to Medvedev: 5 men who can spring a surpriseAs 2025 has shown to be the year for first-timers, let us have a look at some of the dark horses that could put up a surprising challenge against the Big 3 for Wimbledon's men's singles title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-can-kuldeep-yadav-dismantle-england-in-birmingham-2748033-2025-06-30",
      "headline": "Can Kuldeep dismantle England? India's spin gamble against Bazball in BirminghamHaving lost the first Test despite dominating the majority of the match has left India questioning their team combination and on-field tactics. Could Kuldeep Yadav emerge as the knight in the shining armour to take down England's Bazball during the second Test at Edgbaston, Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-1-schedule-streaming-carlos-alcaraz-aryna-sabalenka-2748160-2025-06-30",
      "headline": "Day 1, Schedule and Live Streaming: Alcaraz, Sabalenka, Paolini in actionWimbledon 2025 Day 1: Carlos Alcaraz, Aryna Sabalenka and Jasmine Paolini are amongst the top names to be in action in their respective first round matches of the grass court major. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-wimbledon-2025-hat-trick-titles-2748157-2025-06-30",
      "headline": "Carlos Alcaraz targets historic Wimbledon three-peat, chases place among legendsCarlos Alcaraz will begin his quest for a rare Wimbledon three-peat on Monday, aiming to join an exclusive club of legends when the 2025 Championships get underway at the All England Lawn Tennis and Croquet Club in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-finger-injury-update-west-indies-vs-australia-2nd-test-2748140-2025-06-30",
      "headline": "Steve Smith shares update on finger injury before Grenada TestWI vs AUS: After missing the first Test due to a finger injury, veteran batter Steve Smith sounded confident of making the cut for the second Test in Grenada. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-barbora-krejcikova-title-defence-2748135-2025-06-30",
      "headline": "Definitely not difficult: Krejcikova confident before title defenceWimbledon 2025: Barbora Krejcikova said that instead of taking the pressure of being the defending champion, she wants to enjoy the game when she steps out to face Alexandra Eala in the first round. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-preview-aryna-sabalenka-coco-gauff-iga-swiatek-2748120-2025-06-30",
      "headline": "Can Aryna Sabalenka, Iga Swiatek, Coco Gauff finally conquer the grass?Wimbledon 2025: Eyes will be on Aryna Sabalenka, Coco Gauff and Iga Swiatek as they are set to take part in the grass-court major, which starts on Monday. Barbora Krejcikova, in the meantime, will be looking to defend her crown. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-inter-miami-vs-psg-report-lionel-messi-no-revenge-2748089-2025-06-29",
      "headline": "Lionel Messi cruelly denied revenge as PSG dominate Inter Miami 4-0Lionel Messi's quest for poetic closure ended in silence as Paris Saint-Germain, his former club, ruthlessly dismantled Inter Miami 4-0 in Atlanta's Mercedes-Benz Stadium, knocking them out of the 2025 Club World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-south-africa-1st-test-day-2-report-sean-williams-keshav-maharaj-2748088-2025-06-29",
      "headline": "ZIM vs SA 1st Test: South Africa gain control on Day 2 despite Williams' hundredSean Williams scored a fighting 137 to help Zimbabwe avoid follow-on in the first Test against South Africa. Despite his efforts, South Africa ended Day 2 with a strong lead, signalling a tough challenge for the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-finger-injury-update-west-indies-vs-australia-2nd-test-2748140-2025-06-30",
      "headline": "Steve Smith shares update on finger injury before Grenada TestWI vs AUS: After missing the first Test due to a finger injury, veteran batter Steve Smith sounded confident of making the cut for the second Test in Grenada. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-barbora-krejcikova-title-defence-2748135-2025-06-30",
      "headline": "Definitely not difficult: Krejcikova confident before title defenceWimbledon 2025: Barbora Krejcikova said that instead of taking the pressure of being the defending champion, she wants to enjoy the game when she steps out to face Alexandra Eala in the first round. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-preview-aryna-sabalenka-coco-gauff-iga-swiatek-2748120-2025-06-30",
      "headline": "Can Aryna Sabalenka, Iga Swiatek, Coco Gauff finally conquer the grass?Wimbledon 2025: Eyes will be on Aryna Sabalenka, Coco Gauff and Iga Swiatek as they are set to take part in the grass-court major, which starts on Monday. Barbora Krejcikova, in the meantime, will be looking to defend her crown. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-inter-miami-vs-psg-report-lionel-messi-no-revenge-2748089-2025-06-29",
      "headline": "Lionel Messi cruelly denied revenge as PSG dominate Inter Miami 4-0Lionel Messi's quest for poetic closure ended in silence as Paris Saint-Germain, his former club, ruthlessly dismantled Inter Miami 4-0 in Atlanta's Mercedes-Benz Stadium, knocking them out of the 2025 Club World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-south-africa-1st-test-day-2-report-sean-williams-keshav-maharaj-2748088-2025-06-29",
      "headline": "ZIM vs SA 1st Test: South Africa gain control on Day 2 despite Williams' hundredSean Williams scored a fighting 137 to help Zimbabwe avoid follow-on in the first Test against South Africa. Despite his efforts, South Africa ended Day 2 with a strong lead, signalling a tough challenge for the hosts. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}