{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/petrol-diesel-prices-could-see-a-cut-if-crude-rates-stay-lower-for-longer-report-2598472-2024-09-12",
      "headline": "Petrol, diesel prices may fall if crude oil rates remain low: ReportCrude oil prices have recently dropped to their lowest point in nearly three years, bringing some hope for lower fuel prices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ayushman-bharat-health-insurance-senior-citizens-aged-70-and-above-to-get-these-benefits-2598441-2024-09-12",
      "headline": "Ayushman Bharat: Senior citizens aged 70 and above to get these benefitsAyushman Bharat: The expansion aims to ease the financial burden of healthcare for the elderly, who often face high medical expenses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-in-talks-with-global-banks-to-sell-loans-worth-rs-8400-crore-2598417-2024-09-12",
      "headline": "HDFC Bank in talks with global banks to sell loans worth Rs 8,400 crore: ReportFor HDFC Bank, offloading these loans would help improve that ratio, which has deteriorated as credit growth has outpaced deposit accumulation in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-allotment-check-application-status-latest-gmp-bse-website-kfin-technologies-2598400-2024-09-12",
      "headline": "Bajaj Housing Finance IPO allotment: Check application status and latest GMPIf you've applied for the Bajaj Housing Finance IPO, you can check your allotment status online in a few simple steps through the websites if the BSE and KFin Technologies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/kross-limited-ipo-allotment-online-step-by-step-guide-to-check-status-gmp-2598396-2024-09-12",
      "headline": "Kross Limited IPO allotment: Step-by-step guide to check statusKross Limited IPO allotment: Investors who applied for the IPO can check their allotment status online through the BSE portal or on Kfin Technologies Limited, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-demand-investors-explained-allotment-day-2598373-2024-09-12",
      "headline": "Explained: Why everyone wants a piece of Bajaj Housing Finance IPOBoth big and small, investors rushed in to grab their share of this Rs 6,560-crore IPO, which has attracted a whopping Rs 3.2 lakh crore in bids."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-food-delivery-service-share-price-all-time-high-price-target-ubs-2598355-2024-09-12",
      "headline": "Zomato shares jump 4% to hit all-time high. Will it gain further? Zomato shares hit a record high of Rs 283.50 on the Bombay Stock Exchange. Can the stock continue its upward streak? Read on to find out.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ayushman-bharat-health-insurance-to-cover-senior-citizens-above-70-all-you-need-to-know-details-2598354-2024-09-12",
      "headline": "Ayushman Bharat to cover senior citizens above 70: All you need to knowThe expansion of the Ayushman Bharat scheme aims to address the healthcare needs of the elderly, who often face higher medical expenses as they age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-in-green-as-fed-rate-cut-hopes-grow-after-us-inflation-data-2598327-2024-09-12",
      "headline": "Sensex, Nifty gain as Fed rate cut hopes grow after US inflation dataThe S&P BSE Sensex added230.45 points to 81,753.61, while the NSE Nifty50 gained 97.40 points to 25,015.85 "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-allotment-online-guide-steps-to-check-status-gmp-2598211-2024-09-12",
      "headline": "Bajaj Housing Finance IPO allotment: Step-by-step guide to check status Bajaj Housing Finance IPO allotment: Investors who applied for the IPO can check their allotment status online through the BSE portal or on Kfin Technologies Limited, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-subscription-details-sees-rs-32-lakh-crore-bids-gmp-crosses-100-percent-2598016-2024-09-11",
      "headline": "Bajaj Housing Finance IPO sees Rs 3.2 lakh crore bids, GMP crosses 100%Bajaj Housing Finance IPO: Before the public issue, Bajaj Housing Finance managed to raise Rs 1,758 crore from 104 anchor investors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-toll-collection-explained-how-gnss-will-change-your-highway-experience-2597975-2024-09-11",
      "headline": "New toll collection explained: How GNSS will change your highway experienceUnder the new rules, the GNSS will automatically grant exemptions for travel up to 20 km per day, charging toll fees only for the distance travelled beyond this limit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thematic-mutual-funds-explained-should-you-invest-all-you-need-to-know-2597951-2024-09-11",
      "headline": "Thematic mutual funds explained: Are they the right bet for investors?Thematic funds have outpaced traditional categories in popularity. But what are they, and why are AMCs launching so many? Here's what you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-funds-sahi-hai-amfi-data-why-so-many-indians-are-betting-big-on-sips-2597876-2024-09-11",
      "headline": "Mutual funds sahi hai? Why so many Indians are betting big on SIPsIt took 50 years to build Rs 10 lakh crore in AUM from 1963 to 2013, but in just six more years, it reached Rs 23 lakh crore by 2019. As of August 2024, the AUM has tripled to Rs 66.70 lakh crore, demonstrating strong investor confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-fall-tata-motors-share-price-2597865-2024-09-11",
      "headline": "Sensex dips 400 points, Nifty ends below 25,000; Tata Motors tanks 6%The S&P BSE Sensex fell 398.13 points to 81,523.16 at the closing bell, while the NSE Nifty50 declined 122.65 points to settle at 24,918.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-electronics-global-job-cuts-layoffs-india-employees-2597858-2024-09-11",
      "headline": "Samsung plans global job cuts up to 30%, 1,000 layoffs likely in India: Report In India, Samsung has already begun offering severance packages to mid-level employees, with up to 1,000 jobs expected to be affected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-maruti-mm-mahindra-why-auto-stocks-are-in-red-today-ubs-2597849-2024-09-11",
      "headline": "Tata Motors, Maruti, M&M: Why auto stocks are in red today Among the major components of the BSE Auto index, Tata Motors Ltd experienced the largest drop, falling by 5.60%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/semicon-2024-5-things-pm-modi-shared-on-india-semiconductor-ambitions-chips-2597811-2024-09-11",
      "headline": "Semicon 2024: 5 things PM Modi shared on India's semiconductor ambitionsSemicon India 2024: PM Modi shared a plan to create a workforce of 85,000 skilled professionals, including technicians, engineers, and R&D experts, who will be industry-ready in the coming years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ubs-view-tata-motors-share-price-sell-rating-20-percent-downside-risk-investors-buy-or-sell-stock-2597798-2024-09-11",
      "headline": "UBS sees 20% downside potential in Tata Motors stock. Should you hold or sell? UBS, which holds a \"sell\" rating on the stock, cited concerns that moderating demand, rising discounts, and the absence of new internal combustion engine and hybrid launches could severely impact JLR's financial performance by fiscal 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindenburg-research-questions-madhabi-puri-buchs-silence-on-congress-allegations-2597756-2024-09-11",
      "headline": "Hindenburg questions Sebi chief Madhabi Buch's silence on Congress's new chargeHindenburg Research's statement comes after the Congress party raised fresh allegations about Buch's links to listed companies regulated by Sebi. The short-seller also said that Madhabi Puri Buch has remained silent on the accusations for weeks."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-chief-justice-chandrachud-ganpati-puja-celebration-controversy-2598371-2024-09-12",
      "headline": "PM Modi at Chief Justice's home for Ganpati Puja sparks rowTop government sources told India Today that the CJI had sent invites to several dignitaries, including the Prime Minister, for the Ganpati Puja."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-chief-secretary-protesting-doctors-kolkata-rg-kar-hospital-demands-meeting-mamata-banerjee-2598500-2024-09-12",
      "headline": "15-member delegation, no live telecast: Bengal government invites protesting doctors for meet at 5 pm today15-member delegation, no live telecast: Bengal government invites protesting doctors for meet at 5 pm today"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-former-cm-farooq-abdullah-jabs-bjp-ic-814-hijack-terrorists-release-2598462-2024-09-12",
      "headline": "Farooq Abdullah jabs BJP on IC 814 hijack: Told them not to release terroristsFarooq Abdullah was Chief Minister of Jammu and Kashmir when the Delhi-bound IC 814 was hijacked in December 1999. As per the demands of the hijackers, the Centre released terrorists Maulana Masood Azhar, Ahmed Omar Saeed Sheikh, and Mushtaq Ahmed Zargar."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/army-officers-thrashed-robbed-woman-gang-raped-mhow-indore-army-war-college-2598295-2024-09-12",
      "headline": "Army officers thrashed, woman friend gang-raped in Madhya PradeshThe incident happened when the two Major rank officers, who were undergoing training at Army War College in Madhya Pradesh's Mhow, were out on a picnic with their two female friends on September 11."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/astronaut-captured-haunting-image-of-new-york-from-space-after-911-attack-2598411-2024-09-12",
      "headline": "What American astronaut saw from space moments after the 9/11 attacksHis initial reaction was not just one of shock, but a profound sense of witnessing history from a place very few could imagine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-elections-donald-trump-kamala-harris-endorsement-taylor-swift-cat-lady-instagram-not-a-fan-elon-musk-x-2598390-2024-09-12",
      "headline": "Why cat-saviour Trump can't stand cat-lady TaylorThe 2024 US presidential election has turned into a catfight of sorts. While Donald Trump spoke of a cat-eating population in the US, Taylor Swift called herself a \"cat-lady\" in her endorsement note for Kamala Harris. But here's why \"cat-saviour\" Trump is not a fan of the \"cat-lady\" pop singer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/jammu-kashmir-assembly-election-lt-governor-pakistan-conspiracy-poll-issues-2598320-2024-09-12",
      "headline": "Do a secret ballot, I will resign if...: Manoj Sinha on Rahul Gandhi's 'king' jabSpeaking at Aaj Tak's 'Panchayat', Manoj Sinha said a secret ballot could be conducted to gauge the public sentiment following the abrogation of Article 370 in 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/malaika-arora-father-anil-mehta-death-postmortem-report-autopsy-cause-of-death-multiple-injuries-2598341-2024-09-12",
      "headline": "Autopsy reveals actor Malaika Arora's father died of multiple injuries: Police sourcesSpeaking to India Today TV, the police sources, citing the autopsy report, said that the father of actor-model Malaika Arora died due to multiple injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/narayana-murthy-faces-heat-parents-cant-watch-movies-expect-kids-to-study-2598409-2024-09-12",
      "headline": "Internet roasts Narayana Murthy again for his 'insights' on good parentingNarayana Murthy said that parents are responsible for creating a disciplined environment at home for children to study. His statement has triggered the internet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/company-challenges-suspension-of-presvu-eye-drops-claiming-to-replace-reading-glasses-2598339-2024-09-12",
      "headline": "Company challenges suspension of eye drops claiming to replace reading glassesEntod Pharmaceuticals denies making false claims about their new PresVu eye drops and plans to challenge the suspension by the Drugs Controller General of India of its manufacturing and sales permission in court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/farooq-abdullah-jammu-kashmir-assembly-election-ic-814-hijack-article-370-2598421-2024-09-12",
      "headline": "They come and go like prisoners: Farooq Abdullah on BJP's J&K tourism boom claimFarooq Abdullah cited the massive security deployment during Amarnath Yatra to hit out at the Centre's claim that normalcy had returned to Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/golden-retriever-hilarious-reaction-donald-trump-dog-was-eaten-remark-viral-video-2598478-2024-09-12",
      "headline": "Viral video: Golden Retriever's hilarious reaction to Trump's 'dog was eaten' remarkA Golden Retriever's reaction to Donald Trump's claim, that dogs are being eaten by immigrants in Springfield, Ohio, has gone viral on social media. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-rjd-green-gamcha-muretha-bihari-identity-tejashwi-yadav-lalu-prasad-yadav-vidhan-sabha-election-2025-2598058-2024-09-12",
      "headline": "Gamcha is Bihari's pride, but here's why RJD dropped its green towelThe RJD has dropped the green gamcha and moved on to green caps and badges ahead of Tejashwi Yadav's yatra to rejuvenate the party. The green towel has been used by party workers for decades now. Why has the RJD ditched it, and what does the gamcha mean for Bihari identity?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-hindus-durga-puja-organisers-music-instrument-system-namaz-azan-muhammad-yunus-2598370-2024-09-12",
      "headline": "Bangladesh asks Hindus to pause Durga Puja music during namaz, azanBangladesh's Home Affairs Adviser said that the local puja committees have been asked to avoid playing musical instruments during azan and namaz, adding that organisers have agreed to the request."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/iltija-mufti-peoples-democratic-party-jammu-kashmir-assembly-election-2598331-2024-09-12",
      "headline": "I'm not just Mehbooba Mufti's daughter, have my own identity: Iltija MuftiIltija Mufti, 37, will contest the upcoming Assembly elections in Jammu and Kashmir, as a People's Democratic Party's (PDP) candidate from Bijbehara, which has proved to be a stronghold for the Mufti family in the past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ayushman-bharat-health-insurance-to-cover-senior-citizens-above-70-all-you-need-to-know-details-2598354-2024-09-12",
      "headline": "Ayushman Bharat to cover senior citizens above 70: All you need to knowThe expansion of the Ayushman Bharat scheme aims to address the healthcare needs of the elderly, who often face higher medical expenses as they age."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/malaika-arora-father-anil-mehta-final-words-suicide-mumbai-police-probe-2598230-2024-09-12",
      "headline": "Anil Mehta's last words to daughter Malaika before his death: I'm sick and tiredAnil Mehta, 65, died on Wednesday morning by jumping from the sixth-floor balcony of his residence in Bandra. Mehta's wife, Joyce Polycarp, was in their flat at Ayesha Manor in Bandra when the incident took place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/polaris-dawn-mission-worlds-first-private-spacewalk-live-updates-spacex-elon-musk-jared-isaacman-2598430-2024-09-12",
      "headline": "LIVE: Polaris Dawn astronauts to exit Dragon for record spacewalkPolaris Dawn Mission LIVE: The Polaris Dawn crew, consisting of four civilian astronauts led by billionaire Jared Isaacman, is set to create history as they conduct the world's first private spacewalk. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-ncr-monsoon-rain-heavy-rain-alert-imd-forecasts-noida-ghaziabad-gurugram-2598337-2024-09-12",
      "headline": "Rain batters Delhi, more showers likely till weekend; UP, Uttarakhand on alertA depression that is currently lying over central India is expected to bring significant rainfall across Delhi, Haryana, parts of Uttar Pradesh, Uttarakhand and parts of Madhya Pradesh (MP) between September 11 to 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-allotment-check-application-status-latest-gmp-bse-website-kfin-technologies-2598400-2024-09-12",
      "headline": "Bajaj Housing Finance IPO allotment: Check application status and latest GMPIf you've applied for the Bajaj Housing Finance IPO, you can check your allotment status online in a few simple steps through the websites if the BSE and KFin Technologies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-dil-luminati-india-tour-tickets-sell-out-1-minute-again-2598434-2024-09-12",
      "headline": "Diljit Dosanjh's Dil-Luminati India Tour tickets sell out in a minute againSinger Diljit Dosanjh's Dil-Luminati India Tour tickets were open for the public today, September 12. Much to the surprise of the fans, the tickets sold out within a minute. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/mandya-communal-clashes-ganesh-procession-stone-pelting-several-arrested-2598303-2024-09-12",
      "headline": "52 detained after communal clashes in Mandya during Ganpati processionThe Karnataka Police detained 52 people for questioning in connection with the communal clashes that broke out in the state's Mandya district during a Ganpati procession."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/iphone-16-pro-is-rs-15000-cheaper-this-year-but-here-is-a-reason-why-you-should-still-buy-the-iphone-15-pro-2598425-2024-09-12",
      "headline": "iPhone 16 Pro cheaper this year: Here's why you should still buy iPhone 15 ProApple's new iPhone 16 Pro has been making quite the news in India as it is priced Rs 15,000 lower than the iPhone 15 Pro. While the 16 Pro is a fantastic phone, here are some reasons why you may still want to buy the iPhone 15 Pro."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/maruti-suzuki-swift-cng-launched-in-india-at-rs-819-lakh-2598383-2024-09-12",
      "headline": "Maruti Suzuki Swift CNG launched in India at Rs 8.19 lakhMaruti Suzuki Swift CNG mileage is claimed to be 32.85 km/kg, which is 6% better than its predecessor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vicky-vidya-ka-woh-wala-video-trailer-rajkummar-rao-triptii-dimri-2598344-2024-09-12",
      "headline": "Vicky Vidya Ka Woh Wala Video trailer: A hilarious mix of chaos and confusionThe trailer of Rajkummar Rao and Triptii Dimri's upcoming film, Vicky Vidya Ka Woh Wala Video, was released today, September 12. The film is touted to be a family entertainer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-seeks-blessings-at-lalbaugcha-raja-esha-deol-2598448-2024-09-12",
      "headline": "Watch: Vicky Kaushal seeks blessings at Lalbaugcha RajaActor Vicky Kaushal recently offered prayers at Lalbaugcha Raja. A video of the actor walking up barefoot to the 'pandaal' for 'darshan' has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vijay-varma-dropped-sacred-games-ic-814-2598432-2024-09-12",
      "headline": "Vijay Varma was dropped from Sacred Games after being locked for a roleVijay Varma opened up about being dropped from Sacred Games despite being initially chosen for a role. The actor was last seen on Netflix's IC 814."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/james-hollcroft-found-dead-days-after-going-missing-in-mexico-2598415-2024-09-12",
      "headline": "Actor James Hollcroft, 26, found dead days after going missing in MexicoMexican actor James Hollcroft was found dead days after he had been reported as missing in Mexico City. His sister, Jane, shared a social media post, remembering the late actor. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/county-championship-tom-banton-nathan-lyon-twisted-ankle-surrey-somerset-2598473-2024-09-12",
      "headline": "Despite twisting ankle, Tom Banton limps out to bat in heroic effortSomerset batter Tom Banton came out to bat with a twisted ankle as his team was looking to fight against Surrey in the Championship Division One match in Taunton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-matthew-short-david-warner-role-jake-fraser-mcurk-competition-2598465-2024-09-12",
      "headline": "Competing with McGurk, Matt Short keen on taking David Warner's spot in T20I sideEngland vs Australia: Seasoned opener Matthew Short said he is looking forward to making the most of the opportunities at the opening spot. Short, who hit 41 off just 26 balls in a whirlwind 86-run stand with Travis Head on Wednesday, is competing with young sensation Jake Fraser-McGurk for the opening role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/how-can-india-reach-world-test-championship-2025-final-in-lords-explained-2598467-2024-09-12",
      "headline": "How can India reach World Test Championship 2025 final at Lord's: ExplainedIndia will kick off their crucial home Test season on September 19, aiming to solidify their position in the World Test Championship standings. With 10 Test matches ahead, the Rohit Sharma-led side currently tops the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-erik-ten-hag-manchester-united-rebuild-winning-mentality-criticism-2598446-2024-09-12",
      "headline": "Ronaldo's fresh jibe at Erik ten Hag: Guys in office can't bring gloryCristiano Ronaldo reignited tensions with Manchester United by criticizing Erik ten Hag's management, suggesting the coach lacks the winning mentality needed for the club's success, while urging a deeper connection with United's heritage and expectations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ruturaj-gaikwad-retires-hurt-after-twisting-his-ankle-in-duleep-trophy-match-india-c-vs-india-b-2598433-2024-09-12",
      "headline": "Ruturaj Gaikwad retires hurt after twisting his ankle in Duleep Trophy matchDuleep Trophy 2024: India C captain Ruturaj Gaikwad retired hurt after twisting his left ankle while batting against India B. Gaikwad could manage to face only two balls before departing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-olympiad-budapest-india-opening-round-win-morocco-jamaica-2598410-2024-09-12",
      "headline": "Chess Olympiad: Praggnanandhaa, Vaishali star as Indian teams start strongChess Olympiad 2024: D Gukesh and Harika sat out of the opening round, but India men's and women's teams did not have any trouble winning their opening round ties in Budapest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-manchester-united-erik-ten-hag-advice-rudd-van-nistelrooy-rebuild-2598389-2024-09-12",
      "headline": "Ronaldo's advice to Ten Hag for United rebuild: Talk to Van NistelrooyCristiano Ronaldo reignites tension with Erik ten Hag, advising the Manchester United coach to seek guidance from Ruud van Nistelrooy while questioning his readiness to compete at the top level, despite expressing love for the club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-new-zealand-one-off-test-greater-nodia-day-4-rain-abandoned-test-2598382-2024-09-12",
      "headline": "Greater Noida Test set to join rare list after rain washes out 4th day Afghanistan (AFG) vs New Zealand (NZ), one-off Test: Rain washed out the fourth successive day of the Test match in Greater Noida. The one-off match is heading towards a rare abandonment without a ball bowled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-announce-najmul-shanto-led-16-member-squad-for-test-series-vs-india-2598386-2024-09-12",
      "headline": "Bangladesh announce squad for India Tests, show faith in Pakistan-beating unitThe Bangladesh Cricket Board announced a 16-member squad for the 2-match Test series against India, starting September 19. The BCB showcased faith in the Pakistan-beating unit for the Test series against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kohlis-captaincy-played-big-role-in-indian-crickets-turnaround-ricky-ponting-2598367-2024-09-12",
      "headline": "Kohli's captaincy played big role in Indian cricket's turnaround: Ricky PontingRicky Ponting praised Virat Kohli for revolutionizing Indian Test cricket, emphasizing his crucial role in transforming the team's mindset and leadership. Kohli's tenure as captain from 2014 to 2022 led India to notable overseas victories, including a historic series win in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/18-year-old-caity-becomes-youngest-womens-world-champ-beats-paris-olympic-winner-2598348-2024-09-12",
      "headline": "18-year-old Caity becomes youngest women's world champ in surfingCaity Simmers, just 18 years old, made history as the youngest women's world surfing champion after defeating Olympic gold medallist Caroline Marks at the 2024 World Surf League Finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-manchester-united-erik-ten-hag-advice-rudd-van-nistelrooy-rebuild-2598389-2024-09-12",
      "headline": "Ronaldo's advice to Ten Hag for United rebuild: Talk to Van NistelrooyCristiano Ronaldo reignites tension with Erik ten Hag, advising the Manchester United coach to seek guidance from Ruud van Nistelrooy while questioning his readiness to compete at the top level, despite expressing love for the club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-new-zealand-one-off-test-greater-nodia-day-4-rain-abandoned-test-2598382-2024-09-12",
      "headline": "Greater Noida Test set to join rare list after rain washes out 4th day Afghanistan (AFG) vs New Zealand (NZ), one-off Test: Rain washed out the fourth successive day of the Test match in Greater Noida. The one-off match is heading towards a rare abandonment without a ball bowled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-announce-najmul-shanto-led-16-member-squad-for-test-series-vs-india-2598386-2024-09-12",
      "headline": "Bangladesh announce squad for India Tests, show faith in Pakistan-beating unitThe Bangladesh Cricket Board announced a 16-member squad for the 2-match Test series against India, starting September 19. The BCB showcased faith in the Pakistan-beating unit for the Test series against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kohlis-captaincy-played-big-role-in-indian-crickets-turnaround-ricky-ponting-2598367-2024-09-12",
      "headline": "Kohli's captaincy played big role in Indian cricket's turnaround: Ricky PontingRicky Ponting praised Virat Kohli for revolutionizing Indian Test cricket, emphasizing his crucial role in transforming the team's mindset and leadership. Kohli's tenure as captain from 2014 to 2022 led India to notable overseas victories, including a historic series win in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/18-year-old-caity-becomes-youngest-womens-world-champ-beats-paris-olympic-winner-2598348-2024-09-12",
      "headline": "18-year-old Caity becomes youngest women's world champ in surfingCaity Simmers, just 18 years old, made history as the youngest women's world surfing champion after defeating Olympic gold medallist Caroline Marks at the 2024 World Surf League Finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-unstoppable-carlos-alcaraz-rivalry-toni-nadal-comparisons-us-open-2598332-2024-09-12",
      "headline": "Unstoppable Sinner will make things difficult for Alcaraz: Toni NadalToni Nadal praised World No. 1 Jannik Sinner as \"practically unstoppable\" after his US Open win but warned that Carlos Alcaraz might struggle to match Sinner's rising dominance, particularly on the mental front."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-shubman-gill-training-hard-in-gym-ahead-of-ind-vs-ban-test-series-2598322-2024-09-12",
      "headline": "Watch: Shubman Gill training hard in gym ahead of IND vs BAN Test seriesShubman Gill was gearing up for the upcoming home Test season as he sweated it out in the gym. He will feature in India's squad for the 2-match Test series vs Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-recalling-debut-dhaka-naimur-rahman-durjoy-sourav-ganguly-2598316-2024-09-12",
      "headline": "Bangladesh makes Test debut vs India: Dhaka witnesses historyIND vs BAN: Bangladesh made their Test debut back in 2000 under Naimur Rahman Durjoy and lost to India by nine wickets at the Bangabandhu Stadium in Dhaka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-jr-brazil-vs-paraguay-defeat-apology-fans-real-madrid-comparisons-2598311-2024-09-12",
      "headline": "Vinicus apologises for Brazil defeat, addresses Real Madrid comparisons Vinicius Junior apologized to fans after Brazil's defeat to Paraguay, acknowledging their poor form in the World Cup Qualifiers. He promised to improve, facing pressure to lead Brazil back to success in upcoming matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-begins-hunt-of-glenn-mcgrath-nathan-lyons-records-in-bangladesh-tests-2598306-2024-09-12",
      "headline": "R Ashwin begins hunt of Glenn McGrath, Nathan Lyon's records in Bangladesh TestsLegendary India spinner R Ashwin will resume his international season with the Test series against Bangladesh. Ashwin, who has 516 wickets to his name has been the standout bowler at home in recent years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-david-ferrer-gold-on-tennis-court-watch-davis-cup-warm-up-session-2598304-2024-09-12",
      "headline": "Watch: Carlos Alcaraz tries his hand at golf on tennis court with David FerrerCarlos Alcaraz and David Ferrer brought laughter to the Davis Cup warm-up, turning a tennis court into a golf course. Despite recent setbacks, Alcaraz's playful moment hints at a hopeful return to form in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/davis-cup-2024-final-carlos-alcaraz-helps-spain-secure-their-opening-match-win-2598301-2024-09-12",
      "headline": "Davis Cup 2024 final: Carlos Alcaraz helps Spain secure their opening match winAlcaraz's return to Davis Cup action ended unexpectedly, as his opponent Machac retired due to cramps. The Spaniard showed his class with a strong second-set comeback and a heart-warming display of sportsmanship, helping Spain secure a 3-0 win over the Czech Republic in their Group B clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-jak-fraser-mcgurk-rough-diamond-australia-all-format-player-2598290-2024-09-12",
      "headline": "Ponting praises 'rough diamond' Fraser McGurk: Can be an all-format playerRicky Ponting has hailed young Jake Fraser-McGurk as a future all-format star for Australia but cautioned that the 22-year-old must refine his aggressive style to fulfill his potential as a key player for Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-begins-hunt-of-glenn-mcgrath-nathan-lyons-records-in-bangladesh-tests-2598306-2024-09-12",
      "headline": "R Ashwin begins hunt of Glenn McGrath, Nathan Lyon's records in Bangladesh TestsLegendary India spinner R Ashwin will resume his international season with the Test series against Bangladesh. Ashwin, who has 516 wickets to his name has been the standout bowler at home in recent years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-david-ferrer-gold-on-tennis-court-watch-davis-cup-warm-up-session-2598304-2024-09-12",
      "headline": "Watch: Carlos Alcaraz tries his hand at golf on tennis court with David FerrerCarlos Alcaraz and David Ferrer brought laughter to the Davis Cup warm-up, turning a tennis court into a golf course. Despite recent setbacks, Alcaraz's playful moment hints at a hopeful return to form in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/davis-cup-2024-final-carlos-alcaraz-helps-spain-secure-their-opening-match-win-2598301-2024-09-12",
      "headline": "Davis Cup 2024 final: Carlos Alcaraz helps Spain secure their opening match winAlcaraz's return to Davis Cup action ended unexpectedly, as his opponent Machac retired due to cramps. The Spaniard showed his class with a strong second-set comeback and a heart-warming display of sportsmanship, helping Spain secure a 3-0 win over the Czech Republic in their Group B clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-jak-fraser-mcgurk-rough-diamond-australia-all-format-player-2598290-2024-09-12",
      "headline": "Ponting praises 'rough diamond' Fraser McGurk: Can be an all-format playerRicky Ponting has hailed young Jake Fraser-McGurk as a future all-format star for Australia but cautioned that the 22-year-old must refine his aggressive style to fulfill his potential as a key player for Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-late-season-slump-2024-sports-psychologist-us-open-2596293-2024-09-12",
      "headline": "Is Carlos Alcaraz's second-half slump in 2024 a cause for concern?Carlos Alcaraz won two Grand Slam titles in 2024, taking his tally to four. The 21-year-old, however, suffered shock exits in the US Open and Cincinnati Masters. Is the Spaniard's late-season slump a cause for concern?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-t20i-travis-head-batting-mantra-wack-it-everytime-half-century-2598278-2024-09-12",
      "headline": "Travis Head reveals batting mantra after brisk England knock: Wack it everytimeTravis Head's explosive 59 off 23 balls set the tone for Australia's win in the first T20I against England, showcasing his aggressive mindset and securing a crucial victory with strong support from the bowlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-test-series-ricky-ponting-ipl-fearless-batters-revolution-2598272-2024-09-12",
      "headline": "IPL has made India batters fearless: Ponting ahead of BGTFormer Australia captain Ricky Ponting feels fearless batters are the main reason behind India doing well in away Test series. Ponting has credited IPL for this revolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-1st-t20i-score-travis-head-matthew-short-bowlers-win-southampton-2598237-2024-09-12",
      "headline": "ENG v AUS, 1st T20I: Travis Head, bowlers fire Australia to big win, 1-0 lead England vs Australia, 1st T20I: Travis Head's blazing fifty and a disciplined bowling effort helped Australia win the series opener in Southampton by 28 runs. Liam Livingstone's all-round effort went in vain for the hosts on a chilly evening on Wednesday, September 11. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}