{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-nifty-falls-market-crash-kashmir-terror-attack-pakistan-nse-bse-dalal-street-red-2714878-2025-04-25",
      "headline": "Sensex falls 800 points: Why is stock market falling today despite early gains?Sensex and Nifty plunged more than 1% reacting to uncertainty over geopolitical tensions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-opens-300-points-higher-nifty-above-24300-tcs-up-2-percent-axis-bank-down-2714862-2025-04-25",
      "headline": "Sensex, Nifty erase early gains as markets react to Kashmir terror attackThe S&P BSE Sensex lost 492.29 points to 79,309.14, while the NSE Nifty50 was down 172.15 points to 24,074.55 as of 10 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-trading-april-25-nse-bse-dalal-street-2714844-2025-04-25",
      "headline": "Sensex, Nifty today: Will Dalal Street return to winning ways on April 25?Stock market today: Gift Nifty futures were trading at 24,522 as of 7:48 am, which is about 1.1% above Thursday's Nifty50 close of 24,246.7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-april-25-ril-axis-bank-gensol-indusind-bank-adani-energy-maruti-suzuki-2714837-2025-04-25",
      "headline": "Stocks to watch today: RIL, Axis Bank, Gensol, IndusInd Bank, Maruti SuzukiReliance Industries will announce its results for the March 2025 quarter today. The market will be watching closely for updates on its energy, telecom, and retail businesses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ed-fema-violation-case-against-gensol-promoters-puneet-jaggi-summoned-for-questioning-2714711-2025-04-24",
      "headline": "ED raids Gensol promoters, detains Puneet Jaggi from Delhi hotel: ReportSources said the probe agency has invoked provisions under the Prevention of Money Laundering Act (PMLA) following findings of fund diversion and misrepresentation flagged earlier by the Securities and Exchange Board of India (Sebi)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pay10-becomes-first-entity-to-go-live-on-cbuaes-open-finance-framework-2714105-2025-04-24",
      "headline": "Pay10 becomes first entity to go live on CBUAE's open finance frameworkThe new license gives Pay10 secure, real-time access to consumer bank accounts, enabling seamless third-party financial services. This sets the foundation for broader innovations in areas such as embedded finance, digital identity, and interoperable payment systems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kumar-mangalam-birla-to-receive-lata-deenanath-mangeshkar-award-2025-2714079-2025-04-24",
      "headline": "Kumar Mangalam Birla to receive Lata Deenanath Mangeshkar Award 2025The 57-year-old industrialist, Padma Bhushan awardee and Chairman of the Aditya Birla Group, is being honoured for his pivotal role in shaping India's growth story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/wives-are-smarter-harsh-goenka-gold-vs-gadget-lesson-goes-viral-2714047-2025-04-24",
      "headline": "'Wives are smarter': Harsh Goenka's gold vs gadget lesson goes viralOn April 24, at 10.30 am, gold on the Multi Commodity Exchange (MCX) was at Rs 95,893 per 10 grams, up Rs 1,171. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-315-points-lower-nifty-below-24250-hul-falls-4-percent-2714007-2025-04-24",
      "headline": "Sensex, Nifty snap 7-day winning streak, HUL falls 4% after Q4 resultsThe S&P BSE Sensex was down 315.06 points to 79,801.43 at the closing bell, while the NSE Nifty50 fell 82.25 points to settle at 24,246.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-indus-waters-treaty-india-pause-impact-pakistan-economy-pahalgam-attack-2713972-2025-04-24",
      "headline": "India hits pause on Indus Waters Treaty: Could this dry up Pakistan's economy?India has suspended the Indus Waters Treaty (IWT). The announcement was made by Foreign Secretary Vikram Misri on Wednesday, a day after a deadly attack in Pahalgam killed several civilians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-vs-mutual-funds-what-should-you-invest-in-for-better-returns-which-investment-give-higher-returns-2713963-2025-04-24",
      "headline": "Gold vs mutual funds: What should you invest in for better returns?Gold is often seen as a safe investment. When markets are shaky or inflation rises, many investors turn to gold. On the other hand, mutual funds, particularly equity funds, are linked to the stock market. When the market does well, your mutual fund investment can grow faster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-today-india-yellow-metal-rates-in-metro-cities-silver-what-to-expect-us-dollar-global-market-2713934-2025-04-24",
      "headline": "Gold prices today: Check rates in metro cities. What to expect?On the Multi Commodity Exchange (MCX), gold was priced at Rs 95,893 per 10 grams at 10.30 am, which was a rise of Rs 1,171 from the last close."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fawad-khan-abir-gulaal-songs-removed-from-youtube-after-pahalagam-attack-2714886-2025-04-25",
      "headline": "Fawad Khan's Abir Gulaal songs removed from YouTube after Pahalgam attackFawad Khan and Vaani Kapoor's 'Abir Gulaal' songs removed from YouTube after Pahalgam attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/phule-movie-review-pratik-gandhi-patralekhaa-revolutionary-film-dimmed-by-dull-storytelling-2714880-2025-04-25",
      "headline": "Phule review: Pratik-Patralekhaa's revolutionary film dimmed by dull storytellingReleased-Fri Apr 25, 2025'Phule' movie review: Director Ananth Mahadevan's 'Phule' delves into the lives of social reformers Jyotirao Phule and Savitribai Phule and their fight for women's education and caste discrimination. Despite its historical significance, the film struggles to engage the audience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-was-in-no-state-to-attend-andaz-apna-apna-re-release-amid-pahalgam-tragedy-2714877-2025-04-25",
      "headline": "Aamir Khan was in 'no state' to attend Andaz Apna… re-release amid Pahalgam tragedyA special screening of the 1994 classic 'Andaz Apna Apna' was held earlier this week. However, Aamir Khan opted out of attending as he was deeply shaken by the recent terror attack in Pahalgam.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-divorce-rumours-hailey-bieber-2714863-2025-04-25",
      "headline": "Justin Bieber on divorce rumours with Hailey: Understand why people can't stand itSinger Justin Bieber was in the news after reports of his divorce from wife Hailey Bieber. In a recent Instagram post, he broke his silence on the speculations about his marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-15-detailed-report-sunny-deol-film-is-rs-80-crore-strong-rs-100-crore-possible-2714858-2025-04-25",
      "headline": "Jaat box office Day 15: Sunny's film is Rs 80 crore strong; Rs 100 crore possible?Sunny Deol's 'Jaat' has slowed down at the box office, but has not stepped out of the race. The film has been performing decently so far, but it will face new releases starting this weekend. Will it reach the benchmark of Rs 100 crore?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-box-office-collection-day-7-detailed-report-can-akshay-kumar-film-grow-in-2nd-weekend-amid-new-releases-2714849-2025-04-25",
      "headline": "Kesari 2 box office Day 7: Can Akshay's film grow in 2nd weekend amid new releases?'Kesari Chapter 2' is looking at a weekend full of new releases. This means a bigger challenge for the film to sustain its run, and also to establish decent growth in the second weekend. Will the Akshay Kumar film be able to sail through this?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-game-changer-flop-idea-karthik-subbaraj-2714843-2025-04-25",
      "headline": "Ram Charan's Game Changer idea was mine, Shankar sir changed story: Retro director'Retro' director Karthik Subbaraj was credited for the story of Ram Charan and director Shankar' 'Game Changer'. In a recent interview, Karthik claimed that while he had given the one-liner, director Shankar changed the story and screenplay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-shalini-25th-wedding-anniversary-cute-video-2714828-2025-04-25",
      "headline": "Actors Ajith Kumar, Shalini celebrate 25 years of togetherness in cute video. WatchActors Ajith Kumar and Shalini rang in their 25th wedding anniversary in a quiet celebration. Shalini shared a cute video in which they are feeding each other chocolate cake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/billy-ray-cyrus-confirms-romance-with-elizabeth-hurley-after-surprise-text-glbs-2714812-2025-04-25",
      "headline": "Billy Ray Cyrus confirms romance with Elizabeth Hurley after surprise textBilly Ray Cyrus confirms a new romance with Elizabeth Hurley, sparked by a heartfelt text. Reconnecting after two years, the pair's bond has brought him happiness and healing following a difficult divorce.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-suffers-global-outage-millions-face-log-in-errors-and-profile-glitches-glbs-2714800-2025-04-25",
      "headline": "Netflix suffers global outage: Millions face log-in errors and profile glitchesNetflix experienced a major global outage, affecting millions of users with login errors, profile mismatches, and streaming disruptions. The company is investigating the cause as users subscribers await service restoration.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-long-post-pahalgam-attack-2714780-2025-04-25",
      "headline": "Pray to fellow Indians to not alienate us: Hina Khan's plea after Pahalgam attackIn the aftermath of a terrorist attack in Pahalgam, Kashmir-born actor Hina Khan expressed her sorrow and condemned the attackers, highlighting the collective pain felt across India. She also prayed for the nation to stand united."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/saturday-night-live-ends-50th-season-with-scarlett-johansson-and-bad-bunny-glbs-2714778-2025-04-25",
      "headline": "Saturday Night Live ends 50th season with Scarlett Johansson and Bad BunnySNL will conclude its 50th season on May 17 with Scarlett Johansson hosting and Bad Bunny performing, wrapping a star-studded final stretch that also includes Quinta Brunson and Walton Goggins.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/keerthy-suresh-in-consideration-opposite-suriya-venky-atluri-next-2714760-2025-04-24",
      "headline": "Keerthy Suresh to reunite with Suriya for Venky Atluri's nextKeerthy Suresh is in talks to star opposite Suriya in the upcoming Telugu film '796CC', to be helmed by Venky Atluri. India Today has learnt that she is yet to sign the deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ryan-reynolds-reflects-on-green-lanterns-failure-pitching-18-projects-to-disney-glbs-2714747-2025-04-24",
      "headline": "Ryan Reynolds reflects on Green Lantern's failure, pitching 18 projects to DisneyAt the 2025 Time100 Summit, Ryan Reynolds opens up about the lessons from Green Lantern's failure, pitching 18 films to Disney, and teasing a new ensemble project, while celebrating his wife, Blake Lively's, Time100 honour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/you-season-5-release-date-full-cast-list-streaming-details-and-what-to-expect-glbs-2714745-2025-04-24",
      "headline": "You Season 5: Release date, full cast list, streaming details, and what to expectNetflix's 'You' Season 5 drops April 24, bringing Joe Goldberg back to New York for a dramatic final chapter. Get the full cast list, release time, streaming info, and what to expect from the gripping conclusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranveer-singh-aditya-dhar-dhurandhar-madh-island-schedule-wrapped-shoot-in-amritsar-next-2714744-2025-04-24",
      "headline": "Team of Ranveer Singh's Dhurandhar wraps Mumbai schedule, to head to AmritsarThe Madh Island schedule of the much-anticipated film Dhurandhar was wrapped up. The team is now heading to Amritsar for its next phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/oprah-winfrey-tops-forbes-list-as-richest-talk-show-host-surpasses-tom-cruise-glbs-2714732-2025-04-24",
      "headline": "Oprah Winfrey tops Forbes list as richest talk-show host, surpasses Tom CruiseOprah Winfrey has been named the world's richest talk show host by Forbes in April 2025, with a $3 billion net worth. At 71, she ranks 1,219th on the Billionaires List, surpassing top Hollywood stars and proving her media empire's lasting power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/weak-hero-class-1-recap-ending-explained-season-2-expectations-2714699-2025-04-24",
      "headline": "Weak Hero Class 1 recap, ending explained, what to expect from season 2Weak Hero Class 2 returns with Yeon Si-eun ready to confront bullies with a hardened resolve, as new challenges await him in a different school. Ahead of that, here's a quick recap of Weak Hero Class 1 and a look into the stand-out elements of the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/srinidhi-shetty-lost-nitesh-tiwari-ramayana-sita-to-sai-pallavi-2714680-2025-04-24",
      "headline": "Srinidhi Shetty on missing out Sita's role to Sai Pallavi in RamayanaNot many are aware that popular South Indian actor Srinidhi Shetty gave a screen test for Nitesh Tiwari's Ramayana. However, she lost it to Sai Pallavi. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/top-lashkar-e-taiba-commander-killed-in-encounter-jammu-and-kashmir-bandipora-pahalgam-attack-terrorists-security-operation-2714884-2025-04-25",
      "headline": "Top LeT commander Altaf Lalli killed in gunfight in J&K's BandiporaTop LeT commander killed in encounter between security forces and terrorists in J&K's Bandipora"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-house-of-terrorist-adil-sheikh-demolished-kashmir-2714876-2025-04-25",
      "headline": "Pahalgam terrorist's house blown up using IEDs, another's bulldozedWhile the residence of Lashkar terrorist Adil Hussain Thoker was blown up using IEDs, the house of Asif Sheikh in Tral was demolished with a bulldozer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistani-posts-army-firing-small-arm-line-of-control-indian-army-retaliates-pahalgam-jammu-kashmir-terror-attack-2714816-2025-04-25",
      "headline": "Pak opens fire along LoC, India retaliates amid tension over J&K attack: SourcesThree days after the Pahalgam terror attack, firing was reported from multiple Pakistani posts along the Line of Control (LoC) by the Pakistan Army throughout the night - an unusual development not reported in recent times, according to sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/asaduddin-owaisi-on-india-suspending-indus-waters-treaty-with-pakistan-asks-where-will-we-store-the-water-2714868-2025-04-25",
      "headline": "Where will we store the water? Owaisi on India suspending Indus treaty with PakReacting to the government's decision to suspend the Indus Waters Treaty of 1960, Asaduddin Owaisi welcomed the bold move, but asked where the government would store the water. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/phule-movie-review-pratik-gandhi-patralekhaa-revolutionary-film-dimmed-by-dull-storytelling-2714880-2025-04-25",
      "headline": "Phule review: Pratik-Patralekhaa's revolutionary film dimmed by dull storytellingReleased-Fri Apr 25, 2025'Phule' movie review: Director Ananth Mahadevan's 'Phule' delves into the lives of social reformers Jyotirao Phule and Savitribai Phule and their fight for women's education and caste discrimination. Despite its historical significance, the film struggles to engage the audience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-slams-nyt-report-on-pahalgam-attack-this-was-a-terrorist-attack-plain-and-simple-glbs-2714810-2025-04-25",
      "headline": "It was terror attack, simple: US House panel fact-checks NYT's Pahalgam headlineThe US House Foreign Affairs Committee slammed The New York Times for calling Pahalgam terrorists \"militants\", as top US leaders condemned the attack and reaffirmed strong support for India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-from-visas-to-water-indias-7-point-action-plan-against-pakistan-after-terror-attack-2714833-2025-04-25",
      "headline": "From visas to water: India's 7-point action plan against Pak after Pahalgam attackDescribing the Pahalgam massacre as a direct assault on India's peace and progress, Prime Minister Narendra Modi vowed to hunt down and punish every terrorist and their backers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/jammu-and-kashmir-attack-pakistan-minister-ishaq-dar-calls-pahalgam-terrorists-freedom-fighters-2714675-2025-04-24",
      "headline": "J&K attack: Pak Deputy PM calls Pahalgam terrorists 'freedom fighters'Terrorists had struck a prime tourist location at Baisaran meadows near Pahalgam in south Kashmir on Tuesday, killing 26 people, mostly tourists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-issues-clarification-on-sending-an-invite-to-arshad-nadeem-2714866-2025-04-25",
      "headline": "Arshad Nadeem competing in India out of question: Neeraj on row over inviteNeeraj Chopra issued a statement clarifying that the invitation to Arshad Nadeem for the NC Classic event was extended well before the  Pahalgam terror attack. Expressing deep pain, Neeraj said he and his family have been deeply hurt by the wave of hate and abuse they've faced since the controversy erupted.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-writes-to-pakistan-after-suspending-indus-waters-treaty-pahalgam-attack-cross-border-terrorism-2714754-2025-04-24",
      "headline": "Dear Mr Murtaza…: India writes to Pak, notifies Indus Waters Treaty pauseIn a letter to Pakistan, India said that Islamabad had breached the Indus Waters Treaty conditions by sustained cross-border terrorism targetting Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-live-updates-key-meet-indus-waters-treaty-amit-shah-rahul-gandhi-pm-modi-india-pakistan-jk-victim-families-2714827-2025-04-25",
      "headline": "Live: Key meet on Indus Waters Treaty at Amit Shah's residence todayPahalgam terror attack live updates: A crucial meeting on the Indus Water Treaty issue will be held today at the residence of Home Minister Amit Shah. Several Union Ministers, including Jal Shakti Minister CR Patil, are expected to attend the meeting. On Tuesday, 26 people were killed in a terror attack in Jammu and Kashmir's Pahalgam. Following the attack, India took a series of sweeping diplomatic and strategic countermeasures against Pakistan, including the effective downgrading of diplomatic relations with Pakistan, closure of key border routes, suspension of the Indus Waters Treaty, and the expulsion of Pakistani military attaches from its High Commission in New Delhi. Follow indiatoday.in for more updates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/pahalgam-attack-how-tourists-escaped-kashmir-valley-to-safety-2714058-2025-04-24",
      "headline": "Pahalgam attack: How tourists escaped Kashmir Valley to safetyIndia's transport infrastructure—both air and rail—rose to the task in the aftermath of the Pahalgam attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/danish-kaneria-slams-pak-deputy-pm-ishaq-dar-for-calling-jk-terrorists-freedom-fighters-2714852-2025-04-25",
      "headline": "Danish Kaneria slams Pak Deputy PM for calling J&K terrorists 'freedom fighters'Former Pakistan cricketer Danish Kaneria has slammed Pakistan's Deputy Prime Minister Ishaq Dar for bizarrely calling Jammu & Kashmir terrorists as 'freedom fighters'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/pentagon-shock-pete-hegseth-used-unsecured-internet-line-to-access-signal-glbs-2714806-2025-04-25",
      "headline": "Pentagon shock: Pete Hegseth used unsecured internet line to access Signal \r\nDefense Secretary Pete Hegseth used an unsecured internet line in his Pentagon office to access Signal, raising serious cybersecurity concerns about potential exposure of sensitive defense information to hacking or surveillance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-nifty-falls-market-crash-kashmir-terror-attack-pakistan-nse-bse-dalal-street-red-2714878-2025-04-25",
      "headline": "Sensex falls 800 points: Why is stock market falling today despite early gains?Sensex and Nifty plunged more than 1% reacting to uncertainty over geopolitical tensions. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/all-party-meeting-pahalgam-attack-government-says-local-authorities-opened-baisaran-without-intel-nod-2714697-2025-04-24",
      "headline": "At all-party meet, government admits to security lapses in Pahalgam: SourcesThe central government, in a closed-door all-party meeting, admitted to security lapses in the recent Pahalgam terror attack, which killed 26 people and injured many others, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/time-poverty-when-time-becomes-the-third-wheel-in-love-2714856-2025-04-25",
      "headline": "Time poverty: When time becomes the third wheel in loveTime poverty is quietly reshaping the way we love, date, and stay connected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-osaf-khan-pahalgam-attack-victim-wife-plotted-husband-killing-arrested-2714795-2025-04-25",
      "headline": "Man claims Pahalgam attack victim's wife plotted husband's killing, arrestedAccused Osaf Khan targeted the woman whose image, showing her sitting beside her husband's body after the Pahalgam attack, went viral and became the face of the Pahalgam massacre."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/aiudf-mla-aminul-islam-arrested-assam-police-after-video-circulates-supporting-pakistan-2714698-2025-04-24",
      "headline": "Assam MLA arrested for 'defending' Pakistan after Pahalgam terror attackAIUDF MLA Aminul Islam was arrested for allegedly supporting Pakistan after the Pahalgam terror attack after a video of him defending the country went viral. He will be produced in court on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/story/bmw-m340i-review-first-drive-fierce-and-demure-2714669-2025-04-25",
      "headline": "BMW M340i review, first drive: Fierce & demureThe brilliant BMW M340i has recieved a minor update to improve its appeal to the sophisticated customer, but does this mean that the budget performance formula is diluted? We find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-divorce-rumours-hailey-bieber-2714863-2025-04-25",
      "headline": "Justin Bieber on divorce rumours with Hailey: Understand why people can't stand itSinger Justin Bieber was in the news after reports of his divorce from wife Hailey Bieber. In a recent Instagram post, he broke his silence on the speculations about his marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/all-party-meeting-leaders-stand-by-centre-all-support-for-future-action-against-pahalgam-terror-attack-2714731-2025-04-24",
      "headline": "Full support: Opposition backs government's action on Pahalgam terror attackIn the all-party meeting held on Thursday, the Opposition extended its full support to any government action against the perpetrators of the Pahalgam terror attack, including Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/slain-bengal-techie-bitan-adhikari-wife-sohini-recounts-pahalgam-terrorist-attack-horror-2714793-2025-04-25",
      "headline": "My son said Mama, sound, fire: Slain Bengal techie's wife recounts Pahalgam horrorBitan Adhikari, a 40-year-old engineer employed with Tata Consultancy Services (TCS) in the US, was shot dead on the spot in front of his wife and child, who survived."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-why-pakistan-army-chief-asim-munir-risking-mini-war-with-india-2714005-2025-04-24",
      "headline": "Why Pak army chief Asim Munir is desperate for a mini-war with IndiaIndia's top leadership, including PM Narendra Modi, has vowed a befitting reply over the Pahalgam massacre. Pakistan's role is undeniable, and India has both diplomatic and kinetic options on the table, like after the Uri and Pulwama attacks. This is why Pakistan's army chief, General Asim Munir, might be risking a limited war with India."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-issues-clarification-on-sending-an-invite-to-arshad-nadeem-2714866-2025-04-25",
      "headline": "Arshad Nadeem competing in India out of question: Neeraj on row over inviteNeeraj Chopra issued a statement clarifying that the invitation to Arshad Nadeem for the NC Classic event was extended well before the  Pahalgam terror attack. Expressing deep pain, Neeraj said he and his family have been deeply hurt by the wave of hate and abuse they've faced since the controversy erupted.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dewald-brevis-to-make-csk-debut-against-srh-stephen-fleming-reacts-2714857-2025-04-25",
      "headline": "IPL 2025: Dewald Brevis to make CSK debut against SRH? Stephen Fleming reactsCSK head coach Stephen Fleming addressed the potential debut of Dewald Brevis ahead of their clash with Sunrisers Hyderabad on Friday, April 25. Brevis recently joined the five-time champions as a replacement player for the rest of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/danish-kaneria-slams-pak-deputy-pm-ishaq-dar-for-calling-jk-terrorists-freedom-fighters-2714852-2025-04-25",
      "headline": "Danish Kaneria slams Pak Deputy PM for calling J&K terrorists 'freedom fighters'Former Pakistan cricketer Danish Kaneria has slammed Pakistan's Deputy Prime Minister Ishaq Dar for bizarrely calling Jammu & Kashmir terrorists as 'freedom fighters'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/tennis-legend-roger-federer-named-honorary-starter-for-le-mans-2714845-2025-04-25",
      "headline": "Tennis legend Roger Federer named honorary starter for Le MansTennis legend Roger Federer will act as the official starter for this year's 24 Hours of Le Mans sportscar race in June, organisers said on Thursday.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-head-coach-andy-flower-praises-team-for-win-vs-rr-2714839-2025-04-25",
      "headline": "Really proud of the way we held ourselves under pressure: RCB head coachRoyal Challengers Bengaluru (RCB) head coach Andy Flower praised his team for holding their nerves under pressure against Rajasthan Royals (RR) and registering a thrilling 11-run win at the M. Chinnaswamy Stadium in Bengaluru."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-beat-rr-rajasthan-royals-pacer-sandeep-sharma-press-conference-2714838-2025-04-25",
      "headline": "Rajasthan Royals let games slip, need to capitalise on crucial chances: Sandeep SharmaAfter Rajasthan Royals' 11-run loss to Royal Challengers Bengaluru, pacer Sandeep Sharma admitted that the team let the game slip away and missed key opportunities.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-andy-flower-on-josh-hazlewood-rcb-vs-rr-bengaluru-2714836-2025-04-25",
      "headline": "Andy Flower praises 'class operator' Josh Hazlewood after death over heroics vs RRRoyal Challengers Bengaluru (RCB) head coach Andy Flower was effusive in his praise for Josh Hazlewood following his match-winning performance against Rajasthan Royals (RR).  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunil-gavaskar-on-rajasthan-royals-rahul-dravid-rcb-vs-rr-2714823-2025-04-25",
      "headline": "Despite Rahul Dravid at helm, RR playing unthinking cricket: Sunil GavaskarSunil Gavaskar criticised Rajasthan Royals' poor game awareness, stressing that their repeated errors were surprising, especially under the guidance of Rahul Dravid. With five losses in a row, RR now face a tough road ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-rr-sanju-samsons-absence-costing-rr-says-sandeep-sharma-2714818-2025-04-25",
      "headline": "Sanju Samson's absence costing RR: Sandeep Sharma after fifth straight defeatSandeep Sharma pointed to Sanju Samson's absence as one the key reasons behind Rajasthan Royals' IPL 2025 collapse. RR suffered their fifth straight defeat this season after losing to RCB on April 24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-josh-hazlewood-shrugs-off-pressure-talks-in-heroic-19th-over-vs-rr-2714815-2025-04-25",
      "headline": "IPL 2025: Josh Hazlewood shrugs off pressure talks in heroic 19th over vs RR IPL 2025, RCB vs RR: Josh Hazlewood opened up on the stupendous 19th over he bowled against the Rajasthan Royals where he gave away only one run and took two crucial wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-rr-virat-kohli-batting-template-first-home-win-2714779-2025-04-25",
      "headline": "Virat Kohli reveals RCB's template for first home win in IPL 2025Virat Kohli emphasised that RCB executed a well-planned batting strategy against RR, with his and Devdutt Padikkal's efforts helping the team finally adapt to Chinnaswamy conditions and secure their first home win of IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-andy-flower-on-josh-hazlewood-rcb-vs-rr-bengaluru-2714836-2025-04-25",
      "headline": "Andy Flower praises 'class operator' Josh Hazlewood after death over heroics vs RRRoyal Challengers Bengaluru (RCB) head coach Andy Flower was effusive in his praise for Josh Hazlewood following his match-winning performance against Rajasthan Royals (RR).  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunil-gavaskar-on-rajasthan-royals-rahul-dravid-rcb-vs-rr-2714823-2025-04-25",
      "headline": "Despite Rahul Dravid at helm, RR playing unthinking cricket: Sunil GavaskarSunil Gavaskar criticised Rajasthan Royals' poor game awareness, stressing that their repeated errors were surprising, especially under the guidance of Rahul Dravid. With five losses in a row, RR now face a tough road ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-rr-sanju-samsons-absence-costing-rr-says-sandeep-sharma-2714818-2025-04-25",
      "headline": "Sanju Samson's absence costing RR: Sandeep Sharma after fifth straight defeatSandeep Sharma pointed to Sanju Samson's absence as one the key reasons behind Rajasthan Royals' IPL 2025 collapse. RR suffered their fifth straight defeat this season after losing to RCB on April 24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-josh-hazlewood-shrugs-off-pressure-talks-in-heroic-19th-over-vs-rr-2714815-2025-04-25",
      "headline": "IPL 2025: Josh Hazlewood shrugs off pressure talks in heroic 19th over vs RR IPL 2025, RCB vs RR: Josh Hazlewood opened up on the stupendous 19th over he bowled against the Rajasthan Royals where he gave away only one run and took two crucial wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-rr-virat-kohli-batting-template-first-home-win-2714779-2025-04-25",
      "headline": "Virat Kohli reveals RCB's template for first home win in IPL 2025Virat Kohli emphasised that RCB executed a well-planned batting strategy against RR, with his and Devdutt Padikkal's efforts helping the team finally adapt to Chinnaswamy conditions and secure their first home win of IPL 2025."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}