{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/punjab-national-bank-interest-rates-pnb-revises-interest-rates-check-new-home-car-and-personal-loan-rates-2683021-2025-02-20",
      "headline": "PNB revises interest rates. Check new home, car and personal loan rates There will be zero processing fees and documentation charges on most of PNB's home loan schemes till March 31, 2025, thereby making housing loans more affordable and more accessible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-smart-pension-plan-check-eligibility-and-other-details-2682975-2025-02-20",
      "headline": "LIC Smart Pension Plan: Check eligibility and other details The Smart Pension Plan requires a minimum investment of Rs 1,00,000, while there is no cap on the maximum purchase limit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-electric-vehicle-set-for-india-entry-with-first-ev-shipment-in-coming-months-report-2682925-2025-02-20",
      "headline": "Tesla set for India entry with first EV shipment in coming months: Report The US carmaker plans to start selling these cars in the three major cities of Mumbai, Delhi, and Bangalore around the third quarter of the year, say reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-ends-200-points-lower-nifty-below-23000-hdfc-falls-over-2-2682897-2025-02-20",
      "headline": "Sensex ends 200 points lower, Nifty below 23,000; HDFC falls over 2%Stock market closing today: The S&P BSE Sensex ended 203.22 points lower at 75,735.96, while the NSE Nifty50 fell 19.75 points to settle at 22,913.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-impact-on-indian-rupee-jefferies-explained-2682872-2025-02-20",
      "headline": "Will Donald Trump's reciprocal tariffs hurt Indian rupee? It may be noted that India was the 10th biggest exporter to the US in 2024, and higher tariffs might make it tougher for Indian businesses to sell their goods there."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/supreme-court-gratuity-act-can-employers-deny-gratuity-in-any-situation-check-ruling-2682833-2025-02-20",
      "headline": "Can employers deny gratuity in any situation? Here's all you need to knowWith the latest ruling, the Supreme Court has stated that if an employer dismisses an employee on grounds of moral turpitude, his gratuity can be forfeited without waiting for a court's verdict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fiis-continue-to-dump-indian-stocks-which-stocks-are-feeling-the-heat-2682829-2025-02-20",
      "headline": "FIIs continue to dump Indian stocks: Which stocks are feeling the heat? Data from National Securities Depository Limited (NSDL) showed that FPIs have dumped $3.5 billion worth of financial stocks in 2025 so far, accounting for 31% of their total sales of $11.45 billion as of February 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-may-offer-relief-for-new-india-co-op-bank-depositors-scam-scrutiny-2682825-2025-02-20",
      "headline": "RBI may allow some depositors of New India Co-op Bank to withdraw funds: Report Last week, the RBI took strict action against New India Co-operative bank by suspending deposit withdrawals for six months, stopping the issuance of new loans, and appointing an administrator. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uday-kotak-explains-how-fiis-foreign-outflow-are-gaining-at-the-expense-of-domestic-retail-investors-stock-market-2682813-2025-02-20",
      "headline": "Uday Kotak explains how FIIs are gaining at the expense of domestic investorsUday Kotak said that FIIs are benefiting from the investments made by domestic retail investors, who are continuously putting money into the stock market. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-pay-new-bill-payment-google-pay-begins-charging-for-bill-payments-what-users-need-to-know-2682787-2025-02-20",
      "headline": "Google Pay begins charging for bill payments. Here's what users need to knowThis is not the first time Google Pay has announced the imposition of fees. Last year, it levied Rs 3 convenience fee for mobile recharges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-threat-indian-exporters-minimal-impact-explained-2682790-2025-02-20",
      "headline": "Indian exporters aren't losing sleep over Donald Trump's tariff threat. Here's whyIndustry executives say US tariff hikes on autos and pharmaceuticals won't hurt Indian exporters much, as competitors from other countries will face the same impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-cuts-budget-2025-rbi-bulletin-consumption-middle-class-2682747-2025-02-20",
      "headline": "Will tax cuts for middle class in budget help boost consumption? RBI says this The RBI bulletin pointed out that the government has given a Rs 1 lakh crore tax break to the middle class, which should leave more money in their pockets."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/popular-tv-actor-dipika-kakar-ibrahim-has-quit-celebrity-masterchef-india-2683158-2025-02-20",
      "headline": "TV actor Dipika Kakar Ibrahim quits Celebrity MasterChef amid health concernsPopular TV actor Dipika Kakar Ibrahim has withdrawn from Celebrity MasterChef due to health issues. Despite the show's support, she prioritised her well-being over the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-singer-honey-singh-arrives-in-mumbai-for-millionaire-concert-stageaajtak-2683117-2025-02-20",
      "headline": "Rapper-singer Honey Singh arrives in Mumbai for sold-out concertHoney Singh is in Mumbai for the much-anticipated Stage AajTak Millionaire concert this Saturday, February 22. With a fantastic set list, the sold-out show promises a night full of magic and madness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/boyfriend-on-demand-jisoo-seo-in-guk-to-star-in-netflixs-next-show-on-virtual-dating-2683100-2025-02-20",
      "headline": "Jisoo, Seo In-guk to star in Netflix's next show on virtual datingJisoo and Seo In-guk are joining hands for an upcoming Netflix drama, Boyfriend on Demand. The show will explore virtual reality dating. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-last-of-us-part-2-set-for-april-release-pedro-pascal-bella-ramsey-hbo-2682924-2025-02-20",
      "headline": "The Last Of Us Part 2 release date announced The Last Of Us Part 2's release date has been announced. The Pedro Pascal show is all set to stream on Prime Video from April 13."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/eminem-finally-coming-to-india-rappers-leaked-schedule-hints-so-2682961-2025-02-20",
      "headline": "Is Eminem finally coming to India? Rapper's leaked schedule hints soLeaked documents have suggested that Eminem will perform in Mumbai in June 2025 as part of his world tour. The rapper's first visit to India is stirring excitement among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/cid-now-streaming-on-netflix-2682942-2025-02-20",
      "headline": "Iconic TV show CID now streaming on NetflixCID on Netflix: The iconic Indian crime series CID is now available on Netflix, allowing fans worldwide to stream the popular show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/will-prime-video-jack-reacher-ever-visit-india-author-lee-child-speaks-2682815-2025-02-20",
      "headline": "Will Prime Video's Jack Reacher ever visit India? Author Lee Child speaksAuthor Lee Child, whose Reacher books have inspired a series on Prime Video, spoke to India Today Digital, about the possibility of seeing his leading character travelling to India in the future. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/shenaz-treasury-reveals-losing-a-brand-deal-after-ranveer-allahbadia-controversy-samay-raina-indias-got-latent-2682822-2025-02-20",
      "headline": "Vlogger Shenaz Treasury reveals losing a brand deal after Ranveer Allahbadia row Former actor and influencer Shenaz Treasury recently shared how she lost a brand deal after Ranveer Allahbadia's controversy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nadaaniyan-ibrahim-ali-khan-explains-love-to-miss-briganza-release-date-out-2682803-2025-02-20",
      "headline": "Nadaaniyan: Ibrahim Ali Khan explains love to Miss Briganza; release date outNetflix on Thursday announced the release date of Ibrahim Ali Khan and Khushi Kapoor's 'Nadaaniyan'. The film is a Gen-Z love story and is set in Delhi-Noida. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/palak-muchhal-on-timeless-appeal-of-sanam-teri-kasam-title-song-2682763-2025-02-20",
      "headline": "Palak Muchhal on timeless appeal of Sanam Teri Kasam title song: It's magicalSanam Teri Kasam's title track is topping the music charts. Singer Palak Muchhal calls it surreal, recalls recording it, and hints at a new version. She also discusses Amitabh Bachchan's praise and the evolving music industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/comedian-daniel-fernandes-samay-raina-ranveer-allahbadia-indias-got-latent-2682707-2025-02-20",
      "headline": "They'll just ask Samay Raina to write a 300-word essay: Comic mocks outrageComedian Daniel Fernandes mocked the outrage over Samay Raina's controversy, joking that he'd only need to write a \"300-word essay.\" He also criticised calls to ban India's Got Latent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/aap-rocky-rihanna-promised-to-name-their-next-baby-after-lawyer-joe-tacopina-2682691-2025-02-20",
      "headline": "Rihanna, A$AP Rocky to name next baby after lawyer who helped win caseIn a statement, A$AP Rocky's lawyer revealed that the rapper and his long-time partner Rihanna jokingly promised to name their next child after him. A$AP Rocky was found not guilty in a felony assault trial."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-claims-brics-india-china-broke-up-threatened-150-tariffs-undermining-dollar-2683205-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump claims BRICS 'broke up' after tariff threat: Haven't heard from them latelyTrump claims BRICS, which includes India, 'broke up' after he threatened 150% tariffs for undermining dollar"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankars-veiled-dig-at-china-during-g20-ministers-meet-in-south-africa-no-room-for-coercion-2683197-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No room for coercion: Jaishankar's veiled dig at China during G20 ministers' meetJaishankar said that the member nations must also recognise that multilateralism itself lies deeply damaged and that the UN and its Security Council are often grid-locked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/kash-patel-fbi-director-confirmed-donald-trump-loyalist-republican-dan-scavino-assistant-bollywood-meme-video-viral-2683177-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Trump aide's 'Malhari' edit to welcome new FBI chief Kash PatelTaking to X, Dan Scavino - who is US President Donald Trump's assistant and White House Deputy Chief of Staff - shared an edited 47-second dance clip from the film 'Bajirao Mastani' to congratulate Kash Patel on becoming the FBI director."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/fact-check/story/fact-check-woman-showing-impressive-sword-wielding-skills-is-not-delhis-new-cm-rekha-gupta-2683085-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woman showing impressive sword-wielding skills is NOT Delhi's new CM Rekha GuptaThe viral video shows actress Payal Jadhav showcasing her sword-wielding skills. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/tesla-ceo-elon-musk-waves-chainsaw-symbolising-us-federal-spending-cuts-under-doge-javier-milei-2683182-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'For bureaucracy': Elon Musk waves chainsaw gifted by Argentina's MileiThe Department of Government Efficiency (DOGE) headed by Tesla CEO and billionaire Elon Musk, claims to have saved $55 billion by February 19, with a single contract being worth USD 8 billion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/elon-musk-andreas-mogensen-sunita-williams-butch-wilmore-return-space-spat-twitter-retarded-lie-idiot-donald-trump-joe-biden-2683221-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk's spat with astronaut over Sunita Williams in space: Lie vs idiotFormer ISS commander Andreas Mogensen called out SpaceX CEO Elon Musk for claiming Joe Biden abandoned Sunita Williams and Butch Wilmore in space for \"political reasons\". Musk was quick to counter, calling Mogensen an \"idiot\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-marriage-divorce-case-end-of-life-terminate-cases-couple-2683119-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Marriage falling apart not end of life, move ahead: Supreme Court to coupleThe Supreme Court, while dissolving the marriage of a couple, observed that a failed marriage is not the end of life and advised them to move forward peacefully."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/sourav-ganguly-accident-durgapur-expressway-uninjured-2683198-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sourav Ganguly unharmed after car accident on way to Burdwan eventFormer Indian captain Sourav Ganguly narrowly avoided a major accident en route to Burdwan but remained composed. Fortunately, no one was injured in the accident. However, two cars in Ganguly's convoy suffered minor damage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/its-2025-but-has-dating-become-any-easier-for-divorced-indian-women-2683214-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "It's 2025, but has dating become any easier for divorced Indian women?Everyone wants to find love—because why not? It's a magical feeling. But in this search for love, do divorced men have it easier than women?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/lpus-2025-batch-final-year-student-bags-rs-103-crore-118000-placement-package-2682322-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LPU's 2025 Batch Final Year Student Bags Rs 1.03 Crore ($1,18,000) Placement Package-Betireddy Naga Vamsi Reddy B. Tech student has secured a 1.03 Crore ($1,18,000) package with an AI robotics company and is set to graduate in May 2025. \r\n\r\n-Over 1,700 students have received packages ranging from Rs 10 LPA – Rs 1 Crore per annum \r\n\r\n-1,912 students received multiple job offers while Adireddy Vasu, secured 7 job offers, setting a rare and impressive record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/please-come-back-kiit-founder-achyuta-samanta-apologises-asks-nepalese-students-to-return-2683188-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Please come back: KIIT founder apologises, asks Nepalese students to returnThe video of Samanta's first public statement on the incident was posted on KIIT's X platform, hours after he was summoned by the Odisha government's high-level committee probing the matter to appear before it on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/andhra-telangana-brace-for-a-summer-showdown-over-krishna-river-waters-2682724-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Andhra, Telangana brace for a summer showdown over Krishna river watersAndhra, facing Telangana's accusation of drawing excess water, is reluctant to alter the 66:34 apportioning to equal share, pending a much-awaited tribunal decision\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/oppo-launches-find-n5-thinnest-foldable-phone-in-the-world-pricing-is-eye-watering-2683206-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Oppo Find N5 launched, company says it is the thinnest foldable phone in the worldOppo Find N5 has made a global debut of its world's thinnest foldable phone and it is priced around Rs 1,60,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-lok-sabha-election-turnout-usaid-funding-india-director-veena-reddy-2683025-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Veena Reddy, ex-USAID India chief facing BJP heatDonald Trump claimed that the previous Joe Biden administration in the US tried to interfere in India's elections by allocating a now-cancelled $21 million grant for voter turnout, implying it was intended to influence the outcome."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sonia-gandhi-admitted-to-ganga-ram-hospital-in-delhi-sources-2683120-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sonia Gandhi admitted to Ganga Ram Hospital in Delhi: ReportWhile the exact time of admission is not immediately known, a source said, former Congress president Sonia Gandhi was admitted on Thursday morning."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/explosions-on-three-buses-in-israel-in-a-suspected-terror-attack-2683174-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Explosions on three buses in Israel in a suspected 'terror attack'Explosions on three buses in a parking lot shook central Israel on Thursday, suspected to be a militant attack. No injuries were reported. The blasts occurred as Israel mourned the return of four hostage bodies from Gaza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/nilavuku-enmel-ennadi-kobam-review-dhanush-pavish-narayan-mathew-thomas-anikha-surendran-2683195-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nilavuku Enmel Ennadi Kobam review: Dhanush's moon-aimed mission is half successfulReleased-Fri Feb 21, 2025Nilavuku Enmel Ennadi Kobam movie review: Directed by Dhanush, the rom-com starring Pavish, Anikha Surendran and Matthew Thomas, is a fun film about love and friendships. The film has inconsistencies in screenplay, which never lets it rise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-robin-uthappa-on-virat-kohlis-form-india-vs-bangladesh-ind-vs-ban-2683155-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Virat Kohli more worried about middling the ball instead of scoring: Robin UthappaFormer India batter Robin Uthappa commented on Virat Kohli's poor form after he got dismissed for 22 in India's first match of the ICC Champions Trophy 2025 against Bangladesh. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/body-of-mother-of-youngest-hostages-not-released-by-hamas-claims-israel-2683175-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Body released by Hamas not of mother of youngest hostages, Israel allegesIsrael's military accused Hamas of violating the ceasefire after failing to return Shiri Bibas's body, though her sons, Kfir and Ariel, were among the remains handed over.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/should-one-opt-for-endoscopic-spine-surgery-2682779-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Should one opt for endoscopic spine surgery?The minimally-invasive technique is a game-changer as it reduces tissue damage, blood loss and postoperative pain, aiding faster recovery\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/iphone-16e-vs-iphone-16-india-price-design-specs-compared-in-detail-2682968-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "iPhone 16e vs iPhone 16: India price, design, specs compared in detailiPhone 16e vs iPhone 16: There is a price gap of Rs 20,000 between both phones. So, which one should you buy? Let's find out in this detailed comparison."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/judge-allows-trump-to-continue-mass-firings-of-federal-employees-for-now-2683189-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Judge allows Trump to continue mass firings of federal employees for nowUS District Judge Christopher Cooper said Trump's onslaught of executive actions in his first month in office have caused \"disruption and chaos but he said he likely lacks the power to decide whether the firing of tens of thousands of government workers is lawful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rekha-gupta-finance-ashish-sood-home-education-parvesh-verma-pwd-kapil-mishra-law-cabinet-delhi-2683083-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi portfolios: Rekha Gupta keeps Finance, Parvesh Verma PWD, Kapil Mishra LawThe BJP government in New Delhi has allocated Cabinet portfolios, with Chief Minister Rekha Gupta retaining Finance and Revenue. Senior leader Ashish Sood has been assigned the Home department. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/archaeologists-dive-into-sea-for-4000-year-old-dwarka-krishnas-karmabhoomi-asi-underwater-archaeology-wing-2682865-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Archaeologists dive into sea for 4,000-year-old Dwarka, Krishna's karmabhoomiThe ASI's Underwater Archaeology Wing has launched a fresh exploration exercise off the coast of Gujarat at Dwarka, believed to be Lord Krishna's legendary city. The renewed attempt, after two decades, is to study and preserve cultural heritage in the depths of the Arabian Sea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/veer-pahariya-thanks-trolls-langdi-step-im-getting-more-work-2683237-2025-02-21",
      "headline": "Actor Veer Pahariya thanks trolls: My engagement soared, I'm getting more workActor Veer Pahariya embraces trolling over his viral Sky Force dance step, saying it boosted his career and got him wedding gigs. He thanks trolls, joking that he hopes for more so he can earn even more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-to-play-auto-driver-in-hollywood-debut-watch-viral-clip-2683234-2025-02-21",
      "headline": "Salman Khan to play auto driver in Hollywood debut? Watch viral clipVideos of superstar Salman Khan filming his Hollywood debut in Dubai have gone viral on social media. In one clip, he is seen dressed as an auto driver, accompanied by actor and friend Sanjay Dutt.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-katrina-kaif-step-out-for-movie-night-hand-in-hand-2683196-2025-02-21",
      "headline": "Vicky Kaushal-Katrina Kaif step out for movie night hand-in-hand. WatchActor couple Vicky Kaushal and Katrina Kaif were seen stepping out for a date night in Mumbai. Videos and pictures of their outing quickly surfaced on social media, capturing the attention of fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/nilavuku-enmel-ennadi-kobam-review-dhanush-pavish-narayan-mathew-thomas-anikha-surendran-2683195-2025-02-21",
      "headline": "Nilavuku Enmel Ennadi Kobam review: Dhanush's moon-aimed mission is half successfulReleased-Fri Feb 21, 2025Nilavuku Enmel Ennadi Kobam movie review: Directed by Dhanush, the rom-com starring Pavish, Anikha Surendran and Matthew Thomas, is a fun film about love and friendships. The film has inconsistencies in screenplay, which never lets it rise."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-slow-over-rate-penalty-new-zealand-mohammed-rizwan-guilty-2683226-2025-02-21",
      "headline": "Champions Trophy: Pakistan fined for slow-over rate against New ZealandPakistan were fined 5 percent of their match fee for maintaining a slow over-rate against New Zealand in their Champions Trophy opener, adding to their struggles as they prepare for a high-stakes clash against India on February 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-towhid-hridoy-century-india-vs-bangladesh-build-confidence-2683208-2025-02-21",
      "headline": "Champions Tropphy: Hridoy hopeful century vs India will build confidenceBangladesh batter Towhid Hridoy expressed optimism after his maiden ODI century against India in the Champions Trophy opener on February 20, believing the knock will boost his confidence and play a crucial role in shaping his international cricketing career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-mohammed-shami-india-vs-bangladesh-dedicates-to-father-role-model-2683194-2025-02-21",
      "headline": "Shami dedicates bowling brilliance vs Bangladesh to 'role model' fatherIndia's veteran pacer Mohammed Shami dedicated his stunning five-wicket haul against Bangladesh in the Champions Trophy opener to his father, whom he hailed as his greatest inspiration and role model, crediting him for shaping his cricketing journey and resilience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/sourav-ganguly-accident-durgapur-expressway-uninjured-2683198-2025-02-21",
      "headline": "Sourav Ganguly unharmed after car accident on way to Burdwan eventFormer Indian captain Sourav Ganguly narrowly avoided a major accident en route to Burdwan but remained composed. Fortunately, no one was injured in the accident. However, two cars in Ganguly's convoy suffered minor damage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-india-vs-pakistan-no-special-mindset-needed-2683192-2025-02-21",
      "headline": "5-star Shami not stressing over India vs Pakistan: No special mindsetMohammed Shami remains unfazed ahead of India's high-stakes Champions Trophy clash against Pakistan, trusting his momentum from a stellar five-wicket haul against Bangladesh instead of adopting a special mindset for the blockbuster encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-robin-uthappa-on-virat-kohlis-form-india-vs-bangladesh-ind-vs-ban-2683155-2025-02-21",
      "headline": "Virat Kohli more worried about middling the ball instead of scoring: Robin UthappaFormer India batter Robin Uthappa commented on Virat Kohli's poor form after he got dismissed for 22 in India's first match of the ICC Champions Trophy 2025 against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-harbhajan-singh-india-lession-interview-2683165-2025-02-21",
      "headline": "Harbhajan Singh wants India to learn 'one lesson' despite win against Bangladesh  Champions Trophy: Former Indian spinner Harbhajan Singh said that India should try and put around 280-300 runs on the board while batting first to put pressure on the opposition on the slow and low pitches at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-shubman-gill-reactions-2683159-2025-02-21",
      "headline": "Who said what after Shami, Shubman Gill help India beat Bangladesh Champions Trophy: Rohit Sharma praised Shubman Gill and Mohammed Shami for their incredible performance after India beat Bangladesh by six wickets. Shanto, on the other hand, said that losing wickets in the powerplay pushed the Tigers back on the backfoot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mohammed-shami-flying-kiss-father-2683142-2025-02-20",
      "headline": "Shami reveals reason behind 'flying kiss' after 5-wicket haul vs BangladeshChampions Trophy 2025: Fast bowler Mohammed Shami said that he did the flying kiss celebration for his father after taking the five-wicket haul against Bangladesh on Thursday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-shubman-gill-scores-century-vs-bangladesh-ind-vs-ban-2683129-2025-02-20",
      "headline": "Shubman Gill repays Rohit Sharma's faith, hits another ton as vice captainStar India batter Shubman Gill scored a magnificent hundred to script a six-wicket win for India in their first game of the ICC Champions Trophy 2025 in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-axar-patel-catch-2683123-2025-02-20",
      "headline": "Rohit Sharma plans to take Axar Patel out for 'dinner' after drop catch on hat-trickChampions Trophy: Rohit Sharma said that he plans to take Axar Patel out for dinner after dropping a catch off his bowling during India's match against Bangladesh at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-harbhajan-singh-india-lession-interview-2683165-2025-02-21",
      "headline": "Harbhajan Singh wants India to learn 'one lesson' despite win against Bangladesh  Champions Trophy: Former Indian spinner Harbhajan Singh said that India should try and put around 280-300 runs on the board while batting first to put pressure on the opposition on the slow and low pitches at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-shubman-gill-reactions-2683159-2025-02-21",
      "headline": "Who said what after Shami, Shubman Gill help India beat Bangladesh Champions Trophy: Rohit Sharma praised Shubman Gill and Mohammed Shami for their incredible performance after India beat Bangladesh by six wickets. Shanto, on the other hand, said that losing wickets in the powerplay pushed the Tigers back on the backfoot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mohammed-shami-flying-kiss-father-2683142-2025-02-20",
      "headline": "Shami reveals reason behind 'flying kiss' after 5-wicket haul vs BangladeshChampions Trophy 2025: Fast bowler Mohammed Shami said that he did the flying kiss celebration for his father after taking the five-wicket haul against Bangladesh on Thursday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-shubman-gill-scores-century-vs-bangladesh-ind-vs-ban-2683129-2025-02-20",
      "headline": "Shubman Gill repays Rohit Sharma's faith, hits another ton as vice captainStar India batter Shubman Gill scored a magnificent hundred to script a six-wicket win for India in their first game of the ICC Champions Trophy 2025 in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-axar-patel-catch-2683123-2025-02-20",
      "headline": "Rohit Sharma plans to take Axar Patel out for 'dinner' after drop catch on hat-trickChampions Trophy: Rohit Sharma said that he plans to take Axar Patel out for dinner after dropping a catch off his bowling during India's match against Bangladesh at the Dubai International Cricket Stadium. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}