{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/mango-millionaire-makes-money-feel-relatable-radhika-gupta-niranjan-awasthi-2758912-2025-07-21",
      "headline": "From Bollywood to dal-chawal, Mango Millionaire makes money feel relatable'Mango Millionaire' turns personal finance into a relatable conversation, using Bollywood, family meals, and everyday metaphors to explain money matters. It's simple, practical, and feels more like advice from a friend than a finance manual."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/louis-vuitton-faces-scrutiny-over-hong-kong-data-leak-2759100-2025-07-21",
      "headline": "Louis Vuitton faces scrutiny over Hong Kong data leakHong Kong's Office of the Privacy Commissioner for Personal Data said on Monday that it has started an investigation into how this happened and whether the company told the authorities on time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/salary-survey-2025-foundit-appraisals-done-not-enough-employees-want-to-change-jobs-2759058-2025-07-21",
      "headline": "Over 85% of employees plan to change jobs after salary hikes in 2025: SurveyMost hikes fell in the 5–10% range, with only a small fraction crossing the 20% mark. Advertising, education, and IT saw the highest share of professionals reporting no hike at all, while sectors like energy and BFSI offered relatively better payouts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-shock-for-karnataka-vendor-raises-concerns-among-small-upi-users-2759049-2025-07-21",
      "headline": "GST shock for Karnataka vendor raises concerns among small UPI usersThe incident shows why small traders might stop taking UPI payments out of fear. Many would rather handle cash than deal with confusing tax demands. This goes against the government's aim of building a cashless economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/real-estate-homes-under-rs-1-crore-metro-city-property-price-rs-1-crore-new-delhi-mumbai-bangalore-2759033-2025-07-21",
      "headline": "Affordable homes are vanishing. Can you still get a 2BHK under Rs 1 crore?Real estate prices across major metros have surged due to strong demand, high construction costs, and a steady flow of luxury housing projects. Yet, there are still locations in both Tier-1 and Tier-2 cities where a 2BHK under Rs 1 crore is within reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-442-points-nifty-ends-above-25000-eternal-jumps-over-7-2759031-2025-07-21",
      "headline": "Sensex gains 442 points, Nifty ends above 25,000; Eternal jumps over 7%The S&P BSE Sensex gained 442.61 points to close at 82,200.34, while the NSE Nifty50 added 122.30 points to end at 25,090.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/have-not-got-your-tax-refund-yet-here-is-why-it-may-be-delayed-wrong-hra-claims-mismatch-itr-ais-data-2758954-2025-07-21",
      "headline": "Haven't got your tax refund yet? Here's why it may be delayedSometimes, taxpayers claim deductions like HRA or medical insurance without having proper proof. If the tax department finds something suspicious, they may stop your refund and send you a notice for more details."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-now-hosts-over-half-the-worlds-gccs-led-by-bengaluru-2758930-2025-07-21",
      "headline": "India now hosts over half the world's GCCs, led by BengaluruFrom cost-saving outposts to strategic anchors, India's GCC evolution is reshaping global operations. As Tier-2 cities gear up, the next big wave might come from smaller, smarter urban bets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-in-lok-sabha-today-how-it-impacts-you-2758892-2025-07-21",
      "headline": "New income tax bill in Lok Sabha today: How it impacts youThe Bill aims to make clearer rules for exemptions, TDS, TCS, and not-for-profit organisations. All this, the government hopes, will cut down on confusion and save everyone time and trouble."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karnataka-vegetable-vendor-hit-with-rs-29-lakh-gst-notice-here-is-why-2758841-2025-07-21",
      "headline": "Karnataka vegetable vendor hit with Rs 29 lakh GST notice. Here's whySelling veggies for four years and accepting UPI has landed Shankargouda with a Rs 29 lakh GST notice on Rs 1.63 crore turnover."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/anthem-biosciences-share-price-nse-bse-27-percent-premium-market-debut-review-2758793-2025-07-21",
      "headline": "Anthem Biosciences share price: Stock lists at 27% premium on market debutAnthem Biosciences stock price: The company's shares opened at Rs 723.05 on the NSE and Rs 723.10 on the BSE. This was about 27% higher than its issue price of Rs 570."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/burger-singh-hilariously-debunks-rs-47-crore-funding-report-clatification-goes-viral-2758780-2025-07-21",
      "headline": "Burger Singh debunks Rs 47 crore funding claim with viral statementIn a statement that's equal parts denial and stand-up comedy set, the homegrown burger chain responded to reports that it had secured a Rs 47.15 crore investment round, calling the claims premature, misleading, and just plain wrong—at least for now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-below-25000-ril-reliance-shares-falls-2-percent-2758766-2025-07-21",
      "headline": "Sensex opens flat, Nifty below 25,000; RIL falls 2%The S&P BSE Sensex was down by 130.29 points to 81,627.44, while the NSE Nifty50 lost 48.95 points to 24,919.45 as of 9:22 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coindcx-hacked-usd-44-million-lost-cyberattack-what-crypto-platform-said-user-money-wallet-2758748-2025-07-21",
      "headline": "CoinDCX loses $44 million in cyberattack: Here's what the crypto platform saidThis is the second large-scale hack involving an Indian crypto exchange in the past year. In July 2024, WazirX lost $234 million when one of its wallets hosted on Liminal was compromised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/anthem-biosciences-ipo-listing-share-price-strong-market-debut-nse-bse-check-gmp-2758737-2025-07-21",
      "headline": "Anthem Biosciences IPO listing: Shares to make strong market debut? Check GMPAnthem Biosciences share price: The IPO opened for subscription between July 14 and July 16, and was subscribed 67.42 times in total. Highest demand came from qualified institutional buyers (QIBs), who bid 192.80 times the reserved portion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/standard-not-met-what-astronomer-said-on-ceo-andy-byron-kristine-cabot-coldplay-kiss-cam-scandal-2758498-2025-07-20",
      "headline": "Standard not met: What Astronomer said on CEO Andy Byron's Coldplay kiss cam rowAstronomer responded to the viral video by placing CEO Andy Byron on leave, later confirming his resignation after stating that leadership standards had not been met. The company emphasised its commitment to accountability and the core values it was founded on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-rich-are-swapping-gold-for-bitcoin-here-is-why-gold-vs-bitcoin-2758472-2025-07-20",
      "headline": "India's rich are swapping gold for bitcoin. Here's WhyNow-a-days more of India's rich are putting a slice of their gold-backed wealth into shiny new digital coins like Bitcoin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/astronomer-ceo-andy-byron-quits-after-coldplay-kiss-cam-scandal-2758451-2025-07-20",
      "headline": "Astronomer CEO Andy Byron quits after Coldplay kiss cam scandalDataOps firm Astronomer's CEO, Andy Byron, has resigned following a scandal at a Coldplay concert which also involved the firm's HR head, Kristen Cabot. In a statement, the company announced the board of directors had accepted the resignation, stating that \"the company's standard wasn't met.\" The New York-based unicorn company, founded in 2018, confirmed that a search for a new CEO is underway. The resignation followed a board-initiated investigation after an incident at a Coldplay event involving the CEO went viral. The board said that leaders are expected to set the standard in conduct and accountability. There has been no official update regarding any action taken against the HR head, Kristen Cabot, who is the Chief People's Officer at the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/andy-byron-astronomer-ceo-caught-in-coldplay-kiss-cam-scandal-resigns-glbs-2758389-2025-07-20",
      "headline": "Andy Byron, Astronomer CEO caught in Coldplay kiss cam scandal, resignsAndy Byron resigns as CEO of AI firm Astronomer after a viral 'kiss cam' video with HR chief Kristin Cabot sparked online speculation and prompted an internal review by the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shloka-ambani-interview-she-shares-what-keeps-her-going-career-kids-and-cause-2758378-2025-07-19",
      "headline": "Career, kids and a cause: Shloka Ambani shares what keeps her goingIn a heart-to-heart on Masoom Minawala's podcast, Shloka opened up about her journey—balancing kids, career, and a cause she truly believes in."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/astronomer-ceo-andy-byron-cpo-kristin-cabot-leave-coldplay-concert-video-investigation-statement-2758075-2025-07-19",
      "headline": "Astronomer CEO, HR head sent on leave after Coldplay kiss cam outs 'affair'The company issued an official statement two days after the incident, announcing that its board had initiated an internal investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-sons-forms-ai-171-memorial-trust-ex-gratia-ahmedabad-plane-crash-victims-families-2757926-2025-07-18",
      "headline": "Tata Sons forms AI 171 memorial trust, pledges Rs 1 crore to victims' familiesTata Sons has set up the AI 171 Memorial and Welfare Trust, pledging Rs 1 crore ex gratia per victim and Rs 500 crore in total, to support crash victims, families, and responders. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sold-property-and-want-to-save-tax-this-tax-expert-suggests-a-smarter-way-2757911-2025-07-18",
      "headline": "Sold property and want to save tax? This tax expert suggests a smarter waySelling a property can bring in a tidy profit, but it also comes with a hefty tax bill. Many turn to 54EC bonds to save tax — but tax expert Sujit Bangar says there's a smarter way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-500-points-lower-nifty-below-25000-axis-bank-falls-5-2757793-2025-07-18",
      "headline": "Sensex ends over 500 points lower, Nifty below 25,000; Axis Bank falls 5%The S&P BSE Sensex was down 501.51 points to 81,757.73 at the closing bell, while the NSE Nifty50 settled 143.05 points lower at 24,968.40. Most of the broader market indices also reflected the weak sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/2025-tech-layoffs-amazon-microsoft-google-fuel-job-fears-amid-ai-push-2757700-2025-07-18",
      "headline": "2025 tech layoffs: Amazon, Microsoft, Google fuel job fears amid AI pushThe year 2025 was supposed to be a new chapter. A time when artificial intelligence promised smarter work, faster growth, and a better future. But for tens of thousands of workers across the world, it has meant sleepless nights, and uncertain futures. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/axis-bank-share-price-down-7-percent-why-sell-hold-stock-q1-results-banking-2757697-2025-07-18",
      "headline": "Axis Bank shares tank 7% today. Should you sell or hold the stock?Axis Bank shares: The stock has been on a downward trend in recent times. It has fallen 5.77% in the last five days, 9.14% in the past one month, and 15.27% over the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-retail-acquires-kelvinator-to-expand-appliance-business-2757690-2025-07-18",
      "headline": "Reliance Retail acquires Kelvinator to expand appliance businessReliance believes this move will help it grow faster in the consumer durables sector, connect more closely with customers, and open up bigger long-term opportunities in India's changing market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/wipro-share-price-4-percent-rise-q1-results-revenue-guideline-2757688-2025-07-18",
      "headline": "Explained: Why Wipro shares gained as much as 4% todayThe fourth-largest IT services company in India posted an 11% jump in net profit and a 0.8% rise in revenue—both slightly ahead of market expectations, according to estimates compiled by LSEG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-fd-or-mf-edelweiss-radhika-gupta-shares-3-golden-rules-before-you-invest-2757663-2025-07-18",
      "headline": "Stocks, FD or MF? Edelweiss' Radhika Gupta shares 3 golden rules before you investBefore you begin investing, know how saving and investing are different. Saving keeps your money handy for emergencies or short-term plans, while investing helps it grow for bigger future goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-nifty-axis-bank-results-weak-banking-shares-falls-2757662-2025-07-18",
      "headline": "Sensex tumbles over 600 points: Why is stock market falling today?The 30-share BSE Sensex tumbled 644.99 points to 81,614.25 around 12:19 pm, while the NSE Nifty 50 fell 191.30 points to 24,920.15. Losses were broad-based, with most of the major sectoral indices in the red. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-2-online-filing-live-are-you-eligible-and-what-has-changed-income-tax-2757598-2025-07-18",
      "headline": "ITR-2 online filing live: Know who can file, new changes and other detailsThis year, the ITR-2 form has a few important changes that every taxpayer should know. You now have to report your long-term capital gains separately for periods before and after July 23, 2024, as new indexation and tax rules apply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-ulips-financial-product-mis-sold-banks-insurance-companies-part-1-2757581-2025-07-18",
      "headline": "The ULIP trap: Inside India's most mis-sold financial productPart one of our story explores why ULIPs remain among the most mis-sold financial products in India. Sold as all-in-one solutions, they often fail to deliver on either insurance or investment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/who-is-andy-byron-astronomer-ceo-cheating-wife-megan-kerrigan-hr-kristin-cabot-2757559-2025-07-18",
      "headline": "Who is Astronomer CEO Andy Byron, caught on Coldplay's kiss camAndy Byron, the CEO of data-driven startup Astronomer was caught on the Coldplay concert's kiss cam with a colleague, and the clip has went viral online."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/travel-insurance-scam-entrepreneur-startup-founder-experience-flight-delay-linkedin-post-2757539-2025-07-18",
      "headline": "Startup founder calls flight travel insurance a scam, shares experienceWhat should have been a straightforward process turned into a weeks-long battle across multiple platforms and customer service calls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-100-points-lower-nifty-below-25100-wipro-jumps-3-2757536-2025-07-18",
      "headline": "Sensex opens 100 points lower, Nifty below 25,100; Wipro jumps 3%The S&P BSE Sensex lost 199 points to 82,060.24, while the NSE Nifty50 was down by 40.50 points to 25,070.95, as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-july-18-opening-sensex-nifty-today-wall-street-record-high-us-stock-market-bse-nse-trading-setup-2757520-2025-07-18",
      "headline": "Will Sensex, Nifty rally today after Wall Street closed at a record high?The US market closed at a record high as fresh data from the United States eased concerns about an economic slowdown in the world's largest economy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/starbucks-ceo-brian-niccol-new-home-seattle-fly-1600-km-no-more-return-to-office-policy-2757513-2025-07-18",
      "headline": "Starbucks CEO ditches 1,600 km commute, buys house near workWhen Niccol was appointed as Starbucks CEO in August last year, the company agreed to a special travel plan. He was allowed to commute between California and Seattle using a corporate jet, as long as he worked from the Seattle office at least three days a week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/walmart-layoffs-hundreds-of-roles-to-streamline-operations-report-2757225-2025-07-17",
      "headline": "Walmart cuts hundreds of roles to streamline operations: ReportEarlier this year, Walmart announced about 1,500 job cuts, which hit teams in its global tech division, online order fulfilment in US stores and its advertising arm, Walmart Connect. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-375-points-lower-nifty-below-25200-infosys-tech-mahindra-down-2-percent-2757205-2025-07-17",
      "headline": "Sensex ends 375 points lower, Nifty below 25,200; Infosys down 2%The S&P BSE Sensex was down by 375.24 points to close at 82,259.24, while the NSE Nifty50 lost 100.60 points to end at 25,111.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-stock-market-rank-number-4-asia-pacific-region-bofa-survey-dalal-street-insights-2757200-2025-07-17",
      "headline": "Dalal Street not Asia's darling anymore, says BofA surveyThe latest survey by Bank of America (BofA), shows that investor interest in Indian stock market has dropped in recent months."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sushmita-sen-ex-rohman-shawl-gift-22-carat-diamond-meri-aukaat-nahi-bollywood-2759178-2025-07-21",
      "headline": "Sushmita Sen's ex Rohman on gifting her the diamond she wants: Meri aukaat nahiActor Rohman Shawl recently opened up about ex-Sushmita Sen's love for diamonds. He also spoke about the possibility of gifting expensive diamonds to Sushmita. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-bts-video-ahaan-panday-aneet-share-warm-moments-mohit-suri-emotional-2759143-2025-07-21",
      "headline": "Ahaan Panday-Aneet share warm moments as Mohit Suri tears up in Saiyaara BTS videoA viral video from the last day shoot of 'Saiyaara' captures director Mohit Suri getting emotional. The BTS clip also shows actors Ahaan Panday and Aneet Padda in a warm hug. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-sponsors-her-cook-dilips-childrens-english-medium-education-2759182-2025-07-21",
      "headline": "Farah Khan sponsors her cook Dilip's children's English-medium educationFarah Khan shared in her vlog that she is supporting her cook Dilip's children by enrolling them in an English-medium school and getting one of them a culinary diploma. She said that her aim is to help them build a better future and work in good places instead of doing domestic work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-jisoo-wins-outstanding-asian-star-newtopia-seoul-drama-awards-2759180-2025-07-21",
      "headline": "BLACKPINK's Jisoo wins outstanding Asian star at Seoul Drama AwardsJisoo has bagged her first major acting award for 'Newtopia', earning the title of Outstanding Asian Star. Her win has sent BLACKPINK fans into a celebratory frenzy online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kalki-koechlin-recalls-casting-couch-experiences-2759139-2025-07-21",
      "headline": "Kalki Koechlin recalls casting couch experiences, says producer wanted to know meKalki Koechlin opened up about her personal experiences with casting couch incidents, both before and after joining the film industry. She highlighted how such encounters have a lasting impact and emphasised the need to acknowledge and address them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prithviraj-sukumaran-patriotism-pride-indian-sarzameen-jiocinema-premiere-2759133-2025-07-21",
      "headline": "Prithviraj Sukumaran on patriotism: I am proud of the fact that I am IndianPrithviraj Sukumaran expresses his strong pride in being Indian and redefines patriotism. His upcoming film 'Sarzameen' explores themes of national duty and personal sacrifice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tara-sutaria-veer-pahariyas-my-and-mine-game-on-instagram-sparks-dating-rumours-2759066-2025-07-21",
      "headline": "Tara Sutaria-Veer Pahariya's my and mine game on Instagram sparks dating rumoursActor Tara Sutaria's reply to Veer Pahariya's comment has sparked dating rumours. Fans speculate that it is more than friendship."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/television/story/mannara-chopra-returns-to-work-after-father-death-shares-emotional-note-2759003-2025-07-21",
      "headline": "Mannara Chopra returns to work after father's death, shares emotional noteMannara Chopra returned to work and social media after the recent death of her father, sharing an emotional note about grief and strength. Despite the pain, she expressed gratitude for the support and said she's posting again as part of her professional journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-dreamy-cruise-holiday-with-rumoured-boyfriend-kabir-bahia-2758893-2025-07-21",
      "headline": "Kriti Sanon enjoys dreamy cruise vacation - with Kabir Bahia?Kriti Sanon shared stunning photos from her French cruise holiday, and the internet took notice after entrepreneur Kabir Bahia posted similar pictures from the same location. Though they didn't appear together, fans quickly connected the dots, sparking fresh buzz online."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-silambarasan-offers-financial-aid-to-late-stuntman-mohan-rajs-family-2759128-2025-07-21",
      "headline": "Actor Silambarasan offers financial aid to late stuntman Mohan Raj's familyAfter veteran stuntman Mohan Raj tragically lost his life while performing a dangerous car stunt for Pa. Ranjith's 'Vettuvam', actor Silambarasan TR stepped in with a heartfelt gesture. Even though he wasn't associated with the film, Silambarasan quietly extended financial help to the late stuntman's family. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-v-and-jungkook-sojang-defamation-case-trial-2759037-2025-07-21",
      "headline": "BTS' V and Jungkook's Sojang defamation case moves to trialThe defamation suit filed by BTS members V and Jungkook against YouTuber Sojang is now set to undergo court-led mediation. However, chances of arriving at a mutually agreeable resolution appear slim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/5-most-popular-anime-villains-with-tragic-backstories-naruto-attack-on-titan-2758974-2025-07-21",
      "headline": "5 most popular anime villains with tragic backstories that deserve tears, not hateFrom Naruto to Attack on Titan, these anime villains prove that evil isn't always black and white; sometimes, it's heartbreak in disguise. See which anime villain's backstory is your favourite.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-return-telugu-cinema-nandini-reddy-social-drama-2759085-2025-07-21",
      "headline": "Samantha to return to Telugu cinema with Nandini Reddy's film: ReportSamantha Ruth Prabhu, who was last seen in a full-fledged role in Telugu cinema in 2023's 'Khushi' starring Vijay Deverakonda, will be making a comeback with a project backed by her production company, Tralala Moving Pictures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javed-gets-lip-fillers-dissolved-after-9-years-shares-video-of-swollen-face-2759104-2025-07-21",
      "headline": "Uorfi Javed gets lip fillers dissolved after 9 years, shares video of swollen faceUorfi Javed shared a video of her swollen face after getting her lip fillers removed, sharing the pain and challenges of the procedure. Fans praised her honesty, while others expressed concern and urged empathy for her choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/txt-drop-the-name-chapter-together-promise-fans-well-never-disappoint-2759084-2025-07-21",
      "headline": "TXT drops The Name Chapter: TOGETHER; promise fans 'we'll never disappoint'TXT's latest album, The Name Chapter: TOGETHER, showcases their musical evolution and storytelling prowess. The group shared their ambitions and commitment to fans during a vibrant comeback showcase in Seoul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-dating-shruti-chauhan-saiyaara-review-fuels-rumours-2759061-2025-07-21",
      "headline": "Is Ahaan Panday dating Shruti Chauhan? Her Saiyaara review fuels rumours'Saiyaara' actor Ahaan Panday is reportedly dating actor-model Shruti Chauhan. Their relationship came under scrutiny after Chauhan shared an emotional message for Panday. The couple is yet to confirm their relationship. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-gunn-explains-confusion-around-henry-cavill-superman-exit-return-calls-it-unfair-2758878-2025-07-21",
      "headline": "James Gunn regrets confusion around Henry Cavill's Superman return, calls it unfairDirector James Gunn recently revealed the confusion around actor Henry Cavill's Superman return was unfair. He praised Cavill's professionalism and hinted at future collaborations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mcu-reset-iron-man-captain-america-recast-robert-downey-jr-dr-doom-2758934-2025-07-21",
      "headline": "Captain America, Iron Man to be recast as Kevin Feige confirms MCU resetAs actor Robert Downey Jr transcends from playing Iron Man to portraying Dr Doom in the upcoming 'Avengers' film, Marvel plans to reset the Marvel Cinematic Universe with the recasting of Tony Stark and Captain Steve Rogers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-is-making-film-on-meghalaya-murder-case-report-2759063-2025-07-21",
      "headline": "Aamir Khan is making film on Meghalaya murder case: ReportAamir Khan is reportedly working on a crime-thriller as his next project and the same seems to be based on the Meghalaya murder case. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-president-jagdeep-dhankhar-resigns-citing-health-reasons-2759221-2025-07-21",
      "headline": "Vice President Jagdeep Dhankhar resigns on Day 1 of Monsoon Session, cites healthServing as Vice President since 2022, the 74-year-old made the surprise announcement after chairing the first day of the Monsoon Session in Rajya Sabha. Under Article 67 of the Constitution, the Deputy Chairman will manage the day-to-day affairs until a new Vice-President is elected."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-air-force-aircraft-crashes-on-school-building-in-dhaka-during-training-sortie-many-feared-dead-2758970-2025-07-21",
      "headline": "20 dead as Bangladesh Air Force jet crashes into Dhaka schoolA China-made F-7 training jet of the Bangladesh Air Force crashed into a school in Dhaka, killing 20 people and injuring 171 others. A one-day state mourning was declared on Tuesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-hit-pakistan-nuclear-warheads-depot-kirana-hills-operation-sindoor-claims-osint-expert-heres-how-2759067-2025-07-21",
      "headline": "India hit Pak N-warheads depot Kirana Hills during Op Sindoor, claims OSINT expertIndia hit Pakistan's Kirana Hills, which is believed to be one of the storage sites for its nuclear warheads, in a \"warning strike\" during Operation Sindoor, renowned OSINT expert Damien Symon has claimed. He cited updated Google Earth data to back his claim. The Indian military has denied striking Kirana Hills."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-deal-stalemate-continues-talks-to-resume-in-august-sources-2759204-2025-07-21",
      "headline": "India-US trade deal stalemate continues, talks to resume in August: SourcesIndian negotiators recently returned from Washington after the fifth round of trade talks. Despite extensive dialogue, no formal announcement has been made as the August 1 tariff pause deadline approaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/comrade-vs-achuthanandan-working-class-heartthrob-hero-cm-82-cpim-people-champion-communist-party-kerala-2759125-2025-07-21",
      "headline": "How Comrade VS, working-class heartthrob, became a CM at 83Former Kerala Chief Minister and veteran Communist leader VS Achuthanandan passed away at 101, marking the end of an era. A lifelong crusader for workers' rights and social justice, he rose from a tailor's shop to lead the state at 83. Revered as the \"people's champion\", VS was the last surviving founding member of CPI(M)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-government-to-challenge-2006-mumbai-train-blasts-verdict-high-court-2759215-2025-07-21",
      "headline": "Shocking: Maharashtra government to challenge 2006 Mumbai train blasts verdictMaharashtra will challenge the Bombay High Court's acquittal of 12 accused in the 2006 Mumbai train blasts case, which it termed \"shocking.\" The court cited lack of credible evidence, unreliable witnesses, and flawed investigation as reasons for the acquittal.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kerala-muslim-majority-2040-claim-sndp-natesan-sparks-political-row-cpim-congress-iulm-bjp-2759035-2025-07-21",
      "headline": "Kerala will be Muslim majority by 2040: How a claim got non-BJP parties sparringA claim by Vellappally Natesan, leader of the social service body SNDP representing the Ezhava community, that Muslims would form a majority in Kerala by 2040, has triggered a political row in the state. With the BJP watching from the sidelines, rivals CPI(M), which traditionally draws support from the Ezhava community, and the Congress and the Muslim League, are locked in a battle just ahead of the Assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-digitisation-can-bridge-indias-rs-20-lakh-cr-kirana-credit-gap-2759022-2025-07-21",
      "headline": "How digitisation can bridge India's Rs 20 lakh cr kirana credit gapFormal credit remains dry for the 13 million-strong kirana network, with shopkeepers largely reliant on costly loans from local moneylenders or distributors"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/dog-lovers-vs-the-rest-supreme-court-remark-on-dogs-stray-dog-divide-now-harder-to-bridge-2759106-2025-07-21",
      "headline": "'Feed them at home?' That one line has dog lovers fuming and whyThe Supreme Court on Tuesday, while hearing a plea alleging harassment over the feeding of community dogs in Noida, asked the petitioner, \"Why don't you feed them in your own house?\" Can the remark widen the divide between dog lovers and 'the rest'?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/agra-conversion-racket-up-police-hindu-girls-radicalised-kashmir-islam-arrested-2758745-2025-07-21",
      "headline": "'ISIS-style' conversion gang busted in Agra: Girls forced into Islam, radicalisedA suspected ISIS-inspired syndicate in Uttar Pradesh's Agra allegedly targeted Hindu girls for religious conversion using brainwashing, suspected Lashkar-e-Taiba (LeT) funding and fake identities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-opposition-alleges-honey-trap-conspiracy-involving-bjp-minister-girish-mahajan-and-cmo-official-2759209-2025-07-21",
      "headline": "BJP worker plotted honeytrap targeting Maharashtra minister, claims OppositionAdding fuel to the controversy, Uddhav Sena MP Sanjay Raut intensified the claims by sharing a photo of Lodha with Mahajan. Raut alleged that four ministers and several officials were implicated in honeytrap cases, including four young MPs who reportedly parted ways when the Shiv Sena split out of fear of exposure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javed-gets-lip-fillers-dissolved-after-9-years-shares-video-of-swollen-face-2759104-2025-07-21",
      "headline": "Uorfi Javed gets lip fillers dissolved after 9 years, shares video of swollen faceUorfi Javed shared a video of her swollen face after getting her lip fillers removed, sharing the pain and challenges of the procedure. Fans praised her honesty, while others expressed concern and urged empathy for her choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-delhi-kolkata-flight-with-160-onboard-aborts-take-off-due-to-technical-snag-checks-underway-2759189-2025-07-21",
      "headline": "Air India Delhi-Kolkata flight aborts take-off due to technical snagAir India flight AI 2403 from Delhi to Kolkata aborted take-off due to a technical snag. All 160 passengers were safely disembarked, and the flight is rescheduled for later today.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amritsar-airport-receives-bomb-threat-golden-temple-threat-2759268-2025-07-21",
      "headline": "Amritsar airport receives bomb threat, days after Golden Temple scareAmritsar Airport received a bomb threat from unknown callers, triggering heightened security and a police investigation. Authorities are tracking the caller while ensuring strict vigilance at the airport.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-playing-xi-liam-dawson-return-manchester-test-2759208-2025-07-21",
      "headline": "Liam Dawson returns after 8 years as England announce Manchester Test lineupLiam Dawson has made a return to the England Test team lineup after a gap of eight years as the hosts revealed their playing XI for the match against India in Manchester on Monday, July 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/mango-millionaire-makes-money-feel-relatable-radhika-gupta-niranjan-awasthi-2758912-2025-07-21",
      "headline": "From Bollywood to dal-chawal, Mango Millionaire makes money feel relatable'Mango Millionaire' turns personal finance into a relatable conversation, using Bollywood, family meals, and everyday metaphors to explain money matters. It's simple, practical, and feels more like advice from a friend than a finance manual."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/andhra-pradesh-it-minister-nara-lokesh-amid-language-row-telugu-people-coolest-speak-only-development-2759174-2025-07-21",
      "headline": "Nara Lokesh amid language row: Telugu people coolest, speak only developmentIn response to being called the \"coolest politician in India right now,\" Andhra Pradesh's IT Minister Nara Lokesh said it is not him, but the Telugu people who are the coolest. He added that everyone who speaks the language of development is welcome in the state, winning a lot of hearts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-to-play-manchester-test-mohammed-siraj-2759112-2025-07-21",
      "headline": "ENG vs IND: Jasprit Bumrah will play Manchester Test, says Mohammed SirajMohammed Siraj has confirmed that Jasprit Bumrah will play the upcoming Manchester Test against England, which will begin on July 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/when-shinde-sena-mla-sanjay-gaikwad-spewed-a-south-slur-2759004-2025-07-21",
      "headline": "When Shinde Sena MLA spewed a 'South' slurThe protagonist, Sanjay Gaikwad, it appears was harking back to the old nativist credo as a cover for a mess of his own making"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/in-gond-art-nature-is-left-right-and-centre-tribal-youth-are-taking-it-global-2756808-2025-07-21",
      "headline": "In Gond art, nature is left, right and centre. Tribal youth are taking it globalA recent walk through the Jangarh Kalam exhibition at Triveni kala Sangam, New Delhi, revealed how quietly powerful these paintings are, speaking of memory, place, and belonging without a single word. Years after Jangarh Singh Shyam first painted what he saw in the forest, young tribal artists are picking up the brush to tell their own stories. Their work now travels beyond the village, carrying scenes of trees, animals, and everyday life, not just as art, but as reminders of how closely nature shapes who they are."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-stands-in-solidarity-with-bangladesh-ready-to-extend-all-possible-support-pm-modi-on-dhaka-air-crash-2759160-2025-07-21",
      "headline": "India stands in solidarity with Bangladesh, ready to help: PM Modi on Dhaka air crashA Bangladesh Air Force F-7 training jet crashed into a school in Dhaka, killing one and injuring over 100. PM Modi expressed grief and offered India's full support to Bangladesh.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/watch-astronaut-films-lightning-storm-over-milan-from-space-its-breathtaking-2759163-2025-07-21",
      "headline": "Astronaut's jaw-dropping video shows Milan lit up by lightningThe video, originally spotlighted by fellow astronaut Col Anne McClain is a montage of still images taken at 120 frames per second, showing a storm in action high above Earth's atmosphere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karnataka-vegetable-vendor-hit-with-rs-29-lakh-gst-notice-here-is-why-2758841-2025-07-21",
      "headline": "Karnataka vegetable vendor hit with Rs 29 lakh GST notice. Here's whySelling veggies for four years and accepting UPI has landed Shankargouda with a Rs 29 lakh GST notice on Rs 1.63 crore turnover."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sushmita-sen-ex-rohman-shawl-gift-22-carat-diamond-meri-aukaat-nahi-bollywood-2759178-2025-07-21",
      "headline": "Sushmita Sen's ex Rohman on gifting her the diamond she wants: Meri aukaat nahiActor Rohman Shawl recently opened up about ex-Sushmita Sen's love for diamonds. He also spoke about the possibility of gifting expensive diamonds to Sushmita. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-bts-video-ahaan-panday-aneet-share-warm-moments-mohit-suri-emotional-2759143-2025-07-21",
      "headline": "Ahaan Panday-Aneet share warm moments as Mohit Suri tears up in Saiyaara BTS videoA viral video from the last day shoot of 'Saiyaara' captures director Mohit Suri getting emotional. The BTS clip also shows actors Ahaan Panday and Aneet Padda in a warm hug. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-sponsors-her-cook-dilips-childrens-english-medium-education-2759182-2025-07-21",
      "headline": "Farah Khan sponsors her cook Dilip's children's English-medium educationFarah Khan shared in her vlog that she is supporting her cook Dilip's children by enrolling them in an English-medium school and getting one of them a culinary diploma. She said that her aim is to help them build a better future and work in good places instead of doing domestic work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kalki-koechlin-recalls-casting-couch-experiences-2759139-2025-07-21",
      "headline": "Kalki Koechlin recalls casting couch experiences, says producer wanted to know meKalki Koechlin opened up about her personal experiences with casting couch incidents, both before and after joining the film industry. She highlighted how such encounters have a lasting impact and emphasised the need to acknowledge and address them."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/6-indian-badminton-players-out-of-world-university-games-over-administrative-lapse-2759279-2025-07-21",
      "headline": "6 Indian badminton players out of World University Games over admin lapseThe Indian badminton team that won mixed team bronze at the World University Games is facing controversy over player selection. Administrative errors barred six players from competing, prompting demands for accountability and justice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-rishabh-pant-fitness-akash-deep-injury-2759255-2025-07-21",
      "headline": "Pant shakes off injury concerns, Akash Deep all but out of Manchester TestRishabh Pant has shaken off injury concerns and took part in batting and wicketkeeping sessions as the Indian team's preparations for the Manchester Test was in full flow on Monday, July 21. However, Akash Deep seems to be all but ruled out of the match as the pacer continues to struggle with a groin issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-mohammed-siraj-workload-management-manchester-test-2759231-2025-07-21",
      "headline": "Mohammed Siraj on workload management chatter: Almighty has kept me healthyMohammed Siraj has brushed aside talk about workload management, saying that he is focused on making most of the opportunity presented to him. Siraj has played all the matches so far in the series and has bowled a total of 109 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-playing-xi-liam-dawson-return-manchester-test-2759208-2025-07-21",
      "headline": "Liam Dawson returns after 8 years as England announce Manchester Test lineupLiam Dawson has made a return to the England Test team lineup after a gap of eight years as the hosts revealed their playing XI for the match against India in Manchester on Monday, July 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-harry-brook-joe-root-best-test-batter-all-time-2759201-2025-07-21",
      "headline": "Not in the same league: Brook hails Root as best Test batter of all-timeHarry Brook opened up on the ongoing tussle in the ICC rankings between himself and Joe Root. Whilst he may be close to taking the number one spot, he acknowledged Joe Root as the best Test batter of all-time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-harry-brook-england-lords-test-payback-2759196-2025-07-21",
      "headline": "Bumrah bowled one over: Brook on England's moment of payback at Lord'sHarry Brook reveaed that it was that one over by Jasprit Bumrah on Day 3 that lit a fire in England's belly as they went on to give it back to India to take the win at Lord's. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-mohammed-siraj-lords-heartbreak-2759166-2025-07-21",
      "headline": "Felt like I won't get out, took time to recover: Mohammed Siraj on Lord's heartbreakMohammed Siraj recalled the Lord's Test heartbreak and said that he felt he wouldn't get out during the final day of the match. Siraj was the final man to be dismissed in dramatic fashion in the Lord's Test as England took the lead in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-harry-brook-india-were-scared-manchester-test-2759138-2025-07-21",
      "headline": "India were scared: Brook reveals why England hold advantage in 4th TestHarry Brook believes India's fearful tactics have only boosted England's confidence ahead of the crucial fourth Test in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-to-play-manchester-test-mohammed-siraj-2759112-2025-07-21",
      "headline": "ENG vs IND: Jasprit Bumrah will play Manchester Test, says Mohammed SirajMohammed Siraj has confirmed that Jasprit Bumrah will play the upcoming Manchester Test against England, which will begin on July 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/shubman-gill-rishabh-pant-lead-indias-practice-session-ahead-of-manchester-test-2759107-2025-07-21",
      "headline": "Shubman Gill, Rishabh Pant lead India's practice session ahead of 4th TestShubman Gill and Rishabh Pant lead the way in India's practice session ahead of the fourth Test in Old Trafford, Manchester. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-kevin-pietersen-sarfaraz-khan-weightloss-transformation-2759083-2025-07-21",
      "headline": "Shaw should see this: Pietersen praises Sarfaraz's stunning transformationKevin Pietersen shared a cheeky dig at Prithvi Shaw as he reacted to Sarfaraz Khan's insane weightloss transformation"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-mohammed-siraj-lords-heartbreak-2759166-2025-07-21",
      "headline": "Felt like I won't get out, took time to recover: Mohammed Siraj on Lord's heartbreakMohammed Siraj recalled the Lord's Test heartbreak and said that he felt he wouldn't get out during the final day of the match. Siraj was the final man to be dismissed in dramatic fashion in the Lord's Test as England took the lead in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-harry-brook-india-were-scared-manchester-test-2759138-2025-07-21",
      "headline": "India were scared: Brook reveals why England hold advantage in 4th TestHarry Brook believes India's fearful tactics have only boosted England's confidence ahead of the crucial fourth Test in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-to-play-manchester-test-mohammed-siraj-2759112-2025-07-21",
      "headline": "ENG vs IND: Jasprit Bumrah will play Manchester Test, says Mohammed SirajMohammed Siraj has confirmed that Jasprit Bumrah will play the upcoming Manchester Test against England, which will begin on July 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/shubman-gill-rishabh-pant-lead-indias-practice-session-ahead-of-manchester-test-2759107-2025-07-21",
      "headline": "Shubman Gill, Rishabh Pant lead India's practice session ahead of 4th TestShubman Gill and Rishabh Pant lead the way in India's practice session ahead of the fourth Test in Old Trafford, Manchester. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-kevin-pietersen-sarfaraz-khan-weightloss-transformation-2759083-2025-07-21",
      "headline": "Shaw should see this: Pietersen praises Sarfaraz's stunning transformationKevin Pietersen shared a cheeky dig at Prithvi Shaw as he reacted to Sarfaraz Khan's insane weightloss transformation"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-ruben-amorim-manchester-united-india-test-team-old-trafford-2759051-2025-07-21",
      "headline": "Kuldeep on talking tactics with Amorim: Asked if he sticks with 3-4-3Kuldeep Yadav was more than excited as he had the chance to speak with Manchester United's manager, Ruben Amorim. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-steve-harmison-on-kuldeep-yadav-and-washington-sundar-2759026-2025-07-21",
      "headline": "Should India drop Sundar for Kuldeep in Manchester? Steve Harmison answersFormer England fast bowler Steve Harmison has shared his thoughts on Kuldeep Yadav's inclusion in the Indian playing XI for the fourth Test against England at Old Trafford, Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/nepal-cricket-team-bcci-centre-of-excellence-bengaluru-t20-world-cup-qualifiers-2758998-2025-07-21",
      "headline": "Nepal to train at BCCI's Centre of Excellence for T20 World Cup qualifiersThe Nepal men's cricket team will take part in a 15-day camp at the BCCI's Centre of Excellence (COE) as part of their preparations for the T20 World Cup qualifiers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lancashire-to-honour-farokh-engineer-and-clive-lloyd-with-stands-at-old-trafford-2758967-2025-07-21",
      "headline": "Lancashire to honour Farokh Engineer and Clive Lloyd with stands at Old TraffordLegendary West Indies captain Clive Lloyd and former India wicketkeeper batter Farokh Engineer are set to be honoured by Lancashire cricket club with stands named after them at Old Trafford in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/freestyle-chess-grand-slam-levon-arnonian-arjun-erigaisi-r-praggnanddhaa-2758951-2025-07-21",
      "headline": "Freestyle Chess Grand Slam: Aronian wins, Erigasi, Praggnanandhaa finish 6th and 7thIn the Freestyle Chess Grand Slam in Las Vegas, Levon Aronian went on to win the entire tournament and take a cash prize of 200,000 USD."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-wasim-akram-asian-wickets-record-india-vs-england-manchester-test-2758943-2025-07-21",
      "headline": "Jasprit Bumrah targets Wasim Akram's twin Test records in EnglandJasprit Bumrah is on the verge of surpassing Wasim Akram's long-held record of 53 Test wickets in England, adding even more significance to his role in the high-stakes fourth Test starting 23 July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-mitchell-owen-emulates-ricky-ponting-and-david-warner-2758950-2025-07-21",
      "headline": "Mitchell Owen emulates Ponting and Warner's feat after remarkable debut vs WIAustralia batter Mitchell Owen emulated Ricky Ponting and David Warner's feat after his remarkable debut in the first T20I against West Indies in Jamaica."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-owen-t20i-debut-reaction-fifty-wicket-australia-win-west-indies-2758920-2025-07-21",
      "headline": "Mitchell Owen calls dream Australia debut against West Indies really specialMitchell Owen described his dream T20I debut for Australia against the West Indies as \"really special\" after delivering a match-winning all-round performance in Jamaica."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/freestyle-chess-grand-slam-levon-arnonian-arjun-erigaisi-r-praggnanddhaa-2758951-2025-07-21",
      "headline": "Freestyle Chess Grand Slam: Aronian wins, Erigasi, Praggnanandhaa finish 6th and 7thIn the Freestyle Chess Grand Slam in Las Vegas, Levon Aronian went on to win the entire tournament and take a cash prize of 200,000 USD."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-wasim-akram-asian-wickets-record-india-vs-england-manchester-test-2758943-2025-07-21",
      "headline": "Jasprit Bumrah targets Wasim Akram's twin Test records in EnglandJasprit Bumrah is on the verge of surpassing Wasim Akram's long-held record of 53 Test wickets in England, adding even more significance to his role in the high-stakes fourth Test starting 23 July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-mitchell-owen-emulates-ricky-ponting-and-david-warner-2758950-2025-07-21",
      "headline": "Mitchell Owen emulates Ponting and Warner's feat after remarkable debut vs WIAustralia batter Mitchell Owen emulated Ricky Ponting and David Warner's feat after his remarkable debut in the first T20I against West Indies in Jamaica."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-owen-t20i-debut-reaction-fifty-wicket-australia-win-west-indies-2758920-2025-07-21",
      "headline": "Mitchell Owen calls dream Australia debut against West Indies really specialMitchell Owen described his dream T20I debut for Australia against the West Indies as \"really special\" after delivering a match-winning all-round performance in Jamaica."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-2025-india-host-october-to-november-2758897-2025-07-21",
      "headline": "India to host Chess World Cup 2025 in October-NovemberIndia will host this year's chess World Cup from October 30 to November 27 with a host city for the event to be named in \"due course\", the sport's global governing body FIDE announced on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mikel-arteta-arsenal-thomas-partey-sexual-assault-charges-2758884-2025-07-21",
      "headline": "Arteta backs Arsenal's approach on Partey amid sexual assault chargesMikel Arteta highlighted how he backed Arsenal to have followed all the right processes regarding Thomas Partey, who was charged with multiple counts of rape and sexual assault. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hashim-amla-excludes-sachin-tendulkar-names-virat-de-villiers-richards-best-batters-2758872-2025-07-21",
      "headline": "Sachin Tendulkar missing from Hashim Amla's list of top 3 greatest battersFormer South Africa captain Hashim Amla surprised fans by leaving out Sachin Tendulkar while naming his three greatest batters of all time. Amla revealed his picks ahead of the India Champions' clash in the World Championship of Legends in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-uncertain-pakistan-cricket-board-revenue-could-take-massive-hit-2758831-2025-07-21",
      "headline": "With Asia Cup uncertain, Pakistan Cricket Board's revenue could take massive hitWith the future of this year's Asia Cup T20 tournament hanging in the balance, the Pakistan Cricket Board (PCB) is facing the prospect of a significant financial blow. The tournament, a key event on the regional cricketing calendar, is one of the PCB's major revenue streams, and any disruption could severely impact its bottom line."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-nitish-reddy-ruled-out-two-tests-knee-injury-2758839-2025-07-21",
      "headline": "Nitish Reddy out of remaining Tests, Anshul Kamboj added to India squadIndia all-rounder Nitish Kumar Reddy has been ruled out of the remainder of the Anderson-Tendulkar Trophy and will take no further part in the last two Tests against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-mens-team-top-contenders-head-coach-2758820-2025-07-21",
      "headline": "Who can rescue Indian football? Top contenders to take over as head coachA coach quits, rankings tumble, and club football's on pause—Indian football's in another freefall. The next head coach appointment won't just plug gaps; it could define whether Vision 2047 is dream fuel or dust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-compares-shubman-gill-with-previous-victorious-skippers-in-england-2758811-2025-07-21",
      "headline": "Not Rohit or Kohli, Gavaskar finds ideal comparison of Shubman Gill's captaincyFormer India cricketer turned commentator has compared Shubman Gill with India's previous victorious captains in England. Gill has had a tough beginning to his captaincy tenure as India are trailing by 1-2 in the ongoing five-match series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sanjay-manjrekar-on-sai-sudharsan-and-karun-nair-2758795-2025-07-21",
      "headline": "Sai Sudharsan was my no. 3, didn't agree with Karun's backing: Sanjay ManjrekarFormer India cricketer-turned commentator Sanjay Manjrekar has suggested bringing back Sai Sudharsan for the fourth Test against England in place of Karun Nair."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-wcl-match-cancellation-brett-lee-reaction-inclusivity-2758792-2025-07-21",
      "headline": "I love India: Brett Lee reacts to India-Pakistan champions clash cancellationFormer Australian pacer Brett Lee has broken his silence following the cancellation of the India vs Pakistan encounter in the World Championship of Legends tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-england-suresh-raina-exclusive-rishabh-pant-2758783-2025-07-21",
      "headline": "Rishabh Pant is the backbone of the Indian Test team: Suresh RainaFormer India batter Suresh Raina has described wicketkeeper-batter Rishabh Pant as the backbone of the Indian Test team. Pant has amassed 425 runs at an impressive average of 70.83 in the series so far, making him the second-highest run-scorer behind captain Shubman Gill. \"Rishabh Pant is the backbone of the Indian Test team. The way he bats, the way he keeps on chirping from behind the stumps to disturb the opposition batters,\" Raina told India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/venus-williams-tennis-comeback-2025-citi-dc-open-serena-return-rumours-2758776-2025-07-21",
      "headline": "Venus Williams returns to tennis, hopes sister Serena will also join the funVenus Williams is hoping her sister Serena will follow her back onto the court, as the 45-year-old prepares to make her return to professional tennis at the Washington Open as a wildcard entrant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-in-wcl-semi-final-pakistan-team-owner-kamil-khan-2758773-2025-07-21",
      "headline": "India vs Pakistan in WCL semi-final? Team owner lifts the lid on possible clashIndia and Pakistan will continue to avoid facing each other in the semi-final of the World Championship of Legends (WCL) 2025 after the league fixture between the two teams got cancelled."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}