{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-ai-manage-your-investment-portfolio-ai-based-portfolio-management-tools-2767113-2025-08-06",
      "headline": "Can AI manage your investment portfolio?AI is rapidly changing how we invest. From portfolio tracking to fund recommendations, it's already doing the heavy lifting. But can it take full charge of your investments, and, should it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-easier-claim-rules-to-jan-dhan-scheme-rbi-3-key-reforms-for-common-man-2767056-2025-08-06",
      "headline": "From easier claim rules to Jan-dhan scheme: RBI's 3 key reforms for common manOne of the major announcements is aimed at easing the process for families to claim money or valuables from bank accounts, lockers, or safe custody after the account holder passes away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-sanjay-malhotra-us-tariff-statement-india-economy-impact-lending-rate-unchanged-2767010-2025-08-06",
      "headline": "Will US tariffs hit India's economy? What RBI Governor saidThe three-day meeting concluded with Governor Sanjay Malhotra outlining the central bank's views on inflation, growth, and importantly, the growing global trade tensions triggered by tariff announcements, especially by the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/forgot-to-e-verify-your-itr-here-is-what-to-do-to-avoid-penalties-what-to-do-if-forgot-to-e-verify-itr-2767009-2025-08-06",
      "headline": "Forgot to e-verify your ITR? Here's what to do to avoid penaltiesEven though the new ITR deadline is now September 15, 2025 for several taxpayers, the 30-day e-verification window begins the moment you file your return and not from the due date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-share-price-stock-market-debut-hold-or-book-profit-2766980-2025-08-06",
      "headline": "Should you hold or sell NSDL shares after stock market listing? Details hereWhile NSDL may not offer sharp near-term upside post listing, many analysts see it as a core holding in India's market infrastructure play, particularly as digital finance expands and retail participation deepens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-shares-debut-with-10-percent-premium-over-ipo-issue-price-2766972-2025-08-06",
      "headline": "NSDL shares debut with 10% premium over IPO issue priceNSDL's Rs 4,012 crore initial public offering was entirely an offer for sale (OFS) involving 5.01 crore equity shares. The issue saw robust demand from all investor segments, with an overall subscription of 41.02 times. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-keeps-key-lending-rate-steady-at-55-amid-global-trade-uncertainty-2766969-2025-08-06",
      "headline": "RBI keeps key lending rate steady at 5.5% amid global trade uncertaintyThe RBI MPC sighted the global tensions and trade uncertainty in keeping key lending rates unchanged. The MPC also decided to continue with a neutral stance. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-off-to-shaky-start-amid-trump-tariff-threat-rbi-rate-decision-2766965-2025-08-06",
      "headline": "Sensex, Nifty off to shaky start amid Trump tariff threat, RBI rate decisionThe S&P BSE Sensex was down 65.70 points to 80.644.34 at 9:40 am, while the NSE Nifty50 fell 28.40 points to trade at 24,620."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-today-august-6-home-loan-emi-cheaper-rate-cut-us-tariff-affordable-housing-real-estate-2766959-2025-08-06",
      "headline": "RBI MPC announcement today: Will your home loan get cheaper?With interest rates already lowered three times in 2025, homebuyers and borrowers across the country are waiting to see if there is any further relief coming their way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-monetary-policy-august-2025-what-to-expect-from-the-august-6-mpc-meet-2766749-2025-08-06",
      "headline": "RBI MPC rate decision on August 6: Time, expectations, and key updatesRBI Governor Sanjay Malhotra will present the monetary policy statement today. Check time, expectations, and key updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/anil-ambani-likely-to-be-summoned-again-by-ed-for-questioning-sources-2766726-2025-08-05",
      "headline": "Anil Ambani likely to be summoned again by ED for questioning: SourcesAnil Ambani faced questioning by the Enforcement Directorate in connection with an alleged Rs 17,000 crore loan fraud case. The questioning lasted for several hours, with sources indicating that he is likely to be summoned again within seven to ten days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-seeks-10-from-ed-days-to-provide-documents-in-fraud-cases-sources-2766708-2025-08-05",
      "headline": "Anil Ambani seeks 10 days from ED to provide documents in fraud cases: SourcesThe 66-year-old industrialist was summoned to the ED headquarters in New Delhi, where his statement was recorded under the Prevention of Money Laundering Act (PMLA)."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kingdom-makers-vijay-deverakonda-disrespecting-sri-lankan-tamils-2767146-2025-08-06",
      "headline": "Kingdom makers deny disrespecting Sri Lankan Tamils: No such scenes in filmVijay Deverakonda's 'Kingdom', directed by Gowtam Tinnanuri, was criticised for demeaning Sri Lankan Tamils in the film. Sithara Entertainments, the production house, issued a statement denying the claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mukesh-khanna-backs-shah-rukh-khan-amid-national-award-row-for-jawan-2767114-2025-08-06",
      "headline": "Mukesh Khanna backs SRK amid National Award row: Award for Jawan is justifiedShah Rukh Khan's National Award win for 'Jawan' received mixed reactions, with some people questioning it. Veteran actor Mukesh Khanna supported SRK, saying he has worked hard for 40 years and truly deserves the award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-aniston-hypnotist-jim-curtis-dinner-date-jason-bateman-2767111-2025-08-06",
      "headline": "Jennifer Aniston, hypnotist Jim Curtis enjoy dinner date with Jason BatemanHollywood actor Jennifer Aniston is reportedly in a relationship with hypnotherapist Jim Curtis. The pair were spotted holidaying together in Mallorca in July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/viveck-vaswani-backs-shah-rukh-khan-national-award-win-defends-ashutosh-gowariker-2767081-2025-08-06",
      "headline": "Exclusive | Viveck Vaswani backs SRK's National Award win, Gowariker's integrityViveck Vaswani supports Shah Rukh Khan's National Award win for Jawan. He also defends Ashutosh Gowariker's integrity amid controversy over the jury's decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-cuts-a-cake-as-he-celebrates-border-2-wrap-diljit-dosanjh-2767075-2025-08-06",
      "headline": "Varun Dhawan cuts a cake as he celebrates Border 2 wrapActor Varun Dhawan cut a cake and celebrated the 'Border 2' wrap. Several pictures and videos from the celebration have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/walking-dead-actor-kelley-mack-dies-cancer-33-2767037-2025-08-06",
      "headline": "Walking Dead actor Kelley Mack dies of rare brain cancer at 33In January, actor Kelley Mack, known for her performance in 'Walking Dead', revealed that she had been diagnosed with diffuse midline glioma, a rare form of astrocytoma cancer. She died at the age of 33 on August 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/parineeta-trailer-vidya-balan-starrer-restored-in-8k-ahead-of-re-release-2766976-2025-08-06",
      "headline": "Parineeta trailer: Vidya Balan-starrer restored in 8K ahead of re-releaseAhead of the re-release of 'Parineeta', a new trailer was unveiled by the makers. Now restored in 8K, the trailer retains the charm of the film released 20 years ago. The film, which marked actor Vidya Balan's acting debut, will be re-released in theatres on August 29."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-kingdom-sparks-row-sri-lankan-tamils-bad-light-2767026-2025-08-06",
      "headline": "Protests against Vijay Deverakonda's Kingdom over portrayal of Sri Lankan TamilsVijay Deverakonda's film Kingdom has sparked protests in Tamil Nadu by pro-Tamil groups condemning its portrayal of Sri Lankan Tamils. Distributors seek police protection as screenings face disruptions in Madurai and Trichy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-greets-fans-as-saiyaara-becomes-box-office-hit-2766998-2025-08-06",
      "headline": "Ahaan Panday greets fans as Saiyaara becomes box office hit, video goes viralAhaan Panday was seen happily greeting fans and paparazzi after the massive success of his debut film 'Saiyaara', which crossed Rs 500 crore worldwide. The romantic musical has now become the second-highest-grossing Indian film of the year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-reboot-episode-8-update-tulsi-begs-angad-to-punish-her-with-broom-2767006-2025-08-06",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi Ep 8: Tulsi begs Angad to punish her with broom'Kyunki Saas Bhi Kabhi Bahu Thi' moves on to make a point about patriarchy in Indian households, and how gender roles need to be reversed. Angad, Tulsi's son, walks free amid the ongoing accident case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-introduces-son-jack-blues-in-emotional-music-video-yukon-2766994-2025-08-06",
      "headline": "Justin Bieber introduces son Jack Blues in emotional music video YukonJustin Bieber has released the music video for his new song 'Yukon', featuring touching moments with his 11-month-old son, Jack Blues. The video offers fans a heartfelt glimpse into his family life with wife Hailey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rubina-dilaik-backs-deepika-padukones-demand-for-fixed-work-hours-2766978-2025-08-06",
      "headline": "Rubina Dilaik backs Deepika Padukone's demand for fixed work hours: Not unrealisticActor Rubina Dilaik came out in support of Deepika Padukone's demand for fixed eight-hour workdays, calling it a much-needed change in the industry. She shared her own struggles with long working hours and said she would implement better systems if she ever turns producer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-shares-cryptic-post-on-disrespect-2766961-2025-08-06",
      "headline": "Priyanka Chopra shares cryptic post on disrespect. Can you relate?Priyanka Chopra recently shared a cryptic Instagram Story about cutting off people who disrespect her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/samay-raina-apoorva-mukhija-collaboration-ad-podcast-indias-got-latent-controversy-2766962-2025-08-06",
      "headline": "Samay Raina and Apoorva Mukhija spoof their past in funny new adSamay Raina and Apoorva Mukhija have reunited for a quirky skincare ad with their witty banter and playful jabs. The ad went live on Samay's Instagram handle on Tuesday night. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/daavudi-to-hrudayam-lopala-are-songs-becoming-a-burden-to-telugu-cinema-2766736-2025-08-06",
      "headline": "Daavudi to Hrudayam Lopala: Are songs becoming a burden to Telugu cinema?From the removal of the much-loved 'Hrudayam Lopala' in 'Kingdom' to viral tracks like 'Daavudi' in 'Devara Part 1' and 'Pippi Pippi Dum Dum' in 'Kuberaa' being left out of final cuts, this growing trend signals a shift in how music fits into mainstream storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-box-office-collection-day-12-historic-run-no-signs-of-slowing-down-2766946-2025-08-06",
      "headline": "Mahavatar Narsimha box office Day 12: Historic run continues for top animated hitDirector Ashwin Kumar's 'Mahavatar Narsimha' is not showing any signs of slowing down at the box office. The film surpassed the Rs 100 crore-mark (nett) at the box office in India and is still holding strong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gulshan-grover-recalls-how-women-avoided-him-due-to-his-on-screen-villain-image-2766933-2025-08-06",
      "headline": "Women feared me off-screen too, says actor Gulshan GroverGulshan Grover, famously known as Bollywood's 'Bad Man', revealed how his villainous roles once created real-life misconceptions, especially among women. He will be seen next in 'Heer Express'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ozzy-osbourne-cardiac-arrest-parkinsons-disease-final-concert-2766928-2025-08-06",
      "headline": "Ozzy Osbourne died of cardiac arrest and Parkinson's, cause of death report filedOzzy Osbourne died due to cardiac complications linked to Parkinson's disease. His daughter, Aimee Osbourne, filed his death certificate in London."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-uttarkashi-cloudburst-praying-for-safety-and-healing-2766916-2025-08-06",
      "headline": "Sara Ali Khan heartbroken over Uttarkashi cloudburst: Praying for safety, healingA cloudburst-triggered flash floods hit Uttarkashi, causing fatalities and destruction in Uttarkhand. Actor Sara Ali Khan was distraught seeing the visual and expressed her condolences on Instagram."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-rain-uttarkashi-dharali-flash-flood-cloudburst-deaths-missing-army-ndrf-rescue-cm-dhami-2766918-2025-08-06",
      "headline": "Deadly Uttarakhand flash flood cuts off key roads, bad weather hits rescue ops Live UpdatesRescue operations in Uttarkashi have been severely hampered by continuous rain. The Meteorological Department has issued a red alert for heavy rain today in several districts of the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-oil-secretly-funding-russia-war-machine-ukraine-trump-here-is-the-truth-2767147-2025-08-06",
      "headline": "Is India secretly funding Russia's war machine? The truth no one's telling youThe narrative that India's growing oil imports from Russia are fuelling the Kremlin's actions in Ukraine exposes not only media misrepresentation but also a pattern of global double standards. We answer your questions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-mohammed-siraj-england-vs-india-series-2767109-2025-08-06",
      "headline": "Mohammed Siraj storms to career-best ICC Test ranking after Oval heroicsMohammed Siraj has risen to 15th in the ICC Test bowling rankings after a remarkable series in England. His performance signals a strong bowling future for India amid the absence of Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-responds-to-indias-claim-on-us-import-of-russian-uranium-fertiliser-i-dont-know-anything-glbs-2766895-2025-08-06",
      "headline": "India pointed out US's uranium purchases from Russia. Here's what Trump saidIndia said that the United States continues to import key materials from Russia, including uranium hexafluoride for its nuclear industry, palladium for electric vehicles, as well as fertilisers and chemicals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/uttarkashi-tragedy-could-a-glacial-lake-outburst-be-behind-the-catastrophe-2767042-2025-08-06",
      "headline": "Could a glacial lake outburst be behind the Uttarkashi tragedy?Early assumptions blamed a cloudburst for the destruction in Uttarkashi, a region frequently battered by intense monsoon events. However, recent meteorological and satellite data tell a different story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-inaugurates-kartavya-bhavan-spread-over-15-lakh-sq-metres-it-will-house-key-ministries-2767064-2025-08-06",
      "headline": "PM inaugurates Kartavya Bhavan. Ministries get a swanky new addressKartavya Bhavan-3, which was inaugurated by the Prime Minister, is part of the government's ambitious project to bring central ministries and departments under one roof."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/mira-murati-said-no-to-mark-zuckerberg-proposal-so-he-launched-15-billion-war-to-hire-her-top-engineer-2767063-2025-08-06",
      "headline": "Mira Murati said no to Zuckerberg, he launched $1.5B war to hire her top engineerNever bet against Mark Zuckerberg, or so goes the saying in Silicon Valley. After spurned by Mira Murati, Zuckerberg has now launched a war with over a billion-dollar chest to try to break and lure engineers away from Mira's Thinking Machines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-sanjay-malhotra-us-tariff-statement-india-economy-impact-lending-rate-unchanged-2767010-2025-08-06",
      "headline": "Will US tariffs hit India's economy? What RBI Governor saidThe three-day meeting concluded with Governor Sanjay Malhotra outlining the central bank's views on inflation, growth, and importantly, the growing global trade tensions triggered by tariff announcements, especially by the United States."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/zelenskyy-claims-pakistani-mercenaries-in-ukraine-russia-war-as-moscow-islamabad-ties-warm-multi-vector-dipomacy-2766944-2025-08-06",
      "headline": "Pakistani mercenaries fighting in Ukraine war amid closer Russia-Pak ties?Amid the economic distress in Pakistan, mercenaries from the country are fighting for Moscow in the Ukraine-Russia war, says Ukrainian President Volodymyr Zelenskyy. Pakistan has denied the allegations, but the reports fuel doubts about Islamabad's agenda as it develops closer ties with Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-cloudburst-uttarkashi-flash-floods-missing-dead-damage-rescue-2766598-2025-08-05",
      "headline": "Live: One more body recovered in Dharali, death toll touches 5Uttarkashi Cloudburst Live: At least five people died, and several others went missing after a cloudburst triggered flash floods in Uttarkashi's Dharali area on Tuesday. Rescue teams from the police, Army, NDRF, and SDRF were deployed. Chief Minister Pushkar Singh Dhami cut short his Andhra Pradesh visit and returned to Dehradun to review the situation at the State Emergency Operation Centre. He said 130 people stranded in affected areas had been shifted to safer locations, and instructions were issued for immediate food, shelter and medical aid. Additional Army helicopters have been requested to speed up rescue efforts. Schools and educational institutions remain closed in multiple districts. Follow indiatoday.in for all Live Updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/police-investigate-indian-origin-us-professor-nisarg-shah-accused-of-being-child-predator-university-of-california-san-diego-crime-2767079-2025-08-06",
      "headline": "Indian-origin professor caught in child-sex sting in San DiegoAn Indian-origin associate professor at UC San Diego is under investigation after a viral video surfaced showing him being confronted in a vigilante sting operation for allegedly trying to meet a minor for sexual activity. Police have not filed charges but confiscated Nisarg Shah's phone. The varsity and the police said the probe is on, but Shah has denied the allegations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/great-barrier-reef-underground-graveyard-climate-change-coral-reefs-2767116-2025-08-06",
      "headline": "Great Barrier Reef turning into a graveyard from biggest bleaching eventThe fifth mass extension of the Great Barrier Reef in Australia is signalling an urgent need for global climate action and reef protection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-40-percent-tariffs-backfire-made-in-china-manufacturing-magnet-southeast-asia-vietnam-thailand-india-2766566-2025-08-06",
      "headline": "Trump is Making China Cheaper AgainTrump's tariff of up to 40% on transshipped goods and levies across Southeast Asia has left China a winner. Manufacturers and exporters are asking why they should move out of China. Ironically, Trump's trade war might be doing the unthinkable — making Chinese factories and products cheaper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/traditional-vs-modern-engineering-what-gen-z-is-choosing-and-why-it-matters-2767083-2025-08-06",
      "headline": "Traditional vs modern engineering: What gen Z is choosing and why it mattersAs engineering evolves from concrete to code, Gen Z is redefining the future of India's most-loved degree."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-flash-floods-uttarkashi-cloudburst-landslide-dharali-village-army-camp-2767002-2025-08-06",
      "headline": "Army Colonel radioes in from Uttarkashi ground zero: Camp hit, rescue ops onA cloudburst over the Kheerganga river triggered massive flash floods and a landslide in Uttarkashi's Dharali village, sweeping away homes, damaging an Army camp, and leaving dozens feared trapped."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/move-over-fake-weddings-ticketed-shaadis-are-the-next-big-thing-2767099-2025-08-06",
      "headline": "Move over fake weddings, ticketed shaadis are the next big thingForget dancing at fake weddings, now you can actually buy a ticket and be part of a real one. The trend is catching on in France, and guess what? It's happening in India too."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/can-chirag-paswan-pack-a-power-punch-in-bihar-polls-2766591-2025-08-05",
      "headline": "Can Chirag Paswan pack a power punch in Bihar polls?In Bihar's liminal political spaces—between the BJP's leadership deficit and the JD(U)'s ebbing influence—Chirag Paswan sees a fault line ripe for exploitation\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-ai-manage-your-investment-portfolio-ai-based-portfolio-management-tools-2767113-2025-08-06",
      "headline": "Can AI manage your investment portfolio?AI is rapidly changing how we invest. From portfolio tracking to fund recommendations, it's already doing the heavy lifting. But can it take full charge of your investments, and, should it?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kalyan-banerjee-vs-mahua-moitra-fight-lacks-gratitude-tmc-leaders-feud-mamata-banerjee-2766960-2025-08-06",
      "headline": "Lacks basic gratitude: Kalyan Banerjee regrets backing Mahua Moitra in pastKalyan Banerjee reignited his feud with Mahua Moitra, accusing her of ingratitude and abuse, a day after resigning as Lok Sabha chief whip of the Trinamool Congress."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/russian-woman-nicki-minaj-stiletto-challenge-weeks-after-giving-birth-breaks-spine-viral-video-2767057-2025-08-06",
      "headline": "Video: Russian woman tries stiletto challenge weeks after giving birth, breaks spineThe stiletto challenge, which has gone viral, ended in disaster for 32-year-old Mariana Barutkina, who was just weeks into postpartum recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/why-fafo-parenting-is-blowing-up-right-now-2766561-2025-08-06",
      "headline": "Why FAFO parenting is blowing up right nowStepping away from gentle parenting, many parents are now leaning toward the FAFO approach, a style that lets kids learn through real-world consequences instead of endless reminders and warnings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/himachal-pradesh-flash-flood-kinner-kailash-pilgrims-rescue-operation-video-2767045-2025-08-06",
      "headline": "Video: Over 400 Kinner Kailash pilgrims rescued using daring rope techniqueThe Indo-Tibetan Border Police (ITBP) rescued 413 people in a daring operation after a flash flood struck the Kinner Kailash Yatra route in Himachal Pradesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/decoding-the-uttarkashi-tragedy-why-garhwal-is-vulnerable-to-such-disasters-2767053-2025-08-06",
      "headline": "Uttarkashi tragedy: Why Garhwal is so vulnerable to such disastersThe region is highly susceptible to landslides and other geohazards caused by a complex mix of geological conditions, environmental factors, and human activities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-the-raja-saab-runtime-revealed-producer-eyes-december-release-2767115-2025-08-06",
      "headline": "Prabhas's The Raja Saab runtime revealed, producer eyes December releaseProducer TG Vishwa Prasad has revealed that the initial cut of Prabhas's 'The Raja Saab' runs over four-and-a-half hours. With the film currently in its final stages, the team is now targeting a December 5 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kingdom-makers-vijay-deverakonda-disrespecting-sri-lankan-tamils-2767146-2025-08-06",
      "headline": "Kingdom makers deny disrespecting Sri Lankan Tamils: No such scenes in filmVijay Deverakonda's 'Kingdom', directed by Gowtam Tinnanuri, was criticised for demeaning Sri Lankan Tamils in the film. Sithara Entertainments, the production house, issued a statement denying the claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mukesh-khanna-backs-shah-rukh-khan-amid-national-award-row-for-jawan-2767114-2025-08-06",
      "headline": "Mukesh Khanna backs SRK amid National Award row: Award for Jawan is justifiedShah Rukh Khan's National Award win for 'Jawan' received mixed reactions, with some people questioning it. Veteran actor Mukesh Khanna supported SRK, saying he has worked hard for 40 years and truly deserves the award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-aniston-hypnotist-jim-curtis-dinner-date-jason-bateman-2767111-2025-08-06",
      "headline": "Jennifer Aniston, hypnotist Jim Curtis enjoy dinner date with Jason BatemanHollywood actor Jennifer Aniston is reportedly in a relationship with hypnotherapist Jim Curtis. The pair were spotted holidaying together in Mallorca in July."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-grand-welcome-in-hyderabad-felicitation-planned-by-hca-2767137-2025-08-06",
      "headline": "Siraj gets rousing welcome in Hyderabad; grand felicitation planned for Oval heroIndia fast bowler Mohammed Siraj was given a rousing reception upon his arrival back in his hometown Hyderabad after a match-winning performance in the fifth Test against England at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-benjamin-sesko-transfer-newcastle-snub-2767125-2025-08-06",
      "headline": "Sesko picks Manchester United as Newcastle United miss out again: ReportRB Leipzig striker Benjamin Sesko is set to join Manchester United after snubbing Newcastle United in the transfer battle, according to the latest media reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-breaks-into-top-5-icc-test-batting-rankings-shubman-gill-2767117-2025-08-06",
      "headline": "Yashasvi Jaiswal breaks into top 5 of Test batting rankings, Gill out of top 10India batter Yashasvi Jaiswal broke into the top five of ICC Test batting rankings after his magnificent century in the fifth Test against England at the Oval. On the other hand, Shubman Gill moved out of top ten. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-mohammed-siraj-england-vs-india-series-2767109-2025-08-06",
      "headline": "Mohammed Siraj storms to career-best ICC Test ranking after Oval heroicsMohammed Siraj has risen to 15th in the ICC Test bowling rankings after a remarkable series in England. His performance signals a strong bowling future for India amid the absence of Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-workload-oval-test-rp-singh-jasprit-bumrah-comparison-2767100-2025-08-06",
      "headline": "Manage Siraj's workload just like Bumrah: RP Singh's advice to BCCIRP Singh urges BCCI to manage Mohammed Siraj's workload like Jasprit Bumrah's after his Oval heroics, warning of injury risk from overuse in Tests. Siraj was the star of the show as he picked up 23 wickets in the five Tests he played. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-r-ashwin-on-ben-stokes-injury-replacement-remark-2767055-2025-08-06",
      "headline": "Karma hits instantly: R Ashwin on Ben Stokes labelling injury substitutes as jokeENG vs IND: Ravichandran Ashwin has questioned England's attitude towards injured players and urged Ben Stokes to show more empathy, bringing up the idea of karma and calling out the use of words like 'joke' and 'ridiculous'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-harry-brook-on-gautam-gambhir-player-of-the-series-2767048-2025-08-06",
      "headline": "Brook stunned by Gambhir's decision to award him Player of the Series over RootEngland batter Harry Brook revealed that he felt undeserving of the Player of the Series award of the England vs India five-match Test series. Brook scored 481 runs from five matches at an average of 53.44."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-grand-masters-chennai-2025-fire-postponement-2767047-2025-08-06",
      "headline": "Chennai Grand Masters postponed to August 7 after fire at tournament venueChennai Grand Masters 2025 postponed to August 7 after a fire at the Hyatt Regency venue. All players, including Arjun Erigaisi, are safe, say organisers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-brendon-mccullum-on-mohammed-siraj-oval-2767008-2025-08-06",
      "headline": "Mohammed Siraj has heart of a lion: McCullum in awe of India's fighting spiritEngland head coach Brendon McCullum has hailed India fast bowler Mohammed Siraj for his fighting spirit and praised India for a scripitng a sensatiuonal comeback in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-india-pace-leader-greg-chappell-jasprit-bumrah-absence-2766999-2025-08-06",
      "headline": "Mohammed Siraj ready to be India's bowling leader with or without Bumrah: ChappellGreg Chappell backs Mohammed Siraj as the leader of India's pace attack, saying he's ready to take charge with or without Jasprit Bumrah in the side after Oval heroics. Siraj was adjudged as the Player Of The Match for his performance which helped India win the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-kaif-on-shubman-gill-odi-captaincy-from-rohit-sharma-2766975-2025-08-06",
      "headline": "Shubman Gill ready to take over ODI captaincy from Rohit Sharma: Mohammad KaifFormer India cricketer-turned commentator Mohammad Kaif feels Shubman Gill is ready to take over ODI captaincy from Rohit Sharma after his heroics in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-harry-brook-on-gautam-gambhir-player-of-the-series-2767048-2025-08-06",
      "headline": "Brook stunned by Gambhir's decision to award him Player of the Series over RootEngland batter Harry Brook revealed that he felt undeserving of the Player of the Series award of the England vs India five-match Test series. Brook scored 481 runs from five matches at an average of 53.44."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-grand-masters-chennai-2025-fire-postponement-2767047-2025-08-06",
      "headline": "Chennai Grand Masters postponed to August 7 after fire at tournament venueChennai Grand Masters 2025 postponed to August 7 after a fire at the Hyatt Regency venue. All players, including Arjun Erigaisi, are safe, say organisers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-brendon-mccullum-on-mohammed-siraj-oval-2767008-2025-08-06",
      "headline": "Mohammed Siraj has heart of a lion: McCullum in awe of India's fighting spiritEngland head coach Brendon McCullum has hailed India fast bowler Mohammed Siraj for his fighting spirit and praised India for a scripitng a sensatiuonal comeback in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-india-pace-leader-greg-chappell-jasprit-bumrah-absence-2766999-2025-08-06",
      "headline": "Mohammed Siraj ready to be India's bowling leader with or without Bumrah: ChappellGreg Chappell backs Mohammed Siraj as the leader of India's pace attack, saying he's ready to take charge with or without Jasprit Bumrah in the side after Oval heroics. Siraj was adjudged as the Player Of The Match for his performance which helped India win the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-kaif-on-shubman-gill-odi-captaincy-from-rohit-sharma-2766975-2025-08-06",
      "headline": "Shubman Gill ready to take over ODI captaincy from Rohit Sharma: Mohammad KaifFormer India cricketer-turned commentator Mohammad Kaif feels Shubman Gill is ready to take over ODI captaincy from Rohit Sharma after his heroics in England."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}