{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-ipo-stock-market-listing-should-you-hold-for-long-term-or-book-profit-now-2642133-2024-11-29",
      "headline": "Enviro Infra makes solid market debut: Should you hold or book profit?Enviro Infra IPO listing: Shares of Enviro Infra Engineers have dipped slightly following their strong listing, prompting investors to weigh whether to hold onto their shares or book profits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-gain-sharply-stock-market-key-factors-why-2642119-2024-11-29",
      "headline": "Adani Green, Adani Energy Solutions: Why these Adani Group stocks are gainingAdani Green Energy led the surge, rising 14.64% to hit Rs 1,247.55. Adani Energy Solutions followed, reaching a day's high of Rs 825.85. Most other Adani Group stocks also registered gains in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-engineers-stock-market-listing-49-percent-premium-ipo-price-2642108-2024-11-29",
      "headline": "Enviro Infra shares make strong debut, list at 49% premium over IPO priceEnviro Infra Engineers listing: The shares opened at Rs 220 on the NSE, marking a 48.64% jump from the IPO price of Rs 148. On the BSE, the stock listed at Rs 218, reflecting a 47.29% premium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-jumps-700-points-nifty-rises-adani-stocks-gain-2642097-2024-11-29",
      "headline": "Sensex rallies 700 points, Nifty above 24,000; Adani stocks surgeThe S&P BSE Sensex surged 663 points to reach 79,702.09 by 10:33 am, while the NSE Nifty50 climbed 154.60 points to trade at 24,084.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-drops-1200-points-nifty-falls-it-stocks-us-inflation-data-interest-rate-cut-2641678-2024-11-28",
      "headline": "Sensex crashes 1,200 points, Nifty falls below 24,000; IT stocks tumbleAt the closing bell, the S&P BSE Sensex ended 1190.34 points lower at 79,043.74, while the NSE Nifty50 fell 360.75 to settle below 24,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/renewable-energy-stocks-could-make-you-greener-ntpc-suzlon-jsw-adani-5-reasons-why-market-tips-2641640-2024-11-28",
      "headline": "Renewable energy stocks could make your portfolio green. 5 reasons whyWith the global shift towards clean energy, renewable energy stocks have proven to be rewarding for many, delivering strong returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-ltim-hcltech-tcs-information-technology-stocks-sensex-nifty-2641611-2024-11-28",
      "headline": "Infosys, LTIM, HCLTech, TCS: Why IT stocks are tumbling todayInfosys led the decline with a 3% drop, while Tech Mahindra and LTIMindtree were down by 2.5%. HCLTech, MPhasis, and TCS also recorded losses exceeding 2%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/grain-to-glass-how-this-firm-pernod-ricard-india-distillery-blending-sustainability-india-alcohol-industry-2641594-2024-11-28",
      "headline": "How this firm is blending sustainability in India's alcohol industryThe company's innovative approach, dubbed 'Grain to Glass', is transforming how businesses can contribute to environmental and social development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-jump-today-shajapur-solar-project-exchange-filing-2641576-2024-11-28",
      "headline": "Explained: Why newly-listed NTPC Green Energy shares gained 5% todayNTPC Green Energy share price: The latest surge follows NTPC Green Energy's announcement regarding the commercial operation of the first phase of its Shajapur Solar Project in Madhya Pradesh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/suraksha-diagnostic-ipo-opens-tomorrow-details-check-price-band-issue-size-latest-gmp-2641573-2024-11-28",
      "headline": "Suraksha Diagnostic IPO opens tomorrow: Check price band, issue size, GMPSuraksha Diagnostic IPO: The IPO will open for bidding on Friday and is expected to list on the stock exchanges on December 6, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-rally-rise-above-rs-90-citi-target-is-it-time-to-buy-2641559-2024-11-28",
      "headline": "Ola Electric shares continue positive rally, rise above Rs 90. Time to buy?Ola Electric share price: With this, the stock has gained over 35% in the last five sessions and has surpassed the Rs 90 target set by Citi on November 26."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-nearly-800-points-nifty-declines-4-factors-behind-stock-market-weakness-today-2641503-2024-11-28",
      "headline": "Bloodbath on Dalal Street: 4 reasons why Sensex plunged 1,200 points todayAt the closing bell, the S&P BSE Sensex was down 1190.34 points at 79,043.74, while the NSE Nifty50 fell 360.75 points to 23,914.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-share-price-today-report-buying-half-of-manipalcigna-health-insurance-2641479-2024-11-28",
      "headline": "Explained: Why LIC share price gained nearly 4% in early trade  LIC Stock Price: LIC share price gained nearly 4% in early trade despite a sharp drop in the benchmark stock market indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-share-price-rises-after-aircastle-drops-insolvency-case-2641478-2024-11-28",
      "headline": "SpiceJet share price rises after Aircastle drops insolvency caseIn September, SpiceJet announced the resolution of a $23.39 million dispute with Aircastle (Ireland) Designated Activity Company and Wilmington Trust SP Services (Dublin) Limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-total-gas-share-price-jumps-early-trade-broad-based-recovery-key-factors-behind-rally-2641472-2024-11-28",
      "headline": "Adani Total Gas share price jumps 16% in early trade. What's driving the rally?Adani Total Gas share price: The stock touched an intraday high of Rs 823.30 before settling at Rs 787, up 13.36% at 10:51 am."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-energy-solutions-enterprise-green-energy-shares-gain-up-to-10-percent-2641448-2024-11-28",
      "headline": "Adani group stocks extend winning streak, rally up to 12% todayAdani Group stocks such as Adani Green Energy Ltd, Adani Power Ltd, Adani Energy Solutions Ltd, and Adani Enterprises Ltd gained as much as 12% after the recent clarification on the US bribery charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-adani-group-shares-gain-up-to-3-percent-in-early-trade-2641437-2024-11-28",
      "headline": "Sensex, Nifty open flat; Adani group shares gain up to 10% in early tradeThe S&P BSE Sensex lost 17.08 points to 80,217.00, while the NSE Nifty50 gained 8.05 points to 24,282.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-engineers-listing-share-price-does-latest-gmp-signal-a-strong-market-debut-2641423-2024-11-28",
      "headline": "Enviro Infra Engineers listing: Does latest GMP signal a strong market debut? Enviro Infra Engineers listing: The initial public offering (IPO) of Enviro Infra Engineers saw strong investor interest through its 3-day bidding process as it was oversubscribed by 89.90 times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-adani-group-shares-waaree-renewable-pcbl-vedanta-godrej-properties-2641402-2024-11-28",
      "headline": "Stocks to watch today: Adani, Waaree, PCBL, Vedanta, Godrej Properties Stocks to watch: In today's trade, shares of Adani Group, Waaree Renewable Technologies, Godrej Properties, Vedanta, and PCBL, among others, will be in focus due to various developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/this-is-a-hatchet-job-mahesh-jethmalani-on-adanis-us-indictment-2641154-2024-11-27",
      "headline": "This is a hatchet job: Mahesh Jethmalani on Adani's US indictmentIn an exclusive interview with India Today TV, senior advocate and former BJP Rajya Sabha MP Mahesh Jatmalani defended Gautam Adani and called the US indictment a 'hatchet job'. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-iskcon-chinmoy-krishna-das-arrested-violent-protest-hindus-2642079-2024-11-29",
      "headline": "Iskcon clarifies on Hindu monk's arrest: Not distanced from backing Chinmoy DasIskcon Bangladesh denied allegations linking the organisation to a violent protest after Chinmoy Das's arrest, calling the claims baseless and part of a malicious campaign."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-serial-killer-haryana-teen-rape-murder-four-killings-on-trains-valsad-police-stations-2642058-2024-11-29",
      "headline": "4 killings on trains, teen's rape-murder: Serial killer caught in GujaratRahul Singh Jat, a native of Haryana's Rohtak, was arrested at Vapi railway station as part of a probe that began after the body of a 19-year-old girl was found near the tracks on November 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-aqi-amid-severe-pollution-this-delhi-home-maintains-aqi-of-10-15-with-15000-plants-2642025-2024-11-29",
      "headline": "Amid severe pollution, this Delhi home maintains AQI of 10-15 with 15,000 plantsUnlike typical homes, the property does not rely on paint or plaster. Traditional construction methods have been used, with bricks bound together by lime mortar instead of cement, and lime is employed in place of modern paints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/enforcement-directorate-raids-raj-kundra-shilpa-shetty-husband-pornography-network-channels-case-mumbai-2642102-2024-11-29",
      "headline": "ED raids homes and offices of Raj Kundra, others in porn racket caseBusinessman Raj Kundra's residence, office, and associates' premises are being raided by the ED in a money laundering case linked to a porn network case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-sobhita-dhulipala-haldi-wedding-december-4-2642122-2024-11-29",
      "headline": "Pics: Naga Chaitanya, Sobhita Dhulipala's pre-wedding festivities begin with haldiNaga Chaitanya and Sobhita Dhulipala's haldi ceremony took place on Friday, November 29. Photos from the ceremony were leaked on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/varanasi-udai-pratap-college-mosque-land-waqf-property-uttar-pradesh-2642061-2024-11-29",
      "headline": "UP Waqf Board claims ownership of 115-year-old Varanasi college, stokes rowThe Waqf Board issued a notice to the college in 2018, asserting that a mosque within the Udai Pratap College and linked properties were endowed to the board by the Nawab and should therefore fall under its jurisdiction. The claim has resurfaced now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangladesh-hindus-temples-attacked-mohandas-pai-indian-american-vinod-khosla-2642084-2024-11-29",
      "headline": "Genocide of Hindus by your friend: Mohandas Pai jabs businessman for backing YunusMohandas Pai's remark was to an August 7 post by Vinod Khosla in which the businessman expressed enthusiasm on Muhammad Yunus being chosen to lead the interim government in Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sambhal-violence-up-government-judicial-panel-clashes-mosque-survey-police-mob-attack-2642071-2024-11-29",
      "headline": "Sambhal violence: UP forms judicial panel ahead of Supreme Court hearing todayThe panel will be headed by Justice Devendra Kumar Arora, a retired judge of the Allahabad High Court. The other members include Amit Mohan Prasad, a retired IAS officer, and Arvind Kumar Jain, a retired IPS officer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/vladimir-putin-russia-dog-koni-former-german-chancellor-angela-merkel-memoir-freedom-2642032-2024-11-29",
      "headline": "Angela, forgive me: Putin denies he tried to scare ex-German Chancellor with dogFormer German Chancellor Angela Merkel, in her memoir, revealed that she had asked an aide to request Russian President Vladimir Putin not to bring his dog, Koni, to their meetings, as she was afraid of dogs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-cricket-analogy-india-pakistan-foreign-policy-2642127-2024-11-29",
      "headline": "Traditional to open-chested position: Jaishankar's cricket analogy on Pak policyThe External Affairs Minister made the remark while speaking at an event on the release of former cricketer Mohinder Amarnath's memoir 'Fearless'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-winter-session-live-updates-congress-bjp-india-lok-sabha-rajya-sabha-gautam-adani-us-sambhal-manipur-violence-2642105-2024-11-29",
      "headline": "Jagdeep Dhankhar rebukes MPs over disruptions: We have become laughingstockParliament Winter Session 2024 Live Updates: After repeated disruptions since the Winter Session began on November 25, both Houses of Parliament are set to reconvene on Friday. The session has seen minimal progress as Opposition protests continue, with demands for a discussion on industrialist Gautam Adani's indictment on bribery and fraud charges in the US. Thursday's proceedings were largely stalled, but notable developments included Wayanad MP and Congress leader Priyanka Gandhi's formal entry into politics as an elected representative. Additionally, the Joint Parliamentary Committee on the Waqf Bill sought an extension for its work. Parliamentary business is expected to resume Friday, though tensions between the government and Opposition remain high. Stay with Indiatoday.in for the latest updates:"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/bob-blackman-chinmoy-krishna-das-arrest-bangaldesh-attacks-persecution-hindus-minorities-2642076-2024-11-29",
      "headline": "Persecution not acceptable: British MP on arrest of Hindu monk in BangladeshBritish Conservative MP Bob Blackman raised the issue of violence against Hindus in Bangladesh in the UK parliament, calling the situation \"unacceptable\" and urging action to protect religious minorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-rahman-saira-banu-reconciliation-not-out-of-question-says-lawyer-2642070-2024-11-29",
      "headline": "AR Rahman-Saira Banu's reconciliation possible: Lawyer Vandana ShahAR Rahman and Saira Banu have announced their separation after 29 years of marriage, raising questions about the custody of their three children. Lawyer Vandana Shah, who is representing Banu, discussed the potential outcomes and remained hopeful for reconciliation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/vladimir-putin-russian-president-donald-trump-us-president-elect-ukraine-assassination-threats-2642092-2024-11-29",
      "headline": "Putin calls Trump 'intelligent', but warns US President-elect may not be safeRussian President Vladimir Putin said US President-elect Donald Trump had overcome a \"serious test\" to return to the White House and that \"absolutely uncivilised means of struggle were used against him\". "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhushan-kumar-cousin-tishaa-kumar-did-not-die-of-cancer-says-mother-tanya-2642109-2024-11-29",
      "headline": "Bhushan Kumar's cousin Tishaa Kumar didn't die of cancer, reveals mother TanyaTanya Singh clarified that her daughter Tishaa Kumar's death was due to a misdiagnosis, not cancer. She raised concerns about medical malpractices and shared Tishaa's inspiring journey of resilience in an emotional note."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/maharashtra-chief-minister-suspense-devendra-fadnavis-eknath-shinde-ajit-pawar-meet-amit-shah-jp-nadda-bjp-2642016-2024-11-29",
      "headline": "Mahayuti leaders return after 'positive' Delhi meet, Chief Minister suspense onTop Mahayuti leaders met with Amit Shah in Delhi on Thursday night to discuss appointing the next Maharashtra Chief Minister amid a deadlock on who would assume the top post. Sources said the meeting revolved around cabinet berth allocations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/essential-oils-are-shraddha-kapoors-beauty-secret-are-you-using-them-right-2641567-2024-11-29",
      "headline": "Essential oils are Shraddha Kapoor's beauty secret. Are you using them right?Shraddha Kapoor swears by essential oils, and these little 'magic potions' can work wonders for your skin too, when used the right way.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-pan-20-is-the-booster-shot-indian-businesses-needed-2641554-2024-11-28",
      "headline": "Why PAN 2.0 is the booster shot Indian businesses neededExperts say PAN as a 'common business identifier' will simplify operations and compliance for companies while helping the government regulate them better\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/apple-airpods-hearing-aid-heartstrings-ad-social-media-reactions-anti-woke-pro-family-trump-2642049-2024-11-29",
      "headline": "New Apple ad tugs on heartstrings, X users call it 'pro-family cultural revolution'Titled 'Heartstrings', the ad depicts a man who struggles with hearing loss and the impact it has on his family life. The campaign has garnered positive reactions on social media, with some interpreting it as a response to broader cultural and political shifts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-2025-fate-icc-board-meeting-bcci-pcb-stand-off-explained-2642063-2024-11-29",
      "headline": "As pressure mounts on Pakistan, Champions Trophy fate to be decided todayThe much-awaited ICC Board meeting will decide the fate of the 2025 Champions Trophy, amid ongoing tensions between India and Pakistan over hosting arrangements. Here's all that you need to know about the stand-off and the likely talking points during the meeting on Friday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/isro-is-launching-proba-3-to-block-the-sun-science-behind-artificial-eclipse-2642123-2024-11-29",
      "headline": "Proba-3 will block the Sun: Science behind creating artificial eclipseThe Proba-3 satellite will be launched by the Indian Space Research Organisation (Isro) aboard the Polar Satellite Launch vehicle (PSLV) on December 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/shiv-sena-ubt-maharashtra-election-result-maha-vikas-aghadi-rout-ambadas-danve-congress-india-bloc-2642034-2024-11-29",
      "headline": "Uddhav Sena leader blames Congress's 'overconfidence' for Maharashtra routShiv Sena (UBT) leader Ambadas Danve accused the Congress of not valuing its MVA allies and blamed it for being \"overconfident\" for the alliance's stunning defeat in the Maharashtra Assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/triathlete-taylor-knibb-asks-cameraman-not-to-film-her-heres-why-2642120-2024-11-29",
      "headline": "Triathlete Taylor Knibb asks cameraman not to film her. Here's why.Taylor Knibb, the 26-year-old American triathlete asked the cameraman to not film at a certain angle. Knibb made the request after soiling her pants during her event in Dubai."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/met-department-says-deep-depression-cyclonic-storm-fengal-cross-tamil-nadu-puducherry-coast-on-november-30-2642112-2024-11-29",
      "headline": "Cyclone Fengal: Deep depression heads to Puducherry coast, schools remain shutThe deep depression over the Bay of Bengal is expected to cross the Tamil Nadu-Puducherry coast near Puducherry on November 30. Regional Meteorological Centre, Chennai says the system could strengthen into a cyclonic storm by 1 PM today, November 29."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-sobhita-dhulipala-haldi-wedding-december-4-2642122-2024-11-29",
      "headline": "Pics: Naga Chaitanya, Sobhita Dhulipala's pre-wedding festivities begin with haldiNaga Chaitanya and Sobhita Dhulipala's haldi ceremony took place on Friday, November 29. Photos from the ceremony were leaked on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/saqib-saleem-with-varun-dhawan-samantha-raj-and-dk-citadel-success-bash-2642113-2024-11-29",
      "headline": "Saqib Saleem finally joins Varun Dhawan, Samantha, team Citadel at success bashThe team of Citadel: Honey Bunny celebrated the success of the show with a bash. Actor Saqib Saleem, who was missing during the promotions, finally made his appearance aong with Varun Dhawan, Samantha and director duo Raj and DK."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhushan-kumar-cousin-tishaa-kumar-did-not-die-of-cancer-says-mother-tanya-2642109-2024-11-29",
      "headline": "Bhushan Kumar's cousin Tishaa Kumar didn't die of cancer, reveals mother TanyaTanya Singh clarified that her daughter Tishaa Kumar's death was due to a misdiagnosis, not cancer. She raised concerns about medical malpractices and shared Tishaa's inspiring journey of resilience in an emotional note."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-tells-chunky-to-delete-instagram-stop-giving-film-advice-after-liger-2642081-2024-11-29",
      "headline": "Ananya Panday tells Chunky to delete Instagram, stop giving film advice Actor Ananya Panday shared that she told her father Chunky Panday to avoid giving film advice post-Liger. The duo discussed Instagram antics, nepotism, and parenting in a candid chat. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/triathlete-taylor-knibb-asks-cameraman-not-to-film-her-heres-why-2642120-2024-11-29",
      "headline": "Triathlete Taylor Knibb asks cameraman not to film her. Here's why.Taylor Knibb, the 26-year-old American triathlete asked the cameraman to not film at a certain angle. Knibb made the request after soiling her pants during her event in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-1st-test-day-2-report-brook-hundred-root-duck-2642118-2024-11-29",
      "headline": "Brook hundred rallies England, New Zealand rue dreadful catching on Day 2Wellington Test: Harry Brook scored a stunning hundred to revive England in the first Test in Christchurch on Friday, guiding the visitors to 319 for 5 at stumps, just 29 runs shy of New Zealand's total of 348."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-virat-kohli-confidence-allan-border-bgt-prediction-2642098-2024-11-29",
      "headline": "Don't want 'confident' Virat Kohli for rest of series vs Australia: Allan BorderBorder-Gavaskar Trophy: Former Australia captain Allan Border is disappointed over the team's inability to contain Virat Kohli during the first Test and feels that could potentially cost the hosts the five-match series.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/simona-halep-calls-out-double-standards-after-swiatek-escapes-lengthy-doping-ban-2642093-2024-11-29",
      "headline": "Simona Halep calls out double standards after Swiatek escapes lengthy doping banFormer World No.1 Simona Halep slammed the International Tennis Integrity Agency for double standards on doping bans. Halep, who was once banned for 4 years hit out at the association after Iga Swiatek received a 1-month ban for doping.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-hussey-labuschagne-form-dip-mental-struggle-perth-2642091-2024-11-29",
      "headline": "Mike Hussey backs 'defensive' Marnus Labuschagne to overcome form slumpBorder-Gavaskar Trophy: Michael Hussey has backed Marnus Labuschagne, attributing his form slump to mental adjustments rather than technical issues. Labuschagne has scored just 123 runs at an average of 13.66 in his last 10 Test innings.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-bgt-shubman-gill-injury-back-in-training-2642072-2024-11-29",
      "headline": "Shubman Gill returns to training in big boost to India's pink ball Test hopesIndia No.3 Shubman Gill returned to training ahead of the Adelaide Pink Ball Test match. India Today has accessed exclusive images of Gill practising in Canberra against the Pink Ball on Friday, 29 November."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/watch-shubman-gill-rohit-sharma-practice-ahead-of-adelaide-pink-ball-test-2642069-2024-11-29",
      "headline": "Watch: Shubman Gill, Rohit Sharma practice ahead of Adelaide Pink Ball TestIndia captain Rohit Sharma and batter Shubman Gill were spotted practising ahead of the Pink Ball Test match in Adelaide. Both players are expected to return to the playing XI in the next game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nz-vs-eng-joe-root-duck-150th-test-virat-steve-waugh-ponting-wtc-2642068-2024-11-29",
      "headline": "Joe Root out for duck in 150th Test, goes past Virat Kohli on unwanted WTC listEngland's star batter Joe Root was dismissed for a four-ball duck by New Zealand debutant Nathan Smith in his 150th Test match. Root became the third batter to record a duck in his 150th Test appearance, after Steve Waugh and Ricky Ponting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-2025-fate-icc-board-meeting-bcci-pcb-stand-off-explained-2642063-2024-11-29",
      "headline": "As pressure mounts on Pakistan, Champions Trophy fate to be decided todayThe much-awaited ICC Board meeting will decide the fate of the 2025 Champions Trophy, amid ongoing tensions between India and Pakistan over hosting arrangements. Here's all that you need to know about the stand-off and the likely talking points during the meeting on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-ab-de-villiers-rcb-captaincy-virat-kohli-2642062-2024-11-29",
      "headline": "Will Virat Kohli lead RCB? AB de Villiers drops captaincy hint for IPL 2025AB de Villiers has hinted that Virat Kohli might return as RCB captain for IPL 2025, amid ongoing speculation about the team's leadership. With Kohli's past success and a well-rounded squad, fans are hopeful for a maiden IPL trophy despite concerns over the lack of a match-winning spinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-punjab-kings-squad-australians-ricky-ponting-2642057-2024-11-29",
      "headline": "IPL: Too many Australians in Punjab Kings? Ricky Ponting reacts to criticismPunjab Kings head coach Ricky Ponting has reacted to the criticism of signing too many Australians for the franchise. Speaking after the IPL auction, Ponting said that those players fit their respective roles perfectly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/watch-shubman-gill-rohit-sharma-practice-ahead-of-adelaide-pink-ball-test-2642069-2024-11-29",
      "headline": "Watch: Shubman Gill, Rohit Sharma practice ahead of Adelaide Pink Ball TestIndia captain Rohit Sharma and batter Shubman Gill were spotted practising ahead of the Pink Ball Test match in Adelaide. Both players are expected to return to the playing XI in the next game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nz-vs-eng-joe-root-duck-150th-test-virat-steve-waugh-ponting-wtc-2642068-2024-11-29",
      "headline": "Joe Root out for duck in 150th Test, goes past Virat Kohli on unwanted WTC listEngland's star batter Joe Root was dismissed for a four-ball duck by New Zealand debutant Nathan Smith in his 150th Test match. Root became the third batter to record a duck in his 150th Test appearance, after Steve Waugh and Ricky Ponting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-2025-fate-icc-board-meeting-bcci-pcb-stand-off-explained-2642063-2024-11-29",
      "headline": "As pressure mounts on Pakistan, Champions Trophy fate to be decided todayThe much-awaited ICC Board meeting will decide the fate of the 2025 Champions Trophy, amid ongoing tensions between India and Pakistan over hosting arrangements. Here's all that you need to know about the stand-off and the likely talking points during the meeting on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-ab-de-villiers-rcb-captaincy-virat-kohli-2642062-2024-11-29",
      "headline": "Will Virat Kohli lead RCB? AB de Villiers drops captaincy hint for IPL 2025AB de Villiers has hinted that Virat Kohli might return as RCB captain for IPL 2025, amid ongoing speculation about the team's leadership. With Kohli's past success and a well-rounded squad, fans are hopeful for a maiden IPL trophy despite concerns over the lack of a match-winning spinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-punjab-kings-squad-australians-ricky-ponting-2642057-2024-11-29",
      "headline": "IPL: Too many Australians in Punjab Kings? Ricky Ponting reacts to criticismPunjab Kings head coach Ricky Ponting has reacted to the criticism of signing too many Australians for the franchise. Speaking after the IPL auction, Ponting said that those players fit their respective roles perfectly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-kylian-mbappe-real-madrid-move-problems-explained-2642048-2024-11-29",
      "headline": "What is going wrong with Kylian Mbappe's dream Real Madrid move?Kylian Mbappe's Real Madrid journey hit a rough patch with a dismal Champions League showing against Liverpool, raising concerns about his adaptability and confidence in a squad struggling to maximise his unique abilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-pujara-india-batting-order-rohit-rahul-gill-adelaide-test-2642042-2024-11-29",
      "headline": "KL Rahul should bat at No.3 if Rohit Sharma wants to open, says PujaraVeteran batter Cheteshwar Pujara reckons in-form KL Rahul should bat at No.3 if captain Rohit Sharma wants to open in the second Test against Australia. Rahul was impressive in India's 295-run win over Australia at Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-europa-league-manchester-united-ruben-amorim-first-win-spurs-draw-vs-roma-2642037-2024-11-29",
      "headline": "Manchester United fight back for Amorim's first win, Spurs drop points vs RomaEuropa League: Manchester United beat Bodo/Glimt 3-2 to secure their first victory under new manager Ruben Amorim as Tottenham Hotspur were held to a 2-2 draw by AS Roma on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-prime-ministers-xi-all-you-need-to-know-live-streaming-squads-where-to-watch-2641913-2024-11-29",
      "headline": "IND vs PM's XI : All you need to know about India's pink-ball warm up gameIndia are all set to take on Prime Minister's XI in a pink ball warm fixture ahead of the day-night Test against Australia in Adelaide. Here's all you need to know about the fixture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-champions-trophy-throwback-moved-out-2009-south-africa-venue-2641892-2024-11-29",
      "headline": "When Pakistan lost the hosting rights of Champions Trophy in 2009Pakistan were set to host the ICC Champions Trophy 2008 in September after bagging the hosting rights. However, the tournament was shifted out of the country and played in South Africa after a year's delay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/delhi-capitals-kl-rahul-ipl-auction-ready-to-go-even-bigger-parth-jindal-exclusive-2642005-2024-11-28",
      "headline": "DC were ready to go even bigger for KL Rahul: Co-owner Parth Jindal explainsDelhi Capitals co-owner Parth Jindal revealed the franchise was prepared to exceed their Rs 14 crore bid for KL Rahul in the IPL 2025 mega auction, after losing out on top target Shreyas Iyer and a failed RTM for Rishabh Pant."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-final-d-gukesh-vs-ding-liren-live-streaming-details-singapore-2641991-2024-11-28",
      "headline": "World Chess Championship match, D Gukesh vs Ding Liren: When and where to watchAll eyes will be on D Gukesh as he will take on defending champion Ding Liren in Game 4 of the World Chess Championship in Singapore on Friday, November 29. Gukesh won Game 3 to level the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-champions-trophy-throwback-moved-out-2009-south-africa-venue-2641892-2024-11-29",
      "headline": "When Pakistan lost the hosting rights of Champions Trophy in 2009Pakistan were set to host the ICC Champions Trophy 2008 in September after bagging the hosting rights. However, the tournament was shifted out of the country and played in South Africa after a year's delay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/delhi-capitals-kl-rahul-ipl-auction-ready-to-go-even-bigger-parth-jindal-exclusive-2642005-2024-11-28",
      "headline": "DC were ready to go even bigger for KL Rahul: Co-owner Parth Jindal explainsDelhi Capitals co-owner Parth Jindal revealed the franchise was prepared to exceed their Rs 14 crore bid for KL Rahul in the IPL 2025 mega auction, after losing out on top target Shreyas Iyer and a failed RTM for Rishabh Pant."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-final-d-gukesh-vs-ding-liren-live-streaming-details-singapore-2641991-2024-11-28",
      "headline": "World Chess Championship match, D Gukesh vs Ding Liren: When and where to watchAll eyes will be on D Gukesh as he will take on defending champion Ding Liren in Game 4 of the World Chess Championship in Singapore on Friday, November 29. Gukesh won Game 3 to level the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-shreyas-iyer-priority-mend-ways-rishabh-pant-parth-jindal-exclusive-2641985-2024-11-28",
      "headline": "DC's priority was Shreyas, was ready to mend ways with Pant: Parth JindalRishabh Pant's record-breaking Rs 27 crore move to Lucknow Super Giants not only rewrote IPL history but also revealed behind-the-scenes drama, including Delhi Capitals' efforts to reconcile with their former captain during the auction frenzy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-prithvi-shaw-auction-snub-delhi-capitals-parth-jindal-2641974-2024-11-28",
      "headline": "Prithvi Shaw is misunderstood, but IPL auction snub was needed: Parth JindalDelhi Capitals co-owner Parth Jindal feels that Prithvi Shaw needed a 'jolt' in his life in the form of the IPL 2025 Auction snub. Jindal also feels that Shaw is someone who is misunderstood as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-sri-lanka-druban-test-marco-jansen-seven-wicket-haul-durban-2641934-2024-11-28",
      "headline": "South Africa in cruise control of Durban Test after Sri Lanka 42 all-outMarco Jansen's career-best 7/13 dismantled Sri Lanka for a record-low 42 runs, giving South Africa a dominant position in the Durban Test. The Proteas' fiery bowling and solid batting combined to crush Sri Lanka's hopes of a comeback."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/tennis-iga-swiatek-one-month-doping-ban-response-itia-2641920-2024-11-28",
      "headline": "Iga Swiatek breaks silence on 1-month doping ban: Worst experience of my lifeFormer World No.1 Iga Swiatek has opened up on the one-month doping ban she has accepted on Thursday, November 28, calling it the worst experience of her life. Swiatek accepted the ban after unknowingly consuming a banned substance. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}