{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/two-foreign-funds-with-investment-in-adani-group-under-sebi-scanner-2727060-2025-05-19",
      "headline": "Two foreign funds with investment in Adani Group under Sebi scannerThe Adani Group and its 13 offshore investors have been facing an investigation by the Securities and Exchange Board of India (Sebi) since Hindenburg Research in 2023 alleged improper use of tax havens by the group, triggering a stock sell-off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-insider-trading-sebi-probe-six-officials-accounting-error-report-2727042-2025-05-19",
      "headline": "Six IndusInd Bank officials under Sebi scanner for insider trading: ReportThe Securities and Exchange Board of India (Sebi) is checking the timing of these trades to find out whether the share sales broke Sebi's rules or the bank's own internal code of conduct."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byju-raveendran-promises-comeback-despite-big-setbacks-i-am-not-giving-up-2727035-2025-05-19",
      "headline": "Byju's Raveendran promises comeback despite big setbacks: 'I am not giving up'Byju Raveendran, the founder of the edtech company, Byju's, admitted that the company made some business mistakes during its rapid global expansion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boycott-turkey-hits-fashion-online-shopping-e-commerce-myntra-ajio-stop-selling-turkish-labels-2727016-2025-05-19",
      "headline": "'Boycott Turkey' hits fashion: Myntra, Ajio stop selling these Turkish labelsThe two leading online fashion platforms have removed Turkish products after growing boycott calls over Turkey's support to Pakistan during the recent India-Pakistan military conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-271-points-lower-nifty-below-25000-eternal-zomato-falls-3-percent-2727011-2025-05-19",
      "headline": "Sensex closes 271 points lower, Nifty below 25,000, Eternal falls 3%The S&P BSE Sensex was down 271.17 points to end at 82,059.42, while the NSE Nifty50 lost 74.35 points to close at 24,945.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/high-salaries-may-not-last-forever-zoho-ceo-sridhar-vembu-warns-software-engineers-2726990-2025-05-19",
      "headline": "'High salaries may not last forever': Zoho's Sridhar Vembu warns software engineersSridhar Vembu explained that the upcoming changes in software development, especially with large language models (LLMs) and new tools powered by artificial intelligence (AI), might lead to many software jobs being lost."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/vodafone-idea-share-price-fall-drop-10-percent-why-reason-supreme-court-hearing-agr-dues-plea-rejected-2726952-2025-05-19",
      "headline": "Vodafone Idea shares drop 10%. Here's whyVodafone Idea share price: Over the last month, Vodafone Idea's stock has gone down by 16.73%. In the last year, it has fallen over 50%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-new-in-itr-forms-for-fy-2024-25-5-key-changes-you-must-know-2726940-2025-05-19",
      "headline": "What's new in ITR Forms for FY 2024-25? 5 key changes you must knowNow taxpayers need to clearly mention the specific TDS section under which tax was deducted from your income. This change applies to ITR forms 1, 2, 3 and 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/supreme-court-dismisses-vodafone-idea-airtel-plea-on-agr-interest-dues-2726933-2025-05-19",
      "headline": "Supreme Court dismisses Vodafone Idea, Airtel plea on AGR interest duesThe court dismissed the writ petitions filed by the telecom operators, calling the move \"shocking\" and stating that the petitions were \"misconceived.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/brent-crude-oil-price-usd-65-stocks-that-may-benefit-investors-share-market-2726911-2025-05-19",
      "headline": "Brent crude slips below $65: These stocks may benefit investorsBrent futures for July delivery were trading at $64.98 a barrel, down 0.66%. This is a steep fall from January, when prices were above $80 a barrel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/once-earning-rs-128-crore-metaverse-engineer-now-sidelined-by-ai-and-delivering-food-2726903-2025-05-19",
      "headline": "Once earning Rs 1.28 crore, metaverse engineer now sidelined by AI and delivering foodShawn Kay has worked in tech for 20 years. He was involved in virtual reality, web development and artificial intelligence. But after being laid off in April last year, things took a turn for the worse. The metaverse boom faded and jobs in that space dried up, especially with the sudden rise of AI tools like ChatGPT."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dreaming-of-a-job-abroad-these-are-the-easiest-countries-to-get-a-work-visa-2726861-2025-05-19",
      "headline": "Dreaming of a job abroad? These are the easiest countries to get a work visaLatvia is the easiest country to get a skilled worker visa. It scored 7.64 out of 10 for ease of entry. The visa itself costs around 83 pounds and typically gets approved in ten working days, according to a study conducted by Remitly."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/adarsh-gourav-shanaya-kapoor-tu-yaa-main-to-begin-shooting-in-june-2727003-2025-05-19",
      "headline": "Adarsh Gourav and Shanaya Kapoor to begin Tu Yaa Main shooting in June. DetailsAdarsh Gourav and Shanaya Kapoor are set to begin shooting for their upcoming thriller 'Tu Yaa Main' in June. Directed by Bejoy Nambiar and produced by Aanand L Rai, the film will release on Valentine's Day 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/american-manhunt-review-riveting-documentary-about-hunt-for-laden-that-hits-home-2727036-2025-05-19",
      "headline": "American Manhunt review: Riveting documentary about hunt for Laden that hits homeReleased-Wed May 14, 2025The timing of the release of 'American Manhunt - Osama bin Laden' on Netflix India may be coincidental. However, that's what exactly makes it feel so personal. The three-part documentary humanises the entire operation - the facts we know, the minds we don't."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-slams-jyoti-malhotras-hatred-for-india-amid-espionage-allegations-2727028-2025-05-19",
      "headline": "Rupali Ganguly reacts to Jyoti Malhotra's arrest over 'spying for Pakistan'Rupali Ganguly slammed YouTuber Jyoti Malhotra, accused of spying for Pakistan, on social media. The actor called for stern action against those working against India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kunal-kohli-calls-mission-impossible-8-yawn-fest-messed-up-greatest-franchises-ever-2726936-2025-05-19",
      "headline": "Mission Impossible 8 is yawn fest, messes up great franchise: Kunal KohliFilmmaker Kunal Kohli recently reviewed Tom Cruise's Mission Impossible:8. While expressing his disappointment with the new sequel, he called it a 'yawn fest'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/masterchef-australia-depinder-raj-kachori-indian-street-food-impresses-judges-2726960-2025-05-19",
      "headline": "Indian-origin contestant's Raj Kachori impresses MasterChef Australia judgesChef Depinder Chhibber impressed MasterChef Australia judges with her Raj Kachori dish. The dish evoked strong emotions and highlighted rich Indian street food culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/how-actor-sumanth-from-akkineni-family-carved-his-niche-in-telugu-films-2726910-2025-05-19",
      "headline": "How actor Sumanth from Akkineni family carved his niche in Telugu filmsWhile most actors from legacy families chase mass appeal, Sumanth, who belongs to the Akkineni clan, has quietly carved a niche for himself with grounded performances and understated classics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-46-begins-with-director-venky-atluri-actor-mamitha-baiju-pics-2726926-2025-05-19",
      "headline": "Suriya 46 begins with director Venky Atluri, actor Mamitha Baiju. PicsActor Suriya's next film, 'Suriya 46' with Venky Atluri has officially been launched with a puja ceremony. Telugu director Trivikram was present as a guest at the ceremony along with Suriya, Venky, Mamitha Baiju, Naga Vamsi and GV Prakash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-skips-guns-n-roses-shares-jam-session-with-saif-and-taimur-2726948-2025-05-19",
      "headline": "Kareena Kapoor skips Guns N' Roses concert, jams with Saif and Taimur insteadKareena Kapoor Khan skipped the much-anticipated Guns N' Roses concert in Mumbai to enjoy a heartwarming guitar jam session at home with husband Saif Ali Khan and son Taimur. Sharing the moment on Instagram, she proudly called them her \"own band.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-and-the-weeknd-at-mission-impossible-the-final-reckoning-premiere-at-new-york-share-hug-2726826-2025-05-19",
      "headline": "Tom Cruise hugs singer The Weeknd at MI: 8 premiere, fans call it unreal crossoverHollywood actor Tom Cruise and Canadian singer and songwriter, The Weeknd hugged at the Mission: Impossible – Final Reckoning premiere in New York. Fans recalled Tom Cruise's iconic lip-sync battle from 'The Tonight Show', performing The Weeknd's 'Can't Feel My Face'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/john-abraham-the-diplomat-no-muscle-flexing-approach-that-worked-shivam-nair-2726883-2025-05-19",
      "headline": "John Abraham's The Diplomat, and the 'no muscle-flexing' approach that workedJohn Abraham's 'The Diplomat' is anchored in realism and driven by restraint. The movie brings to life the remarkable true story of Uzma Ahmed and the quiet, calculated world of diplomacy that ultimately saved her. Read to know how the espionage drama delves into the behind-the-scenes operations of international diplomacy, where power moves quietly. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rahul-bhat-challenges-kumbh-shoot-for-hollywood-debut-lost-and-found-in-kumbh-exclusive-2726881-2025-05-19",
      "headline": "Exclusive: Rahul Bhat on challenges of shooting at Kumbh for his Hollywood debutRahul Bhat unveiled the first look of his Hollywood debut film 'Lost and Found in Kumbh' at Cannes Film Festival 2025. In an exclusive interview, Bhat spoke about the light-hearted comedy that is set against the backdrop of the Kumbh Mela and promises a unique blend of Indian culture and humour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-eyes-top-gun-3-days-of-thunder-2-thinking-many-different-stories-2726877-2025-05-19",
      "headline": "Tom Cruise eyes Top Gun, Days of Thunder sequels: Thinking many different storiesActor Tom Cruise hinted at potential sequels to 'Top Gun: Maverick' and 'Days of Thunder' sequels. In an interview for the film, he said he is currently discussing 'many different stories'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/guns-n-roses-set-mumbai-ablaze-with-a-nostalgic-no-holds-barred-rock-spectacle-2726898-2025-05-19",
      "headline": "Guns N' Roses set Mumbai ablaze with a nostalgic, no-holds-barred rock spectacleAfter a 13-year hiatus, Guns N' Roses delivered a powerful and memorable concert in Mumbai, winning hearts with their classic hits. The band's energetic performance and crowd interaction made it a night to remember for fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-says-americans-have-no-idea-about-kashmir-india-pakistan-conflict-2726884-2025-05-19",
      "headline": "Americans have no idea about Kashmir, India-Pakistan conflict: Vivek AgnihotriFilmmaker Vivek Agnihotri, in an exclusive interview with India Today, spoke about the West's perception of the India-Pakistan conflict, and the Kashmir issue. He said we need to make more films about the Valley the way the US made on the Holocaust. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-makes-it-to-forbes-30-list-rumoured-partner-walker-blanco-reacts-2726867-2025-05-19",
      "headline": "Ananya Panday makes it to Forbes 30 list, rumoured partner Walker Blanco reactsAnanya Panday has been named in the Forbes' 30 Under 30 Asia list for 2025. Her rumoured partner, Walker Blanco, celebrated the achievement with a supportive note on Instagram Story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neil-nitin-mukesh-daughter-nurvi-amitabh-bachchan-fan-arts-passion-2726864-2025-05-19",
      "headline": "Neil Nitin Mukesh on daughter Nurvi's love for arts and Big B's filmsActor Neil Nitin Mukesh reveals his six-year-old daughter Nurvi's growing passion for the arts and admiration for Amitabh Bachchan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-vedan-kerala-concert-crowd-mismanagement-no-major-injuries-2726851-2025-05-19",
      "headline": "Rapper Vedan's Kerala concert ends early due to crowd mismanagementKerala rapper Vedan's concert in Palakkad faced chaos due to overwhelming crowd turnout. Police intervened with lathi charge but confirmed no major injuries at the venue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhay-deol-turns-dj-at-gurugram-nightclub-fans-call-him-ord-dj-bobby-student-2726845-2025-05-19",
      "headline": "Abhay Deol turns DJ at Gurugram nightclub, fans call him 'lord Bobby's student'Actor Abhay Deol took over the DJ console at a nightclub in Gurugram. A video of his set has gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ravi-kishan-warning-to-pakistan-against-terrorist-activity-will-get-a-befitting-reply-2726832-2025-05-19",
      "headline": "Will get fitting reply: Ravi Kishan's warning to Pak against 'terrorist activity'Actor and BJP MP Ravi Kishan talked about India's Operation Sindoor against Pakistan-backed terrorism, and highlighted that we will give a 'fitting reply' to our neighbour if they 'provoke' us. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-india-not-dharamshala-sri-lankan-national-plea-against-deportation-2727030-2025-05-19",
      "headline": "India not a dharamshala: Supreme Court junks Sri Lankan's plea against deportationThe petitioner, a Sri Lankan Tamil citizen, had sought protection from deportation, citing a threat to his life if he were to return to his home country. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sindoor-ka-saudagar-congress-steps-up-attack-on-s-jaishankar-despite-fact-check-operation-sindoor-2726967-2025-05-19",
      "headline": "Sindoor ka saudagar: Congress steps up attack on S Jaishankar despite fact-checkRahul Gandhi once again reiterated his claims that India maintained silence over the loss of assets during Operation Sindoor, calling it a 'crime' to have informed Pakistan beforehand, while citing remarks made by S Jaishankar. Following his tweet, Congress leader Pawan Khera called BJP 'Sindoor ka saudagar' while playing Jaishankar's video byte."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/crocodile-tears-top-court-orders-special-probe-into-minister-vijay-shahs-remarks-against-col-sofiya-qureshi-2726922-2025-05-19",
      "headline": "Top court rejects Minister's apology for Col Sofiya Qureshi remarks, orders probeThe Supreme Court on Monday constituted a Special Investigation Team of three IPS officers to investigate the FIR filed against Madhya Pradesh Minister Vijay Shah for his communal and offensive remarks against Army officer Colonel Sofiya Qureshi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/haryana-youtuber-jyoti-malhotra-was-lured-to-push-pro-pakistan-content-operation-sindoor-free-speech-2727031-2025-05-19",
      "headline": "Haryana YouTuber was lured to push pro-Pak content, called it free speech: CopsPost Pahalgam terror attack, Jyoti, who has 3.85 lakh subscribers on YouTube, put out a video claiming that it was not the fault of any Pakistani. 'She was asked to push the pro-Pakistani narrative, which is a new form of warfare,' sources revealed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-news-operation-sindoor-attack-jammu-border-pahalgam-terrorist-post-2726795-2025-05-19",
      "headline": "A Bajrang Bali war cry and payback: How Rajput Regiment soldiers destroyed Pak postsIndia Today spoke to the Indian Army bravehearts stationed along the International Border in Jammu, who swiftly and resolutely countered Pakistan's attacks, inflicting heavy casualties and destroying enemy posts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-is-ali-khan-mahmudabad-arrest-operation-sindoor-ashoka-university-2726962-2025-05-19",
      "headline": "Who is Ali Khan Mahmudabad, Ashoka University professor held over Op Sindoor post?Ali Khan Mahmudabad, a historian and Ashoka University professor, was arrested over a social media post on Operation Sindoor. He comes from a royal lineage and has a rich academic and political background.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/baloch-rebels-release-video-of-jaffar-express-hijacking-counter-pak-narrative-2727019-2025-05-19",
      "headline": "Baloch rebels release video of Jaffar Express hijack, counter Pak narrativeThe Baloch Liberation Army, a separatist group seeking Balochistan's secession from Pakistan, hijacked the Peshawar-bound Jaffar Express on March 11 after blowing up the railway tracks. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/two-foreign-funds-with-investment-in-adani-group-under-sebi-scanner-2727060-2025-05-19",
      "headline": "Two foreign funds with investment in Adani Group under Sebi scannerThe Adani Group and its 13 offshore investors have been facing an investigation by the Securities and Exchange Board of India (Sebi) since Hindenburg Research in 2023 alleged improper use of tax havens by the group, triggering a stock sell-off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/joe-biden-advanced-prostate-cancer-diagnosis-expert-debate-rapid-progression-screening-2726857-2025-05-19",
      "headline": "After Biden's prostate cancer diagnosis, questions about timeline, transparencyFormer US President Joe Biden has been diagnosed with advanced prostate cancer that has spread to his bones. Experts and doctors are debating how quickly the cancer could have progressed without earlier detection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladeshi-actor-nusraat-faria-sheikh-hasina-role-sent-to-jail-arrested-in-attempted-murder-case-2727032-2025-05-19",
      "headline": "Bangladesh actor who essayed Sheikh Hasina's role jailed in attempted murder caseThe order was issued on Monday by Dhaka Metropolitan Magistrate Nasrin Akter, following Faria's appearance in court. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/benjamin-netanyahu-vows-full-control-gaza-strip-new-operation-famine-2727006-2025-05-19",
      "headline": "Netanyahu says Israel to control all of Gaza after launch of new ground assaultIsraeli PM Netanyahu vowed to take full control of Gaza amid intensified military operations, while global pressure mounts over a growing famine crisis. Airstrikes killed at least 22 as talks for a ceasefire and hostage deal remain stalled.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/bihar/story/bihar-assembly-election-2025-prashant-kishor-jan-suraaj-merge-rcp-singh-asap-bihar-cm-nitish-kumar-cold-sweat-2726925-2025-05-19",
      "headline": "PK joins hands with former rival, gives Nitish Kumar jittersTwo of Bihar CM Nitish Kumar's former aides -- Prashant Kishor and RCP Singh -- who had turned rivals, have now joined hands and are turning up the heat in the JD(U)'s backyard. With Singh merging his Aap Sabki Awaaz Party with PK's Jan Suraaj, they could shake up Kumar's core vote base and pile up pressure on Nitish's turf, Nalanda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boycott-turkey-hits-fashion-online-shopping-e-commerce-myntra-ajio-stop-selling-turkish-labels-2727016-2025-05-19",
      "headline": "'Boycott Turkey' hits fashion: Myntra, Ajio stop selling these Turkish labelsThe two leading online fashion platforms have removed Turkish products after growing boycott calls over Turkey's support to Pakistan during the recent India-Pakistan military conflict."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/dalit-final-year-engineering-student-kidnapped-assaulted-in-tirupati-police-open-investigation-2726982-2025-05-19",
      "headline": "Dalit engineering student alleges abduction, assault in TirupatiA final-year engineering student in Tirupati alleged he was abducted, confined, and assaulted by a group of juniors. Tiruchanur Police have registered a case and launched an investigation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/indian-origin-professor-in-uk-loses-oci-status-anti-india-activities-nitasha-kaul-university-of-westminster-2726943-2025-05-19",
      "headline": "Indian-origin professor in UK loses OCI status over anti-India activitiesThe OCI status of UK-based Indian-origin academician Nitasha Kaul has been cancelled over \"anti-India activities\", driven by \"malice and complete disregard for facts or history\". The government notice was shared by Kaul, who was deported from Bengaluru airport last year within hours of her landing in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/american-manhunt-review-riveting-documentary-about-hunt-for-laden-that-hits-home-2727036-2025-05-19",
      "headline": "American Manhunt review: Riveting documentary about hunt for Laden that hits homeReleased-Wed May 14, 2025The timing of the release of 'American Manhunt - Osama bin Laden' on Netflix India may be coincidental. However, that's what exactly makes it feel so personal. The three-part documentary humanises the entire operation - the facts we know, the minds we don't."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/danish-kanerias-photo-removed-from-jaipur-stadium-amid-india-pakistan-tensions-2727038-2025-05-19",
      "headline": "Danish Kaneria's photo removed from Jaipur stadium amid India-Pakistan tensionsFormer Pakistan cricketer Danish Kaneria's photo has been removed from the Sawai Man Singh Stadium in Jaipur amid the rising tensions between India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byju-raveendran-promises-comeback-despite-big-setbacks-i-am-not-giving-up-2727035-2025-05-19",
      "headline": "Byju's Raveendran promises comeback despite big setbacks: 'I am not giving up'Byju Raveendran, the founder of the edtech company, Byju's, admitted that the company made some business mistakes during its rapid global expansion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/diu/story/in-numbers-massive-covid-19-surge-asian-countries-2726984-2025-05-19",
      "headline": "In numbers: The massive Covid-19 surge in Asian countriesHong Kong reported 1,042 cases in the week ending May 10. In the previous week, the number of cases was 972. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/no-one-cares-about-iit-outside-india-london-techies-advice-goes-viral-2726975-2025-05-19",
      "headline": "No one cares about IIT outside India: London techie's advice goes viralA London-based techie recently shared his experience in an X post, stating that while IIT holds weight in India, it is not considered highly valuable outside the country. Instead, one must focus on showcasing their past work and experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/was-on-leave-ola-on-bengaluru-techies-suicide-due-to-alleged-work-pressure-2726889-2025-05-19",
      "headline": "Was on leave: Ola Krutrim on Bengaluru techie's 'suicide' due to work pressureKrutrim, an artificial intelligence unit of Ola, came under fire after a social media post claimed that its employee died by suicide due to toxic work culture and pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-targeted-amritsar-on-may-8-how-indias-air-defence-saved-golden-temple-2726817-2025-05-19",
      "headline": "Pakistan targeted Amritsar on May 8. How India's air defence saved Golden TemplePakistan engaged in an air assault with aerial weapons, including drones and long-range missiles, targeting the Golden Temple, which was \"thwarted\" by the army personnel, who remained prepared for such situations and attacks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/puducherry/story/us-based-eye-doctor-stopped-from-boarding-at-puducherry-airport-for-carrying-satellite-phone-2726912-2025-05-19",
      "headline": "US doctor stopped from boarding at Puducherry airport for carrying satellite phoneA 32-year-old US-based ophthalmologist was stopped from boarding at the Puducherry airport for carrying a satellite phone. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-gt-kevin-pietersen-abishek-porel-press-conference-delhi-2727059-2025-05-19",
      "headline": "Kevin Pietersen offers support when things aren't going right: DC's Abishek PorelAbishek Porel opened up on the influence of DC mentor Kevin Pietersen and said that the former England captain offers support when things aren't going right for the side. Delhi Capitals are going through a slump at the moment after their recent loss to GT."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-beat-dc-gujarat-titans-assistant-coach-press-conference-gill-sudharsan-2727044-2025-05-19",
      "headline": "Sai Sudharsan understands the game well: GT coach praises opener's consistencyGujarat Titans assistant coach Ashish Kapoor praised Sai Sudharsan for sticking to the traditional cricketing strokes, which helped him emerge as the top run-getter this IPL season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ajax-manager-francesco-farioli-steps-down-after-historic-title-collapse-2727041-2025-05-19",
      "headline": "Ajax manager Francesco Farioli steps down after historic title collapseFrancesco Farioli has left Ajax Amsterdam following a stunning late-season collapse that saw the club miss out on a record 37th Eredivisie title.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/danish-kanerias-photo-removed-from-jaipur-stadium-amid-india-pakistan-tensions-2727038-2025-05-19",
      "headline": "Danish Kaneria's photo removed from Jaipur stadium amid India-Pakistan tensionsFormer Pakistan cricketer Danish Kaneria's photo has been removed from the Sawai Man Singh Stadium in Jaipur amid the rising tensions between India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-gt-sai-sudharsan-shubman-gill-ajay-jadeja-2727020-2025-05-19",
      "headline": "Sai Sudharsan has outshone future India captain Shubman Gill: Ajay JadejaAjay Jadeja has claimed that Sai Sudharsan has outshone Shubman Gill during the IPL 2025 campaign after his hundred against DC on Sunday, May 18. Sudharsan remained unbeaten on 102 as GT thrashed DC by 10 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-tom-moody-collective-performance-playoffs-hopes-2727004-2025-05-19",
      "headline": "LSG require collective performance to keep playoff hopes alive: Tom MoodyTom Moody believes Lucknow Super Giants had to deliver as a unit in their crucial game against Sunrisers Hyderabad. With playoff hopes fading, he stressed that only a strong collective effort could keep them alive in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-will-do-wonders-for-england-cricket-adil-rashid-2726993-2025-05-19",
      "headline": "Harry Brook will do wonders for England cricket: Rashid backs young English captainEngland spinner, Adil Rashid, has expressed his support for new captain Harry Brook ahead of his first series in charge against the West Indies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-rishabh-pant-angry-aakash-chopra-2726981-2025-05-19",
      "headline": "Frustrated Rishabh Pant isn't the captain that LSG will want: Aakash ChopraAakash Chopra said that a frustrated and angry Rishabh Pant isn't something that LSG wants as they enter a crucial period in the play-off race. LSG need to win all their remaining matches to stand a chance of making it to the play-offs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/moeen-ali-parents-pok-india-vs-pakistan-operation-sindoor-2726951-2025-05-19",
      "headline": "Moeen Ali reveals his parents were in PoK during India-Pakistan conflictFormer England all-rounder Moeen Ali has revealed that his parents were stranded in Pakistan-Occupied Kashmir (PoK) while he was in India earlier this month during a period of rising military tensions with Pakistan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-srh-daniel-vettori-no-break-excuse-2726935-2025-05-19",
      "headline": "SRH won't use break as excuse ahead of LSG clash: Coach Daniel VettoriSunrisers Hyderabad head coach Daniel Vettori made it clear that the team won't use their extended break as an excuse ahead of their clash against Lucknow Super Giants on May 19. While both teams return after the break, SRH will play for pride, and LSG will fight to keep their fading playoff hopes alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/javelin-neeraj-chopra-90-metre-barrier-gagan-narang-2726934-2025-05-19",
      "headline": "Neeraj Chopra is free to push his limits after breaching 90m mark: Gagan NarangGagan Narang feels that Neeraj Chopra is now free to push his limits after breaking the 90-metre barrier during the Doha Diamond League on May 16. Neeraj finished second at the Diamond League in Doha but was finally able to get the monkey off his back. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-will-do-wonders-for-england-cricket-adil-rashid-2726993-2025-05-19",
      "headline": "Harry Brook will do wonders for England cricket: Rashid backs young English captainEngland spinner, Adil Rashid, has expressed his support for new captain Harry Brook ahead of his first series in charge against the West Indies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-rishabh-pant-angry-aakash-chopra-2726981-2025-05-19",
      "headline": "Frustrated Rishabh Pant isn't the captain that LSG will want: Aakash ChopraAakash Chopra said that a frustrated and angry Rishabh Pant isn't something that LSG wants as they enter a crucial period in the play-off race. LSG need to win all their remaining matches to stand a chance of making it to the play-offs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/moeen-ali-parents-pok-india-vs-pakistan-operation-sindoor-2726951-2025-05-19",
      "headline": "Moeen Ali reveals his parents were in PoK during India-Pakistan conflictFormer England all-rounder Moeen Ali has revealed that his parents were stranded in Pakistan-Occupied Kashmir (PoK) while he was in India earlier this month during a period of rising military tensions with Pakistan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-srh-daniel-vettori-no-break-excuse-2726935-2025-05-19",
      "headline": "SRH won't use break as excuse ahead of LSG clash: Coach Daniel VettoriSunrisers Hyderabad head coach Daniel Vettori made it clear that the team won't use their extended break as an excuse ahead of their clash against Lucknow Super Giants on May 19. While both teams return after the break, SRH will play for pride, and LSG will fight to keep their fading playoff hopes alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/javelin-neeraj-chopra-90-metre-barrier-gagan-narang-2726934-2025-05-19",
      "headline": "Neeraj Chopra is free to push his limits after breaching 90m mark: Gagan NarangGagan Narang feels that Neeraj Chopra is now free to push his limits after breaking the 90-metre barrier during the Doha Diamond League on May 16. Neeraj finished second at the Diamond League in Doha but was finally able to get the monkey off his back. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}