{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-250-points-nifty-above-24500-bel-gains-1-percent-2795491-2025-09-30",
      "headline": "Sensex jumps 250 points, Nifty above 24,500; BEL gains 1%The S&P BSE Sensex was up 299.85 points to 80,664.79, while the NSE Nifty50 added 71 points to 24,705.90 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-ipo-wework-india-gmp-listing-gains-price-band-important-dates-should-you-invest-2795474-2025-09-30",
      "headline": "Tata Capital vs WeWork India: Which IPO should you invest in?Two names drawing strong attention this week are Tata Capital Ltd and WeWork India Management Ltd, both preparing to make their market debuts in October 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-new-rules-claim-settlement-of-deceased-account-holders-will-nominee-15-days-penalty-2795362-2025-09-29",
      "headline": "RBI simplifies process for claim settlement of deceased account holdersThe new framework by the Reserve Bank of India (RBI) has been introduced to remove the confusion caused by different practices followed by banks earlier."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/when-will-the-8th-pay-commission-be-implemented-here-is-what-you-should-know-2795162-2025-09-29",
      "headline": "When will the 8th Pay Commission be implemented? Here's what you should knowThe Pay Commission affects much more than basic salaries. It influences allowances, pensions, and long-term financial security. In times of rising inflation, employees and pensioners are especially keen for the Commission's work to begin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arattai-zoho-sridhar-vembu-whatsapp-alternative-piyush-goyal-radhika-gupta-2795288-2025-09-29",
      "headline": "From CEOs to ministers, support pours in for Zoho's ArattaiThe rise of Arattai has caught the attention of users, industry leaders, and public figures, many of whom have shared their support and congratulations for Zoho and its founder, Sridhar Vembu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/who-should-invest-in-tata-capital-ipo-market-expert-weighs-in-2795243-2025-09-29",
      "headline": "Who should invest in Tata Capital IPO? Market expert weighs inThe Tata Capital IPO is around the corner, and many investors are wondering whether it's the right bet. A market expert has broken down who should consider subscribing and who may want to stay cautious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-close-flat-investors-turn-cautious-us-india-trade-deal-rbi-mpc-2795219-2025-09-29",
      "headline": "Sensex, Nifty close flat as investors turn cautious over US-India trade dealThe S&P BSE Sensex closed 61.52 points lower to end at 80,364.94, while the NSE Nifty50 lost 19.80 points to close at 24,634.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/moodys-rating-india-baa3-stable-outlook-trump-tariff-us-trade-talk-credit-agency-2795201-2025-09-29",
      "headline": "Moody's keeps India's Baa3 rating unchanged with stable outlookMoody's said India's strengths include its large and fast-growing economy, a sound external position, and a stable domestic financing base for fiscal deficits. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/beyond-metros-how-festive-cheer-boosts-real-estate-demand-in-tier-2-cities-2795122-2025-09-29",
      "headline": "Beyond metros: How festive cheer boosts real estate demand in Tier-2 citiesWhile metros grab most of the headlines, smaller cities are quietly stealing the show. With festivals around the corner, Tier-2 cities are witnessing a strong spike in property interest and sales."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/lufthansa-layoffs-german-airline-job-cut-4000-people-struggle-economy-recession-2795123-2025-09-29",
      "headline": "Lufthansa layoffs: German airline plans 4,000 job cuts over next 5 yearsThe job cuts will mainly affect administrative roles rather than operational positions such as pilots, cabin crew or ground staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/does-epfos-new-ecr-system-simplify-return-filing-for-employers-2795060-2025-09-29",
      "headline": "Does EPFO's new ECR system simplify return filing for employers?The Employees' Provident Fund Organisation (EPFO) has launched a revamped electronic challan-cum-return (ECR) system, aiming to make return filing easier and more accurate for employers. But does it really simplify the process?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-rbi-announce-a-rate-cut-in-the-upcoming-mpc-meeting-here-what-to-expect-2795045-2025-09-29",
      "headline": "Will RBI announce a rate cut in the upcoming MPC meeting? Here's what to expectThe Reserve Bank of India's Monetary Policy Committee begins its three-day meeting to decide whether it is time to cut interest rates or hold steady. With inflation easing and growth signals mixed, all eyes are on what the central bank does next."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-rishab-shetty-pan-indian-film-2025-1000-crore-2795245-2025-09-30",
      "headline": "Kantara Chapter 1: The last Rs 1,000 crore hope for Indian cinema in 2025 With the success of its predecessor and a bold prequel set in the Kadamba era, Rishab Shetty's 'Kantara Chapter 1' is the most anticipated Rs 1,000 crore contender of 2025 in Indian cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/they-call-him-og-box-office-collection-day-5-pawan-kalyan-action-entertainer-sees-slight-dip-2795496-2025-09-30",
      "headline": "They Call Him OG box office Day 5: Pawan Kalyan's action entertainer sees slight dip Pawan Kalyan's 'They Call Him OG' continues its strong box office run, earning Rs 147.70 crore in five days, with Day 5 collecting Rs 7.50 crore. The film, also marking Emraan Hashmi's Telugu debut, has been praised for its high-octane action and Pawan Kalyan's commanding screen presence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhanashree-verma-claims-yuzvendra-chahal-cheated-on-her-two-months-into-marriage-2795481-2025-09-30",
      "headline": "Dhanashree Verma claims Yuzvendra Chahal cheated on her two months into marriage Dhanashree Verma has opened up about her troubled marriage with cricketer Yuzvendra Chahal, claiming infidelity just two months after their wedding. The couple divorced after three years, with Dhanashree focusing on personal well-being amidst public speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jk-rowling-calls-emma-watson-ignorant-over-transgender-rights-dispute-2795457-2025-09-30",
      "headline": "She's ignorant of being ignorant: JK Rowling to Emma Watson over trans rights row JK Rowling publicly responded to Emma Watson's comments on their relationship and transgender rights, calling her ignorant. The 'Harry Potter' author accused Watson of fuelling controversy during a period of personal threats and heightened security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-bachchan-stuns-at-paris-fashion-week-2025-selfie-with-actor-simone-ashley-goes-viral-2795477-2025-09-30",
      "headline": "Aishwarya Rai stuns at Paris Fashion, selfie with actor Simone Ashley goes viral Aishwarya Rai Bachchan made a dazzling comeback at Paris Fashion Week 2025, walking the ramp alongside top Hollywood stars and international supermodels. Her stunning black diamond-embellished outfit and signature red lips reaffirmed her status as a global style icon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/nicole-kidman-keith-urban-separation-nearly-20-years-marriage-2795430-2025-09-30",
      "headline": "Nicole Kidman and Keith Urban separate after nearly 20 years of marriage Nicole Kidman and Keith Urban have separated following almost two decades together. The couple share two children and have been married since 2006. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jay-kelly-trailer-george-clooney-plays-fading-movie-icon-adam-sandler-his-manager-2795364-2025-09-29",
      "headline": "Jay Kelly trailer: George Clooney plays fading movie icon, Adam Sandler his manager Actor George Clooney returns in 'Jay Kelly', a dramedy about fame and family struggles. The film explores personal reckonings and complex relationships against a Hollywood backdrop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-wishes-cutie-wife-sneha-reddy-with-vacation-pics-2795332-2025-09-29",
      "headline": "Allu Arjun wishes cutie wife Sneha Reddy with vacation pics Actor Allu Arjun celebrated wife Sneha Reddy's birthday with a heartfelt social media wish. The actor shared scenic pictures from their vacation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saad-bilgrami-several-dhadak-2-scenes-left-him-emotional-crying-after-shoot-2795323-2025-09-29",
      "headline": "Saad Bilgrami says several Dhadak 2 scenes left him emotional, crying after shoot Actor Saad Bilgrami shared in an exclusive conversation that it was very difficult for him to shoot certain emotionally charged scenes in the film. He plays Ronnie in the romantic film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yashwant-sardeshpande-kannada-theatre-artist-dies-62-bengaluru-2795313-2025-09-29",
      "headline": "Veteran theatre artist and filmmaker Yashwant Sardeshpande dies of heart attack Yashwant Sardeshpande, a celebrated Kannada theatre artist and filmmaker, died of a heart attack in Bengaluru. His death marks a significant loss to Karnataka's cultural and performing arts community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-kantara-chapter-1-chennai-event-cancelled-after-stampede-at-vijays-rally-2795314-2025-09-29",
      "headline": "Rishab Shetty's Kantara Chennai event cancelled after stampede at Vijay's rally Rishab Shetty's 'Kantara Chapter 1' promotional event was cancelled in Chennai after a stampede at Vijay's rally left 41 dead. The production house shared a statement and condemned the tragic incident. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-actor-ahaan-panday-to-feature-in-ali-abbas-zafar-next-with-yrf-report-2795240-2025-09-29",
      "headline": "Saiyaara actor Ahaan Panday to feature in Ali Abbas Zafar's next with YRF: Report 'Saiyaara' actor Ahaan Panday has signed his second film with director Ali Abbas Zafar and producer Aditya Chopra according to a report. The untitled project is expected to begin filming in early 2026."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rajeev-sen-ex-wife-charu-pandal-hopping-daughter-ziana-kolkata-pics-2795311-2025-09-29",
      "headline": "Rajeev Sen, ex-wife Charu go pandal hopping with daughter in Kolkata. See pics Rajeev Sen and Charu Asopa celebrated Navratri together in Kolkata with their daughter Ziana. Charu shared photos of them exploring various pandas as a family. Their reunion comes after their divorce in 2023.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shin-chan-super-hot-spicy-kasukabe-dancers-proves-bo-chan-no-sidekick-2795241-2025-09-29",
      "headline": "Shin-chan's Spicy Kasukabe Dancers proves Bo-chan is no sidekick In this week's Animania we discuss how Bo-chan takes centre stage in 'Shin-chan: Super Hot! Spicy Kasukabe Dancers', proving the quietest characters can leave the loudest impact. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/cardi-b-am-i-the-drama-album-tops-us-billboard-200-after-seven-years-2795252-2025-09-29",
      "headline": "After seven years, Cardi B lands 2nd Billboard No 1 with Am I the Drama? Singer Cardi B's new album 'Am I the Drama?' debuts at No 1 on the Billboard 200. This marks her second chart-topping release and the biggest week for an R&B/hip-hop album by a woman in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-raja-saab-trailer-prabhas-faces-sanjay-dutt-in-mysterious-haunted-mansion-2795301-2025-09-29",
      "headline": "The Raja Saab trailer: Prabhas fights ghosts and ghouls in haunted mansion The trailer of the horror-comedy 'The Raja Saab' released on September 29, 2025. The film features actors Prabhas, Sanjay Dutt, Malavika Mohanan and Nidhhi Agerwal in pivotal roles.\r\n "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/karan-johar-produces-indias-first-fashion-reality-show-pitch-to-get-rich-2795286-2025-09-29",
      "headline": "Karan Johar produces India's first fashion reality show India is set to launch its first fashion reality show aimed at showcasing homegrown designers on a global platform with support from Bollywood stars and major investors. The series highlights the journey of emerging talents from smaller towns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/thamma-song-tum-mere-na-huye-na-sahi-ayushmann-khurrana-rashmika-mandanna-2795244-2025-09-29",
      "headline": "Thamma's Tum Mere Na Huye stars Ayushmann, Rashmika in glam avatar The first song from 'Thamma' titled 'Tum Mere Na Huye, Na Sahi' is finally out. Featuring Rashmika Mandanna and Ayushmann Khurrana, the song blends heartbreak with eye-catching dance moves. Have a look. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/riddhima-kapoor-sahni-shares-adorable-mother-daughter-moment-with-samara-2795146-2025-09-29",
      "headline": "My Sam: Riddhima Kapoor Sahni shares adorable mother-daughter moment with Samara Riddhima Kapoor Sahni shared a heartfelt mother-daughter moment with her daughter Samara on Instagram. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/viable-pathway-to-long-term-and-sustainable-peace-pm-modi-welcomes-trumps-gaza-plan-2795483-2025-09-30",
      "headline": "Viable pathway to long-term peace: PM Modi welcomes Trump's Gaza planOn Monday, the White House released a 20-point document that called for an immediate ceasefire, an exchange of hostages held by Hamas for Palestinian prisoners held by Israel, a staged Israeli withdrawal from Gaza, Hamas disarmament and a transitional government led by an international body."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-p-chidambaram-mumbai-terror-attack-international-pressure-condoleeza-rice-bjp-reactions-2795429-2025-09-30",
      "headline": "US stopped us: Chidambaram's big 26/11 admission, BJP says too little, too lateAt the time of the attacks in 2008, the Congress veteran leader was the Union Home Minister. He revealed that the then US Secretary of State Condoleeza Rice had visited India to meet him and the Prime Minister, asking them not to react to the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/gandhi-statue-in-london-vandalised-indian-mission-strongly-condemns-violent-act-glbs-2795424-2025-09-30",
      "headline": "Shameful act: India after Mahatma Gandhi statue vandalised in LondonThe plinth of the iconic statue, which depicts the Father of the Nation in a seated meditative pose, was discovered daubed with some disturbing graffiti. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-praises-pakistans-sharif-army-chief-munir-for-backing-gaza-plan-2795463-2025-09-30",
      "headline": "With us from beginning: Trump praises Pak's Sharif, Munir for backing Gaza planTrump's remarks highlight Pakistan's renewed diplomatic push with Washington as the US seeks Muslim world backing for its Gaza initiative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/why-howard-gardner-thinks-classrooms-will-be-obsolete-by-2050-and-why-india-should-listen-2795460-2025-09-30",
      "headline": "Why classrooms may vanish by 2050, and what India must do nowAt a recent Harvard forum, Howard Gardner predicted that the traditional classroom model may become obsolete by 2050, thanks to AI. In India, where rigid exams still rule, this isn't just a prediction, it's a warning. The question is this: Will we evolve, or be left behind in this BIG education revolution?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trumps-20-point-gaza-peace-plan-backed-by-netanyahu-what-to-know-glbs-2795414-2025-09-30",
      "headline": "Inside Trump's 20-point plan for New Gaza: No Israeli occupation, Hamas to goThe White House unveiled a 20-point Gaza peace plan, proposing an immediate ceasefire, hostage and prisoner exchanges, demilitarisation, humanitarian aid, international governance led by Trump and Tony Blair, and a long-term framework for Gaza's reconstruction.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/openai-is-secretly-building-a-tiktok-style-app-where-every-video-is-ai-generated-2795493-2025-09-30",
      "headline": "OpenAI is secretly building a TikTok-style app where every video is AI generatedAccording to Wired, OpenAI is preparing to launch a platform similar to TikTok, but with one major difference - every single clip on it will be created by artificial intelligence. The project is said to be powered by OpenAI's upcoming video model, Sora 2, which the company is yet to make public."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/veteran-bjp-leader-vijay-kumar-malhotra-dies-at-93-pm-modi-pays-tribute-2795473-2025-09-30",
      "headline": "Veteran BJP leader Vijay Kumar Malhotra dies at 93; PM Modi pays tributeVeteran BJP leader Vijay Kumar Malhotra dies at 93; PM Modi pays tribute"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-rishab-shetty-pan-indian-film-2025-1000-crore-2795245-2025-09-30",
      "headline": "Kantara Chapter 1: The last Rs 1,000 crore hope for Indian cinema in 2025With the success of its predecessor and a bold prequel set in the Kadamba era, Rishab Shetty's 'Kantara Chapter 1' is the most anticipated Rs 1,000 crore contender of 2025 in Indian cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-elections-2025-final-voter-list-to-be-out-today-poll-schedule-likely-by-oct-6-7-2795485-2025-09-30",
      "headline": "Bihar elections: Final voter list to be out today, poll schedule likely by Oct 6-7The Assembly's current term ends on November 23. In 2020, the EC had announced results nearly 20 days before the tenure expired, and a similar timeline is expected this time as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/gurugram/story/gurugram-software-engineer-kills-wife-suicide-police-investigation-2795459-2025-09-30",
      "headline": "Gurugram techie strangles wife, sends friend video message before hanging himselfA software engineer in Gurugram allegedly strangled his wife before dying by suicide. Police have launched an investigation into the circumstances surrounding the deaths."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-threatens-to-block-funds-if-mamdani-wins-nyc-mayoral-race-glbs-2795431-2025-09-30",
      "headline": "He's going to have problems: Trump's fund-freeze threat against Zohran MamdaniDonald Trump lashed out at New York mayoral frontrunner Zohran Mamdani, calling him a self-proclaimed Communist and warning he would face funding blockades if elected. Mamdani hit back, saying Trump was going through the stages of grief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-india-vs-sri-lanka-opening-match-guwahati-curtain-raiser-2795136-2025-09-30",
      "headline": "After 12 years, India set for Women's World Cup return in cricket's grand festivalThe 2025 ICC Women's World Cup is set to take place from September 30 to November 2, with matches being hosted across India and Colombo. Australia, the defending champions, have claimed the title seven times, while India will be aiming to secure their first-ever ICC Women's World Cup triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jk-rowling-calls-emma-watson-ignorant-over-transgender-rights-dispute-2795457-2025-09-30",
      "headline": "She's ignorant of being ignorant: JK Rowling to Emma Watson over trans rights rowJK Rowling publicly responded to Emma Watson's comments on their relationship and transgender rights, calling her ignorant. The 'Harry Potter' author accused Watson of fuelling controversy during a period of personal threats and heightened security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bilaspur-engineer-suicide-rape-allegation-online-girlfriend-2795448-2025-09-30",
      "headline": "Accused of rape by girlfriend, techie dies by suicide; betrayed in love, says noteAccording to the police, the 29-year-old victim met the woman through a matrimonial website while working in Noida. The relationship grew closer over time, but a rape allegation was later filed against him by the woman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhanashree-verma-claims-yuzvendra-chahal-cheated-on-her-two-months-into-marriage-2795481-2025-09-30",
      "headline": "Dhanashree Verma claims Yuzvendra Chahal cheated on her two months into marriageDhanashree Verma has opened up about her troubled marriage with cricketer Yuzvendra Chahal, claiming infidelity just two months after their wedding. The couple divorced after three years, with Dhanashree focusing on personal well-being amidst public speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-4-up-cops-dance-chug-beer-at-criminals-birthday-bash-in-bar-suspended-ghaziabad-police-2795436-2025-09-30",
      "headline": "Video: 4 UP cops dance, chug beer at criminal's birthday bash in bar; suspendedThe incident took place at Rose Bar in Sahibabad, and the suspension was ordered by DCP Trans-Hindon Nimish Patil. A departmental probe and CCTV examination are underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/nicole-kidman-keith-urban-separation-nearly-20-years-marriage-2795430-2025-09-30",
      "headline": "Nicole Kidman and Keith Urban separate after nearly 20 years of marriageNicole Kidman and Keith Urban have separated following almost two decades together. The couple share two children and have been married since 2006. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistn-tilak-varma-shivam-dube-ms-dhoni-yuvraj-2795486-2025-09-30",
      "headline": "In Tilak Varma-Shivam Dube's epic stand, shades of MS Dhoni-Yuvraj Singh duo lingerIn Dubai's City of Gold, Tilak Varma and Shivam Dube shone under pressure, forging a partnership that echoed Dhoni and Yuvraj. Their calm yet explosive stand carried India past Pakistan to Asia Cup glory, thus establishing their legacy within Indian cricket history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-rajasthan-risks-contempt-after-losing-indias-longest-probate-case-2795182-2025-09-29",
      "headline": "Why Rajasthan risks contempt after losing India's longest probate caseThe Supreme Court's Khetri Estate ruling redefines property rights in the country, reshaping state power over wills and private disputes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-bachchan-stuns-at-paris-fashion-week-2025-selfie-with-actor-simone-ashley-goes-viral-2795477-2025-09-30",
      "headline": "Aishwarya Rai stuns at Paris Fashion, selfie with actor Simone Ashley goes viralAishwarya Rai Bachchan made a dazzling comeback at Paris Fashion Week 2025, walking the ramp alongside top Hollywood stars and international supermodels. Her stunning black diamond-embellished outfit and signature red lips reaffirmed her status as a global style icon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-wont-occupy-gaza-no-one-will-be-forced-to-flee-trump-standing-beside-netanyahu-announces-gaza-deal-glbs-2795411-2025-09-30",
      "headline": "Netanyahu agrees to Trump's plan to end Gaza war, Hamas support in questionThe White House released Trump's 20-point plan. The proposal does not require Palestinians to leave Gaza and calls for an immediate ceasefire once both sides sign on."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-youtuber-felix-gerald-held-for-spreading-fake-news-on-tvk-vijay-rally-karur-stampede-2795468-2025-09-30",
      "headline": "YouTuber Felix Gerald arrested for allegedly spreading fake news on Karur stampedeTamil Nadu YouTuber Felix Gerald, who runs the RedPix channel, was arrested by Cyber Crime Police for allegedly uploading fake news linked to the Karur stampede during Vijay's Tamilaga Vettri Kazhagam rally."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/neet-aspirant-suicide-bilaspur-exam-pressure-investigation-2795458-2025-09-30",
      "headline": "NEET aspirant shoots himself dead, family says he was in extreme stressThe incident took place on September 27. Sanskar was alone in his room when family members heard a gunshot. He was already dead by the time they found him."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistn-tilak-varma-shivam-dube-ms-dhoni-yuvraj-2795486-2025-09-30",
      "headline": "In Tilak Varma-Shivam Dube's epic stand, shades of MS Dhoni-Yuvraj Singh duo linger In Dubai's City of Gold, Tilak Varma and Shivam Dube shone under pressure, forging a partnership that echoed Dhoni and Yuvraj. Their calm yet explosive stand carried India past Pakistan to Asia Cup glory, thus establishing their legacy within Indian cricket history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-ind-vs-pak-syed-kirmani-politics-cricket-2795482-2025-09-30",
      "headline": "I am ashamed: World Cup winner slams politics mixing with cricket at Asia Cup Syed Kirmani has criticised the mixing of politics and sport during the Asia Cup, warning that the current era lacks the camaraderie and gentlemanly spirit of earlier times. The 1983 World Cup winner urged players to focus on cricket and play the game with sporting spirit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-maxwell-freak-inury-australia-vs-new-zealand-2795478-2025-09-30",
      "headline": "Maxwell suffers freak injury in nets, likely to miss India T20Is with broken arm Australia all-rounder Glenn Maxwell has been ruled out of the New Zealand T20Is due to a freak injury in the nets. He is likely to be ruled out of the 5-match T20I series against India as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-vs-sri-lanka-match-preview-2795443-2025-09-30",
      "headline": "IND vs SL: Harmanpreet Kaur's India eyes winning start to home Women's World Cup India vs Sri Lanka, Women's World Cup: With home support and strong form on their side, the Indian women's cricket team will look to begin their ODI World Cup campaign on a winning note when they face Sri Lanka in the opener in Guwahati on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-india-vs-sri-lanka-opening-match-guwahati-curtain-raiser-2795136-2025-09-30",
      "headline": "After 12 years, India set for Women's World Cup return in cricket's grand festival The 2025 ICC Women's World Cup is set to take place from September 30 to November 2, with matches being hosted across India and Colombo. Australia, the defending champions, have claimed the title seven times, while India will be aiming to secure their first-ever ICC Women's World Cup triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-suryakumar-yadav-hardik-receive-warm-welcome-in-mumbai-after-title-win-2795405-2025-09-29",
      "headline": "Asia Cup: Suryakumar Yadav, Hardik receive warm welcome in Mumbai after title win Team India's finest, skipper Suryakumar Yadav and star all-rounder Hardik Pandya received a rousing response as they returned to the Mumbai airport following their triumph at the Asia Cup, downing Pakistan to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-historic-t20i-series-win-west-indies-largest-margin-associate-team-2795402-2025-09-29",
      "headline": "2nd T20I: Nepal secure historic series win vs West Indies with 90-run victory Nepal achieved a historic milestone on Monday (September 29), securing their first-ever T20I series win over a full-member nation by dominating former world champions West Indies in the second match in Sharjah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-tilak-varma-rousing-welcome-hyderabad-asia-cup-heroics-2795395-2025-09-29",
      "headline": "Watch: Tilak Varma receives rousing welcome in Hyderabad after Asia Cup heroics India's Asia Cup 2025 final hero, Tilak Varma, received a rapturous welcome from fans as he returned to Hyderabad on Monday. The 21-year-old southpaw, who scored an unbeaten 69 to seal victory against Pakistan, was greeted with thunderous cheers at Shamshabad Airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-women-world-cup-in-india-watershed-moment-cricket-sachin-tendulkar-2795389-2025-09-29",
      "headline": "Women's World Cup in India watershed moment for the game: Sachin Tendulkar Sachin Tendulkar believes the ICC Women's World Cup in India marks a pivotal moment for women's cricket, calling on the nation to embrace it as a catalyst for fresh aspirations and equal recognition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-praises-india-asia-cup-win-team-character-final-2795376-2025-09-29",
      "headline": "Gutted to miss final but Indian team showed character: Hardik on Asia Cup win Hardik Pandya was understandably \"gutted\" to have missed the Asia Cup final against Pakistan due to a niggle, but he found comfort in the team's title triumph, saying such tight chases will stand the side in good stead for the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-2025-harmanpreet-kaur-india-under-no-pressure-title-drought-2795368-2025-09-29",
      "headline": "India are under no pressure: Harmanpreet confident of winning Women's World Cup India women's cricket captain Harmanpreet Kaur expresses strong confidence ahead of their first ODI World Cup match at home. The team aims to leverage recent successes and fan support to make history in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-historic-t20i-series-win-west-indies-largest-margin-associate-team-2795402-2025-09-29",
      "headline": "2nd T20I: Nepal secure historic series win vs West Indies with 90-run victory Nepal achieved a historic milestone on Monday (September 29), securing their first-ever T20I series win over a full-member nation by dominating former world champions West Indies in the second match in Sharjah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-tilak-varma-rousing-welcome-hyderabad-asia-cup-heroics-2795395-2025-09-29",
      "headline": "Watch: Tilak Varma receives rousing welcome in Hyderabad after Asia Cup heroics India's Asia Cup 2025 final hero, Tilak Varma, received a rapturous welcome from fans as he returned to Hyderabad on Monday. The 21-year-old southpaw, who scored an unbeaten 69 to seal victory against Pakistan, was greeted with thunderous cheers at Shamshabad Airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-women-world-cup-in-india-watershed-moment-cricket-sachin-tendulkar-2795389-2025-09-29",
      "headline": "Women's World Cup in India watershed moment for the game: Sachin Tendulkar Sachin Tendulkar believes the ICC Women's World Cup in India marks a pivotal moment for women's cricket, calling on the nation to embrace it as a catalyst for fresh aspirations and equal recognition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-praises-india-asia-cup-win-team-character-final-2795376-2025-09-29",
      "headline": "Gutted to miss final but Indian team showed character: Hardik on Asia Cup win Hardik Pandya was understandably \"gutted\" to have missed the Asia Cup final against Pakistan due to a niggle, but he found comfort in the team's title triumph, saying such tight chases will stand the side in good stead for the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-2025-harmanpreet-kaur-india-under-no-pressure-title-drought-2795368-2025-09-29",
      "headline": "India are under no pressure: Harmanpreet confident of winning Women's World Cup India women's cricket captain Harmanpreet Kaur expresses strong confidence ahead of their first ODI World Cup match at home. The team aims to leverage recent successes and fan support to make history in the tournament."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}