{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-capital-shares-listing-33-percent-premium-misses-gmp-nse-bse-rs-351-2605395-2024-09-24",
      "headline": "Northern Arc Capital shares list at 33% premium, misses GMP Northern Arc Capital listing: The shares opened at Rs 351, with a premium of 33.5% over the IPO price of Rs 263 per share on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-record-high-markets-2605385-2024-09-24",
      "headline": "Sensex hits all-time high, crosses 85,000; Nifty nears 26,000The S&P BSE Sensex was up 80.74 points to 85,009.35, while the NSE Nifty50 added 29.15 points to 25,968.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-near-record-highs-profit-booking-2605374-2024-09-24",
      "headline": "Sensex, Nifty slip from record highs amid rising Middle East tensionsThe S&P BSE Sensex was down 107.07 points to 84,821.54 at around 9:16 am, while the NSE Nifty50 fell 23.50 points to trade at 25,915.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anmol-ambani-fine-rs-1-crore-sebi-reliance-home-finance-krishnan-gopalakrishnan-2605129-2024-09-23",
      "headline": "Sebi fines Anmol Ambani Rs 1 crore for lapses in Reliance Home Finance case Sebi also fined Krishnan Gopalakrishnan, the Chief Risk Officer of Reliance Housing Finance, Rs 15 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-study-fo-traders-7-percent-made-profit-in-last-3-years-93-percent-loss-2605111-2024-09-23",
      "headline": "Only 7% of F&O traders made profit in last 3 years, says Sebi studyAccording to the Sebi study, 1.13 crore retail traders in F&O markets collectively lost Rs 1.81 lakh crore during this period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-key-takeaways-from-drhp-ntpc-share-price-target-icici-securities-2605071-2024-09-23",
      "headline": "NTPC Green Energy IPO: Key takeaways from DRHP, NTPC share price targetNTPC Green Energy aims to raise Rs 10,000 crore through this public issue, which will consist solely of a fresh issue without any offer-for-sale component."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-positive-investor-sentiment-foreign-inflows-us-economy-federal-reserve-2604983-2024-09-23",
      "headline": "Sensex ends nearly 400 points higher, Nifty above 25,900The S&P BSE Sensex was down 384.30 points at the closing bell, while the NSE Nifty50 gained 148.10 points to settle at 25,939.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dotpe-security-lapse-api-hack-puts-sensitive-data-of-popular-restaurants-social-at-risk-2604964-2024-09-23",
      "headline": "X user highlights API flaw in DotPe, removes post after legal noticeAccording to tweets shared by social media users, DotPe's entire API was left public, meaning anyone could access sensitive information without any authentication."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-ceo-jensen-huang-ai-india-moment-pm-modi-us-visit-meet-tech-leaders-2604894-2024-09-23",
      "headline": "'This is India's moment': Nvidia's Jensen Huang after meeting PM Modi in USNvidia CEO Jensen Huang was one of 15 tech leaders who met with PM Modi during his visit to the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krn-heat-exchanger-ipo-details-price-band-issue-size-santosh-kumar-yadav-rajasthan-farmer-2604879-2024-09-23",
      "headline": "KRN IPO: Key details of Rs 340 crore public issue from Rajasthan farmer's sonThe IPO of KRN Heat Exchanger is the journey of Santosh Kumar Yadav, a farmer's son from Tijara, Rajasthan, from a small town to leading a major manufacturing company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manba-finance-ipo-subscribe-skip-good-bad-expert-review-check-gmp-price-band-details-2604849-2024-09-23",
      "headline": "Should you subscribe Manba Finance IPO: Check GMP, price band, detailsManba Finance IPO: The IPO is fresh issue of 1.26 crore shares and closes for subscription on September 25, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warren-buffett-cash-pile-is-he-losing-on-gains-investor-samir-arora-viral-post-2604822-2024-09-23",
      "headline": "Is Warren Buffett's cash pile costing him billions in missed gains? Warren Buffett has amassed a cash reserve of about $280 billion after selling shares in companies like Apple and Bank of America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ipo-gains-book-profit-on-listing-day-wait-for-long-term-samco-securities-explained-2604799-2024-09-23",
      "headline": "Riding high on IPO listing gains? Here's why you should book profitsRecent IPOs have brought impressive gains, but do those initial highs really last? Investors might want to think carefully about when to cash in on their profits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-rate-rationalisation-gom-to-discuss-slab-rate-tweaks-on-september-25-samrat-chaudhary-2604794-2024-09-23",
      "headline": "GST rate rationalisation: GOM to discuss slab, rate tweaks on September 25The meeting, which will take place in Goa, is part of the ongoing efforts to streamline and rationalise the GST structure. This panel, known as the Group of Ministers (GoM), is led by Bihar Deputy Chief Minister Samrat Chaudhary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cochin-shipyard-rvnl-ireda-among-7-psu-stocks-in-asm-framework-details-here-2604788-2024-09-23",
      "headline": "Cochin Shipyard, RVNL, IREDA among 7 PSU stocks in ASM framework. Details hereThe ASM framework classifies stocks based on several parameters, including price volatility and delivery percentages, aiming to encourage caution among investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bhel-share-price-today-rising-2-percent-increase-rs-6100-crore-project-ntpc-2604777-2024-09-23",
      "headline": "BHEL shares gain 2% after winning Rs 6,100 crore project from NTPCAt 10:35 am, BHEL's stock was trading at Rs 271.25, reflecting a gain of 1.92%, on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-power-share-price-today-upper-circuit-fourth-straight-session-2604762-2024-09-23",
      "headline": "Reliance Power shares soar 5% to upper circuit for 4th straight day. Here's whyThe rally in the company's shares follows the announcement of a board meeting scheduled for September 23, 2024, to discuss a significant fundraising proposal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-shares-jump-9-percent-key-reasons-explained-nokia-samsung-2604749-2024-09-23",
      "headline": "Explained: Why Vodafone Idea shares jumped nearly 9% today Vodafone Idea shares surged sharply in early trade after the company made an announcement regarding a $3.6 billion deal. Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-all-time-highs-positive-momentum-dalal-street-2604729-2024-09-23",
      "headline": "Sensex, Nifty hit all-time highs as bulls dominate Dalal Street The S&P BSE Sensex climbed to an all-time high of 84,843.72 moments after opening, while the NSE Nifty50 rose to 25,910.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/netflix-india-investigated-visa-violations-racial-discrimination-email-indian-government-2604710-2024-09-23",
      "headline": "Netflix India being probed over visa violations, racial discrimination: ReportNetflix's former director of business and legal affairs for India, Nandini Mehta, said she was pursuing a lawsuit in the US against Netflix for alleged wrongful termination as well as racial and gender discrimination - charges the company denies."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hezbollah-rocket-attacks-israeli-strikes-lebanon-middle-east-tensions-gaza-war-2605318-2024-09-24",
      "headline": "Israeli strikes kill 492 in Lebanon, Hezbollah fires 200 rockets in retaliationIsrael-Hezbollah escalation: The ongoing Israel-Hezbollah conflict has triggered fears of an all-out war in the region since the Gaza conflict erupted on October 7 last year as several countries called for restraint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-record-high-markets-2605385-2024-09-24",
      "headline": "Sensex hits all-time high, crosses 85,000; Nifty nears 26,000The S&P BSE Sensex was up 80.74 points to 85,009.35, while the NSE Nifty50 added 29.15 points to 25,968.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-meeting-ukrainian-president-volodymyr-zelenskyy-in-new-york-russia-ukraine-war-2605297-2024-09-24",
      "headline": "PM meets Ukraine's Zelenskyy in US, reiterates support for resolution of conflictPrime Minister Narendra Modi met Ukrainian President Volodymyr Zelenskyy in New York on the sidelines of UNGA and discussed issues related to bilateral ties and the Russia-Ukraine war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/mysuru-land-scam-timeline-details-of-controversy-linked-to-siddaramaiah-2605299-2024-09-24",
      "headline": "Verdict on Siddaramaiah's plea in Mysuru land 'scam' case shortly: A timelineMUDA scam: The case pertains to allegations that compensatory sites were allotted to Siddaramaiah's wife BM Parvathi in an upmarket area in Mysuru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/menopause-wellness-retreats-are-the-new-trend-you-need-to-hop-on-2604711-2024-09-24",
      "headline": "Menopause wellness retreats are the new trend taking over hospitalityMenopause wellness retreats offer women a holistic approach to navigating this phase, combining relaxation, health education, and the comfort of a supportive community. And if the experts are to be believed, it's the next big thing in wellness."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/thane-dombivali-fruit-seller-video-urinates-arrested-shop-market-maharashtra-2605372-2024-09-24",
      "headline": "Thane fruit seller caught on camera urinating in plastic bag, arrestedThe fruit-seller, Ali Khan, continued to sell fruits without washing his hands after urinating inside the plastic bag, a video of which went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/marital-rape-supreme-court-laws-granting-immunity-to-husbands-2605386-2024-09-24",
      "headline": "Marital rape: Top court to hear pleas against laws granting immunity to husbandsThe Supreme Court said it would decide the pleas based on legal principals after noting that the Centre did not file an affidavit making its stand clear on marital rape."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tirupati-laddoos-row-telangana-devotee-tobacco-tirumala-temple-animal-fat-2605321-2024-09-24",
      "headline": "Devotee claims tobacco in Tirupati laddu, shares video amid animal fat rowThe woman, a resident of Andhra Pradesh, claimed she found tobacco wrapped in paper inside a laddu that was given to her as prasadam at Sri Venkateswara temple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-paris-fashion-week-debut-greets-fans-with-flying-kiss-aishwarya-rai-bachchan-eva-longoria-2605361-2024-09-24",
      "headline": "Watch: Alia Bhatt makes Paris Fashion Week debut, greets fans with a flying kiss Alai Bhatt made a stunning debut at the Paris Fashion Week on September 23. The actor looked beautiful in a metallic silver bustier with a jumpsuit. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/badlapur-sexual-assault-maharashtra-accused-alok-shindes-mother-refutes-cops-version-of-encounter-killing-2605296-2024-09-24",
      "headline": "Badlapur rape accused's mother says son killed as part of 'big conspiracy'Speaking to India Today/Aajtak, Alka Shinde, the mother of the Badlapur rape accused, said that her son was killed as part of a \"big conspiracy\" and the family will not accept the body until there is an investigation into the entire incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-nursing-student-abducted-sexually-assaulted-dindigul-2605301-2024-09-24",
      "headline": "Nursing student abducted, sexually assaulted in Tamil NaduThe student was found at Dindigul railway station, where she had approached the police and told them that she had been abducted nearly 50 km from the station and sexually assaulted by a gang."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-jasprit-bumrah-fittest-cricketer-virat-kohli-social-media-2605388-2024-09-24",
      "headline": "R Ashwin responds to Bumrah's 'fittest' remark after after social media stormR Ashwin, speaking in his YouTube show, said it's not fair to compare a fast bowler with a batter as he addressed the furore over Jasprit Bumrah's 'fittest cricketer 'remark. Ashwin said Bumrah is the çrown jewel' of Indian cricket and that the pacer has the right to express his views. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-bajpayee-the-family-man-team-honoured-by-nagaland-minister-temjen-imna-sharib-hashmi-gul-panag-2605375-2024-09-24",
      "headline": "Watch: Manoj Bajpayee, The Family Man team honoured by Nagaland ministerActor Manoj Bajpayee, along with the team of The Family Man 3, was honored by Nagaland's Tourism and Higher Education Minister, Temjen Imna. Grateful for the recognition, Bajpayee expressed his gratitude on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/quad-summit-us-envoy-pm-modi-president-joe-biden-friendship-eric-garcetti-2605330-2024-09-24",
      "headline": "PM Modi is 'most pro-American Prime Minister' in India's history: US envoyUS envoy to India Eric Garcetti described PM Modi as \"the most pro-American prime minister we've ever seen in Indian history\" and praised Biden as \"the most pro-Indian president we've had in US history.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bangladesh-amit-shah-remarks-protest-note-indian-government-muhammad-yunus-2605293-2024-09-24",
      "headline": "Bangladesh lodges protest against Amit Shah's remarks on 'infiltrators'Bangladesh formally protested Home Minister Amit Shah's remarks about Bangladeshi nationals, expressing deep concern and urging India to caution its political leaders against making such statements."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-news-urdu-language-anganwadi-teachers-siddaramaiah-bjp-mudigere-education-department-2605357-2024-09-24",
      "headline": "2 Karnataka districts mandate Urdu for anganwadi teachers, BJP lashes outThe controversy stems from an official order from the Department of Women and Child Welfare, which requires applicants in Mudigere, Chikkamagaluru district, to be proficient in Urdu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-paris-fashion-week-red-gown-walks-the-ramp-2605350-2024-09-24",
      "headline": "Aishwarya Rai stuns in red gown as she walks the ramp at Paris Fashion WeekAishwarya Rai Bachchan walked the ramp at Paris Fashion Week in a balloon-hem red dress. She owned the ramp and won everyone's attention."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-murder-case-husband-of-woman-mahalakshmi-suspects-lover-role-in-murder-2605289-2024-09-24",
      "headline": "Husband of Bengaluru woman found inside fridge suspects lover's role in murderThe estranged husband of the woman, Mahalakshmi, said that she had an illicit relationship with a man, identified as Ashraf, and that he may have been involved in the gruesome murder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/davis-cup-2024-rafael-nadal-carlos-alcaraz-doubles-spain-squad-david-ferrer-2605358-2024-09-24",
      "headline": "'Nadalcaraz' reunion in Davis Cup quarters? Spain captain David Ferrer reactsSpain captain David Ferrer has reacted to the possibility of seeing Rafael Nadal and Carlos Alcaraz teaming up during the Davis Cup quarterfinals. Nadal was included in the Spain squad for the quarters on Monday, September 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/netanyahus-warning-to-lebanese-amid-israeli-strikes-get-out-of-harms-way-2605273-2024-09-23",
      "headline": "Netanyahu's warning to Lebanese amid Israeli strikes: Get out of harm's wayAs the Israeli army intensified its assault against Hezbollah in Lebanon, Israeli Prime Minister Benjamin Netanyahu issued a stern warning to the people of Lebanon. In a video message, he urged citizens to get out of harm's way by leaving their homes, as the army had been advising. He said that once the operation is finished, they can return to their homes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/asha-bhosle-rising-divorce-cases-among-youth-women-pregnancy-ravi-shankar-2605370-2024-09-24",
      "headline": "Asha Bhosle weighs in on rising divorce cases among youth: They get bored easilyAsha Bhosle expressed concern over rising divorce rates among the youth, reflecting on her own marriage. She also discussed women's rights to choose pregnancy, highlighting her own challenges as a working mother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-us-trip-quad-meeting-unga-address-meeting-with-joe-biden-2605315-2024-09-24",
      "headline": "PM Modi departs for Delhi after wrapping up 3-day packed US tripBefore leaving for India, PM Modi held bilateral meetings with Ukrainian President Volodymyr Zelenskyy and Armenian Prime Minister Nikol Pashinyan, among other leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-producer-ravi-shankar-denies-allu-arjun-sukumar-involvement-jani-master-sexual-assault-case-2605276-2024-09-23",
      "headline": "Pushpa producer denies Allu Arjun's involvement in choreographer Jani Master casePushpa producer Ravi Shankar refuted claims of Allu Arjun and filmmaker Sukumar's involvement in the Jani Master sexual assault case, stating that the matter is personal to Jani Master and the alleged victim."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nirmala-sitharaman-ernst-and-young-chartered-accountant-death-anna-sebastian-priyanka-chaturvedi-2605211-2024-09-23",
      "headline": "Nirmala Sitharaman clarifies remarks on EY staffer's death: Not victim shamingUnion finance minister Nirmala Sitharaman responded to Opposition's accusations of \"victim shaming\" over her remarks on the death of a 26-year-old chartered accountant at Ernst & Young (EY). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiran-rao-laapataa-ladies-three-scenes-that-are-special-to-the-director-2605406-2024-09-24",
      "headline": "Kiran Rao's Laapataa Ladies: 3 scenes that are special to the directorDirector Kiran Rao listed her top three scenes from Laapataa Ladies, which has been announced as India's official entry for the Oscars 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/bigg-boss-ott-adnaan-shaikh-ayesha-shaikh-pre-wedding-festivities-sangeet-ceremony-sana-makbul-shivani-kumari-vishal-pandey-2605389-2024-09-24",
      "headline": "BB OTT star Adnaan Shaikh's pre-wedding festivities: Sana Makbul, Shivani attendBigg Boss OTT fame Adnaan Shaikh kick-started pre-wedding festivities with the sangeet ceremony. He is set to marry his longtime girlfriend Ayesha Shaikh on September 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-bajpayee-the-family-man-team-honoured-by-nagaland-minister-temjen-imna-sharib-hashmi-gul-panag-2605375-2024-09-24",
      "headline": "Watch: Manoj Bajpayee, The Family Man team honoured by Nagaland ministerActor Manoj Bajpayee, along with the team of The Family Man 3, was honored by Nagaland's Tourism and Higher Education Minister, Temjen Imna. Grateful for the recognition, Bajpayee expressed his gratitude on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/asha-bhosle-rising-divorce-cases-among-youth-women-pregnancy-ravi-shankar-2605370-2024-09-24",
      "headline": "Asha Bhosle weighs in on rising divorce cases among youth: They get bored easilyAsha Bhosle expressed concern over rising divorce rates among the youth, reflecting on her own marriage. She also discussed women's rights to choose pregnancy, highlighting her own challenges as a working mother."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-citys-rodri-set-to-miss-rest-of-season-with-acl-tear-reports-2605398-2024-09-24",
      "headline": "Manchester City's Rodri set to miss rest of season with ACL tear: ReportsManchester City have suffered a huge blow to their bid to retain the Premier League crown as midfielder Rodri is set to miss the rest of the season due to an anterior cruciate ligament tear. The Spaniard suffered the injury during the draw against Arsenal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-jasprit-bumrah-fittest-cricketer-virat-kohli-social-media-2605388-2024-09-24",
      "headline": "R Ashwin responds to Bumrah's 'fittest' remark after after social media stormR Ashwin, speaking in his YouTube show, said it's not fair to compare a fast bowler with a batter as he addressed the furore over Jasprit Bumrah's 'fittest cricketer 'remark. Ashwin said Bumrah is the çrown jewel' of Indian cricket and that the pacer has the right to express his views. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-india-olympiad-win-garry-kasparov-viswanathan-anand-d-gukesh-2605380-2024-09-24",
      "headline": "Vishy's children are all grown up: Garry Kasparov praises India's Olympiad winFormer world champion Garry Kasparov heaped praise on the Indian contingent after the double gold at the Chess Olympiad. Kasparov claimed that Viswanathan Anand's 'children' had all grown up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2007-final-india-vs-pakistan-ms-dhoni-gautam-gambhir-johannesburg-2605369-2024-09-24",
      "headline": "On This Day: India become inaugural T20 World Cup champions by beating PakistanOn this day in 2007, India defeated arch-rivals Pakistan in a thrilling final to become the inaugural T20 World Cup champions at the Wanderers stadium in Johannesburg. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/davis-cup-2024-rafael-nadal-carlos-alcaraz-doubles-spain-squad-david-ferrer-2605358-2024-09-24",
      "headline": "'Nadalcaraz' reunion in Davis Cup quarters? Spain captain David Ferrer reactsSpain captain David Ferrer has reacted to the possibility of seeing Rafael Nadal and Carlos Alcaraz teaming up during the Davis Cup quarterfinals. Nadal was included in the Spain squad for the quarters on Monday, September 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-2024-25-late-goals-surprises-northeast-united-punjab-fc-mohammedan-sc-2605333-2024-09-24",
      "headline": "Late goals and surprises: Is ISL 2024 the season for the underdogs?The 2024-2025 Indian Super League has kicked off with thrilling last-minute goals, unpredictable match outcomes, and rising competitiveness. New teams like Punjab FC and NorthEast United have shaken up the league, making this season one of the most exciting yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/davis-cup-finals-rafael-nadal-returns-spain-squad-carlos-alcaraz-2605325-2024-09-24",
      "headline": "Rafael Nadal in Spain squad for Davis Cup quarterfinals alongside Carlos AlcarazRafael Nadal will be part of the Spain squad for the Davis Cup finals alongside Carlos Alcaraz, the Royal Spanish Tennis  Federation announced on Monday, September 23. Nadal last competed in the Paris Olympics 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-mohunbagan-super-giants-northeast-united-durand-cup-revenge-kolkata-2605269-2024-09-23",
      "headline": "Mohun Bagan complete Durand revenge after tense 3-2 win over NorthEast UnitedMohun Bagan Super Giants completed a dramatic 3-2 comeback against NorthEast United in an ISL thriller at Salt Lake Stadium, with Jason Cummings' late strike sealing the win after a controversial equalizer by skipper Shubhashish Bose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-olympiad-viswanathan-anand-d-gukesh-bumps-into-airport-humorous-tweet-2605228-2024-09-23",
      "headline": "Vishy Anand bumps into Gukesh after Chess OlympiadChess legend Viswanathan Anand shared a humorous moment with young grandmaster D Gukesh at Budapest airport after Gukesh's second Olympiad gold win. Anand, full of praise, sees Gukesh as a future World Championship contender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-pat-cummins-gamechanger-rishabh-pant-quiet-2605223-2024-09-23",
      "headline": "Pat Cummins focusing on keeping 'gamechanger' Rishabh Pant quietAustralia Test captain Pat Cummins said that he was focused on Rishabh Pant ahead of the Border Gavaskar Trophy. Pant made a sensational Test comeback against Bangladesh and is expected to be crucial in India's success Down Under.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rishabh-pant-vs-ms-dhoni-ravichandran-ashwin-ravindra-jadeja-home-dominance-sledging-room-2605218-2024-09-23",
      "headline": "Rishabh Pant vs MS Dhoni, Ashwin-Jadeja role in home dominance Wicketkeeper-batter Rishabh Pant's stunning Test century against Bangladesh reignited debates about his standing among India's greatest keeper-batters. In the Sledging Room Podcast, experts discussed whether Pant could surpass MS Dhoni as India's top Test wicketkeeper-batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/davis-cup-finals-rafael-nadal-returns-spain-squad-carlos-alcaraz-2605325-2024-09-24",
      "headline": "Rafael Nadal in Spain squad for Davis Cup quarterfinals alongside Carlos AlcarazRafael Nadal will be part of the Spain squad for the Davis Cup finals alongside Carlos Alcaraz, the Royal Spanish Tennis  Federation announced on Monday, September 23. Nadal last competed in the Paris Olympics 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-mohunbagan-super-giants-northeast-united-durand-cup-revenge-kolkata-2605269-2024-09-23",
      "headline": "Mohun Bagan complete Durand revenge after tense 3-2 win over NorthEast UnitedMohun Bagan Super Giants completed a dramatic 3-2 comeback against NorthEast United in an ISL thriller at Salt Lake Stadium, with Jason Cummings' late strike sealing the win after a controversial equalizer by skipper Shubhashish Bose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-olympiad-viswanathan-anand-d-gukesh-bumps-into-airport-humorous-tweet-2605228-2024-09-23",
      "headline": "Vishy Anand bumps into Gukesh after Chess OlympiadChess legend Viswanathan Anand shared a humorous moment with young grandmaster D Gukesh at Budapest airport after Gukesh's second Olympiad gold win. Anand, full of praise, sees Gukesh as a future World Championship contender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-pat-cummins-gamechanger-rishabh-pant-quiet-2605223-2024-09-23",
      "headline": "Pat Cummins focusing on keeping 'gamechanger' Rishabh Pant quietAustralia Test captain Pat Cummins said that he was focused on Rishabh Pant ahead of the Border Gavaskar Trophy. Pant made a sensational Test comeback against Bangladesh and is expected to be crucial in India's success Down Under.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rishabh-pant-vs-ms-dhoni-ravichandran-ashwin-ravindra-jadeja-home-dominance-sledging-room-2605218-2024-09-23",
      "headline": "Rishabh Pant vs MS Dhoni, Ashwin-Jadeja role in home dominance Wicketkeeper-batter Rishabh Pant's stunning Test century against Bangladesh reignited debates about his standing among India's greatest keeper-batters. In the Sledging Room Podcast, experts discussed whether Pant could surpass MS Dhoni as India's top Test wicketkeeper-batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/emotional-daniel-ricciardo-teary-eyed-in-potential-goodbye-from-formula-1-2605215-2024-09-23",
      "headline": "Emotional Daniel Ricciardo 'teary-eyed' in potential goodbye from Formula 1Former Red Bull driver Daniel Ricciardo was emotional after the Singapore GP. The driver was teary-eyed knowing well that the race could have been his final one in Formula One career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/from-nanha-to-star-how-pro-kabaddi-league-transformed-narenders-life-2605189-2024-09-23",
      "headline": "From 'Nanha' to star: How Pro Kabaddi League transformed Narender's lifeIn a small village in Haryana, a young boy nicknamed 'Nanha' spent his days watching older kids practice kabaddi. Little did anyone know that this curious child would one day become one of the sport's rising stars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pcb-connection-camp-gary-kirsten-pride-back-in-cricket-2605188-2024-09-23",
      "headline": "Bring pride back to Pakistan cricket: Gary Kirsten demands 3 vital changesPakistan head coach Gary Kirsten has demanded three major changes in Pakistan cricket after Day 1 of the Connection Camp arranged by the PCB. In the camp, the management and select players sat down together to discuss the roadmap for cricket in Pakistan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/maharashtra-govt-allots-bandra-plot-unutilised-by-sunil-gavaskar-to-ajinkya-rahane-2605187-2024-09-23",
      "headline": "Maharashtra govt allots Bandra plot unutilised by Sunil Gavaskar to Ajinkya RahaneThe Maharashtra cabinet approved a 30-year lease transfer of a 2,000 sq. meter Bandra plot to cricketer Ajinkya Rahane to develop a sports complex. The land was previously allotted to Sunil Gavaskar, who returned it after decades of non-utilization."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-reveals-virat-kohlis-surprise-after-seeing-chennai-test-crowd-on-day-1-2605183-2024-09-23",
      "headline": "R Ashwin reveals Virat Kohli's surprise after seeing Chennai Test crowd on Day 1Ravichandran Ashwin revealed that Virat Kohli was surprised seeing the turnout of the Chennai crowd on the morning of Day 1 of the 1st Test between India and Bangladesh. However, the crowd later turned up in big numbers to support the Indian team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-ravichandran-ashwin-rohit-sharma-age-banter-wife-duleep-trophy-2605178-2024-09-23",
      "headline": "Ashwin recalls age banter with Rohit Sharma after wife's hilarious questionIndia spinner R Ashwin shared a humorous exchange with Rohit Sharma about their age during India's dominant Test win over Bangladesh. Ashwin's stellar all-round performance led India to a 280-run victory, earning him consecutive Player of the Match awards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-r-ashwin-coach-gautam-gambhir-relaxed-rahul-dravid-2605176-2024-09-23",
      "headline": "Coach Gautam Gambhir is a 'relaxed rancho', everybody will love him: R AshwinIndia vs Bangladesh: Speaking after his all-round heroics in the Chennai Test, off-spinner R Ashwin highlighted the difference between 'relaxed' Gautam Gambhir and 'organised' Rahul Dravid. Gambhir tasted success in his first Test assignment as head coach on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-test-cricket-history-rise-turnaround-2000s-virat-kohli-rohit-sharma-2605151-2024-09-23",
      "headline": "More wins than loses: Tracing India's incredible Test cricket journeyNinety-two years after CK Nayudu's men played India's first Test against England at Lord's in 1932, Rohit Sharma's team achieved a historic milestone. With their victory over Bangladesh in Chennai, India now has more wins than losses in Test cricket for the first time. Let's dive into India's journey in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-reveals-virat-kohlis-surprise-after-seeing-chennai-test-crowd-on-day-1-2605183-2024-09-23",
      "headline": "R Ashwin reveals Virat Kohli's surprise after seeing Chennai Test crowd on Day 1Ravichandran Ashwin revealed that Virat Kohli was surprised seeing the turnout of the Chennai crowd on the morning of Day 1 of the 1st Test between India and Bangladesh. However, the crowd later turned up in big numbers to support the Indian team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-ravichandran-ashwin-rohit-sharma-age-banter-wife-duleep-trophy-2605178-2024-09-23",
      "headline": "Ashwin recalls age banter with Rohit Sharma after wife's hilarious questionIndia spinner R Ashwin shared a humorous exchange with Rohit Sharma about their age during India's dominant Test win over Bangladesh. Ashwin's stellar all-round performance led India to a 280-run victory, earning him consecutive Player of the Match awards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-r-ashwin-coach-gautam-gambhir-relaxed-rahul-dravid-2605176-2024-09-23",
      "headline": "Coach Gautam Gambhir is a 'relaxed rancho', everybody will love him: R AshwinIndia vs Bangladesh: Speaking after his all-round heroics in the Chennai Test, off-spinner R Ashwin highlighted the difference between 'relaxed' Gautam Gambhir and 'organised' Rahul Dravid. Gambhir tasted success in his first Test assignment as head coach on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-test-cricket-history-rise-turnaround-2000s-virat-kohli-rohit-sharma-2605151-2024-09-23",
      "headline": "More wins than loses: Tracing India's incredible Test cricket journeyNinety-two years after CK Nayudu's men played India's first Test against England at Lord's in 1932, Rohit Sharma's team achieved a historic milestone. With their victory over Bangladesh in Chennai, India now has more wins than losses in Test cricket for the first time. Let's dive into India's journey in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carlo-ancelotti-real-madrid-manager-longer-stay-contract-300-games-la-liga-2605143-2024-09-23",
      "headline": "Ancelotti reveals desire for longer stay at Real Madrid: I love this jobCarlo Ancelotti, ahead of his 300th game with Real Madrid, expressed his desire to continue with the club, despite fans speculating if his 2026 contract expiry will also mark the end of his illustrious managerial career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-olympiad-viswanathan-anand-interview-gold-medal-soviet-teams-2605112-2024-09-23",
      "headline": "India's dominant Chess Olympiad win reminds Viswanathan Anand of Soviet teamsChess Olympiad 2024: Speaking to India Today, legendary Viswanathan Anand said he was lost for words to contextualise India's dominance in the men's section in Budapest. India won the gold medal with 21 points, four more than their nearest rivals. The women's team also scripted history by winning gold. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-world-championship-ding-liren-viswanathan-anand-2605081-2024-09-23",
      "headline": "Gukesh favourite to clinch World Championship vs Ding Liren, hints Vishy AnandD Gukesh is the favourite to win the World Championship against Ding Liren hinted legendary Viswanathan Anand. Speaking to IndiaToday in an exclusive interview, Anand said that Gukesh is performing at a much higher level than the rest.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-should-learn-professionalism-from-bcci-kamran-akmal-2605080-2024-09-23",
      "headline": "Pakistan Cricket Board should learn professionalism from BCCI: Kamran AkmalKamran Akmal said that the Pakistan cricket board should learn professional from the BCCI. He also said that Pakistan Cricket's ego is leading to their downfall. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}