{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-check-expected-salary-hike-fitment-factor-and-key-faqs-2670704-2025-01-27",
      "headline": "8th Pay Commission: Check expected salary hike, and key FAQs8th Pay Commission: The government will soon appoint a chairman and two members to the panel to recommend changes in the pay structure of central government employees."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-investors-lose-rs-10-lakh-crore-whats-ahead-for-dalal-street-sensex-nifty-2670712-2025-01-27",
      "headline": "Stock market crash: Investors lose Rs 10 lakh crore. What's ahead for D-Street? Investors on Dalal Street faced losses as stock markets continued to decline, bringing the market capitalisation of all listed companies on the Bombay Stock Exchange (BSE) down. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/unified-pension-scheme-central-government-scheme-check-eligibility-benefits-and-other-details-2670640-2025-01-27",
      "headline": "Unified Pension Scheme: Check eligibility, benefits and other details hereUnified Pension Scheme: The UPS was approved by the Union Cabinet on August 24, 2024 for nearly 23 lakh central government employees and aims to provide an assured pension benefit for the employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-invites-applications-open-for-new-sebi-chief-who-will-succeed-madhabi-puri-buch-2670636-2025-01-27",
      "headline": "Who will succeed Madhabi Puri Buch? Applications open for new Sebi chiefNew Sebi Chief: The Ministry of Finance has invited applications for the post, with the last date for submission being February 17."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-falls-over-800-points-3-reasons-why-stock-market-is-falling-today-2670616-2025-01-27",
      "headline": "Sensex tanks over 800 points. 3 reasons why stock market is falling todayShare market crash: The S&P BSE Sensex fell 818.36 points to 75,372.10, while the NSE Nifty50 dropped by 257.35 points to 22,834.85 as of 10:35 AM."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-stock-market-sensex-nifty-extend-losses-it-and-metal-stocks-drag-markets-down-2670593-2025-01-27",
      "headline": "Sensex, Nifty extend losses; IT and metal stocks drag markets downStock Market Today: The S&P BSE Sensex tanked 378.29 points to 75,812.17, while the NSE Nifty50 was down by 92.40 points to 22,999.80 as of 9:45 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-to-expect-from-senex-nifty-will-bears-dominate-stock-market-5-things-investors-should-know-2670388-2025-01-26",
      "headline": "Will bears dominate stock market next week? 5 things investors should knowCorporate earnings and key economic data from around the world will likely shape the direction of the stock market, keeping investors on their toes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/70-hour-workweek-are-indians-working-more-or-less-than-the-world-report-work-life-balance-debate-2670331-2025-01-26",
      "headline": "70-hour workweek: Are Indians working more or less than the world?70-hour workweek: It started with Infosys founder Naryana Murthy's statement that young Indians should work 70-hour workweeks for India to develop, which was met with a lot of flak. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-middle-class-expectations-5-top-expectations-for-tax-relief-savings-growth-2670054-2025-01-25",
      "headline": "Budget 2025: 5 top middle-class expectations for tax relief and savings growthExperts suggest scrapping the old tax regime and rationalising the income tax slabs under the new regime, would go a long way in making income tax simpler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-fitment-factor-186-percent-hike-in-monthly-pensions-find-out-how-2669984-2025-01-25",
      "headline": "8th Pay Commission may give a 186% boost to pensions. Find out how The fitment factor plays an important role in calculating the updated pay and benefits and is likely to be in the range between 2.28 and 2.86 for the 8th Pay Commission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stuck-in-middle-income-trap-fareed-zakaria-explain-reason-behind-china-economic-crisis-davos-wef-2669724-2025-01-24",
      "headline": "Stuck in middle-income trap: Fareed Zakaria decodes China's economic crisisFareed Zakaria said that China's economy is not going to grow any time at the six, seven, eight percent that it was growing at previously. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/minimum-credit-score-for-getting-personal-loan-check-details-here-2669673-2025-01-24",
      "headline": "How to achieve minimum credit score for getting personal loan? Details hereThe higher the credit score, the greater are the chances for the approval of your loan requests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/interglobe-aviation-indigo-q3-results-net-profit-falls-by-18-pecent-to-rs-2449-ceo-pieter-elbers-2669660-2025-01-24",
      "headline": "InterGlobe Aviation Q3 results: IndiGo operator's net profit falls by 18%Indigo Q3 results: The net profit for the aviation company dropped by 18% to Rs 2,449 crore when compared to Rs 2,998 crore in the same quarter a year ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-ev-sector-expectations-expansion-of-charging-stations-boost-ev-sales-finance-minister-nirmala-sitharaman-2669565-2025-01-24",
      "headline": "Budget 2025: EV sector pushes for tech investments and smart mobility solutionsExperts anticipate that Budget 2025 would introduce policies that would boost EV sales across the country and help India achieve its goal of reducing carbon emissions by one billion tonnes by 2030.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-fall-amid-volatility-energy-and-pharma-lead-losses-hul-down-3-percent-2669600-2025-01-24",
      "headline": "Sensex, Nifty fall amid volatility; energy and pharma lead lossesShare Market: The S&P BSE Sensex shed 329.92 points to close at 76,190.46, while the NSE Nifty50 lost 113.15 points to end at 23,092.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amul-cuts-milk-prices-by-rs-1-per-litre-across-india-2669597-2025-01-24",
      "headline": "Amul cuts milk prices by Re 1 per litre across IndiaThe reduction will only be applicable to 1-litre packs. Previously, in June 2024, Amul had increased milk prices by Rs 2 per litre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/fareed-zakaria-speaks-on-donald-trumps-administration-and-india-us-relations-2669573-2025-01-24",
      "headline": "India-US relationship beyond personalities: Fareed Zakaria on Trump 2.0Fareed Zakaria shared his insights on the political shift in the United States and the seismic changes it is expected to bring geopolitically and economically across the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-green-energy-share-price-fall-sri-lanka-cancels-power-purchase-deal-report-2669582-2025-01-24",
      "headline": "Adani Green Energy shares fall as Sri Lanka cancels power purchase dealAdani Green Energy shares fell after the news of Sri Lanka cancelling the power purchase deal to hit the day's low of Rs 1,008, crashing over 6% from the day's high."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-electronics-buys-60-controlling-stake-in-pegatron-india-2669549-2025-01-24",
      "headline": "Tata Electronics buys 60% controlling stake in Pegatron IndiaTEPL, which is a wholly-owned subsidiary of Tata Sons, said the latest acquisition aligns with Tata Sons' Chairman N Chandrasekaran's vision of investments by the Tata Group in electronics manufacturing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-today-why-are-stock-markets-volatile-should-you-be-worried-3-things-to-know-expert-view-2669514-2025-01-24",
      "headline": "Why are markets volatile, and should you be worried? 3 things to know Sensex scaled to 76,985.95, reaching the day's high, a jump of over 500 points, but was trading at 76,621.03 as of 1 PM. Nifty has also gone about in the same manner. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-lee-byung-hun-on-squid-game-2-frontman-chemistry-with-gi-hun-hollywood-and-indian-cinema-2670759-2025-01-27",
      "headline": "Exclusive: Lee Byung-hun on Lee Jung-jae, Squid Game 2, working in BollywoodLee Byung-hun recently sat down with India Today Digital where he discussed Squid Game, his chemistry with Lee Jung-jae, and if he would work in Bollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/watch-video-singer-guru-randhawa-celebrates-republic-day-soldiers-in-baramulla-kashmir-2670727-2025-01-27",
      "headline": "Watch: Singer Guru Randhawa celebrates Republic Day with soldiers in KashmirGuru Randhawa marked Republic Day in Baramulla, Kashmir, with soldiers. He paid tribute to their service and was honoured by the Indian Army."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-makes-history-with-ahmedabad-concert-but-it-is-not-a-world-record-2670745-2025-01-27",
      "headline": "Coldplay makes history with Ahmedabad concert, but it's not a world recordColdplay on Sunday created history by delivering its biggest-ever concert in Ahmedabad, Gujarat. However, the band couldn't surpass the world record of having the largest number of attendees at a concert. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhoom-dhaam-trailer-pratik-gandhi-and-yami-gautam-promise-a-fun-valentines-film-2670729-2025-01-27",
      "headline": "Dhoom Dhaam trailer: Pratik Gandhi and Yami Gautam promise a fun Valentine's filmThe first trailer of the upcoming Netflix release, Dhoom Dhaam, is here. The film promises an exciting blend of romance and adventure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-martin-dakota-johnson-stroll-in-ahmedabad-post-coldplays-biggest-concert-january-26-2670659-2025-01-27",
      "headline": "Chris Martin, Dakota Johnson stroll in Ahmedabad post Coldplay's biggest concertChris Martin and Dakota Johnson were seen strolling in Ahmedabad post Coldplay's grand concert. The couple was spotted on Judges Road, surrounded by fans and bodyguards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sonu-nigam-upset-alka-yagnik-shreya-ghoshal-kishore-kumar-padma-awards-2025-2670672-2025-01-27",
      "headline": "Sonu Nigam upset over Alka Yagnik, Shreya Ghoshal not receiving Padma awardsPadma Awards 2025: Singer Sonu Nigam expressed his thoughts on Alka Yagnik, Shreya Ghoshal and other prominent stars not receiving Padman awards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-becomes-first-international-artiste-to-perform-in-bhutan-2670655-2025-01-27",
      "headline": "Video: Ed Sheeran becomes first international artiste to perform in BhutanBritish singer Ed Sheeran has become the first international artiste to perform in Bhutan. Ed reflected on the experience on social media and said that he was happy and honoured to have held a concert in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-kannada-11-hanumantha-lamani-wins-trophy-kichcha-sudeep-bids-adieu-to-reality-show-2670577-2025-01-27",
      "headline": "Bigg Boss Kannada 11: Hanumantha Lamani wins trophy, Sudeep bids adieu to showHanumantha Lamani, who was a wild card entrant on the show, won Bigg Boss Kannada Season 11. Host Kichcha Sudeep bid adieu to the reality show after 11 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-wraps-india-tour-we-will-never-forget-two-weeks-chris-martin-2670548-2025-01-27",
      "headline": "Coldplay signs off after whirlwind India tour: We'll never forget these two weeksColdplay held its biggest-ever concert in Ahmedabad, India, on January 26. Sharing a photo of the packed stadium, the British rock band said that they will never forget the two weeks they spent in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-chris-martin-pauses-my-universe-to-ensure-fan-safety-at-ahmedabad-show-2670513-2025-01-26",
      "headline": "Chris Martin pauses My Universe to ensure fan safety at Ahmedabad showDuring Sunday's concert in Ahmedabad, Coldplay's lead singer Chris Martin paused mid-performance to ensure the safety of a fan. The moment was captured during the show's live-streaming on Disney+ Hotstar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-chris-martin-indian-band-telangana-ahmedabad-concert-2670511-2025-01-26",
      "headline": "Chris Martin jokes he is from Telangana, calls Coldplay an Indian bandDuring their recent performance in India, Coldplay's lead singer, Chris Martin, joked about being born here. The British rock band concluded their India tour with a final concert in Ahmedabad on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-martin-sings-everglow-with-fan-couple-at-ahmedabad-concert-2670485-2025-01-26",
      "headline": "Chris Martin sings Everglow with fan couple at Ahmedabad concertDuring the Ahmedabad concert, Chris Martin performed Coldplay's popular song Everglow with a fan couple. The heartfelt moment was streamed live on Disney+ Hotstar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/india-new-frontier-of-live-entertainment-anand-mahindra-after-a-coldplay-record-2670480-2025-01-26",
      "headline": "India new frontier of live entertainment: Anand Mahindra after a Coldplay 'record'Anand Mahindra shared a stunning aerial video of Coldplay's concert in Ahmedabad, emphasising India's growing stature in global live entertainment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplays-chris-martin-speaks-in-hindi-in-ahmedabad-show-2670475-2025-01-26",
      "headline": "Most Hindi I've ever learned: Chris Martin's thank you at massive Ahmedabad showColdplay's Chris Martin thrilled fans by speaking in Hindi during the Ahmedabad concert on January 26. He greeted the audience in Hindi and extended Republic Day wishes, leaving fans delighted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-kannada-11-grand-finale-when-and-where-to-watch-kichcha-sudeep-show-2670454-2025-01-26",
      "headline": "Bigg Boss Kannada 11 grand finale: When and where to watch Kichcha Sudeep showThe highly-anticipated grand finale of Bigg Boss Kannada 11 will be held on Sunday, January 26. It is hosted by Kichcha Sudeep. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-note-boyfriend-rocky-jaiswal-shave-head-cancer-battle-2670412-2025-01-26",
      "headline": "He shaved his head when I did: Hina Khan's moving note for boyfriend RockyActor Hina Khan shared a heartfelt note on Instagram, praising her boyfriend Rocky Jaiswal for his unwavering support during her cancer battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/watch-coldplay-lead-vocalist-chris-martin-greets-ahmedabad-fans-in-gujarati-2670375-2025-01-26",
      "headline": "Watch: Coldplay lead vocalist Chris Martin greets Ahmedabad fans in GujaratiSinger Chris Martin of Coldplay surprised Ahmedabad fans by greeting them in Gujarati during their Ahmedabad concert."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-5-release-in-november-eagle-eyed-fans-spot-release-date-netflix-code-stmp-2670073-2025-01-25",
      "headline": "Stranger Things 5 out in November? Eagle-eyed fans spot release dateStranger Things fans may have discovered the release date for the fifth season through a Netflix code. The show will reportedly be released in November 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-storyteller-trailer-paresh-rawal-adil-hussain-shine-in-satyajit-rays-short-story-2670050-2025-01-25",
      "headline": "Storyteller trailer: Paresh Rawal, Adil Hussain shine in Satyajit Ray's short storyThe trailer for The Storyteller starring Paresh Rawal and Adil Hussain has been released. The film brings emotional complexity to Satyajit Ray's classic short story Golpo Boliye Tarini Khuro. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/guru-randhawa-visits-maha-kumbh-mela-2025-blessed-to-take-sacred-dip-maa-ganga-2670048-2025-01-25",
      "headline": "Guru Randhawa visits Maha Kumbh: Blessed to take a sacred dip in Maa GangaSinger Guru Randhawa visited the Maha Kumbh Mela 2025 in Prayagraj and took a sacred dip in the Ganga. He wrote about starting a new journey. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliamentary-panel-adopts-waqf-amendment-bill-accepts-bjp-led-ndas-amendments-2670754-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Parliament Waqf panel accepts NDA MPs' amendments, rejects Opposition's changesBJP MP Jagdambika Pal, who led the Parliamentary panel, said the amendments moved by the NDA members in 14 of the Bill's clauses have been accepted.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uniform-civil-code-in-uttarakhand-impact-on-marriage-divorce-succession-halala-2670666-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": " UCC in Uttarakhand from today: Impact on marriage, divorce, succession, 'halala'Uttarakhand became the first state in India to implement the Uniform Civil Code, effective today. Here's how the UCC will impact marriage, divorce, and succession once it is enforced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rg-kar-rape-murder-victims-parents-not-seeking-death-for-convict-calcutta-high-court-told-2670770-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RG Kar rape-murder victim's parents not seeking death for convict, court toldRG Kar rape-murder victim's parents oppose the death penalty for Sanjoy Roy, the convict. Their lawyer informed the Calcutta High Court, which has reserved its judgement on appeals from the West Bengal government and CBI seeking a death sentence.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-elections-aap-arvind-kejriwal-poll-manifesto-social-welfare-schemes-employment-bjp-2670572-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Kejriwal's guarantee, not Modi's fake guarantee': AAP's 15 promises in manifestoDelhi elections: The Aam Aadmi Party (AAP) released its manifesto for the Delhi Assembly elections, focusing on social welfare, employment, and public services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/breast-cancer-case-treatment-drugs-cost-financial-burden-2669581-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The high cost of living with breast cancer in IndiaBreast cancer cases and its economic impact are projected to grow substantially in India, with an annual increase of 5.6%. The economic burden of breast cancer willincrease to $13.96 billion by 2030. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-awards-smriti-mandhana-odi-cricketer-of-the-year-2024-2670757-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Smriti Mandhana wins ICC Women's ODI Cricketer of the Year award, scripts historySmriti Mandhana became the first Indian to win the ICC Women's ODI Cricketer of the Year award for the second time. Smriti was a cut above the rest in the 50-over format last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-amit-shah-in-prayagraj-take-a-dip-sangam-ghat-sages-2670674-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Amit Shah takes dip in Maha Kumbh with Ramdev, Yogi Adityanath; Jay Shah presentAmit Shah arrived in Prayagraj for the Maha Kumbh Mela, and took a dip at Sangam Ghat and received blessings from the saints. He called the Kumbh a symbol of Sanatan culture and unity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/one-nation-one-election-report-expense-rti-data-reveals-ram-nath-kovind-2670769-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre spent over Rs 95,000 on 'One Nation, One Election' report, reveals RTIThe government spent Rs 95,344 on drafting the 'One Nation, One Election' report, prepared by a high-level panel led by former President Ram Nath Kovind. The report, finalised after 194 days, examined the feasibility of simultaneous elections.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/the-one-question-chris-martin-father-asked-coldplay-fan-at-ahmedabad-concert-2670763-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The one question Chris Martin's father asked Coldplay fan at Ahmedabad concertIn a post on Instagram, Malay Adalja shared pictures as he posed with Chris Martin's father, Anthony Martin, at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mutual-support-not-suspicion-alienation-china-india-relations-foreign-minister-wang-yi-meeting-ladakh-standoff-2670675-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mutual achievement, not alienation: Chinese Foreign Minister's message for IndiaDuring a meeting with Foreign Secretary Vikram Misri, Chinese Foreign Minister Wang Yi stressed the need for both nations to work together, explore substantive measures, and foster mutual understanding. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-director-confirms-deleting-controversial-dance-sequence-from-vicky-kaushal-film-2670662-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Director of Vicky Kaushal-starrer Chhaava confirms deleting dance scenes amid rowChaava director Laxman Utekar confirmed that he will be deleting the scenes featuring Sambhaji Maharaj performing Lezim dance with Maharani Yesubai from his film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-illegal-immigration-crackdown-donald-trump-homeland-security-raids-gurdwaras-new-york-new-jersey-illegal-aliens-2670628-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US officials hunt for illegal immigrants in New York, New Jersey gurdwaras: ReportUS Department of Homeland Security officials have started visiting Gurdwaras in New York and New Jersey to target undocumented immigrants, sparking backlash from Sikh groups. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sonu-nigam-upset-alka-yagnik-shreya-ghoshal-kishore-kumar-padma-awards-2025-2670672-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sonu Nigam upset over Alka Yagnik, Shreya Ghoshal not receiving Padma awardsPadma Awards 2025: Singer Sonu Nigam expressed his thoughts on Alka Yagnik, Shreya Ghoshal and other prominent Indian singers not receiving Padma awards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bastar-burial-case-body-in-morgue-for-2-weeks-supreme-court-gives-split-verdict-2670721-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bastar burial case: Body in morgue for 2 weeks, Supreme Court gives split verdictThe Supreme Court, after delivering a split verdict, ordered that the body of Christian pastor Subhash Baghel be buried at a Christian cemetery located 20 kilometres away from the deceased's village."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/h1b-rich-indians-eb5-visas-green-card-stay-in-us-jobs-trump-temporary-work-permit-chinese-workers-2670044-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lens on H-1B, but rich Indians might be buying US citizenship with EB-5Temporary visas like H-1B and L1, which are used by thousands of Indians, are in Donald Trump and his MAGA's crosshairs. But for rich Indians, permanent residency in the US is a check away. With an investment of about a million dollars, the rich are buying their way to a Green Card."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-invites-applications-open-for-new-sebi-chief-who-will-succeed-madhabi-puri-buch-2670636-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who will succeed Madhabi Puri Buch? Applications open for new Sebi chiefNew Sebi Chief: The Ministry of Finance has invited applications for the post, with the last date for submission being February 17."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/novak-djokovic-love-hate-affair-tennis-world-greatness-australian-open-semifinal-2670631-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Despite greatness, Djokovic's love-hate affair with tennis world continuesAhead of the Australian Open final, Novak Djokovic shared his MRI results to shut down any doubts about his injury, showing he's still fighting for respect in a tough field. Despite all his success, his tricky relationship with fans and the media, shaped by past controversies and his fiery attitude, still plays a big role in how he's seen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/chinese-deepseek-overtakes-chatgpt-apple-free-app-store-ai-assistant-chatbot-2670639-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chinese chatbot DeepSeek ends ChatGPT supremacy on Apple App StoreChinese startup DeepSeek's AI Assistant has surged in popularity among US users since it was released on Jan. 10, according to app data research firm Sensor Tower."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uniform-civil-code-uttarakhand-congress-aimim-jdu-disapprove-2670643-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uttarakhand's UCC faces backlash from Opposition: 'Lacks uniformity'The Opposition parties have voiced their disapproval of the Uniform Civil Code which will come into effect in Uttarakhand today, arguing that the law lacks true \"uniformity.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/ed-issues-notices-to-karnataka-cm-siddaramaiahs-wife-parvathi-urban-development-minister-byrathi-suresh-in-muda-scam-2670644-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "ED's notice to Siddaramaiah's wife, Karnataka minister over Muda land scam caseThe Enforcement Directorate issued notices to Karnataka Chief Minister Siddaramaiah's wife BM Parvathi, and Urban Development minister Byrathi Suresh as part of its investigation into  Mysore Urban Development Authority (Muda) land allotment scam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/colplay-ahmedabad-concert-experience-arrangements-mumbai-shows-comparison-social-media-praise-2670568-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ahmedabad pulls off Coldplay's biggest-ever concert, fans say 'mogged Mumbai'Coldplay's Ahmedabad concerts were widely praised for their seamless organisation, enthusiastic crowd, and world-class infrastructure. Fans invariably compared them to the shows in Mumbai earlier this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indigo-pilot-surprises-ahmedabad-flight-passengers-with-mid-air-coldplay-concert-viral-video-2670713-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: IndiGo pilot surprises Ahmedabad passengers with mid-air Coldplay concertSeveral passengers on the morning flight were headed to Ahmedabad to witness Coldplay perform live and their energy onboard was anything but drowsy. Their video has gone viral on social media.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-falls-over-800-points-3-reasons-why-stock-market-is-falling-today-2670616-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex tanks over 800 points. 3 reasons why stock market is falling todayShare market crash: The S&P BSE Sensex fell 818.36 points to 75,372.10, while the NSE Nifty50 dropped by 257.35 points to 22,834.85 as of 10:35 AM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/george-rr-martin-writes-mind-boggling-theory-no-its-not-game-of-thrones-finale-2670680-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "George RR Martin writes new theory. No, it's not Game Of ThronesAuthors Ian Tregillis and George R.R. Martin derive a formula to describe the dynamics behind viral behaviour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vir-das-defends-coldplay-concert-goers-who-didnt-know-about-band-2670752-2025-01-27",
      "headline": "Vir Das defends Coldplay concert-goers who didn't know band's songsStand-up comedian and actor Vir Das defended concert-goers who attended Coldplay's shows without prior knowledge of the band's music. He emphasised that everyone has the right to enjoy the concert experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/bhumi-pednekar-davos-diary-was-all-about-cheese-snow-chocolate-selfies-2670746-2025-01-27",
      "headline": "Pics: Bhumi Pednekar's Davos diary was all about cheese, chocolate and selfiesActor Bhumi Pednekar recently had the time of her life in Davos, Switzerland. Bhumi shared a glimpse of her fun times on her social media handle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/video/chhaava-director-laxman-utekar-confirms-deleting-dance-scenes-vicky-kaushal-rashmika-mandanna-2670733-2025-01-27",
      "headline": "Chhaava director confirms deleting dance scenes from Vicky Kaushal's filmChaava director Laxman Utekar confirmed that he will be removing the scenes showing Sambhaji Maharaj performing the Lezim dance with Maharani Yesubai from his film. The decision followed a meeting with MNS chief Raj Thackeray. While speaking to the media, Utekar explained that it was merely a dance sequence and emphasised that nothing is more important than the legacy of the Maratha king."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannappa-prabhas-first-look-poster-lord-shiva-role-to-be-revealed-on-february-3-2670735-2025-01-27",
      "headline": "Kannappa: Prabhas's first look poster, role to be revealed on February 3The makers of Kannappa have announced that the highly anticipated first look of Prabhas will be unveiled on February 3. Prabhas plays an extended cameo in the devotional drama."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-awards-smriti-mandhana-odi-cricketer-of-the-year-2024-2670757-2025-01-27",
      "headline": "Smriti Mandhana wins ICC Women's ODI Cricketer of the Year award, scripts historySmriti Mandhana became the first Indian to win the ICC Women's ODI Cricketer of the Year award for the second time. Smriti was a cut above the rest in the 50-over format last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-news-ab-de-villiers-played-for-the-wrong-franchise-in-ipl-says-sanjay-manjrekar-2670753-2025-01-27",
      "headline": "AB de Villiers played for the wrong franchise in IPL: Sanjay ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar has made a big statement saying that the legendary South Africa batter AB de Villiers played for the wrong franchise in the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-awards-azmatullah-omarzai-mens-odi-cricketer-award-2670742-2025-01-27",
      "headline": "Azmatullah Omarzai becomes 1st Afghanistan player to win ICC ODI Player of Year awardAll-rounder Azmatullah Omarzai became the first Afghanistan cricketer to win the ICC men's ODI Cricketer of the Year award. The 24-year-old all-rounder was honoured for his consistent showing in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bbl-2024-25-hobart-hurricanes-vs-sydney-thunder-david-warner-live-updates-2670734-2025-01-27",
      "headline": "BBL 2024-25 Final, Hurricanes vs Thunder LIVE: Ellis removes Warner, Gilkes in quick successionBBL 2024-25 Final Live Updates: Nathan Ellis has picked up the quick wickets of David Warner and Matthew Gilkes. Earlier, Jason Sangha and Warner put the Sydney Thunder in a position of command in the grand finale against Hobart Hurricanes. Warner started his knock cautiously, but played his shots freely against the spinners. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/afghanistan-womens-cricket-australia-exhibition-t20-match-2670725-2025-01-27",
      "headline": "Australia look at T20 match for rise of Afghanistan women's cricketBefore the T20 exhibition match between Afghanistan Women's XI and a Cricket Without Borders XI, Cricket Australia chief executive Nick Hockley lauded the Afghan women for their passion and love towards the game of cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pak-vs-wi-pakistan-vs-west-indies-2nd-test-jomel-warrican-self-belief-multan-test-victory-2670718-2025-01-27",
      "headline": "How West Indies' enormous 'self-belief' fuelled their historic win vs PakistanWest Indies managed to beat Pakistan by 120 runs in the second Test of the two-match series in Multan. The visitors made a sensational comeback after being reduced to 52/8 on Day 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jay-shah-icc-chairman-arrives-prayagraj-attend-maha-kumbh-mela-watch-video-2670708-2025-01-27",
      "headline": "Watch: ICC Chairman Jay Shah arrives with family to attend Maha KumbhJay Shah arrived with his family at Prayagraj to attend the Maha Kubh Mela, which adds to the list of high-profile names attending the religious gathering. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pakistan-vs-west-indies-shan-masood-multan-test-defeat-2670689-2025-01-27",
      "headline": "Masood backs rank turners in domestic cricket despite Multan defeatPAK vs WI: Skipper Shan Masood backed turning pitches to be prepared for domestic cricket despite Pakistan's 120-run defeat to the West Indies in the second Test at the Multan Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/hansi-flick-loving-fc-barcelona-hunger-for-goals-valencia-thrashing-laliga-2670676-2025-01-27",
      "headline": "Barcelona coach Hansi Flick loving team's 'hunger' after thrashing ValenciaHansi Flick praised FC Barcelona's relentless hunger for goals after their commanding 7-1 victory over Valencia, crediting the team's attacking mindset and determination for their transformation into one of the most dominant sides in football this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pakistan-vs-west-indies-test-series-multan-wtc-table-bottom-2670665-2025-01-27",
      "headline": "Spin ploy backfires as Pakistan finish at the bottom of WTC table for the first timePAK vs WI: Shan Masood's Pakistan lost the second Test against the West Indies by 120 runs in Multan to finish the World Test Championship 2023-25 cycle at the bottom of the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pak-vs-wi-2nd-test-multan-west-indies-beat-pakistan-by-120-runs-in-2nd-test-jomel-warrican-2670645-2025-01-27",
      "headline": "West Indies spin their way to a historic Test win in Pakistan after 34 yearsWest Indies hammered Pakistan by 120 runs in the second Test in Multan and registered their first win in the country since 1990. Jomel Warrican starred for the visitors with 2nd five-wicket haul of his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jay-shah-icc-chairman-arrives-prayagraj-attend-maha-kumbh-mela-watch-video-2670708-2025-01-27",
      "headline": "Watch: ICC Chairman Jay Shah arrives with family to attend Maha KumbhJay Shah arrived with his family at Prayagraj to attend the Maha Kubh Mela, which adds to the list of high-profile names attending the religious gathering. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pakistan-vs-west-indies-shan-masood-multan-test-defeat-2670689-2025-01-27",
      "headline": "Masood backs rank turners in domestic cricket despite Multan defeatPAK vs WI: Skipper Shan Masood backed turning pitches to be prepared for domestic cricket despite Pakistan's 120-run defeat to the West Indies in the second Test at the Multan Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/hansi-flick-loving-fc-barcelona-hunger-for-goals-valencia-thrashing-laliga-2670676-2025-01-27",
      "headline": "Barcelona coach Hansi Flick loving team's 'hunger' after thrashing ValenciaHansi Flick praised FC Barcelona's relentless hunger for goals after their commanding 7-1 victory over Valencia, crediting the team's attacking mindset and determination for their transformation into one of the most dominant sides in football this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pakistan-vs-west-indies-test-series-multan-wtc-table-bottom-2670665-2025-01-27",
      "headline": "Spin ploy backfires as Pakistan finish at the bottom of WTC table for the first timePAK vs WI: Shan Masood's Pakistan lost the second Test against the West Indies by 120 runs in Multan to finish the World Test Championship 2023-25 cycle at the bottom of the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pak-vs-wi-2nd-test-multan-west-indies-beat-pakistan-by-120-runs-in-2nd-test-jomel-warrican-2670645-2025-01-27",
      "headline": "West Indies spin their way to a historic Test win in Pakistan after 34 yearsWest Indies hammered Pakistan by 120 runs in the second Test in Multan and registered their first win in the country since 1990. Jomel Warrican starred for the visitors with 2nd five-wicket haul of his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/novak-djokovic-love-hate-affair-tennis-world-greatness-australian-open-semifinal-2670631-2025-01-27",
      "headline": "Despite greatness, Djokovic's love-hate affair with tennis world continuesAhead of the Australian Open final, Novak Djokovic shared his MRI results to shut down any doubts about his injury, showing he's still fighting for respect in a tough field. Despite all his success, his tricky relationship with fans and the media, shaped by past controversies and his fiery attitude, still plays a big role in how he's seen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ravichandran-ashwin-takes-a-dig-at-harry-brooks-bizarre-smog-excuse-ind-vs-eng-2670618-2025-01-27",
      "headline": "R. Ashwin takes a dig at Harry Brook's bizarre excuse: There was no smog in ChennaiFormer India spinner Ravichandran Ashwin has taken a dig at England batter Harry Brook for his bizarre 'smog' excuse after failure in the first T20I in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-dhruv-jurel-picked-because-of-potential-aakash-chopra-second-wicketkeeper-2670623-2025-01-27",
      "headline": "Jurel picked because of potential: Aakash Chopra reasons player's selectionAakash Chopra has defended Dhruv Jurel's selection in India's T20I squad, emphasising his potential and urging patience despite the youngster's struggles against England, where his performances have come under scrutiny amidst calls for Ruturaj Gaikwad's inclusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/riyan-parag-injury-return-assam-ranji-trophy-captain-vs-saurashtra-india-team-2670602-2025-01-27",
      "headline": "Riyan Parag to return from injury and captain Assam in Ranji Trophy: ReportsRiyan Parag's return from injury to lead Assam in their final Ranji Trophy league fixture against Saurashtra offers the young all-rounder a chance to rebuild form and fitness while boosting Assam's campaign in domestic cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-manchester-united-ruben-amorim-marcus-rashford-intent-will-play-a-coach-2670592-2025-01-27",
      "headline": "Would rather play 63-year-old goalkeeping coach: Amorim's brutal take on RashfordRuben Amorim benched Marcus Rashford again, citing poor training intent, fuelling transfer rumours linking the Manchester United forward with Dortmund, AC Milan, and Barcelona."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-shashank-singh-reveals-ms-dhonis-golden-advice-which-made-him-a-confident-finisher-2670587-2025-01-27",
      "headline": "Shashank Singh reveals MS Dhoni's golden advice which made him a 'confident' finisherPunjab Kings batter Shashank Singh recently revealed MS Dhoni's advice which helped him gain confidence as a finisher. Shashank has been retained by Punjab for Rs 5.5 Crore for IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sajid-khan-imitates-john-cenas-famous-gesture-during-2nd-test-vs-west-indies-in-multan-2670563-2025-01-27",
      "headline": "Sajid Khan imitates John Cena's famous gesture during 2nd Test vs WIPakistan off-spinner Sajid Khan was seen imitating famous gesture of the WWE superstar John Cena during Day 2 of the second Test against the West Indies in Multan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-manchester-united-ruben-amorim-marcus-rashford-intent-will-play-a-coach-2670592-2025-01-27",
      "headline": "Would rather play 63-year-old goalkeeping coach: Amorim's brutal take on RashfordRuben Amorim benched Marcus Rashford again, citing poor training intent, fuelling transfer rumours linking the Manchester United forward with Dortmund, AC Milan, and Barcelona."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-shashank-singh-reveals-ms-dhonis-golden-advice-which-made-him-a-confident-finisher-2670587-2025-01-27",
      "headline": "Shashank Singh reveals MS Dhoni's golden advice which made him a 'confident' finisherPunjab Kings batter Shashank Singh recently revealed MS Dhoni's advice which helped him gain confidence as a finisher. Shashank has been retained by Punjab for Rs 5.5 Crore for IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sajid-khan-imitates-john-cenas-famous-gesture-during-2nd-test-vs-west-indies-in-multan-2670563-2025-01-27",
      "headline": "Sajid Khan imitates John Cena's famous gesture during 2nd Test vs WIPakistan off-spinner Sajid Khan was seen imitating famous gesture of the WWE superstar John Cena during Day 2 of the second Test against the West Indies in Multan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-after-test-success-jamie-smith-aims-to-be-englands-finisher-in-t20is-2670553-2025-01-27",
      "headline": "After Test success, Jamie Smith aims to be England's finisher in T20IsEngland wicketkeeper batter Jamie Smith recently expressed his desire to become an all-format regular for his team and seal his spot as a finisher in T20Is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/running-sufiya-sufi-exclusive-around-the-globe-run-representing-india-2670465-2025-01-27",
      "headline": "40,000 km around the globe: Sufiya Sufi's goal to make India proudIn an exclusive interaction with Indiatoday.in, runner Sufiya Sufi opens up on her ultimate challenge in the sport and how she wants to make India proud on the global stage. Sufiya has been a trailblazer in the sport of running. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/football-kylian-mbappe-real-madrid-vs-valladolid-report-laliga-2670523-2025-01-26",
      "headline": "Kylian Mbappe fires first Real Madrid hat-trick as leaders thrash ValladolidKylian Mbappe scored his first hat-trick for Real Madrid in a LaLiga match vs Valladolid on Sunday, January 26. Mbappe's 3 goals helped Madrid rout the opponent and continue their run at the top of the league.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/watch-olympian-nishant-dev-secures-ruthless-win-on-pro-boxing-debut-in-las-vegas-2670521-2025-01-26",
      "headline": "Watch: Nishant Dev secures ruthless win on pro-boxing debut in Las VegasOlympian Nishant Dev put in an impressive show on his debut in pro-boxing on Saturday, January 25. Nishant knocked-down Alton Wiggins thrice in the first round after which the referee stepped in to stop the fight."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}