{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-epf-claims-get-rejected-and-how-employees-can-avoid-it-2841277-2025-12-24",
      "headline": "Why EPF claims get rejected and how employees can avoid itAn EPF claim rejection can be frustrating, especially when employees need the money urgently. Understanding why claims get rejected and how to avoid common mistakes can save time and stress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-airline-noc-al-hind-air-flyexpress-india-aviation-duopoly-dgca-2841111-2025-12-24",
      "headline": "Centre okays 3 new airlines after IndiGo chaos: Shankh Air, Al Hind Air, FlyExpressShankh Air, Al Hind Air and FlyExpress have received no objection certificates from the civil aviation ministry, as the government looks to reduce heavy dependence on a few airlines following recent disruption at IndiGo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-ends-lower-trent-shares-gain-2-2841104-2025-12-24",
      "headline": "Sensex ends 116 points lower, Nifty below 26,200; Trent gained 2%The S&P BSE Sensex lost 116.14 points to close at 85,408.70, while the NSE Nifty50 was down by 35.05 points to end at 85,408.70. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/facing-pension-delays-epfo-sets-new-rules-to-fix-eps-contribution-mistakes-2841051-2025-12-24",
      "headline": "Facing pension delays? EPFO sets new rules to fix EPS contribution mistakesPension delays have long been a worry for many employees. To address this, the EPFO has introduced new rules to correct mistakes in EPS contributions and ensure pension claims are settled smoothly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-how-the-fitment-factor-will-shape-salary-and-pension-increases-2841022-2025-12-24",
      "headline": "8th Pay Commission: How the fitment factor will shape salary and pension increasesAs talks around the 8th Pay Commission gather pace, government employees and pensioners are closely watching one number that could change their monthly income. The fitment factor is set to be the main driver of salary and pension revisions under the new pay panel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/still-waiting-for-your-income-tax-refund-simple-ways-to-check-your-itr-status-2840981-2025-12-24",
      "headline": "Still waiting for your income tax refund? Simple ways to check your ITR statusWaiting for an income tax refund can be frustrating, especially after filing your return on time. While delays are common, tracking your ITR status online is easy and can give you clarity on where things stand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-sells-pia-rs-135-billion-privatisation-deal-airline-sale-report-2840956-2025-12-24",
      "headline": "Pakistan sells national carrier PIA for Rs 4,300 crore after IMF diktatPakistan, which is surviving on international loans and dole, sold its flag-carrier Pakistan International Airlines (PIA) on Wednesday for PKR 13,500 crore (Rs 4,300 crore). The Pakistani government had to privatise the airline under IMF loan conditions. The Arif Habib Group emerged as the highest bidder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/coal-india-share-price-rally-key-reasons-all-you-need-to-know-2840955-2025-12-24",
      "headline": "Coal India shares continue to rally. What's behind the rise?Coal India's sharp rally reflects a mix of restructuring signals, strong fundamentals and sector-wide PSU momentum. With multiple subsidiaries headed for listings, investors see fresh value creation opportunities driving renewed interest in the stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/saleem-ahmad-takes-charge-as-rvnl-cmd-replacing-sukhmal-chand-jain-2840937-2025-12-24",
      "headline": "Saleem Ahmad takes charge as RVNL CMD, replacing Sukhmal Chand JainSaleem Ahmad is a civil engineering graduate from Jamia Millia Islamia University and brings more than 35 years of experience across large-scale construction and infrastructure projects. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/revised-itr-filing-required-after-income-tax-department-message-key-details-2840909-2025-12-24",
      "headline": "Do you need to file revised ITR after the Income Tax Department's message?The tax department's risk management alert serves as a cautionary prompt, not a formal notice. Taxpayers need revised ITRs only if there are mismatches. Those with correct claims can wait as refunds resume after verification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-today-mcx-silver-record-high-safe-haven-demand-support-levels-2025-2840899-2025-12-24",
      "headline": "Gold rallies to fresh high: Key reasons behind rally and support levels to watchSpot gold rose 0.8% to a fresh all-time high of $4,524 per ounce. With this jump, gold has gained around 72% so far this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-refund-on-hold-income-tax-department-issues-clarification-risk-management-alert-2840883-2025-12-24",
      "headline": "ITR on hold? Tax department issues clarification on 'risk management' alertsThe tax department's latest clarification aims to ease taxpayer anxiety, stressing that the alerts are advisory and encourage voluntary correction. Refunds will resume once discrepancies are fixed or claims are verified as genuine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coca-cola-india-bottler-hccb-layoffs-300-jobs-profit-decline-fy25-operations-streamlining-2840871-2025-12-24",
      "headline": "Coca-Cola India bottler HCCB announces plan to lay off 300 workersHindustan Coca-Cola Beverages (HCCB) currently has around 5,000 employees across India and operates 15 manufacturing units."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/gujarat-kidney-ipo-closes-today-should-you-subscribe-gmp-subscription-status-listing-date-price-band-2840855-2025-12-24",
      "headline": "Gujarat Kidney IPO closes today: Should you subscribe? Here's what GMP suggestsGujarat Kidney IPO is a book-built issue worth Rs 250.80 crore. The entire issue is a fresh issue of 2.20 crore equity shares, with no offer for sale component. This means all the money raised through the IPO will go to the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-katrina-kaif-kay-beauty-to-kusha-kapila-underneat-why-some-celebrity-brands-thrive-while-others-fade-2840591-2025-12-24",
      "headline": "Why some celebrity brands thrive while others fadeFrom Katrina Kaif's Kay Beauty to Kusha Kapila's Underneat, celebrity brands are no longer side projects. While some scale steadily and earn consumer trust, others struggle to outgrow launch buzz. What explains this divide?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/robin-raina-denies-eraaya-claims-supreme-court-order-ownership-dispute-clarification-2840833-2025-12-24",
      "headline": "Robin Raina denies Eraaya allegations, says 50% shareholding case is still openIn a statement released on December 23, 2025, Robin Raina said that Eraaya Lifespaces has been spreading incorrect information through repeated media statements"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-to-change-jobs-why-you-should-not-withdraw-your-pf-2840648-2025-12-23",
      "headline": "Planning to change jobs? Why you should not withdraw your PFA new job usually means better prospects and a fresh start. Yet, in the rush to move on, one costly mistake is common: withdrawing your PF. What feels like easy money today can hurt your long-term financial security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-refund-under-risk-management-what-taxpayers-should-know-2840524-2025-12-23",
      "headline": "Tax refund put on hold under risk management? What the message meansA sudden message from the income tax department has unsettled many taxpayers, who are unsure why their returns are under review. Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-give-up-early-gains-end-lower-investors-book-profit-it-stocks-down-2840479-2025-12-23",
      "headline": "Sensex, Nifty give up early gains to end lower as investors book profitsThe S&P BSE Sensex was down by 42.64 points to close at 85,524.84, while the NSE Nifty50 lost 4.75 points to end at 26,177.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/buy-now-or-wait-why-delaying-a-home-purchase-can-cost-you-more-than-you-expect-2840454-2025-12-23",
      "headline": "Buy now or wait? Why delaying a home purchase can cost you more than you expectIs waiting really the wiser choice for homebuyers, or can rising prices turn patience into a costly mistake? Let's break it down."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/peaky-blinders-immortal-man-cillian-murphy-returns-to-birmingham-in-film-teaser-2841368-2025-12-24",
      "headline": "Peaky Blinders Immortal Man: Cillian Murphy returns to Birmingham in film teaser The teaser for the new Peaky Blinders film, The Immortal Man, has been released, confirming Cillian Murphy's return to his iconic role. The film will arrive in select cinemas on March 6, and on Netflix from March 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/agastya-nanda-and-navya-turn-kbc-17-into-a-bachchan-family-affair-watch-promo-2841348-2025-12-24",
      "headline": "Agastya Nanda and Navya turn KBC 17 into a Bachchan family affair. Watch promo The upcoming episode of Kaun Banega Crorepati 17 will see Agastya Nanda, his grandfather Amitabh Bachchan, and other family members sharing candid moments as the release of their film Ikkis is moved from December 25 to January 1, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/she-doesnt-love-him-only-wants-money-sunita-ahuja-on-govindas-alleged-affair-2841300-2025-12-24",
      "headline": "She doesn't love him, only wants money: Sunita Ahuja on Govinda's alleged affair Sunita Ahuja reflected on the challenges of 2025, including public rumours regarding Govinda's alleged affair. She shares her hopes for a positive new year while clarifying her stance on the recent controversies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/made-in-korea-review-hyun-bin-political-thriller-1970s-kdrama-2841307-2025-12-24",
      "headline": "Made in Korea review: Hyun Bin's comeback K-drama has style, power and ambitionRelease Date:Wed Dec 24, 2025 Made in Korea series review: Made in Korea follows Hyun Bin in a political thriller set in 1970s South Korea. The series explores power struggles and moral ambiguity amidst historical turmoil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sivaji-on-dhandoraa-event-controversy-i-really-apologise-to-all-the-women-2841298-2025-12-24",
      "headline": "Nidhhi Agerwal fires back after Sivaji links her outfit to mob behaviour Nidhhi Agerwal reacted strongly to the controversy around Sivaji's remarks at the Dhandoraa pre-release event, calling out victim-blaming on social media. Sivaji defended the intent of his comments while apologising for the language used."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranveer-singh-has-not-walked-out-of-don-3-sources-2841284-2025-12-24",
      "headline": "Ranveer Singh didn't quit Don 3, he was fired, claim sources Contrary to rumours, Ranveer Singh has not quit Don 3, instead the makers have fired him. Sources have clarified to IndiaToday.in that the actor was removed from the Farhan Akhtar directorial. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arbaaz-khan-dances-to-ek-do-teen-ole-ole-in-wife-sshura-anniversary-post-2841250-2025-12-24",
      "headline": "Arbaaz Khan dances to Ek Do Teen, Ole Ole in wife Sshura's anniversary post Arbaaz Khan's unchoreographed dance moves have found a devoted fan in his wife Sshura Khan, who shared heartfelt videos celebrating their wedding anniversary. The couple recently welcomed their daughter Sipaara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-on-working-with-sanjay-leela-bhansali-in-love-and-war-2841263-2025-12-24",
      "headline": "Vicky Kaushal on working with Sanjay Leela in Love and War: Incredible experience Vicky Kaushal has shared his experience of working with Sanjay Leela Bhansali on Love and War, calling the filmmaker's creative process \"incredible\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-50-reality-show-launch-colors-tv-jiohotstar-unique-no-rule-format-2841186-2025-12-24",
      "headline": "After Bigg Boss 19, The 50 promises reality TV chaos: No rules, no pattern A new Indian reality show titled The 50, based on the French series Les Cinquante, is set to feature 50 contestants competing without a rulebook, promising higher levels of mind games and strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-shares-photos-from-farm-getaway-with-ogs-saif-ali-khan-karisma-2841198-2025-12-24",
      "headline": "Kareena posts sun-kissed selfie of Saif and Karisma: OGs in the sarson ka khet Kareena Kapoor shared glimpses from her peaceful winter break at a farm, where she is spending time with husband Saif Ali Khan and sister Karisma Kapoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/why-2025-marked-a-turning-point-for-k-pop-and-bts-fans-in-india-2841185-2025-12-24",
      "headline": "Why 2025 marked a turning point for K-pop and BTS fans in India In 2025, K-pop moved beyond niche online fandoms to become a visible cultural force across India. Landmark visits by top stars and growing local collaborations signalled industry recognition, deeper cultural exchange, and India's rising importance in the global K-pop story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-2-to-be-a-pan-india-film-with-five-language-release-on-march-2841169-2025-12-24",
      "headline": "Dhurandhar 2 confirms five-language rollout amid South buzz, targets Eid and Ugadi Dhurandhar 2 has been locked for a grand pan-India release on March 19, 2026, coinciding with Eid, Gudi Padwa and Ugadi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shraddha-is-stubborn-charges-more-shakti-kapoor-on-why-daughter-does-fewer-films-2841150-2025-12-24",
      "headline": "Shraddha is stubborn, charges more: Shakti Kapoor on why daughter does fewer films Shraddha Kapoor's father, Shakti Kapoor, explained her career choices, and why she's done fewer films as compared to her peers in the industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ppl-alleges-copyright-infringement-kapil-sharma-show-unauthorised-use-sound-recordings-2841120-2025-12-24",
      "headline": "Kapil Sharma gets two weeks' time from Bombay High Court to reply in copyright case The Bombay High Court has given comedian Kapil Sharma, his production house K9, and associates of his OTT comedy show two weeks to respond to a copyright infringement plea filed by Phonographic Performance Ltd (PPL), which alleges unauthorised use of its copyrighted music on the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shweta-tripathi-shares-bts-pics-from-mirzapur-the-movie-sets-2841124-2025-12-24",
      "headline": "Shweta Tripathi shares BTS pics from Mirzapur film sets: Best moments of 2025 Shweta Tripathi called the start of Mirzapur: The Movie shoot one of the best moments of her 2025 as she shared behind-the-scenes pictures from the Jaisalmer schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/anuj-sachdeva-raises-safety-concerns-after-violent-assault-in-goregaon-mumbai-society-2841100-2025-12-24",
      "headline": "Anuj Sachdeva shows injury marks after parking row, says no action by Mumbai Police Anuj Sachdeva has raised concerns over his safety following a reported assault in his Goregaon housing society, expressing frustration with the police response and posting images of his injuries online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/baahubali-the-epic-digital-release-announced-after-theatrical-re-release-ss-rajamouli-2841039-2025-12-24",
      "headline": "Baahubali The Epic OTT release: Rajamouli's film to make Christmas extra special SS Rajamouli's re-released film 'Baahubali: The Epic', an amalgamation of 'Baahubali: The Beginning' and 'Baahubali 2: The Conclusion', will have a digital release following its theatrical debut on October 31."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-says-his-relationship-with-ananya-is-about-love-no-hatred-or-love-hate-2841085-2025-12-24",
      "headline": "Kartik says his relationship with Ananya is about love: No hatred or love-hate Kartik Aaryan discussed his evolving relationship with Ananya Panday as they reunite for their new romantic drama Tu Meri Main Tera Main Tera Tu Meri. The actor said he's always had a \"soft corner\" for Ananya in his heart."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sharman-joshi-reacts-to-3-idiots-sequel-speculation-2841080-2025-12-24",
      "headline": "Sharman Joshi reacts to 3 Idiots sequel speculation: Hopeful this time Speculation around 3 Idiots 2 has resurfaced 15 years after the original film's release, with Sharman Joshi expressing hope while clarifying that he has not received official confirmation yet."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/fresh-violence-in-bangladesh-man-killed-after-miscreants-throw-petrol-bomb-on-christmas-eve-2841305-2025-12-24",
      "headline": "1 killed in explosion in Dhaka ahead of Tarique Rahman's return to Bangladesh Live updatesAccording to police, unidentified assailants threw a crude bomb from the Moghbazar flyover at around 7:10 pm, which landed on the road below. The improvised explosive device is believed to have hit the victim, Siam, 21, on the head, killing him instantly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/unnao-rape-case-central-bureau-of-investigation-challenge-kuldeep-sengar-jail-term-suspension-2841373-2025-12-24",
      "headline": "CBI likely to challenge Kuldeep Sengar's jail term suspension in Unnao rape caseThe Delhi High Court on Tuesday granted bail to Sengar, suspending his sentence while his appeal is pending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/impose-complete-ban-on-new-mining-leases-in-aravallis-centres-big-order-to-states-amid-controversy-2841292-2025-12-24",
      "headline": "No new mining leases in Aravallis, will protect entire range: Centre's big orderThe Centre has directed states to impose a complete ban on new mining leases across the Aravalli range from Delhi to Gujarat, tasked ICFRE with identifying more no-mining zones, and ordered strict regulation of existing mines to protect the ecologically fragile region."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/left-congress-conspired-to-loot-temple-assets-kerala-bjp-chief-on-sabarimala-row-2841365-2025-12-24",
      "headline": "Left, Congress conspired to loot temple assets: Kerala BJP chief on Sabarimala rowNot just 4.5 kg of gold, Rajeev Chandrasekhar alleged that four Panchaloha idols were taken out of Sabarimala under the LDF-appointed Devaswom Board, and claimed that parts of the Pathinettam Padi were tampered with or looted during the Congress-led UDF regime in 2015."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/karbi-anglong-news-violence-police-attacked-two-dead-what-happened-land-rights-tribal-sixth-schedule-himanta-biswa-sarma-2841097-2025-12-24",
      "headline": "Bombs, arrows fly in Assam's Karbi Anglong, Army deployed | Crisis explainedThe Army has been deployed in Assam's West Karbi Anglong, a day after police personnel were attacked by a barrage of stones, arrows and crude bombs. Markets and a BJP leader's home were set ablaze. Internet services have been snapped as two people were killed in large-scale violence in the tribal district of Assam. The flare-up was sparked by police action against tribal hunger strikers protesting alleged encroachment on protected tribal land. It is a long-running fault line in the Sixth Schedule district of Assam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranveer-singh-has-not-walked-out-of-don-3-sources-2841284-2025-12-24",
      "headline": "Ranveer Singh didn't quit Don 3, he was fired, claim sourcesContrary to rumours, Ranveer Singh has not quit Don 3, instead the makers have fired him. Sources have clarified to IndiaToday.in that the actor was removed from the Farhan Akhtar directorial. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-airline-noc-al-hind-air-flyexpress-india-aviation-duopoly-dgca-2841111-2025-12-24",
      "headline": "Centre okays 3 new airlines after IndiGo chaos: Shankh Air, Al Hind Air, FlyExpressShankh Air, Al Hind Air and FlyExpress have received no objection certificates from the civil aviation ministry, as the government looks to reduce heavy dependence on a few airlines following recent disruption at IndiGo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-minister-op-rajbhar-mocks-unnao-rape-survivor-after-being-removed-from-delhi-protest-kuldeep-sengar-2841132-2025-12-24",
      "headline": "Unnao rape survivor, mother dragged from Delhi protest; UP minister mocks themA day after the Unnao rape survivor and her mother were evicted while protesting at the India Gate lawns, UP minister OP Rajbhar laughed off the incident. They were protesting against the relief granted to ex-BJP MLA Kuldeep Singh Sengar, a convict in the case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/indias-first-driverless-ai-bike-garuda-built-from-scrap-by-surat-students-2841247-2025-12-24",
      "headline": "From junkyard to genius: Surat students build India's first AI superbike GarudaThree mechanical engineering students from Surat have developed 'Garuda', India's first AI-powered electric bike prototype built using 50% scrap. Powered by a Raspberry Pi brain, sensors, cameras and voice commands, the Tesla-inspired bike showcases how young innovators are reimagining sustainable and intelligent mobility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-woman-road-harassment-fir-police-search-karnataka-rejecting-proposal-2840960-2025-12-24",
      "headline": "Groped, hit: Woman assaulted on road by Instagram friend for rejecting proposalA woman in Bengaluru alleged sexual harassment after refusing a love proposal. The accused reportedly pulled her clothes and assaulted her in public. Police registered an FIR and launched a search for him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/7-killed-after-bus-swerves-to-opposite-side-and-collides-with-2-vehicles-in-tamil-nadus-cuddalore-pti-2841361-2025-12-24",
      "headline": "9 killed as bus swerves to opposite side, collides with 2 vehicles in Tamil NaduTamil Nadu Chief Minister MK Stalin has expressed shock over the incident and conveyed his condolences to the families of the victims. He directed officials to ensure the best possible medical care for those injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-protest-live-updates-violence-dhaka-unrest-dipu-chandra-das-muhammad-yunus-2840828-2025-12-24",
      "headline": "Live: Renowned Dhaka University canteen vandalised as violence spiralsBangladesh Protest Live Updates: Bangladesh's interim government on Tuesday signalled an effort to steady fraying ties with India, with Finance Adviser Salehuddin Ahmed saying Chief Adviser Muhammad Yunus is working to ease tensions by separating economic interests from political rhetoric, even as Dhaka approved buying 50,000 tonnes of rice from India on cost grounds; the outreach came amid a sharp diplomatic flare-up marked by envoy summons, protests around missions in both countries, and New Delhi's demand for a thorough probe into the killing of Bangladeshi student leader Sharif Osman Hadi, with India rejecting what it called false narratives while Dhaka insisted recent anti-India statements do not reflect national sentiment. Stay tuned to Indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/christmas-holiday-2025-date-origins-jesus-christ-birth-debate-javed-akhtar-pegan-festival-ancient-rome-king-emperor-constantine-2841053-2025-12-24",
      "headline": "Was Christmas moved from spring to December 25? Here are the factsPoet Javed Akhtar claimed that Christmas was moved from spring to December to coincide with a popular pagan festival to ease religious transition in ancient Rome. Historians, however, say that December 25 emerged as Christmas day through a complex mix of theology, symbolism, and circumstance rather than a single imperial decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-how-the-fitment-factor-will-shape-salary-and-pension-increases-2841022-2025-12-24",
      "headline": "8th Pay Commission: How the fitment factor will shape salary and pension increasesAs talks around the 8th Pay Commission gather pace, government employees and pensioners are closely watching one number that could change their monthly income. The fitment factor is set to be the main driver of salary and pension revisions under the new pay panel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-logger-anant-mittal-on-road-indian-detained-china-15-hours-remark-on-arunachal-pradesh-2841183-2025-12-24",
      "headline": "Indian vlogger detained in China for 15 hours over Arunachal remarkThe incident reportedly occurred on November 16, when Chinese authorities questioned him at length before eventually releasing him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/disrespectful-acts-hurt-followers-sentiments-india-on-lord-vishnu-statue-demolition-at-thai-cambodia-border-2841316-2025-12-24",
      "headline": "Disrespectful acts: India on Lord Vishnu statue demolition at Thai-Cambodia borderEmphasising the shared cultural and civilisational bonds of the region, Jaiswal noted that Hindu and Buddhist deities are deeply revered and worshipped by people across South and Southeast Asia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/saudi-arabia-snowfall-climate-change-warning-to-world-climate-anomalies-mitigation-adaptation-2840330-2025-12-24",
      "headline": "Rare snowfall in Saudi deserts: Why it's a big warning for IndiaThe snowfall in the desert signalled to the world that something fundamental is shifting in the planet's climate system, and the consequences are visible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/telegram-founder-pavel-durov-to-fund-ivf-for-women-under-37-using-his-sperm-claims-fathered-100-children-2841333-2025-12-24",
      "headline": "Telegram founder Pavel Durov offers to fund IVF for women under 37 using his spermDurov, who claims to have fathered over 100 children through sperm donation, has described the move as a response to declining male fertility and said all his biological children will inherit equally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sivaji-on-dhandoraa-event-controversy-i-really-apologise-to-all-the-women-2841298-2025-12-24",
      "headline": "Nidhhi Agerwal fires back after Sivaji links her outfit to mob behaviourNidhhi Agerwal reacted strongly to the controversy around Sivaji's remarks at the Dhandoraa pre-release event, calling out victim-blaming on social media. Sivaji defended the intent of his comments while apologising for the language used."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/grap-iv-restrictions-strictest-level-of-anti-pollution-curbs-lifted-in-delhi-as-aqi-improves-2841222-2025-12-24",
      "headline": "GRAP-IV restrictions lifted in Delhi as AQI improvesAlthough the restrictions under GRAP-IV have been revoked, the capital presently grapples with GRAP-I, GRAP-II, and GRAP-III guidelines. Despite the improvement in air quality, the Commission has not decided to abolish the implementation of these three categories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-hazare-trophy-rohit-sharma-virat-kohli-centuries-jaipur-bengaluru-2841251-2025-12-24",
      "headline": "Too easy? Rohit Sharma and Virat Kohli show Vijay Hazare isn't their testToo easy? Rohit Sharma and Virat Kohli did not need domestic cricket to prove themselves, but their return to the Vijay Hazare Trophy created the buzz the tournament was hoping for. Rohit struck a daddy hundred to lead Mumbai's chase against Sikkim in Jaipur, while Kohli lived up to his 'chase master' tag with a fluent 131 off 101 balls for Delhi against Andhra in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/is-chronic-lateness-a-relationship-dealbreaker-2841016-2025-12-24",
      "headline": "When your partner's ETA tests your patience, and feelingsWhen being late becomes more than just a running joke, it can also affect your relationship. Not just a professional, but a romantic one. But, are you willing to break up over it? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/priyanka-gandhi-prime-minister-face-congress-rift-rahul-gandhi-2841035-2025-12-24",
      "headline": "Is Congress heading for another Priyanka Gandhi vs Rahul moment?Priyanka Gandhi: Voices within the Congress have grown stronger, calling for a key central role for Priyanka Gandhi, who has quickly transitioned from a behind-the-scenes strategist to a frontline shrewd politician. This was visible in the Parliament session. Now, a Congress MP's 'Priyanka for PM' chorus has created a buzz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-monty-panesar-coach-brendon-mccullum-england-ashes-australia-2841091-2025-12-24",
      "headline": "Ravi Shastri backed to replace Brendon McCullum as England coach after Ashes defeatFormer England spinner Monty Panesar has urged England to turn to Ravi Shastri as a replacement for Brendon McCullum, arguing that the ex-India coach's proven success against Australia makes him the ideal candidate to revive the team after a disappointing Ashes campaign."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-goa-symbolic-pause-isl-uncertainty-afc-champions-league-two-2841384-2025-12-24",
      "headline": "FC Goa stage silent protest in ACL2 clash to give ISL's uncertainty more spotlight FC Goa players paused play in their AFC Champions League Two match to highlight uncertainty around the ISL, as Indian football continues to grapple with administrative and commercial turmoil."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-vertigo-ashes-adelaide-test-miss-2841334-2025-12-24",
      "headline": "Couldn't track the ball: Smith reveals vertigo battle before 3rd Ashes Test Steve Smith described the vertigo issue he was dealing with ahead of the Adelaide Test, which forced him to miss the match. Smith missed his second match in the last six Tests and has opened up about having vertigo symptoms in the past. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-general-funds-increase-taxes-indian-government-dream11-exit-2841328-2025-12-24",
      "headline": "No Dream11 sponsorship, no problem: BCCI's general funds increase to Rs 11,346 crore The BCCI has shrugged off Dream11's exit, bridging the gap with new sponsorship deals as its finances remain strong and surpluses grow despite a dip in ICC revenue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-hazare-round-1-matches-highlights-delhi-virat-kohli-rohit-sharma-vaibhav-suryavanshi-2841313-2025-12-24",
      "headline": "Vijay Hazare Wrap: What happened apart from Rohit and Kohli in Round 1 Vijay Hazare Trophy's 2025-26 season began on Wednesday, December 24. Here is a comprehensive wrap of what happened in the Round 1 fixtures. However, this article focusses on the performances beyond Virat Kohli and Rohit Sharma, who were on fire today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yash-dayal-anticipatory-bail-denied-jaipur-pocso-minor-rape-case-2841303-2025-12-24",
      "headline": "Yash Dayal's bail plea rejected by Jaipur POCSO court in alleged rape case A Jaipur special POCSO court rejected cricketer Yash Dayal's anticipatory bail plea, citing serious allegations involving a minor and ruling that the stage of investigation did not justify pre-arrest protection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-prodigy-sachin-tendulkar-maiden-india-call-up-shashi-tharoor-2841275-2025-12-24",
      "headline": "Last prodigy was Sachin. Shashi Tharoor backs Vaibhav Suryavanshi for India call-up Vaibhav Suryavanshi's stunning 190 in the Vijay Hazare Trophy has reignited calls for an India senior call-up, with Shashi Tharoor and Aakash Chopra backing the 14-year-old after Bihar's world-record total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-hazare-trophy-rohit-sharma-virat-kohli-centuries-jaipur-bengaluru-2841251-2025-12-24",
      "headline": "Too easy? Rohit Sharma and Virat Kohli show Vijay Hazare isn't their test Too easy? Rohit Sharma and Virat Kohli did not need domestic cricket to prove themselves, but their return to the Vijay Hazare Trophy created the buzz the tournament was hoping for. Rohit struck a daddy hundred to lead Mumbai's chase against Sikkim in Jaipur, while Kohli lived up to his 'chase master' tag with a fluent 131 off 101 balls for Delhi against Andhra in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/hardik-singh-khel-ratna-arjuna-awards-list-2025-2841246-2025-12-24",
      "headline": "National Sports Awards: No cricketer in shortlist, Hardik Singh sole Khel Ratna nominee There were no cricketers in the shortlist for the National Sports Awards with Hardik Singh being the sole nominee for the Khel Ratna honour this year. Teenage chess star Divya Deshmukh and Tejaswin Shankar were among the athletes picked for the Arjuna awards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/darren-lehmann-backs-england-ashes-drinking-controversy-2841230-2025-12-24",
      "headline": "Ex-AUS coach backs England amid drinking controversy: Running a campaign against them Former Australia coach Darren Lehmann defended the England team amidst reports of heavy drinking during their mid-Ashes break in Noosa. Reports of misconduct from England players emerged after their loss in Adelaide to Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karnataka-completes-second-highest-list-a-cricket-chase-vs-jharkhand-2841212-2025-12-24",
      "headline": "Devdutt Padikkal 147 powers Karnataka to second-highest List A run chase Vijay Hazare Trophy: Devdutt Padikkal's superb 147-run knock helped Karnataka chase down the 413-run target against Jharkhand to complete the second-highest run chase in the history of List A cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-hundred-vijay-hazare-gambhir-fans-jaipur-2841209-2025-12-24",
      "headline": "Gambhir dekh raha hai na? Fans troll coach after Rohit's hundred in Jaipur Vijay Hazare Trophy: India coach Gautam Gambhir got taunted by fans at the Sawai Mansingh Stadium. The fans went berserk in Jaipur after Rohit Sharma scored his fastest ever List A hundred on his comeback to the Vijay Hazare Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-calls-ashes-tour-toughest-test-england-captain-vows-to-face-it-head-on-2841214-2025-12-24",
      "headline": "Stokes calls Ashes tour his toughest test as England captain, vows to face it head onUnder intense scrutiny after going 0–3 down in the Ashes, England captain Ben Stokes has called it the toughest phase of his leadership but insists he will not run away from responsibility, backing his players to finish strong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sakibul-gani-mother-sacrifice-fastest-vijay-hazare-trophy-century-2841177-2025-12-24",
      "headline": "A mother's sacrifice, a son's record: Sakibul hits fastest Vijay Hazare hundredOnce his mother was forced to pawn her jewelry so he could own a bat, Bihar captain Sakibul Gani has now scored the fastest hundred in the history of the Vijay Hazare Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bavuma-pant-bumrah-bauna-remark-apology-conrad-grovel-2841141-2025-12-24",
      "headline": "Bavuma on Bumrah-Pant apology over bauna remark, Conrad grovel commentTemba Bavuma said that Indian stars Jasprit Bumrah and Rishabh Pant apologised to him for the Bauna remark and reacted to the grovel comment made by South Africa coach Shukri Conrad during the Test series against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrahs-no-1-test-rank-in-danger-tilak-varma-enters-top-3-in-t20is-2841107-2025-12-24",
      "headline": "Jasprit Bumrah's no 1 Test rank in danger, Tilak Varma enters top 3 in T20IsIndia fast bowler Jasprit Bumrah's reign at the top of the ICC bowling rankings is under threat as Pat Cummins jumped four places to be on the second spot. Tilak Varma has entered top 3 in T20Is, following his heroics against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/city-football-group-exit-mumbai-city-fc-isl-uncertainty-2841103-2025-12-24",
      "headline": "City group pulls out of Mumbai City FC due to Indian football uncertainty: ReportIn a big blow to Indian football, the City Football Group have decided to pull out of Mumbai City FC, according to a latest report. CFG have been asssociated with Mumbai since 2019 and helped change the fortunes of the club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-hazare-trophy-virat-kohli-hundred-delhi-vs-ap-2841101-2025-12-24",
      "headline": "Watch: Virat Kohli marks Vijay Hazare Trophy return with vintage hundred for DelhiReturning to the Vijay Hazare Trophy after nearly 15 years, Virat Kohli marked his comeback with a commanding century, reminding everyone why he remains one of the finest batters in the 50-over game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-monty-panesar-coach-brendon-mccullum-england-ashes-australia-2841091-2025-12-24",
      "headline": "Ravi Shastri backed to replace Brendon McCullum as England coach after Ashes defeatFormer England spinner Monty Panesar has urged England to turn to Ravi Shastri as a replacement for Brendon McCullum, arguing that the ex-India coach's proven success against Australia makes him the ideal candidate to revive the team after a disappointing Ashes campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-hazare-trophy-rohit-sharma-century-list-a-record-jaipur-mumbai-vs-sikkim-2841071-2025-12-24",
      "headline": "Rohit Sharma hits 62-ball hundred, goes on six-hitting spree in JaipurVijay Hazare Trophy 2025-26: Rohit Sharma had hit eight sixes and nine boundaries when he got to his hundred in just 62 balls for Mumbai against Sikkim in Jaipur. Rohit was playing his first domestic 50-over game in eight years. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-advice-cameron-green-ashes-test-cricket-2841070-2025-12-24",
      "headline": "Keep it simple: Cameron Green told not to tinker his game for Ashes by PontingRicky Ponting has told Cameron Green to keep things simple and not to tinker with his game after his struggles in the ongoing Ashes 2025 series. Green has scored 76 in three Tests for Australia in Ashes 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-vijay-hazare-trophy-half-century-mumbai-vs-sikkim-2841063-2025-12-24",
      "headline": "Rohit Sharma thrills Jaipur with quickfire fifty on Vijay Hazare returnRohit Sharma's long-awaited Vijay Hazare return turned into a Jaipur spectacle. The former India captain thrilled a packed Sawai Mansingh Stadium, racing to a 27-ball half-century that underlined his enduring class."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/swastik-samal-list-a-double-century-odisha-vijay-hazare-trophy-2841061-2025-12-24",
      "headline": "Vijay Hazare Trophy: Odisha's Swastik Samal scripts history, hits 212 off 169 ballsOdisha's Swastik Samal created history as he scored a double hundred for Odisha against Saurashtra in Alur on Wednesday, December 24. Samal's knock helped Odisha scored 345 for six against Saurashtra in the Vijay Hazare Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-sachin-tendulkar-second-indian-16000-list-a-runs-2841054-2025-12-24",
      "headline": "Virat Kohli emulates Sachin, becomes second Indian to 16,000 List A runsVirat Kohli celebrated his return to domestic cricket by becoming only the second Indian batter after Sachin Tendulkar to complete 16,000 runs in List A cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bihar-574-vaibhav-190-gani-128-world-records-vijay-hazare-trophy-2841028-2025-12-24",
      "headline": "Bihar 574. Vaibhav 190. Gani 128. World records tumble in Vijay Hazare TrophyBihar finished with a mammoth 574 for 6, shattering the previous List A record held by Tamil Nadu, who had posted 506 for 2 against Arunachal Pradesh in the same tournament in 2022. The historic batting effort was led by centuries from Vaibhav Suryavanshi (190), Ayush Loharuka (116) and Sakibul Gani."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-century-vijay-hazare-trophy-jharkhand-412-karnataka-2841032-2025-12-24",
      "headline": "After T20 World Cup selection, Kishan slams 33-ball 100 in Vijay Hazare TrophyIshan Kishan celebrated his Team India selection with a stunning 33-ball century in the Vijay Hazare Trophy. His explosive innings helped Jharkhand post a massive score of 412/9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sakibul-gani-fastest-list-a-century-bihar-record-total-vijay-hazare-trophy-2841008-2025-12-24",
      "headline": "Vijay Hazare: Bihar captain smashes 32-ball 100, fastest by Indian in List ABihar captain Sakibul Gani set a new record for the fastest List A century by an Indian. His innings helped Bihar post the highest ever List A team total of 574/6."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-australia-vs-england-boxing-day-test-jofra-archer-injury-ollie-pope-2840977-2025-12-24",
      "headline": "Jofra Archer breaks down again, Pope axed as England name Boxing Day Test XIEngland's Ashes campaign worsens as Jofra Archer is ruled out with a side strain. The team also drops Ollie Pope amid poor form, signalling major changes ahead of the Boxing Day Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-brendon-mccullum-england-head-coach-ted-lasso-way-reality-check-aus-vs-eng-2840980-2025-12-24",
      "headline": "Brendon McCullum's Lasso-way with England has turned into one harsh reality checkBrendon McCullum's Ted Lasso-style belief reshaped England's Test cricket. Australia's Ashes summer showed that optimism alone fades quickly without preparation and adaptability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-vijay-hazare-trophy-return-mumbai-jaipur-cricket-fans-cheering-2840957-2025-12-24",
      "headline": "Rohit Sharma fever in Jaipur: Over 10,000 turn up, stadium echoes with chantsVijay Hazare Trophy 2025: Over 10,000 fans turned up to watch Rohit Sharma's return to the premier domestic 50-over tournament at the Sawai Mansingh Stadium on Wednesday, December 24. Rohit took the field for Mumbai against Sikkim while Virat Kohli played for Delhi against Andhra in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-captaincy-era-disappointing-no-icc-trophies-tom-moody-2840951-2025-12-24",
      "headline": "Kohli's captaincy had high expectations but ended in disappointment: Tom MoodyTom Moody has given a blunt verdict on Virat Kohli's captaincy tenure, calling it disappointing. However, AB de Villiers said that it's unfair to judge a captain by only ICC trophies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-vijay-hazare-trophy-century-second-fastest-u19-asia-cup-controversy-2840907-2025-12-24",
      "headline": "Vaibhav Suryavanshi smashes 2nd fastest Vijay Hazare 100Vaibhav Suryavanshi responded to Asia Cup disappointment with a stunning Vijay Hazare century. The 14-year-old's record-breaking knock reinforced his reputation as one of India's most exciting young batting talents."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}