{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/centre-approves-madhya-pradeshs-request-for-soybean-procurement-at-msp-2599830-2024-09-14",
      "headline": "Centre approves Madhya Pradesh's request for soybean procurement at MSPUnion Agriculture and Farmer Welfare Minister Shivraj Singh Chouhan confirmed that the proposal from the Madhya Pradesh government was received and approved late Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/minimum-export-price-limit-basmati-rice-onion-outbound-shipments-and-enhance-farmers-income-2599748-2024-09-14",
      "headline": "Centre lifts minimum export price cap on onion, basmati riceThe $950 per tonne minimum export price for basmati rice has been removed while the export duty on onion has been cut to 20 per cent from 40 per cent, in effect from September 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-expected-listing-gains-double-investors-wealth-latest-gmp-2599745-2024-09-14",
      "headline": "Bajaj Housing Finance IPO: Will it double investors' wealth on market debut?Bajaj Housing Finance IPO listing: With the GMP indicating a significant upside, all eyes are now on whether the shares will live up to the hype and deliver the bumper listing gains many expect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-election-2024-trump-allies-plan-to-privatise-fannie-and-freddie-says-report-2599379-2024-09-13",
      "headline": "Trump allies plan to privatise Fannie and Freddie, says reportThe discussions involve prominent figures close to Trump, including Larry Kudlow, the former director of the National Economic Council, and John McEntee, who previously worked in the White House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-chief-madhabi-puri-buch-dhaval-address-conflict-of-interest-charges-3-big-clarifications-joint-statemet-2599223-2024-09-13",
      "headline": "Sebi chief addresses conflict of interest allegations with 3 big clarificationsThe Buchs firmly denied any wrongdoing, offering detailed explanations to counter allegations tied to consulting roles, rental income, and Madhabi Puri Buch's ICICI Bank stock options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-share-market-strong-rally-break-bajaj-finance-finserv-2599227-2024-09-13",
      "headline": "Sensex, Nifty end lower as markets take breather after strong rallyThe S&P BSE Sensex fell 135.83 points to 82,926.88, while the NSE Nifty50 settled 43 points lower at 25,345.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-listing-gains-hype-with-big-returns-investor-profit-latest-gmp-2599196-2024-09-13",
      "headline": "Bajaj Housing Finance IPO: Cash in on listing day or wait for long-term gain? Brokerages tracking the IPO have already indicated that the IPO is set for a positive listing, with the grey market premium (GMP) indicating that investors will see their money double on listing day."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sebi-chief-madhabi-puri-buch-rejects-allegations-conflict-of-interest-statement-false-malicious-defamatory-breaks-silence-2599190-2024-09-13",
      "headline": "Sebi chief, husband reject conflict of interest charges, call it false, motivatedIn a joint statement, Sebi chief Madhabi Puri Buch and husband Dhaval Buch rejected recent allegations of conflict of interest as \"false, malicious, and defamatory.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-finance-bajaj-finserv-shares-gain-amid-housing-unit-ipo-buzz-2599120-2024-09-13",
      "headline": "Bajaj Finance, Bajaj Finserv shares gain amid housing unit IPO buzzThe buzz around the Bajaj Housing Finance IPO, which is set to make its stock market debut on September 16, has led traders on Dalal Street to snap up shares of other publicly traded Bajaj companies, hoping to capitalise on the momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/western-carriers-ipo-opens-for-bidding-subscribe-or-skip-good-or-bad-key-details-gmp-expert-view-2599104-2024-09-13",
      "headline": "Western Carriers IPO opens for bidding: Should you subscribe or skip? Western Carriers (India) Limited has allocated 85,96,743 equity shares to 15 anchor investors, raising Rs 148 crore before its proposed IPO."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-shares-surge-9-percent-what-fueling-the-rally-and-will-it-continue-2599086-2024-09-13",
      "headline": "SpiceJet shares surge 9%: What's fuelling the rally and will it continue?SpiceJet share price: Despite regulatory challenges, the airline's shares have surged recently. Will the rally hold?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pn-gadgil-jewellers-ipo-allotment-check-application-status-latest-gmp-bse-bigshare-services-2599066-2024-09-13",
      "headline": "PN Gadgil Jewellers IPO allotment: Step-by-step guide to check statusPN Gadgil Jewellers IPO allotment: If you've applied for the IPO, you can check the allotment status online in a few simple steps through the websites of the BSE and Bigshare Services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-allotment-expected-listing-gains-110-percent-gmp-2599039-2024-09-13",
      "headline": "Bajaj Housing Finance IPO: Got allotment? Check expected listing gainsBrokerages tracking the IPO have already indicated that the IPO is set for a positive listing, with the grey market premium (GMP) indicating that investors will see their money double on listing day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-shares-drop-after-hindenburg-fresh-allegations-2599025-2024-09-13",
      "headline": "Adani Group shares drop after Hindenburg's fresh allegationsHindenburg Research claimed that Swiss authorities had frozen over $310 million across several Swiss bank accounts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-fall-record-highs-bajaj-finserv-finance-shares-gain-2599020-2024-09-13",
      "headline": "Sensex, Nifty pause rally near record highs; Bajaj twins gainThe S&P BSE Sensex fell 134.05 points to 82,828.66 at 10:28 am, while the NSE Nifty50 fell 44.30 points to 25,344.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindenburg-research-swiss-authorities-freeze-310-million-funds-adani-group-probe-2598886-2024-09-12",
      "headline": "Adani Group rejects Hindenburg claim of Swiss banks' $310 million funds freezeHindenburg cited a Swiss media outlet, Gotham City, which alleged that more than $310 million belonging to an alleged frontman for billionaire Gautam Adani is sequestered in six Swiss banks. The Adani Group \"unequivocally\" rejected the claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-flipkart-violating-indian-competition-laws-competition-commission-of-india-report-2598813-2024-09-12",
      "headline": "Amazon, Flipkart found violating Indian competition laws: ReportA probe by the Competition Commission of India (CCI) found that e-commerce giants Amazon and Flipkart engaged in anti-competitive practices by favouring select sellers on their platforms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/understanding-circle-rates-a-simple-guide-for-homebuyers-and-sellers-2598648-2024-09-12",
      "headline": "Understanding circle rates: A simple guide for homebuyers and sellersUnderstanding the concept of circle rates, and how they influence property valuations, has become critical for anyone navigating the real estate market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-retail-inflation-cpi-data-365-per-cent-august-2598623-2024-09-12",
      "headline": "Retail inflation rises to 3.65% in August, second lowest in last five yearsRetail inflation rises to 3.65 per cent in August compared to 3.6 per cent in July, as per government data. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-semiconductor-boom-top-stocks-best-pick-semicon-expert-view-investment-tips-spel-vedanta-kaynes-2598569-2024-09-12",
      "headline": "India's semiconductor boom: These stocks could be your best pickThe development of the semiconductor value chain—ranging from chip design to manufacturing and assembly, is expected to benefit various companies in the sector."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-doda-rally-slams-congress-india-today-reporter-assault-rohit-sharma-2599760-2024-09-14",
      "headline": "India's son insulted in US: PM jabs Congress on India Today reporter assaultPM Modi, speaking at a rally in Kashmir, accused the Congress of 'indulging in brutality' after an India Today journalist said he was assaulted by Rahul Gandhi's team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-pakistan-asian-champions-trophy-harmanpreet-singh-double-2599814-2024-09-14",
      "headline": "Harmanpreet Singh double gives India 2-1 win over PakistanIndia extended their dominance over Pakistan with a thrilling 2-1 comeback victory in their final Asian Champions Trophy group-stage match, securing a perfect record and advancing to the semi-finals in a fiercely competitive encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-kolkata-protest-site-doctors-meet-demonstration-rg-kar-rape-murder-2599752-2024-09-14",
      "headline": "Haven't slept for nights too: Mamata Banerjee visits protesting doctorsWhile addressing the protesting doctors, West Bengal Chief Minister Mamata Banerjee said that she came to meet them as their 'didi' (elder sister) and not as chief minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-rain-cleanest-aqi-52-record-september-rain-strong-wind-2599809-2024-09-14",
      "headline": "Delhi sees year's cleanest air quality after record September rainDelhi exceeded both its annual and seasonal average rainfall in the early days of September, with total rainfall crossing the 1,000 mm mark. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-on-women-safety-every-industry-should-have-a-hema-committee-2599825-2024-09-14",
      "headline": "Ananya Panday on women's safety: Every industry should have a Hema CommitteeDuring a special session at India Today Mind Rocks 2024 Youth Summit, actor Ananya Panday highlighted the importance of women's safety in the film industry. She referred to the Hema Committee report and talked about establishing a body like that in every film industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chetan-bhagat-papita-theory-papaya-banana-author-india-today-mind-rocks-youth-summit-2024-fiction-social-commentary-modern-india-online-trolls-negativity-2599706-2024-09-14",
      "headline": "Happy to be papaya, don't want to be banana: Chetan Bhagat on online trollsOne of the best-selling authors, Chetan Bhagat, attended India Today Mind Rocks Youth Summit 2024 on Saturday and spoke on his success formula, freedom of expression and online trolls and negativity.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/donald-trumps-theyre-eating-the-dogs-remark-is-now-a-song-watch-hilarious-video-2599722-2024-09-14",
      "headline": "Trump's 'eating cats, dogs' claim gets its own parody. Video viralSouth African music sensation David Scott, popularly known as The Kiffness, has turned Donald Trump's strange debate remark about immigrants \"eating pets\" into a viral song. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-new-member-cow-gives-birth-calf-deepjyoti-name-petting-kissing-calf-2599736-2024-09-14",
      "headline": "PM Modi welcomes new member 'Deepjyoti' to family, shares videoPrime Minister Narendra Modi shared pictures and a video on X where he can be seen petting and kissing the calf, 'Deepjyoti'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/story/women-safety-in-entertainment-television-stars-call-for-change-in-industry-metoo-hema-committee-report-2598353-2024-09-14",
      "headline": "Women's safety in entertainment: TV stars and their call for change in industryRecent discussions on women's safety in the entertainment industry have been intensified by the #MeToo movement and the Hema Committee Report, both highlighting the need for reforms to protect women from harassment and abuse. For this Cinematic Saturday, several stars have shed light on how this issue extends beyond films to television, as they advocate for safer working conditions on shooting sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ghaziabad-shopkeeper-mixes-urine-with-juice-thrashed-arrested-2599695-2024-09-14",
      "headline": "Ghaziabad shopkeeper thrashed by locals for mixing urine with juiceAfter the police were alerted, they conducted a search in the juice stall and recovered a plastic can filled with urine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/otd-in-2007-ms-dhonis-india-won-famous-bowl-out-vs-pakistan-in-t20-world-cup-2599784-2024-09-14",
      "headline": "OTD in 2007: MS Dhoni's India won famous 'bowl-out' vs Pakistan in T20 World CupOn this Day in 2007, India registered a historic win in a bowl-out vs Pakistan in the inaugural edition of the T20 World Cup. India won the tie-breaker 3-0 against their arch-rivals. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-on-gyanvapi-mosque-varanasi-lord-shiva-temple-uttar-pradesh-2599799-2024-09-14",
      "headline": "Yogi Adityanath says Gyanvapi Mosque is actually 'Lord Shiva temple'The UP Chief Minister said that this confusion over Gyanvapi's title is the biggest hurdle not only in the way of worshipping and offering prayers at the site, but also national unity and integrity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/earth-to-get-a-new-mini-moon-planets-gravity-to-capture-rare-space-rock-2599684-2024-09-14",
      "headline": "Earth to get new moon as planet's gravity captures rare space rockEarth's new mini-moon will loop around the planet but will not complete a full orbit. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-ncr-rain-faridabad-flooded-underpass-death-video-2599694-2024-09-14",
      "headline": "Bank employees die after SUV gets stuck in submerged Faridabad underpassA police official stated that the victims were warned about the underpass being submerged due to heavy rain in Delhi-NCR. However, the two insisted on driving through it. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jaishankar-swipe-rahul-gandhi-life-is-not-khata-khat-geneva-2599645-2024-09-14",
      "headline": "Life is not khata-khat: S Jaishankar's veiled dig at Rahul Gandhi in GenevaJaishankar made the remark while he was speaking on the infrastructural development undertaken by the Narendra Modi-led government at an event in Geneva.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-shraddha-srinath-on-hema-committee-need-structured-body-to-fight-sexual-abuse-2599721-2024-09-14",
      "headline": "Actor Shraddha Srinath on Hema Committee: Need structured body to fight sexual abuseActor Shraddha Srinath, who has worked in the South Indian film industry, commented on the Hema Committee report at India Today Mind Rocks 2024 Summit, and highlighted the importance of having a structured body to help women facing sexual abuse in the industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/khalbali-records-review-ram-kapoor-musical-drama-hits-some-high-notes-misses-others-2599570-2024-09-14",
      "headline": "Khalbali Records review: This musical drama hits some high notes, misses othersReleased-Thu Sep 12, 2024Khalbali Records, directed by Devanshu Singh, dives into the clash between artistic integrity and commercial ambition. The series features a mix of seasoned actors and fresh faces, presenting a bold take on the music industry. But is it worth your time? Let's find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-business-sports-entertainment-421-13-09-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/karnataka-minister-priyank-kharge-siddaramaiah-governor-chief-minister-bengaluru-jobs-2599758-2024-09-14",
      "headline": "Governor being misused: Priyank Kharge on action against SiddaramaiahPriyank Kharge, speaking at the India Today Mind Rocks Youth Summit, rejected rumours of a leadership change in Karnataka and stressed that Siddaramaiah had the backing of the Cabinet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vinesh-phogat-pt-usha-ioa-harish-salve-paris-olympics-2024-wrestling-2599666-2024-09-14",
      "headline": "Vinesh Phogat didn't want to challenge CAS' verdict: Lawyer Harish SalveSenior lawyer Harish Salve debunked wrestler Vinesh Phogat's allegations regarding leniency by the Indian Olympic Association lawyers while fighting her case in the Court of Arbitration for Sport during the Paris Olympics 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/tv-host-robert-alleva-interacts-with-worlds-oldest-crocodile-henry-in-viral-video-2599664-2024-09-14",
      "headline": "TV host Robert Alleva interacts with 'world's oldest crocodile' in viral videoIn a viral video, TV personality Robert Alleva interacts with a massive Nile crocodile believed to be the world's oldest living crocodile. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-bjp-mla-bijapur-city-basangouda-patil-yatnal-rahul-gandhi-caste-political-row-2599660-2024-09-14",
      "headline": "Karnataka BJP MLA's 'Muslim or Christian' jab at Rahul Gandhi stirs rowThe BJP MLA from Karnataka's Bijapur City Assembly Constituency called for an investigation to be done to ascertain the Congress leader's true lineage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/army-personnel-injured-gunfight-terrorists-jammu-kashmir-kishtwar-2599468-2024-09-13",
      "headline": "2 soldiers dead in J&K encounter, 3 terrorists killed in another operationFour Army personnel were injured in an encounter in Kishtwar. Two of them, including a Junior Commissioned Officer, succumbed to injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cbse-issues-notices-to-27-schools-for-violating-enrollment-and-attendance-norms-2599772-2024-09-14",
      "headline": "CBSE issues notices to 27 schools for violating enrollment and attendance normsCBSE has issued show-cause notices to 27 schools in Delhi and Rajasthan for violating its regulations. These actions follow surprise inspections that revealed issues with enrollment, attendance, and infrastructure compliance.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/esha-deol-recalls-slapping-a-man-for-touching-her-inappropriately-at-film-screening-2599833-2024-09-14",
      "headline": "Esha Deol recalls slapping a man for touching her inappropriately at film screeningEsha Deol recently recounted a disturbing incident that took place at a screening of her film Dus. She revealed that a man had harassed her, prompting her to slap him publicly. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-on-women-safety-every-industry-should-have-a-hema-committee-2599825-2024-09-14",
      "headline": "Ananya Panday on women's safety: Every industry should have a Hema CommitteeDuring a special session at India Today Mind Rocks 2024 Youth Summit, actor Ananya Panday highlighted the importance of women's safety in the film industry. She referred to the Hema Committee report and talked about establishing a body like that in every film industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-metoo-mindful-choices-call-me-bae-india-today-mind-rocks-2024-2599778-2024-09-14",
      "headline": "Ananya Panday on Call Me Bae addressing MeToo: Able to speak through workAnanya Panday discussed her commitment to social issues and the importance of aligning her work with her beliefs at the India Today Mind Rocks Youth Summit 2024 in Bengaluru. The actor cited the example of her latest show, Call Me Bae, to speak out on MeToo and women's safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/video/bhuvan-bam-on-meeting-shah-rukh-khan-taaza-khabar-2-and-more-2599811-2024-09-14",
      "headline": "Bhuvan Bam on meeting Shah Rukh Khan, Taaza Khabar 2 and moreActor and YouTuber Bhuvan Bam recently shared his experience of meeting Bollywood superstar Shah Rukh Khan for the first time. Bhuvan, who was a guest at the India Today Mind Rocks Youth Summit 2024, also discussed his upcoming collaboration with Jaaved Jaffrey on the series Taaza Khabar 2. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-anshul-picks-5-wicket-haul-with-rinku-musheer-and-sarfaraz-scalps-2599829-2024-09-14",
      "headline": "Duleep Trophy: Anshul picks 5-wicket haul with Rinku, Musheer and Sarfaraz scalpsDuleep Trophy 2024: India C's Anshul Kamboj picked a five-wicket haul against India B on Day 3 of the contest. This was his maiden five-wicket haul in first-class cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ms-dhoni-or-virat-kohli-navdeep-singh-paralympics-2024-2599824-2024-09-14",
      "headline": "MS Dhoni or Virat Kohli? Navdeep Singh reveals his favourite India cricketerIndia's para athlete Navdeep Singh recently revealed his favourite cricketer. Navdeep scripted history for India with a gold medal win at the Paralympic Games in Paris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-pakistan-asian-champions-trophy-harmanpreet-singh-double-2599814-2024-09-14",
      "headline": "Harmanpreet Singh double gives India 2-1 win over PakistanIndia extended their dominance over Pakistan with a thrilling 2-1 comeback victory in their final Asian Champions Trophy group-stage match, securing a perfect record and advancing to the semi-finals in a fiercely competitive encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/otd-in-2007-ms-dhonis-india-won-famous-bowl-out-vs-pakistan-in-t20-world-cup-2599784-2024-09-14",
      "headline": "OTD in 2007: MS Dhoni's India won famous 'bowl-out' vs Pakistan in T20 World CupOn this Day in 2007, India registered a historic win in a bowl-out vs Pakistan in the inaugural edition of the T20 World Cup. India won the tie-breaker 3-0 against their arch-rivals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/naomi-osaka-parts-ways-with-coach-wim-fissette-after-early-us-open-exit-2599761-2024-09-14",
      "headline": "Naomi Osaka parts ways with coach Wim Fissette after early US Open exitNaomi Osaka split her ways with coach Wim Fissette after her round two exit at the US Open 2024 last month. She wrote a heartfelt message on her Instagram story to announce the decision. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jonty-rhodes-hilarious-take-on-bcci-rejecting-him-as-indias-fielding-coach-2599749-2024-09-14",
      "headline": "Jonty Rhodes gives hilarious rant on not being picked as India fielding coachFormer South Africa cricketer Jonty Rhodes had a hilarious take on not being picked as the fielding coach of the Indian Cricket team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pratham-singh-scores-maiden-duleep-trophy-hundred-for-india-a-in-explosive-style-2599734-2024-09-14",
      "headline": "Pratham Singh scores maiden Duleep Trophy hundred for India A in explosive styleDuleep Trophy 2024: Pratham Singh notched up his second first-class hundred during Indi A vs India D match in Anantapur. This was his first-ever century in the Duleep Trophy tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-pakistan-hockey-asian-champions-trophy-live-score-harmanpreet-singh-hulunbuir-2599732-2024-09-14",
      "headline": "IND vs PAK, Hockey Highlights: India script 2-1 comeback win Skipper Harmanpreet Singh's double gave India a 2-1 comeback win over their arch-rivals Pakistan, who had initially taken early lead from an Ahmad Nadeem strike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-sunil-chhetri-bengaluru-fc-deserve-title-plans-retirement-talks-2599726-2024-09-14",
      "headline": "Bengaluru FC deserves another title: Sunil Chhetri sets ISL plans straightSunil Chhetri, former Indian football captain, is determined to lead Bengaluru FC to another ISL title, marking his first season focused solely on club football after retiring from international duties earlier this year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-duleep-trophy-basit-ali-ind-vs-ban-2599705-2024-09-14",
      "headline": "Shreyas Iyer doesn't have the hunger for red-ball cricket anymore: Basit AliFormer Pakistan batter Basit Ali feels that Shreyas Iyer doesn't have the hunger anymore to play red ball cricket. Iyer has only scored one half-century in three innings in the ongoing Duleep Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-andriy-lunin-contract-extension-goalkeeper-la-liga-ballon-dor-2599704-2024-09-14",
      "headline": "Lunin continues with Real Madrid: Pens long-term contract extensionAndriy Lunin has signed a surprising contract extension with Real Madrid, committing to the club until 2030 after an outstanding season where he stepped up in Thibaut Courtois' absence and proved his value in goal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pratham-singh-scores-maiden-duleep-trophy-hundred-for-india-a-in-explosive-style-2599734-2024-09-14",
      "headline": "Pratham Singh scores maiden Duleep Trophy hundred for India A in explosive styleDuleep Trophy 2024: Pratham Singh notched up his second first-class hundred during Indi A vs India D match in Anantapur. This was his first-ever century in the Duleep Trophy tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-pakistan-hockey-asian-champions-trophy-live-score-harmanpreet-singh-hulunbuir-2599732-2024-09-14",
      "headline": "IND vs PAK, Hockey Highlights: India script 2-1 comeback win Skipper Harmanpreet Singh's double gave India a 2-1 comeback win over their arch-rivals Pakistan, who had initially taken early lead from an Ahmad Nadeem strike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-sunil-chhetri-bengaluru-fc-deserve-title-plans-retirement-talks-2599726-2024-09-14",
      "headline": "Bengaluru FC deserves another title: Sunil Chhetri sets ISL plans straightSunil Chhetri, former Indian football captain, is determined to lead Bengaluru FC to another ISL title, marking his first season focused solely on club football after retiring from international duties earlier this year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-duleep-trophy-basit-ali-ind-vs-ban-2599705-2024-09-14",
      "headline": "Shreyas Iyer doesn't have the hunger for red-ball cricket anymore: Basit AliFormer Pakistan batter Basit Ali feels that Shreyas Iyer doesn't have the hunger anymore to play red ball cricket. Iyer has only scored one half-century in three innings in the ongoing Duleep Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-andriy-lunin-contract-extension-goalkeeper-la-liga-ballon-dor-2599704-2024-09-14",
      "headline": "Lunin continues with Real Madrid: Pens long-term contract extensionAndriy Lunin has signed a surprising contract extension with Real Madrid, committing to the club until 2030 after an outstanding season where he stepped up in Thibaut Courtois' absence and proved his value in goal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadavs-wife-devisha-wishes-happy-birthday-to-her-best-friend-on-insta-2599702-2024-09-14",
      "headline": "Suryakumar Yadav's wife Devisha wishes happy birthday to 'best friend' on InstaSuryakumar Yadav's wife Devisha Shetty extended her warm birthday wishes to India's T20I captain via a special Instagram post. The star batter turned 34 on September 14, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/diamond-league-final-2024-neeraj-chopra-diamond-trophy-brussels-2599682-2024-09-14",
      "headline": "Neeraj Chopra looks to reclaim Diamond Trophy, breach 90m-mark in BrusselsDiamond League Final 2024: Neeraj Chopra will be looking to reclaim the coveted Diamond Trophy when he competes in a seven-man field in Brussels on Saturday. The two-time Olympic medalist, who has been battling a groin niggle throughout the season, will be hoping to push hard for one last time this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-morne-morkel-bowling-coach-job-dad-phone-call-special-moment-2599674-2024-09-14",
      "headline": "Morne Morkel reveals phone call with dad after landing India jobMorne Morkel recalled the emotional moment when he called his father after being appointed as India's bowling coach. Reuniting with Gautam Gambhir, Morkel now prepares for his role in the upcoming Test series against Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vinesh-phogat-pt-usha-ioa-harish-salve-paris-olympics-2024-wrestling-2599666-2024-09-14",
      "headline": "Vinesh Phogat didn't want to challenge CAS' verdict: Lawyer Harish SalveSenior lawyer Harish Salve debunked wrestler Vinesh Phogat's allegations regarding leniency by the Indian Olympic Association lawyers while fighting her case in the Court of Arbitration for Sport during the Paris Olympics 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-ben-chillwell-chelsea-first-team-return-enzo-maresca-plans-2599663-2024-09-14",
      "headline": "Chilwell set for Chelsea first team return after being exiled by MarescaChelsea left-back Ben Chilwell will return to first-team training after initially being sidelined by new head coach Enzo Maresca. Following an unsuccessful transfer window, the club now seeks a solution for the 27-year-old defender's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-series-spin-over-reliant-pace-attack-taskin-ahmed-2599654-2024-09-14",
      "headline": "No more spin dependency, pacey Bangladesh look to challenge India in TestsIND vs BAN: Bangladesh's pace battery, which has Hasan Mahmud, Taskin Ahmed and Nahid Rana, will be in focus in the Test series against Rohit Sharma's India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-angry-moment-csk-ipl-subramaniam-badrinath-recalls-rcb-2599651-2024-09-14",
      "headline": "When MS Dhoni lost his cool: Badrinath recalls rare CSK angry momentFormer CSK batter Subramaniam Badrinath recalled a rare moment when MS Dhoni lost his cool after a low-scoring defeat to RCB, giving fans a rare glimpse into the controlled anger of the usually composed \"Captain Cool.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-ban-will-bangladesh-spinners-script-historic-victory-in-india-2599647-2024-09-14",
      "headline": "Records in sight, Virat Kohli eyes return to vintage best in TestsVirat Kohli hasn't been at his best in Test cricket ever since the post-Covid era. However, the star batter managed to get amongst the runs scoring two hundreds in 2023. Kohli will next face the stern Bangladesh challenge on home soil as he aims to return to his vintage best in whites."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-ben-chillwell-chelsea-first-team-return-enzo-maresca-plans-2599663-2024-09-14",
      "headline": "Chilwell set for Chelsea first team return after being exiled by MarescaChelsea left-back Ben Chilwell will return to first-team training after initially being sidelined by new head coach Enzo Maresca. Following an unsuccessful transfer window, the club now seeks a solution for the 27-year-old defender's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-series-spin-over-reliant-pace-attack-taskin-ahmed-2599654-2024-09-14",
      "headline": "No more spin dependency, pacey Bangladesh look to challenge India in TestsIND vs BAN: Bangladesh's pace battery, which has Hasan Mahmud, Taskin Ahmed and Nahid Rana, will be in focus in the Test series against Rohit Sharma's India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-angry-moment-csk-ipl-subramaniam-badrinath-recalls-rcb-2599651-2024-09-14",
      "headline": "When MS Dhoni lost his cool: Badrinath recalls rare CSK angry momentFormer CSK batter Subramaniam Badrinath recalled a rare moment when MS Dhoni lost his cool after a low-scoring defeat to RCB, giving fans a rare glimpse into the controlled anger of the usually composed \"Captain Cool.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-ban-will-bangladesh-spinners-script-historic-victory-in-india-2599647-2024-09-14",
      "headline": "Records in sight, Virat Kohli eyes return to vintage best in TestsVirat Kohli hasn't been at his best in Test cricket ever since the post-Covid era. However, the star batter managed to get amongst the runs scoring two hundreds in 2023. Kohli will next face the stern Bangladesh challenge on home soil as he aims to return to his vintage best in whites."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-inter-miami-injury-return-major-league-soccer-tata-martino-2599640-2024-09-14",
      "headline": "Lionel Messi set for Inter Miami return after 2 months of injuryLionel Messi will return to action for Inter Miami after being sidelined for two months due to injury, as confirmed by club coach Tata Martino. Messi's availability is set to provide a timely boost for the club's pursuit of the MLS points record this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-chennai-test-najmul-hossain-shanto-rohit-sharma-2599637-2024-09-14",
      "headline": "Najmul Hossain Shanto aims to carry forward 'belief' from Pakistan victoryBangladesh captain Najmul Hossain Shanto is looking to carry forward their belief from the recent victory over Pakistan into the upcoming Test series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-aus-2nd-t20i-liam-livingstone-matthew-short-jacob-bethell-jake-fraser-mcgurk-2599627-2024-09-14",
      "headline": "ENG vs AUS: Liam Livingstone's fireworks help England level series in CardiffEngland made a remarkable comeback in the three-match T20I series against Australia as they beat them by three wickets in the second T20I courtesy of an all-round show by Liam Livingstone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/diamond-league-final-result-avinash-sable-steeplechase-amos-serem-el-bakkali-2599565-2024-09-14",
      "headline": "Avinash Sable finishes 9th, Kenya's Serem beats Olympic champion El BakkaliDiamond League Final 2024: India's national record holder Avinash Sable finished 9th in the 12-man race in Brussels on Friday. 22-year-old Kenyan Amos Serem won the Diamond Trophy, beating Olympic champion Soufiane El Bakkali in a thrilling finish. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}