{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-3-online-filing-begins-are-you-eligible-and-what-is-new-2763419-2025-07-30",
      "headline": "ITR-3 online filing begins: Are you eligible and what's new?The Income Tax Department has kick-started online filing for ITR-3, bringing relief to taxpayers with more complex income sources. If you're wondering whether this applies to you and what's changed this year, here's everything in simple terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/investment-advisor-advice-newly-married-couple-five-tips-about-money-savings-2763406-2025-07-30",
      "headline": "Talk money like you talk love: Investment advisor's advice for newlywedsAn investment advisor's advice to young couples goes beyond numbers. Abhishek Kumar emphasises that financial clarity is just as essential as emotional honesty when building a strong, lasting marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/gng-electronics-share-price-listing-gains-50-percent-market-debut-sell-hold-review-2763400-2025-07-30",
      "headline": "GNG Electronics shares make bumper debut at 50% premium. Sell or hold?GNG Electronics shares listed at Rs 355 apiece on the NSE. This is nearly 50% higher than the IPO price of Rs 237 per share, giving early investors a sizeable gain on debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/international-monetary-fund-imf-lifts-indias-growth-forecast-for-2025-and-2026-to-64-percent-2763396-2025-07-30",
      "headline": "IMF lifts India's growth forecast for 2025 and 2026 to 6.4%India's steady growth projection comes as a bright spot in the global economic landscape, with the IMF stressing that policy continuity, labour reforms, and infrastructure investment will be crucial going forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-and-nifty-stock-market-under-pressure-reasons-behind-dalal-street-july-slide-2763382-2025-07-30",
      "headline": "Sensex and Nifty under pressure: What's behind Dalal Street's July slide?After months of strong gains, July brought a sobering pause to India's stock market rally. Expensive valuations, tepid earnings, and foreign outflows dragged indices down in a broad, sentiment-driven correction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sona-comstar-legal-notice-cease-and-desist-rani-kapur-sanjay-kapur-death-what-it-means-2763376-2025-07-30",
      "headline": "Sona Comstar sends cease-and-desist notice to Rani Kapur. What it meansSona Comstar has demanded that Rani Kapur withdraw her July 24 letter addressed to the board, shareholders, and stakeholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-larsen-and-toubro-share-price-jumped-over-4-percent-after-q1-results-2763364-2025-07-30",
      "headline": "Explained: Why L&T share price jumped over 4% after Q1 resultsL&T reported a 30% year-on-year rise in consolidated net profit to Rs 3,617 crore for the April–June quarter, beating analyst estimates. Revenue from operations rose 16% YoY to Rs 63,679 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-60-points-higher-nifty-above-24800-lt-up-3-percent-2763353-2025-07-30",
      "headline": "Sensex opens 60 points higher, Nifty above 24,800; L&T up 3%The S&P BSE Sensex added 45.19 points to 81,383.14, while the NSE Nifty50 gained 12.55 points to 24,833.65 as of 9:32 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-marks-a-notable-retreat-in-china-by-closing-a-store-there-for-the-first-time-ever-2763168-2025-07-30",
      "headline": "Apple is shutting a store in China for the first time. Here's whyFor the first time, Apple plans to shut a physical retail location in mainland China, a move that comes nearly two decades after it began operations there."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-july-30-trading-setup-stock-market-opening-tariff-earthquake-russia-trade-deal-delay-2763343-2025-07-30",
      "headline": "Earthquake and Trump tariff heat: Will stock markets open lower today?At 7:50 am, Gift Nifty futures were trading at 24,825 points, suggesting that the Nifty 50 will open near Tuesday's closing level of 24,821.1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-20-25-percent-tariff-donald-trump-bilateral-talks-august-1-deadline-report-2763326-2025-07-30",
      "headline": "Is the India-US trade deal on track? Trump shares new updateDonald Trump had earlier announced higher tariffs in April but delayed them by introducing a reduced 10% levy to allow room for negotiations. With the August 1 deadline approaching, pressure is building on both countries to make progress. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-delegation-set-to-visit-india-on-august-25-for-key-trade-discussions-2763066-2025-07-29",
      "headline": "US delegation set to visit India on August 25 for key trade discussionsIndia is asking the US to remove the proposed 26% extra tariff and reduce high duties on Indian steel and aluminium products, which currently face tariffs of up to 50%. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-2-reboot-review-tulsi-and-nostalgia-well-thats-it-2763411-2025-07-30",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi Review: Tulsi and nostalgia, well, that's itThe first episode of 'Kyunki Saas Bhi Kabhi Bahu Thi 2' is a nostalgic trip down memory lane, bringing back iconic characters and moments without much new development. While Smriti Irani's return as Tulsi warms the heart, the show heavily relies on past glory and familiar storylines. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pratham-files-complaint-against-darshan-fans-over-threatsa-2763405-2025-07-30",
      "headline": "After Ramya, actor Pratham files complaint against Darshan's fans over threatsActor Pratham has approached Bangalore rural police alleging threats from fans of actor Darshan. This follows similar complaints by actor-politician Ramya against abusive social media accounts linked to Darshan's supporters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-reboot-x-reviews-fans-get-emotional-say-show-is-nostalgia-pro-max-2763387-2025-07-30",
      "headline": "Kyunki Saas...reboot X reviews: Fans get emotional, say show is nostalgia pro max'Kyunki Saas Bhi Kabhi Bahu Thi' reboot starring Smriti Irani and Amar Upadhyay aired on television on July 29. The new season not only brought back several memories of the show, but left many emotional. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-ahaan-panday-aneet-padda-mohit-suri-romantic-drama-rs-500-crore-globally-2763361-2025-07-30",
      "headline": "Saiyaara box office Day 12: Ahaan-Aneet's love story eyes Rs 500 crore globallyMohit Suri's 'Saiyaara', featuring Ahaan Panday and Aneet Padda, has raked in an estimated Rs 266 crore in India within 12 days. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-collection-day-6-pawan-kalyan-film-crashes-fails-to-mint-rs-2-crore-2763356-2025-07-30",
      "headline": "Hari Hara Veera Mallu Day 6: Pawan Kalyan film crashes, fails to mint Rs 2 crorePawan Kalyan's 'Hari Hara Veera Mallu' has crashed at the box office. The period drama failed to mint even Rs 2 crore at the domestic box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/pamela-anderson-liam-neeson-dating-couple-address-relationship-rumours-2763350-2025-07-30",
      "headline": "Pamela Anderson, Liam Neeson dating? Couple address relationship rumoursActors Pamela Anderson and Liam Neeson walked the red carpet with their children, sparking rumours of a possible romance. The duo is set to appear together in the upcoming film, 'The Naked Gun'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunjay-kapur-wife-priya-sachdev-updates-instagram-name-succession-dispute-rani-kapur-2763348-2025-07-30",
      "headline": "Sunjay Kapur's wife Priya Sachdev updates Instagram name amid succession disputeLate businessman Sunjay Kapur's wife, Priya Sachdev, changed her Instagram name following a Rs 30,000 crore dispute with her mother-in-law. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-etharkkum-thunindhavan-flop-kanguva-retro-collections-director-pandiraj-2763338-2025-07-30",
      "headline": "Suriya's Etharkkum Thunindhavan did poor numbers, I take responsibility: DirectorDirector Pandiraj, in a recent interview, admitted that his film with Suriya, 'Etharkkum Thunindhavan', failed at the box office. He also claimed that the films that came after 'Etharkkum Thunindhavan' for Suriya didn't surpass the collections of his film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/can-kingdom-end-the-long-shadow-of-arjun-reddy-on-vijay-deverakonda-career-2763252-2025-07-30",
      "headline": "Can Kingdom end the long shadow of Arjun Reddy on Vijay Deverakonda's career?Vijay Deverakonda's meteoric rise post 'Arjun Reddy' was as explosive as it was divisive. With 'Kingdom', his upcoming collaboration with 'Jersey' director Gowtam Tinnanuri, all eyes are on whether this could finally be the film that helps him break free, reset the narrative, and reclaim his space as a performer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-ana-de-armas-dating-rumours-vermont-outing-2763323-2025-07-30",
      "headline": "Tom Cruise, 63, Ana de Armas, 37, soft-launch relationship? Internet can't keep calmTom Cruise and Ana de Armas were spotted in Vermont, fuelling speculation about a possible romantic involvement. Internet users have been sharing their thoughts on their union."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/how-anupam-kher-knew-he-was-different-but-no-less-slept-on-platform-played-65-at-28-2763237-2025-07-29",
      "headline": "Slept on platform, played 65 at 28: How Anupam Kher knew he was different but no lessIn his book 'Different But No Less', Anupam Kher tells the story of an autistic girl defying odds in 'Tanvi: The Great', but also mirrors it with his own journey of resilience. From arriving in Mumbai with Rs 37 to challenging every stereotype thrown his way, Kher's book is a personal reflection on what it means to be seen as different. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/christopher-nolan-faces-backlash-films-the-odyssey-in-western-sahara-morocco-occupation-controversy-2763207-2025-07-29",
      "headline": "Christopher Nolan faces backlash for filming The Odyssey in disputed Western SaharaChristopher Nolan is filming parts of The Odyssey in the disputed Western Sahara region. The decision has drawn criticism over the ongoing Moroccan occupation and repression of the Sahrawi people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lindsay-lohan-private-life-dubai-paparazzi-culture-freakier-friday-release-2763167-2025-07-29",
      "headline": "Lindsay Lohan on life in Dubai far from Hollywood, paparazzi: The privacy is uniqueActor Lindsay Lohan recently opened up on her peaceful and private life in Dubai with her family. She drew parallels to Hollywood's intrusive paparazzi culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/anupama-rupali-ganguly-welcomes-tulsi-smriti-irani-kyunki-saas-bhi-kabhi-bahu-thi-premiere-star-plus-jiohotstar-2763116-2025-07-29",
      "headline": "Anupama Rupali Ganguly welcomes Smriti Irani's Tulsi Virani ahead of Kyunki premiereIn a unique crossover in Indian television, actor Rupali Ganguly as her titular character from 'Anupamaa' video called Tulsi Virani (Smriti Irani) from 'Kyunki Saas Bhi Kabhi Bahu Thi'. The show returns on Star Plus on July 29, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kussh-sinha-reacts-to-saiyaara-being-copied-from-k-film-nikita-roy-is-original-2763125-2025-07-29",
      "headline": "Kussh Sinha reacts to Saiyaara being copied from K-film: Nikita Roy is originalDirector Kussh Sinha seemingly addressed plagiarism allegations against 'Saiyaara'. He further emphasised that his film 'Nikita Roy' has an original storyline. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-tries-to-learn-instagram-shares-candid-video-2763197-2025-07-29",
      "headline": "Amitabh Bachchan tries to learn Instagram, shares candid videoMuch to the delight of his fans, Amitabh Bachchan shared a candid video on Instagram where he's seen trying to familiarise himself with the app. In the clip, the 82-year-old openly shares his thoughts on navigating its features and quirks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mrunal-thakur-backs-dhadak-2-ahead-of-clash-with-son-of-sardaar-2-tripti-dimri-responds-2763175-2025-07-29",
      "headline": "Mrunal Thakur cheers for Dhadak 2 ahead of clash with Son of Sardaar 2. Triptii reactsActor Mrunal Thakur cheered for 'Dhadak 2' before its clash with 'Son of Sardaar 2'. Both films are set for release on August 1. 'Dhadak 2' actor Triptii Dimri responded with best wishes for both the films. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditya-dhar-wishes-dhurandhar-sanjay-dutt-on-his-birthday-2763094-2025-07-29",
      "headline": "Aditya Dhar wishes Dhurandhar Sanjay Dutt on birthday: You're pure fireDirector Aditya Dhar shared an unseen photo with actor Sanjay Dutt from the sets of 'Dhurandhar' on Tuesday. He extended birthday wishes to the actor in a social media post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vikrant-massey-begins-shoot-in-colombo-for-sri-sri-ravi-shankar-biopic-white-2763161-2025-07-29",
      "headline": "Vikrant Massey begins shoot in Colombo for Sri Sri Ravi Shankar biopic White: Report Vikrant Massey has started shooting for 'White', a biopic on Sri Sri Ravi Shankar. According to sources, the actor is currently on a month-long schedule in Colombo. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-earthquake-live-updates-tsunami-in-russia-after-quake-evacuations-ordered-in-japan-us-on-alert-2763325-2025-07-30",
      "headline": "Live: Tsunami strikes Hawaii, Alaska in US after powerful quake in RussiaOne of the world's strongest earthquakes since 2011 struck Russia's Far East early Wednesday, with a powerful 8.8-magnitude tremor jolting the Kamchatka Peninsula and triggering tsunami alerts across the northern Pacific. The quake, the strongest in the region since 1952, was followed by intense aftershocks, with seismologists warning of further tremors up to magnitude 7.5 in the coming weeks. A tsunami wave hit North Kurilsk, flooding parts of the settlement and a local fishing facility. Evacuations were reported across Kamchatka, the Kuril Islands, and parts of Japan, while tsunami sirens sounded as far as Alaska, Hawaii, and even New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-live-rajya-sabha-jaishankar-modi-op-sindoor-lok-sabha-rahul-gandhi-congress-2763392-2025-07-30",
      "headline": "Live: Holding Indus treaty in abeyance was important step, says S JaishankarParliament Session 2025 Live Updates: As the Monsoon Session of Parliament enters its eighth day on Wednesday, the Rajya Sabha is expected to witness key interventions by senior ministers, with External Affairs Minister Dr S Jaishankar expected to open the debate on Operation Sindoor at 1 pm, followed by Leader of the House JP Nadda around 3 pm. Union Home Minister Amit Shah is also likely to deliver the concluding speech in Parliament later in the day. The expected addresses come a day after high-voltage exchanges in both Houses, where Prime Minister Narendra Modi and Amit Shah led the government's offensive on the Operation Sindoor narrative. On the Opposition front, leaders including Rahul Gandhi, Priyanka Gandhi, and Akhilesh Yadav attempted to mount a counterattack, questioning the government's handling of the India-Pakistan conflict. Stay tuned to IndiaToday.in as we bring you the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tsunami-watch-is-now-in-effect-after-magnitude-8-earthquake-struck-off-russia-us-geological-survey-glbs-2763311-2025-07-30",
      "headline": "Monster 8.8 earthquake in Russia sparks Pacific tsunami alert: Japan, US on edgeA massive 8.8-magnitude undersea quake off Russia's Kamchatka Peninsula triggered tsunami waves of up to 4 metres, prompting evacuations and alerts across Japan and several Pacific nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/dhankhar-dhamaka-the-inside-story-of-what-forced-the-vice-president-out-2763052-2025-07-29",
      "headline": "Dhankhar dhamaka: The inside story of what forced the vice-president outAmong the reasons: an impeachment motion against a judge, purported internal dissent and some power play"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-2-reboot-review-tulsi-and-nostalgia-well-thats-it-2763411-2025-07-30",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi Review: Tulsi and nostalgia, well, that's itThe first episode of 'Kyunki Saas Bhi Kabhi Bahu Thi 2' is a nostalgic trip down memory lane, bringing back iconic characters and moments without much new development. While Smriti Irani's return as Tulsi warms the heart, the show heavily relies on past glory and familiar storylines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/west-bengal-chief-electoral-officer-sir-reminder-blo-voter-list-tmc-chief-cm-mamata-banerjee-assembly-election-2763148-2025-07-30",
      "headline": "Why idea of free-fair polls in Bengal is ghorar dimAt a recent meeting, West Bengal CM Mamata Banerjee reminded block-level officers (BLOs) that they were state government employees. Bengal is the only state to have a Chief Electoral Officer's office under the Home and Hill Affairs Department. These and large-scale illegal immigration make the dream of free-fair polls in Mamata's Bengal nothing but bunkum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-wcl-legends-semi-final-easemytrip-2763334-2025-07-30",
      "headline": "Indian sponsor pulls out of WCL clash against PakistanIndian sponsor EaseMyTrip has pulled out of the India-Pakistan semi-final of the World Championship of Legends citing terror concerns. In a public statement, the company's founder has said that terror and cricket cannot go hand in hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/drone-video-shows-scale-destruction-russia-kamchatka-after-monster-magnitude-earthquake-2763402-2025-07-30",
      "headline": "Drone video shows scale of destruction in Russia's Kamchatka after monster quakeOne of the world's strongest earthquakes since 2011 struck Russia's Far East early Wednesday, with a powerful 8.8-magnitude tremor jolting the Kamchatka Peninsula and triggering tsunami alerts across the northern Pacific."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-gautam-gambhir-oval-fight-curator-2763337-2025-07-30",
      "headline": "Oval outrage: How much is too much from coach Gautam Gambhir?India vs England: Gautam Gambhir's public demeanour has been under intense scrutiny throughout the Test series against England. From taking a confrontational tone against journalists to a bust-up against the Oval groundstaff, how much is too much from Gambhir?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/andhra-liquor-scam-sit-seizes-rs-11-crore-cash-sources-hint-at-big-names-linked-to-ysrcp-2763391-2025-07-30",
      "headline": "Rs 11 crore seized in Andhra liquor scam, sources link it to Jagan Reddy's partyThe SIT seized Rs 11 crore in cash from a farmhouse near Hyderabad while probing the Andhra Pradesh liquor scam. The seizure followed a confession by an accused in the case. Sources say that more high profile names related to the YSRCP could be added to the list of accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nisar-launch-today-isros-96-million-bet-to-catch-earths-quietest-twitches-2763099-2025-07-30",
      "headline": "Isro to launch Nisar today to catch Earth's quietest twitchIndia's smart investment in the world's most advanced Earth-mapping satellite is about far more than just money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-ias-officer-sit-ups-lawyers-protest-clerk-humiliation-shahjahanpur-2763331-2025-07-30",
      "headline": "Video: IAS officer does sit-ups on 1st day of posting over lack of cleanlinessOn his first day as Sub-Divisional Magistrate in Shahjahanpur, IAS officer Rinku Singh Rahi did sit-ups in front of protesting lawyers after making a clerk do the same for urinating in the open. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/what-triggered-russia-kamchatka-peninsula-earthquake-explained-tsunami-alert-kuril-kamchatka-decade-strongest-quake-2763352-2025-07-30",
      "headline": "Explained: The science behind Kamchatka's devastating 8.8 earthquakeA massive 8.8 magnitude earthquake struck off Russia's Kamchatka Peninsula, triggering tsunami alerts across the Pacific due to intense subduction zone activity. The quake, among the strongest in a decade, highlights ongoing seismic risks in the Ring of Fire.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pratham-files-complaint-against-darshan-fans-over-threatsa-2763405-2025-07-30",
      "headline": "After Ramya, actor Pratham files complaint against Darshan's fans over threatsActor Pratham has approached Bangalore rural police alleging threats from fans of actor Darshan. This follows similar complaints by actor-politician Ramya against abusive social media accounts linked to Darshan's supporters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/met-on-instagram-inter-caste-couple-bihar-dies-by-suicide-begusaraia-after-eloping-share-post-on-facebook-2763365-2025-07-30",
      "headline": "Inter-caste Bihar couple shares 'alvida' post, dies by suicide after elopingA young inter-caste couple from Bihar's Begusarai died by suicide eight months after eloping. The husband posted \"Alvida\" on Facebook before the tragic incident.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sona-comstar-legal-notice-cease-and-desist-rani-kapur-sanjay-kapur-death-what-it-means-2763376-2025-07-30",
      "headline": "Sona Comstar sends cease-and-desist notice to Rani Kapur. What it meansSona Comstar has demanded that Rani Kapur withdraw her July 24 letter addressed to the board, shareholders, and stakeholders."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-impact-feature/story/tom-cruise-and-ana-de-armas-fuel-dating-buzz-with-cozy-vermont-stroll-glbs-2763302-2025-07-30",
      "headline": "Tom Cruise and Ana de Armas fuel dating buzz with cozy Vermont strollTom Cruise and Ana de Armas held hands in Vermont, fueling dating rumours after multiple sightings together, including a London concert and a romantic trip to Spain.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mangaluru-student-sets-global-record-with-170-hour-bharatanatyam-performance-dance-video-2763379-2025-07-30",
      "headline": "Mangaluru student sets global record with 170-hour Bharatanatyam performanceRemona Evette Pereira embarked on the record-breaking journey on July 21, concluding it on July 28 amid thunderous applause, tears of joy, and widespread admiration.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/investment-advisor-advice-newly-married-couple-five-tips-about-money-savings-2763406-2025-07-30",
      "headline": "Talk money like you talk love: Investment advisor's advice for newlywedsAn investment advisor's advice to young couples goes beyond numbers. Abhishek Kumar emphasises that financial clarity is just as essential as emotional honesty when building a strong, lasting marriage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/who-is-govindachami-the-convict-who-made-kannur-jailbreak-2763106-2025-07-29",
      "headline": "Who is Govindachami, the convict who made Kannur jailbreak?Serving life sentence in a 2011 rape-murder case, the one-handed convict had fled from the high-security block of the Central Prison in Kannur, only to be rearrested"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/how-to-keep-the-spark-alive-between-bottles-and-blowouts-2763049-2025-07-30",
      "headline": "How to keep the spark alive between bottles and blowoutsSleepless, exhausted, and covered in baby spit-up, are you wondering if your partner sees you as anything but a parent now? Here's your guide to surviving parenthood together (and staying a team through it all)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/security-forces-foil-infiltration-attempts-by-pak-terrorists-neutralise-two-in-operation-in-jks-poonch-2763330-2025-07-30",
      "headline": "2 Pak terrorists killed as security forces foil infiltration bid in J&K's PoonchThe two terrorists were killed by security forces in the wee hours of Wednesday while they were attempting to infiltrate across the Line of Control in the Deghwar sector of Poonch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-says-us-india-trade-deal-not-finalised-yet-hints-at-20-25-tariff-glbs-2763283-2025-07-30",
      "headline": "Trump says US-India trade deal not finalised, threatens tariffs as high as 25%The US president has said the India-US trade deal is not yet finalised and hinted at imposing 20-25% tariffs on Indian exports ahead of the August 1 deadline. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/raja-raghuvanshi-murder-case-to-be-made-into-film-titled-honeymoon-in-shillong-2763375-2025-07-30",
      "headline": "Raja Raghuvanshi murder case to be made into film titled 'Honeymoon in Shillong'Tentatively titled 'Honeymoon in Shillong', the film will trace the events leading up to his death during a trip to Meghalaya with his wife Sonam, who is one of the prime accused in the case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pratham-files-complaint-against-darshan-fans-over-threatsa-2763405-2025-07-30",
      "headline": "After Ramya, actor Pratham files complaint against Darshan's fans over threatsActor Pratham has approached Bangalore rural police alleging threats from fans of actor Darshan. This follows similar complaints by actor-politician Ramya against abusive social media accounts linked to Darshan's supporters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-ahaan-panday-aneet-padda-mohit-suri-romantic-drama-rs-500-crore-globally-2763361-2025-07-30",
      "headline": "Saiyaara box office Day 12: Ahaan-Aneet's love story eyes Rs 500 crore globallyMohit Suri's 'Saiyaara', featuring Ahaan Panday and Aneet Padda, has raked in an estimated Rs 266 crore in India within 12 days. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-collection-day-6-pawan-kalyan-film-crashes-fails-to-mint-rs-2-crore-2763356-2025-07-30",
      "headline": "Hari Hara Veera Mallu Day 6: Pawan Kalyan film crashes, fails to mint Rs 2 crorePawan Kalyan's 'Hari Hara Veera Mallu' has crashed at the box office. The period drama failed to mint even Rs 2 crore at the domestic box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/pamela-anderson-liam-neeson-dating-couple-address-relationship-rumours-2763350-2025-07-30",
      "headline": "Pamela Anderson, Liam Neeson dating? Couple address relationship rumoursActors Pamela Anderson and Liam Neeson walked the red carpet with their children, sparking rumours of a possible romance. The duo is set to appear together in the upcoming film, 'The Naked Gun'."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wcl-india-vs-pakistan-australia-john-hastings-wides-video-2763412-2025-07-30",
      "headline": "Watch: Australia pacer bowls 18 balls in single over, including 12 widesWCL 2025: Australia lost to Pakistan by 10 wickets in their final match of WCL group-stage. Pacer John Hastings bowled an 18-ball over, where he gave away 12 wides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-pitch-curator-spat-gautam-gambhir-aakash-chopra-2763409-2025-07-30",
      "headline": "Find it humiliating: Aakash Chopra slams Oval pitch curator for double standardsFormer cricketer Aakash Chopra criticised Oval pitch curator Lee Fortis over his double standards during a spat with Indian coach Gautam Gambhir. The Indian coach had a war of words with Fortis on Tuesday, July 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-stats-preview-shubman-gill-2763386-2025-07-30",
      "headline": "Shubman Gill eyes Sunil Gavaskar's 54-year-old India record: Stats PreviewENG vs IND: Shubman Gill is on the verge of several milestones in his career going into India's fifth and final Test against England, starting July 31 at the Old Trafford in Manchester. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-south-africa-t20i-odi-squad-details-2763360-2025-07-30",
      "headline": "Fraser McGurk snubbed from T20I squad as Australia announce squad vs SAAUS vs SA: Australia announced their white-ball squads against South Africa on Wednesday, July 30. Australia dropped young opener Jake Fraser-McGurk from both white-ball squads after consistently poor numbers. Mitch Owen was trusted after his sensational batting output against West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-gautam-gambhir-oval-fight-curator-2763337-2025-07-30",
      "headline": "Oval outrage: How much is too much from coach Gautam Gambhir?India vs England: Gautam Gambhir's public demeanour has been under intense scrutiny throughout the Test series against England. From taking a confrontational tone against journalists to a bust-up against the Oval groundstaff, how much is too much from Gambhir?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-wcl-legends-semi-final-easemytrip-2763334-2025-07-30",
      "headline": "Indian sponsor pulls out of WCL clash against PakistanIndian sponsor EaseMyTrip has pulled out of the India-Pakistan semi-final of the World Championship of Legends citing terror concerns. In a public statement, the company's founder has said that terror and cricket cannot go hand in hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-bowling-choices-bumrah-fitness-oval-test-win-england-2763324-2025-07-30",
      "headline": "3 pacers, 3 spinners: Will India be tempted for some big bowling changes at the Oval?India must win the Oval Test to level the series against England. Bowling lineup decisions and Bumrah's fitness remain key concerns ahead of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/avinash-sable-world-athletics-championships-injury-setback-2763270-2025-07-29",
      "headline": "Sable suffers injury setback, World Championship hopes in doubtIndia's leading 3000m steeplechase athlete, Avinash Sable, has sustained a significant knee injury, potentially jeopardizing his participation in the World Athletics Championships set to take place in Tokyo this September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-oval-curator-viral-photo-pitch-brendon-mccullum-viral-double-standard-2763268-2025-07-29",
      "headline": "Same curator, two rules? Gambhir denied pitch access, McCullum stood on itHours after the altercation between India head coach Gautam Gambhir and Oval pitch curator Lee Fortis, an old photo of the curator standing on the pitch with England head coach Brendon McCullum went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/joao-felix-leaves-chelsea-joins-al-nassr-cristiano-ronaldo-2763264-2025-07-29",
      "headline": "Joao Felix leaves Chelsea, joins Portugal teammate Ronaldo at Al NassrJoao Felix has completed a permanent move from Chelsea to Al-Nassr in a deal that could rise to £43.7 million (€50 million). The agreement sees the Portugal international sign a two-year contract with the Saudi Pro League side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-mitchell-santner-tom-latham-1st-test-2763251-2025-07-29",
      "headline": "Mitchell Santner replaces injured Tom Latham as skipper for 1st TestZIM vs NZ: Mitchell Santner has replaced Tom Latham as New Zealand skipper for the first Test against Zimbabwe after Latham was ruled out due to a shoulder injury. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-bowling-choices-bumrah-fitness-oval-test-win-england-2763324-2025-07-30",
      "headline": "3 pacers, 3 spinners: Will India be tempted for some big bowling changes at the Oval?India must win the Oval Test to level the series against England. Bowling lineup decisions and Bumrah's fitness remain key concerns ahead of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/avinash-sable-world-athletics-championships-injury-setback-2763270-2025-07-29",
      "headline": "Sable suffers injury setback, World Championship hopes in doubtIndia's leading 3000m steeplechase athlete, Avinash Sable, has sustained a significant knee injury, potentially jeopardizing his participation in the World Athletics Championships set to take place in Tokyo this September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-oval-curator-viral-photo-pitch-brendon-mccullum-viral-double-standard-2763268-2025-07-29",
      "headline": "Same curator, two rules? Gambhir denied pitch access, McCullum stood on itHours after the altercation between India head coach Gautam Gambhir and Oval pitch curator Lee Fortis, an old photo of the curator standing on the pitch with England head coach Brendon McCullum went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/joao-felix-leaves-chelsea-joins-al-nassr-cristiano-ronaldo-2763264-2025-07-29",
      "headline": "Joao Felix leaves Chelsea, joins Portugal teammate Ronaldo at Al NassrJoao Felix has completed a permanent move from Chelsea to Al-Nassr in a deal that could rise to £43.7 million (€50 million). The agreement sees the Portugal international sign a two-year contract with the Saudi Pro League side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-mitchell-santner-tom-latham-1st-test-2763251-2025-07-29",
      "headline": "Mitchell Santner replaces injured Tom Latham as skipper for 1st TestZIM vs NZ: Mitchell Santner has replaced Tom Latham as New Zealand skipper for the first Test against Zimbabwe after Latham was ruled out due to a shoulder injury. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-all-rounder-preference-no-8-balanced-batting-bowling-oval-test-2763245-2025-07-29",
      "headline": "India coach explains decision to play an extra batting option at No.8India batting coach Sitanshu Kotak on Tuesday explained the team's rationale for selecting an all-rounder at number eight instead of a specialist bowler."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-5th-test-kuldeep-yadav-sitanshu-kotak-2763241-2025-07-29",
      "headline": "Kuldeep Yadav to play fifth Test? Sitanshu Kotak opens up on team combinationENG vs IND, 5th Test: Sitanshu Kotak, the Indian batting coach, opened up on India's possible combination for the ongoing Test at Old Trafford in Manchester. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-nathan-lyon-dig-ben-stokes-manchester-test-drama-2763230-2025-07-29",
      "headline": "Get them out: Australia's Lyon takes a dig at England over Manchester dramaAustralian spinner Nathan Lyon has offered his take on the controversy that followed the drawn fourth Test between England and India at Old Trafford, suggesting England's frustration was misdirected and avoidable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wankhede-stadium-ipl-jerseys-theft-2763208-2025-07-29",
      "headline": "Security manager of Wankhede stadium arrested for 'theft' of IPL jerseysA 43-year-old security manager at Wankhede Stadium was arrested on Tuesday for allegedly stealing 261 IPL jerseys valued at Rs 6.52 lakh from the BCCI's storage, according to police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-jasprit-bumrah-availability-fitness-5th-test-batting-coach-reaction-2763204-2025-07-29",
      "headline": "Bumrah fit, call on his workload soon: India coach on Oval Test availabilityIndia's batting coach Sitanshu Kotak has said that although Jasprit Bumrah is currently \"fit\", his availability for the fifth Test at The Oval will be subject to an assessment of his recent workload."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/taskin-ahmed-bangladesh-pacer-threats-assaults-2763191-2025-07-29",
      "headline": "Taskin Ahmed accused of assault and threats, Bangladesh pacer clarifiesTaskin Ahmed, Bangladesh's premier fast bowler, has been accused of assaulting and threatening his childhood friend. The speedster, meanwhile, released a statement where he denied the accusations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwiksairaj-rankireddy-chirag-shetty-macau-open-treesa-jolly-gayatri-gopichand-upset-2763184-2025-07-29",
      "headline": "Satwik-Chirag ease into second round, Treesa-Gayatri suffer shock exitTop Indian men's doubles duo Satwiksairaj Rankireddy and Chirag Shetty kicked off their Macau Open Super 300 campaign in style with a dominant straight-game win, even as top-seeded women's pair Treesa Jolly and Gayatri Gopichand suffered a shock first-round exit.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-afc-womens-asian-cup-2026-group-draw-japan-chinese-taipei-vietnam-2763172-2025-07-29",
      "headline": "India women's football team clubbed with Japan, Vietnam in Group C of Asian CupIndia have been drawn in Group C with Japan, Chinese Taipei and Vietnam for the AFC Women's Asian Cup 2026. The group stage matches will decide qualification for the 2027 FIFA Women's World Cup in Brazil, heightening competition among the teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-jasprit-bumrah-availability-fitness-5th-test-batting-coach-reaction-2763204-2025-07-29",
      "headline": "Bumrah fit, call on his workload soon: India coach on Oval Test availabilityIndia's batting coach Sitanshu Kotak has said that although Jasprit Bumrah is currently \"fit\", his availability for the fifth Test at The Oval will be subject to an assessment of his recent workload."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/taskin-ahmed-bangladesh-pacer-threats-assaults-2763191-2025-07-29",
      "headline": "Taskin Ahmed accused of assault and threats, Bangladesh pacer clarifiesTaskin Ahmed, Bangladesh's premier fast bowler, has been accused of assaulting and threatening his childhood friend. The speedster, meanwhile, released a statement where he denied the accusations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwiksairaj-rankireddy-chirag-shetty-macau-open-treesa-jolly-gayatri-gopichand-upset-2763184-2025-07-29",
      "headline": "Satwik-Chirag ease into second round, Treesa-Gayatri suffer shock exitTop Indian men's doubles duo Satwiksairaj Rankireddy and Chirag Shetty kicked off their Macau Open Super 300 campaign in style with a dominant straight-game win, even as top-seeded women's pair Treesa Jolly and Gayatri Gopichand suffered a shock first-round exit.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-afc-womens-asian-cup-2026-group-draw-japan-chinese-taipei-vietnam-2763172-2025-07-29",
      "headline": "India women's football team clubbed with Japan, Vietnam in Group C of Asian CupIndia have been drawn in Group C with Japan, Chinese Taipei and Vietnam for the AFC Women's Asian Cup 2026. The group stage matches will decide qualification for the 2027 FIFA Women's World Cup in Brazil, heightening competition among the teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/holger-rune-veronika-kudermetova-chat-interaction-2763171-2025-07-29",
      "headline": "I have a husband: Holger Rune playfully shut down by Russian tennis starRussian tennis ace Veronika Kudermetova recently recounted a light-hearted and amusing interaction with Denmark's up-and-coming talent, Holger Rune.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kolkata-knight-riders-part-ways-with-ipl-winning-head-coach-chandrakant-pandit-2763142-2025-07-29",
      "headline": "KKR part ways with IPL-winning head coach Chandrakant PanditKolkata Knight Riders have announced the departure of head coach Chandrakant Pandit after the IPL 2025 season. The franchise aims to rebuild as it searches for a new coach following a disappointing campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-sitanshu-kotak-press-conference-oval-pitch-2763117-2025-07-29",
      "headline": "Gambhir vs Oval pitch curator: India batting coach clears the air on argumentENG vs IND: India's batting coach, Sitanshu Kotak, addressed the reported rift between Gautam Gambhir and pitch curator Lee Fortis ahead of the fifth Test, set to begin on July 31 at the Kennington Oval in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/divya-deshmukh-chess-world-cup-win-powered-by-mental-toughness-susan-polgar-2763111-2025-07-29",
      "headline": "Divya Deshmukh's Chess World Cup triumph fuelled by mental toughness: Susan PolgarLegendary Grandmaster Susan Polgar has credited Divya Deshmukh's stunning World Cup victory to her unwavering determination and mental toughness, after the teenager delivered yet another landmark moment for Indian chess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-chirag-top-10-bwf-rankings-lakshya-sen-unnati-hooda-2763101-2025-07-29",
      "headline": "Satwik-Chirag returns to top 10, Lakshya, Unnati climb up in singlesIn the latest BWF Rankings, India's badminton stars are on the rise again. Satwiksairaj Rankireddy and Chirag Shetty are back into the world's top 10 in men's doubles, while Lakshya Sen moves to No. 17 in men's singles category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-gautam-gambhir-oval-pitch-curator-fight-controversy-london-2763097-2025-07-29",
      "headline": "Gambhir vs Oval pitch curator: Real reason why both men had heated argumentThe real reason behind Gautam Gambhir's spat with Oval pitch curator Lee Fortis has been revealed, with the latter giving his thoughts on the incident, which took place on Tuesday, July 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sunil-gavaskar-loud-talk-manchester-2763095-2025-07-29",
      "headline": "Why didn't you declare earlier? Gavaskar shuts down England's loud talkENG vs IND: Sunil Gavaskar criticised England's tactics in the fourth Test at Old Trafford in Manchester, where India played out 143 overs in their second innings to save the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-nathan-lyon-jamaica-test-2763058-2025-07-29",
      "headline": "Was disappointed on a number of levels: Lyon on West Indies Test snubWI vs AUS: Nathan Lyon said that he was dejected after being left out of the third Test against the West Indies where the Aussies preferred an all-pace attack. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/divya-deshmukh-chess-world-cup-title-2763013-2025-07-29",
      "headline": "Divya Deshmukh's World Cup title: A testament to India's massive strengthDivya Deshmukh's World Cup win underlines the depth of Indian chess across all categories — open, junior, and now women's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-odi-rankings-smriti-mandhana-no1-batter-nat-sciver-brunt-2763031-2025-07-29",
      "headline": "Smriti Mandhana displaced as No.1 ODI batter after ENG vs IND seriesSmriti Mandhana's stint as the No.1 ODI batter in the ICC Rankings came to an end on Tuesday, July 29 as Nat Sciver-Brunt displaced her from the position. Mandhana scored 115 runs in three matches against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-gautam-gambhir-vs-oval-pitch-curator-lee-fortis-2763022-2025-07-29",
      "headline": "Video: Gautam Gambhir involved in fiery verbal spat with Oval pitch curatorIndia head coach Gautam Gambhir picked up a massive fight with The Oval pitch curator on India's first practice session ahead of the final Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-squad-jasprit-bumrah-mohammed-shami-aakash-chopra-2762987-2025-07-29",
      "headline": "Bumrah availability a doubt, No Shami: Aakash Chopra on India's Asia Cup squadAakash Chopra expresses doubts over Jasprit Bumrah's participation in the Asia Cup 2025. He also feels Mohammed Shami will not be included in the Indian squad due to fitness and selection concerns."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}