{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-market-july-usd-24-billion-lg-hdb-reason-bse-nse-trading-upcoming-public-listings-2749017-2025-07-01",
      "headline": "July turns hot for IPOs as firms race to raise $2.4 billionFirms are gearing up to raise around $2.4 billion through initial public offerings (IPOs) in July. If this target is reached, it will mark the strongest IPO month since December 2023, following a solid $2 billion raised in June. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-pact-deadlock-over-tariffs-as-negotiations-continue-2748943-2025-07-01",
      "headline": "India-US trade pact: Deadlock over tariffs as negotiations continueIndia and the US are yet to reach an agreement on their trade pact, with tariffs being a major point of contention. India is pushing for zero tariffs in certain sectors, while the US wants to maintain a 10% tariff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-91-points-higher-nifty-above-25500-ril-bel-up-2-percent-2748968-2025-07-01",
      "headline": "Sensex closes 91 points higher, Nifty above 25,500; RIL up 2%The S&P BSE Sensex was up 90.83 points to end at 83,697.29, while the NSE Nifty50 added 24.75 points to close at 25,541.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-to-tatkal-trains-aadhar-credit-card-july-1-money-changes-that-matter-to-you-itr-deadline-2748932-2025-07-01",
      "headline": "From tax to tatkal trains: July 1 money changes that matter to youThe CBDT has extended the last date for filing Income Tax Returns (ITR) for salaried individuals. Instead of July 31, the new deadline is now September 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-may-finalise-interim-trade-deal-with-us-this-week-report-2748838-2025-07-01",
      "headline": "India may finalise interim trade deal with US this week: ReportBoth sides are racing to complete the deal before July 9, when the US is set to impose a 26% reciprocal tariff on Indian goods. These tariffs were first announced by President Donald Trump in April and temporarily suspended for 90 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-blog-digital-india-10-years-linkedin-people-movement-2748806-2025-07-01",
      "headline": "Digital India turns 10, PM Modi says it's become a people's movementIn the blog titled 'A Decade of Digital India', on LinkedIn, PM Modi said the Digital India initiative is no longer just a government programme but a 'people's movement.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/family-offices-india-booming-ultrarich-wealth-creation-asset-management-tax-legal-2748784-2025-07-01",
      "headline": "Why India's ultra-rich love family officesForget yachts. For India's ultra-rich, the ultimate power move is a family office. Read on to see why it's becoming the new gold standard of wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-richest-forbes-list-2025-new-york-mumbai-billionaires-top-10-cities-wealth-ultra-rich-mukesh-ambani-2748773-2025-07-01",
      "headline": "New York tops billionaire list. Which Indian city made it to the top 10?Globally, nearly a quarter of the world's 3,028 billionaires live in just 10 cities across six countries. These cities continue to attract wealth due to strong business ecosystems, investor-friendly policies, and thriving industries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-above-25500-asian-paints-up-2-percent-2748711-2025-07-01",
      "headline": "Sensex opens flat, Nifty above 25,500; Asian Paints up 2%The S&P BSE Sensex was up 186.04 points to 83,792.50, while the NSE Nifty50 added 56.35 points to 25,573.40 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sbi-70-years-when-start-why-year-history-customer-share-price-imperial-bank-of-calcutta-2748710-2025-07-01",
      "headline": "SBI turns 70: Why bank's blue keyhole has stood the test of timeAfter independence, under the first 5-year plan's push for rural development, the government nationalised the Imperial Bank. On July 1, 1955, the State Bank of India was born under the State Bank of India Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ms-dhoni-files-for-trademark-of-iconic-nickname-captain-cool-2748422-2025-06-30",
      "headline": "MS Dhoni files for trademark of iconic nickname 'Captain Cool'Over the years, 'Captain Cool' has meant much more than just a catchy title. It sums up Dhoni's calm mind under pressure, from winning India's first T20 World Cup in 2007 to lifting the ODI World Cup in 2011 and the Champions Trophy in 2013. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-450-points-lower-nifty-below-25600-trent-gains-3-2748406-2025-06-30",
      "headline": "Sensex ends 450 points lower, Nifty below 25,600; Trent gains 3%The S&P BSE Sensex fell 452.44 points to close at 83,606.46, while the NSE Nifty50 dropped 120.75 points, ending below the 25,600 mark."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-announces-full-group-album-release-in-spring-2026-and-global-world-tour-plans-after-completing-military-service-recording-to-begin-in-the-united-states-this-july-2749114-2025-07-01",
      "headline": "BTS announces 2026 comeback album and world tour on Weverse live with all 7 membersBTS members revealed exciting plans during a Weverse live broadcast, confirming their first full group album in four years and a global world tour starting next spring. Recording will begin in the United States from July as the group reunites after military service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anshula-kapoor-recalls-being-shunned-at-school-after-father-boney-married-sridevi-2749113-2025-07-01",
      "headline": "Anshula Kapoor recalls being shunned at school after father Boney married SrideviSocial media influencer Anshula Kapoor shared that she was cornered by her classmates after her father, Boney Kapoor, married Sridevi. She said divorces were not common back in the 90s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-admitted-she-is-pro-botox-everybody-wants-to-look-good-2749118-2025-07-01",
      "headline": "When Shefali Jariwala admitted she is pro Botox: Everybody wants to look goodBefore her sudden death, Shefali Jariwala had said she supports Botox and skin treatments to look good. An old interview where she spoke about fitness, beauty, and self-care is now going viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sohail-khan-ex-wife-seema-sajdeh-london-family-holiday-co-parenting-2749083-2025-07-01",
      "headline": "Sohail Khan, ex-wife Seema Sajdeh enjoy London holiday with sonsSohail Khan and ex-wife Seema Sajdeh reunited in London for a family holiday with their sons. Despite their divorce, they continue to co-parent, bringing the family together for special occasions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dilip-joshi-to-quit-taarak-mehta-ka-ooltah-chashmah-creator-clarifies-2749098-2025-07-01",
      "headline": "Dilip Joshi to quit Taarak Mehta Ka Ooltah Chashmah? Creator clarifiesAmid strong speculation about Dilip Joshi's exit from Taarak Mehta Ka Ooltah Chashmah, the show's creator Asit Kumarr Modi, has addressed the rumours and shared his perspective.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-calls-horror-emotionally-draining-says-she-misunderstood-the-genre-before-maa-2749092-2025-07-01",
      "headline": "Kajol calls horror emotionally draining, says she misunderstood the genre before MaaKajol, who stars in her first horror film 'Maa', shared she isn't a fan of the genre and will watch the movie only for professional reasons. She described the experience as emotionally draining and admitted horror required a completely different acting approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-shoaib-ibrahim-reunite-sasural-simar-ka-shweta-sinha-snehal-sahay-2749021-2025-07-01",
      "headline": "Dipika Kakar-Shoaib Ibrahim reunite with Sasural Simar Ka co-starsActor Dipika Kakar, who recently underwent surgery for a liver tumour, reunited with her 'Sasural Simar Ka' co-stars Shweta Sinha and Snehal Sahay during her recovery. The emotional reunion  brought back fond memories, and the friends even planned a future trip together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/cid-hrishikesh-pandey-talks-about-career-struggles-says-success-is-about-timing-2749037-2025-07-01",
      "headline": "CID actor Hrishikesh Pandey on career struggles: Success is all about timing'CID' actor Hrishikesh Pandey discussed the importance of timing in the entertainment industry. He shared his insights on the importance of being at the right place and at the right time. The actor also noted that the role of competition and character choice are very important in acting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pati-patni-aur-woh-2-sara-ali-khan-wamiqa-gabbi-ayushmann-khurrana-sequel-2749036-2025-07-01",
      "headline": "Ayushmann Khurrana, Sara Ali Khan, Wamiqa Gabbi in Pati Patni Aur Woh 2: ReportsAyushmann Khurrana has reportedly replaced Kartik Aaryan in 'Pati Patni Aur Woh 2'. He will be joined by Sara Ali Khan and Wamiqa Gabbi in the lead. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-shankar-no-call-game-changer-failure-producer-sirish-dil-raju-2749044-2025-07-01",
      "headline": "Game Changer producer says Ram Charan, Shankar didn't call him after film's failureMore than six months after its release, 'Game Changer' is back in conversation as producer Sirish revealed that neither Ram Charan nor director Shankar reached out following the film's box office failure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/maalik-trailer-rajkummar-rao-turns-cold-blooded-gangster-actioner-2748992-2025-07-01",
      "headline": "Maalik trailer: Rajkummar Rao turns cold-blooded gangster in actionerActor Rajkummar Rao will be back on the big screen with his upcoming film 'Maalik.' The trailer of the actioner was unveiled by the makers on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anirudh-rajinikanth-reaction-chikitu-song-from-coolie-we-can-tell-he-enjoyed-2749038-2025-07-01",
      "headline": "Anirudh on Rajinikanth's reaction to Chikitu song from Coolie: We can tell he enjoyedRajinikanth's 'Coolie' is one of the most anticipated Indian films of the year, and the buzz around its recently released song, 'Chikitu', composed by Anirudh Ravichander is proof of that. The composer recently revealed what Rajinikanth's reaction was after listening to the song."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-game-changer-damaged-me-financially-says-producer-dil-raju-2749010-2025-07-01",
      "headline": "Ram Charan's Game Changer damaged me financially, says producer Dil RajuProducer Dil Raju, in a recent interview, admitted that he had anticipated the financial setback of Game Changer. While the Ram Charan-starrer fell short of expectations, Raju expressed confidence that Sankranthiki Vasthunnam would help offset the losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jimin-and-jungkook-return-are-you-sure-season-2-confirms-bts-agency-2749012-2025-07-01",
      "headline": "BTS' Jimin and Jungkook return for Are You Sure Season 2: ReportsAs per reports, BTS members Jimin and Jungkook are returninf=g with the second season of 'Are You Sure'. The filming of the season has already been done."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-was-disappointed-with-ajiths-role-in-asoka-heres-why-2749034-2025-07-01",
      "headline": "Exclusive: Vishnu Manchu was disappointed with Ajith's role in Asoka. Here's whyActor Vishnu Manchu shared his eagerness to step into Hindi cinema but emphasised that he is waiting for a role that genuinely excites him. He also recalled feeling disappointed by Ajith Kumar's \"small\" role in Shah Rukh Khan's 'Asoka'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-arjun-rampal-on-rana-naidu-2-embracing-grey-roles-real-life-influences-2745712-2025-07-01",
      "headline": "Exclusive: Arjun Rampal on Rana Naidu 2, embracing grey roles, real-life influencesActor Arjun Rampal, in an interview with IndiaToday.in, shared his experience of working on 'Rana Naidu 2'. He also spoke about drawing inspiration from real-life stories and depicting the truth in films based on historical events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/selena-gomez-returns-alex-russo-wizards-beyond-wavery-place-season-2-reboot-2748980-2025-07-01",
      "headline": "Wizards Beyond Wavery Place 2: Selena Gomez returns as Alex Russo in rebootSelena Gomez has confirmed joining 'Wizards Beyond Waverly Place' Season 2. She will be seen playing Alex Russo in the reboot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-veer-mehra-begins-shoot-for-silaa-omung-kumar-directs-antagonist-role-2748927-2025-07-01",
      "headline": "Karan Veer Mehra starts shooting for Silaa, Chum Darang cheers him onActor Karan Veer Mehra has started filming for 'Silaa' alongside director Omung Kumar. He shared the mahurat shot with cast members, supported by Chum Darang."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-ajay-devgn-neeru-bajwa-bring-patiala-swag-in-films-title-track-2749016-2025-07-01",
      "headline": "Son of Sardaar 2: Ajay Devgn, Neeru Bajwa bring Patiala swag in film's title trackThe title track of 'Son of Sardaar 2' has been released, bringing vibrant Punjabi energy and a fresh twist to the much-anticipated sequel. Featuring Ajay Devgn's return as Jassi and a star-studded cast, the film promises a blend of fun, chaos, and desi charm, set to hit theatres on July 25."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-talks-hit-deadlock-over-agriculture-centre-wont-concede-on-dairy-sources-2749067-2025-07-01",
      "headline": "India-US trade deal talks deadlocked as government stands firm on 'red line'According to top government sources, India has refused to budge on dairy, a sector employing over 80 million people in India, many of them smallholder farmers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-gangrape-case-arrest-lifts-lid-on-kolkata-gangrape-accused-monojit-mishras-decade-long-crime-spree-2749124-2025-07-01",
      "headline": "Arrest lifts lid on Kolkata gangrape accused's decade-long crime spreeMonojit Mishra, a 31-year-old Trinamool Congress Chhatra Parishad (TMCP) leader, was arrested on June 28 along with two others for allegedly raping the woman inside a college guard room, a day after she filed a police complaint. A medical report confirmed signs of forced penetration, bite marks, and scratch injuries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-on-elon-musk-deportation-from-us-will-have-to-look-into-it-2749077-2025-07-01",
      "headline": "After head back to South Africa jibe, Trump 'looking into' deporting Elon MuskDonald Trump's comment came shortly after he launched a scathing attack on Elon Musk over government subsidies and the electric vehicle mandate. In a post on Truth Social, Trump claimed that Musk \"may have to close up shop and head back home to South Africa\", arguing that the billionaire had received \"more subsidies than any human being in history\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/act-committed-by-some-policemen-unforgivable-mk-stalin-transfers-tamil-nadu-custodial-death-case-to-cbi-2749109-2025-07-01",
      "headline": "Unforgivable act by policemen: MK Stalin transfers custodial death case to CBITamil Nadu Chief Minister MK Stalin announced the transfer of the Thiruppuvanam custodial death case to the CBI after confirming that police assault led to the youth's death. The Tamil Nadu government assured full cooperation with the CBI probe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/who-the-fork-are-you-zohran-mamdani-must-be-condemned-eating-with-hands-viral-video-2749000-2025-07-01",
      "headline": "Who the Fork Are You?Donald Trump's MAGA crazies have taken exception to Zohran Mamdani using his fingers to eat food. Primitive, they said. So, the author gives them a schooling -- and a scalding -- for knowing @&#t about eating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-operation-sindoor-wcl-legends-match-2749066-2025-07-01",
      "headline": "India vs Pakistan on a cricket field for first time since Operation SindoorIndia and Pakistan veterans are set to meet in an exhibition match at Edgbaston on July 20. The game is set to be played against the backdrop of recent tensions between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/shame-vivek-ramaswamy-hits-back-at-troll-targeting-zohran-mamdani-usha-vance-2749116-2025-07-01",
      "headline": "Race-obsessed fringe: Vivek Ramaswamy slams troll targeting Mamdani, Usha VanceRepublican leader Vivek Ramaswamy denounced the \"race-obsessed fringe of the right\" after white supremacist Nick Fuentes grouped him with fellow Indian-origin figures Zohran Mamdani and Usha Vance in a xenophobic post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-live-score-day-2-updates-novak-djokovic-jannik-sinner-iga-swiatek-2748926-2025-07-01",
      "headline": "Day 2 Live: Krejcikova into Round 2, Iga Swiatek wins 1st setWimbledon 2025 Day 2 Live Score: Jessica Pegula made a shocking first-round exit after losing to Elisabetta Cocciaretto. Jannik Sinner has advanced to the second round after beating Luca Nardi in straight sets. Barbora Krejcikova beat Alexandra Eala and went through to the second round.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/anti-ageing-supplements-alone-dont-cause-heart-attacks-dr-naresh-trehan-shefali-jariwala-glutathione-cardiac-arrests-2748989-2025-07-01",
      "headline": "Anti-ageing supplements alone don't cause heart attacks: Dr Naresh TrehanDr Trehan, India's top cardiologist and Chairman of Medanta, states that there is no conclusive scientific evidence linking anti-ageing supplements like glutathione to sudden cardiac death. Such incidents are rare, episodic, and difficult to study systematically"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-congress-mla-br-patil-claims-credit-for-siddaramaiah-meeting-with-sonia-gandhi-in-viral-phone-call-claims-lack-of-party-support-2748979-2025-07-01",
      "headline": "Introduced Siddaramaiah to Sonia Gandhi, he hit lottery: Congress MLA's leaked callA video of senior Karnataka Congress MLA BR Patil expressing disappointment over party dynamics is being widely circulated. In the call, he also claims credit for Siddaramaiah's rise, and says he has no godfather in the party."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/hindu-krishna-temple-utah-spanish-fork-attacked-thrice-gun-shot-attack-june-hate-crime-iskcon-reacts-2749042-2025-07-01",
      "headline": "Krishna temple in Utah attacked thrice with guns in June in alleged hate crimeA Hindu temple in Utah has been repeatedly shot at over several nights in June. Bullets hit key parts of the temple, including its dome and worship hall window. Authorities are investigating and are suspecting a hate crime. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/british-influencer-miles-routledge-finds-airpods-in-jhelum-pakistan-a-year-after-losing-it-in-dubai-blames-indians-2748823-2025-07-01",
      "headline": "Cow-worshipping Indians to blame: UK vlogger after finding stolen AirPods in PakBritish YouTuber Miles Routledge found his stolen AirPods in Pakistan a year after losing them in Dubai. However, he directed his outrage at India, criticising Indian culture after being told that an Indian man had stolen his AirPods and sold them to a Pakistani. Last year, Routledge had sparked controversy for racist posts targeting Indians and for joking about nuking India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/how-estee-lauders-homemade-creams-grew-into-an-international-luxury-brand-2749111-2025-07-01",
      "headline": "Estée Lauder began in a restaurant kitchen and built brands like MAC and CliniqueEstée Lauder was both the mother and the mother brand behind beauty giants like MAC, Clinique, and Tom Ford. Few know this global empire began in a restaurant kitchen in Queens -- driven by a woman who simply knew what women wanted, and ended as one of the richest self-made women in history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-deputy-cm-dk-shivakumar-rules-out-chief-minister-ambition-focuses-on-2028-elections-congress-party-discipline-2749057-2025-07-01",
      "headline": "Not eyeing Chief Minister post for now, party discipline priority: DK ShivakumarKarnataka Deputy Chief Minister DK Shivakumar said his priority is to strengthen the Congress for the 2028 Assembly elections. He denied having any current ambition to become Chief Minister."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/another-law-student-alleges-molestation-by-kolkata-gangrape-accused-monojit-mishra-2748991-2025-07-01",
      "headline": "Another law student alleges molestation by Kolkata gangrape accused Monojit MishraThe student alleged that Mishra, a Trinamool Congress Chhatra Parishad leader, assaulted and threatened her during a college trip two years back."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modis-8-year-landmark-journey-of-gst-meets-rahul-gandhis-economic-injustice-cry-2749013-2025-07-01",
      "headline": "PM calls GST a landmark reform, Rahul Gandhi sees 8 years of economic injusticePrime Minister Narendra Modi praised the completion of eight years of GST implementation, but his praise was sharply countered by Rahul Gandhi, who condemned the tax system as a form of \"economic injustice\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/sumit-antil-exclusive-para-javelin-able-bodied-tournaments-2748758-2025-07-01",
      "headline": "Bored of winning, para-javelin star Sumit Antil tests limits in able-bodied meetsTwo-time Paralympic gold medallist Sumit Antil, in conversation with India Today, spoke about competing in able-bodied events and his ultimate goal of breaching the 80m mark. The world record holder has begun preparation for the World Para Athletics Championships in September-October."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/siddaramaiah-flags-possible-covid-vaccine-link-in-hassans-heart-attack-deaths-2749014-2025-07-01",
      "headline": "Siddaramaiah flags possible Covid vaccine link in Hassan's heart attack deathsKarnataka Chief Minister Siddaramaiah ordered a probe into the alarming rise in heart attack deaths in Hassan district. A committee will investigate possible causes, including Covid vaccine side effects. The district reported 23 deaths in 40 days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/drunk-on-power-madras-high-courts-scathing-observation-for-tamil-nadu-police-in-custodial-death-case-2748993-2025-07-01",
      "headline": "Drunk on power: Madras High Court to Tamil Nadu Police in custodial death caseMadras High Court made damning observations on the custodial death of 27-year-old Ajith Kumar. The high court also ordered a judicial inquiry led by a retired judge of the Madurai Bench and directed the Tamil Nadu government to initiate action against all senior officials responsible. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/with-4-loans-and-rs-30000-salary-reddit-user-asks-if-a-new-loan-will-help-2749085-2025-07-01",
      "headline": "With 4 loans and Rs 30,000 salary, Reddit user asks if a new loan will helpIn a Reddit post titled \"Should I take loan to end my existing loan?\", the user detailed their current financial situation, thereby highlighting the growing anxiety around personal debt and loan dependency in India's urban middle class."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/shashi-tharoor-meets-britains-got-talent-star-souparnika-nair-watch-video-2749058-2025-07-01",
      "headline": "5 years after his tweet, Shashi Tharoor meets Britain's Got Talent star Souparnika NairShashi Tharoor met Souparnika Nair, five years after praising her Britain's Got Talent act. The 15-year-old sang live for him, leaving the MP visibly impressed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/one-and-a-half-year-old-girl-dies-after-falling-into-hot-chickpeas-in-uttar-pradeshs-sonbhadra-2749032-2025-07-01",
      "headline": "UP toddler falls into pot of hot chickpeas, dies; sister met same fate 2 years agoFollowing the incident, the child was immediately rushed to the hospital with 80 per cent burns, but succumbed to her injuries during treatment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/brandon-gill-indian-origin-wife-defends-his-remarks-on-zohran-mamdani-viral-video-2748771-2025-07-01",
      "headline": "Indian-origin wife of US Congressman defends his racist jab at Zohran MamdaniIt began after a video of New York City mayoral candidate Zohran Mamdani eating rice with his hands while speaking during an interview went viral on X. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rcb-created-nuisance-cops-are-not-alladin-ka-chirag-had-shortage-of-time-tribunal-on-bengaluru-stampede-2748951-2025-07-01",
      "headline": "RCB created nuisance, cops not magicians or gods: Tribunal on Bengaluru stampedeIn a strong observation, the Central Administrative Tribunal said that Royal Challengers Bengaluru was primarily responsible for the stampede outside the Chinnaswamy stadium. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-edgbaston-predicted-playing-xi-shubman-gill-2749122-2025-07-01",
      "headline": "2nd Test, Predicted Playing XI: Arshdeep-Kuldeep in, Shardul out?India face huge selections calls ahead of the 2nd Test match at Edgbaston. Shubman Gill has already confirmed that the team will play 2 spinners, which will have big impact on the combination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/ayush-shetty-viktor-axelsen-prakash-padukone-academy-vimal-kumar-2749120-2025-07-01",
      "headline": "Tall, fierce and focused: Ayush Shetty reminds Viktor Axelsen of his younger self20-year-old Ayush Shetty, standing tall at 6-foot-4, won the US Open in June, claiming his first senior title. The boy from Mangalore once reminded Danish great Viktor Axelsen of his younger self. Vimal Kumar of the Prakash Padukone Badminton Academy reflects on Ayush's journey: from backyard rallies in Mangalore to breaking into the world's top 35 in men's singles.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-2nd-test-shubman-gill-tail-lack-of-runs-2749103-2025-07-01",
      "headline": "Gill urges batters to take more responsibility amidst lower-order strugglesIndia captain Shubman Gill has called for more responsibility from the top order amid lower order struggles in the Test series. Nitish Reddy might be included in the playing XI to beef up the Indian lower order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-zimbabwe-1st-test-corbin-bosch-all-round-performance-2749101-2025-07-01",
      "headline": "Bosch's all-round brilliance leads South Africa to 328-run win over ZimbabweSouth Africa thrashed Zimbabwe by a commanding 328 runs in the first Test at Queens Sports Club, with all-rounder Corbin Bosch delivering a standout performance, claiming his maiden five-wicket haul to go along with a century in the first innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-jasprit-bumrah-press-conference-england-vs-india-2nd-test-2749095-2025-07-01",
      "headline": "Gill breaks silence on Bumrah's availability for 2nd Test vs EnglandENG vs IND: Shubman Gill said that Jasprit Bumrah is available for the second Test, but mentioned that a call on his selection will be taken on the eve of the match. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-r-ashwin-kuldeep-yadav-india-playing-xi-2749090-2025-07-01",
      "headline": "Ashwin backs Kuldeep for Edgbaston Test to strengthen India's bowling attackFormer India spinner R Ashwin has said that the Indian team management must include left-arm wrist-spinner Kuldeep Yadav in the playing XI if they are to have any chance of doing well in the second Test at Edgbaston against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jessica-pegula-daria-kasatkina-alex-de-minaur-wimbledon-results-2749081-2025-07-01",
      "headline": "Jessica Pegula stunned in Round 1, Kasatkina, De Minaur advanceWimbledon: Jessica Pegula faced a shock first-round exit after Elisabetta Cocciaretto defeated her in straight sets. Daria Kasatkina and Alex de Minaur defeated Emiliana Arango and Roberto Carballes Baena respectively. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-operation-sindoor-wcl-legends-match-2749066-2025-07-01",
      "headline": "India vs Pakistan on a cricket field for first time since Operation SindoorIndia and Pakistan veterans are set to meet in an exhibition match at Edgbaston on July 20. The game is set to be played against the backdrop of recent tensions between the two countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rajasthan-royals-trade-talks-sanju-samson-dhruv-jurel-ipl-sources-2749069-2025-07-01",
      "headline": "Rajasthan Royals get trade-off offers for six of its players: IPL sourcesRajasthan Royals might be revisiting their squad composition for the 2026 IPL, with at least six of their players attracting trade-off interest from various franchises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-unfazed-by-bumrah-availability-india-england-test-series-2024-2749041-2025-07-01",
      "headline": "Ben Stokes dismisses Bumrah factor; pleased with his bowling rhythmEngland captain Ben Stokes dismissed the talk about Jasprit Bumrah being available for only three of the five Tests as \"India's problem\" and said he expects the \"passionate\" visitors to put up a tough fight in the second Test, regardless of their team selection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/andrew-flintoff-wwe-undertaker-wrestlemania-royal-rumble-appearance-2749040-2025-07-01",
      "headline": "Flintoff reveals how he nearly joined WWE, trained to face the UndertakerAndrew Flintoff revealed the surprising tale of how he almost ended up wrestling in the WWE. He even mentioned how he had pitches for a feud with the Undertaker and appearances for WrestleMania and Royal Rumble. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jessica-pegula-daria-kasatkina-alex-de-minaur-wimbledon-results-2749081-2025-07-01",
      "headline": "Jessica Pegula stunned in Round 1, Kasatkina, De Minaur advanceWimbledon: Jessica Pegula faced a shock first-round exit after Elisabetta Cocciaretto defeated her in straight sets. Daria Kasatkina and Alex de Minaur defeated Emiliana Arango and Roberto Carballes Baena respectively. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-operation-sindoor-wcl-legends-match-2749066-2025-07-01",
      "headline": "India vs Pakistan on a cricket field for first time since Operation SindoorIndia and Pakistan veterans are set to meet in an exhibition match at Edgbaston on July 20. The game is set to be played against the backdrop of recent tensions between the two countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rajasthan-royals-trade-talks-sanju-samson-dhruv-jurel-ipl-sources-2749069-2025-07-01",
      "headline": "Rajasthan Royals get trade-off offers for six of its players: IPL sourcesRajasthan Royals might be revisiting their squad composition for the 2026 IPL, with at least six of their players attracting trade-off interest from various franchises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-unfazed-by-bumrah-availability-india-england-test-series-2024-2749041-2025-07-01",
      "headline": "Ben Stokes dismisses Bumrah factor; pleased with his bowling rhythmEngland captain Ben Stokes dismissed the talk about Jasprit Bumrah being available for only three of the five Tests as \"India's problem\" and said he expects the \"passionate\" visitors to put up a tough fight in the second Test, regardless of their team selection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/andrew-flintoff-wwe-undertaker-wrestlemania-royal-rumble-appearance-2749040-2025-07-01",
      "headline": "Flintoff reveals how he nearly joined WWE, trained to face the UndertakerAndrew Flintoff revealed the surprising tale of how he almost ended up wrestling in the WWE. He even mentioned how he had pitches for a feud with the Undertaker and appearances for WrestleMania and Royal Rumble. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-classic-anderson-peters-ruled-out-2749026-2025-07-01",
      "headline": "Neeraj Chopra Classic: Former world champion pulls out due to injuryFormer world champion Anderson Peters has withdrawn from the Neeraj Chopra Classic due to injury. His absence reshapes the competition lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-dangerous-player-ben-stokes-india-england-headingley-2749023-2025-07-01",
      "headline": "Rishabh Pant is very dangerous player, really enjoy watching him bat: Ben StokesEngland captain Ben Stokes praises Indian wicketkeeper-batter Rishabh Pant for his fearless batting and game-changing skills. Pant's twin centuries at Headingley and record-breaking performance have made him a key player in the ongoing Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-classic-sumit-antil-sun-pharma-doctor-day-2749004-2025-07-01",
      "headline": "Neeraj Chopra invited me to NC Classic: Paralympic champion Sumit AntilNeeraj Chopra invited Paralympic gold medallist Sumit Antil to participate in his historic javelin event in Bengaluru, revealed the latter in an exclusive interview with India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-icc-t20i-rankings-india-england-charani-2748977-2025-07-01",
      "headline": "ICC Player Rankings: Smriti Mandhana moves to third spot in T20IsIndia vice-captain Smriti Mandhana on Tuesday moved up one spot to be ranked third in the ICC rankings for batters in women's T20 Internationals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-2036-olympics-bid-gujarat-ioc-visit-2748950-2025-07-01",
      "headline": "Indian delegation visits Olympic headquarters in major push for 2036 hosting dreamsA high-level Indian delegation visited the IOC headquarters in Lausanne to advance the 2036 Olympic bid. The visit comes amid a pause in the host selection process, but India remains determined to host the Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-giovanni-perricard-fastest-serve-record-taylor-fritz-2748934-2025-07-01",
      "headline": "Watch: French player smashes Wimbledon record with 246 kph serve vs FritzFrance's Giovanni Perricard created history in the opening day of Wimbledon 2025 as the 6' 8 in player smashed the record for the fastest serve in the tournament's history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-live-score-day-2-updates-novak-djokovic-jannik-sinner-iga-swiatek-2748926-2025-07-01",
      "headline": "Day 2 Live: Krejcikova into Round 2, Iga Swiatek in actionWimbledon 2025 Day 2 Live Score: Jessica Pegula made a shocking first-round exit after losing to Elisabetta Cocciaretto. Jannik Sinner has advanced to the second round after beating Luca Nardi in straight sets. Barbora Krejcikova beat Alexandra Eala and went through to the second round.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-auction-rishabh-pant-digvesh-rathi-2748900-2025-07-01",
      "headline": "Rishabh Pant among 10 IPL players to feature in Delhi Premier League auctionDelhi Premier League auction is set to seem some of the biggest cricketing talent in the country. More than 10 IPL stars are going to participate in the auction including the likes of Rishabh Pant and Digvesh Rathi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-2036-olympics-bid-gujarat-ioc-visit-2748950-2025-07-01",
      "headline": "Indian delegation visits Olympic headquarters in major push for 2036 hosting dreamsA high-level Indian delegation visited the IOC headquarters in Lausanne to advance the 2036 Olympic bid. The visit comes amid a pause in the host selection process, but India remains determined to host the Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-giovanni-perricard-fastest-serve-record-taylor-fritz-2748934-2025-07-01",
      "headline": "Watch: French player smashes Wimbledon record with 246 kph serve vs FritzFrance's Giovanni Perricard created history in the opening day of Wimbledon 2025 as the 6' 8 in player smashed the record for the fastest serve in the tournament's history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-live-score-day-2-updates-novak-djokovic-jannik-sinner-iga-swiatek-2748926-2025-07-01",
      "headline": "Day 2 Live: Krejcikova into Round 2, Iga Swiatek in actionWimbledon 2025 Day 2 Live Score: Jessica Pegula made a shocking first-round exit after losing to Elisabetta Cocciaretto. Jannik Sinner has advanced to the second round after beating Luca Nardi in straight sets. Barbora Krejcikova beat Alexandra Eala and went through to the second round.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-auction-rishabh-pant-digvesh-rathi-2748900-2025-07-01",
      "headline": "Rishabh Pant among 10 IPL players to feature in Delhi Premier League auctionDelhi Premier League auction is set to seem some of the biggest cricketing talent in the country. More than 10 IPL stars are going to participate in the auction including the likes of Rishabh Pant and Digvesh Rathi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-simone-inzaghi-al-hilal-manchester-city-mount-everest-2748889-2025-07-01",
      "headline": "Climbed Mount Everest: Inzaghi on Al-Hilal's win vs Manchester CitySimone Inzaghi compared their victory over Manchester City to climbing Mount Everest without oxygen. Such was the victory for the Saudi-based side against the Premier League giants in Manchester City. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-bumrah-selection-dilemma-second-test-edgbaston-2748859-2025-07-01",
      "headline": "India's Bumrah puzzle: Pundits add to selection drama before Birmingham TestEngland vs India: Jasprit Bumrah has been signed up to play only three of the five Tests in England. India are yet to take a call on his participation in the second Test, starting 2 July in Birmingham. But can they afford to play at Edgbaston without him?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-deep-offers-shami-like-threat-bumrah-replacement-birmingham-test-2748856-2025-07-01",
      "headline": "Akash Deep offers Shami-like threat, should replace Bumrah if needed: PathanENG vs IND: Irfan Pathan highlighted how Akash Deep can provide a Shami-like threat with the ball, with his straight-seamed deliveries being a possible threat against the aggressive England batting unit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-wimbledon-2025-admitted-nervous-in-first-round-scare-fabio-fognini-2748804-2025-07-01",
      "headline": "Alcaraz felt Centre Court nerves after 1st round scare: Was struggling a bitCarlos Alcaraz highlighted that the weight of the occasion got to him during the first-round clash against Fabio Fognini which may have been a bit too close for comfort for the two-time champion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-removed-slip-position-india-catching-drills-birmingham-2748788-2025-07-01",
      "headline": "Why Yashasvi Jaiswal was relieved of slip duties ahead of Edgbaston TestEngland vs India: During India's intense fielding drills on Monday in Birmingham, young opener Yashasvi Jaiswal was a notable absentee in the slip cordon and in the gully region. The opener dropped as many as four catches in the first Test that India lost by five wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/sumit-antil-exclusive-para-javelin-able-bodied-tournaments-2748758-2025-07-01",
      "headline": "Bored of winning, para-javelin star Sumit Antil tests limits in able-bodied meetsTwo-time Paralympic gold medallist Sumit Antil, in conversation with India Today, spoke about competing in able-bodied events and his ultimate goal of breaching the 80m mark. The world record holder has begun preparation for the World Para Athletics Championships in September-October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-manchester-city-al-hilal-result-round-of-16-inter-milan-fluminense-2748747-2025-07-01",
      "headline": "Club World Cup: Al-Hilal stun Manchester City, Inter Milan crash outEuropean football took a beating as Manchester City were shockingly beaten by Al-Hilal in the FIFA Club World Cup round of 16 stage while Champions League finalists, Inter Milan also crashed out after being defeated by Fluminense. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-jannik-sinner-iga-swiatek-wimbledon-2025-start-key-matches-upsets-2748727-2025-07-01",
      "headline": "Day 2 schedule: Novak Djokovic, Jannik Sinner and Iga Swiatek eye strong startsWimbledon: Novak Djokovic, Jannik Sinner and Iga Swiatek begin their Wimbledon 2025 campaigns on Tuesday in London. After a dramatic opening day, the top seeds will be hoping for smoother sailings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nathan-lyon-steps-down-australian-cricket-songmaster-alex-carey-takes-over-2748705-2025-07-01",
      "headline": "Nathan Lyon quits iconic Australian role after 12 years, opens up on retirementNathan Lyon has stepped down as the Australian cricket team's songmaster after 12 years. The off-spinner remains focused doing well for the Test team, signalling his intentions to play in India and England in 2027. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-withdraws-noc-to-stay-with-mumbai-2748682-2025-07-01",
      "headline": "Yashasvi Jaiswal's Goa U-turn complete, opener to continue playing for MumbaiWhile Prithvi Shaw appears set to depart Mumbai ahead of the 2025–26 season, Yashasvi Jaiswal will continue to represent the domestic cricket heavyweights. The MCA has approved his request to revoke the previously issued NOC for a move to Goa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-jannik-sinner-preview-roland-garros-heartbreak-2748668-2025-07-01",
      "headline": "Sinner looks to bury Roland Garros demons in bid for 1st Wimbledon titleWimbledon 2025: Can Jannik Sinner recover from the heartbreak of the French Open? The World No. 1 heads into Wimbledon under a bit of pressure. After an early exit in Halle, his warm-up event for the grass-court Grand Slam, Sinner faces a tough test as he searches for his maiden crown in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ravindra-jadeja-all-rounder-doubts-birmingham-2748663-2025-07-01",
      "headline": "Is Ravindra Jadeja, the all-rounder, a no-show in SENA Tests?Ravindra Jadeja, once part of a lethal spin duo with R Ashwin, struggled to make an impact in the Headingley Test. For all his match-winning feats at home and in the subcontinent, his effectiveness as a game-changer has faded in South Africa, England, New Zealand, Australia (SENA) conditions.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}