{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-market-rising-today-sensex-up-500-points-nifty-gain-it-stocks-rally-infosys-techm-2780042-2025-09-01",
      "headline": "Sensex gains 500 points: Why is stock market rising today?The S&P BSE Sensex was up 529.17 points to 80,338.82, while the NSE Nifty50 gained 185.20 points to 24,612.05 as of 2:15 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/looking-for-higher-fd-returns-these-small-finance-banks-offer-up-to-777-percent-2780012-2025-09-01",
      "headline": "Looking for higher FD returns? These small finance banks offer up to 7.77%If you're hunting for better fixed deposit returns, small finance banks are offering rates as high as 7.77%, outpacing larger lenders. Here's a look at some of the top options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-all-time-low-fall-speculative-bets-hedging-trump-tariff-pm-modi-2780011-2025-09-01",
      "headline": "Rupee falls to all-time low of 88.33 against US dollar amid tariff woesThe fall also came as investors reacted to the recent move by the United States to raise tariffs on goods, which has added to concerns over India's trade and fiscal outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-and-silver-soar-to-record-highs-should-you-buy-now-2779944-2025-09-01",
      "headline": "Gold and silver soar to record highs. Should you buy now?Gold and silver prices have surged to fresh record levels, supported by global uncertainty, Fed rate cut hopes, and a weaker dollar. With bullion shining brighter than ever, many investors are asking the same question, i.e., should you enter now?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/amanta-healthcare-ipo-2025-subscription-status-gmp-review-2779924-2025-09-01",
      "headline": "Amanta Healthcare IPO kicks off with 22% GMP. Should you apply?The IPO will close on September 3, 2025, with the allotment of shares expected on September 4.  The price band for the IPO has been fixed at Rs 120 to Rs 126 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/explained-why-you-should-never-invest-emergency-funds-in-stocks-mutual-funds-2779909-2025-09-01",
      "headline": "Explained: Why you should never invest emergency funds in stocks, mutual fundsEven disciplined savers can face a harsh reality if emergency funds are illiquid. Safety and immediate access are paramount and returns are secondary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-sbi-card-itr-to-lpg-price-5-big-money-rule-changes-from-september-1-2779884-2025-09-01",
      "headline": "From SBI card, ITR to LPG price: 5 big money rule changes from September 1September kicks off with fresh changes in banking, taxes, and household expenses. From SBI card rules to LPG prices and ITR deadlines, here are the five updates that could directly impact your pocket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/vikran-engineering-ipo-shares-allotment-status-out-gmp-listing-date-market-debut-2779867-2025-09-01",
      "headline": "Vikran Engineering IPO: Check allotment status, GMP and listing dateInvestors who applied for shares can check their allotment status through either the BSE website or the IPO registrar, Bigshare Services Pvt Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-china-trade-ties-tianjin-talks-pm-modi-xi-jinping-2779831-2025-09-01",
      "headline": "How India-China trade ties have evolved over the years and why it matters nowTwo decades ago, India-China trade barely existed. In the early 2000s, the numbers were so small they hardly showed up on global trade charts. India exported raw materials like iron ore, while Chinese goods rarely made it into Indian markets. Then came the boom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-250-points-nifty-above-24500-infosys-gains-over-15-2779822-2025-09-01",
      "headline": "Sensex jumps 250 points, Nifty above 24,500; Infosys gains over 2%The S&P BSE Sensex was up 368.48 points to 80,178.13, while the NSE Nifty50 added 112.65 points to 24,539.50 as of 9:35 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/online-gaming-ban-by-government-hits-industry-with-mpl-to-sack-employees-in-india-with-revenue-stopped-2779698-2025-08-31",
      "headline": "MPL to layoff 60% India staff after money-based gaming ban: ReportPrime Minister Narendra Modi's government this month banned online paid games, citing financial and addiction risks, especially among youth, leading to a shutdown of many gaming apps offering paid fantasy cricket, rummy and poker games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-september-15-tax-deadline-get-an-extension-2779540-2025-08-31",
      "headline": "Will September 15 tax deadline get an extension?As taxpayers rush to meet the September 15 ITR deadline, mounting portal issues and filing delays have raised the question – will the cut-off date be extended once again?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoor-triptii-dimrii-avinash-tiwary-scenic-drive-spain-video-vishal-bharadwaj-film-2779995-2025-09-01",
      "headline": "Shahid, Triptii and Avinash enjoy scenic drive in Spain. WatchShahid Kapoor, Triptii Dimrii and Avinash Tiwary recently went for a scenic drive in Spain. Avinash shared a video of the drive on social media. They recently wrapped up the shooting of an upcoming film directed by Vishal Bhardwaj."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/amaal-mallik-sexist-remark-bigg-boss-19-chudi-peheno-jibe-to-abhishek-bajaj-textbook-sexism-2780031-2025-09-01",
      "headline": "Amaal Mallik's chudi peheno remark on Bigg Boss 19 is not jibe, it's textbook sexismAmaal Mallik's \"chudi peheno\" remark to Abhishek Bajaj on 'Bigg Boss 19' may look like just another reality-show jibe, but it reflects something deeper - the casual sexism that often goes unchecked in conversations and arguments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/alladin-actor-mena-massoud-marries-emily-shah-hindu-coptic-christian-ceremonies-2780021-2025-09-01",
      "headline": "Alladdin actor Mena Massoud marries Emily Shah in Hindu, Coptic Christian ceremoniesAladdin actor Mena Massoud married Emily Shah in Hindu and Coptic Christian ceremonies. The couple announced the same with a special video on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/varun-dhawan-grooves-to-bijuria-with-sonu-nigam-childhood-song-2780020-2025-09-01",
      "headline": "Varun Dhawan grooves to Bijuria with Sonu Nigam: Mera bachpan ka gaanaVarun Dhawan grooved to the classic Sonu Nigam track 'Bijuria', which features in his upcoming film 'Sunny Sanskari Ki Tulsi Kumari'. The song, cherished since his childhood, is set to release on September 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ankita-lokhande-mourns-late-pavitra-rishta-co-star-priya-marathe-my-wedee-until-we-meet-again-2779994-2025-09-01",
      "headline": "Ankita Lokhande mourns late co-star Priya Marathe: My wedee, until we meet againActor Ankita Lokhande has paid an emotional tribute to her late friend and Pavitra Rishta co-star Priya Marathe. Priya died due to cancer at 38. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-rani-mukerji-revive-90s-charm-new-video-celebrate-national-award-win-the-bads-of-bollywood-2779988-2025-09-01",
      "headline": "SRK-Rani Mukerji add 90s twist to National Award win, promote Aryan Khan's seriesShah Rukh Khan and Rani Mukerji celebrated their National Award win beautifully. The two recreated 'The Ba***ds of Bollywood' song 'Tu Pehli Tu Akhri', leaving fans nostalgic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rukmini-vasanth-jr-ntr-prashanth-neel-film-yash-toxic-producer-nv-prasad-2779921-2025-09-01",
      "headline": "Rukmini Vasanth joins Jr NTR, Prashanth Neel's film and Yash's Toxic: ProducerActor Rukmini Vasanth of 'Sapta Sagaradache Ello' fame has been confirmed to feature in Jr NTR-Prashanth Neel's upcoming film, and also in Yash's 'Toxic'. Telugu film producer NV Prasad talked about her upcoming line-up of films at 'Madhraasi' event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nelson-dilipkumar-silent-on-simbu-vetrimaaran-photo-rumours-2779942-2025-09-01",
      "headline": "Jailer director Nelson discusses viral pic featuring him, Simbu and Vetri MaaranA leaked photo featuring Silambarasan TR aka Simbu, Vetri Maaran, and director Nelson Dilipkumar has sparked rumours about an upcoming collaboration. At a recent event, Nelson Dilipkumar was asked if he was part of Simbu and Vetri's film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/anne-hathaway-calls-out-paps-on-devil-wears-prada-2-sets-reminds-them-of-children-present-2779970-2025-09-01",
      "headline": "Anne Hathaway scolds bickering paps on Devil Wears Prada 2 set: Children are hereAnne Hathaway wins hearts with her composed yet firm interaction with paparazzi on the sets of 'Devil Wears Prada 2', reminding them to respect the presence of children. Her poised behaviour has drawn praise from fans, adding to the anticipation for the much-awaited sequel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/samay-raina-mumbai-shows-draw-25000-fans-comedian-expresses-gratitude-indias-got-latent-controversy-2779933-2025-09-01",
      "headline": "Samay Raina's Mumbai shows draw 25,000 fans, comedian expresses gratitudeComedian Samay Raina is overwhelmed with the love he received from fans during his Mumbai show as a part of his 'Samay Raina Is Alive And Unfiltered' India tour. He shared a post and expressed his gratitude to each and everyone who attended the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jungkook-at-28-bts-golden-maknae-who-reminds-us-idols-are-human-too-2779950-2025-09-01",
      "headline": "Jungkook at 28: BTS' golden maknae who reminds us idols are human tooJeon Jungkook, BTS's golden maknae, celebrates his 28th birthday, standing out not only for his record-breaking music career but also for his genuine, relatable personality. From addressing privacy issues to sharing everyday moments and vulnerabilities, Jungkook connects deeply with fans beyond the stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bighit-music-denies-bts-jimin-dating-rumours-song-daeun-past-relationship-2779948-2025-09-01",
      "headline": "Jimin and actor Song Da-eun dated many years ago, confirms BigHitBigHit Music has addressed the dating rumours between BTS member Jimin and actor Song Da-eun. The agency clarified that they had a past mutual affection but are not currently in a relationship, urging fans to avoid 'harmful speculation'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-attends-ganga-aarti-in-varanasi-shares-pics-of-her-spiritual-visit-2779919-2025-09-01",
      "headline": "Sara Ali Khan attends Ganga aarti in Varanasi, shares pics of her spiritual visitSara Ali Khan participated in the Ganga aarti at Varanasi's Dashashwamedh Ghat, where she was warmly welcomed by devotees. She also shared glimpses of her visit on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/farhan-akhtar-hints-priyanka-katrina-alia-may-no-longer-be-part-of-jee-le-zaraa-2779929-2025-09-01",
      "headline": "Farhan Akhtar hints Priyanka-Katrina-Alia may no longer be part of Jee Le ZaraaFarhan Akhtar has finally broken silence on 'Jee Le Zaraa', confirming the film is not shelved but on the \"back burner.\" The director hinted that while music has been recorded and locations locked, the original dream cast of Priyanka Chopra, Katrina Kaif, and Alia Bhatt may no longer be a part of the project. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-tanya-mittal-comment-pahalgam-terror-attack-controversy-2779883-2025-09-01",
      "headline": "Bigg Boss 19's Tanya Mittal on Pahalgam row: It really didn't affect meSpiritual influencer Tanya Mittal addressed backlash over her comments on the Pahalgam terror attack in a recent interview. She is currently seen on the 19th season of the reality TV show 'Bigg Boss'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pawan-singh-marital-troubles-resurface-as-wife-jyoti-posts-emotional-note-online-2779897-2025-09-01",
      "headline": "Pawan Singh's marital troubles resurface as wife Jyoti posts emotional note onlinePawan Singh's wife has publicly voiced her grievances over his lack of response to her repeated attempts to communicate regarding family and political issues. Their strained relationship has drawn public attention amidst ongoing legal disputes and recent controversies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-chapter-1-hridayapoorvam-box-office-day-4-kalyani-priyadarshan-superhero-film-beats-mohanlal-family-drama-2779898-2025-09-01",
      "headline": "Lokah vs Hridayapoorvam box office Day 4: Kalyani's film beats Mohanlal's dramaKalyani Priyadarshan's 'Lokah: Chapter 1', the first female superhero film in India, surpassed the box office numbers of Mohanlal's 'Hridayapoorvam' in theatres. The two films released in theatres on the occasion of Onam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salim-khan-says-his-family-doesnt-eat-beef-prophet-mohammed-said-its-forbidden-2779896-2025-09-01",
      "headline": "Salim Khan says his family doesn't eat beef: Prophet Mohammed said it's forbiddenSalim Khan's revelation about why his family has never eaten beef has sparked conversations around faith, food, and secularism in Bollywood. The veteran screenwriter not only highlighted Prophet Mohammed's teachings on cow protection but also underlined the Khan family's tradition of celebrating Hindu festivals.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-indore-contestant-mimics-amitabh-bachchan-style-opens-up-on-love-life-2779886-2025-09-01",
      "headline": "KBC 17: Indore contestant mimics Amitabh Bachchan's style, opens up on love lifeIn the latest episode of 'Kaun Banega Crorepati 17', an Indore-based contestant spoke about copying Amitabh Bachchan's style. He even opened up about his love life. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/from-qingdao-walkout-to-tianjin-win-sco-backs-india-on-pahalgam-terror-attack-2779985-2025-09-01",
      "headline": "From Qingdao walkout to Tianjin win: SCO backs India on Pahalgam terror attackTwo months after Defence Minister Rajnath Singh chose to abstain from signing the SCO joint statement due to the omission of the Pahalgam terror attack at the Defence Ministers' meeting in Qingdao, the joint declaration at the leaders' meeting in Tianjin condemned the attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ride-or-die-pm-modi-putin-make-a-statement-with-carpool-sco-summit-tianjin-aurus-car-china-india-russia-ties-donald-trump-tariffs-2779910-2025-09-01",
      "headline": "Ride or die: PM Modi, Putin make a statement with carpoolPrime Minister Narendra Modi and Russian President Vladimir Putin shared a ride in a 'made in Russia' Aurus sedan to their bilateral meeting in Tianjin, with Modi later calling the exchange \"insightful\" in a post on X. The gestures highlighted the depth of India-Russia ties ahead of their bilateral talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/claims-objections-filed-over-sir-in-bihar-after-sept-30-will-be-considered-poll-body-tells-supreme-court-2780013-2025-09-01",
      "headline": "Claims filed after Sept 30 will be considered: Poll body to top court on Bihar SIRThe Election Commission said objections and claims filed after September 30, the deadline for final list, will be considered. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/enduring-friendship-us-lauds-india-ties-as-modi-putin-optics-dominate-sco-summit-tianjin-china-xi-jinping-trump-tarriffs-2779996-2025-09-01",
      "headline": "Washington cheers lndia-US ties, right before Modi-Putin meetThe US Embassy in India posted a message highlighting the \"enduring friendship\" between Washington and New Delhi just as Prime Minister Narendra Modi and Russian President Vladimir Putin held bilateral talks at the SCO summit in Tianjin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-pm-modi-putin-xi-jinping-camaraderie-at-sco-summit-tianjin-shehbaz-sharif-left-on-sidelines-2779789-2025-09-01",
      "headline": "Video: PM, Putin, Xi camaraderie at SCO summit; Shehbaz Sharif left on sidelinesPrime Minister Narendra Modi, Russian President Vladimir Putin and Chinese President Xi Jinping were seen in a headline-grabbing huddle marked by handshakes and laughs. Soon after, PM Modi and Putin walked past Shehbaz Sharif who appeared to have been sidelined at the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/at-least-250-killed-400-injured-in-a-60-magnitude-earthquake-in-afghanistan-news-agency-ap-citing-officials-2779877-2025-09-01",
      "headline": "Over 800 killed, 2,800 injured as strong quake devastates Afghanistan: TalibanMore than 800 people have been killed and 2,800 injured in the 6.0-magnitude earthquake that hit Afghanistan late Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/top-court-dismisses-plea-against-nationwide-rollout-of-20-ethanol-blended-petrol-2780030-2025-09-01",
      "headline": "Supreme Court dismisses plea against rollout of 20% ethanol blended petrolA bench led by Chief Justice of India B R Gavai dismissed the plea, which had alleged that millions of motorists were being forced to use E20 fuel, despite it not being designed for use in many vehicles currently in operation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/javed-akhtar-event-kolkata-event-cancelled-mamata-banerjee-west-bengal-urdu-academy-jamiat-ulema-e-hind-wahyahin-2779879-2025-09-01",
      "headline": "Mamata govt bows down to Islamists, Urdu Academy scraps Javed Akhtar eventThe West Bengal government it seems has abjectly surrendered to Islamists. The state government-run Urdu Academy has put off its literary event after the Jamiat Ulema-e-Hind and the Wahyahin Foundation objected to it inviting poet-lyricist Javed Akhtar for a mushaira. They said Akhtar repeatedly \"spoke against religion and God\". The real reason for the event's cancellation was fear of unrest and political fallout ahead of Assembly elections in Bengal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/would-you-ever-gift-your-teen-a-sex-toy-gautami-kapoor-thinks-its-time-2779959-2025-09-01",
      "headline": "Should parents even introduce their teens to sex toys?When Gautami Kapoor said she wanted to gift a sex toy to her teenage daughter, it wouldn't be an exaggeration to say that the internet lost it. The backlash reflected not just discomfort with her remark but also India's deep unease with conversations around sex, especially when it involves teenagers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/peter-navarro-india-russian-oil-purchase-brahmins-profiteering-udit-raj-congress-us-2780008-2025-09-01",
      "headline": "Factually correct: Congress leader backs Trump aide's 'Brahmin' jab on Russian oilCongress leader Udit Raj backed Trump aide Peter Navarro's claim that Indian Brahmin-run corporates profit from Russian oil, saying ordinary Indians see no benefit and Dalits, backward castes face structural barriers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/my-baby-is-back-and-that-real-risk-of-ai-psychosis-mass-hysteria-2779912-2025-09-01",
      "headline": "My Baby Is Back and that real risk of AI psychosis, mass hysteriaCan you get addicted to ChatGPT? In the coming months and years, it is going to be one of the key questions we will have to face as boundaries between human and AI behaviour merge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-all-time-low-fall-speculative-bets-hedging-trump-tariff-pm-modi-2780011-2025-09-01",
      "headline": "Rupee falls to all-time low of 88.33 against US dollar amid tariff woesThe fall also came as investors reacted to the recent move by the United States to raise tariffs on goods, which has added to concerns over India's trade and fiscal outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-sir-65-lakh-voters-excluded-30000-apply-2-lakh-application-delete-names-special-intensive-revision-electoral-rolls-2779989-2025-09-01",
      "headline": "Bihar SIR numbers tell a story: 65 lakh exclusions, just 30k apply to get back inDespite 65 lakh voters being excluded from Bihar's voter rolls, only around 30,000 applications have filed for inclusion during the month-long revision window. Over 2 lakh requests sought deletions instead. The Congress claimed 89 lakh complaints were ignored, even as the EC defended its process. The matter regarding the extension of the deadline for claim filing is being heard in the Supreme Court today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/nikki-bhati-dowry-case-greater-noida-news-viral-reel-making-family-society-instagram-reels-women-violence-patriarchy-2778950-2025-08-31",
      "headline": "How women with risqué content have India reelingSocial media shorts and Instagram Reels are creating dangerous friction in Indian society. The technology of the 21st century is clashing with the mores of a society still in the 19th century. While men opt for risky, women are getting into risque and vulgar content in an economy where eyeballs convert to hard cash. The Nikki Bhati case is just the tip of the iceberg. Here's how Indian society is reeling from the reel-making tornado."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/lasting-peace-in-ukraine-call-of-entire-humanity-pm-modi-to-putin-during-bilateral-meeting-in-tianjin-2779937-2025-09-01",
      "headline": "Peace in Ukraine call of entire humanity: PM to Putin during bilateral in ChinaPM Narendra Modi pressed for \"lasting peace\" in Ukraine during talks with Russian President Vladimir Putin at the SCO summit in China's Tianjin and also reaffirmed India-Russia ties amid the US tariff offensives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pak-in-attendance-pm-modi-questions-certain-nations-support-for-terrorism-in-sco-address-2779837-2025-09-01",
      "headline": "Pak in attendance, PM Modi flags 'certain nations' backing terror at SCO summitAt the SCO Leaders' meeting in China's Tianjin, Prime Minister Narendra Modi warned against double standards on terrorism, citing the recent attack in Jammu and Kashmir's Pahalgam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-astronaut-shubhanshu-shuklas-space-training-could-make-your-head-spin-2779890-2025-09-01",
      "headline": "Video: Indian astronaut Shubhanshu Shukla's spinning drill goes viralThe video shows Shukla enduring the rigours of a device designed to recreate the intense and disorienting motions astronauts may encounter in space, particularly in roll, pitch, and yaw axes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-crashes-indian-brides-wedding-in-us-internet-cant-stop-watching-2779866-2025-09-01",
      "headline": "Justin Bieber crashes Indian bride's wedding in US, internet can't stop watchingPop icon Justin Bieber surprised an Indian bride by making an unexpected appearance at her wedding in Los Angeles, creating a viral sensation on social media. A video and several pictures from the bash have since gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/polish-millionaire-identified-as-man-snatched-tennis-star-autographed-hat-child-us-open-video-2779871-2025-09-01",
      "headline": "Polish millionaire identified as man who snatched hat from child at US OpenThe child was left visibly distraught as the millionaire tucked the hat into his wife's bag. A video of the moment has now gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/connectivity-that-bypasses-sovereignty-loses-trust-pm-modis-veiled-swipe-at-china-over-belt-and-road-project-2779850-2025-09-01",
      "headline": "Connectivity that bypasses sovereignty..: PM calls out China's mega road projectAt the SCO summit in Tianjin, Prime Minister Narendra Modi subtly criticised China's Belt and Road Initiative, saying connectivity projects must respect sovereignty or risk losing trust and credibility. Highlighting India's own infrastructure initiatives such as Chabahar Port and the International North-South Transport Corridor, Modi emphasised security, connectivity, and opportunity as the three pillars of India's SCO policy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/young-indians-multivitamins-nutrient-deficiency-supplements-growth-2779967-2025-09-01",
      "headline": "Why are young Indians popping multivitamins?Hectic lifestyle and poor nutrition leave young Indians increasingly relying on multivitamins. This trend reflects a shift towards preventive health but warns against overuse without medical guidance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/cannibal-explosion-from-sun-to-hit-earth-today-power-grids-satellites-on-alert-2779918-2025-09-01",
      "headline": "Solar storm coming: Earth to be hit today, satellites in firing rangeThis rare and intense solar event began on August 30, when sunspot region AR 4199 unleashed a long-duration M2.7-class solar flare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-aide-peter-navarros-another-bizarre-take-on-india-russia-oil-ties-brahmins-profiteering-2779779-2025-09-01",
      "headline": "Brahmins profiteering: Trump aide's another bizarre take on India-Russia oil tiesPeter Navarro sharpened his attack on India, accusing New Delhi of laundering Russian oil, profiteering through Brahmin elites, and destabilising global order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education-today/story/19700101-supreme-court-seeks-centre-ncert-reply-on-transgender-inclusive-sexuality-education-2779966-2025-09-01",
      "headline": "Supreme Court seeks Centre, NCERT reply on transgender-inclusive sexuality educationThe Supreme Court has sought responses from NCERT, the Centre, and six states on a petition demanding transgender-inclusive sex education in schools. The plea, filed by a Class 12 student from Delhi, highlights gaps in current textbooks that fail to provide sensitive and accurate information.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-snubs-kohli-from-list-of-top-5-cricketers-apologises-2780033-2025-09-01",
      "headline": "AB de Villiers snubs Kohli from list of top 5 cricketers, picks Mohammad AsifLegendary South Africa batter AB de Villiers snubbed Virat Kohli from his list of the top five cricketers. De Villiers and Kohli have played together in Royal Challengers Bengaluru (RCB) for number of seasons in the Indian Premier League (IPL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2023-day-9-sinner-gauff-osaka-fourth-round-schedule-timing-2780010-2025-09-01",
      "headline": "US Open Day 9 Order of Play: Tricky test for Sinner, Osaka takes on GauffUS Open 2025 Day schedule: Jannik Sinner and Iga Swiatek will be looking to book their place in the quarterfinals. In a blockbuster outing, former champion Naomi Osaka takes on third seed Coco Gauff at the Arthur Ashe Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-2025-prize-pool-rise-bigger-than-men-2779982-2025-09-01",
      "headline": "Women's World Cup to offer USD 3.88m more in prize money than men's 2023 editionThe ICC has announced a total prize pool of USD 13.88 million for the Women's World Cup, starting on 30 September in India. This is USD 3.88 million more than what was on offer at the Men's ODI World Cup in 2023."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-slams-lalit-modi-for-releasing-slap-gate-video-involving-sreesanth-2779972-2025-09-01",
      "headline": "Harbhajan slams Lalit Modi for releasing 'slap-gate' video involving SreesanthFormer India cricketer Harbhajan Singh has slammed Lalit Modi for releasing the unseen clip of the slap-gate incident involving him and Sreesanth from the Indian Premier League 2008 (IPL 2008)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-asia-cup-squad-jitesh-sharma-2779963-2025-09-01",
      "headline": "With Jitesh in fray, can Sanju Samson secure a middle-order spot in Asia Cup?Sanju Samson and Jitesh Sharma are the only two wicketkeepers named in India's Asia Cup 2025 squad. With the T20 World Cup 2026 on the horizon, will Sanju be able to beat the competition and make the place his own? Aakash Chopra delves deep into the debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-misses-daughter-tara-birthday-us-open-quarter-final-2779939-2025-09-01",
      "headline": "US Open glory over birthday bash: Djokovic says daughter not happy with clashNovak Djokovic will miss his daughter Tara's eighth birthday to focus on his US Open quarter-final against Taylor Fritz. The Serb aims to gift his daughter a victory despite her disappointment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-asia-cup-test-debut-2779928-2025-09-01",
      "headline": "Not just a T20 specialist: Rinku Singh puts his hand up for Test cricketIndia batter Rinku Singh does not want to be an one-format star. Speaking on the sidelines of the UP T20 League he said that he wants to make his debut in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-dinesh-karthik-on-jitesh-sharma-was-never-desperate-2779923-2025-09-01",
      "headline": "Jitesh Sharma was never desperate to play for India: Dinesh KarthikFormer India batter Dinesh Karthik has praised Jitesh Sharma for making his comeback into the Indian team and revealed that he was never too desperate to play for the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-cares-manifesto-bengaluru-stampede-2779874-2025-09-01",
      "headline": "RCB release 6-point manifesto for 'meaningful action' after Bengaluru stampedeRoyal Challengers Bengaluru have released a 6-point manifesto to address the Bengaluru stampede issue. The manifesto aims at providing meaningful action in the aftermath of the tragedy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-rahul-dravid-rajasthan-royals-exit-ab-de-villiers-2779868-2025-09-01",
      "headline": "Rahul Dravid was sort of kicked out of Rajasthan Royals job: AB de VilliersIPL 2025: AB de Villiers suggested Rahul Dravid's departure from Rajasthan Royals was owner-driven. The 2008 champions said they parted ways with Dravid after the former India coach refused to accept a broader role in the lead-up to the 2026 auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/inter-miami-leagues-cup-final-luis-suarez-spit-video-2779852-2025-09-01",
      "headline": "Watch: Luis Suarez spits on coaching staff after fight breaks out in Leagues Cup finalLeagues Cup Final: Inter Miami striker Luis Suarez appeared to spit on one of the coaching staff of the opposition team after Inter Miami lost 0-3 to Seattle Sounders in the final of the Leagues Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-asia-cup-test-debut-2779928-2025-09-01",
      "headline": "Not just a T20 specialist: Rinku Singh puts his hand up for Test cricketIndia batter Rinku Singh does not want to be an one-format star. Speaking on the sidelines of the UP T20 League he said that he wants to make his debut in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-dinesh-karthik-on-jitesh-sharma-was-never-desperate-2779923-2025-09-01",
      "headline": "Jitesh Sharma was never desperate to play for India: Dinesh KarthikFormer India batter Dinesh Karthik has praised Jitesh Sharma for making his comeback into the Indian team and revealed that he was never too desperate to play for the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-cares-manifesto-bengaluru-stampede-2779874-2025-09-01",
      "headline": "RCB release 6-point manifesto for 'meaningful action' after Bengaluru stampedeRoyal Challengers Bengaluru have released a 6-point manifesto to address the Bengaluru stampede issue. The manifesto aims at providing meaningful action in the aftermath of the tragedy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-rahul-dravid-rajasthan-royals-exit-ab-de-villiers-2779868-2025-09-01",
      "headline": "Rahul Dravid was sort of kicked out of Rajasthan Royals job: AB de VilliersIPL 2025: AB de Villiers suggested Rahul Dravid's departure from Rajasthan Royals was owner-driven. The 2008 champions said they parted ways with Dravid after the former India coach refused to accept a broader role in the lead-up to the 2026 auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/inter-miami-leagues-cup-final-luis-suarez-spit-video-2779852-2025-09-01",
      "headline": "Watch: Luis Suarez spits on coaching staff after fight breaks out in Leagues Cup finalLeagues Cup Final: Inter Miami striker Luis Suarez appeared to spit on one of the coaching staff of the opposition team after Inter Miami lost 0-3 to Seattle Sounders in the final of the Leagues Cup."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}