{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-261-points-higher-nifty-above-24600-eternal-gains-over-3-percent-2735618-2025-06-04",
      "headline": "Sensex ends 261 points higher; Nifty above 24,600; Eternal gains over 3%The S&P BSE Sensex added 261 points to end at 80,998.25, while the NSE Nifty50 was up by 77.70 points to close at 24,620.20. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-green-steel-production-energy-costs-green-hydrogen-incentives-2735598-2025-06-04",
      "headline": "Government seeks lower energy costs for backing green steel incentives: ReportIndia's finance ministry calls for lower energy prices to facilitate incentives for green steel production, amidst concerns over high green hydrogen costs and inflation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-ay-2025-26-itr-1-and-itr-4-enabled-on-e-filing-portal-who-can-file-online-check-eligibility-2735586-2025-06-04",
      "headline": "ITR-1, ITR-4 filing begins for AY 2025–26: Are you eligible?The Income Tax Department has enabled online filing of ITR-1 and ITR-4 forms for the assessment year 2025-26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rbi-mpc-rate-cut-sector-stock-market-news-trading-tips-expert-recommendation-buy-shares-2735591-2025-06-04",
      "headline": "RBI policy meet begins today: These stocks could rally if rate cut happensThe market is expecting a cut of 25 to 50 basis points (bps), mainly because inflation has been coming down and there are growing worries about slower economic growth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-rare-earth-export-controls-disrupt-global-supply-chains-2735550-2025-06-04",
      "headline": "Why China's rare earth export curbs are shaking global supply chainsChina's recent restrictions on rare earth exports are causing global industry disruptions, prompting urgent diplomatic and economic responses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/grse-stock-jumps-10-percent-mou-kongsberg-polar-research-vessel-2735536-2025-06-04",
      "headline": "GRSE shares jump 10% today: What's fuelling the rally?GRSE shares surged by up to 10% after sealing a partnership with Norway's Kongsberg for India's first Polar Research Vessel, highlighting a pivotal moment in deep-sea research and defence shipbuilding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/1-crore-salary-mumbai-cost-living-wealth-perception-2735511-2025-06-04",
      "headline": "Is Rs 1 crore salary still a big deal? Depends on where you live and who you askAn alumnus of IIM Ahmedabad has raised questions about the real value of a 1 crore annual salary in Mumbai. He pointed out that in areas like Borivali or Thane, a Rs 1 crore salary might still make one stand out, but in South Mumbai's boardrooms, where finance and tech executives frequently earn between Rs 1 crore and Rs 5 crore, this income is seen as average."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-steel-aluminium-tariffs-50-percent-double-impact-india-donald-trump-2735508-2025-06-04",
      "headline": "Trump doubles metal tariffs to 50% but skips UK. What it means for IndiaUS President Donald Trump plans to double tariffs on imported steel and aluminium, affecting global trade dynamics. The UK's exemption contrasts with challenges for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/coforge-stock-split-shares-drop-80-percent-explained-2735506-2025-06-04",
      "headline": "Did Coforge shares drop 80% today? Here's all you need to knowInvestors might have initially mistaken this adjustment for a loss. Despite the apparent drop, the stock actually opened higher at Rs 1,720.05 on Wednesday, with a 0.60% increase. It was up 1.4% on the BSE at 12:18 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-kisan-20th-instalment-june-2025-e-kyc-eligibility-aadhaar-linkage-check-date-beneficiary-list-and-full-scheme-details-2735475-2025-06-04",
      "headline": "Are you eligible for PM-Kisan yojana? Check 20th instalment and requirementsThe upcoming 20th instalment is anticipated to be disbursed in the first or second week of June 2025. Under this scheme, farmers can receive the annual financial aid of Rs 6,000, distributed in three equal instalments of Rs 2,000 every four months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stop-sudden-tax-demands-raghuram-rajan-on-fixing-indias-business-environment-2735480-2025-06-04",
      "headline": "Stop sudden tax demands: Raghuram Rajan on fixing India's business environmentRaghuram Rajan says India must fix its business environment, starting with killing off surprise tax shocks that are scaring investors and strangling the country's shot at global supply chain glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-benefit-drawbacks-key-sectors-raghuram-rajan-explained-2735448-2025-06-04",
      "headline": "Explained: How India can benefit from striking trade deal with USIndia's challenge goes beyond just sealing a US trade deal, it's about finding the right balance between opening up for growth and safeguarding its own industries."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metroin-dino-trailer-anurag-basu-film-explores-love-life-longing-in-busy-city-2735589-2025-06-04",
      "headline": "Metro...In Dino trailer: Anurag Basu film explores love, life, longing in busy cityAnurag Basu returns with 'Metro…In Dino', a film that explores modern love stories set in fast-paced city life. The trailer promises emotional depth, relatable characters, and soulful music by Pritam.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kgf-director-prashanth-neel-hits-friend-rcb-ipl-win-2735523-2025-06-04",
      "headline": "KGF director playfully hits friend in excitement after RCB's IPL win. Watch'KGF' director Prashanth Neel was joyful after Royal Challengers Bengaluru (RCB) lifted the IPL trophy for the first time. He playfully hit his friend in extreme excitement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-becomes-netflix-stranger-things-season-4-2735444-2025-06-04",
      "headline": "Adolescence becomes Netflix's 2nd most-watched English show surpassing Stranger Things 4'Adolescence' has become Netflix's second most-watched English-language series, surpassing 'Stranger Things Season 4' with 141.2 million views in 80 days. Besides, the show 'Wednesday' and non-English hits like 'Squid Game' rank higher in Netflix's all-time viewership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/nimrit-kaur-ahluwalia-missed-diljit-dosanjh-film-choti-sarrdaarni-shoot-2735434-2025-06-04",
      "headline": "Actor Nimrit Ahluwalia skipped Diljit Dosanjh's film due to Choti Sarrdaarni shootActor Nimrit Kaur Ahluwalia revealed she missed a film with Diljit Dosanjh due to her 'Choti Sarrdaarni' schedule. She later made her Punjabi debut with 'Shaunki Sardar.'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-khushi-kapoor-orry-at-cannes-2025-2735498-2025-06-04",
      "headline": "Janhvi Kapoor's 'champi' session with Khushi was perfect prep before Cannes. WatchBefore actor Janhvi Kapoor's Cannes debut, she enjoyed a relaxing 'champi' from her sister Khushi. Orry posted the video along with other behind-the-scenes glimpses from Cannes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/preity-zinta-is-visibly-in-tears-after-pbks-loses-to-rcb-fans-extend-support-2735470-2025-06-04",
      "headline": "Preity Zinta's fans heartbroken as PBKS loses IPL: She deserves the trophyPreity Zinta looked upset and emotional after her co-owned team, PBKS, lost the IPL trophy to RCB. Several pictures of the actor's disappointed expressions have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-advance-booking-for-day-1-india-detailed-report-kamal-haasan-film-gears-up-for-solid-opening-2735478-2025-06-04",
      "headline": "Thug Life advance booking: Kamal Haasan's film gears up for solid openingEven with all the controversy around the film, 'Thug Life' is generating significant buzz in advance booking. The Kamal Haasan film is looking at collecting a good number on its opening day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stolen-movie-review-karan-talwar-director-steals-your-attention-2735454-2025-06-04",
      "headline": "Stolen review: Karan Tejpal's film steals your attention and never lets it goReleased-Wed Jun 04, 2025Actor Abhishek Banerjee delivers a powerful performance in the tense thriller 'Stolen', directed by newcomer Karan Tejpal. The film explores dark social themes while keeping viewers hooked from start to finish. Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dept-q-review-matthew-goode-cold-case-series-gripping-2735148-2025-06-04",
      "headline": "Department Q review: Matthew Goode shines in gripping slow-burn thrillerReleased-Thu May 29, 2025Dept Q review: Crime thriller 'Dept. Q' adapts Jussi Adler-Olsen's noir novels into a gripping series. The show delves into complex characters and slow-burning mysteries, promising an intense viewing experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaya-bachchan-schools-paps-again-as-they-follow-her-to-car-watch-viral-video-as-she-says-chaliye-aap-bhi-2735436-2025-06-04",
      "headline": "Chaliye aap bhi: Jaya Bachchan schools paps again as they follow her to carVeteran actor Jaya Bachchan is often seen asking paparazzi to behave themselves. This time too, she sarcastically asked them to back-off as they followed her to her car. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-common-man-appeal-everyday-characters-criminal-justice-season-4-2734955-2025-06-04",
      "headline": "Ordinary but unforgettable: Why Pankaj Tripathi's everyday characters stay with youActor Pankaj Tripathi, renowned for his impeccable acting, stands out from the crowd due to his common-man appeal, which adds a unique layer to his craft. Read to know more about his skills and how his acting has an everlasting impact.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-allu-ayaan-royal-challengers-bengaluru-win-ipl-win-2735410-2025-06-04",
      "headline": "No more Ee Saala Cup Lollipop: Allu Arjun's son's funny video after RCB's IPL winAllu Arjun's son, Allu Ayaan, was extremely emotional after Royal Challengers Bengaluru (RCB) won its first-ever IPL trophy. He poured water on his head, expressed his love for Virat Kohli and said he cannot say 'Ee Saala Cup Namde' any more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/15-years-of-vedam-when-telugu-cinema-dared-to-dream-differently-2734984-2025-06-04",
      "headline": "15 years on, Vedam remains Telugu cinema's unmatched masterpieceJune 4 marks 15 years of 'Vedam', a Telugu film that broke conventions with its layered storytelling, symbolic characters, and powerful music. Still fresh and unique, it remains a cinematic milestone that challenges the industry to aspire higher."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/allu-arjun-ranveer-singh-vijay-deverakonda-rashmika-mandanna-rcb-ipl-win-worth-the-wait-2735384-2025-06-04",
      "headline": "Worth the wait: Allu Arjun, Ranveer Singh, others celebrate RCB's maiden IPL winAllu Arjun, Ranveer Singh, Vicky Kaushal, Vijay Deverakonda, Rashmika Mandanna and several other celebrities congratulated Royal Challengers Bengaluru on their maiden IPL title win. This win ended their 18-year wait."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-jumps-in-joy-rcb-big-ipl-2025-win-virat-kohli-2735369-2025-06-04",
      "headline": "Anushka Sharma's ecstatic celebration after RCB's maiden IPL win is pure joyActor Anushka Sharma couldn't control her excitement after Royal Challengers Bengaluru (RCB) ended up as the champions of IPL 2025. In a viral video, she could be seen jumping in joy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/love-island-usa-season-7-how-to-watch-stream-schedule-and-premiere-details-glbs-2735354-2025-06-04",
      "headline": "Love Island USA Season 7: How to watch, stream schedule, and premiere detailsLove Island USA Season 7 premieres June 3 on Peacock with new twists, ten fresh Islanders in Fiji, and real-time audience interaction through the app. Episodes also air on Bravo and Hulu.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/diddy-gave-bag-of-cash-to-bury-hotel-assault-tape-ex-guard-tells-court-glbs-2735348-2025-06-04",
      "headline": "Diddy gave bag of cash to bury hotel assault tape, ex-guard tells courtA former hotel guard testified that Sean Combs paid $100,000 to suppress assault footage. The video, now key evidence in a federal case, supports multiple abuse allegations Combs denies.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/what-are-labubu-dolls-tiktoks-viral-collectible-is-selling-out-fast-glbs-2735344-2025-06-04",
      "headline": "What are Labubu Dolls? TikTok's viral collectible is selling out fastLabubu dolls, creepy-cute collectibles from Pop Mart, have gone viral on TikTok due to celebrity influence, surprise unboxing, and high resale value — some fetching up to $7,000 online.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/is-taylor-swift-pregnant-internet-buzzes-over-baby-bump-photo-glbs-2735329-2025-06-04",
      "headline": "Is Taylor Swift pregnant? Internet buzzes over 'baby bump' photoA viral photo of Taylor Swift sparked speculation that she may be pregnant with Travis Kelce's child, though fans are divided and the couple has not publicly addressed the rumors.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-asian-development-bank-bailout-package-india-objections-terrorism-support-2735574-2025-06-04",
      "headline": "Pak secures bailout from Asian Development Bank despite India's objectionsThe development comes a month after Pakistan secured a $1 billion (around Rs 8,500 crore) package from the International Monetary Fund (IMF)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bilawal-bhutto-un-journalist-question-muslims-demonised-in-india-operation-sindoor-2735526-2025-06-04",
      "headline": "Journalist's question wrecks Bilawal Bhutto's 'Muslims demonised' in India claimAt a UN press briefing, Bilawal Bhutto Zardari was left red-faced after a journalist rebutted his claim that Indian Muslims were being demonised, citing Muslim officers leading Operation Sindoor briefings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indore-couple-missing-in-meghalaya-last-audio-sonam-raghuvanshi-raja-tourists-2735593-2025-06-04",
      "headline": "I'm exhausted: Missing woman's audio surfaces after husband's murder in MeghalayaMadhya Pradesh residents Raja Raghuvanshi and his wife Sonman travelled to Meghalaya for their honeymoon and went missing on May 23, hours after they checked out of a homestay at Nongriat village."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/free-speech-doesnt-extend-to-defaming-army-high-court-slams-rahul-gandhis-thrashing-soldiers-remark-2735608-2025-06-04",
      "headline": "Free speech doesn't extend to defaming Army: High Court raps Rahul GandhiThe High Court made the remarks in connection with Rahul Gandhi's \"Chinese troops are thrashing Indian soldiers in Arunachal\" remark during Bharat Jodod Yatra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-bengaluru-winning-celebration-live-updates-virat-kohli-ab-de-villiers-chris-gayle-rajat-patidar-2735585-2025-06-04",
      "headline": "RCB IPL Celebrations Live: Champions arrive in BengaluruRCB IPL 2025 victory celebrations Bengaluru Live Updates: Royal Challengers Bengaluru team have landed in Bengaluru, and stars will get felicitated at the M Chinnaswamy stadium. There is still no confirmation if the victory parade is set to happen or not in Vidhana Soudha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-students-delete-posts-accounts-social-media-study-visa-vetting-american-colleges-admission-deport-2735103-2025-06-04",
      "headline": "Indian students are rushing to delete posts for US visa, but that's risky tooAfter the Trump administration's decision to vet social media posts thoroughly for US visas, Indian students are rushing to delete posts and even accounts to fulfil their dream of studying in the US. However, experts suggest this could raise red flags. And it isn't just about posts, even likes and shares could lead to visa denials by the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/video/astronaut-shubhanshu-shuklas-top-space-thrill-he-tells-indiatodayin-2735554-2025-06-04",
      "headline": "Astronaut Shubhanshu Shukla's top space thrill? He tells India TodayIndian astronaut Shubhanshu Shukla took questions from India Today Science in a briefing to reveal what he is most excited about when he reaches the Space Station. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/thank-you-tamil-nadu-for-supporting-me-says-kamal-haasan-with-thug-life-crew-on-stage-amid-kannada-row-2735571-2025-06-04",
      "headline": "Thank you Tamil Nadu for standing by me, says Kamal Haasan amid Kannada rowKamal Haasan, along with the crew of 'Thug Life', met the media in Chennai on Wednesday. At the event, he thanked Tamil Nadu for supporting and standing by him. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indore-tourist-body-found-meghalaya-gorge-wife-still-missing-ndrf-search-operation-2735497-2025-06-04",
      "headline": "Indore tourist killed with machete in Meghalaya, search for wife enters 11th dayThe couple went missing on May 23, hours after they checked out of their homestay at Nongriat village, located in Meghalaya's East Khasi Hills district."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/fbi-arrests-chinese-nationals-for-smuggling-crop-killing-pathogen-into-us-glbs-2735359-2025-06-04",
      "headline": "Chinese scientist, boyfriend arrested for smuggling crop-killing fungus into USTwo Chinese nationals were arrested for smuggling a dangerous crop fungus into the US, posing risks to food security and public health. They face multiple federal charges and possible deportation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/colour-theory-philosophy-descartes-hume-science-perception-newton-galileo-stephen-palmer-heres-more-2733356-2025-06-04",
      "headline": "Why we see a red apple red. Is colour in our eyes or in the mind's eye?Colour isn't just a physical property; it's how our brains interpret light reflected from objects. Different creatures perceive colours differently, so colour might be more about perception than reality. Philosophers debate whether colour is real, mental, or a mix of both. Simply put: colour is partly in the world and partly in the mind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishi-sunak-poses-with-virat-kohli-and-anushka-sharma-after-rcbs-ipl-triumph-2735572-2025-06-04",
      "headline": "Rishi Sunak poses with Virat Kohli and Anushka Sharma after RCB's IPL triumphFormer UK Prime Minister Rishi Sunak was seen celebrating with Virat Kohli and Anushka Sharma as Royal Challengers Bengaluru (RCB) beat Punjab Kings (PBKS) by five runs in the Indian Premier League 2025 (IPL 2025 final)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/egg-biryani-added-to-kerala-anganwadi-menu-after-toddlers-viral-request-2735590-2025-06-04",
      "headline": "Kerala adds egg biryani to anganwadi menu after toddler's viral video pleaAfter a video of a toddler rejecting upma went viral on Instagram, Kerala Minister Veena George announced egg biryani and other nutritious items in anganwadi centres' updated food menu."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-narendra-surrender-pm-modi-jab-pakistan-ceasefire-donald-trump-2735528-2025-06-04",
      "headline": "Narendra is not India, India is not Narendra: Congress's 'surrender' jab at PMPawan Khera said the Prime Minister 'surrendered' and agreed to a ceasefire with Pakistan after a call from Donald Trump despite the armed forces being in a dominant position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/youtuber-jasbir-singh-with-11-million-subscribers-arrested-in-punjab-for-spying-has-ties-to-jyoti-malhotra-2735439-2025-06-04",
      "headline": "1 million subscribers, Jyoti Malhotra link: Another YouTuber arrested for 'spying'YouTuber Jasbir Singh, who runs the channel 'Jaan Mahal' with over 1.1 million subscribers, has close ties with Jyoti Malhotra — already arrested for allegedly spying for Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/inside-japans-fantasy-fuelled-love-hotels-2732012-2025-06-04",
      "headline": "Inside Japan's fantasy-fuelled love hotelsJapan's love hotels were initially considered a place that offered couples space for intimacy. Today, it has transitioned beyond exploration of the sexual side, and piques the curiosity of travellers too. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-title-bowling-crown-jewel-hazlewood-bhuvneshwar-krunal-2735502-2025-06-04",
      "headline": "Meme-material to game-changers: How bowling became RCB's IPL crown jewelOnce ridiculed for their toothless attack, Royal Challengers Bengaluru's bowling unit turned the narrative on its head in IPL 2025. Long seen as meme-material in a batting-heavy franchise, the bowlers rose to the occasion when it mattered most—delivering the knockout punch in the final and sealing RCB's maiden title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/executive-vs-judiciary-judges-must-be-free-collegium-shields-from-executive-interference-chief-justice-of-india-br-gavai-2735549-2025-06-04",
      "headline": "Judges must be free, collegium shields from executive interference: Chief JusticeThe Chief Justice of India, BR Gavai, said that the Constitution explicitly mandates that the State 'take steps to separate the judiciary from the executive in public services.' Referring to the Third and Fourth Judges cases, he said that the Collegium system was created in the first place to keep the judiciary independent and free from state control.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/malaysia-snubs-pakistan-islamic-nations-call-to-block-indias-operation-sindoor-events-2735406-2025-06-04",
      "headline": "We are both Islamic nations: Pak's religion card against India flops in MalaysiaTrying to play the religion card, the Pakistani embassy urged Malaysian government officials to cancel all 10 programmes by the Sanjay Jha-led delegation, saying, 'We are an Islamic country, you are an Islamic country... don't listen to the Indian delegation.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/what-is-agroterrorism-us-arrests-chinese-nationals-india-pakistan-bangladesh-2735471-2025-06-04",
      "headline": "India has been a victim of Pak 'agro-terrorism' as US case spotlights threatTwo Chinese nationals have been charged in the US for smuggling a toxic fungus in an attempt to infect farmland. The incident brings into the spotlight a quieter yet devastating form of terrorism that has taken root in several countries - agro-terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-new-banknotes-mujibur-rahman-out-hindu-temple-kantajew-mondir-kantaji-dinajpur-targeted-by-islamists-2735045-2025-06-04",
      "headline": "Hindu temple hit by terrorists to be on Bangladesh 20-taka notesThe Muhammad Yunus-led interim government is on a drive to move Bangladesh away from the legacy and memory of Mujibur Rahman, its founding father. The image of a Hindu temple targeted by Islamic terrorists is among those replacing Mujib on the new banknotes. Here's more about the Kantajew temple of Dinajpur on whose premises a mosque was also coming up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcbs-open-top-bus-parade-in-bengaluru-cancelled-2735537-2025-06-04",
      "headline": "No open bus parade for RCB due to traffic congestion fearsIPL 2025: The open bus parade for Royal Challengers Bengaluru after their Indian Premier League win has been called off due to traffic congestion in the city. On Tuesday, RCB won their maiden title after beating Punjab Kings. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/vijay-mallya-trolled-rcb-historic-ipl-win-x-posts-memes-jokes-sbi-dream-2735562-2025-06-04",
      "headline": "Vijay Mallya cheers RCB for historic IPL win, Internet reminds him of 'SBI's dream'Vijay Mallya joined RCB's celebrations online after they clinched their maiden IPL title, but the internet had a different party in mind, flooding his posts with memes and jabs about his unpaid loans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/latest-auto-news/story/delhi-bans-non-bs6-non-cng-non-ev-commercial-vehicles-from-november-1-2735527-2025-06-04",
      "headline": "Delhi bans non-BS6, non-CNG, non-EV commercial vehicles from November 1Delhi Chief Minister Rekha Gupta announced the Air Pollution Mitigation Plan 2025, aiming to curb emissions by allowing only BS6, CNG, or electric commercial vehicles from November 1, alongside green mobility reforms."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/groom-stops-wedding-rituals-to-witness-rcb-winning-ipl-trophy-after-18-years-2735620-2025-06-04",
      "headline": "Watch: Groom stops wedding rituals to witness RCB winning IPL trophy after 18 yearsA groom stopped his wedding rituals midway to witness Royal Challengers Bengaluru (RCB) winning their maiden IPL trophy after 18 years. RCB beat Punjab Kings (PBKS) by six runs to win the IPL 2025 final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jitesh-sharma-rcb-vs-pbks-virat-kohli-2735605-2025-06-04",
      "headline": "Jitesh Sharma emotional as IPL 2025 title dream manifests into realityIPL 2025: Jitesh Sharma was over the moon as his manifestation came true - Royal Challengers Bengaluru lifted their maiden IPL trophy after a six-wicket win over Punjab Kings on Wednesday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-bengaluru-winning-celebration-live-updates-virat-kohli-ab-de-villiers-chris-gayle-rajat-patidar-2735585-2025-06-04",
      "headline": "RCB IPL Celebrations Live: Champions arrive in BengaluruRCB IPL 2025 victory celebrations Bengaluru Live Updates: Royal Challengers Bengaluru team have landed in Bengaluru, and stars will get felicitated at the M Chinnaswamy stadium. There is still no confirmation if the victory parade is set to happen or not in Vidhana Soudha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishi-sunak-poses-with-virat-kohli-and-anushka-sharma-after-rcbs-ipl-triumph-2735572-2025-06-04",
      "headline": "Rishi Sunak poses with Virat Kohli and Anushka Sharma after RCB's IPL triumphFormer UK Prime Minister Rishi Sunak was seen celebrating with Virat Kohli and Anushka Sharma as Royal Challengers Bengaluru (RCB) beat Punjab Kings (PBKS) by five runs in the Indian Premier League 2025 (IPL 2025 final)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-day-11-live-novak-djokovic-coco-gauff-jannik-sinner-mirra-andreeva-2735573-2025-06-04",
      "headline": "French Open Day 11 LIVE: Madison Keys, Coco Gauff in battle of championsFrench Open Day 11 Live Updates: Madison Keys and Coco Gauff will be up against each other in the first quarterfinal of the day. It will be followed by the match between Mirra Andreeva and Lois Boisson. Later in the day, Novak Djokovic and Jannik Sinner will be in action on Centre Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcbs-open-top-bus-parade-in-bengaluru-cancelled-2735537-2025-06-04",
      "headline": "No open bus parade for RCB due to traffic congestion fearsIPL 2025: The open bus parade for Royal Challengers Bengaluru after their Indian Premier League win has been called off due to traffic congestion in the city. On Tuesday, RCB won their maiden title after beating Punjab Kings. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/rcbs-victory-parade-grand-celebration-awaits-in-bengaluru-after-18-year-title-wait-2735477-2025-06-04",
      "headline": "RCB to return to Bengaluru for grand victory parade after historic IPL winRoyal Challengers Bangalore (RCB) are heading back to Bengaluru after their historic IPL victory. A grand celebration awaits the team, including a victory parade starting at 3:30 PM from Akku Vidhan Soda and ending at Chinnaswamy Stadium. The team, led by Virat Kohli, won the title after an 18-year wait. Players will visit the assembly and meet the Chief Minister as part of the celebrations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-ricky-ponting-not-searching-for-excuses-after-loss-2735524-2025-06-04",
      "headline": "Ponting not searching for excuses after PBKS' loss, vows to win IPL next yearPunjab Kings (PBKS) head coach Ricky Ponting refrained from giving any excuses following his team's loss in the final of the Indian Premier League 2025 (IPL 2025). RCB beat PBKS by six runs in the final to claim their maiden IPL title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-title-bowling-crown-jewel-hazlewood-bhuvneshwar-krunal-2735502-2025-06-04",
      "headline": "Meme-material to game-changers: How bowling became RCB's IPL crown jewelOnce ridiculed for their toothless attack, Royal Challengers Bengaluru's bowling unit turned the narrative on its head in IPL 2025. Long seen as meme-material in a batting-heavy franchise, the bowlers rose to the occasion when it mattered most—delivering the knockout punch in the final and sealing RCB's maiden title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-virat-kohli-remembers-ab-de-villiers-legacy-2735487-2025-06-04",
      "headline": "Kohli recalls AB de Villiers' eternal legacy: Still has most POTM awards in IPLRoyal Challengers Bengaluru (RCB) batter Virat Kohli recalled AB de Villiers' legacy for the Royal Challengers Bengaluru (RCB) as the team ended their 18-year-long ICC trophy drought."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-order-of-play-novak-djokovic-jannik-sinner-coco-gauff-2735488-2025-06-04",
      "headline": "French Open Day 11: Djokovic, Sinner, Gauff eye semis berthFrench Open 2025 Day 11 Order of Play: Novak Djokovic, Jannik Sinner, Coco Gauff, Mirra Andreeva and others will be looking to secure their berths in the semi-finals of the clay-court major. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/rcbs-victory-parade-grand-celebration-awaits-in-bengaluru-after-18-year-title-wait-2735477-2025-06-04",
      "headline": "RCB to return to Bengaluru for grand victory parade after historic IPL winRoyal Challengers Bangalore (RCB) are heading back to Bengaluru after their historic IPL victory. A grand celebration awaits the team, including a victory parade starting at 3:30 PM from Akku Vidhan Soda and ending at Chinnaswamy Stadium. The team, led by Virat Kohli, won the title after an 18-year wait. Players will visit the assembly and meet the Chief Minister as part of the celebrations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-ricky-ponting-not-searching-for-excuses-after-loss-2735524-2025-06-04",
      "headline": "Ponting not searching for excuses after PBKS' loss, vows to win IPL next yearPunjab Kings (PBKS) head coach Ricky Ponting refrained from giving any excuses following his team's loss in the final of the Indian Premier League 2025 (IPL 2025). RCB beat PBKS by six runs in the final to claim their maiden IPL title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-title-bowling-crown-jewel-hazlewood-bhuvneshwar-krunal-2735502-2025-06-04",
      "headline": "Meme-material to game-changers: How bowling became RCB's IPL crown jewelOnce ridiculed for their toothless attack, Royal Challengers Bengaluru's bowling unit turned the narrative on its head in IPL 2025. Long seen as meme-material in a batting-heavy franchise, the bowlers rose to the occasion when it mattered most—delivering the knockout punch in the final and sealing RCB's maiden title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-virat-kohli-remembers-ab-de-villiers-legacy-2735487-2025-06-04",
      "headline": "Kohli recalls AB de Villiers' eternal legacy: Still has most POTM awards in IPLRoyal Challengers Bengaluru (RCB) batter Virat Kohli recalled AB de Villiers' legacy for the Royal Challengers Bengaluru (RCB) as the team ended their 18-year-long ICC trophy drought."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-order-of-play-novak-djokovic-jannik-sinner-coco-gauff-2735488-2025-06-04",
      "headline": "French Open Day 11: Djokovic, Sinner, Gauff eye semis berthFrench Open 2025 Day 11 Order of Play: Novak Djokovic, Jannik Sinner, Coco Gauff, Mirra Andreeva and others will be looking to secure their berths in the semi-finals of the clay-court major. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}