{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-is-trumps-big-deal-claim-a-pressure-tactic-experts-weigh-in-2747356-2025-06-27",
      "headline": "India-US trade deal: Is Trump's 'big deal' claim a pressure tactic? Experts weigh inUS President Donald Trump on Thursday announced a trade deal with China on rare earths and hinted at a 'very big' trade agreement with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-rallies-nasdaq-sp-500-record-highs-ai-stocks-fed-policy-recession-fears-ease-2747331-2025-06-27",
      "headline": "Wall Street rallies to record highs as AI stocks soar, recession fears easeUS stock markets hit all-time highs on Friday thanks to an AI boom and Fed hints at looser policy ahead. Trade deals with the UK and China have also fuelled market hopes that a global recession could be avoided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-slashes-fd-and-savings-rates-again-in-june-details-here-2747224-2025-06-27",
      "headline": "HDFC Bank slashes FD and savings rates again in June. Details hereHDFC Bank's latest changes signal that deposit rates could remain soft if the RBI continues its rate-cutting cycle. Depositors should review their plans, stay updated with rate changes, and make informed decisions before booking new FDs or RDs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-may-soon-allow-direct-epf-withdrawals-via-atms-and-upi-2747195-2025-06-27",
      "headline": "EPFO may soon allow direct EPF withdrawals via ATMs and UPIThe EPFO recently increased the auto-settlement limit from Rs 1 lakh to Rs 5 lakh. This means members can get up to Rs 5 lakh cleared automatically within three days for things like medical expenses, education, housing, or marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-300-points-higher-nifty-above-25600-jio-financial-shares-jump-4-2747184-2025-06-27",
      "headline": "Sensex ends 300 points higher, Nifty above 25,600; Jio Financial shares jump 4%The S&P BSE Sensex ended 303.03 points higher at 84,058.90, while the NSE Nifty50 rose 88.80 to settle at 25,637.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/switched-jobs-this-year-here-is-how-to-file-your-itr-right-got-salary-from-two-employers-2747138-2025-06-27",
      "headline": "Switched jobs this year? Here's how to file your ITR rightIf you worked for more than one employer in the same year, make sure to report each salary and related deductions separately in the ITR form. Don't mix them up; each employer's income should be shown in its own section. This helps avoid overlaps and mistakes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-indias-ultra-rich-families-investing-in-2025-2747127-2025-06-27",
      "headline": "Where are India's ultra-rich families investing in 2025?A new EY–Julius Baer report, The Indian Family Office Playbook, reveals that many family offices are moving away from traditional wealth preservation and diving into global markets, private credit, and real assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-45-lakh-for-raising-a-child-why-parenting-feels-like-a-luxury-now-2747066-2025-06-27",
      "headline": "Rs 45 lakh for raising a child? Why parenting feels like a luxury nowRising everyday expenses, pricey education and costly healthcare are forcing many young couples to think twice about kids. According to a startup founder, starting a family is personal, but money has become a key factor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-hc-supports-sbi-decision-cancelling-circle-based-officer-appointment-over-cibil-report-anomalies-bad-credit-score-2747020-2025-06-27",
      "headline": "Madras High Court backs bank appointment cancellation over adverse CIBIL reportThe Madras High Court upheld SBI's decision to cancel a candidate's appointment due to adverse credit history, stressing that financial discipline is essential for roles involving public money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-guarantees-in-mutual-funds-investment-adviser-warns-against-risky-pf-advice-2747011-2025-06-27",
      "headline": "No guarantees in mutual funds: Investment adviser warns against risky PF adviceAn investment adviser explains why PF money should not be used for risky bets like mutual funds with \"guaranteed returns.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-saving-30-percent-of-your-income-is-not-always-possible-ca-explains-2746968-2025-06-27",
      "headline": "Why saving 30% of your income isn't always possible, CA explainsFor those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, explains CA Abhishek Walia. For those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, he says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-in-july-will-sensex-nifty-hit-record-high-explained-2746951-2025-06-27",
      "headline": "Will Sensex and Nifty hit record highs in July? Here's all you need to knowWith domestic flows steady and global risks fading, July could be the moment markets break through resistance. But with key events ahead, will momentum hold or falter?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-dies-42-mika-singh-aly-goni-celebs-mourn-2747429-2025-06-28",
      "headline": "Mika Singh, Aly Goni to Paras Chhabra, celebs mourn Shefali Jariwala's deathActor Shefali Jariwala, known for her 'Bigg Boss 13' stint and the hit 'Kaanta Laga', died at the age of 42 following a cardiac arrest. Her untimely death has left the entertainment industry and fans in shock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/katy-perry-orlando-bloom-break-up-after-almost-a-decade-together-heres-why-glbs-2747410-2025-06-28",
      "headline": "Katy Perry, Orlando Bloom break up after almost a decade together: Here's whyKaty Perry and Orlando Bloom have split after nine years together. Despite a strong bond and a child, growing distance, conflicting careers, and solo appearances triggered the end of their engagement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shefali-jariwala-death-kaanta-laga-actor-cardiac-arrest-2747409-2025-06-28",
      "headline": "Shefali Jariwala of Kaanta Laga fame dies at 42, cardiac arrest reported cause LIVE UPDATESKaanta Laga and Bigg Boss 13 fame Shefali Jariwala died at 42 due to a cardiac arrest late Friday night. She was rushed to the hospital by her husband, Parag Tyagi, but was declared dead.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-on-how-confronting-mahesh-bhatt-for-saaransh-changed-his-life-2747340-2025-06-27",
      "headline": "Exclusive: Anupam Kher on how confronting Mahesh Bhatt for Saaransh changed his lifeVeteran actor Anupam Kher reflected on a defining moment in his career when he was removed from the film 'Saaransh' just days before shooting, His upcoming film 'Metro... In Dino' highlights similar themes of speaking up and connecting with others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/huma-qureshi-rajkummar-rao-maalik-for-free-cant-take-money-from-friends-2747330-2025-06-27",
      "headline": "Huma Qureshi on doing Rajkummar Rao's Maalik song for free: Can't charge friendsHuma Qureshi has won hearts with her performance in the song 'Dil Thaam Ke' from Rajkummar Rao's film 'Maalik', which she did without charging any fee. She described the experience as a friendly collaboration filled with hard work, fun, and dedication."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/love-marriage-vikram-prabhu-film-pleasant-rom-com-that-never-achieves-its-full-potential-2747315-2025-06-27",
      "headline": "Love Marriage review: Pleasant rom-com that never achieves its full potentialReleased-Fri Jun 27, 2025Love Marriage review: Director Shanmuga Priyan's 'Love Marriage', starring Vikram Prabhu, Sushmitha Bhat and Meenakshi Dinesh, is a Tamil remake of the Telugu film, 'Ashoka Vanamlo Arjuna Kalyanam'. The pleasant romantic comedy is a perfect canvas for a laughter riot but bogged down by redundant ideas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurrana-reacts-to-oscars-academy-invitation-feels-honoured-to-represent-india-2747318-2025-06-27",
      "headline": "Ayushmann Khurrana reacts to Academy invitation, feels honoured to represent IndiaActor Ayushmann Khurrana has been invited to join the Oscars Academy, marking a significant achievement for Indian cinema. The actor reacted to the news and expressed his gratitude. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/india-is-remaking-brooklyn-nine-nine-kunal-kemmu-might-play-jake-peralta-reports-2747282-2025-06-27",
      "headline": "India is remaking Brooklyn Nine Nine, Kunal Kemmu might play Jake Peralta: Reports'Brooklyn Nine Nine' could get an Indian adaptation. The makers have reportedly discussed signing actor Kunal Kemmu to play Andy Samberg's character, Jake Perala. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-traitors-actor-purav-jha-teams-up-with-harsh-gujral-after-elnaaz-norouzis-exit-2747243-2025-06-27",
      "headline": "The Traitors: Actor Purav Jha teams up with Harsh Gujral after Elnaaz Norouzi's exitIn the new episode of 'The Traitors', actor Purav Jha teamed up with his friend Harsh Gujral. Jha appointed Gujral as the traitor after Norouzi was voted out in the circle of shaq."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-expresses-love-and-respect-for-his-love-and-war-colleagues-ranbir-kapoor-and-alia-bhatt-2747264-2025-06-27",
      "headline": "Vicky expresses love and respect for his Love & War colleagues, Ranbir and AliaVicky Kaushal opened up about how he felt working alongside Ranbir Kapoor and Alia Bhatt in 'Love & War'. The actors are once again sharing the silver screen in the Sanjay Leela Bhansali-directorial. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-gushes-over-rumoured-girlfriend-rashmika-mandanna-terrific-mysaa-poster-2747244-2025-06-27",
      "headline": "Vijay Deverakonda gushes over rumoured girlfriend Rashmika's terrific Mysaa posterActor Rashmika Mandanna shared the first look of her upcoming movie 'Mysaa'. She described her look as her fiercest avatar yet. Turns out her rumoured boyfriend, actor Vijay Devarakonda, also thinks that this is her one-of-a-kind portrayal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kpop-demon-hunters-exposes-fear-of-imperfection-2746395-2025-06-27",
      "headline": "How KPop Demon Hunters exposes our fear of imperfectionNetflix's latest anime, 'KPop Demon Hunters', showcases trendy songs and great choreography, but beneath it, is a scathing critique of societal expectations, personal shame, and the exhausting battle to be seen as you are. In this week's K-Fix, we discuss how an American film about the K-pop fandom becomes so much more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-meets-singapore-high-commissioner-simon-wong-politician-shares-pic-2747283-2025-06-27",
      "headline": "Thalapathy Vijay meets Singapore High Commissioner Simon Wong, politician shares picSimon Wong, the High Commissioner of the Republic of Singapore to India, recently met Thalapathy Vijay. Sharing a photo with the Tamil superstar, he posed an intriguing question to his followers.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/exclusive-vivek-agnihotri-on-india-soft-power-10-us-premieres-of-bengal-files-2747274-2025-06-27",
      "headline": "Exclusive: Vivek Agnihotri on India's soft power, 10 US premieres of Bengal FilesFilmmaker Vivek Agnihotri has decided to premiere his film 'The Bengali Files' in 10 US cities in a grand manner. But, what is this promotional strategy all about? He discussed it in an exclusive interview with IndiaToday.in. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-family-man-3-manoj-bajpayee-faces-new-nemesis-jaideep-ahlawat-in-spy-thriller-2747262-2025-06-27",
      "headline": "The Family Man 3: Manoj Bajpayee faces new nemesis, Jaideep Ahlawat in spy-thrillerPrime Video has released the announcement video for 'The Family Man 3', featuring new antagonists Jaideep Ahlawat and Nimrat Kaur. The third season brings intense espionage and higher stakes for Srikant Tiwari and his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/esha-deol-and-ex-bharat-takhtani-make-joint-appearance-at-mumbai-airport-2747230-2025-06-27",
      "headline": "Esha Deol and ex Bharat Takhtani make joint appearance at Mumbai airportEsha Deol and Bharat Takhtani were seen together for the first time since their 2024 divorce, as they boarded a flight in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-ravi-mohan-claim-of-living-in-rented-home-amid-divorce-sparks-backlash-2747205-2025-06-27",
      "headline": "Actor Ravi Mohan's claim of living in rented home amid divorce sparks backlashActor Ravi Mohan recently revealed that he has been living in a rented house since his split with estranged wife Aarti Ravi. His comments sparked backlash from social media users. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-celebrates-one-year-kalk-2898-ad-says-open-to-sequel-if-team-wants-him-2747231-2025-06-27",
      "headline": "Big B marks 1 year of Prabhas's Kalki, says open to sequel if team wants himAmitabh Bachchan shared a heartfelt post to celebrate one year of 'Kalki 2898 AD'. The veteran icon is looking forward to being a part of the sequel if the team ever asks him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-announces-solo-concert-with-singer-choi-ye-na-details-out-2747129-2025-06-27",
      "headline": "BTS' Jin announces solo concert with singer Choi Ye-na. Here's all about itBTS member Jin is launching his highly anticipated solo fan concert tour. The tour is scheduled to begin in South Korea. Here's everything you need to know about the tour."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/we-can-do-whatever-we-want-trump-says-deadline-for-reciprocal-tariffs-not-fixed-glbs-2747399-2025-06-27",
      "headline": "We can do whatever we want: Trump says deadline for reciprocal tariffs not fixedUS President Donald Trump may shift the July tariff deadline, allowing flexibility in trade talks. Officials signal deals could come by Labour Day, easing market concerns over imminent trade disruptions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/tejashwi-yadav-vs-nitish-kumar-what-rjd-leader-said-on-chief-ministerial-hopes-2747396-2025-06-27",
      "headline": "Tejashwi Yadav vs Nitish Kumar? What RJD leader said on chief ministerial hopesRJD leader Tejashwi Yadav said a decision on the chief ministerial face from the Mahagathbandhan (grand alliance) for the upcoming Bihar Assembly polls would be made after a decision by all opposition parties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shefali-jariwala-death-kaanta-laga-actor-cardiac-arrest-2747409-2025-06-28",
      "headline": "Shefali Jariwala of Kaanta Laga fame dies at 42, cardiac arrest reported cause  LIVE UPDATESKaanta Laga and Bigg Boss 13 fame Shefali Jariwala died at 42 due to a cardiac arrest late Friday night. She was rushed to the hospital by her husband, Parag Tyagi, but was declared dead.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-student-spurned-marriage-proposal-locked-inside-college-guard-room-and-gang-raped-later-police-2747135-2025-06-27",
      "headline": "Touched his feet but he didn't let me go: Kolkata law student's rape complaintA 24-year-old student said in her complaint that she was gang-raped inside a Kolkata law college after rejecting a marriage proposal from the main accused. She said the assault was filmed and used to blackmail and threaten her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/amazon-founder-jeff-bezos-ties-knot-with-lauren-sanchez-in-italy-glbs-2747419-2025-06-28",
      "headline": "Amazon founder Jeff Bezos marries  Lauren Sanchez in ItalyJeff Bezos and Lauren Sanchez tied the knot in a lavish Venice wedding with 200 guests, star-studded appearances, and a Dolce & Gabbana gown, marking a glamorous three-day celebration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-halts-trade-talks-with-canada-over-digital-tax-threatens-new-tariffs-glbs-2747405-2025-06-28",
      "headline": "Trump halts trade talks with 'difficult country' Canada, threatens new tariffsUS President Donald Trump announced that the US is ending trade talks with Canada over its digital services tax, calling it an \"egregious\" move and vowing new tariffs within seven days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/usha-vance-says-she-learned-of-husbands-vp-pick-five-minutes-before-public-glbs-2747413-2025-06-28",
      "headline": "Usha Vance says she learned of husband's VP pick 'five minutes' before publicIn an interview with Meghan McCain, Usha Vance said she learned about her husband JD Vance's VP pick just five minutes before it was public, calling it \"a bolt of lightning.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/charade-at-paks-behest-india-rejects-court-of-arbitrations-ruling-on-jk-hydropower-project-2747313-2025-06-27",
      "headline": "Charade at Pak's behest: India on Court of Arbitration 'ruling' on J&K dam projectsIndia said it never recognised the existence in law of the so-called Court of Arbitration and that the body is in itself a violation of the Indus Waters Treaty, which is paused following the Pahalgam terror attack in April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/south-africa-country-junked-nuclear-weapons-helped-non-proliferation-treaty-ben-gurion-nehru-golda-meir-iran-2746849-2025-06-27",
      "headline": "How a country that helped Israel get nuclear weapons junked its own nukesIsrael, the only undeclared nuclear power, started work on its N-weapons programme within years of the founding of the Jewish nation. One of its clandestine partners was apartheid-era South Africa. While Israel is said to be in possession of 90 warheads now, South Africa signed the NPT and junked its nukes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) SystemThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-indias-ultra-rich-families-investing-in-2025-2747127-2025-06-27",
      "headline": "Where are India's ultra-rich families investing in 2025?A new EY–Julius Baer report, The Indian Family Office Playbook, reveals that many family offices are moving away from traditional wealth preservation and diving into global markets, private credit, and real assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-gaza-grind-and-iranian-gambit-will-have-a-cost-for-israel-2747190-2025-06-27",
      "headline": "The Gaza Grind and Iranian Gambit Will Have a Cost for IsraelIsrael's fan club is shrinking in the West. UK and European Parliaments are echoing public disgust with calls for ceasefire and arms embargoes. Enemies are emboldened, allies are wavering. And the Gaza grind is bleeding goodwill. Israel simply needs a new script."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-dies-42-mika-singh-aly-goni-celebs-mourn-2747429-2025-06-28",
      "headline": "Mika Singh, Aly Goni to Paras Chhabra, celebs mourn Shefali Jariwala's deathActor Shefali Jariwala, known for her 'Bigg Boss 13' stint and the hit 'Kaanta Laga', died at the age of 42 following a cardiac arrest. Her untimely death has left the entertainment industry and fans in shock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/want-full-trade-barrier-dropping-trump-on-what-he-wants-from-trade-agreement-with-india-2747377-2025-06-27",
      "headline": "Unthinkable, but...: Trump wants full removal of trade barriers in India dealSpeaking about a trade deal with India, US President Donald Trump said his country was looking to get all the trade barriers removed, which, he said, was \"unthinkable\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/lauren-sanchez-adds-bezos-to-instagram-handle-shares-first-wedding-photo-2747432-2025-06-28",
      "headline": "Lauren Sanchez adds 'Bezos' to Instagram handle, shares first wedding photoLauren Sanchez has officially taken her husband Jeff Bezos' surname, at least on Instagram."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-college-gang-rape-case-three-arrested-including-staff-member-2747081-2025-06-27",
      "headline": "Bite marks on body of student gang-raped in Kolkata law college; 3 arrestedA 24-year-old law student in south Kolkata was allegedly gang-raped inside the college premises. Three accused were arrested in the case, including two students and a staffer - who is a Trinamool Congress student wing leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/fact-check/story/why-is-the-word-parking-striking-terror-in-the-hearts-of-punjab-influencers-2747364-2025-06-27",
      "headline": "Why is the word 'parking' striking terror in the hearts of Punjab's influencers?Following the murder of a popular influencer in Punjab, the word \"parking\" is being used as a death threat for content creators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-5-nation-tour-july-2025-brics-summit-brazil-ghana-argentina-namibia-2747415-2025-06-28",
      "headline": "PM Modi to embark on 5-nation tour in July, attend BRICS summit in BrazilPrime Minister Narendra Modi will undertake a multi-nation tour in July 2025, visiting Ghana, Trinidad & Tobago, Argentina, Brazil, and Namibia to strengthen bilateral ties and attend the BRICS Summit. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/noida/story/videos-noida-society-staff-kick-residents-beat-them-with-sticks-over-power-cut-2747314-2025-06-27",
      "headline": "Videos: Noida society residents complain of power cut, thrashed by security guardsResidents of a Greater Noida West society were thrashed, kicked and beaten with sticks by security guards and maintenance staff following a dispute over a cut in power supply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-supreme-court-curbs-judges-power-to-stop-trump-in-birthright-citizenship-order-2747336-2025-06-27",
      "headline": "US Supreme Court curbs judges' power to stop Trump in birthright citizenship orderThe US Supreme Court, in a 6-3 ruling, granted a request by the Trump administration to narrow the scope of three nationwide injunctions issued by federal judges in three states that halted enforcement of his birthright citizenship plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/two-mizoram-journalists-feature-emmys-winning-bbc-documentary-film-on-myanmar-civil-war-emmy-awards-2747334-2025-06-27",
      "headline": "Two Mizoram journalists part of BBC team that won Emmy for Myanmar docuMizoram journalists HC Vanlalruata and Isaac Zoramsanga were part of the BBC team that won an Emmy Award for a documentary on the civil war in Myanmar. The Mizo journalists provided vital on-ground support for the inputs from Myanmar's Chin state, with visits to a rebel militia headquarters and a village bombed by junta forces. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-says-presidency-is-a-very-dangerous-profession-riskier-than-bull-riding-glbs-2747414-2025-06-28",
      "headline": "Trump says presidency is a very dangerous profession, riskier than bull ridingPresident Trump reflects on past assassination attempts and the dangers of the presidency while celebrating a major Supreme Court victory expanding his executive power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-praggnanandhaa-top-ranked-india-player-uzchess-cup-masters-2747325-2025-06-27",
      "headline": "Praggnanandhaa becomes India's top-ranked player with UzChess Cup Masters winR Praggnanandhaa reached a historic milestone when he became the No. 1-ranked Indian chess player in the live rankings. Praggnanandhaa achieved the feat by winning the UzChess Cup Masters by beating Uzbekistan's Nodirbek Abdusattorov"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-debate-to-drop-socialist-secular-from-preamble-of-indian-constitution-is-needless-noise-2747245-2025-06-27",
      "headline": "Why debate to drop socialist, secular from Preamble is needlessThe terms 'socialist' and 'secular' were added to the Preamble of the Constitution during the Emergency, when a legitimate Opposition was absent from the Parliament. However, a debate on whether to retain or remove the terms is needless."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-aryna-sabalenka-coco-gauff-dance-off-french-open-viral-video-2747397-2025-06-27",
      "headline": "Aryna Sabalenka and Coco Gauff dance-off French Open feud ahead of WimbledonAfter their tense French Open final, Aryna Sabalenka and Coco Gauff were spotted dancing together in a TikTok video at Wimbledon, suggesting the rivalry has softened just in time for the year's third Grand Slam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-priyank-panchal-interview-gujarat-2747391-2025-06-27",
      "headline": "Competitive Jasprit Bumrah had the spark and vibe to represent India: Priyank PanchalFormer Gujarat batter Priyank Panchal, in an exclusive interview, said that Jasprit Bumrah always had the spark and vibe to represent India from his early days. Bumrah played a big role in Gujarat's Ranji Trophy title-winning campaign in 2016-17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-u19-vs-india-u19-vaibhav-suryavanshi-runs-ayush-mhatre-hove-2747375-2025-06-27",
      "headline": "IPL star Vaibhav Suryavanshi smashes 19-balll 48 against England U-19sAt just 14, Vaibhav Suryavanshi showcased his explosive talent once again, smashing a 19-ball 48 to power India U-19 to a dominant win over England, continuing his dream run from the IPL to international youth cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/max-verstappen-mercedes-interest-red-bull-toto-wolff-2747352-2025-06-27",
      "headline": "Max Verstappen to Mercedes? Toto Wolff confirms interest in signing Red Bull starMercedes team principal Toto Wolff has confirmed that they're interested in signing Max Verstappen for next season. Verstappen has been heavily linked with an exit from Red Bull, despite having a contract until 2028. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/lalit-upadhyay-retirement-indian-mens-team-harmanpreet-singh-2747344-2025-06-27",
      "headline": "Lalit Upadhyay says he wanted to retire at peak: Didn't want to drag myselfLalit Upadhyay said that he wanted to retire at the peak of his career and didn't want to drag himself in the sport for long. Upadhyay is a two-time bronze medallist for India at the Olympics and was a vital cog in the team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-revises-two-new-balls-rule-odi-cricket-balance-reverse-swing-2747341-2025-06-27",
      "headline": "ICC revises two-ball rule in ODIs: What's the change and why is it important?The ICC has revised the two-new-balls rule in ODIs to address the imbalance favouring batters. This move aims to bring back reverse swing and enhance bowling impact in the 50-over format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-praggnanandhaa-top-ranked-india-player-uzchess-cup-masters-2747325-2025-06-27",
      "headline": "Praggnanandhaa becomes India's top-ranked player with UzChess Cup Masters winR Praggnanandhaa reached a historic milestone when he became the No. 1-ranked Indian chess player in the live rankings. Praggnanandhaa achieved the feat by winning the UzChess Cup Masters by beating Uzbekistan's Nodirbek Abdusattorov"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-south-africa-dewald-brevis-keshav-maharaj-2747317-2025-06-27",
      "headline": "Dewald Brevis set for debut in Keshav Maharaj-led new-look XIZimbabwe (ZIM) vs South Africa (SA), 1st Test: Keshav Maharaj will lead a new-look XI in the series opener against Zimbabwe. Batting stars Dewald Brevis and Lhuan-dre Pretorius are set to make their debuts on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-bangladesh-3rd-day-colombo-test-report-kamindu-mendis-2747308-2025-06-27",
      "headline": "Sri Lanka close in on series win as Bangladesh collapse under spin pressureSri Lanka's spin dominance and batting grit put them on the verge of an innings victory over Bangladesh in Colombo, with just four wickets separating them from a commanding series sweep at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-warns-fans-fakes-quotes-fact-check-verify-2747171-2025-06-27",
      "headline": "Sunil Gavaskar warns fans on fakes quotes attributed to himSunil Gavaskar has warned fans about websites and individual accounts misusing his name by attributing fake quotes. He implored that the fans always verify and fact-check such information before believing it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-praggnanandhaa-top-ranked-india-player-uzchess-cup-masters-2747325-2025-06-27",
      "headline": "Praggnanandhaa becomes India's top-ranked player with UzChess Cup Masters winR Praggnanandhaa reached a historic milestone when he became the No. 1-ranked Indian chess player in the live rankings. Praggnanandhaa achieved the feat by winning the UzChess Cup Masters by beating Uzbekistan's Nodirbek Abdusattorov"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-south-africa-dewald-brevis-keshav-maharaj-2747317-2025-06-27",
      "headline": "Dewald Brevis set for debut in Keshav Maharaj-led new-look XIZimbabwe (ZIM) vs South Africa (SA), 1st Test: Keshav Maharaj will lead a new-look XI in the series opener against Zimbabwe. Batting stars Dewald Brevis and Lhuan-dre Pretorius are set to make their debuts on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-bangladesh-3rd-day-colombo-test-report-kamindu-mendis-2747308-2025-06-27",
      "headline": "Sri Lanka close in on series win as Bangladesh collapse under spin pressureSri Lanka's spin dominance and batting grit put them on the verge of an innings victory over Bangladesh in Colombo, with just four wickets separating them from a commanding series sweep at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-warns-fans-fakes-quotes-fact-check-verify-2747171-2025-06-27",
      "headline": "Sunil Gavaskar warns fans on fakes quotes attributed to himSunil Gavaskar has warned fans about websites and individual accounts misusing his name by attributing fake quotes. He implored that the fans always verify and fact-check such information before believing it."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}