{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-share-price-jumps-after-q4-results-buy-hold-sell-2716075-2025-04-28",
      "headline": "Should you buy Reliance shares after Q4 results? Check target price, key detailsThe Mukesh Ambani-led conglomerate reported a 2% rise in consolidated net profit to Rs 19,407 crore, beating analysts' expectations of around Rs 18,471 crore. Revenue from operations for the quarter grew 10% year-on-year to Rs 2.64 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-jumps-350-points-nifty-above-24100-ril-gains-2-percent-mahindra-shares-rise-2716061-2025-04-28",
      "headline": "Sensex, Nifty rally driven by Reliance boost and positive Asian market trendsThe S&P BSE Sensex added 558.35 points to 79,770.88, while the NSE Nifty50 gained 155.75 points to 24,195.10as of 9:47 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-open-subscribe-skip-latest-gmp-expert-view-details-important-dates-price-band-allotment-2716060-2025-04-28",
      "headline": "Ather Energy IPO opens for bidding: Should you subscribe? Check latest GMPAther Energy IPO is a book-built issue worth Rs 2,980.76 crore. It includes a fresh issue of 8.18 crore shares aggregating to Rs 2,626.30 crore, and an offer for sale (OFS) of 1.11 crore shares worth Rs 354.76 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-stock-market-opening-april-28-trading-nse-bse-dalal-street-2716040-2025-04-28",
      "headline": "Sensex, Nifty opening: Will stock market rise or fall today?The situation between India and Pakistan remains tense after the recent attack in Kashmir. This tension pulled down both the Sensex and Nifty on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-april-28-ril-idfc-first-bank-mahindra-axis-bank-2716027-2025-04-28",
      "headline": "Stocks to watch on April 28: RIL, IDFC First Bank, Mahindra, Axis BankVarious stocks are likely to see big movements today, April 28, as several companies are set to announce their quarterly earnings and other key updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-lifted-171-million-people-extreme-poverty-2012-to-2022-world-bank-data-2715692-2025-04-27",
      "headline": "India lifted 171 million people from extreme poverty from 2012 to 2022: World BankRural extreme poverty dropped from 18.4 per cent to 2.8 per cent, and urban from 10.7 per cent to 1.1 per cent, narrowing the rural-urban gap from 7.7 to 1.7 percentage points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-simplifies-online-pf-transfers-form-13-job-change-uan-2715484-2025-04-26",
      "headline": "Changing jobs? Check this EPFO update on PF transfersEffective January 2025, the requirement for employer approval in most transfer cases has been eliminated. Previously, PF balance transfers required coordination between source and destination EPFO offices, often causing delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/e-commerce-crops-data-storage-top-india-us-trade-deal-negotiations-report-2715475-2025-04-26",
      "headline": "E-commerce, crops, data storage top India-US trade deal negotiations: ReportDiscussions will now begin on issues such as market access for US farm goods, India's data localisation rules, and the role of big tech in e-commerce—areas that have previously proved politically sensitive in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-airlines-may-face-turbulence-as-pakistan-closes-its-skies-pahalgam-terror-attack-2715193-2025-04-25",
      "headline": "Indian airlines may face turbulence as Pakistan closes its skiesPakistan has announced shutting its airspace to Indian carriers as tensions rise between the two neighbours following a deadly militant attack in Indian Kashmir earlier this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-to-invest-rs-1000-crore-in-tamil-nadu-plant-report-2715130-2025-04-25",
      "headline": "Samsung to invest Rs 1,000 crore in Tamil Nadu plant: ReportSamsung's Tamil Nadu factory currently employs over 2,000 people. In 2022–23, the plant contributed one-fifth of Samsung's Rs 1 lakh crore sales in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-589-points-lower-nifty-sustains-24000-level-adani-ports-ends-4-percent-lower-2715111-2025-04-25",
      "headline": "Sensex, Nifty close lower as rising India-Pakistan tension spooks investorsThe S&P BSE Sensex lost 588.80 points to end at 79,212.53, while the NSE Nifty50 was down 207.35 points to end at 24,039.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kashmir-economy-impact-tourism-sector-slowdown-pahalgam-terror-attack-india-pakistan-tension-2715110-2025-04-25",
      "headline": "Pahalgam terror attack casts big shadow on Kashmir's booming tourism economyKashmir was slowly rebuilding its image as a peaceful tourist destination after years of conflict, especially after the abrogation of Article 370 in August 2019. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/kevin-hart-delhi-show-cancelled-new-schedule-to-be-finalised-soon-2716080-2025-04-28",
      "headline": "Kevin Hart's Delhi show cancelled due to Pahalgam attack, new date to be outComedian Kevin Hart's show in Delhi, scheduled for April 30, has been cancelled. The organisers are in talks with Hart's team for a new schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ground-zero-box-office-collection-day-3-detailed-report-emraan-hashmi-kashmir-based-film-fails-to-pick-pace-2716071-2025-04-28",
      "headline": "Ground Zero box office Day 3: Emraan Hashmi's Kashmir-based film fails to pick pace'Ground Zero' clashed with 'Kesari Chapter 2', 'Jaat' and 'Phule' at the box office, and that eventually suppressed its run. The Emraan Hashmi starrer didn't manage to attract the audience to theatres in its opening weekend. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-greets-staff-at-mumbai-airport-video-goes-viral-2716065-2025-04-28",
      "headline": "Shah Rukh Khan greets long-time staff at Mumbai airport, video goes viralShah Rukh Khan arrived in Mumbai with his manager, Pooja Dadlani. The 'Jawan' actor shook hands with a man who had been his staff for 22 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-wants-to-slap-aurangzeb-shares-solution-to-kashmir-issue-2716059-2025-04-28",
      "headline": "Vijay Deverakonda wants to 'slap Aurangzeb', shares solution to Kashmir issueActor Vijay Deverakonda says he would like to go back in time and slap Aurangzeb. He also thinks that educating the people of Kashmir is a solution to the terrorism problem in the Valley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-chapter-2-box-office-collection-day-10-detailed-report-akshay-kumar-film-shows-terrific-growth-in-2nd-weekend-2716053-2025-04-28",
      "headline": "Kesari 2 box office Day 10: Akshay Kumar's film shows terrific growth in 2nd weekend'Kesari Chapter 2' beat all other new releases during the weekend at the box office. The film collected more than what 'Ground Zero' and 'Jaat' earned. It is now looking at unlocking a new potential at the ticket window. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-nani-casting-mahabharata-2716047-2025-04-28",
      "headline": "SS Rajamouli confirms actor Nani's casting in Mahabharata, his dream projectFilmmaker SS Rajamouli, at the pre-release event of 'HIT 3', stated that Nani will definitely be a part of Mahabharata. For the unaware, Mahabharata is the 'RRR' director's dream project."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/atul-kulkarni-visits-pahalgam-after-terror-attack-this-is-our-kashmir-2716013-2025-04-28",
      "headline": "Actor Atul Kulkarni visits Pahalgam after attack, says 'this is our Kashmir'Actor Atul Kulkarni visits Pahalgam days after the terror attack to send out a message to the world. He urged the people to visit Pahalgam and not to be afraid. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgns-father-asked-me-to-drink-own-urine-to-speed-up-recovery-paresh-rawal-2715944-2025-04-27",
      "headline": "Ajay Devgn's father asked me to drink own urine to speed up recovery: Paresh RawalActor Paresh Rawal shared a surprising remedy he followed for an injury recovery - consuming his own urine. This revelation was made during a conversation with Lallantop, a sister channel of India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-to-make-his-met-gala-debut-in-a-sabyasachi-ensemble-report-2715941-2025-04-27",
      "headline": "Shah Rukh Khan to make his Met Gala debut in a Sabyasachi ensemble: ReportAccording to reports, Bollywood icon Shah Rukh Khan is set to debut at the Met Gala 2025, donning a Sabyasachi creation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tv-actor-navina-bole-accuses-sajid-khan-of-misconduct-says-he-asked-her-to-strip-2715905-2025-04-27",
      "headline": "TV actor Navina Bole accuses Sajid Khan of misconduct, says he asked her to stripTV actor Navina Bole has come forward with allegations against filmmaker Sajid Khan, accusing him of inappropriate behaviour during a meeting. This adds to the growing list of accusations against Khan, who has been previously named in other misconduct cases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/havoc-review-tom-hardy-is-the-only-saving-grace-of-gareth-evans-gore-thriller-2715896-2025-04-27",
      "headline": "Havoc review: Tom Hardy is the only saving grace in Gareth Evans' gore actionerReleased-Fri Apr 25, 2025Netflix's 'Havoc', directed by Gareth Evans, pairs Tom Hardy with a thrilling plot, but ultimately disappoints. Why? Read on and find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fleeing-romania-to-being-an-oscar-nominee-why-sebastian-stan-is-truly-a-star-2713501-2025-04-27",
      "headline": "Fleeing Romania to being an Oscar nominee: Why Sebastian Stan is truly a starActor Sebastian Stan's journey from Romania to ruling the roost in Hollywood is anything but typical. From a childhood under a strict regime to becoming a celebrated actor, Stan's story is one of resilience and talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ground-zero-box-office-collection-day-2-emraan-hashmi-film-collects-rs-3-crorw-2715878-2025-04-27",
      "headline": "Ground Zero box office Day 2: Emraan Hashmi film picks pace, collects Rs 3 croreEmraan Hashmi's military drama 'Ground Zero' is witnessing growth at the box office despite facing competition from other Bollywood films. The film chronicles the story of BSF officer Narendra Nath Dhar Dubey's operation against terrorist mastermind Ghazi Baba."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-diplomat-ott-release-when-where-to-watch-john-abrahams-political-thriller-2715868-2025-04-27",
      "headline": "The Diplomat OTT release: When, where to watch John Abraham's political thriller'The Diplomat', starring John Abraham, is reportedly set to premiere on Netflix on May 9, 2025. The film delves into the intricacies of diplomacy and personal conflicts, inspired by the true story of Indian diplomat JP Singh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sinners-production-designer-hannah-bleacher-reveals-hidden-tribute-to-chadwick-boseman-2715827-2025-04-27",
      "headline": "Sinners production designer reveals hidden tribute to Chadwick BosemanIn a recent interview, 'Sinners' production designer Hannah Bleacher unveiled a subtle tribute to Chadwick Boseman embedded in the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-pahalgam-terror-attack-reaction-kesari-chapter-2-screening-2715836-2025-04-27",
      "headline": "Woh gussa fir se jaaga hai: Akshay Kumar on Pahalgam attack at Kesari 2 screeningAkshay Kumar attended a screening of Kesari Chapter 2 and addressed the audience about the Pahalgam terror attack, expressing anger. He said that the anger Indians had after Jallianwala Bagh incident has been rekindled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-biebers-grandfather-bruce-dale-dies-at-80-singer-wife-hailey-pay-tribute-2715804-2025-04-27",
      "headline": "Justin Bieber's grandfather dies at 80. Singer, wife Hailey pay tributePop icon Justin Bieber mourns the loss of his grandfather, Bruce Dale, who died at 80. The singer shared a loving tribute on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-chapter-2-box-office-collection-day-9-akshay-kumar-r-madhavan-2715785-2025-04-27",
      "headline": "Kesari Chapter 2 box office Day 9: Akshay Kumar film sees jump, earns Rs 57 croreKesari 2, starring Akshay Kumar, R Madhavan, and Ananya Panday, is maintaining a good momentum at the box office. The film has already crossed Rs 50 crore mark and also witnessed a jump in numbers on Day 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/khalid-rahman-ashraf-hamza-arrested-possession-of-hybrid-ganja-2715763-2025-04-27",
      "headline": "Directors Khalid Rahman, Ashraf Hamza arrested for possession of hybrid ganjaDirector Khalid Rahman, who directed the recently-released film 'Alapuzzha Gymkhana' and director Ashraf Hamza, along with one other, were arrested for the possession of hybrid ganja by the Excise department of Kochi."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/united-states-call-india-pakistan-responsible-solution-pahalgam-terror-attack-jammu-kashmir-2716004-2025-04-28",
      "headline": "US urges India, Pak to work towards 'responsible solution' after Pahalgam attackThe US said it stands with India against terrorism after the deadly Pahalgam terror attack and urged India and Pakistan to work towards a responsible resolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aimim-chief-asaduddin-owaisi-warns-pakistan-retaliation-warmongering-its-leaders-2715984-2025-04-28",
      "headline": "You are ISIS's successors: Asaduddin Owaisi to Pak over Pahalgam terror attackThe AIMIM Lok Sabha MP's remarks came after Pakistani Minister Hanif Abbasi openly threatened India with nuclear retaliation in response to India suspending the Indus Waters Treaty after the Pahalgam terrorist attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/robert-vadra-clarifies-muslims-feeling-weakened-remark-on-pahalgam-attack-words-misunderstood-2716055-2025-04-28",
      "headline": "Robert Vadra clarifies 'Muslims feeling weakened' remark on Pahalgam attackRobert Vadra clarified that his comments on Pahalgam attack were 'not fully understood in their complete context' after a row erupted over his 'Muslims feeling weakened' remark."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/black-hawk-army-pilot-risky-visual-separation-move-led-to-deadly-washington-potomac-river-crash-2716039-2025-04-28",
      "headline": "Ignoring instructor, Army pilot's risky move led to deadly Washington crash: ReportCaptain Rebecca Lobach failed to follow her co-pilot and instructor Andrew Eaves's order to turn left in a bid to avoid the descending aircraft, ignoring his instructions just 15 seconds before the crash."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-1/",
      "headline": "A brief history of terrorism in KashmirTo trace the evolution of insurgency and terrorism, we revisit Kashmir's turbulent history from Independence through the violent 1990s, when terror dominated the narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-army-officer-guides-35-40-people-to-safety-jammu-and-kashmir-2715950-2025-04-27",
      "headline": "Took cover in pit, ran for life: How Army officer saved 35-40 lives in PahalgamA software engineer from Karnataka recounted his narrow escape during the deadly Pahalgam terrorist attack that killed 26, crediting the quick thinking of his brother, an Army officer, for saving the lives of 35-40 people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-live-updates-pakistan-opens-fire-along-loc-for-fourth-night-in-a-row-2716044-2025-04-28",
      "headline": "Live: Pakistan opens fire along LoC for fourth night in a rowJammu Kashmir Pahalgam Attack Live Updates: Pakistani troops opened unprovoked fire across the Line of Control (LoC) in Jammu and Kashmir overnight, the Indian Army said on Sunday, marking the fourth consecutive ceasefire violation in recent days. Pakistan initiated unprovoked small arms fire across the LoC in areas opposite Kupwara and Poonch districts. However, the Indian forces responded \"swiftly and effectively\" to the aggression. The renewed hostilities come amid heightened tensions following the brutal terror attack in Pahalgam on April 22, where 25 tourists and a local Kashmiri were gunned down in cold blood in the popular Baisaran valley. The massacre has been described as one of the most horrific attacks in the Kashmir Valley since the abrogation of Article 370."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-wants-to-slap-aurangzeb-shares-solution-to-kashmir-issue-2716059-2025-04-28",
      "headline": "Vijay Deverakonda wants to 'slap Aurangzeb', shares solution to Kashmir issueActor Vijay Deverakonda says he would like to go back in time and slap Aurangzeb. He also thinks that educating the people of Kashmir is a solution to the terrorism problem in the Valley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-votes-today-economic-woes-trump-threats-to-dominate-showdown-2716032-2025-04-28",
      "headline": "Canada votes today: Economic woes, Trump threats to dominate showdownThe snap election, called just weeks after Mark Carney replaced Justin Trudeau as Liberal Party leader and prime minister, comes against a backdrop of economic anxiety, surging costs of living, immigration debates, and an escalating trade conflict with US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-leader-udit-raj-questions-shashi-tharoor-after-slammed-bilawal-bhutto-pahalgam-attack-2715983-2025-04-28",
      "headline": "Is he BJP spokesperson? Congress leader on Shashi Tharoor slamming Bilawal BhuttoCongress leader Udit Raj seemed to be indicating that Shashi Tharoor deviated from the party line over the Pahalgam attack, where it had questioned the security lapses and intelligence failures on the government's part."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/vancouver-festival-attack-toll-reaches-11-murder-charges-filed-against-suspect-glbs-2715998-2025-04-28",
      "headline": "Vancouver festival attack suspect charged with murder as toll rises to 11Murder charges were filed against Kai-Ji Adam Lo after a car ramming attack at a Vancouver festival killed 11 people. Authorities confirmed his history of mental health issues, with more charges expected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/case-bhojpuri-singer-neha-singh-rathore-criticising-government-pahalgam-terrorist-attack-2715976-2025-04-28",
      "headline": "Case against Bhojpuri singer for criticising government over Pahalgam attackThe FIR was filed against Neha after an X handle, run by a Pakistani journalists' group, reposted her video in which she claimed that PM Modi will now be seeking votes in Bihar in the name of the Pahalgam attack victims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-nani-casting-mahabharata-2716047-2025-04-28",
      "headline": "SS Rajamouli confirms actor Nani's casting in Mahabharata, his dream projectFilmmaker SS Rajamouli, at the pre-release event of 'HIT 3', stated that Nani will definitely be a part of Mahabharata. For the unaware, Mahabharata is the 'RRR' director's dream project."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-bandar-abbas-port-death-toll-rise-government-refutes-missile-fuel-mishandling-2716026-2025-04-28",
      "headline": "Iran port blast toll climbs to 40, government refutes missile cargo linkA powerful explosion at Iran's Bandar Abbas port has killed at least 40 people and injured over 1,200. Fires continued to break out as officials blamed poor chemical storage for the blast.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-urges-russia-to-halt-attacks-as-rubio-warns-us-may-exit-ukraine-peace-deal-glbs-2715997-2025-04-28",
      "headline": "Trump sees hope with Ukraine, but top official signals US may exit peace effortTrump criticised Russian President Vladimir Putin, saying there's \"no reason\" for Russia to bomb civilian areas. He also said that Putin may have no intention of reaching a settlement. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/canadian-national-indigo-flight-hoax-bomb-threat-varanasi-2715951-2025-04-27",
      "headline": "Canadian national arrested in Varanasi for hoax bomb threat on IndiGo flightA Canadian national created panic when he suddenly started shouting that there was a bomb inside his bag, as the Bengaluru-bound IndiGo flight was on the runway at Lal Bahadur Shastri International Airport in Varanasi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-krunal-pandya-proves-his-worth-in-stellar-stint-with-rcb-2716057-2025-04-28",
      "headline": "IPL 2025: Underrated Krunal Pandya proves his worth in stellar stint with RCBIPL 2025: While Krunal Pandya flaunted his batting resurgence in RCB's win over Delhi Capitals on Sunday, he has bowled with greater freedom and purpose for his new side. At RCB, the veteran all-rounder is playing with a clear sense of belonging."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/atul-kulkarni-visits-pahalgam-after-terror-attack-this-is-our-kashmir-2716013-2025-04-28",
      "headline": "Actor Atul Kulkarni visits Pahalgam after attack, says 'this is our Kashmir'Actor Atul Kulkarni visits Pahalgam days after the terror attack to send out a message to the world. He urged the people to visit Pahalgam and not to be afraid. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/senthil-balaji-ponmudy-quit-as-tamil-nadu-minister-supreme-court-ultimatum-money-laundering-case-stalin-2715953-2025-04-27",
      "headline": "Senthil Balaji quits as Tamil Nadu Minister days after Supreme Court ultimatumTamil Nadu ministers V Senthil Balaji, who was facing a Supreme Court ultimatum in a money laundering case, and K Ponmudy, who came under fire for controversial religious remarks, resigned from the MK Stalin Cabinet."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/china-supports-pakistans-demand-for-independent-probe-in-pahalgam-attack-2715959-2025-04-27",
      "headline": "China backs Pakistan's 'independent probe' demand on Pahalgam terror attackThe Chinese Foreign Minister, Wang Yi, extended China's resolute support to Pakistan in its demand for an independent investigation over India's allegations about its involvement in the Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-chapter-2-box-office-collection-day-10-detailed-report-akshay-kumar-film-shows-terrific-growth-in-2nd-weekend-2716053-2025-04-28",
      "headline": "Kesari 2 box office Day 10: Akshay Kumar's film shows terrific growth in 2nd weekend'Kesari Chapter 2' beat all other new releases during the weekend at the box office. The film collected more than what 'Ground Zero' and 'Jaat' earned. It is now looking at unlocking a new potential at the ticket window. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-mocks-kl-rahul-my-home-celebration-dc-vs-rcb-watch-video-2715980-2025-04-28",
      "headline": "Watch: Virat Kohli teases KL Rahul, mimics iconic Chinnaswamy celebration in DelhiVirat Kohli brought light-hearted banter to RCB's big win over DC, cheekily mocking KL Rahul's \"my home\" celebration — with the two stars later sharing laughs as RCB continued their record-breaking away run in IPL 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-fire-rohini-jhuggi-cluster-children-die-shanties-gutted-rescue-ops-2715928-2025-04-27",
      "headline": "2 children die after massive fire breaks out at jhuggi cluster in Delhi's RohiniA massive fire engulfed slums in Rohini. Bodies of two children under the age of three were recovered from the spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-champions-second-title-vs-tottenham-hotspur-2715969-2025-04-27",
      "headline": "Liverpool clinch 2nd Premier League title in Arne Slot's first year as coachLiverpool fans erupted at Anfield as Arne Slot's side secured the 2024-25 Premier League title with a commanding 5-1 victory over Tottenham, officially ushering in a new era after Jürgen Klopp's departure."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-krunal-pandya-proves-his-worth-in-stellar-stint-with-rcb-2716057-2025-04-28",
      "headline": "IPL 2025: Underrated Krunal Pandya proves his worth in stellar stint with RCBIPL 2025: While Krunal Pandya flaunted his batting resurgence in RCB's win over Delhi Capitals on Sunday, he has bowled with greater freedom and purpose for his new side. At RCB, the veteran all-rounder is playing with a clear sense of belonging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/conditions-and-toss-just-didnt-play-in-our-favor-kevin-pietersen-after-loss-vs-rcb-2716054-2025-04-28",
      "headline": "Conditions and toss just didn't play in our favour: Kevin Pietersen after loss vs RCBDelhi Capitals (DC) mentor Kevin Pietersen felt that the conditions and the toss didn't favour his team against Royal Challengers Bengaluru (RCB)as they lost the match by six wickets at the Arun Jaitley Stadium in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rcb-director-of-cricket-mo-bobat-on-bowling-performance-dc-vs-rcb-2716045-2025-04-28",
      "headline": "We bowled really well and consistently put pressure on DC batters: RCB DirectorRoyal Challengers Bengaluru (RCB) Director of cricket Mo Bobat praised their all-round bowling performance against Delhi Capitals (DC), which helped them restrict DC to 162. RCB managed to win the match by six wickets and climb to the top of the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-director-mo-bobat-praises-krunal-pandya-dc-vs-rcb-2716033-2025-04-28",
      "headline": "RCB Director praises 'tactical' Krunal Pandya after match-winning show vs DCRoyal Challengers Bengaluru (RCB) Director of cricket Mo Bobat was full of praise for Krunal Pandya following his match-winning all-round performance against Delhi Capitals (DC). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-kevin-pietersen-dc-vs-rcb-ipl-2025-india-2715982-2025-04-28",
      "headline": "T20I comeback for Rahul? Pietersen backs DC star at No. 4 for IndiaIPL 2025, DC v RCB: Delhi Capitals' mentor Kevin Pietersen said that India should consider KL Rahul to bat at No.4 in T20Is. Rahul is currently the top run-getter for DC in the ongoing tournament. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/how-arne-slots-liverpool-won-a-premier-league-race-that-felt-different-2716006-2025-04-28",
      "headline": "How Arne Slot's Liverpool won a Premier League race that felt differentIn a Premier League season shaped by Liverpool's dominance, it was the fierce, unforgiving chase between the chasing pack that truly brought the heartbeat and drama week after relentless week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-anil-kumble-on-krunal-pandya-dc-vs-rcb-2716002-2025-04-28",
      "headline": "Krunal Pandya's judgement of the situation was spot on: Anil KumbleIPL 2025, DC vs RCB: Anil Kumble praised Krunal Pandya for his game awareness after the Royal Challengers Bengaluru beat Delhi Capitals by six wickets on Sunday"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-lsg-zaheer-khan-press-rishabh-pant-captaincy-batting-form-2715966-2025-04-28",
      "headline": "Rishabh Pant fantastic as LSG captain, batting dip not due to price tag: ZaheerIPL 2025, MI vs LSG: Mentor Zaheer Khan praised Rishabh Pant's captaincy, saying the Lucknow Super Giants are not overtly worried about the batting form of their skipper. Pant has managed just 110 runs in nine innings in this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/mi-vs-lsg-ipl-2025-press-conference-zaheer-khan-mayank-yadav-2715981-2025-04-28",
      "headline": "Mayank Yadav will bowl faster as he plays more in IPL 2025: Zaheer KhanIPL 2025: Lucknow Super Giants mentor and former India fast bowler Zaheer Khan on Sunday exuded confidence that express pacer Mayank Yadav's bowling speed will improve as he plays more matches in the IPL. The right-arm tearaway pacer Mayank made his comeback after a long injury lay-off, picking up two wickets against Mumbai Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-mocks-kl-rahul-my-home-celebration-dc-vs-rcb-watch-video-2715980-2025-04-28",
      "headline": "Watch: Virat Kohli teases KL Rahul, mimics iconic Chinnaswamy celebration in DelhiVirat Kohli brought light-hearted banter to RCB's big win over DC, cheekily mocking KL Rahul's \"my home\" celebration — with the two stars later sharing laughs as RCB continued their record-breaking away run in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dc-vs-rcb-ipl-2025-virat-kohli-batting-2715974-2025-04-27",
      "headline": "Kohli flaunts orthodox batting approach: Can't just come out and hitIPL 2025, DC vs RCB: Virat Kohli played a crucial role in Royal Challengers Bengaluru's six-wicket win over Delhi Capitals on Sunday at the Wankhede Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-anil-kumble-on-krunal-pandya-dc-vs-rcb-2716002-2025-04-28",
      "headline": "Krunal Pandya's judgement of the situation was spot on: Anil KumbleIPL 2025, DC vs RCB: Anil Kumble praised Krunal Pandya for his game awareness after the Royal Challengers Bengaluru beat Delhi Capitals by six wickets on Sunday"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-lsg-zaheer-khan-press-rishabh-pant-captaincy-batting-form-2715966-2025-04-28",
      "headline": "Rishabh Pant fantastic as LSG captain, batting dip not due to price tag: ZaheerIPL 2025, MI vs LSG: Mentor Zaheer Khan praised Rishabh Pant's captaincy, saying the Lucknow Super Giants are not overtly worried about the batting form of their skipper. Pant has managed just 110 runs in nine innings in this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/mi-vs-lsg-ipl-2025-press-conference-zaheer-khan-mayank-yadav-2715981-2025-04-28",
      "headline": "Mayank Yadav will bowl faster as he plays more in IPL 2025: Zaheer KhanIPL 2025: Lucknow Super Giants mentor and former India fast bowler Zaheer Khan on Sunday exuded confidence that express pacer Mayank Yadav's bowling speed will improve as he plays more matches in the IPL. The right-arm tearaway pacer Mayank made his comeback after a long injury lay-off, picking up two wickets against Mumbai Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-mocks-kl-rahul-my-home-celebration-dc-vs-rcb-watch-video-2715980-2025-04-28",
      "headline": "Watch: Virat Kohli teases KL Rahul, mimics iconic Chinnaswamy celebration in DelhiVirat Kohli brought light-hearted banter to RCB's big win over DC, cheekily mocking KL Rahul's \"my home\" celebration — with the two stars later sharing laughs as RCB continued their record-breaking away run in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dc-vs-rcb-ipl-2025-virat-kohli-batting-2715974-2025-04-27",
      "headline": "Kohli flaunts orthodox batting approach: Can't just come out and hitIPL 2025, DC vs RCB: Virat Kohli played a crucial role in Royal Challengers Bengaluru's six-wicket win over Delhi Capitals on Sunday at the Wankhede Stadium. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}