{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/walmart-layoffs-hundreds-of-roles-to-streamline-operations-report-2757225-2025-07-17",
      "headline": "Walmart cuts hundreds of roles to streamline operations: ReportEarlier this year, Walmart announced about 1,500 job cuts, which hit teams in its global tech division, online order fulfilment in US stores and its advertising arm, Walmart Connect. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-375-points-lower-nifty-below-25200-infosys-tech-mahindra-down-2-percent-2757205-2025-07-17",
      "headline": "Sensex ends 375 points lower, Nifty below 25,200; Infosys down 2%The S&P BSE Sensex was down by 375.24 points to close at 82,259.24, while the NSE Nifty50 lost 100.60 points to end at 25,111.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-stock-market-rank-number-4-asia-pacific-region-bofa-survey-dalal-street-insights-2757200-2025-07-17",
      "headline": "Dalal Street not Asia's darling anymore, says BofA surveyThe latest survey by Bank of America (BofA), shows that investor interest in Indian stock market has dropped in recent months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-safe-are-indias-instant-loan-apps-2757170-2025-07-17",
      "headline": "How safe are India's instant loan appsFrom students low on fees to families with sudden hospital bills, many use instant loan apps for fast cash, some promise money in 10–30 minutes using just a phone and a few documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-looks-to-extend-tenure-of-derivatives-contracts-says-official-2757179-2025-07-17",
      "headline": "Sebi looks to extend tenure of derivatives contracts, says officialSebi is signalling a shift toward deeper, more stable markets by discouraging speculative short-term trades and pushing for longer-tenure contracts, amid growing retail losses and extreme derivatives dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-thane-outshining-mumbai-real-estate-with-cheaper-housing-2757131-2025-07-17",
      "headline": "Is Thane outshining Mumbai real estate with cheaper housing?Most new homes coming up in Thane are either 1BHK or 2BHK units. About 45% of new supply from 2020 to 2025 was 2BHKs, while 42% was 1BHKs. Larger homes like 3BHKs and 4BHKs together make up only around 13% of the new supply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-loan-rates-2025-how-much-are-sbi-icici-and-others-charging-2757089-2025-07-17",
      "headline": "Personal loan rates 2025: How much are SBI, ICICI and others charging?Many banks in India have updated their personal loan interest rates for 2025. Most banks are offering rates starting from about 9.50% per year and going up to 10.50% for some customers, depending on their credit score and repayment ability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-benching-policy-fear-among-employees-after-first-cycle-outrage-reddit-it-sector-news-report-2757088-2025-07-17",
      "headline": "TCS benching policy sparks fear among employees after first cycle: ReportThe policy, introduced on June 12, limits the time employees can remain without project work to just 35 days. After this, they face the risk of losing out on promotions or even losing their jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-upi-rules-from-july-15-npci-what-happens-if-payments-fail-now-2757044-2025-07-17",
      "headline": "New UPI rules: What happens if payments fail now?Earlier, if someone raised a chargeback, say, when money was deducted, but they did not get what they paid for, and it got declined, the bank had to go through an extra step."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/parliament-panel-proposes-revival-of-key-tax-relief-for-companies-report-2757016-2025-07-17",
      "headline": "Parliament panel proposes revival of key tax relief for companies: ReportThe government is set to restore Section 80M in the new Income Tax Bill, easing dividend tax burdens for companies. The bill is likely to pass in the Monsoon Session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ecommerce-negative-review-not-published-consumer-rights-online-shopping-2757011-2025-07-17",
      "headline": "Are e-commerce firms hiding your rating? New survey reveals the truthThe survey asked consumers about their experience when posting negative reviews on e-commerce and quick commerce apps. Out of 16,519 responses, only 11% said their negative reviews were \"published as is.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-above-25200-sbi-shares-up-1-percent-2756990-2025-07-17",
      "headline": "Sensex opens flat, Nifty above 25,200; SBI shares up 1%The S&P BSE Sensex was down 41.02 points to 82,593.46, while the NSE Nifty50 lost 13.30 points to 25,198.75 as of 9:30 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/smartworks-coworking-spaces-ipo-listing-share-price-strong-market-debut-today-july-17-2756976-2025-07-17",
      "headline": "Smartworks Coworking Spaces to list today. Will it make strong market debut?The company had set a price band of Rs 407 per share for the IPO. The total issue size was Rs 582.56 crore, which included a fresh issue of 1.09 crore shares worth Rs 445 crore and an offer for sale (OFS) of 34 lakh shares valued at Rs 137.56 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/anthem-biosciences-ipo-allotment-status-today-online-guide-listing-details-share-price-bse-kfin-2756970-2025-07-17",
      "headline": "Anthem Biosciences IPO: Allotment status live. GMP, listing details hereInvestors who applied for the Anthem Biosciences IPO can check their allotment status online through two platforms: the BSE website and the website of the IPO registrar, KFin Technologies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-43-points-higher-nifty-above-25200-sbi-gains-2-percent-2756659-2025-07-16",
      "headline": "Sensex closes 64 points higher, Nifty above 25,200; SBI gains 2%The S&P BSE Sensex added 63.57 points to end at 82.634.48, while the NSE Nifty50 gained just 16.25 points to close at 25,212.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gurugram-gurgaon-rain-water-logging-real-estate-price-bubble-review-infra-drainage-2756654-2025-07-16",
      "headline": "Gurugram's luxury flats, flooded streets: Is real estate bubble about to burst?Gurugram's luxury real estate may be booming, but repeated rain-induced flooding is testing its long-term value. If basic infrastructure fails, even the city's glitziest addresses could lose their appeal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-gold-losing-its-shine-here-is-why-fewer-people-are-investing-in-the-yellow-metal-gold-investment-trends-etfs-2756607-2025-07-16",
      "headline": "Is gold losing its shine? Here's why fewer people are investing in the yellow metalEarlier, gold symbolised family pride and social standing, but today's youngsters often see gold jewellery as outdated and instead put their money into things they believe will grow faster than gold ever could."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-upcoming-meeting-august-expectation-simplification-slab-structure-rate-rationalisation-2756556-2025-07-16",
      "headline": "Fewer slabs, simpler rules? Next GST Council meet may trigger overhaulThe upcoming GST Council meeting, likely to be held in August 2025 after the monsoon session of Parliament, could bring key reforms in the way GST is structured and collected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-residential-housing-home-sales-drop-affordability-concerns-proptiger-report-2756552-2025-07-16",
      "headline": "Housing sales slide 14% as affordability pressures mount across cities: ReportThe PropTiger report, which tracks sales and launches across major cities, found that the most significant annual drop was recorded in Mumbai Metropolitan Region (MMR) and Pune, where sales fell by 32% and 27% respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mygate-founder-abhishek-kumar-work-as-guard-why-rs-1600-crore-valuation-iit-iim-graduate-2756521-2025-07-16",
      "headline": "Why this IITian took up a guard's job to build Mygate, valued at Rs 1,600 croreMyGate has raised a total of $83.3 million across eight rounds. Its latest funding was in April 2023, a Series B round worth $3.29 million, putting its valuation at Rs 1,670 crore, according to Tracxn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-model-y-in-india-elon-musk-key-challenges-what-next-for-ev-maker-2756518-2025-07-16",
      "headline": "Tesla is finally in India. But can it go the distance?Tesla's India debut is a big milestone, but long-term success will depend on how well the company adapts to India's unique mix of pricing realities, policy expectations, and market dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-private-school-fees-draining-indian-middle-class-ca-shares-eye-opening-figures-2756494-2025-07-16",
      "headline": "Are private school fees draining India's middle class? CA shares eye-opening figuresWith fees climbing each year, parents are feeling the pinch more than ever. Maybe now is the right moment to pause, think, and ask ourselves, are we getting real value for this cost? Can we secure our kids' future without spending a fortune on fees? asks a Delhi-based CA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ssy-scheme-how-your-daughter-can-get-rs-71-lakh-at-21-sukanya-samriddhi-yojana-government-scheme-2756448-2025-07-16",
      "headline": "SSY scheme: How your daughter can get Rs 71 lakh at 21It is a small savings scheme backed by the government, which offers high interest rates, tax benefits under Section 80C, and tax-free returns on maturity. Over 4.1 crore accounts have been opened so far under this scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdfc-bank-share-holders-good-news-soon-bonus-issue-special-interim-dividend-2756447-2025-07-16",
      "headline": "Good news soon for HDFC Bank shareholders? Here's all you need to knowHDFC Bank shares have delivered a 24% gain over the past year, with a year-to-date rise of nearly 13%. The stock has climbed more than 21% over the last six months, posting gains of 7% over the past three months and 4% in the previous month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ashok-leyland-share-price-bonus-issue-not-down-50-percent-down-2756443-2025-07-16",
      "headline": "Did Ashok Leyland shares fall over 50% today? Details hereThe steep drop is the result of the company's 1:1 bonus issue, which came into effect on Wednesday. When a stock goes \"ex-bonus,\" its price adjusts to reflect the additional shares being issued. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-69-points-lower-nifty-below-25200-hdfc-bank-up-1-percent-2756420-2025-07-16",
      "headline": "Sensex opens 69 points lower, Nifty below 25,200; HDFC Bank up 1%The S&P BSE Sensex was down by 197.64 points to 82,373.27, while the NSE Nifty50 lost 61.80 points to 25,134.00 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/anthem-biosciences-ipo-day-3-last-day-bidding-today-latest-subscription-gmp-listing-allotment-2756419-2025-07-16",
      "headline": "Anthem Biosciences IPO to close for bidding: Check latest subscription, GMPThis IPO is entirely an offer for sale (OFS) of 5.96 crore equity shares by existing shareholders. The company itself will not receive any money from this offer. The price band has been set at Rs 570 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-revamp-pmo-clearance-changes-report-cess-rationalisation-meeting-august-2756402-2025-07-16",
      "headline": "Big GST changes ahead? Centre signals green light, says reportThe Prime Minister's Office (PMO) has given an in-principle nod to a revamp of the GST structure, paving the way for possible reforms in the upcoming GST Council meeting scheduled for August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/theobroma-sold-chryscapital-buyer-two-sisters-how-it-started-mumbai-bakery-cafe-cake-brownie-2756217-2025-07-15",
      "headline": "The Theobroma story: How 2 sisters turned a cafe into 225-store pan-India chainPrivate equity firm ChrysCapital has struck a sweet deal to acquire a 90% stake in Theobroma Foods for Rs 2,410 crore. The bakery chain, started by two sisters in Mumbai, has grown into a 225-store brand loved for its brownies and cakes. Read on to know more about the Mumbai-based bakery chain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mtnl-misses-rs-8585-crore-payments-owes-7-public-sector-banks-2756159-2025-07-15",
      "headline": "MTNL misses Rs 8,585 crore payments, owes 7 public sector banksIn a filing on Tuesday, MTNL confirmed that it has defaulted on both principal and interest payments to a group of lenders, which include some of India's biggest state-owned banks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-317-points-higher-nifty-above-25100-hcltech-down-3-2756116-2025-07-15",
      "headline": "Sensex ends 317 points higher, Nifty above 25,100; HCLTech down 3%The S&P BSE Sensex added 317.45 points to end at 82,570.91, while the NSE Nifty50 was up 113.50 points to close at 25,195.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/should-you-subscribe-anthem-biosciences-ipo-listing-gains-gmp-allotment-date-review-2756093-2025-07-15",
      "headline": "Anthem Biosciences IPO fully booked: Should you subscribe? Check listing gainsThe IPO opened for subscription on July 14, aims to raise Rs 3,395 crore through a complete offer for sale (OFS) of 5.96 crore equity shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-rs-12-crore-did-not-make-this-man-happy-investment-advisor-explains-2756072-2025-07-15",
      "headline": "Why Rs 12 crore didn't make this man happy? Investment advisor explainsWhile money matters, it should never cost you your health, peace of mind, or precious family time. True wealth is living well, not just stacking numbers in a bank account, says an investment advisor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-zerodhas-nithin-kamath-wants-short-selling-made-easy-in-india-2756030-2025-07-15",
      "headline": "Why Zerodha's Nithin Kamath wants short selling made easy in IndiaIf someone wants to short a stock today, they mostly do it through futures or options. But there's a catch, there are only 224 stocks in India that have futures and options. So if a bad company is not on that list, no one can short it easily."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/theobroma-stake-sale-90-percent-chryscapital-accquisition-kainaz-messman-harchandrai-tina-messman-wykes-report-2755967-2025-07-15",
      "headline": "Theobroma to be sold, Rs 2,410-crore sweet deal baked by ChrysCapital: ReportFounded in 2004 by sisters Kainaz Messman Harchandrai and Tina Messman Wykes, Theobroma began with a single outlet at Cusrow Baug on Mumbai's Colaba Causeway. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claiming-fake-itr-refunds-here-is-what-could-happen-2755957-2025-07-15",
      "headline": "Claiming fake ITR refunds? Here's what could happenTo give honest taxpayers a chance to fix their mistakes, the department had earlier asked people to revise their returns if they had claimed any wrong deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-2-or-itr-3-check-these-common-mistakes-and-tips-to-avoid-them-2755920-2025-07-15",
      "headline": "Filing ITR-2 or ITR-3? Check these common mistakes and tips to avoid themUsing the Excel utility for ITR-2 or ITR-3 seems easy, but it's easy to get stuck if you're not careful. One wrong entry can throw your entire tax calculation off. Here's a handy guide to avoid common slip-ups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hcltech-share-price-it-stock-q1-results-down-4-percent-why-reason-guidance-2755904-2025-07-15",
      "headline": "Explained: Why HCLTech shares are down 4% todayOver the past few days, HCLTech has been under pressure. The stock has declined 7.9% in the last five trading sessions, 9.58% in the past month, and over 14.6% in the past six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-mumbai-showroom-opening-today-electric-cars-model-y-ev-suv-cost-in-india-rs-60-lakh-2755893-2025-07-15",
      "headline": "Tesla showroom now in Mumbai. Price list of Model Y EVs in India revealed Live UpdatesThe Mumbai showroom will serve as Tesla's main display and customer experience centre, offering visitors a chance to view the vehicles up close and understand Tesla's technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-119-points-higher-nifty-above-25100-tata-motors-up-1-percent-2755865-2025-07-15",
      "headline": "Sensex opens 119 points higher, Nifty above 25,100; Tata Motors up 1%The S&P BSE Sensex was up 176.33 points to 82,429.79, while the NSE Nifty50 gained 63.50 points to 25,145.80 as of 9:29 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/munawar-faruqui-learnt-timeliness-from-kangana-ranaut-being-late-from-salman-khan-2757385-2025-07-17",
      "headline": "Munawar Faruqui learnt timeliness from Kangana Ranaut, being late from Salman KhanDuring a press conference on Thursday, actor-comedian Munawar Faruqui spoke about his upcoming reality show 'The Society'. He also shared what he learned from actors Kangana Ranaut and Salman Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalaivan-thalaivii-trailer-romance-meets-chaos-in-vijay-sethupathi-nithya-menen-2757369-2025-07-17",
      "headline": "Thalaivan Thalaivii trailer: Romance meets chaos in Vijay Sethupathi, Nithya's filmThe trailer for 'Thalaivan Thalaivii' featuring Vijay Sethupathi and Nithya Menen has been released, showcasing a unique love story. Anticipation builds as the film is set to release on July 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-martin-exposes-office-romance-at-coldplay-us-concert-leaves-couple-mortified-2757356-2025-07-17",
      "headline": "Chris Martin exposes office romance at Coldplay concert, leaves couple mortifiedColdplay's frontman Chris Martin unintentionally exposed a couple's affair during a concert in Boston, leading to a viral moment filled with humour and audience laughter. This incident happened amid the band's record-breaking Music of the Spheres World Tour, which continues to draw huge crowds across the US and beyond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ramayana-namit-malhotra-hans-zimmer-beyond-time-ranbir-kapoor-sai-pallavi-diwali-2026-2757245-2025-07-17",
      "headline": "Namit Malhotra says Hans Zimmer called Ramayana beyond time and human imagination'Ramayana' producer Namit Malhotra recently opened up on his discussion with Oscar-winning composer Hans Zimmer. He praised Zimmer for his understanding of the ancient Indian epic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ajay-devgn-and-son-of-sardaar-2-cast-bring-sarcasm-to-the-great-indian-kapil-sharma-show-netflix-2757318-2025-07-17",
      "headline": "Ajay Devgn and Son of Sardaar 2 cast bring sarcasm to Kapil Sharma's showActors Ajay Devgn, Mrunal Thakur, and Ravi Kishan will feature in the upcoming episode of 'The Great Indian Kapil Sharma Show' season 3. The promo shows Devgn playfully roasting the host and Navjot Singh Sidhu. The episode will air on July 19 on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-kiara-advani-request-no-photos-only-blessings-for-baby-girl-gift-sweets-to-media-2757349-2025-07-17",
      "headline": "Sidharth-Kiara request no photos, only blessings for baby girl, gift sweets to mediaSidharth Malhotra and Kiara Advani requested the paparazzi to respect their privacy and avoid clicking their newborn daughter. The couple welcomed a baby girl earlier this week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vijay-deverakonda-hospitalised-with-dengue-ahead-of-kingdom-release-on-july-31-2757338-2025-07-17",
      "headline": "Vijay Deverakonda hospitalised with dengue ahead of Kingdom release on July 31Actor Vijay Deverakonda has been hospitalised after being diagnosed with dengue. The actor, whose film 'Kingdom' is scheduled for release on July 31, is expected to be discharged in a couple of days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-netflix-this-weekend-july-13-20-vir-das-sakamoto-days-entitled-2757345-2025-07-17",
      "headline": "Top films and shows to watch on Netflix this weekendNetflix's new weekend lineup caters to all tastes, featuring a mix of documentaries, anime, dramas, and comedy shows. From thought-provoking political documentaries to thrilling action and heartfelt stories, there is something engaging for every viewer in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/asia-review-a-breathtaking-love-letter-to-the-wild-heart-of-the-continent-2757334-2025-07-17",
      "headline": "ASIA review: A breathtaking love letter to the wild heart of the continentRelease Date:Thu Jul 17, 2025Filmed over four years across the continent's most extreme terrains, 'Asia' is a beautiful wildlife series. With narration by Sir David Attenborough and music by SEVENTEEN, the BBC series is both visually stunning and emotionally resonant, taking you from the Himalayan red panda to highway-raiding elephants in Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ajay-devgn-guru-randhawa-the-po-po-song-son-of-sardaar-2-2757169-2025-07-17",
      "headline": "The Po Po Song: Ajay Devgn, Guru Randhawa bring back nostalgia in Son of Sardaar 2The makers of the much-awaited film 'Son of Sardaar 2' released 'The Po Po Song' on Thursday. For the song, actor Ajay Devgn collaborated with singer Guru Randhawa for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-series-to-watch-on-prime-video-this-week-kuberaa-summer-i-turned-pretty-2757206-2025-07-17",
      "headline": "Top films and shows to watch on Prime Video this weekendA host of new films and shows will be available for streaming this weekend on Prime Video. These include Dhanush's 'Kuberaa', season 3 of Lola Tung's 'The Summer I Turned Pretty' and Judy Sheindlin's 'Justice on Trial'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/german-film-brick-might-be-the-most-thrilling-thing-to-watch-on-netflix-ott-this-weekend-2757265-2025-07-17",
      "headline": "German film Brick might be the most thrilling thing to watch on OTT this weekendThe German thriller 'Brick' is trending at number 2 on Netflix's list of top movies in India. The film features actors Matthias Schweighofer and Ruby O. Fee in the lead roles. It is psychological and dystopian, but is it worth a watch? Let's find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-s3-belly-jeremiah-conrad-taylor-2757194-2025-07-17",
      "headline": "The Summer I Turned Pretty? More like the summer my best friend backstabbed meWhen your best friend starts acting more like a life coach and less like a friend, it's time to take a step back. Here's how 'The Summer I Turned Pretty' is showing us signs that your friend might not always know what's best for you."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ibrahim-ali-khan-shares-intense-prep-glimpses-for-sarzameen-ahead-of-release-2757130-2025-07-17",
      "headline": "Ibrahim Ali Khan offers a glimpse into his intense training for SarzameenIbrahim Ali Khan will be seen in an intense role in 'Sarzameen', where he plays the son of Prithviraj and Kajol who turns into a terrorist. Before the film's release on July 25 on JioHotstar, he shared behind-the-scenes photos and training glimpses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pretty-little-baby-singer-connie-francis-dies-at-87-2757256-2025-07-17",
      "headline": "Pretty Little Baby singer Connie Francis dies at 87Legendary 1960s pop singer Connie Francis, known for hits like the viral 'Pretty Little Baby', died at the age of 87. She was the first solo female artiste to top the Billboard Hot 100."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/janaki-v-vs-state-of-kerala-review-well-crafted-story-but-an-execution-fail-suresh-gopi-2757222-2025-07-17",
      "headline": "Janaki V vs State of Kerala review: Noble intentions marred by flawed executionRelease Date:Thu Jul 17, 2025Janaki V vs State of Kerala movie review: Written and directed by Pravin Narayanan, the Malayalam suspense drama film stars Suresh Gopi and Anupama Parameshwaran in the lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-kundrra-shuts-down-wedding-rumours-with-tejasswi-prakash-2757161-2025-07-17",
      "headline": "Karan Kundrra shuts down wedding rumours with Tejasswi Prakash, says not married yetActor Karan Kundrra clarified that he and Tejasswi Prakash are not married yet, dismissing ongoing rumours. He expressed his love for rituals and shared how Tejasswi has influenced his spiritual side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-aneet-padda-poetic-tribute-mohit-suri-heartfelt-post-musical-vision-2757135-2025-07-17",
      "headline": "Saiyaara actor Aneet Padda pays poetic tribute to Mohit Suri's musical vision'Saiyaara' actor Aneet Padda shared a heartfelt note dedicated to director Mohit Suri. She highlighted his unique vision and emotional depth in music and storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-rana-daggubati-cheeky-banter-on-why-kattappa-killed-baahubali-wins-the-internet-2757213-2025-07-17",
      "headline": "Prabhas, Rana's cheeky banter on 'Why Kattappa killed Baahubali' wins the internet'Baahubali' is all set for a grand re-release this October, rekindling the iconic question about Katappa's betrayal with hilarious replies from stars Prabhas and Rana Daggubati. The friendly banter received fans' appreciation on social media. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-designates-pakistani-groups-offshoot-as-foreign-terrorist-organization-over-pahalgam-terror-attack-glbs-2757466-2025-07-18",
      "headline": "US declares Lashkar offshoot behind Pahalgam attack as terrorist organisationTRF and its associated aliases have now been officially added to Lashkar-e-Taiba's designation as both FTO and SDGT, under Section 219 of the Immigration and Nationality Act and Executive Order 13224, respectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/unverified-reporting-probe-agency-calls-out-us-media-report-on-pilots-role-in-air-india-crash-2757337-2025-07-17",
      "headline": "Unverified: Probe body rejects US media report on 'pilot's role' in Air India crashThe AAIB slammed The Wall Street Journal over its report highlighting a pilot's role in the Air India Flight 171 crash on June 12 in Ahmedabad, calling it unverified and saying it was too early to come to conclusions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-not-visiting-pakistan-at-this-time-tv-channels-withdraw-false-reports-glbs-2757451-2025-07-18",
      "headline": "Trump not visiting Pakistan 'at this time': TV channels withdraw false reportsThe White House and Pakistan's Foreign Office denied any such plans, calling the reports unverified. Trump is instead scheduled to visit the UK in September."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kunal-kamras-satirical-dig-at-maharashtra-assembly-brawl-hum-honge-kamyaab-2757433-2025-07-17",
      "headline": "Hum honge kamyaab: Kunal Kamra's satirical dig at Maharashtra Assembly brawlIn a satirical video set to his offbeat rendition of Hum Honge Kamyaab, Kunal Kamra stitched together dramatic clips of the brawl between BJP and NCP (Sharad Pawar faction) supporters - then slipped in shots of Chief Minister Devendra Fadnavis and Deputy Chief Minister Eknath Shinde, making his dig at the Mahayuti alliance unmistakably clear."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/the-brutal-legacy-of-akbar-chittorgarh-siege-referenced-by-ncert-the-lowdown-2757339-2025-07-17",
      "headline": "The brutal legacy of Akbar's Chittorgarh siege referenced by NCERTNCERT's new Class 8 textbook revisits the 1567-68 Chittorgarh siege, portraying Akbar's reign as brutal. What unfolded during the Chittorgarh siege, the stronghold of the Sisodia Rajputs?  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/energy-first-india-rejects-nato-chief-mark-rutte-100-percent-sanctions-threat-over-russia-oil-trade-2757340-2025-07-17",
      "headline": "Energy first: India rejects Nato chief's sanctions threat over Russia oil tradeDismissing NATO chief Mark Rutte's threat of '100% secondary sanctions' on countries trading with Russia, India said that its domestic needs depend on the current market scenario and geopolitical conditions, and warned the West against adopting any 'double standards.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/foreign-nationals-in-voter-list-inside-bihars-suspicious-enumeration-drive-2757226-2025-07-17",
      "headline": "Foreign nationals in voter list? Inside Bihar's suspicious revision driveThey came with Aadhaar, ration cards, and years of life in India. But in Bihar's border districts, silence now greets their names on voter forms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/can-india-sustain-its-50-non-fossil-fuel-milestone-amid-rising-energy-demands-2757173-2025-07-17",
      "headline": "Can India sustain its 50% non-fossil fuel milestone amid rising energy demands?Energy consumption is projected to surge by up to 2.5 times by 2047, driven by industrialisation, urbanisation and rising living standards\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/santhosh-kumar-footloosers-feature-back-in-limelight-through-malayalam-film-footloosers-2755605-2025-07-14",
      "headline": "Meet The Footloosers: 'Moonwalk' movie shines spotlight on Kerala's breakdance brosMoonwalk, a new Malayalam film inspired by real-life breakdancers in Thiruvananthapuram, revisits Kerala's 1980s street dance culture. The film traces the journey of the Footloosers troupe and its founder Babu Master, celebrating their resilience, influence, and enduring passion for dance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-impact-feature/story/trumps-health-in-spotlight-chronic-venous-insufficiency-diagnosis-explained-glbs-2757464-2025-07-18",
      "headline": "Trump's health in spotlight: Chronic venous insufficiency diagnosis explainedUS President Donald Trump has been diagnosed with chronic venous insufficiency, a common vein condition causing leg swelling. His doctor reports no serious health concerns, and treatment can effectively manage symptoms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ed-raids-foreign-currency-rs-500-crore-funds-chhangur-baba-conversion-case-2757446-2025-07-18",
      "headline": "Chhangur Baba case: ED finds Croatian currency photo on associate's phoneThe Enforcement Directorate uncovers potential international links in Chhangur Baba's conversion racket, with discoveries pointing to the use of foreign currency in operations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bmw-driver-under-influence-alcohol-fatal-scooter-accident-gandhinagar-gujarat-news-2757308-2025-07-17",
      "headline": "Video: Drunk BMW driver rams scooter in Gujarat, man thrown on bonnet, diesThe entire sequence of events was captured on nearby CCTV cameras. The footage clearly shows the moment the black BMW collided with the scooter at the intersection. According to eyewitnesses, the car, driven by a man reportedly under the influence of alcohol, struck the scooter at an intersection on Thursday morning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-impact-feature/story/us-house-passes-crypto-bill-on-stablecoins-sends-it-to-trump-for-final-approval-glbs-2757472-2025-07-18",
      "headline": "US House passes crypto bill on stablecoins, sends it to Trump for final approvalThe US House of Representatives passed the GENIUS Act to regulate stablecoins, sending it to President Trump. The bill marks a major crypto milestone, backed by bipartisan support and industry lobbying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-missile-test-prithvi-agni-ballistic-missile-odisha-rajnath-singh-2757432-2025-07-17",
      "headline": "India test-fires Prithvi-II and Agni-I ballistic missiles off Odisha coastIndia successfully test-fired Prithvi-II, Agni-I missiles, validating key operational parameters. The tests mark a boost to India's nuclear and air defence capabilities.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-flight-171-fuel-switch-off-mystery-all-expert-theories-ahmedabad-crash-2757325-2025-07-17",
      "headline": "AI 171 fuel switch-off mystery: All expert theories we have heard so farExperts are debating how Air India Flight 171's fuel control switch turned to CUT OFF mid-air, with theories pointing to human error, technical malfunction, or design flaw. The final cause remains uncertain as investigations continue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/your-beauty-essentials-are-the-most-trending-accessories-now-2757188-2025-07-17",
      "headline": "Your beauty essentials are the most trending accessories nowIn 2025, beauty is no longer tucked away in makeup pouches - it's worn proudly on waist chains, handbags and phone covers, turning everyday essentials like lip balm and sunscreen into statement accessories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/better-sex-could-be-a-g-shot-or-o-shot-away-2757167-2025-07-17",
      "headline": "Better sex could be a G-Shot or O-Shot awayWhy India is witnessing a rising preference for these minimally invasive interventions to women's sexual wellness\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-imposes-massive-935-tariff-on-chinese-graphite-used-in-evs-glbs-2757473-2025-07-18",
      "headline": "US imposes massive 93.5% tariff on Chinese graphite used in EVsThe affected graphite is defined as having a carbon purity of at least 90% by weight. It can be natural, synthetic, or a blend of both. These materials are used specifically in battery anodes, the part of a battery that stores and releases energy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/democratic-newsroom/video/ncert-row-objective-revision-or-hijacking-history-democratic-newsroom-debates-2757362-2025-07-17",
      "headline": "NCERT row: Objective revision or hijacking history? Democratic Newsroom debatesIn this edition of Democratic Newsroom, the focus is on the debate over NCERT's portrayal of Mughal rulers such as Akbar, Babur, and Aurangzeb."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/asia-review-a-breathtaking-love-letter-to-the-wild-heart-of-the-continent-2757334-2025-07-17",
      "headline": "ASIA review: A breathtaking love letter to the wild heart of the continentRelease Date:Thu Jul 17, 2025Filmed over four years across the continent's most extreme terrains, 'Asia' is a beautiful wildlife series. With narration by Sir David Attenborough and music by SEVENTEEN, the BBC series is both visually stunning and emotionally resonant, taking you from the Himalayan red panda to highway-raiding elephants in Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-bloc-online-meeting-saturday-plan-monsoon-session-strategy-bihar-elections-operation-sindoor-2757463-2025-07-18",
      "headline": "INDIA bloc shifts strategy meet online, Trinamool leaders to join, AAP uncertainThe meeting will aim to forge a united opposition strategy for the monsoon session, with a key focus on the Bihar's Special Investigation Report and Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-cities-shine-in-swachh-survekshan-2024-25-rankings-lucknow-ranks-third-cleanest-city-2757471-2025-07-18",
      "headline": "UP cities shine in Swachh Survekshan rankings; Lucknow ranks third cleanest cityLucknow made history by becoming the first city in Uttar Pradesh to earn a 7-star Garbage Free City (GFC) rating. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/janaki-v-vs-state-of-kerala-review-well-crafted-story-but-an-execution-fail-suresh-gopi-2757222-2025-07-17",
      "headline": "Janaki V vs State of Kerala review: Noble intentions marred by flawed executionRelease Date:Thu Jul 17, 2025Janaki V vs State of Kerala movie review: Written and directed by Pravin Narayanan, the Malayalam suspense drama film stars Suresh Gopi and Anupama Parameshwaran in the lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalaivan-thalaivii-trailer-romance-meets-chaos-in-vijay-sethupathi-nithya-menen-2757369-2025-07-17",
      "headline": "Thalaivan Thalaivii trailer: Romance meets chaos in Vijay Sethupathi, Nithya's filmThe trailer for 'Thalaivan Thalaivii' featuring Vijay Sethupathi and Nithya Menen has been released, showcasing a unique love story. Anticipation builds as the film is set to release on July 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ramayana-namit-malhotra-hans-zimmer-beyond-time-ranbir-kapoor-sai-pallavi-diwali-2026-2757245-2025-07-17",
      "headline": "Namit Malhotra says Hans Zimmer called Ramayana beyond time and human imagination'Ramayana' producer Namit Malhotra recently opened up on his discussion with Oscar-winning composer Hans Zimmer. He praised Zimmer for his understanding of the ancient Indian epic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-kiara-advani-request-no-photos-only-blessings-for-baby-girl-gift-sweets-to-media-2757349-2025-07-17",
      "headline": "Sidharth-Kiara request no photos, only blessings for baby girl, gift sweets to mediaSidharth Malhotra and Kiara Advani requested the paparazzi to respect their privacy and avoid clicking their newborn daughter. The couple welcomed a baby girl earlier this week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vijay-deverakonda-hospitalised-with-dengue-ahead-of-kingdom-release-on-july-31-2757338-2025-07-17",
      "headline": "Vijay Deverakonda hospitalised with dengue ahead of Kingdom release on July 31Actor Vijay Deverakonda has been hospitalised after being diagnosed with dengue. The actor, whose film 'Kingdom' is scheduled for release on July 31, is expected to be discharged in a couple of days. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/durand-cup-2025-isl-teams-halved-manipur-kolkata-co-host-prize-money-2757427-2025-07-17",
      "headline": "Durand Cup 2025: ISL presence halved, Manipur joins as new co-hostThe 2025 Durand Cup sees a sharp drop in ISL participation as just six top-tier teams sign up. Manipur debuts as a host amid uncertainty surrounding the AIFF-FSDL standoff and ISL's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-ryan-ten-doeschate-points-out-major-concern-for-india-before-4th-test-2757402-2025-07-17",
      "headline": "Ten Doeschate points out major concern for India before 4th TestENG vs IND, 4th Test: Speaking to the reporters before the Manchester Test, India assistant coach Ryan ten Doeschate said that losing wickets in clusters haven't helped India in the ongoing Test series against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-transfer-news-hugo-ekitike-alexander-isak-newcastle-united-2757390-2025-07-17",
      "headline": "Liverpool agree personal terms with Ekitike, wait on Isak stance: ReportsPremier League: Liverpool have shifted focus to Hugo Ekitike after Newcastle refused to part with Alexander Isak. With a verbal agreement in place, the Reds are pushing to seal a £70m+ deal before the transfer window closes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/is-max-verstappen-going-to-mercedes-2757383-2025-07-17",
      "headline": "Max Verstappen to Mercedes? Meeting with Toto Wolff fuels Red Bull exit rumoursRumours of Max Verstappen's exit from Red Bull are gaining traction after reports of a secret meeting with Mercedes boss Toto Wolff. This move could potentially shock the F1 world.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-ben-stokes-workload-2757366-2025-07-17",
      "headline": "Bumrah vs Stokes: Ten Doeschate shuts down workload comparison talksENG vs IND: India assistant coach Ryan ten Doeschate addressed the discussion around the workloads of England captain Ben Stokes and Indian pacer Jasprit Bumrah following the Lord's Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-vs-adam-gilchrist-test-record-india-vs-england-2757359-2025-07-17",
      "headline": "Can Rishabh Pant be the next Adam Gilchrist of Indian cricket?Rishabh Pant's cricketing journey draws comparisons with legend Adam Gilchrist. Can Rishabh Pant go beyond what Gilchrist achieved in Test cricket?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-gautam-gambhir-ajit-agarkar-workload-management-2757357-2025-07-17",
      "headline": "Gambhir-Agarkar slammed for Bumrah's workload management: Play all matchesDilip Vengsarkar is not a fan of the current workload management policies, which allows Jasprit Bumrah to pick and choose the games he participates.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-availability-wicketkeeping-manchester-test-ten-doeschate-2757350-2025-07-17",
      "headline": "Rishabh Pant unlikely to keep wickets in Manchester Test: Ryan ten DoeschateENG vs IND: Rishabh Pant is on his road to recovery, but his availability for batting and keeping duties are yet to be cleared. India will bank on his availability, considering the series now hangs in the balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-ryan-ten-doeschate-manchester-test-2757336-2025-07-17",
      "headline": "Jasprit Bumrah to play 4th Test? India to take a call in ManchesterENG vs IND: India assistant coach Ryan ten Doeschate said that the team will take a call on Jasprit Bumrah's participation in the fourth Test after reaching Manchester. India are trailing the five-match series 1-2 after losing the Lord's Test by 22 runs. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-engand-arshdeep-singh-injury-hand-bandage-manchester-test-2757329-2025-07-17",
      "headline": "Arshdeep Singh injured? India pacer arrives Manchester training with bandageAs India prepare to fight back in the Manchester Test, a fresh injury scare around Arshdeep Singh's bandaged arm could complicate their pace strategy amid growing uncertainty around Jasprit Bumrah's availability."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-camerongreen-australia-no3-2757257-2025-07-17",
      "headline": "Ponting backs Cameron Green's resilience at No 3 despite early strugglesCameron Green may have had a shaky start at No.3 but has the support of legendary Ricky Ponting. Ponting has argued that Green has shown continued improvement at the position and should be backed for the Ashes in November 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-gautam-gambhir-ajit-agarkar-workload-management-2757357-2025-07-17",
      "headline": "Gambhir-Agarkar slammed for Bumrah's workload management: Play all matchesDilip Vengsarkar is not a fan of the current workload management policies, which allows Jasprit Bumrah to pick and choose the games he participates.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-availability-wicketkeeping-manchester-test-ten-doeschate-2757350-2025-07-17",
      "headline": "Rishabh Pant unlikely to keep wickets in Manchester Test: Ryan ten DoeschateENG vs IND: Rishabh Pant is on his road to recovery, but his availability for batting and keeping duties are yet to be cleared. India will bank on his availability, considering the series now hangs in the balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-ryan-ten-doeschate-manchester-test-2757336-2025-07-17",
      "headline": "Jasprit Bumrah to play 4th Test? India to take a call in ManchesterENG vs IND: India assistant coach Ryan ten Doeschate said that the team will take a call on Jasprit Bumrah's participation in the fourth Test after reaching Manchester. India are trailing the five-match series 1-2 after losing the Lord's Test by 22 runs. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-engand-arshdeep-singh-injury-hand-bandage-manchester-test-2757329-2025-07-17",
      "headline": "Arshdeep Singh injured? India pacer arrives Manchester training with bandageAs India prepare to fight back in the Manchester Test, a fresh injury scare around Arshdeep Singh's bandaged arm could complicate their pace strategy amid growing uncertainty around Jasprit Bumrah's availability."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-camerongreen-australia-no3-2757257-2025-07-17",
      "headline": "Ponting backs Cameron Green's resilience at No 3 despite early strugglesCameron Green may have had a shaky start at No.3 but has the support of legendary Ricky Ponting. Ponting has argued that Green has shown continued improvement at the position and should be backed for the Ashes in November 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswals-poor-shot-opened-up-the-lords-test-stuart-broad-2757316-2025-07-17",
      "headline": "Yashasvi Jaiswal's poor shot opened up the Lord's Test: Stuart BroadFormer England fast bowler Stuart Broad feels India opener Yashasvi Jaiswal's poor shot on Day 4 of the third Test at Lord's opened up the game which eventually led to India's loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/litton-das-bangladesh-vs-pakistan-t20i-series-2757302-2025-07-17",
      "headline": "Won't be easy: Litton Das eyes Pakistan heist after Sri Lanka T20I winBAN vs PAK: Litton Das said Bangladesh will need to work hard in their upcoming T20I series against Pakistan. His comments came after leading the Tigers to their maiden T20I series victory over Sri Lanka on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shimron-hetmyer-hits-5-sixes-in-an-over-vs-fabian-allen-in-global-super-league-2757283-2025-07-17",
      "headline": "Shimron Hetmyer goes berserk, blasts 5 Sixes in an over in Global Super LeagueGuyana Amazon Warriors batter Shimron Hetmyer hit five sixes in an over against Guyana Amazon Warriors' Fabian Allen in the Global Super League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-squad-pakistan-t20i-series-litton-das-2757277-2025-07-17",
      "headline": "Bangladesh name squad for home T20Is against PakistanBAN vs PAK: After their series win against Sri Lanka, Litton Das' Bangladesh are set to lock horns with Pakistan, starting July 20 at the Sher-e-Bangla National Stadium in Mirpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-chennaiyin-fc-part-ways-owen-coyle-indian-super-league-2757276-2025-07-17",
      "headline": "Indian Super League: Chennaiyin FC, Owen Coyle part ways by mutual consentChennaiyin FC announced that they have decided to mutually part ways with Owen Coyle, who came into the club for his second stint. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ravi-shastri-on-englands-wtc-points-deduction-2757241-2025-07-17",
      "headline": "Ravi Shastri warns England after Lord's Test win: It may hurt like AustraliaFormer India cricketer and head coach Ravi Shastri has warned England of facing Australia's fate after the WTC points deduction following their 22-run win at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-deep-dasgupta-karun-nair-vs-sai-sudharsan-2757234-2025-07-17",
      "headline": "Deep Dasgupta wants Sai Sudarshan over Karun Nair after Lord's failureIndia vs England: Former India wicketkeeper Deep Dasgupta believes it's time to look beyond Karun Nair after his failure in 3 Tests against England. Dasgupta wants to back promising youngster Sai Sudharsan, who was discarded after the opening Test match at Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-pratika-rawal-england-vs-india-womens-odi-record-2757224-2025-07-17",
      "headline": "Mandhana, Pratika set partnership world record in 1st Women's ODIENG-W vs IND-W: Smriti Mandhana and Pratika Rawal reached a partnership landmark of 1000 runs at an average of 84.66 in the first Women's ODIs on Thursday in Southampton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-chennaiyin-fc-part-ways-owen-coyle-indian-super-league-2757276-2025-07-17",
      "headline": "Indian Super League: Chennaiyin FC, Owen Coyle part ways by mutual consentChennaiyin FC announced that they have decided to mutually part ways with Owen Coyle, who came into the club for his second stint. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ravi-shastri-on-englands-wtc-points-deduction-2757241-2025-07-17",
      "headline": "Ravi Shastri warns England after Lord's Test win: It may hurt like AustraliaFormer India cricketer and head coach Ravi Shastri has warned England of facing Australia's fate after the WTC points deduction following their 22-run win at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-deep-dasgupta-karun-nair-vs-sai-sudharsan-2757234-2025-07-17",
      "headline": "Deep Dasgupta wants Sai Sudarshan over Karun Nair after Lord's failureIndia vs England: Former India wicketkeeper Deep Dasgupta believes it's time to look beyond Karun Nair after his failure in 3 Tests against England. Dasgupta wants to back promising youngster Sai Sudharsan, who was discarded after the opening Test match at Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-pratika-rawal-england-vs-india-womens-odi-record-2757224-2025-07-17",
      "headline": "Mandhana, Pratika set partnership world record in 1st Women's ODIENG-W vs IND-W: Smriti Mandhana and Pratika Rawal reached a partnership landmark of 1000 runs at an average of 84.66 in the first Women's ODIs on Thursday in Southampton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-marcus-rashford-transfer-barcelona-teddy-sheringham-2757216-2025-07-17",
      "headline": "Rashford doesn't deserve move to Barcelona: Sheringham slams United starFormer Manchester United striker, Teddy Sheringham hopes that Marcus Rashford does get the move to FC Barcelona. The club legend believes that the striker has not deserved such a move after reflecting on his time with Manchester United.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-indian-badminton-japan-open-2757210-2025-07-17",
      "headline": "Lakshya Sen focusing on achieving peak fitness after Japan Open exitLakshya Sen suffered an early exit at the Japan Open. The ace shuttler now aims to get back to full fitness before the world championships in Paris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-deepti-sharma-credits-rishabh-pant-for-new-shot-2757182-2025-07-17",
      "headline": "Deepti Sharma credits Rishabh Pant for new one-handed shot in her armouryIndia all-rounder Deepti Sharma has credited Rishabh Pant for the new one-handed shot in her armoury, which she played during her match-winning innings in the first ODI against England in Southampton."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/engw-vs-indw-deepti-sharma-preparations-odi-world-cup-southampton-2757141-2025-07-17",
      "headline": "Deepti not looking too far ahead of World Cup: Going one match at a timeDeepti Sharma is just taking it one game at a time. She does not want to get too ahead of herself and overwhelm her with the pressure of playing in the ODI World Cup. Instead she intends to take it a game at a time and focus on contributing each time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alastair-cook-bowlers-blaming-dukes-ball-india-vs-england-test-series-2757115-2025-07-17",
      "headline": "Alastair Cook taunts bowlers over persistent ball change requestsFormer England captain Alastair Cook has added his voice—and a dose of humour—to the growing debate around the Dukes ball in the ongoing five-match Test series between England and India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/japan-open-2025-lakshya-sen-satwikairaj-rankireddy-chirag-shetty-eliminated-in-round-of-16-clash-2757078-2025-07-17",
      "headline": "Japan Open 2025: Lakshya Sen, Satwik-Chirag eliminated in Round of 16 clashIndia's charge in the Japan Open is all but over as top stars like Lakshya Sen and the men's doubles pair of Satwiksairaj Rankireddy-Chirag Shetty were eliminated from the tournament after losing their respective Round of 16 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-will-have-to-alter-indias-jasprit-bumrah-plan-david-lloyd-2757072-2025-07-17",
      "headline": "Gautam Gambhir will have to alter India's Jasprit Bumrah plan: David LloydFormer England cricketer David Lloyd feels India head coach Gautam Gambhir will have to alter their plans regarding Jasprit Bumrah to make a comeback in the ongoing series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-r-ashwin-father-bold-prediction-mohammed-siraj-lords-test-2757070-2025-07-17",
      "headline": "Ashwin recalls his father's bold prediction about Siraj in thrilling Lord's TestEngland vs India: Former Indian cricketer Ravichandran Ashwin shared an amusing anecdote, revealing that his father was confident Mohammed Siraj would finish the match by hitting three sixes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/andrew-mcdonald-backs-sam-konstas-after-tough-west-indies-tour-2757057-2025-07-17",
      "headline": "Australia coach backs opener Sam Konstas after tough West Indies tourCricket Australia head coach Andrew McDonald has admitted the West Indies series has been \"a difficult time\" for Sam Konstas but rejected suggestions that the teenager has been damaged by the brutal experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-skips-montreal-tournament-opts-for-extra-rest-before-us-open-2757037-2025-07-17",
      "headline": "Sabalenka withdraws from National Bank Open, opts for extra rest before US OpenWorld No. 1 Aryna Sabalenka has pulled out of the upcoming National Bank Open in Montreal, opting to take additional rest as she prepares to defend her US Open title later this summer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-will-outscore-shubman-gill-in-coming-matches-says-owais-shah-2757033-2025-07-17",
      "headline": "KL Rahul will outscore Shubman Gill in coming matches: Former England batterFormer England batter Owais Shah has backed KL Rahul to outscore Shubman Gill in the coming matches. Both Rahul and Gill have been in marvellous form in the ongoing series, having plundered runs in the first three matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/clive-lloyd-complete-overhaul-west-indies-cricket-historic-collapse-vs-australia-2757012-2025-07-17",
      "headline": "Clive Lloyd urges complete overhaul of West Indies cricket after historic collapseClive Lloyd, the legendary former West Indies captain, has called for a serious and thorough review of cricket at all levels in the Caribbean. His remarks come in the wake of the West Indies Test team's shocking collapse against Australia, where they were dismissed for just 27 runs at Sabina Park."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}