{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-shares-in-focus-as-sebi-probes-top-executives-for-insider-trading-2732268-2025-05-29",
      "headline": "Explained: Why IndusInd Bank shares are in focus todayIndusInd Bank shares were trading 0.62% higher at Rs 809.75 on the Bombay Stock Exchange (BSE) at 9:42 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-400-points-nifty-nears-24900-it-stocks-rally-2732261-2025-05-29",
      "headline": "Sensex, Nifty rise as US court blocks Trump's tariffs, IT stocks rallyThe BSE Sensex was trading 424.23 points higher at 81,736.55 around 9:22 am, while the NSE Nifty50 gained 89.80 points to trade at 24,842.25. Most of the broader market indices also rose, reflecting the positive sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/delhi-startup-founder-says-salary-stagnation-is-breaking-indias-middle-class-2732257-2025-05-29",
      "headline": "Delhi startup founder says salary stagnation is breaking India's middle classThe startup founder has criticised India's economic policies for overlooking the salaried middle class, who contribute heavily to tax collections and consumer demand but receive little in return. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/share-market-today-sensex-nifty-set-for-positive-opening-today-2732249-2025-05-29",
      "headline": "Stock Market Today: Sensex, Nifty set for positive opening todayGift Nifty futures were trading at 24,836 as of 8:58 am, indicating a firm start for the Nifty 50, which ended Wednesday at 24,752.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-indusind-bank-irctc-adani-ports-suzlon-in-focus-2732243-2025-05-29",
      "headline": "Stocks to watch today: IndusInd Bank, IRCTC, Adani Ports, Suzlon in focusKeep an eye on IndusInd Bank, Adani Ports, SAIL, IRCTC, and Cummins India today, as earnings, regulatory action, and fundraising updates drive sentiment in the final stretch of May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-may-agree-on-interim-trade-deal-by-june-25-sources-2731964-2025-05-28",
      "headline": "India, US may agree on interim trade deal by June 25: SourcesAn interim trade pact between India and the US may be agreed upon by June 25, according to sources. A team of US officials is expected to visit India next month for trade talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-late-you-can-earn-33-percent-more-interest-on-tax-refunds-this-year-2731948-2025-05-28",
      "headline": "Filing ITR late? You can earn 33% more interest on tax refunds this yearIf you've paid extra tax via TDS, advance tax, or self-assessment, you're entitled to a refund. As per Section 244A of the Income Tax Act, the department pays 0.5% monthly interest on the excess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-get-debt-free-sooner-5-simple-ways-to-pay-off-your-loan-faster-2731966-2025-05-28",
      "headline": "Want to get debt-free sooner? 5 simple ways to pay off your loan fasterPersonal loans help manage big expenses, but repaying them quickly saves on interest and boosts your credit score.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-higher-msp-14-kharif-crops-2025-26-season-pm-modi-ashwini-vaishnav-2731916-2025-05-28",
      "headline": "MSP boost for farmers as Cabinet clears new rates for Kharif season 2025-26The MSP is the minimum price at which the government promises to buy crops from farmers, even if the market prices are lower. It is set every year for various crops to make sure farmers get a fair price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-204-points-lower-nifty-below-24800-indusind-bank-down-2-2731884-2025-05-28",
      "headline": "Sensex ends 240 points lower, Nifty below 24,800; ITC falls 3%The BSE Sensex ended 239.31 points lower at 81,312.32, while the NSE Nifty50 fell 73.75 points to settle at 24,752.45. Most of the broader market indices also fell due to high volatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/zerodhas-nithin-kamath-explains-why-indias-gdp-growth-isnt-enough-india-becomes-fourth-largest-economy-2731874-2025-05-28",
      "headline": "Zerodha's Nithin Kamath explains why India's GDP growth isn't enoughNithin Kamath mentioned that both the government and private companies need to work together to improve education, research, and regulations. Otherwise, many talented Indians may choose to work abroad, and India will miss out on its chance to grow faster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-deadline-extension-why-it-happened-and-what-you-need-to-do-now-income-tax-filing-by-september-15-2731832-2025-05-28",
      "headline": "ITR deadline extension: Why it happened and what you need to do nowEven though the deadline to file your ITR has been extended to September 15, 2025, it's still wise to get started early. Waiting till the last minute often leads to unnecessary stress and errors."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/uvashi-rautela-says-leonardo-dicaprio-called-her-queen-of-cannes-shares-selfie-2732267-2025-05-29",
      "headline": "Urvashi Rautela says Leonardo DiCaprio called her queen of Cannes, shares selfieActor Urvashi Rautela woke up on a Thursday and decided to post a selfie in which she could be seen posing with Hollywood star Leonardo DiCaprio. The actor shared that the 'Titanic' actor called her the 'queen of Cannes'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-all-smiles-lucknow-airport-ipl-qualifier-1-rcb-vs-pbks-2732258-2025-05-29",
      "headline": "Anushka Sharma, Virat Kohli are all smiles at airport ahead of IPL Qualifier 1Anushka Sharma and Virat Kohli were seen smiling at the Lucknow airport a day after RCB's big win. The cricket franchise will now take part in IPL 2025 Qualifier 1 against Punjab Kings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-nani-virumaandi-fan-analysis-2732234-2025-05-29",
      "headline": "This is enough, sir: Kamal Haasan's name-drop makes Nani's dayKamal Haasan acknowledged Nani's admiration for his work during an interview. The 'HIT 3' actor was overjoyed as his video caught the attention of his favourite actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brad-pitt-divorce-settlement-angelina-jolie-personal-life-2732225-2025-05-29",
      "headline": "Brad Pitt says settlement with Angelina not major a thing after 8-year battleHollywood actor Brad Pitt broke his silence on his long divorce battle with Angelina Jolie. In an interview, he spoke about how his personal life has always been in the news."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/billy-williams-acclaimed-gandhi-cinematographer-and-oscar-winner-dies-at-96-glbs-2732217-2025-05-29",
      "headline": "Billy Williams, acclaimed 'Gandhi' cinematographer and Oscar winner, dies at 96Oscar-winning cinematographer Billy Williams, best known for his work on Gandhi (1982), has died at 96, leaving behind a legendary legacy in film and visual storytelling.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/diddys-ex-girlfriend-cassie-welcomes-third-child-amid-ongoing-sex-trafficking-trial-glbs-2732212-2025-05-29",
      "headline": "Diddy's ex-girlfriend Cassie welcomes third child amid ongoing sex trafficking trialR&B singer Cassie welcomes her third child, a baby boy, just days after testifying against ex-boyfriend Sean \"Diddy\" Combs in a federal sex trafficking case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/is-brad-pitt-dating-again-all-about-his-stylish-new-girlfriend-glbs-2732201-2025-05-29",
      "headline": "Is Brad Pitt dating again? All about his stylish new girlfriendBrad Pitt opens up about his relationship with Ines de Ramon, reflecting on life under public scrutiny, the end of his divorce from Angelina Jolie, and his upcoming film F1, in a candid GQ Summer Issue interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/childs-play-actor-ed-gale-dies-at-61-glbs-2732194-2025-05-29",
      "headline": "'Child's Play' actor Ed Gale dies at 61Ed Gale, known for portraying Chucky in the original Child's Play films, has died at 61 under hospice care. The actor leaves behind a complex legacy of film roles and controversy"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-bhatia-reacts-to-meme-supporting-deepika-padukone-over-vanga-row-2732064-2025-05-28",
      "headline": "Actor Tamannaah reacts to liking meme supporting Deepika Padukone over Vanga rowActor Tamannaah Bhatia reacted to liking a social media meme backing Deepika Padukone over the recent controversy with filmmaker Sandeep Reddy Vanga. She alleged that it was due to a technical glitch on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/zamaana-lage-metro-in-dino-first-song-explores-love-and-loneliness-in-city-2732053-2025-05-28",
      "headline": "Zamaana Lage: Metro In Dino's first song explores love and loneliness in cityThe first song 'Zamaana Lage' from Anurag Basu's film 'Metro…In Dino' has been released, highlighting the emotional struggles of four couples in urban life. Featuring vocals by Arijit Singh and Shashwat Singh with music by Pritam, the track explores themes of love, loss, and loneliness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/black-warrant-season-2-announced-mismatched-to-conclude-with-season-4-2732023-2025-05-28",
      "headline": "Black Warrant Season 2 announced, Mismatched to conclude with Season 4Netflix India announced the second season of 'Black Warrant' and the final season of 'Mismatched' with Season 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nidhi-dutta-ivf-journey-infertility-pregnancy-border-2-2732032-2025-05-28",
      "headline": "Filmmaker Nidhi Dutta on miscarriage, IVF, filming Border 2 during pregnancyFilmmaker Nidhi Dutta shared her four-year IVF journey to normalise infertility in India. Her story highlights the emotional struggles and strength of women facing similar challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-click-rashmika-mandanna-saree-pics-2732011-2025-05-28",
      "headline": "Did Vijay Deverakonda click Rashmika Mandanna's saree pics? Fans think soActor Rashmika Mandanna shared saree pictures on Instagram, sparking fan speculation. Many believe Vijay Deverakonda is the photographer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohlis-celebratory-pic-rcb-win-against-lsg-ipl-match-2732009-2025-05-28",
      "headline": "Anushka Sharma, Virat Kohli's celebratory pic after RCB's win against LSGAnushka Sharma and Virat Kohli celebrated RCB's win against LSG on May 28. A picture of the couple after the match has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nirahua-kusha-kapila-join-ravi-kishan-maamla-legal-hai-season-2-2731983-2025-05-28",
      "headline": "Bhojpuri star Nirahua, Kusha Kapila join Ravi Kishan in Maamla Legal Hai 2Ravi Kishan is set to reprise his role as VD Tyagi in Netflix's Maamla Legal Hai Season 2. The new season brings fresh faces and promises more legal mischief and laughter in the Patparganj court."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/stolen-trailer-out-abhishek-banerjees-relentless-hunt-for-a-missing-baby-2731979-2025-05-28",
      "headline": "Stolen trailer: Abhishek Banerjee's relentless hunt for a missing baby'Stolen' is a gripping thriller about two brothers on a desperate search for a kidnapped baby. Starring Abhishek Banerjee and Mia Maelzer, the film premieres globally on June 4, 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-joins-forces-with-hombale-films-for-pan-india-project-2731985-2025-05-28",
      "headline": "Hrithik Roshan collaborates with Hombale Films for pan-India projectHrithik Roshan has joined hands with Hombale Films for an upcoming pan-India project. The makers shared the announcement on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-teaser-out-manchu-manoj-teja-sajja-fantasy-film-eyes-september-release-2731950-2025-05-28",
      "headline": "Mirai teaser out: Manchu Manoj, Teja Sajja's fantasy film eyes September releaseDirected by Karthik Ghattamaneni, this fantasy adventure film stars Hanu-Man star Teja Sajja in the lead alongside Manchu Manoj, Shriya Saran, among others, and is scheduled to have a global release in 8 different languages in 2D and 3D formats. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashok-saraf-anant-nag-shobana-chandrakumar-and-others-conferred-with-padma-awards-2731899-2025-05-28",
      "headline": "Actors Ashok Saraf, Anant Nag, Shobana and others conferred with Padma awardsPresident Droupadi Murmu presented Padma awards to actors Anant Nag, Ashok Saraf, Shobana Chandrakumar, and musician Ricky Kej among others from the entertainment industry. Singer Sharda Sinha was posthumously honoured with the Padma Vibhushan. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-administration-us-court-tariffs-india-pakistan-ceasefire-2732263-2025-05-29",
      "headline": "Defending tariffs, Trump team said adverse ruling would risk India-Pak ceasefireThe argument, made last week, failed to convince the Court of International Trade, which blocked Donald Trump's tariffs from going into effect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-thanks-trump-as-his-time-as-special-government-employee-in-us-presidents-administration-ends-2732215-2025-05-29",
      "headline": "My scheduled time comes to an end: Elon Musk exits Donald Trump's administrationThe billionaire's departure comes one day after he criticised the centerpiece of Trump's legislative agenda, saying he was \"disappointed\" by what the president calls his \"big beautiful bill.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kiren-rijiju-defends-shashi-tharoor-congress-row-over-operation-sindoor-praise-narendra-modi-2732221-2025-05-29",
      "headline": "What does Congress want, Kiren Rijiju backs Shashi Tharoor amid party heatUnion Minister Kiren Rijiju on Wednesday came out in support of Congress MP Shashi Tharoor, questioning the intent of the Congress party after it criticised Tharoor for his remarks praising the Narendra Modi government during an address in Panama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-jamal-siddiqui-ram-krishna-muslims-sanatan-dharma-prophet-2732209-2025-05-29",
      "headline": "BJP Minority Morcha chief claims Muslims are descendants of Lord RamSiddiqui linked Lord Ram and Krishna to Islamic prophethood and said Muslims who do not believe in Ram and Krishna cannot be called Muslims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-nani-virumaandi-fan-analysis-2732234-2025-05-29",
      "headline": "This is enough, sir: Kamal Haasan's name-drop makes Nani's dayKamal Haasan acknowledged Nani's admiration for his work during an interview. The 'HIT 3' actor was overjoyed as his video caught the attention of his favourite actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/terrorists-arrested-in-jammu-and-kashmir-shopian-arms-hand-grenades-recovered-army-crpf-2732240-2025-05-29",
      "headline": "2 Lashkar terrorists arrested in J&K's Shopian, arms and grenades recoveredThe operation came as security forces turned the focus of their anti-terror operations to specific areas in south Kashmir after the April 22 attack in Pahalgam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-police-fine-couple-caught-in-car-sunroof-indecent-act-romance-pda-viral-video-2732120-2025-05-28",
      "headline": "Bengaluru couple fined after video of 'indecent act' through car sunroof goes viralA couple in Bengaluru was fined after being filmed engaging in indecent behaviour through a moving car's sunroof. The video, shared online, triggered safety concerns and police action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-will-aggressively-revoke-visas-of-chinese-students-says-rubio-glbs-2732216-2025-05-29",
      "headline": "US will aggressively revoke visas for Chinese students, says Marco RubioSecretary of State Marco Rubio said that the US will revoke the visas of some Chinese students, particularly those in critical fields or linked to the Chinese Communist Party. President Donald Trump also urged Harvard to cap foreign student admissions at 15%.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/information/story/six-hours-that-defied-history-and-death-on-mount-everest-edmund-hillary-tenzing-norgay-2732065-2025-05-29",
      "headline": "Six hours that defied history and death on Mount EverestOn May 29, 1953, Edmund Hillary and Tenzing Norgay created history by summiting Mt Everest, the world's highest peak. On its anniversary, here is an account of the final six hours of humanity's quest for the top of the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-court-blocks-trumps-liberation-day-tariffs-cites-overreach-of-authority-glbs-2732213-2025-05-29",
      "headline": "US court blocks Trump's 'Liberation Day' tariffs, cites overreach of authorityA US trade court blocked Trump's \"Liberation Day\" tariffs, ruling he overstepped legal authority. The court said only Congress can regulate trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-1-pbks-vs-rcb-prediction-team-news-match-ups-2732203-2025-05-29",
      "headline": "Qualifier 1 preview: PBKS, RCB chase final spot and a break from heartbreakIPL 2025: Punjab Kings and Royal Challengers Bangalore clash in Qualifier 1, both teams embracing change as they chase their maiden title. While Virat Kohli takes centre stage, this tactical battle between two determined sides promises to ignite the stage in New Chandigarh on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/is-slouchy-scrolling-breaking-your-back-adult-tummy-time-to-the-rescue-2731810-2025-05-29",
      "headline": "Is mindless scrolling breaking your back? Try 'adult tummy time'Long desk hours, prolonged screen time has definitely locked horns with our backs and necks. Experts weigh in on how the viral 'adult tummy time' may help."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mahayuti-alliance-bjp-accuses-ncp-ajit-pawar-of-undermining-party-may-go-solo-in-local-body-polls-2732206-2025-05-29",
      "headline": "BJP accuses Ajit Pawar of undermining alliance, may go solo in civic pollsDespite their coalition, BJP leaders are increasingly concerned that Pawar's faction is strategically maneuvering to take control of local self-government bodies currently dominated by the BJP in key districts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-wants-harvard-to-reduce-international-students-from-27-to-15-glbs-2732210-2025-05-29",
      "headline": "Trump demands 15% cap on foreign students in Harvard: I want it to be great againPresident Donald Trump wants Harvard to cut its foreign student intake to 15%, citing limited access for American students. With funding frozen and enrolment concerns, Harvard is under immense pressure."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-car-accident-teen-kills-two-after-hitting-bicycle-with-car-then-crashing-into-slum-2732236-2025-05-29",
      "headline": "Delhi teen kills two after hitting bicycle with car, then crashing into slumAt least two people were killed and three injured after a Swift car, driven by a 19-year-old boy, first hit a cyclist and then crashed into a roadside slum after losing control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/uvashi-rautela-says-leonardo-dicaprio-called-her-queen-of-cannes-shares-selfie-2732267-2025-05-29",
      "headline": "Urvashi Rautela says Leonardo DiCaprio called her queen of Cannes, shares selfieActor Urvashi Rautela woke up on a Thursday and decided to post a selfie in which she could be seen posing with Hollywood star Leonardo DiCaprio. The actor shared that the 'Titanic' actor called her the 'queen of Cannes'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/india-4th-largest-economy-is-not-all-cheer-but-it-is-not-a-tragedy-either-2731900-2025-05-28",
      "headline": "Calm down...4th largest economy is not all cheer, but it's not a tragedy eitherWe are still fourth. Not even a podium finish. No medals. A rank which an embarrassed Indian parent would sugarcoat in front of relatives by saying we are in the Top 5 of the class. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-400-points-nifty-nears-24900-it-stocks-rally-2732261-2025-05-29",
      "headline": "Sensex, Nifty rise as US court blocks Trump's tariffs, IT stocks rallyThe BSE Sensex was trading 424.23 points higher at 81,736.55 around 9:22 am, while the NSE Nifty50 gained 89.80 points to trade at 24,842.25. Most of the broader market indices also rose, reflecting the positive sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brad-pitt-divorce-settlement-angelina-jolie-personal-life-2732225-2025-05-29",
      "headline": "Brad Pitt says settlement with Angelina not major a thing after 8-year battleHollywood actor Brad Pitt broke his silence on his long divorce battle with Angelina Jolie. In an interview, he spoke about how his personal life has always been in the news."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-kochi-schoolboy-goes-missing-found-in-thodupuzha-town-he-went-to-explore-after-seeing-on-youtube-reels-2732145-2025-05-28",
      "headline": "Kerala teen skips school to visit town he saw on YouTube reels, traced by policeA 14-year-old Kerala boy who went missing from his school in Kochi was found a day later in another district of the state. He had set out to explore a town he discovered through YouTube reels."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/thirteen-stuck-at-zero-line-india-bangladesh-army-dig-heels-illegal-immigrants-border-guard-bangladesh-2732046-2025-05-28",
      "headline": "13 stranded at Zero Line as India, Bangladesh dig heels on illegal immigrantsThirteen people were stranded at the Indo-Bangladesh Zero Line after being barred from entering Bangladesh by the BGB and India refusing them re-entry. As India tries to hand over illegal immigrants to Bangladesh, leaders in Dhaka accuse New Delhi of \"violating its sovereignty\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-visa-ban-foreign-officials-censorship-of-americans-online-on-social-media-marco-rubio-2732144-2025-05-28",
      "headline": "US to ban visas for foreign officials who censor Americans onlineSecretary of State Marco Rubio said the US will refuse visas to foreign officials who censor or block Americans' social media posts. He warned that those who threaten free speech 'are attacking one of the pillars of our shared interests, culture, and values.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/drills-to-be-conducted-tomorrow-evening-in-gujarat-rajasthan-punjab-and-jk-people-asked-to-remain-alert-2731858-2025-05-28",
      "headline": "Security drill rescheduled in Punjab for June 3, postponed in other statesAmid ongoing tensions between New Delhi and Islamabad, security drills had been planned in the states bordering Pakistan -- Gujarat, Punjab, Haryana, Rajasthan, and Jammu and Kashmir -- which came under heavy attack from across the border during the recently concluded four-day conflict."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-elena-rybakina-frances-tiafoe-holger-rune-2732262-2025-05-29",
      "headline": "Elena Rybakina thumps Iva Jovic, Frances Tiafoe, Holger Rune advanceFrench Open 2025: 12th seed Elena Rybakina beat Iva Jovic 6-3, 6-3, while Frances Tiafoe and Holger Rune also advanced to the third round of the clay-court major. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-recalls-first-meeting-with-ms-dhoni-from-2005-2732253-2025-05-29",
      "headline": "Ravindra Jadeja recalls first meeting with MS Dhoni: I was hesitant to meet himStar India all-rounder Ravindra Jadeja recently recalled his first meeting with MS Dhoni from 2005 and revealed how he was hesitant to meet him. Jadeja has played under Dhoni both for India and Chennai Super Kings (CSK). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-shreyas-iyer-qualifier-1-2732239-2025-05-29",
      "headline": "Does captain Shreyas Iyer give Punjab the edge in Qualifier 1Shreyas Iyer has been sensational for PBKS and helped them reach the playoffs of the IPL 2025. Will he be the difference for his side when they go up against RCB in Qualifier 1 on May 29?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-1-weather-report-mullanpur-pbks-vs-rcb-2732235-2025-05-29",
      "headline": "Qualifier 1 Weather Report: Will rain play spoilsport in Mullanpur?IPL 2025, PBKS vs RCB, Qualifier 1: Let's take a look at the weather conditions in Mullanpur before the all-important clash between Royal Challengers Bengaluru and Punjab Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-marco-jansen-arshdeep-singh-qualifier-1-pbks-vs-rcb-2732222-2025-05-29",
      "headline": "No Jansen, no problem? Time for Arshdeep to be Punjab Kings' hero in Qualifier 1IPL 2025, Qualifier 1: With Marco Jansen away on national duty, Arshdeep Singh will have to step up for Punjab Kings in the absence of his bowling partner in Qualifier 1 against Royal Challengers Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-qualifier-1-predicted-xi-2732220-2025-05-29",
      "headline": "PBKS vs RCB IPL 2025 Qualifier 1, Predicted XIs: Will Hazlewood, Chahal return?It's time for the Qualifier 1 of the IPL 2025 campaign with PBKS and RCB locking horns in Mullanpur. With Josh Hazlewood and Yuzvendra Chahal set to return, all eyes will be on the lineups of both teams on Thursday, May 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-1-pbks-vs-rcb-prediction-team-news-match-ups-2732203-2025-05-29",
      "headline": "Qualifier 1 preview: PBKS, RCB chase final spot and a break from heartbreakIPL 2025: Punjab Kings and Royal Challengers Bangalore clash in Qualifier 1, both teams embracing change as they chase their maiden title. While Virat Kohli takes centre stage, this tactical battle between two determined sides promises to ignite the stage in New Chandigarh on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-stefanos-tsitsipas-casper-ruud-crash-out-2732177-2025-05-28",
      "headline": "Big upsets as Stefanos Tsitsipas and Casper Ruud shocked in Round 2Italian qualifier Matteo Gigante sent former finalist Stefanos Tsitsipas tumbling out of the Grand Slam in the second round, while Casper Ruud's campaign also ended prematurely as a lingering knee injury hampered his performance.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-results-rohan-bopanna-yuki-bhambri-rithvik-bollipalli-2732148-2025-05-28",
      "headline": "Rohan Bopanna, Yuki Bhambri progress to 2nd round, Bollipalli crashes outRohan Bopanna and his Czech partner Adam Pavlasek progressed to the second round of the French Open after securing a hard-fought win over American duo of Robert Cash and JJ Tracy. Yuki Bhambri also progressed while Rithvik Bollipalli crashed out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-iga-swiatek-storms-third-round-tv-shows-reactions-2732138-2025-05-28",
      "headline": "Iga Swiatek shuns TV shows to stay sharp in French Open title defenceFrench Open 2025: Iga Swiatek extended her Roland Garros winning streak to 23 matches with a commanding win over Emma Raducanu. The Pole, ranked five, is bidding to win her fourth successive title in Paris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-rcb-ab-de-villiers-angry-commentators-2732095-2025-05-28",
      "headline": "AB de Villiers slams commentators for negative take on RCB: It got me so angryFormer South Africa captain AB de Villiers criticised commentators for their negative remarks on RCB's bowling during their match against LSG in Lucknow on Tuesday. RCB conceded 227, but chased the target down in 18.4 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-1-pbks-vs-rcb-prediction-team-news-match-ups-2732203-2025-05-29",
      "headline": "Qualifier 1 preview: PBKS, RCB chase final spot and a break from heartbreakIPL 2025: Punjab Kings and Royal Challengers Bangalore clash in Qualifier 1, both teams embracing change as they chase their maiden title. While Virat Kohli takes centre stage, this tactical battle between two determined sides promises to ignite the stage in New Chandigarh on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-stefanos-tsitsipas-casper-ruud-crash-out-2732177-2025-05-28",
      "headline": "Big upsets as Stefanos Tsitsipas and Casper Ruud shocked in Round 2Italian qualifier Matteo Gigante sent former finalist Stefanos Tsitsipas tumbling out of the Grand Slam in the second round, while Casper Ruud's campaign also ended prematurely as a lingering knee injury hampered his performance.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-results-rohan-bopanna-yuki-bhambri-rithvik-bollipalli-2732148-2025-05-28",
      "headline": "Rohan Bopanna, Yuki Bhambri progress to 2nd round, Bollipalli crashes outRohan Bopanna and his Czech partner Adam Pavlasek progressed to the second round of the French Open after securing a hard-fought win over American duo of Robert Cash and JJ Tracy. Yuki Bhambri also progressed while Rithvik Bollipalli crashed out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-iga-swiatek-storms-third-round-tv-shows-reactions-2732138-2025-05-28",
      "headline": "Iga Swiatek shuns TV shows to stay sharp in French Open title defenceFrench Open 2025: Iga Swiatek extended her Roland Garros winning streak to 23 matches with a commanding win over Emma Raducanu. The Pole, ranked five, is bidding to win her fourth successive title in Paris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-rcb-ab-de-villiers-angry-commentators-2732095-2025-05-28",
      "headline": "AB de Villiers slams commentators for negative take on RCB: It got me so angryFormer South Africa captain AB de Villiers criticised commentators for their negative remarks on RCB's bowling during their match against LSG in Lucknow on Tuesday. RCB conceded 227, but chased the target down in 18.4 overs. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}