{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nvidia-market-cap-4-trillion-dollar-first-company-to-ever-achieve-milestone-record-rally-2753330-2025-07-09",
      "headline": "Nvidia makes history, becomes first company to hit $4 trillion in market valueNvidia's market cap now exceeds the combined value of the Canadian and Mexican stock markets. It is also larger than the total market capitalisation of all publicly listed companies in the UK, according to LSEG data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/emirates-signs-deal-to-accept-crypto-payments-report-2753227-2025-07-09",
      "headline": "Emirates signs deal to accept crypto payments for flight bookings: ReportIn recent years, the UAE has grown into a popular place for crypto companies. Many crypto firms have opened offices there or are planning to expand. Today, people in the UAE can already use cryptocurrencies to pay for things like real estate, school fees and even transport services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-176-points-lower-nifty-below-25500-hcltech-down-2-percent-2753166-2025-07-09",
      "headline": "Sensex closes 176 points lower, Nifty below 25,500; HCLTech down 2%The S&P BSE Sensex was down by 176.43 points to 83,536.08, while the NSE Nifty50 lost 46.40 points to 25,476.10 as of 3:47 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/reliance-jio-ipo-delay-2025-listing-unlikely-report-2753164-2025-07-09",
      "headline": "Reliance Jio IPO hits pause button, 2025 listing unlikely: ReportReliance Industries shares fell sharply after the news and were down 1.8% in afternoon trade, dragging the broader market into negative territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-ban-jane-street-aftermath-effect-dalal-street-stock-market-news-2753149-2025-07-09",
      "headline": "Sebi's ban on Jane Street: Could it rattle Dalal Street?While the ban is focused on a single player, many believe it may have wider effects on liquidity, trading volumes, investor confidence, and even foreign investor behaviour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/71-percent-indians-fear-ai-scams-during-prime-day-report-2753134-2025-07-09",
      "headline": "71% Indians fear AI scams during Prime Day: ReportPrime Day scams India, AI shopping scams 2025, McAfee Prime Day scam report, Fake Amazon websites India, online shopping scam awareness, AI scam protection tips, Prime Day fake deals warning, Indians fear online scams, cyber fraud Prime Day India, deepfake scams online shopping"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/travel-food-services-ipo-review-latest-gmp-subscribe-skip-allotment-listing-date-2753114-2025-07-09",
      "headline": "Travel Food Services IPO to close soon: Should you subscribe? Check latest GMPThe bidding for the IPO began on July 7 and is set to close soon. Travel Food Services has set the price band for the issue between Rs 1,045 and Rs 1,100 per share. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-who-qualifies-for-zero-income-tax-2753102-2025-07-09",
      "headline": "ITR filing: Who qualifies for zero income tax?In her 2025 Budget speech, Finance Minister Nirmala Sitharaman shared big news. Under the new regime, if you earn up to Rs 12 lakh, you will not have to pay any income tax. Salaried taxpayers get an extra benefit too."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-q1fy26-preview-infosys-tcs-wipro-gain-momentum-or-soft-quarter-equirus-securities-earnings-preview-2753054-2025-07-09",
      "headline": "Infosys, TCS, Wipro: Will top IT companies gain momentum in Q1FY26?Equirus Securities, in its earnings preview, signals a subdued performance for the sector, where even the heavyweights are struggling to regain momentum. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/amfi-data-june-2025-mutual-fund-inflows-rise-24-percent-stock-market-news-2753021-2025-07-09",
      "headline": "Mutual fund inflows rise 24% in June to Rs 23,587 crore: AMFI dataAmong the 11 equity mutual fund categories, all except equity-linked savings schemes (ELSS) recorded positive inflows. Flexi cap funds emerged as the most preferred option for investors, bringing in Rs 5,733 crore in June. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/9-countries-where-indians-can-get-citizenship-for-less-than-rs-1-crore-2753019-2025-07-09",
      "headline": "9 countries where Indians can get citizenship for less than Rs 1 croreAcross many countries, it is now fully legal to buy citizenship. With a single payment or donation, Indians can get a fresh passport that offers visa-free access and minimal global taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/icici-prudential-asset-management-files-for-ipo-check-details-2752973-2025-07-09",
      "headline": "ICICI Prudential Asset Management files for IPO. Check offer detailsThe IPO will be an offer for sale of up to 1.77 crore shares, representing 10% of the company's equity share capital. The shares will be sold by Prudential Corporation Holdings Limited (PCHL), a wholly-owned subsidiary of UK-based insurer Prudential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/crizac-share-price-ipo-listing-14-percent-premium-rs-280-bse-nse-dalal-street-2752968-2025-07-09",
      "headline": "Crizac IPO listing: Shares debut at 14% premium on Dalal StreetCrizac share price: The stock opened at Rs 280 on the Bombay Stock Exchange (BSE) showing a 14.29% premium on its Dalal Street debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-sip-rs-2000-per-month-investment-enough-to-make-you-rich-ca-explains-2752959-2025-07-09",
      "headline": "Will Rs 2,000 SIP make you rich? CA breaks it downMany young investors trust SIPs to secure their future but without clear goals, even long-term discipline might not be enough, warns CA and financial planning advisor Abhishek Walia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/studying-abroad-here-is-how-you-can-manage-your-finances-smartly-2752738-2025-07-09",
      "headline": "Studying abroad? Here's how you can manage your finances smartlyStudying abroad is a huge step, and an amazing opportunity. But a bit of smart financial planning can help you enjoy every moment without money worries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-130-points-lower-nifty-below-25500-hul-up-1-percent-2752940-2025-07-09",
      "headline": "Sensex opens 130 points lower, Nifty below 25,500; HUL up 1%The S&P BSE Sensex was down by 158.94 points to 83,553.57, while the NSE Nifty50 lost 41.70 points to 25,480.80 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/wolfspeed-share-price-us-stock-market-wall-street-rise-248-percent-5-days-nasdaq-new-cfo-gregor-van-issum-2752924-2025-07-09",
      "headline": "Wolfspeed shares surge 248% in 5 days. What's powering this Nasdaq stock?Wolfspeed shares opened with a 43% jump on Tuesday over the previous day's close of $1.18 and reached an intraday high of $3.33. The stock ended the day at $2.52, up 9%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-sabih-khan-apple-new-coo-work-experience-leadership-change-2752900-2025-07-09",
      "headline": "Who is Sabih Khan? Apple's new COO overtaking Jeff WilliamsThe announcement came on Tuesday, with the company confirming that Sabih Khan will step into the role later this month. He takes over from Jeff Williams, who has held the post since 2015."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ipl-valuation-rcb-brand-value-more-csk-mumbai-indians-cricket-news-houlihan-lokey-report-2752899-2025-07-09",
      "headline": "RCB overtakes CSK as IPL's most valuable team, league now worth $18.5 billionA report released by investment bank Houlihan Lokey said the IPL's business value rose by 13% in 2025 to $18.5 billion. At the same time, the brand value of the league increased by 14% to nearly $4 billion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-hopeful-of-inking-trade-deal-but-new-delhi-firm-on-protecting-key-sectors-2752663-2025-07-08",
      "headline": "India, US hopeful of inking trade deal, but New Delhi firm on protecting key sectorsIndia and the United States are nearing a trade deal, with negotiations ongoing. India has taken a firm stance on protecting sensitive sectors, particularly wheat, maize, dairy, and genetically grown crops."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/da-hike-dearness-allowance-60-percent-central-government-employees-salary-rise-2752659-2025-07-08",
      "headline": "Will central government employees' dearness allowance reach 60%?The government revises the DA/DR rates twice a year, effective from January 1 and July 1. However, the official announcement generally comes a few months later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-kotak-bank-rise-3-percent-india-us-trade-2752641-2025-07-08",
      "headline": "Sensex closes 271 points higher, Nifty above 25,500; Kotak Bank up 3%The S&P BSE Sensex added 270 points to end at 83,712.51, while the NSE Nifty50 gained 61.20 points to close at 25,522.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fincluencer-explains-why-indias-rich-are-planning-to-retire-abroad-2752627-2025-07-08",
      "headline": "Fincluencer explains why India's rich are planning to retire abroadIndia's rich are rethinking where they retire and how they invest. Finfluencer Akshat Shrivastava says it's not a whim but a calculated response to India's tax structure on wealth and income."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/high-salary-still-broke-financial-expert-sanjay-kathuria-on-lifestyle-inflation-2752583-2025-07-08",
      "headline": "Earning Rs 80,000 a month and still broke? Finance coach explains what's wrongMany in their 20s and 30s are earning more than generations before, but their money often disappears into lifestyle upgrades, digital conveniences, and impulse-driven choices. The result is a sense of helplessness despite a good paycheck."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bill-gates-net-worth-trails-former-microsoft-ceo-steve-balmer-top-10-richest-world-2752559-2025-07-08",
      "headline": "Bill Gates no longer in world's top 10 richest; trails former Microsoft CEOBill Gates now ranks behind Michael Dell, who is at number 11 with $137 billion, and Steve Ballmer, his former Microsoft colleague, who is far ahead at number 5 with $172 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/all-you-need-to-know-about-uae-golden-visa-cost-application-process-documentation-2752538-2025-07-08",
      "headline": "All you need to know about UAE's Golden Visa: Cost, application, documentationUnlike earlier Golden Visas that required big investments in property or business, this new scheme allows skilled professionals to apply based on their talent and work experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-vs-sebi-all-you-need-to-know-about-the-case-2752537-2025-07-08",
      "headline": "Jane Street vs Sebi: All you need to know about the caseAt the heart of the controversy is a long-running investigation into the firm's index arbitrage strategy, one that Jane Street insists is standard and legal, but which Sebi believes may have distorted prices in India's rapidly growing equity derivatives market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-you-receive-a-tax-refund-now-if-you-file-your-itr-before-september-15-2752492-2025-07-08",
      "headline": "Filed your ITR early? Will you get a faster tax refund?Filing an ITR early improves your chances of a quicker refund, but only if your return is correct, complete and verified on time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-claim-rejections-india-irda-data-real-stories-personal-finance-health-life-term-2752351-2025-07-08",
      "headline": "Insured, but still deniedIn Part 2 of our series on India's insurance crisis, we explore why, for thousands of Indians, having a policy doesn't mean having protection when it matters most."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sebi-vs-jane-street-to-challenge-trading-ban-slams-charges-as-inflammatory-2752400-2025-07-08",
      "headline": "Jane Street to challenge Sebi trading ban, slams charges as inflammatory: ReportIn an internal email to staff over the weekend, the US-based firm said it was \"beyond disappointed\" by Sebi's accusations, which it described as \"extremely inflammatory.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/expert-sanjay-bangar-ulips-high-premiums-not-tax-free-explained-2752383-2025-07-08",
      "headline": "Have lost their tax edge: Expert sounds the alarm on ULIPsThe tax expert said ULIPs no longer guarantee tax-free returns. Investors paying over Rs 2.5 lakh annually may face capital gains tax—making mutual funds a more efficient alternative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-65-points-lower-nifty-below-25500-kotak-bank-up-3-percent-2752380-2025-07-08",
      "headline": "Sensex opens 65 points lower, Nifty below 25,500; Kotak Bank up 3%The S&P BSE Sensex was up by 72.04 points to 83,514.54, while the NSE Nifty50 added 16.50 points to 25,477.80 as of 9:40 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-trading-setup-trump-tariff-trade-deal-nse-bse-2752364-2025-07-08",
      "headline": "Market opening: How will Sensex, Nifty react to Trump's tariff announcement?While a US-India trade deal may help improve mood, the benefits may be limited to specific sectors. For today's session, Nifty to find support between 25,330 and 25,180 and face resistance near 25,510 and 25,630, say experts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-new-14-countries-latest-rates-india-trade-deal-brics-export-america-2752360-2025-07-08",
      "headline": "Trump's tariff list: 14 countries, new rates, and what they export to AmericaUS President Donald Trump confirmed that letters had been sent to several nations, warning them that if new trade agreements are not reached by August 1, increased import duties will be implemented."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/necktie-nomics-can-the-rbi-governor-tie-colour-predict-rate-moves-2752135-2025-07-07",
      "headline": "Necktie Nomics: Can the RBI Governor's tie colour predict rate moves?An SBI report looked at the ties worn by the RBI Governor during Monetary Policy Committee (MPC) meetings. Instead of only watching inflation numbers or GDP data, they turned their attention to the shades of silk draped around the Governor's neck."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-trump-tariff-trade-sensex-ends-flat-nifty-below-25500-hul-gains-3-2752040-2025-07-07",
      "headline": "Sensex ends flat, Nifty below 25,500; HUL gains 3%The S&P BSE Sensex closed 9.61 points higher at 83,442.50, while the NSE Nifty remained flat to end below 25,500."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gccs-global-capability-centres-push-indias-office-leasing-to-new-heights-report-2751996-2025-07-07",
      "headline": "GCCs push India's office leasing to new heights: ReportGCCs are no longer coming to India just for cheaper costs. They now see India as a strong base for talent, innovation and large modern offices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-increase-watch-derivative-trading-sanjay-malhotra-jane-street-ban-fo-stock-market-news-2751986-2025-07-07",
      "headline": "Sebi to intensify watch on derivatives trading after Jane Street episodeIndia is currently the world's largest equity derivatives market. According to the Futures Industry Association, it accounted for nearly 60% of the derivatives contracts traded globally in April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/emis-hurt-india-middle-class-more-than-inflation-says-financial-expert-2751948-2025-07-07",
      "headline": "EMIs hurt India's middle class more than inflation, says financial expertToday, almost everything is available on easy monthly instalments, from a new phone to flight tickets, even groceries. What was once a helpful option has now turned into a lifestyle. However, this is silently eating into people's income, leaving little room for savings or emergencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-for-the-first-time-7-common-errors-new-taxpayers-must-avoid-2751883-2025-07-07",
      "headline": "Filing ITR for the first time? 7 common errors new taxpayers must avoidFiling your ITR is not enough. You must verify it too. If you forget, the tax department treats it as if you never filed it at all. You can e-verify using Aadhaar OTP, net banking, or by sending a signed physical copy. Without verification, your return stays incomplete."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hbo-max-returns-warner-bros-drops-max-rebrand-after-backlash-glbs-2753455-2025-07-10",
      "headline": "HBO Max returns: Warner Bros. drops 'Max' rebrand after backlashWarner Bros. Discovery has rebranded Max back to HBO Max, citing the strong legacy and consumer loyalty tied to the HBO name, after the Max brand failed to resonate with audiences.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/wednesday-season-2-trailer-out-jenna-ortega-returns-with-darker-twist-glbs-2753452-2025-07-10",
      "headline": "Wednesday Season 2 trailer out: Jenna Ortega returns with darker twistWednesday Season 2 trailer teases dark twists, new characters, and Jenna Ortega's return. Steve Buscemi joins as principal, Joanna Lumley debuts as Grandmama, and global \"Doom Tour\" promotions kick off.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diljit-dosanjh-new-bts-from-border-2-varun-dhawan-ahan-shetty-make-cameo-2753337-2025-07-09",
      "headline": "Diljit Dosanjh shares new BTS from Border 2, Varun Dhawan-Ahan Shetty make cameoDespite the row over his casting in 'Border 2', Diljit Dosanjh seems unfazed. The actor is enjoying himself on set, as seen in his latest video.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/humaira-asghar-ali-the-pakistani-actor-found-dead-at-home-2753332-2025-07-09",
      "headline": "Who was Humaira Asghar Ali, the Pakistani actor found dead at home?Pakistani actor and model Humaira Asghar Ali was found dead in her Karachi apartment, with the cause of death still under investigation. Known for her roles in TV dramas and the film 'Jalaibee', she gained fame through the reality show 'Tamasha Ghar'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/siddu-jonnalagadda-turns-raw-and-intense-for-badass-makers-unveil-poster-2753314-2025-07-09",
      "headline": "Siddu Jonnalagadda turns raw and intense for Badass, makers unveil posterAfter the massive success of the 'Tillu' franchise, Siddu Jonnalagadda is set to shed the lingering image with 'Badass', a raw, intense film directed by Ravikanth Perepu. The makers released the first-look poster recently."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apple-tv-plus-slow-horses-gary-oldman-spy-show-renewed-season-seven-2753296-2025-07-09",
      "headline": "Slow Horses renewed: Gary Oldman's spy-thriller upgraded for seventh seasonActor Gary Oldman's British spy-thriller series 'Slow Horses' has been renewed for the seventh season. The show is based on Mick Herron's spy novel series 'Slough House'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-trailer-lord-vishnu-and-prahalds-epic-tale-comes-alive-2753326-2025-07-09",
      "headline": "Mahavatar Narsimha trailer: Lord Vishnu and Prahald's epic tale comes aliveThe trailer for 'Mahavatar Narsimha' has been unveiled, showcasing a grand and emotional depiction of a pivotal mythological tale centred on Prahlada's devotion and divine intervention. Set to release in 3D across five Indian languages in July 2025, the film also marks the beginning of the ambitious Mahavatar Cinematic Universe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ali-fazal-surprises-fans-at-metro-in-dino-screening-video-goes-viral-2753300-2025-07-09",
      "headline": "Ali Fazal surprises fans at Metro In Dino screening, video goes viralAli Fazal surprised fans with an unannounced visit to a theatre screening of 'Metro... In Dino', leaving the audience thrilled and the moment going viral. The film is already receiving a positive response from viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/what-to-expect-from-james-gunns-superman-and-why-watching-man-of-steel-is-crucial-2753260-2025-07-09",
      "headline": "What to expect from James Gunn's Superman, and why watching Man of Steel is crucialJames Gunn's 'Superman' might bring a new and exciting look, full of action and visuals, but might not go too deep into the characters. However, watching 'Man of Steel' before can help you understand the background better."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/john-cena-jokes-margot-robbie-barbie-was-a-mistake-that-happened-over-dinner-2753295-2025-07-09",
      "headline": "John Cena jokes Margot Robbie's Barbie was a mistake that happened over dinnerHollywood star John Cena landed a role in the 2023 hit 'Barbie' through an unexpected meeting at a dinner hosted by Margot Robbie. He appeared in a cameo role in the Oscar-nominated film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shahana-goswami-lionsgate-play-four-years-later-ott-romance-this-weekend-2753199-2025-07-09",
      "headline": "Four Years Later tops OTT romance this weekend, here's all about Shahana's showActor Shahana Goswami's Australian-Indian romantic-drama 'Four Years Later' is all set for its digital debut in India. The series explores the emotional and cultural challenges faced by a migrant couple in an arranged marriage. Here's when and where to binge-watch the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ballard-ott-guide-cast-story-and-what-to-expect-from-bosch-spinoff-2753236-2025-07-09",
      "headline": "Ballard OTT guide: Cast, story, and what to expect from Bosch spinoffOTT's 'The Bosch' spin-off 'Ballard' dives deep into cold cases and corruption. The show premiered on July 9.  Here's all about it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/charlize-theron-the-old-guard-2-trending-on-netflix-top-charts-despite-poor-reviews-2753220-2025-07-09",
      "headline": "All about Charlize Theron's The Old Guard 2, Netflix film trending amid poor reviews'The Old Guard 2', headlined by Charlize Theron, has taken over the top spot on Netflix's global top 10 movies for the week. The film ranked number 1 on Netflix in 74 countries, including India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/timothee-chalamet-zendaya-dune-3-official-title-confirmed-all-you-need-to-know-about-new-dune-movie-2753177-2025-07-09",
      "headline": "Timothee Chalamet and Zendaya's Dune 3 official title confirmed: ReportsDenis Villeneuve's 'Dune 3' has entered production. The film's official title has been confirmed and, contrary to fans' predictions, it's not 'Dune Messiah'. Find out more details here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-shiva-rajkumar-channels-vintage-spy-look-in-666-operation-dream-theatre-2753226-2025-07-09",
      "headline": "Actor Shiva Rajkumar channels vintage spy look in 666 Operation Dream TheatreThe makers of '666 Operation Dream Theatre' unveiled Shiva Rajkumar's first look. Directed by Hemanth Rao, the film is said to be a spy action thriller. The retro styling and tone hint at a tribute to old-school espionage dramas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jeetendra-kumar-jaideep-ahlawat-jackson-wang-promise-fun-on-the-great-indian-kapil-sharma-show-2753161-2025-07-09",
      "headline": "Jeetu bhaiya, Jaideep Ahlawat, Jackson Wang promise fun on Kapil's show. WatchActors Jaideep Ahlawat, Pratik Gandhi, Jeetendra Kumar and Vijay Varma will feature in the next episode of 'The Great Indian Kapil Show'. K-Pop singer Jackson Wang would also make an appearance in the episode. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/freedom-movie-review-sasikumar-action-drama-sri-lankan-refugee-lost-opportunity-2753225-2025-07-09",
      "headline": "Freedom review: Sasikumar's action drama, based on true story, is lost opportunityRelease Date:Wed Jul 09, 2025Freedom movie review: Director Sathyasiva's 'Freedom', based on a true incident about Sri Lankan refugees, features Sasikumar, Lijomol Jose and Sudev Nair. The film has a solid story at its core, but is bogged down by sloppy execution. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajkummar-rao-patralekhaa-announce-pregnancy-2753232-2025-07-09",
      "headline": "Rajkummar Rao-Patralekhaa announce pregnancy, celebs congratulateRajkummar Rao and Patralekhaa announced pregnancy on July 9. The couple shared a joint post on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sai-pallavi-junaid-khans-ek-din-to-release-in-november-report-2753189-2025-07-09",
      "headline": "Sai Pallavi, Junaid Khan's Ek Din to release in November: ReportThe upcoming film, 'Ek Din', starring Junaid Khan and Sai Pallavi, is set for release in November. Directed by Sunil Pandey, it will mark Pallavi's Bollywood debut. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-issues-tariff-letters-to-6-more-nations-iraq-algeria-libya-philippines-2753386-2025-07-09",
      "headline": "Trump's tariff letters to 7 more nations: Iraq, Algeria and Sri Lanka face 30%The new tariff directives, communicated via official letters to foreign leaders and shared on Trump's Truth Social platform, outline duty hikes of 30 per cent on Algeria, Iraq, and Libya; 25 per cent on Brunei and Moldova; and 20 per cent on the Philippines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aap-chief-arvind-kejriwal-says-he-deserves-nobel-prize-bjp-suggests-corruption-category-2753404-2025-07-09",
      "headline": "Arvind Kejriwal says he deserves Nobel prize, BJP suggests 'corruption category'Speaking in Chandigarh at the launch of the Punjabi edition of a book titled 'The Kejriwal Model', the AAP supremo said that despite repeated attempts to obstruct his government's work in Delhi, his administration had delivered effectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/elon-musks-starlink-gets-approval-to-operate-internet-satellites-over-india-2753323-2025-07-09",
      "headline": "Elon Musk's Starlink gets approval to operate internet satellites over IndiaThe rollout of Starlink's services will, however, remain subject to all relevant regulatory clearances, approvals, and licenses from government departments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-flavio-cobolli-wimbledon-quarterfinal-2753449-2025-07-10",
      "headline": "Novak Djokovic equals Chris Evert's historic record after semis berthWimbledon: 24-time Grand Slam winner Novak Djokovic beat Italy's Flavio Cobolli in four sets and set up a clash with Jannik Sinner, who defeated the USA's Ben Shelton. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/home-minister-amit-shah-shares-post-retirement-plan-will-dedicate-life-to-vedas-upanishads-farming-2753303-2025-07-09",
      "headline": "Amit Shah shares post-retirement plan: Vedas, Upanishads and farmingUnion Home Minister Amit Shah recently revealed his post-retirement plans. The sixty-year-old task-master said he would immerse himself in Vedas, Upanishads, and natural farming. Citing health risks linked to the use of chemical fertilisers, Shah batted for the promotion of organic farming."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/heavy-rain-across-delhi-ncr-red-alert-sounded-for-next-2-hours-2753311-2025-07-09",
      "headline": "Roads flooded, traffic crawls as Delhi-NCR receives heavy rainSeveral roads were waterlogged, causing traffic jams after heavy rain lashed Delhi-NCR on Wednesday evening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-could-be-hit-by-drone-while-sunbathing-iranian-official-glbs-2753456-2025-07-10",
      "headline": "Trump could be hit by drone while sunbathing: Iranian officialAn Iranian official warned that US President Donald Trump is not safe at his Florida residence, suggesting a drone strike, as rising US-Iran tensions fuel fears of assassination attempts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arunachal-chief-minister-pema-khandu-warns-as-china-builds-mega-dam-water-bomb-for-india-2753373-2025-07-09",
      "headline": "Water bomb for India, Arunachal Chief Minister warns as China builds 'mega dam'According to reports, China approved the construction of the USD 137 billion, five-year project in 2024. It is projected to produce 60,000 MW of power, making it the world's largest hydropower dam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-gambhira-bridge-collapse-vadodara-woman-cry-for-help-son-drowning-2753241-2025-07-09",
      "headline": "My son is drowning: Mother's desperate cry for help after Gujarat bridge collapseAccording to information gathered from the site, the woman had been travelling to Bagdana along with her son, daughter, husband, and son-in-law when the bridge gave way. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/one-big-beautiful-bill-us-hikes-student-tourist-h1b-visa-charges-with-250-dollar-security-fee-donald-trump-integrity-fee-2753147-2025-07-09",
      "headline": "US hikes student, tourist, H-1B visa charges with $250 security depositNon-immigrant visa applicants, including students, professionals, and tourists, will have to pay a $250 \"Integrity Fee\", along with other travel-related fees, starting in 2026, to enter the US. The fee might be refunded under certain conditions, but will change annually as it is based on inflation rates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-jannik-sinner-vs-ben-shelton-quarterfinal-2753421-2025-07-09",
      "headline": "Wimbledon: Not pain free, but Jannik Sinner breezes past Ben Shelton into semisJannik Sinner fought through pain to make it to the semi-finals of Wimbledon 2025 by beating Ben Shelton in straight sets on Wednesday, July 9. Sinner breezed past Shelton in two hours and 19 minutes on Wednesday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/vadodara-bridge-collapse-dead-injured-gujarat-vehicles-fall-mahisagar-river-gambhira-2753012-2025-07-09",
      "headline": "Bridge collapses in Gujarat, 13 dead as vehicles plunge, truck hangs by a threadGujarat Bridge Collapse: Preliminary information indicated at least five vehicles had fallen into the river after the bridge collapse. Calling the incident 'deeply saddening,' Chief Minister Bhupendra Patel said that one of the 23 spans of the nearly 900-metre-long bridge had collapsed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/samsung-launches-ultra-thin-galaxy-z-fold-7-and-flip-7-more-affordable-galaxy-z-flip-7-fe-tags-along-2753327-2025-07-09",
      "headline": "Samsung launches ultra-thin Galaxy Z Fold 7 and Flip 7Samsung has unveiled three new foldable smartphones — Galaxy Z Fold 7, Flip 7, and Flip 7 FE — at its Unpacked 2025 event in New York, USA."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-suspends-mla-canteen-licence-after-shiv-sena-mla-sanjay-gaikwad-hits-staff-over-stale-dal-2753433-2025-07-09",
      "headline": "Maharashtra suspends MLA canteen licence after Sena MLA hits staff over stale dalThe licence of the MLA canteen was suspended a day after Shiv Sena MLA Sanjay Gaikwad was caught on camera slapping and punching a staff member over stale food."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-administration-threatens-harvards-accreditation-targets-foreign-students-glbs-2753450-2025-07-10",
      "headline": "Trump administration threatens Harvard's accreditation, targets foreign studentsThe Trump administration has warned that Harvard University may lose its accreditation and demanded records on international students, accusing the school of antisemitism and left-wing bias. Harvard denies the claims and is fighting back in court to protect its rights and reputation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/mysuru-jayadeva-hospital-sees-long-queues-rush-sees-as-people-in-panic-over-heart-attack-deaths-2753215-2025-07-09",
      "headline": "Long queues at Mysuru hospital as people panic over rise in heart attack casesRecent media reports about a surge in heart attack-related deaths in Karnataka, especially in Hassan, has triggered panic among the public. Thousands have been queueing up daily at Jayadeva Hospital in Mysuru for cardiac check-ups, prompting doctors to urge calm and lifestyle changes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/election-commission-bihar-special-intensive-revision-eci-non-citizens-vote-india-row-aadhaar-card-documents-form-6-2752797-2025-07-09",
      "headline": "Aadhaar isn't proof of citizenship. Then how does it fetch voting rights?The Election Commission is holding an intensive revision of voter rolls across India, beginning with Bihar, to update them and weed out non-citizens. But why did India allow non-citizens to get into the rolls in the first place? Form 6, which people fill to register as voters, doesn't demand proof of citizenship in the first place. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/story/linda-yaccarino-steps-down-as-ceo-of-elon-musks-x-two-years-after-taking-up-the-top-role-2753346-2025-07-09",
      "headline": "Linda Yaccarino steps down as X CEO after two yearsLinda Yaccarino has resigned as CEO of X after nearly two years, ending her leadership run marked by platform changes, ad business challenges, and Elon Musk's push for an \"everything app\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/video-pm-modi-gets-standing-ovation-in-namibia-parliament-2753357-2025-07-09",
      "headline": "Video: PM Modi gets standing ovation in Namibia ParliamentPrime Minister Narendra Modi received a standing ovation ahead of his address to the Parliament of Namibia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/delhi-mandates-english-medium-section-across-classes-in-government-schools-2753426-2025-07-09",
      "headline": "Delhi mandates English-medium section across classes in government schoolsThe circular stated that each class must have at least one English medium section, where all subjects-except regional languages-will be taught in English."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indian-tourists-detained-russia-moscow-immigration-ordeal-appeal-modi-jaishankar-2753255-2025-07-09",
      "headline": "Treated like criminals: Indian tourist, held in Russia with others, seeks helpAn Indian tourist detained by Moscow immigration authorities with eight others appealed to the Indian embassy and Prime Minister Narendra Modi to intervene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-xi-jinpings-abrupt-absence-has-sparked-global-speculation-2752697-2025-07-08",
      "headline": "Why Xi Jinping's abrupt absence has sparked global speculationWhether it's illness, pressing preoccupation or sidelining by his own system, one thing is clear: China may be entering a period of political uncertainty\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-goa-archives-plans-to-give-states-rich-past-a-safe-future-2752704-2025-07-08",
      "headline": "How Goa archives plans to give state's rich past a safe futureA unique initiative is underway to unearth historical manuscripts, letters and private collections dating back to the colonial era and safe-keep them in digitised format\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/plane-crashes-in-rajasthans-churu-pilot-found-dead-2753112-2025-07-09",
      "headline": "2 pilots killed in IAF Jaguar jet crash in Rajasthan, third incident in 5 monthsSources told India Today TV that the aircraft was on a training sortie when it went down. The IAF operates multiple air bases in Rajasthan, with major installations in Jodhpur and Bikaner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diljit-dosanjh-new-bts-from-border-2-varun-dhawan-ahan-shetty-make-cameo-2753337-2025-07-09",
      "headline": "Diljit Dosanjh shares new BTS from Border 2, Varun Dhawan-Ahan Shetty make cameoDespite the row over his casting in 'Border 2', Diljit Dosanjh seems unfazed. The actor is enjoying himself on set, as seen in his latest video.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/humaira-asghar-ali-the-pakistani-actor-found-dead-at-home-2753332-2025-07-09",
      "headline": "Who was Humaira Asghar Ali, the Pakistani actor found dead at home?Pakistani actor and model Humaira Asghar Ali was found dead in her Karachi apartment, with the cause of death still under investigation. Known for her roles in TV dramas and the film 'Jalaibee', she gained fame through the reality show 'Tamasha Ghar'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/siddu-jonnalagadda-turns-raw-and-intense-for-badass-makers-unveil-poster-2753314-2025-07-09",
      "headline": "Siddu Jonnalagadda turns raw and intense for Badass, makers unveil posterAfter the massive success of the 'Tillu' franchise, Siddu Jonnalagadda is set to shed the lingering image with 'Badass', a raw, intense film directed by Ravikanth Perepu. The makers released the first-look poster recently."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apple-tv-plus-slow-horses-gary-oldman-spy-show-renewed-season-seven-2753296-2025-07-09",
      "headline": "Slow Horses renewed: Gary Oldman's spy-thriller upgraded for seventh seasonActor Gary Oldman's British spy-thriller series 'Slow Horses' has been renewed for the seventh season. The show is based on Mick Herron's spy novel series 'Slough House'. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-india-vs-sri-lanka-2753458-2025-07-10",
      "headline": "Rohit Sharma, Virat Kohli return likely in August as Sri Lanka propose seriesRohit Sharma and Virat Kohli are likely to be in action after Sri Lanka put forth a proposal to India for a white-ball series after the tour of Bangladesh was postponed to September 2026. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-injury-scare-quarterfinal-wimbledon-2753453-2025-07-10",
      "headline": "Novak Djokovic addresses injury scare after nasty fall in quartersWimbledon: Novak Djokovic opened up on his nasty fall in the dying stages of his quarterfinal clash against  Flavio Cobolli where he won 6-7 (6-8), 6-2, 7-5, 6-4. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-flavio-cobolli-wimbledon-quarterfinal-2753449-2025-07-10",
      "headline": "Novak Djokovic equals Chris Evert's historic record after semis berthWimbledon: 24-time Grand Slam winner Novak Djokovic beat Italy's Flavio Cobolli in four sets and set up a clash with Jannik Sinner, who defeated the USA's Ben Shelton. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-2025-max-verstappen-mercedes-move-red-bull-lewis-hamilton-2753441-2025-07-10",
      "headline": "Verstappen to Mercedes: Hamilton welcomes Red Bull star's rumoured moveLewis Hamilton has welcomed the prospect of Max Verstappen making a switch from Red Bull to join Mercedes. The talk about Verstappen making a switch to the Silver Arrows have intensified over past few months. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/rishabh-pant-jofra-archer-lords-test-press-conference-2753437-2025-07-09",
      "headline": "Going to be a good contest: Pant braces for Archer challenge at Lord'sENG vs IND, 2nd Test: In the pre-match press conference before the Lord's Test, Rishabh Pant said that he's looking forward to facing Jofra Archer, who's making his Test comeback after around four and a half years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/italy-scotland-t20-world-cup-qualification-2753425-2025-07-09",
      "headline": "Italy on cusp of historic T20 World Cup spot after stunning ScotlandItaly defeated Scotland by 12 runs on Wednesday and are on the verge of making their way through to the Men's T20 World Cup to be held next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-jannik-sinner-vs-ben-shelton-quarterfinal-2753421-2025-07-09",
      "headline": "Wimbledon: Not pain free, but Jannik Sinner breezes past Ben Shelton into semisJannik Sinner fought through pain to make it to the semi-finals of Wimbledon 2025 by beating Ben Shelton in straight sets on Wednesday, July 9. Sinner breezed past Shelton in two hours and 19 minutes on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-psg-fifa-club-world-cup-semifinal-livestreaming-preview-tv-channel-india-2753207-2025-07-09",
      "headline": "Real Madrid vs PSG, FIFA Club World Cup semi-final: Where to watch in IndiaReal Madrid take on PSG in a blockbuster Club World Cup semi-final, where Kylian Mbappe faces his former club. With Chelsea waiting in the final, it's all to play for at MetLife."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lyon-saved-from-ligue-1-relegation-crystal-palace-europa-league-2753378-2025-07-09",
      "headline": "Lyon saved from Ligue 1 relegation, but Crystal Palace suffer blow to Europe hopesLyon has been saved from Ligue 1 relegation as their appeal to overturn the decision was made on Wednesday, July 9. However, this has put Crystal Palace's participation in the Europa League under doubt as both clubs belong to the same owners. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-belinda-bencic-wimbledon-semifinal-motherhood-2753368-2025-07-09",
      "headline": "Mom last year, Wimbledon semis this year: Belinda Bencic continues magical runWimbledon 2025: Belinda Bencic, 28, has reached the semi-finals of the grass-court Grand Slam for the first time in her career. Remarkably, she has climbed back into the top 20 just six months after starting the season ranked No. 487."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-jannik-sinner-vs-ben-shelton-quarterfinal-2753421-2025-07-09",
      "headline": "Wimbledon: Not pain free, but Jannik Sinner breezes past Ben Shelton into semisJannik Sinner fought through pain to make it to the semi-finals of Wimbledon 2025 by beating Ben Shelton in straight sets on Wednesday, July 9. Sinner breezed past Shelton in two hours and 19 minutes on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-psg-fifa-club-world-cup-semifinal-livestreaming-preview-tv-channel-india-2753207-2025-07-09",
      "headline": "Real Madrid vs PSG, FIFA Club World Cup semi-final: Where to watch in IndiaReal Madrid take on PSG in a blockbuster Club World Cup semi-final, where Kylian Mbappe faces his former club. With Chelsea waiting in the final, it's all to play for at MetLife."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lyon-saved-from-ligue-1-relegation-crystal-palace-europa-league-2753378-2025-07-09",
      "headline": "Lyon saved from Ligue 1 relegation, but Crystal Palace suffer blow to Europe hopesLyon has been saved from Ligue 1 relegation as their appeal to overturn the decision was made on Wednesday, July 9. However, this has put Crystal Palace's participation in the Europa League under doubt as both clubs belong to the same owners. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-belinda-bencic-wimbledon-semifinal-motherhood-2753368-2025-07-09",
      "headline": "Mom last year, Wimbledon semis this year: Belinda Bencic continues magical runWimbledon 2025: Belinda Bencic, 28, has reached the semi-finals of the grass-court Grand Slam for the first time in her career. Remarkably, she has climbed back into the top 20 just six months after starting the season ranked No. 487."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}