{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oxford-india-forum-2025-business-leaders-policymakers-entrepreneurs-kalli-purie-isro-ai-2751203-2025-07-05",
      "headline": "Oxford India Forum 2025 celebrates India's rising influence, youthful ambitionThe Oxford India Forum 2025 brought together a dynamic mix of business leaders, policymakers, entrepreneurs, academics and students to reflect on India's evolving global role and the path forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/the-great-indian-salary-crisis-middle-class-unemployment-job-loss-268-04-07-2025",
      "headline": "The Great Indian Salary CrisisWhite-collar employees in India are caught in a salary spiral where costs keep climbing, pay moves slowly, and financial stability slips further away. On paper, the economy is booming, but the pay cheques of working middle-class Indians tell a very different story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-proposes-retaliatory-duties-at-world-trade-body-against-us-tariffs-on-autos-2750911-2025-07-04",
      "headline": "India proposes retaliatory duties at world trade body against US tariffs on autosIndia has proposed to impose an equivalent amount of duty collected from products originating in the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/real-estate-vs-mutual-funds-where-should-you-invest-explains-stock-market-expert-2750826-2025-07-04",
      "headline": "Real Estate vs Mutual Funds: Where should you invest, explains stock market expertOwning a house was once every family's dream, but times have changed. With high prices and new ways to invest, is real estate still smart, or are mutual funds better? A stock market expert explains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/video/ankur-mehra-book-pixels-to-profits-creators-must-think-like-startups-not-influencers-2750822-2025-07-04",
      "headline": "Ankur Mehra says creators must think like startups, not influencersAnkur Mehra, in his new book Pixels to Profits, urges creators to stop chasing follower counts and instead build sustainable, multi-platform businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/success-isnt-about-number-of-followers-in-creator-economy-ankur-mehra-2750781-2025-07-04",
      "headline": "Success isn't about number of followers in creator economy: Ankur MehraIn a conversation with Business Today's Sakshi Batra, Ankur Mehra, author of Pixels to Profits, explains what it really takes to succeed in the creator economy, and why chasing viral fame or follower counts may be the wrong metric altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-192-points-higher-nifty-below-25500-infosys-gains-1-percent-2750774-2025-07-04",
      "headline": "Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/prada-kolhapuri-chappal-gi-tag-law-protection-indian-articrafts-artisans-reform-global-policy-fashion-2750757-2025-07-04",
      "headline": "India tags it, West sells it. Can Prada's Kolhapuri row lead to real reform?The luxury brand's new \"toe-ring sandal\" has ignited not just cultural outrage but also legal action in India, with a Public Interest Litigation filed in the Bombay High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-itr-2-and-itr-3-forms-why-they-are-missing-and-what-to-do-income-tax-filing-2750711-2025-07-04",
      "headline": "Where are ITR-2 and ITR-3 forms? Why they're missing and what to doIt's ITR season but many taxpayers can't find the ITR-2 and ITR-3 forms on the Income Tax portal yet. If you have capital gains, foreign income or business income, this delay might worry you. The good news is there's an extended deadline this year. Here's why these forms are missing and what you should do next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sbi-credit-card-rules-changing-from-july-15-here-is-what-cardholders-must-know-2750616-2025-07-04",
      "headline": "SBI credit card rules changing from July 15: Here's what cardholders must knowAt present, many cardholders pay only a small part of their bill to avoid late charges. But now, the way the minimum amount due (MAD) is calculated will change starting July 15, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/exclusive-world-bank-poverty-in-india-measurement-metrics-one-in-four-below-minimum-standard-of-living-2750607-2025-07-04",
      "headline": "One in 4 Indians still below minimum standard of living: World BankDespite a sharp drop in extreme poverty, about one in four Indians still falls below the level needed to meet essential needs and maintain a minimum standard of living."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-ban-jane-street-stock-manipulation-bank-nifty-options-futures-shorting-reason-interim-order-2750597-2025-07-04",
      "headline": "Sebi bans Jane Street for stock market manipulation. Here's what went wrongUS Trading Firm Jane Street: Securities and Exchange Board of India (Sebi) said the trades executed by the group were \"prima facie fraudulent and manipulative\" and violated the country's capital market regulations."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ghaati-release-anushka-shetty-postponed-action-thriller-vikram-prabhu-2751282-2025-07-05",
      "headline": "Anushka Shetty's Ghaati release gets postponed again, producers issue statementThe release date of actor Anushka Shetty's action-drama 'Ghaati' has been postponed yet again. The producers confirmed the same in an official statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-on-paparazzi-culture-nysa-yug-too-young-when-paps-began-chasing-her-2751285-2025-07-05",
      "headline": "Kajol on paparazzi culture: Nysa was too young when paps began chasing herKajol, in a recent interview, opened up about the constant glare of paparazzi and how she's guided her children, Nysa and Yug, to cope with it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-sethupathi-apologises-son-surya-viral-video-controversy-phonenix-release-2751231-2025-07-05",
      "headline": "Vijay Sethupathi apologises over son Surya's viral video: May be unintentionalVijay Sethupathi addressed a recent controversy involving his son Surya at the 'Phoenix' premiere. He offered his clarification on the matter and also apologised to people who were hurt in case of misunderstandings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/freida-pinto-backs-deepika-padukone-hollywood-walk-of-fame-2751204-2025-07-05",
      "headline": "Freida Pinto backs Deepika's spot on Hollywood Walk of Fame: No need for debateActor Freida Pinto recently reacted to Deepika Padukone being named as one of the honouries on the Hollywood Walk of Fame. She slammed the criticism over the same and asked people to take pride in celebrating the South Asian community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/naseeruddin-shah-clarifies-post-backing-diljit-dosanjh-sardaar-ji-3-row-was-taken-down-by-facebook-2751257-2025-07-05",
      "headline": "Naseeruddin Shah says post backing Diljit Dosanjh was taken down by FacebookVeteran actor Naseeruddin Shah recently revealed that his post supporting Diljit Dosanjh amid the 'Sardaar Ji 3' controversy was taken down by Facebook. Shah had earlier shared a strong statement backing the Punjabi actor-singer for proceeding with the release of his film despite the backlash.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sona-mohapatra-on-kaanta-laga-row-questions-paid-pr-and-milking-shefalis-death-2751220-2025-07-05",
      "headline": "Sona Mohapatra on Kaanta Laga row, questions paid PR and milking Shefali's deathSinger Sona Mohapatra reacted to the backlash after her post calling out 'Kaanta Laga' makers. She had slammed the creators of the track for passing off the song as theirs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-kisses-priyanka-chopra-enjoys-fireworks-celebrate-4th-of-july-in-new-york-2751160-2025-07-05",
      "headline": "Nick kisses Priyanka, enjoys fireworks as they celebrate 4th of July in New YorkNick Jonas and Priyanka Chopra had a great time celebrating the Fourth of July in New York. The two witnessed fireworks as they took part in the grand celebrations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-basu-kartik-aaryan-sreeleela-film-shooting-update-title-announcement-2751165-2025-07-05",
      "headline": "Anurag Basu shares update on Kartik Aaryan-Sreeleela film, title announcement soonDirector Anurag Basu recently shared an update on the shooting schedule of his upcoming film with Kartik Aaryan and Sreeleela. He also discussed the film's title announcement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/move-over-ott-how-big-screen-exclusives-could-spark-cinema-grand-comeback-aamir-khan-sitaare-zameen-par-thug-life-2750767-2025-07-05",
      "headline": "Why Bollywood's OTT detox might just get audience back to theatresThe exclusive screening of films in theatres has sparked industry-wide discussion about the future of cinema. While exhibitors and multiplex owners praised the move for reviving the lost glory of the big screen, some producers and trade experts remain cautious, citing the importance of OTT and satellite revenue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shoaib-ibrahim-says-dipika-kakar-cancer-stage-2-liver-can-recur-treatment-may-take-2-years-2751137-2025-07-05",
      "headline": "Shoaib Ibrahim says Dipika Kakar's cancer can recur, treatment may take 2 yearsActor Shoaib Ibrahim recently revealed that his wife Dipika Kakar's cancer can recur after surgery. He even updated fans about her medication and further treatment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-box-office-day-1-anurag-basu-aditya-roy-kapur-sara-ali-khan-film-off-to-a-decent-start-2751125-2025-07-05",
      "headline": "Metro In Dino box office Day 1: Anurag Basu's film is off to a decent startFilmmaker Anurag Basu's 'Metro In Dino' boasting a star-studded cast, hit theatres on July 4. The film, which opened to rave reviews, collected Rs 3.35 crore on its opening day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-offers-rs-50-lakh-aid-for-fish-venkats-kidney-transplant-2751110-2025-07-05",
      "headline": "Prabhas offers Rs 50 lakh aid for actor Fish Venkat's kidney transplantActor Prabhas has promised financial assistance to veteran comedian Fish Venkat, who is currently battling for his life in the ICU and urgently needs a kidney transplant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-julian-mcmahon-dies-at-56-after-long-battle-with-cancer-glbs-2751075-2025-07-05",
      "headline": "Actor Julian McMahon dies at 56 after long battle with cancerJulian McMahon, known for Nip/Tuck, Charmed, and Fantastic Four, has died at 56 after battling cancer. The actor was celebrated for his versatility, charisma, and beloved roles in TV and film.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-becomes-most-followed-on-spotify-beats-taylor-swift-and-ed-sheeran-2750928-2025-07-04",
      "headline": "Arijit Singh becomes most followed on Spotify, beats Taylor Swift and Ed SheeranArijit Singh has become the most followed artist on Spotify with 151 million followers, surpassing global stars like Taylor Swift and Ed Sheeran. Despite having fewer monthly listeners, his follower count reflects a strong and dedicated global fan base."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sandeep-reddy-vanga-spirit-begin-in-september-prabhas-to-join-later-2750925-2025-07-04",
      "headline": "Spirit: Sandeep Reddy Vanga to begin shooting in September, Prabhas to join laterFilming of 'Spirit' begins in September 2025, with Prabhas to join the set in November. The actor will star alongside Triptii Dimri in the upcoming film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/munawar-faruqui-on-secret-wedding-with-mehzabeen-coatwala-2750921-2025-07-04",
      "headline": "Munawar Faruqui on secret wedding with Mehzabeen Coatwala: It was for my sonMunawar Faruqui shared that his decision to marry Mehzabeen Coatwala was driven by his desire to live with his son, Mikael. The wedding, kept private, happened just a month after the decision and within five months of knowing Mehzabeen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-x-review-fans-impressed-sara-ali-khan-performance-irrfan-khan-anurag-basu-2750878-2025-07-04",
      "headline": "Metro In Dino X review: Fans impressed with Sara's performance, miss Irrfan'Metro In Dino', which released in theatres today (July 4) has got social media buzzing with reviews. As per X users, actor Sara Ali Khan has delivered an impressive performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/battle-of-galwan-reaction-fans-celebrate-salman-khan-in-uniform-welcome-bhaijaans-comeback-2750907-2025-07-04",
      "headline": "Battle of Galwan reaction: Fans celebrate Salman Khan in uniform, welcome Bhaijaan's comebackFans celebrated Salman Khan's comeback on Friday as the Bollywood superstar shared the first motion poster of his upcoming film 'Battle Of Galwan.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/battle-of-galwan-motion-poster-salman-khan-looks-fierce-first-look-uniform-2750896-2025-07-04",
      "headline": "Battle of Galwan first look: Salman Khan is intense, fierce in uniformSalman Khan shared the motion poster of his upcoming film 'Battle of Galwan'. The story is based on one of India's most brutal battles fought without a single bullet being fired."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-rudali-speech-jibe-uddhav-thackeray-mumbai-rally-raj-thackeray-maharashtra-marathi-2751329-2025-07-05",
      "headline": "Devendra Fadnavis's 'rudali speech' jibe at Uddhav Thackeray after Mumbai rallyDevendra Fadnavis called the Thackeray cousins' Mumbai rally a political grief, accusing them of political mourning instead of celebrating. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nihal-modi-brother-of-fugitive-economic-offender-nirav-modi-arrested-in-us-in-bank-fraud-case-2751253-2025-07-05",
      "headline": "Nehal Modi, brother of fugitive Nirav Modi, arrested in US in bank fraud caseNehal Modi, a Belgian national, was taken into custody following an extradition request by India, the US Justice Department said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/f-35-fighter-jet-british-royal-navy-engineers-team-thiruvananthapuram-airport-kerala-2751278-2025-07-05",
      "headline": "Repair or repatriate? UK technicians to examine stranded F-35 in Kerala tomorrowA team of around 25 technicians from the UK is expected to arrive in Thiruvananthapuram on Sunday to assess the stranded F-35 fighter jet of the Royal Navy. The jet has been stranded for three weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-4-updates-edgbaston-2751248-2025-07-05",
      "headline": "Day 4 Live: Pant, Gill resumes play after LunchEngland (ENG) vs India (IND), 2nd Test Day 4 Live Score and Updates: Shubman Gill and Rishabh Pant have taken India past the 350-run mark. Pant has been aggressive, putting the English bowlers under pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/from-hired-to-fired-tech-founder-reveals-how-soham-parekh-operated-and-hints-at-how-he-fooled-companies-2751290-2025-07-05",
      "headline": "Tech founder reveals how Soham Parekh operated and how he fooled companiesYet another story from Soham Parekh's controversy is out. Dhruv Amin, co-founder of AI startup Create, reveals Parekh came to work only once and frequently missed meetings, and delayed deliverables. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/weve-come-together-to-stay-together-uddhav-on-reunion-with-raj-thackeray-after-two-decades-2751201-2025-07-05",
      "headline": "We've come together to stay together: Uddhav on reunion with Raj ThackerayShiv Sena (UBT) chief Uddhav Thackeray made statements when the two cousins reunited on Saturday to celebrate the Maharashtra government's rollback of Hindi as an optional third language."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-postpone-bangladesh-tour-to-2026-2751318-2025-07-05",
      "headline": "BCCI defers India's Bangladesh tour in August 2025 to September 2026The BCCI (Board of Control for Cricket in India) and the BCB (Bangladesh Cricket Board) have mutually agreed to postpone the white-ball series between Bangladesh and India to September 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/what-bal-thackeray-couldnt-do-devendra-fadnavis-did-by-uniting-us-raj-thackeray-at-rally-with-cousin-uddhav-2751198-2025-07-05",
      "headline": "Fadnavis did what Balasaheb couldn't: Raj Thackeray on reunion with UddhavThe rare reunion of the Thackeray cousins came after the Devendra Fadnavis government rolled back its decision to make Hindi mandatory as a third language in primary schools."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/the-great-indian-salary-crisis-middle-class-unemployment-job-loss-268-04-07-2025",
      "headline": "The Great Indian Salary CrisisWhite-collar employees in India are caught in a salary spiral where costs keep climbing, pay moves slowly, and financial stability slips further away. On paper, the economy is booming, but the pay cheques of working middle-class Indians tell a very different story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/move-over-ott-how-big-screen-exclusives-could-spark-cinema-grand-comeback-aamir-khan-sitaare-zameen-par-thug-life-2750767-2025-07-05",
      "headline": "Why Bollywood's OTT detox might just get audience back to theatresThe exclusive screening of films in theatres has sparked industry-wide discussion about the future of cinema. While exhibitors and multiplex owners praised the move for reviving the lost glory of the big screen, some producers and trade experts remain cautious, citing the importance of OTT and satellite revenue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-classic-90m-throw-bengaluru-event-details-2751218-2025-07-05",
      "headline": "NC Classic: How rare is a 90m throw and can Neeraj Chopra do it at home?Neeraj Chopra returns home for the historic NC Classic in Bengaluru, where all eyes are on whether he can replicate his rare 90m throw in front of a home crowd. 90m throws are exceptional: only 1.6 percentage of the top 8001 recorded distance are above the magical mark. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tamil-nadu-custodial-death-ajith-kumar-karti-chidambaram-exclusive-interview-2751319-2025-07-05",
      "headline": "Training of cops needed: Karti Chidambaram on Tamil Nadu custodial deathReacting to the autopsy report of a Tamil Nadu temple security guard who died allegedly in police custody last month, Congress MP Karti Chidambaram said it was gravely distressing and called for sensitisation of police forces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-on-paparazzi-culture-nysa-yug-too-young-when-paps-began-chasing-her-2751285-2025-07-05",
      "headline": "Kajol on paparazzi culture: Nysa was too young when paps began chasing herKajol, in a recent interview, opened up about the constant glare of paparazzi and how she's guided her children, Nysa and Yug, to cope with it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajasthan-bhilwara-specially-abled-handicapped-man-lynched-beaten-car-hits-vegetable-cart-cctv-2751263-2025-07-05",
      "headline": "Specially-abled man lynched after car hits vegetable cart near Rajasthan mosqueMassive communal tension arose in Rajasthan's Bhilwara after a specially-abled 22-year-old man was allegedly lynched following his car accidentally hitting a vegetable cart near a mosque."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/bengaluru-woman-confesses-to-beating-husband-to-death-after-he-comes-home-drunk-2751287-2025-07-05",
      "headline": "Man comes home drunk, wife beats him to death with ragi rolling pin in BengaluruThe woman confessed that she used a wooden cooking stick typically used to make ragi mudde (millet balls) to beat her husband after he came home intoxicated."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-prime-minister-shehbaz-sharif-pahalgam-terror-attack-kashmir-india-operation-sindoor-2751159-2025-07-05",
      "headline": "Pahalgam attack unfortunate, India used it to destabilise peace, says Pak PMPakistani Prime Minister Shehbaz Sharif, referring to Operation Sindoor, accused India of destabilising regional peace through 'unprovoked and reckless' hostility towards the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristano-ronaldo-missing-diogo-jota-funeral-portugal-captain-fans-angry-reaction-2751330-2025-07-05",
      "headline": "Ronaldo misses Diogo Jota's funeral? Fans left fuming at Portugal captainCristiano Ronaldo's reported absence from the funeral of his fellow Portuguese teammate, Diogo Jota has left fans fuming at the national team captain. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-502-04-07-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/muslim-woman-divorce-win-in-telangana-high-court-rekindles-marital-equality-debate-khula-doesnt-need-husband-consent-2750771-2025-07-05",
      "headline": "Muslim woman's divorce victory rekindles marital-equality debateThe Telangana High Court recently upheld a Muslim woman's unilateral right to divorce through Khula, which means she does not require her husband's consent, or any religious body's approval for separation. The landmark ruling has reignited conversations around marital equality, gender justice, and the applicability of personal laws under constitutional principles."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-rape-accused-monojit-mishra-was-made-students-point-of-contact-despite-criminal-record-2751243-2025-07-05",
      "headline": "Kolkata rape accused was made students' point of contact despite criminal recordDocuments accessed by India Today TV show that a South Calcutta Law College notice dated August 13, 2024, named Kolkata gangrape prime accused Monojit Mishra as the primary point of contact for student matters, despite facing criminal cases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/naseeruddin-shah-clarifies-post-backing-diljit-dosanjh-sardaar-ji-3-row-was-taken-down-by-facebook-2751257-2025-07-05",
      "headline": "Naseeruddin Shah says post backing Diljit Dosanjh was taken down by FacebookVeteran actor Naseeruddin Shah recently revealed that his post supporting Diljit Dosanjh amid the 'Sardaar Ji 3' controversy was taken down by Facebook. Shah had earlier shared a strong statement backing the Punjabi actor-singer for proceeding with the release of his film despite the backlash.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-sethupathi-apologises-son-surya-viral-video-controversy-phonenix-release-2751231-2025-07-05",
      "headline": "Vijay Sethupathi apologises over son Surya's viral video: May be unintentionalVijay Sethupathi addressed a recent controversy involving his son Surya at the 'Phoenix' premiere. He offered his clarification on the matter and also apologised to people who were hurt in case of misunderstandings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gopal-khemka-bihar-murder-news-patna-businessman-killed-by-bikers-6-years-after-sons-eerily-similar-murder-2751087-2025-07-05",
      "headline": "Tycoon killed by biker 6 years after son's similar murder, CCTV captures incidentThe unidentified assailant opened fire on Gopal Khemka, owner of Magadh Hospital, just as he stepped out of his car near an apartment close to his residence near Panache Hotel, in the upscale Gandhi Maidan area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/microsoft-shuts-down-pakistan-operations-after-25-years-amid-global-restructuring-and-layoffs-2751216-2025-07-05",
      "headline": "Microsoft shuts down Pakistan operations after 25 years amid global layoffsMicrosoft has recently announced that it is closing its Pakistan operations as part of its global workforce reduction strategy. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-second-test-rishabh-pant-sends-bat-flying-edgbaston-2751332-2025-07-05",
      "headline": "Watch: Rishabh Pant sends bat flying and leaves crowd and dressing room in splitsRishabh Pant proved to be the total entertainer at Edgbaston on Day 4 of the second Test as he sent his bat flying. The moment left the crowd and the Indian dressing room in splits, with Jasprit Bumrah struggling to hold on to his laughter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-calls-rohit-sharma-bossy-gautam-gambhir-2751317-2025-07-05",
      "headline": "Rishabh Pant calls Rohit Sharma 'bossy', Gautam Gambhir gives him reality checkIndia wicketkeeper batter Rishabh Pant recently called Rohit Sharma bossy, which sparked a hilarious response from head coach Gautam Gambhir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristano-ronaldo-missing-diogo-jota-funeral-portugal-captain-fans-angry-reaction-2751330-2025-07-05",
      "headline": "Ronaldo misses Diogo Jota's funeral? Fans left fuming at Portugal captainCristiano Ronaldo's reported absence from the funeral of his fellow Portuguese teammate, Diogo Jota has left fans fuming at the national team captain. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-fastest-youth-odi-century-india-u19-vs-england-u19-2751327-2025-07-05",
      "headline": "Vaibhav Suryavanshi scripts history again: Hits fastest 100 in Youth ODIs14-year-old Vaibhav Suryavanshi continues to stun the cricketing world, smashing a 52-ball century against England U19 to break the Youth ODI record — adding to his growing list of jaw-dropping achievements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-postpone-bangladesh-tour-to-2026-2751318-2025-07-05",
      "headline": "BCCI defers India's Bangladesh tour in August 2025 to September 2026The BCCI (Board of Control for Cricket in India) and the BCB (Bangladesh Cricket Board) have mutually agreed to postpone the white-ball series between Bangladesh and India to September 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-new-sports-policy-oci-players-strengthen-indian-football-team-kalyan-chaubey-2751310-2025-07-05",
      "headline": "Government's stance for OCI players a positive statement of intent: ChaubeyAIFF president Kalyan Chaubey welcomed the government's new policy allowing Indian-origin players abroad to represent India. This move aims to boost the national football team's performance amid existing legal and regulatory challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-announcement-diego-leon-transfer-paraguay-2751279-2025-07-05",
      "headline": "Manchester United announce signing of Paraguay left-back Diego LeonManchester United have announced their second transfer of the 2025-26 season. The club has brought in Diego Leon, the left-back from Paraguay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neeraj-chopra-classic-live-updates-bengaluru-2751262-2025-07-05",
      "headline": "Neeraj Chopra Classic Live: Bengaluru readies to host historic eventNeeraj Chopra Classic Live Updates: Bengaluru is hosting a historic event today, July 5. The Neeraj Chopra Classic, the first of its kind javelin event in India, is expected to garner a huge crowd today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-pat-cummins-stunning-one-handed-catch-keacy-carty-grenada-2751256-2025-07-05",
      "headline": "Watch: Cummins turns on the jets, pulls off insane one-handed catch vs WIThe Australian skipper pulled off an insane one-handed catch to dismiss West Indies' Keacy Carty in the ninth over of the second Test at St George's in Grenada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-6-live-score-results-jannik-sinner-novak-djokovic-2751250-2025-07-05",
      "headline": "Wimbledon Day 6 Live: Andreeva wins 1st set, Sinner vs Martinez up nextWimbledon Live Score, Day 6: All eyes return to Centre Court as Jannik Sinner and Novak Djokovic gear up for their third-round battles on Day 6, each aiming to punch their ticket to the Wimbledon 2025 fourth round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-4-updates-edgbaston-2751248-2025-07-05",
      "headline": "Day 4 Live: Pant, Gill put visitors in command at LunchEngland (ENG) vs India (IND), 2nd Test Day 4 Live Score and Updates: Shubman Gill and Rishabh Pant have taken India past the 350-run mark. Pant has been aggressive, putting the English bowlers under pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-announcement-diego-leon-transfer-paraguay-2751279-2025-07-05",
      "headline": "Manchester United announce signing of Paraguay left-back Diego LeonManchester United have announced their second transfer of the 2025-26 season. The club has brought in Diego Leon, the left-back from Paraguay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neeraj-chopra-classic-live-updates-bengaluru-2751262-2025-07-05",
      "headline": "Neeraj Chopra Classic Live: Bengaluru readies to host historic eventNeeraj Chopra Classic Live Updates: Bengaluru is hosting a historic event today, July 5. The Neeraj Chopra Classic, the first of its kind javelin event in India, is expected to garner a huge crowd today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-pat-cummins-stunning-one-handed-catch-keacy-carty-grenada-2751256-2025-07-05",
      "headline": "Watch: Cummins turns on the jets, pulls off insane one-handed catch vs WIThe Australian skipper pulled off an insane one-handed catch to dismiss West Indies' Keacy Carty in the ninth over of the second Test at St George's in Grenada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-6-live-score-results-jannik-sinner-novak-djokovic-2751250-2025-07-05",
      "headline": "Wimbledon Day 6 Live: Andreeva wins 1st set, Sinner vs Martinez up nextWimbledon Live Score, Day 6: All eyes return to Centre Court as Jannik Sinner and Novak Djokovic gear up for their third-round battles on Day 6, each aiming to punch their ticket to the Wimbledon 2025 fourth round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-4-updates-edgbaston-2751248-2025-07-05",
      "headline": "Day 4 Live: Pant, Gill put visitors in command at LunchEngland (ENG) vs India (IND), 2nd Test Day 4 Live Score and Updates: Shubman Gill and Rishabh Pant have taken India past the 350-run mark. Pant has been aggressive, putting the English bowlers under pressure. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}