{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/90-percent-lose-in-indian-real-estate-expert-explains-what-the-top-1-percent-do-instead-2745007-2025-06-23",
      "headline": "90% lose in real estate, expert explains what the top 1% do insteadA real estate advisor explains why the majority of buyers in India are not profiting from real estate, while a select few succeed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-511-points-lower-nifty-below-25000-it-stocks-down-hcl-infosys-2744997-2025-06-23",
      "headline": "Sensex ends 511 points lower, Nifty settles below 25,000; HCLTech down 2%The S&P BSE Sensex fell by 511.38 points to close at 81,896.79, while the NSE Nifty50 lost 140.50 points to end at 24,971.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/still-earning-275-percent-in-your-savings-account-here-is-a-smarter-option-invest-in-liquid-funds-2744937-2025-06-23",
      "headline": "Still earning 2.75% in your savings account? Here's a smarter optionLiquid funds serve as the middle ground between a savings account and fixed deposits, but with more flexibility and usually better returns. Over the past one and three years, liquid funds have delivered average annualised returns of 7.3% and 7%, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/3-ipos-upcoming-june-24-open-tuesday-check-details-price-band-allotment-gmp-kalpataru-ellenbarrie-globe-civil-2744984-2025-06-23",
      "headline": "3 IPOs to open tomorrow: Check details of Kalpataru, Ellenbarrie, Globe CivilThe combined size of these IPOs stands at over Rs 2,500 crore, and all three are expected to list on the stock exchanges on July 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/explained-why-millions-of-poor-indian-households-still-rely-on-moneylenders-2744922-2025-06-23",
      "headline": "Explained: Why many low-income Indian households still rely on moneylendersDespite rising financial access, millions of Indian households still rely on informal loans. Gaps in formal credit, especially for low-income and self-employed borrowers, keep moneylenders relevant and often unavoidable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-6-lakh-in-taxes-on-a-rs-13-lakh-car-ca-reveals-the-hidden-cost-2744873-2025-06-23",
      "headline": "Rs 6 lakh in taxes on a Rs 13 lakh car? CA reveals the hidden costUpgrading or buying a new car used to be a moment of joy for many middle-class families, but today, it's overshadowed by the heavy financial pressure it brings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/strait-of-hormuz-closure-iran-parliament-israel-us-attack-crude-oil-impact-price-rise-india-world-impact-2744885-2025-06-23",
      "headline": "Will Iran close Hormuz Strait? What it means for oil prices in India and worldThe Strait of Hormuz is a narrow waterway connecting the Persian Gulf with the Arabian Sea. It is one of the most important oil transport routes in the world. Nearly 20% of all global crude oil passes through this strait."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/debt-disguised-as-achievement-financial-analyst-on-growing-emi-trap-2744876-2025-06-23",
      "headline": "Debt disguised as achievement: Financial expert on India's deepening EMI trapA rising income shouldn't come at the cost of peace of mind. Financial freedom means having choices, not just things. And that starts with avoiding EMIs that quietly chip away at your future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-5-common-errors-in-pre-filled-forms-and-how-to-fix-it-2744833-2025-06-23",
      "headline": "Filing ITR? 5 common errors in pre-filled forms and how to fix itA pre-filled Income Tax Return (ITR) form is a partially completed form provided by the Income Tax Department to make filing easier for taxpayers. These forms are automatically filled with details taken from trusted sources such as your PAN, Aadhaar, Form 16, and bank data from Form 26AS and the AIS."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/explained-how-to-vacation-without-the-financial-hangover-2744803-2025-06-23",
      "headline": "Explained: How to vacation without the financial hangoverA dream vacation should leave you with great memories, not months of financial stress. With a little planning, you can enjoy the trip and return home without breaking your budget."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-markets-slide-after-us-iran-tensions-buy-the-dip-or-wait-it-out-2744790-2025-06-23",
      "headline": "Stock markets slide amid US-Iran tensions: Buy the dip or wait it out?The Nifty 50 fell 257.25 points to 24,855.15, and the BSE Sensex was down 863.78 points to 81,544.39 as of 9:49 am. Broader indices mirrored the decline, with both mid- and small-cap indices slipping sharply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-600-points-why-is-the-stock-market-down-falling-today-2744774-2025-06-23",
      "headline": "Sensex tumbles 700 points: Why is the stock market falling today?At around 9:19 am, the BSE Sensex was down 580 points, trading at 81,828.11, while the NSE Nifty50 fell over 175 points to 24,937.25. Broader market indices mirrored the slide, and volatility indicators jumped sharply, signalling a bumpy trading session ahead."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-interview-bollywood-south-indian-films-culture-globalisation-2744977-2025-06-23",
      "headline": "Pawan Kalyan: Bollywood chose commerce over culture, lost Indian rootsTelugu actor and Andhra Pradesh Deputy Chief Minister Pawan Kalyan recently spoke candidly about the differences between Bollywood and South Indian films in terms of how they represent culture, during a recent interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/srikanth-actor-arrested-in-drug-abuse-case-2745009-2025-06-23",
      "headline": "Tamil actor Srikanth arrested in drug abuse caseTamil actor Srikanth has been arrested on Monday in a drug abuse case. He is currently being questioned by the police for his alleged links with former AIADMK functionary, Prasad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/director-jeethu-joseph-confirms-drishyam-3-to-release-in-3-languages-with-same-plot-2744930-2025-06-23",
      "headline": "Director Jeethu Joseph confirms Drishyam 3 to release in 3 languages with same plotDirector Jeethu Joseph has confirmed that 'Drishyam 3', starring Mohanlal, will begin shooting in October and will have the same story across Malayalam, Hindi, and Telugu versions. The makers are also exploring the possibility of a simultaneous release in all three languages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-academic-honour-toronto-metropolitan-university-of-canada-2744940-2025-06-23",
      "headline": "From stage to syllabus: Canadian university introduces course on Diljit DosanjhToronto Metropolitan University of Canada is set to introduce a course on Punjabi singer Diljit Dosanjh. The course is expected to start in the fall of 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-deol-on-alleged-fake-box-office-collections-2744956-2025-06-23",
      "headline": "People enjoying lies: Sunny Deol on alleged fake box office collectionsSunny Deol criticised the film industry for promoting alleged fake box office numbers and bulk bookings to create false hype. He urged young actors to focus on real talent and storytelling instead of relying on manipulated figures for success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/the-feminist-soul-of-sitaare-zameen-par-can-a-mother-still-be-a-woman-2744979-2025-06-23",
      "headline": "The feminist soul of Sitaare Zameen Par: Can a mother still be a woman?In a world that reveres mothers but forgets the woman behind them, 'Sitaare Zameen Par' dares to ask uncomfortable questions. Skip reading if you are afraid of spoilers, but carry on if you want to read something worth reflecting on. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaideep-ahlawat-shares-he-turned-down-nitesh-tiwari-ramayana-vibhishana-role-ranbir-kapoor-2744886-2025-06-23",
      "headline": "Jaideep Ahlawat shares why he turned down Nitesh Tiwari's RamayanaActor Jaideep Ahlawat recently opened up on turning down Vibhishana's role in Nitesh Tiwari's 'Ramayana'. Ahlawat cited reasons behind his departure from the highly anticipated project. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/raj-and-dk-rakt-brahmand-the-bloody-kingdom-shooting-aditya-roy-kapur-smantha-ruth-prabhu-2744978-2025-06-23",
      "headline": "Raj and DK's Rakt Bramhand gears up for action-heavy outdoor schedule | ExclusiveRaj and DK are all set for the outdoor action schedule of their ambitious Netflix series, 'Rakt Bramhand: The Bloody Kingdom'. The fantasy drama stars Aditya Roy Kapur, Samantha Ruth Prabhu, and Ali Fazal and is directed by Rahi Anil Barve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-shares-note-regrets-missing-rekha-umrao-jaan-re-release-in-theatres-2744909-2025-06-23",
      "headline": "Priyanka Chopra shares note as she regrets missing Rekha's Umrao Jaan re-releasePriyanka Chopra shared a note and expressed her sadness over missing Rekha's 'Umrao Jaan' in theatres. The film will re-release in theatres on June 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dancer-actor-lauren-gottlieb-returns-to-work-flaunts-wedding-ring-at-airport-2744903-2025-06-23",
      "headline": "Dancer-actor Lauren Gottlieb returns to work, flaunts wedding ring at airportActor Lauren Gottlieb interacted with the paparazzi as she returned to work in Mumbai on Monday. She married her boyfriend, Tobias Jones, on June 11 in Italy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/enhypen-niki-deep-voice-controversy-2744917-2025-06-23",
      "headline": "ENHYPEN's Niki faces backlash for allegedly forcing deep voice in live performance K-pop band ENHYPEN's member Niki has been accused of imitating Stray Kids' Felix during a live performance. Here's what we know about the controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-amanda-bynes-i-am-going-on-ozempic-so-i-would-look-better-in-paparazzi-pics-2744939-2025-06-23",
      "headline": "Actor Amanda Bynes: I am going on Ozempic so I look better in paparazzi picsFormer child actor Amanda Bynes on Monday shared her decision to go on Ozempic on Instagram. She expressed that she wants to lose weight to look better in paparazzi pictures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-greets-waves-of-fans-in-viral-video-from-jailer-2-shooting-spot-2744890-2025-06-23",
      "headline": "Rajinikanth greets waves of fans in viral video from Jailer 2 shooting spot. WatchRajinikanth was greeted by thousands of fans during the shoot of 'Jailer 2' in Mysore, where he acknowledged the crowd with his signature gesture. The film, featuring a star-studded cast, is set for a grand release in Summer 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-film-body-to-send-directive-to-ban-diljit-dosanjh-sardaar-ji-3-producers-for-casting-pak-actor-2744926-2025-06-23",
      "headline": "Film body to ban Diljit Dosanjh for casting Pak actor Hania Amir in Sardaar Ji 3Diljit Dosanjh and Hania Aamir's film has landed in controversy. The film body is set to send a directive to ban the film's producers and Diljit himself for releasing a film featuring a Pakistani actor in the aftermath of the Pahalgam attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mahesh-babu-praises-aamir-khan-sitaare-zameen-par-2744921-2025-06-23",
      "headline": "Mahesh Babu praises Aamir Khan's Sitaare Zameen Par: Shines so bright and how!Telugu superstar Mahesh Babu showered praise on Aamir Khan's recent release, 'Sitaare Zameen Par' on social media. Directed by RS Prasanna, the spiritual sequel of 'Taare Zameen Par' was released in theatres on June 20.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/tommy-genesis-indian-origin-canadian-rapper-slammed-dressing-goddess-kali-true-blue-2744797-2025-06-23",
      "headline": "Who is Tommy Genesis? Indian-origin rapper slammed for dressing as Goddess KaliCanadian rapper Tommy Genesis, of Indian origin, sparked outrage for hurting Hindu and Christian religious beliefs with her new music video 'True Blue'. Her appearance as Goddess Kali drew criticism from devotees. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-restored-version-amitabh-bachchan-dharmendra-set-for-world-premiere-in-italy-this-friday-2744857-2025-06-23",
      "headline": "Sholay's restored version set for world premiere in Italy this FridayThe restored version of Amitabh Bachchan and Dharmendra-starrer 'Sholay' is set to have its world premiere at the annual Il Cinema Ritrovato Festival in Italy. The screening will take place in Bologna and will feature an uncut version of the film to commemorate its 50th anniversary."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/hailey-biber-denies-divorce-rumours-with-justin-bieber-shares-photos-in-wedding-ring-2744823-2025-06-23",
      "headline": "Hailey Bieber dismisses divorce rumours with Justin, shares pic in wedding ringPop star Justin Bieber and his wife, Hailey Bieber, have once again sparked divorce rumours. However, Hailey has addressed the speculation on social media. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/raftaar-criticises-tommy-genesis-true-blue-song-mockery-of-my-religion-2744845-2025-06-23",
      "headline": "Raftaar criticises Tommy Genesis's True Blue song: This is a mockery of my religionRapper Raftaar reported Canadian rapper Tommy Genesis's song True Blue on YouTube and urged his fans to do the same, stating that the track mocks his religion and should not exist."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-attacks-iran-underground-enrichment-site-at-fordow-again-state-television-reports-2744967-2025-06-23",
      "headline": "Israel attacks Iran's Fordow nuclear site day after US bombs facility: ReportIsrael carried out a fresh attack on Iran's underground Fordow nuclear site as it launched a fresh wave of strikes on Tehran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-launches-fresh-missile-attack-on-israel-after-will-end-war-warning-to-trump-blasts-heard-in-jerusalem-2744924-2025-06-23",
      "headline": "Iran fires fresh barrage of missiles at Israel, blasts heard over JerusalemA day after US strikes on Iran's nuclear sites, Tehran launched 15 ballistic missiles at Israel, triggering sirens across cities and marking a sharp escalation in the Middle East conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assembly-bypoll-result-2025-live-updates-bjp-aap-congress-bengal-gujarat-punjab-kerala-2744715-2025-06-23",
      "headline": "AAP wins big in Gujarat's Visavadar and Ludhiana, Trinamool retains KaliganjAssembly Bypoll Result 2025 Live Updates: The bypoll results gain significance ahead of the crucial West Bengal and Kerala assembly elections in 2026. The BJP, despite fielding candidates in all five bypolls, managed to only bag Gujarat's Kadi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-cricket-score-1st-test-day-4-leeds-updates-2744934-2025-06-23",
      "headline": "Day 4 Live: KL Rahul hits fifty, Pant living dangerouslyEngland (ENG) vs India (IND), 1st Test Day Live Score and Updates: Shubman Gill falls early on Day 4 to Brydon Carse. The India captain chops the ball on in the second over of the day. Rishabh Pant has come out to bat at No.5 and has the support of a set KL Rahul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gujarat-punjab-bypoll-aam-aadmi-party-aap-return-of-arvind-kejriwal-rajya-sabha-seat-2744994-2025-06-23",
      "headline": "Do Gujarat, Punjab bypoll victories mark explosive return of Arvind Kejriwal?After months in political hibernation following the AAP's Delhi drubbing, its national convenor, Arvind Kejriwal, seems poised for a mega-comeback after the bypoll victories in Punjab and Gujarat. AAP leaders have declared his return to national politics, with the buzz that he might get into the Rajya Sabha through Punjab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/let-down-by-russia-khamenei-writes-to-putin-for-backing-against-us-report-2745017-2025-06-23",
      "headline": "Let down by Russia, Khamenei writes to Putin for more support against US: ReportIran has not been impressed with Russia's support so far in the conflict with Israel and US. Iranian Foreign Minister Abbas Araghchi will deliver a letter from Khamenei to Putin, seeking more support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ayatollah-ali-khamenei-supreme-leader-iran-top-secret-force-moves-bunker-revolutionary-guard-israel-us-war-2744988-2025-06-23",
      "headline": "Khamenei being guarded by elite unit no one knew existedA top-secret elite unit is now guarding Iran's Supreme Leader Ayatollah Khamenei with even senior officials of his Revolutionary Guards unaware of its existence. The 86-year-old leader has suspended all electronic communication. Here's what we know about Khamenei's hiding place and his elite unit."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/saviour-to-satan-the-seeds-of-iran-us-hostility-part-1-2744915-2025-06-23",
      "headline": "Saviour to Satan: The seeds of Iran-US hostility | Part 1As recent escalations in Iran-US hostilities push the Middle East to the brink, this series revisits the turbulent Iran-US history. Part 1 explores the roots of animosity, from oil nationalisation to the CIA-orchestrated 1953 coup, shaping decades of distrust."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/health/story/salman-khan-reveals-brain-aneurysm-avm-trigeminal-neuralgia-health-struggle-2745004-2025-06-23",
      "headline": "Salman Khan reveals his struggle with rare brain and nerve conditionsActor Salman Khan revealed he is battling multiple rare brain and nerve conditions. His condition highlights the importance of awareness and stress management in health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-israel-conflict-live-updates-donald-trump-benjamin-netanyahu-nuclear-sites-air-strikes-in-tehran-tel-aviv-2744689-2025-06-23",
      "headline": "Live: Israel bombs Iranian Revolutionary Guards HQ, Evin prison; Iran hits backIran's media have claimed that the nuclear sites destroyed in Sunday's US bombings are presently being rebuilt by Iran's Atomic Energy Agency. Meanwhile, the US State Department has issued a Worldwide Caution alert, warning American citizens to exercise increased vigilance while travelling abroad. \r\n\r\nThe Israeli Defence Forces also stated that around 20 Israeli Air Force fighter jets carried out intelligence-based strikes using over 30 munitions across several locations in Iran, including Kermanshah, Hamedan, and Tehran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-film-body-to-send-directive-to-ban-diljit-dosanjh-sardaar-ji-3-producers-for-casting-pak-actor-2744926-2025-06-23",
      "headline": "Film body to ban Diljit Dosanjh for casting Pak actor Hania Amir in Sardaar Ji 3Diljit Dosanjh and Hania Aamir's film has landed in controversy. The film body is set to send a directive to ban the film's producers and Diljit himself for releasing a film featuring a Pakistani actor in the aftermath of the Pahalgam attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/monsoon-likely-to-hit-delhi-on-tuesday-imd-issues-yellow-alert-2745021-2025-06-23",
      "headline": "Monsoon likely to hit Delhi on Tuesday, IMD issues yellow alertThe IMD has forecast a generally cloudy sky over the next few days, with light to moderate rain, thunderstorms and lightning expected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/obstructive-sleep-apnea-india-health-risks-heart-disease-2744896-2025-06-23",
      "headline": "The common yet serious sleep disorder hiding behind loud snoresOver 104 million Indians suffer from obstructive sleep apnea, a common condition causing loud snores. This disorder has a serious impact on the heart and demands greater awareness and treatment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-strikes-6-iranian-military-airports-15-fighter-jets-and-helicopters-destroyed-2744869-2025-06-23",
      "headline": "Video: Moment Israel struck 6 Iran airfields, destroyed 15 jets and helicoptersThe IDF claimed that jets that were destroyed by their military were intended for use against their aircraft and to thwart Israel's attacks on Iranian territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/srikanth-actor-arrested-in-drug-abuse-case-2745009-2025-06-23",
      "headline": "Tamil actor Srikanth arrested in drug abuse caseTamil actor Srikanth has been arrested on Monday in a drug abuse case. He is currently being questioned by the police for his alleged links with former AIADMK functionary, Prasad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/10-year-old-child-killed-as-crude-bomb-explodes-during-counting-of-votes-in-bengals-kaliganj-2744991-2025-06-23",
      "headline": "Child, 10, killed in crude bomb explosion during vote count in Bengal's KaliganjA 10-year-old child was killed after a crude bomb exploded while counting of votes was underway for bypolls in Bengal's Kaliganj on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/the-science-behind-bleached-underwear-its-not-your-laundry-detergent-2744954-2025-06-23",
      "headline": "The science behind bleached underwear: It's not your laundry detergentIt's not your detergent or poor laundry skills, it's your vagina's natural chemistry leaving its mark, literally."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-strikes-iran-b2-bombers-nuclear-sites-trump-israel-middle-east-coflict-tehran-2744848-2025-06-23",
      "headline": "Some B-2 bombers went West, real attackers flew East: US decoy plan to bomb IranIn a covert strike named \"Midnight Hammer\", the US used B-2 stealth bombers and a Pacific-bound decoy to mask an 18-hour mission eastward that struck three major Iranian nuclear sites."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-trainee-pilot-accuses-three-colleagues-of-casteist-abuse-says-they-called-him-chamar-bhangi-2744831-2025-06-23",
      "headline": "Not fit to fly, go stitch slippers: Trainee IndiGo pilot alleges casteist abuseBased on the complaint filed by the victim, Sharan Kumar's father, Ashok Kumar, a case was registered under the Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act against the three accused.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/tesla-finally-launches-driverless-robotaxi-rides-after-a-decade-of-elon-musk-hype-full-story-in-5-points-2744828-2025-06-23",
      "headline": "Tesla launches Robotaxi after decade of Elon Musk hype: Full story in 5 pointsTesla has begun offering fully driverless rides in Austin, Texas, marking a major milestone after over ten years of Elon Musk's promises. But many challenges still lie ahead. Read ahead for the full story in 5 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/the-feminist-soul-of-sitaare-zameen-par-can-a-mother-still-be-a-woman-2744979-2025-06-23",
      "headline": "The feminist soul of Sitaare Zameen Par: Can a mother still be a woman?In a world that reveres mothers but forgets the woman behind them, 'Sitaare Zameen Par' dares to ask uncomfortable questions. Skip reading if you are afraid of spoilers, but carry on if you want to read something worth reflecting on. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-warns-trump-of-heavy-consequences-after-us-nuclear-strikes-2744933-2025-06-23",
      "headline": "We will end this war: Iran's fresh threat to 'gambler Trump' after US strikesIran and Israel traded air and missile strikes as the world braced for Tehran's response to the US attack on its nuclear sites over the weekend, which Trump suggested could lead to the overthrow of the Iranian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/beyond-the-ivy-dream-dubais-growing-pull-on-indian-students-2744993-2025-06-23",
      "headline": "Beyond the Ivy dream: Dubai's growing pull on Indian students\r\nThe changes are intended to manage migration flows, but they also raise concerns for families investing in expensive international degrees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/new-zealand-religious-leader-brian-tamaki-destroys-buddhist-sikh-hindu-islamic-palestinian-flags-performs-haka-auckland-2744923-2025-06-23",
      "headline": "New Zealand radical leader destroys Hindu, Buddhist, Sikh flags, performs hakaIn a controversial protest led by fundamentalist religious leader Brian Tamaki, protesters in New Zealand's Auckland desecrated flags representing non-Christian religions. The flags, which included Hindu, Islamic, Palestinian, Buddhist, and Sikh symbols, were torn and stomped on, followed by haka performances after each act. Tamaki also targeted immigrant communities, claiming Sikhs \"no longer employ Kiwis\" and called for a policy of \"no immigration without assimilation\"."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-cricket-score-1st-test-day-4-leeds-updates-2744934-2025-06-23",
      "headline": "Day 4 Live: KL Rahul hits fifty, Pant living dangerouslyEngland (ENG) vs India (IND), 1st Test Day Live Score and Updates: Shubman Gill falls early on Day 4 to Brydon Carse. The India captain chops the ball on in the second over of the day. Rishabh Pant has come out to bat at No.5 and has the support of a set KL Rahul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-seeks-noc-from-mumbai-cricket-association-to-switch-state-team-2744920-2025-06-23",
      "headline": "Prithvi Shaw seeks NOC from Mumbai Cricket Association to switch state teamsPrithvi Shaw has approached the Mumbai Cricket Association (MCA) for a No Objection Certificate (NOC) to switch state teams ahead of the upcoming domestic season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-emotional-varun-chakravarthy-dindigul-dragons-last-ball-win-tnpl-2744900-2025-06-23",
      "headline": "R Ashwin emotional after Varun Chakravarthy seals last-ball win in TNPLTNPL 2025: Dindigul Dragons captain R. Ashwin was emotional in the dugout as Varun Chakravarthy smashed a six and a four off the final two balls to seal a thrilling win over Salem Spartans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/josh-hazlewood-defends-ipl-preparation-after-mitchell-johnson-criticism-2744856-2025-06-23",
      "headline": "IPL over Australia? Hazlewood responds to Mitchell Johnson's criticismJosh Hazlewood has responded to Mitchell Johnson's criticism after Australia's WTC final loss. He explained that playing the IPL was the best preparation possible before the Test final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-travis-head-backs-marnus-labuschagne-test-squad-exclusion-2744810-2025-06-23",
      "headline": "Marnus Labuschagne will be back soon: Head defends dropped Australia batterTravis Head has shown strong support for Marnus Labuschagne following his exclusion from Australia's Test squad. The Australian team looks to rebuild with new talent as the World Test Championship cycle begins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-kl-rahul-batting-leeds-test-2744820-2025-06-23",
      "headline": "KL Rahul is India's best Test batter, but needs to convert starts: PujaraKL Rahul has to convert starts into big scores, says Cheteshwar Pujara. Rahul has got starts in both innings and would hope to capitalise on the same on Day 4 of the 1st Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-kohinoor-dinesh-karthik-5-wicket-haul-leeds-2744791-2025-06-23",
      "headline": "Bumrah as valuable as Kohinoor: Karthik praises pacer after Leeds heroicsFormer India cricketer Dinesh Karthik couldn't hide his admiration for Jasprit Bumrah, describing him as, valuable as the Kohinoor diamond\" while pointing out that the Indian pacer holds the best bowling average (19.33) among all 86 bowlers in Test history with 200 or more wickets.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-jasprit-bumrah-injury-update-2744772-2025-06-23",
      "headline": "Aided by cold England weather, Bumrah hints at playing more than 3 TestsEngland vs India: Jasprit Bumrah has indicated he might play more than 3 Tests in England as he feels fresh in cold conditions. His availability will be invaluable in overseas conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/club-world-cup-real-madrid-manchester-city-juventus-advance-knockout-2744770-2025-06-23",
      "headline": "Real Madrid beat Pachua despite early red, Manchester City and Juventus advanceTen-man Real Madrid showed their depth and resilience, while Manchester City delivered a ruthless attacking display, as both European giants secured key victories in the Club World Cup group stage on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karun-nair-coach-exclusive-comeback-story-india-vs-england-test-series-2744744-2025-06-23",
      "headline": "Karun Nair comeback story: One more chance, 3006 days laterIndia tour of England: Karun Nair returned to the Test side after 3006 days, earning a place in Shubman Gill's new-look India. After a record-breaking triple century in 2016, he had vanished from the team without a goodbye. But he never gave up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-kl-rahul-batting-leeds-test-2744820-2025-06-23",
      "headline": "KL Rahul is India's best Test batter, but needs to convert starts: PujaraKL Rahul has to convert starts into big scores, says Cheteshwar Pujara. Rahul has got starts in both innings and would hope to capitalise on the same on Day 4 of the 1st Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-kohinoor-dinesh-karthik-5-wicket-haul-leeds-2744791-2025-06-23",
      "headline": "Bumrah as valuable as Kohinoor: Karthik praises pacer after Leeds heroicsFormer India cricketer Dinesh Karthik couldn't hide his admiration for Jasprit Bumrah, describing him as, valuable as the Kohinoor diamond\" while pointing out that the Indian pacer holds the best bowling average (19.33) among all 86 bowlers in Test history with 200 or more wickets.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-jasprit-bumrah-injury-update-2744772-2025-06-23",
      "headline": "Aided by cold England weather, Bumrah hints at playing more than 3 TestsEngland vs India: Jasprit Bumrah has indicated he might play more than 3 Tests in England as he feels fresh in cold conditions. His availability will be invaluable in overseas conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/club-world-cup-real-madrid-manchester-city-juventus-advance-knockout-2744770-2025-06-23",
      "headline": "Real Madrid beat Pachua despite early red, Manchester City and Juventus advanceTen-man Real Madrid showed their depth and resilience, while Manchester City delivered a ruthless attacking display, as both European giants secured key victories in the Club World Cup group stage on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karun-nair-coach-exclusive-comeback-story-india-vs-england-test-series-2744744-2025-06-23",
      "headline": "Karun Nair comeback story: One more chance, 3006 days laterIndia tour of England: Karun Nair returned to the Test side after 3006 days, earning a place in Shubman Gill's new-look India. After a record-breaking triple century in 2016, he had vanished from the team without a goodbye. But he never gave up."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}