{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-world-most-valued-company-ai-boom-chipmaking-apple-microsoft-2750330-2025-07-03",
      "headline": "Nvidia to become world's most valued company ever with $3.9 trillion market capNvidia is set to become the most valuable company ever, reaching a $3.92 trillion market cap amid soaring AI demand. Its dominance in AI chipmaking has fuelled rapid growth, outpacing rivals like Apple and Microsoft.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-appoints-former-niti-aayog-ceo-amitabh-kant-as-non-executive-director-2750310-2025-07-03",
      "headline": "IndiGo appoints former NITI Aayog CEO Amitabh Kant as non-executive directorIndiGo has appointed former NITI Aayog CEO Amitabh Kant as a Non-Executive Director on its board, pending regulatory and shareholder approvals. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-bars-foreclosure-charges-on-floating-rate-loans-to-micro-small-businesses-2750292-2025-07-03",
      "headline": "RBI bars foreclosure charges on floating rate loans to micro, small businessesAccording to the new rules, no prepayment charges will be allowed on floating rate loans to MSEs or to individuals borrowing for business purposes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-poverty-income-inequality-ppp-mmrp-who-is-poor-world-bank-niti-aayog-2750057-2025-07-03",
      "headline": "How poor is 'poor' in India?Millions of Indians have exited extreme poverty, yet many still live one crisis away from hunger, debt, or despair. In this deep dive, we examine why poverty is retreating in numbers, but not in reality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-files-confidential-papers-for-ipo-to-raise-rs-4250-crore-report-2750174-2025-07-03",
      "headline": "Meesho files confidential papers for IPO to raise Rs 4,250 crore: ReportMeesho is a well-known player in India's booming e-commerce space, taking on giants like Amazon and Flipkart, with big global investors such as Prosus, Elevation Capital, WestBridge Capital, SoftBank, and Peak XV Partners backing it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-settles-170-points-lower-nifty-below-25500-maruti-down-1-percent-2750131-2025-07-03",
      "headline": "Sensex settles 170 points lower, Nifty below 25,500; Maruti down 1%The S&P BSE Sensex was down by 170.22 points to end at 83,239.47, while the NSE Nifty50 fell by 48,10 points to close at 25,405.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/investing-mutual-fund-sip-regular-checks-money-management-portfolio-review-2750107-2025-07-03",
      "headline": "Don't set and forget: Why your SIPs need regular check-upsWhile the idea of 'set it and forget it' may seem peaceful, doing so could lead to long-term underperformance, missed opportunities, or even a shortfall in your retirement goals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-founder-and-ceo-nithin-kamath-cautions-investors-against-risks-in-unlisted-shares-2750088-2025-07-03",
      "headline": "Zerodha's Nithin Kamath cautions investors against risks in unlisted sharesNithin Kamath said that many people get carried away by the hype around buying shares of companies before they go public. But in reality, unlisted shares are risky and can leave investors stuck without a way to sell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/crude-oil-wti-brent-forecast-middle-east-tension-iran-israel-conflict-sp-global-2750084-2025-07-03",
      "headline": "Has the oil market grown numb to conflict in the Middle East?Global oil demand growth in 2025 is on track to be just 870,000 barrels per day. This would make it the weakest year for oil demand since 2001, except during major economic disruptions like the 2008 financial crisis and the COVID-19 pandemic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-income-inequality-now-worse-than-british-era-says-financial-analyst-2750041-2025-07-03",
      "headline": "India's income inequality now worse than British era, says financial analystThe divide between India's rich and poor is bigger than ever, with almost half the people surviving on very little, while a privileged few hold most of the wealth, says Hardik Joshi, a financial analyst."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-ceo-sashidhar-jagdishan-moves-supreme-court-against-lilavati-hospital-fir-2749997-2025-07-03",
      "headline": "HDFC Bank CEO moves Supreme Court against Lilavati Hospital FIRThe clash between one of India's largest private banks and a big Mumbai hospital is linked to a financial transaction, but the exact details of the FIR or the amount involved were not shared in court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lost-your-itr-login-here-is-how-to-file-income-tax-using-net-banking-2749970-2025-07-03",
      "headline": "Lost your ITR login? Here's how to file income tax using net bankingIf you can't remember your Income Tax portal password, you don't need to reset it straight away. Most major banks in India allow you to access the e-Filing portal through their net banking services. It's a safe and easy way to file your return on time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nestle-axis-bank-dividend-stock-ex-date-share-price-stock-market-july-3-2749960-2025-07-03",
      "headline": "Axis Bank, Nestle India set dividend record dates; last day to buy shares todayNestle India and Axis Bank have fixed July 4 as the record date, which will decide who is eligible to receive the dividend payouts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-pulls-out-chinese-staff-from-plants-south-india-iphone-production-takes-hit-report-2749935-2025-07-03",
      "headline": "The quiet Chinese game to disrupt iPhone production in IndiaThe latest model, the iPhone 17, was to be a huge step in Apple's plans to make India its second home for high-end production. That roadmap now looks uncertain as Foxconn has pulled out Chinese staff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-soham-parekh-the-indian-techie-accused-of-moonlighting-in-us-2749908-2025-07-03",
      "headline": "Who is Soham Parekh, Indian techie who worked at 4-5 US startups at same time?Soham Parekh, who is believed to be based in India, is alleged to have simultaneously worked at up to four or five startups—many of them backed by Y Combinator—raising questions about hiring practices in remote-first tech culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-157-points-higher-nifty-above-25500-eternal-up-2-percent-2749901-2025-07-03",
      "headline": "Sensex, Nifty struggle for direction as markets await India-US deal newsThe S&P BSE Sensex was down by 13.01 points to 83,396.68, while the NSE Nifty50 lost 3.70 points to 25,449.70 as of 9:29 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-expectation-sensex-nifty-trading-setup-bse-nse-us-vietnam-trade-deal-china-2749878-2025-07-03",
      "headline": "Will Sensex, Nifty open higher amid US–Vietnam trade deal impact?Gift Nifty futures were trading at 25,584 points at 8:18 am, suggesting an increase from the previous close of 25,574.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-july-3-nse-bse-trading-nykaa-rvnl-nestle-yes-bank-dmart-pnb-2749874-2025-07-03",
      "headline": "Stocks to watch on July 3: Nykaa, RVNL, Nestle, Yes Bank, Dmart, PNBInvestors are now watching company announcements for the April–June quarter results, while developments related to a possible trade deal between India and the United States are also being closely followed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retiring-without-children-here-is-how-to-plan-for-a-comfortable-and-secure-future-2749583-2025-07-02",
      "headline": "Retiring without children? Here's how to plan for a comfortable and secure futureToday, more and more Indians are choosing to remain child-free or find themselves without direct heirs for various reasons. For them, retirement planning isn't just about saving money and building a corpus, it's about securing comfort, care, dignity, and independence in their golden years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-288-points-lower-nifty-settles-below-25-500-tata-steel-down-4-percent-2749530-2025-07-02",
      "headline": "Sensex ends 288 points lower, Nifty settles below 25, 500; Tata Steel down 4%The S&P BSE Sensex was down 287.60 points to end at 83,409.69, while the NSE Nifty50 lost 88.40 points to end at 25,453.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/need-your-uan-heres-how-to-get-it-and-manage-your-pf-smoothly-2749480-2025-07-02",
      "headline": "Need your UAN? Here's how to get it and manage your PF smoothlyThe biggest advantage of a UAN is its permanence. It doesn't change when you change jobs. It ties together all your PF accounts, making fund tracking and management simple and paperless."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/57-percent-of-indians-call-skills-critical-but-skill-frameworks-still-lag-report-2749444-2025-07-02",
      "headline": "57% of Indians call skills critical, but relevant frameworks still lag: ReportAon's 2025 APAC Skills Impact Survey reveals what really matters for Indian firms today. It reveals that for the next two to three years, Indian firms are prioritising talent retention, leadership pipelines, and workforce agility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-expert-explains-how-rs-7-lakh-profit-led-to-a-rs-74000-shock-for-investor-2749447-2025-07-02",
      "headline": "Investor earns Rs 7 lakh, faces Rs 74,000 tax despite Rs 12 lakh limit. Know whySujit Bangar, founder of TaxBuddy.com and a former IRS officer, shared the example on LinkedIn to warn investors against a common misconception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-finance-epfo-pf-account-balance-check-regularly-company-deposit-kyc-issue-money-savings-2749438-2025-07-02",
      "headline": "Don't ignore your EPF: Here's why checking it regularly mattersExperts warn that many salaried employees don't realise until it's too late that their employer hasn't been depositing funds, or that a simple KYC error has locked their money away."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-holidays-july-2025-here-is-what-traders-should-know-nse-bse-holiday-list-2749379-2025-07-02",
      "headline": "Stock market holidays July 2025: Here's what traders should knowBefore you plan your next trade or check your stocks, it helps to know if the market is open. Here's a quick look at whether the NSE and BSE will have any holidays this July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/major-gst-relief-on-cards-as-government-considers-lowering-tax-rate-on-common-household-items-sources-2749359-2025-07-02",
      "headline": "Ghee, soap and snacks to get cheaper? Big GST cut likely, say sourcesSources say the government is weighing a major rejig of GST slabs that could bring down the tax burden on everyday essentials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/wanting-to-switch-between-old-and-new-tax-regime-here-is-how-to-do-it-while-filing-itr-2749351-2025-07-02",
      "headline": "Wanting to switch tax regime? Here's how to do it while filing ITRIf you're a salaried employee with no business or professional income, you have the flexibility to choose the tax regime every year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdb-financial-share-price-listing-premium-13-percent-rs-835-bse-nse-hold-sell-buy-expert-view-2749322-2025-07-02",
      "headline": "HDB Financial lists at 13% premium: Should you book profit or hold?HDB Financial share price: The stock opened at Rs 835 on both the NSE and BSE, compared to its IPO price of Rs 740 per share. This was better than what the grey market had expected, which had estimated a gain of around 8% to 10% on listing day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sbi-classifies-reliance-communications-loan-account-as-fraud-2749309-2025-07-02",
      "headline": "SBI classifies Reliance Communications loan account as 'fraud'In a stock exchange filing, Reliance Communications stated that SBI has decided in connection with credit facilities dating back to August 2016. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdb-financial-share-price-market-debut-13-percent-premium-nse-bse-emkay-global-rating-2749304-2025-07-02",
      "headline": "HDB Financial shares make strong debut with 13% premium on stock marketHDB Financial shares listed at a premium of 13%. The stock made its debut at Rs 835 on both the NSE and BSE, marking a 12.84% gain (Rs 95) over the issue price of Rs 740."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-allows-cab-aggregators-to-double-peak-hour-fares-under-new-guidelines-2749292-2025-07-02",
      "headline": "Ola, Uber get government okay for surge pricing, can charge double the base fareStates have been advised to implement the updated guidelines within the next three months. The revised fare structure is aimed at giving platforms flexibility during high-demand periods, while maintaining an overall regulatory framework for pricing and operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-200-points-higher-nifty-above-25600-infosys-up-2-percent-us-india-trade-deal-it-shares-2749287-2025-07-02",
      "headline": "Sensex, Nifty open higher as IT stocks rally on hopes of US-India trade dealThe S&P BSE Sensex was up 103.13 points to 83,800.42, while the NSE Nifty50 added 21 points to 25,562.80 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdb-financials-listing-share-price-gmp-signals-premium-market-debut-emkay-global-coverage-buy-rating-2749278-2025-07-02",
      "headline": "HDB Financials listing: GMP signals premium on market debut. Check hereThe company's shares will be listed on both the BSE and NSE. HDB Financial Services is a subsidiary of HDFC Bank and its IPO closed on June 27 with nearly 27 times the subscription."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-today-us-india-trade-deal-trading-setup-nse-bse-2749266-2025-07-02",
      "headline": "Stock market opening: Sensex, Nifty to rally over US-India trade deal?Gift Nifty futures, which are seen as an early indicator for Indian market openings, traded at 25,686.50 points at 8:24 am. This suggests that the Nifty 50 index could open higher than its previous closing level of 25,541.8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-july-2-nse-bse-trading-hal-hyundai-maruti-suzuki-ril-rites-v-mart-2749258-2025-07-02",
      "headline": "Stocks to watch on July 2: HAL, Hyundai, Maruti Suzuki, RIL, RITES, V-MartHero MotoCorp reported a year-on-year rise in total sales by 10% to 5.54 lakh units in June, compared to 5.03 lakh units last year. Domestic sales rose by 6.9% to 5.25 lakh units. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-market-july-usd-24-billion-lg-hdb-reason-bse-nse-trading-upcoming-public-listings-2749017-2025-07-01",
      "headline": "July turns hot for IPOs as firms race to raise $2.4 billionFirms are gearing up to raise around $2.4 billion through initial public offerings (IPOs) in July. If this target is reached, it will mark the strongest IPO month since December 2023, following a solid $2 billion raised in June. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-pact-deadlock-over-tariffs-as-negotiations-continue-2748943-2025-07-01",
      "headline": "India-US trade pact: Deadlock over tariffs as negotiations continueIndia and the US are yet to reach an agreement on their trade pact, with tariffs being a major point of contention. India is pushing for zero tariffs in certain sectors, while the US wants to maintain a 10% tariff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-91-points-higher-nifty-above-25500-ril-bel-up-2-percent-2748968-2025-07-01",
      "headline": "Sensex closes 91 points higher, Nifty above 25,500; RIL up 2%The S&P BSE Sensex was up 90.83 points to end at 83,697.29, while the NSE Nifty50 added 24.75 points to close at 25,541.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-to-tatkal-trains-aadhar-credit-card-july-1-money-changes-that-matter-to-you-itr-deadline-2748932-2025-07-01",
      "headline": "From tax to tatkal trains: July 1 money changes that matter to youThe CBDT has extended the last date for filing Income Tax Returns (ITR) for salaried individuals. Instead of July 31, the new deadline is now September 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-may-finalise-interim-trade-deal-with-us-this-week-report-2748838-2025-07-01",
      "headline": "India may finalise interim trade deal with US this week: ReportBoth sides are racing to complete the deal before July 9, when the US is set to impose a 26% reciprocal tariff on Indian goods. These tariffs were first announced by President Donald Trump in April and temporarily suspended for 90 days."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/michael-madsen-star-of-reservoir-dogs-and-kill-bill-dies-at-66-glbs-2750440-2025-07-04",
      "headline": "Michael Madsen, star of 'Reservoir Dogs' and 'Kill Bill', dies at 66Michael Madsen, star of Reservoir Dogs and Kill Bill, has died at 66 from suspected cardiac arrest. Known for intense roles, he leaves behind a rich legacy of over 300 screen credits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uppu-kappurambu-movie-review-keerthy-suresh-suhas-quirky-comedy-flaws-2750334-2025-07-04",
      "headline": "Uppu Kappurambu review: Keerthy Suresh, Suhas's quirky comedy works despite flawsRelease Date:Fri Jul 04, 2025Uppu Kappurambu movie review: Director Ani IV Sasi's 'Uppu Kappurambu', starring Keerthy Suresh and Suhas, is a quirky comedy set in a fictional village. A bizarre drama soon turns into a communal issue in this effective film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/will-never-be-forgotten-shefali-jariwalas-husband-parag-tyagis-heartfelt-note-2750333-2025-07-03",
      "headline": "Will never be forgotten: Shefali Jariwala's husband Parag Tyagi shares moving noteParag Tyagi shared a picture of Shefali Jariwala along with a heartfelt note on Instagram, remembering her selflessness and how she always put 'others first'. The 'Kaanta Laga' fame actor died on June 27 after suffering a cardiac arrrest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-reflects-on-25-years-of-kaun-banega-crorepati-recalls-first-broadcast-2750312-2025-07-03",
      "headline": "Amitabh Bachchan reflects on 25 years of KBC, recalls first broadcastAmitabh Bachchan celebrated 25 years of Kaun Banega Crorepati, remembering the show's debut on July 3, 2000, while preparing for the new season. He shared an emotional post saying, \"Didn't even realise, and 25 years just went by.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aamir-khan-rocks-rugged-avatar-as-dahaa-in-rajinikanth-coolie-first-look-out-2750308-2025-07-03",
      "headline": "Aamir Khan rocks rugged look as Dahaa in Rajinikanth's Coolie, first look outAamir Khan's first look as Dahaa from Rajinikanth's upcoming film 'Coolie' was unveiled. The actor was seen in a rugged, pipe-smoking avatar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amar-upadhyay-on-kyunki-saas-kabhi-bahu-thi-craze-mobbed-at-taj-got-marriage-proposal-2750298-2025-07-03",
      "headline": "Amar Upadhyay on Kyunki...craze: Mobbed at Taj Mahal, got marriage proposalsActor Amar Upadhyay recently got candid about his popularity after 'Kyunki Saas Bhi Kabhi Bahu Thi.' He shared how his character became a household name after the show aired in 2000. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-helps-priyanka-chopra-untie-her-hair-fans-call-him-green-forest-2750299-2025-07-03",
      "headline": "Nick Jonas helps Priyanka Chopra untie her hair, fans call him green forestActor Priyanka Chopra shared a video on Thursday in which her singer-husband Nick Jonas can be seen helping her untie her hair. Looking at the video, several fans called him a green flag. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakondas-kingdom-release-postponed-again-new-date-to-be-announced-soon-2750265-2025-07-03",
      "headline": "Vijay Deverakonda's Kingdom release postponed again, new date to be announced soonA new release date for actor Vijay Deverakona's much-anticipated film 'Kingdom' will be announced soon. Film producer Naga Vamsi shared the latest update on his social media account. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/paranthu-po-ram-mirchi-shiva-grace-antony-charming-family-film-joy-in-life-simple-things-2750270-2025-07-03",
      "headline": "Paranthu Po review: Charming family film teaches joy in life's simple thingsRelease Date:Fri Jul 04, 2025Paranthu Po movie review: Director Ram's 'Paranthu Po', starring Mirchi Shiva, Grace Antony and Mithul, is a profound story about self-discovery when you are busy running the city life. Without being too preachy, the film hits all the right notes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/is-the-traitors-seducing-new-india-through-deception-and-manipulation-karan-johar-apoorva-mukhija-purav-jha-2750079-2025-07-03",
      "headline": "Is The Traitors seducing new India through deception and manipulation?'The Traitors', which has already been renewed for the second season, celebrates lying and deception. Ahead of its finale tonight (July 3), here's decoding why the reality TV show is gaining popularity in India and its implications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/harshali-malhotra-bajrangi-bhaijaan-munni-to-make-a-south-debut-with-akhanda-2-2750167-2025-07-03",
      "headline": "Bajrangi Bhaijaan's Harshali Malhotra to make South film debut with Akhanda 2Harshali Malhotra, known as Munni from 'Bajrangi Bhaijaan', is making her South debut with 'Akhanda 2' alongside Nandamuri Balakrishna. She introduced her new role, Janani, through an Instagram post, marking her return to films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-first-glimpse-reactions-alia-bhatt-karan-johar-and-sargun-mehta-share-excitement-2750141-2025-07-03",
      "headline": "Ramayana 1st glimpse: Alia Bhatt, KJo and Sargun Mehta share their excitementSeveral celebrities, including Alia Bhatt, Karan Johar and Sargun Mehta reacted to the first glimpse of the much-anticipated film 'Ramayana'. The film is slated for a theatrical release on Diwali 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-turns-25-smriti-irani-amar-upadhayay-ektaa-kapoor-get-nostalgic-2750205-2025-07-03",
      "headline": "Kyunki...turns 25: Smriti Irani, Amar Upadhayay, Ektaa Kapoor get nostalgic'Kyunki Saas Bhi Kabhi Bahu Thi' completed its 25-year run on July 3. On the special occasion, the cast, including Smriti Irani, Amar Upadhyay and Ektaa Kapoor shared their journey on the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-enjoy-strolling-on-london-streets-watch-viral-video-2750175-2025-07-03",
      "headline": "Anushka Sharma, Virat Kohli enjoy strolling on London streets. Watch viral videoA video of Anushka Sharma and Virat Kohli strolling on the London streets has emerged online. The two are currently holidaying in the UK. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/deepika-padukone-paid-for-hollywood-walk-of-fame-star-all-you-need-to-know-about-the-process-2750128-2025-07-03",
      "headline": "Do actors pay for Hollywood Walk of Fame star? All about the processAfter the announcement of Deepika Padukone's latest Walk of Fame selection, many wonder about the process behind the recognition and whether celebs have to pay for it. Here's everything you need to know about it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fatima-sana-shaikh-says-she-almost-didnt-audition-for-dangal-2750078-2025-07-03",
      "headline": "Exclusive: Fatima Sana Shaikh says she almost didn't audition for DangalFatima Sana Shaikh almost didn't audition for her breakthrough role in 'Dangal'. Her persistence and love for auditions continue to drive her career forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-first-glimpse-review-with-ranbir-kapoor-yash-nitesh-tiwari-feels-like-a-moment-for-indian-cinema-2750117-2025-07-03",
      "headline": "Why Ranbir Kapoor-Yash's Ramayana feels like a moment for Indian cinemaNitesh Tiwari's 'Ramayana' is a cinematic moment shaped by faith, scale, and storytelling ambition. With Ranbir Kapoor, Sai Pallavi, Yash, and Sunny Deol leading a power-packed cast, the film dares to honour the epic as more than mythology. The first glimpse feels less like a teaser and more like the beginning of something historic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-turns-25-when-people-fell-at-ekta-kapoor-feet-cried-over-mihir-death-smriti-irani-2750111-2025-07-03",
      "headline": "Kyunki… turns 25: When people fell at Ekta Kapoor's feet, cried over Mihir's death'Kyunki Saas Bhi Kabhi Bahu Thi', the iconic Indian television show that redefined the small screen 25 years ago, is all set for a grand comeback with a new season. On the note, its creative director, Nivedita Basu, spoke to us discussing its relevance, craze and BTS moments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-clash-with-aamir-khan-dil-hai-ke-manta-nahin-shoot-2750080-2025-07-03",
      "headline": "Anupam Kher recalls clash with Aamir Khan during Dil Hai Ke Manta Nahin shootAnupam Kher recalled a past disagreement with Aamir Khan during the shoot of 'Dil Hai Ke Manta Nahin', where Aamir criticised his scene interpretation. The actor shared the story while promoting his upcoming film 'Metro... In Dino', releasing on 4 July 2025."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trumps-one-big-beautiful-bill-clears-us-congress-in-major-win-for-president-2750428-2025-07-04",
      "headline": "Trump's 'One Big Beautiful Bill' clears US Congress in major win for PresidentThe US Congress passed Trump's USD 4.5 trillion 'Big Beautiful Bill,' a major second-term win, delivering tax cuts and funding key priorities, despite internal GOP divisions and united Democratic opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bharatiya-janta-party-national-woman-president-deadlock-nirmala-sitharaman-rss-2750293-2025-07-03",
      "headline": "Amid deadlock over new chief, BJP may get first woman presidentThe BJP is likely to appoint a woman as its next national president, with leaders like Nirmala Sitharaman, D Purandeswari, and Vanathi Srinivasan being top contenders. The move, backed by the RSS, would mark a historic first for the party.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/gukesh-beats-magnus-carlsen-twice-leads-superunited-rapid-blitz-croatia-2750415-2025-07-03",
      "headline": "D Gukesh defeats Magnus Carlsen days after explosive comment from World No. 1Indian chess prodigy D Gukesh delivered another stunning performance, defeating World No.1 Magnus Carlsen with the Black pieces in the sixth round of the Grand Chess Tour's SuperUnited Rapid in Zagreb—just days after the Norwegian labelled him \"one of the presumably weaker players\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-calls-trinidad-and-tobago-pm-kamla-persad-bissessar-bihar-ki-beti-2750475-2025-07-04",
      "headline": "Bihar ki beti: PM Modi hails Trinidad & Tobago PM's Indian rootsDuring his Trinidad and Tobago visit, PM Modi called PM Kamla Persad-Bissessar \"Bihar ki Beti\" and talks about her Buxar roots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-gautam-gambhir-advice-edgbaston-2750429-2025-07-04",
      "headline": "Hang in there: Gill reveals Gambhir advice after record-breaking 269India captain Shubman Gill revealed the advice he got from Gautam Gambhir after scoring a record-breaking 269 against England on Day 2 of the Edgbaston Test. Gill broke many records on his way to the score as India posted 587 in the first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/families-say-air-india-forced-financial-disclosures-for-ahmedabad-crash-claims-2750453-2025-07-04",
      "headline": "Families say Air India forced financial disclosures for Ahmedabad crash claimsAir India has been accused of coercing AI 171 crash victims' families during the compensation process. However, the airline has denied charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/zohran-mamdani-marked-asian-and-african-american-on-college-application-report-glbs-2750470-2025-07-04",
      "headline": "Zohran Mamdani marked Asian and African American on college application: ReportMayoral frontrunner Zohran Mamdani listed himself as \"Asian\" and \"Black\" on a 2009 Columbia application, citing limited options to reflect his Indian-Ugandan heritage, according to a New York Times report.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tatkal-ticket-racket-sell-aadhaar-card-railway-announcement-unauthorised-ticketing-platforms-user-data-2750362-2025-07-03",
      "headline": "Tatkal in 60 seconds: Telegram racket sell Aadhaar IDs after railway announcementUnauthorised ticketing platforms claim to book Tatkal tickets in 60 seconds using bots and Aadhaar-verified IRCTC accounts, risking user data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aamir-khan-rocks-rugged-avatar-as-dahaa-in-rajinikanth-coolie-first-look-out-2750308-2025-07-03",
      "headline": "Aamir Khan rocks rugged look as Dahaa in Rajinikanth's Coolie, first look outAamir Khan's first look as Dahaa from Rajinikanth's upcoming film 'Coolie' was unveiled. The actor was seen in a rugged, pipe-smoking avatar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jack-draper-marin-cilic-jannik-sinner-iga-swiatek-wimbledon-2750442-2025-07-04",
      "headline": "Day 4 wrap: Iga Swiatek fights back to reach Round 3, Cilic stuns DraperWimbledon 2025: Jack Draper failed to go through to the third round after losing to Marin Cilic. Jannik Sinner and Iga Swiatek secured their berths in the next rounds with wins over Aleksander Vukic and Caty McNally. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-officially-recognises-taliban-government-first-country-to-do-so-glbs-2750439-2025-07-04",
      "headline": "Russia officially recognises Taliban government, first country to do soRussia became the first nation to formally recognise the Taliban government. Taliban leaders referred to it as a major milestone. Photos shared by TASS showed that the Taliban's white flag was raised at the Afghan embassy in Moscow."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-origin-man-chokes-co-passenger-mid-flight-frontier-airlines-arrested-upon-landing-miami-us-2750326-2025-07-03",
      "headline": "Indian-origin man chokes co-passenger mid-flight, arrested upon landing in USThe 21-year-old Indian-origin man was involved in a mid-air brawl with another passenger. He was arrested upon landing at Miami airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/lalit-modi-vijay-mallya-viral-video-singing-together-lavish-london-party-2750466-2025-07-04",
      "headline": "Viral video shows Lalit Modi, Vijay Mallya singing together at lavish London partyLalit Modi and Vijay Mallya sing \"I Did It My Way\" at a grand London party, drawing attention for flaunting wealth despite ongoing investigations in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-arrives-trinidad-and-tobago-pm-bissessar-welcomes-him-in-indian-attpmire-2750448-2025-07-04",
      "headline": "PM Modi to receive Trinidad and Tobago's highest honour on historic 2-day visitUpon arrival in Trinidad and Tobago, Prime Minister Narendra Modi was greeted by Kamla Persad-Bissessar, who wore Indian attire for the occasion, along with her entire cabinet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/watch-putin-apologises-and-leaves-event-says-its-awkward-to-keep-trump-waiting-glbs-2750444-2025-07-04",
      "headline": "Watch: Putin cuts short event, says Trump 'could get offended' if kept waitingRussian President Vladimir Putin abruptly left a public forum to take a phone call from US President Donald Trump, saying it would be rude to keep Trump waiting. During the call, Putin said Russia wants peace in Ukraine but won't give up its goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/who-is-hakeem-jeffries-democrats-8-hour-speech-delays-trumps-tax-bill-vote-glbs-2750452-2025-07-04",
      "headline": "Who is Hakeem Jeffries? Democrat's 8-hour speech delays Trump's tax bill voteHouse Democratic leader Hakeem Jeffries delivered a historic 8-hour, 46-minute speech protesting Trump's USD 3.4 trillion tax and spending bill, delaying its passage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/babasaheb-bhimrao-ambedkar-university-bihar-awards-extra-marks-student-controversy-muzaffarpur-2750385-2025-07-04",
      "headline": "Bihar university awards student 257 marks out of 100, but denies promotionBabasaheb Bhimrao Ambedkar University in Bihar sparked outrage after awarding a student 257 marks out of 100 in a post-graduate exam, yet not promoting her. Over 100 students' results remain pending due to internal marking issues.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/indians-clearly-unhappy-at-work-latest-survey-says-2749481-2025-07-02",
      "headline": "Indians clearly unhappy at work: Latest survey says...Nine out of 10 employees are confident about their skill sets but only six have job satisfaction, indicates the Global Talent Barometer 2025 survey conducted pan-India"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/from-1776-to-2025-us-prepares-for-250th-independence-anniversary-glbs-2750456-2025-07-04",
      "headline": "From 1776 to 2025: US prepares for 250th Independence anniversaryThe US celebrates 249 years of independence on July 4, 2025, with nationwide festivities. Plans are underway for a major celebration in 2026, marking 250 years since the Declaration of Independence.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/democratic-newsroom/video/is-indias-pakistan-policy-inconsistent-democratic-newsroom-debates-2750303-2025-07-03",
      "headline": "Is India's Pakistan policy inconsistent? Democratic Newsroom debatesThe latest episode of Democratic Newsroom delves into India's Pakistan policy after the Pahalgam terror attack in Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-talks-agriculture-dairy-sector-donald-trump-explain-bilateral-trade-gm-crops-subsidy-explained-2749828-2025-07-03",
      "headline": "The thick red line: Why India shouldn't agree with US on agriThe India-US trade deal is reportedly stuck because of DC's tough demands on the agriculture and dairy sectors. India shouldn't give in to Donald Trump's demands because agriculture is hugely subsidised in the US, with farmers there getting over $61,000 against India's $282. If concessions are to be made, it should be by the US, and not India. Here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/had-only-30-seconds-to-react-dialed-trump-pak-pms-aide-on-indias-brahmos-attack-2750319-2025-07-03",
      "headline": "Had only 30 seconds to react: Pak PM's aide on India's BrahMos attackRana Sanaullah, special assistant to Pakistan's Prime Minister Shehbaz Sharif, said in a recent interview that the launch of a BrahMos cruise missile during India's \"Operation Sindoor\" left Pakistan's defence apparatus scrambling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-leader-jagannath-pradhan-arrested-in-connection-with-assault-on-odisha-bureaucrat-2750399-2025-07-03",
      "headline": "BJP leader Jagannath Pradhan arrested in connection with assault on Odisha bureaucratBJP leader Jagannath Pradhan has been arrested in connection with the Odisha bureaucrat assault case. Earlier, a video of the assault had gone viral online which showed Sahoo being manhandled by a group of men."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/newly-married-woman-gets-her-husband-killed-arrested-maharashtra-aurangabad-2750192-2025-07-03",
      "headline": "Blinded by love for uncle, newly married woman gets her husband killed, 3 arrestedBlinded by love for her uncle, a woman in Aurangabad plotted her husband's murder just 45 days after their marriage. Police arrested three, including wife Goonja Singh, who confessed to the conspiracy."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jack-draper-marin-cilic-jannik-sinner-iga-swiatek-wimbledon-2750442-2025-07-04",
      "headline": "Day 4 wrap: Iga Swiatek fights back to reach Round 3, Cilic stuns DraperWimbledon 2025: Jack Draper failed to go through to the third round after losing to Marin Cilic. Jannik Sinner and Iga Swiatek secured their berths in the next rounds with wins over Aleksander Vukic and Caty McNally. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-gautam-gambhir-advice-edgbaston-2750429-2025-07-04",
      "headline": "Hang in there: Gill reveals Gambhir advice after record-breaking 269India captain Shubman Gill revealed the advice he got from Gautam Gambhir after scoring a record-breaking 269 against England on Day 2 of the Edgbaston Test. Gill broke many records on his way to the score as India posted 587 in the first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/gukesh-beats-magnus-carlsen-twice-leads-superunited-rapid-blitz-croatia-2750415-2025-07-03",
      "headline": "D Gukesh defeats Magnus Carlsen days after explosive comment from World No. 1Indian chess prodigy D Gukesh delivered another stunning performance, defeating World No.1 Magnus Carlsen with the Black pieces in the sixth round of the Grand Chess Tour's SuperUnited Rapid in Zagreb—just days after the Norwegian labelled him \"one of the presumably weaker players\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-average-michael-vaughan-prediction-2750398-2025-07-03",
      "headline": "Gill will average 45 by end of series: Vaughan's India captain predictionMichael Vaughan has predicted that Shubman Gill will end up averaging 45 by the end of the series against England. Gill scored a brilliant 269 against England on Day 2 of the Edgbaston Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-day-2-report-shubman-gill-akash-deep-siraj-2750397-2025-07-03",
      "headline": "Majestic Shubman Gill, pacers hand Bazball its sternest test on Day 2England vs India, 2nd Test: India's pacers Akash Deep and Mohammed Siraj reduced England to 77 for 3 after the visitors posted a commanding 587 in their first innings, thanks to skipper Shubman Gill's record-breaking 269 on day two of the second Test at Edgbaston."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-records-stats-2nd-test-2750374-2025-07-03",
      "headline": "Shubman Gill achieves historic milestones with 269: Stat PackENG vs IND: Shubman Gill broke several records as he scored 269 runs off 387 balls in the first innings of the second Test at the Edgbaston in Birmingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-participation-in-india-dilip-tirkey-reaction-2750370-2025-07-03",
      "headline": "Dilip Tirkey on Pakistan getting nod for tournaments in India: Good for hockeyHockey India president Dilip Tirkey has welcomed the call to allow the Pakistan teams to participate in the multi-nation tournaments in India. The call was reportedly made on Thursday, July 3 to allow Pakistan to participate in Asia Cup and Junior World Cup in India this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-hockey-awaits-government-clearance-asia-cup-junior-world-cup-india-2750360-2025-07-03",
      "headline": "Pakistan awaits government nod for Asia Cup and Junior World Cup hockey in IndiaSenior officials from the Pakistan Sports Board (PSB) and the Pakistan Hockey Federation (PHF) have stated that they are still awaiting government clearance to participate in two major hockey events scheduled to take place in India later this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/novak-djokovic-mirra-andreeva-alex-de-minaur-wimbledon-2750332-2025-07-03",
      "headline": "Novak Djokovic reaches special 99, Andreeva, de Minaur advanceWimbledon 2025: Novak Djokovic racked up his 99th win at SW19 after beating Dan Evans in straight sets on Centre Court. Mirra Andreeva, Alex de Minaur and Elena Rybakina also qualified for the third round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-nc-classic-bengaluru-javelin-event-press-conference-more-events-2750324-2025-07-03",
      "headline": "Neeraj Chopra plans addition of more athletic events to NC Classic in futureOlympic champion Neeraj Chopra on Thursday confirmed that the Neeraj Chopra Classic could feature additional events in the coming years. The inaugural edition of the World Athletics Gold-status meet, currently limited to the javelin throw, is set to take place at the Sree Kanteerava Stadium in Bengaluru on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-yashasvi-jaiswal-joe-root-bond-kumar-sangakkara-edgbaston-2750316-2025-07-03",
      "headline": "Joeswal at RR: Sangakkara on how Joe Root mentored Yashasvi JaiswalKumar Sangakkara revealed the close bond Yashasvi Jaiswal shared with Joe Root during their time together at Rajasthan Royals. Jaiswal and Root were teammates at RR during the IPL 2023 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-participation-in-india-dilip-tirkey-reaction-2750370-2025-07-03",
      "headline": "Dilip Tirkey on Pakistan getting nod for tournaments in India: Good for hockeyHockey India president Dilip Tirkey has welcomed the call to allow the Pakistan teams to participate in the multi-nation tournaments in India. The call was reportedly made on Thursday, July 3 to allow Pakistan to participate in Asia Cup and Junior World Cup in India this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-hockey-awaits-government-clearance-asia-cup-junior-world-cup-india-2750360-2025-07-03",
      "headline": "Pakistan awaits government nod for Asia Cup and Junior World Cup hockey in IndiaSenior officials from the Pakistan Sports Board (PSB) and the Pakistan Hockey Federation (PHF) have stated that they are still awaiting government clearance to participate in two major hockey events scheduled to take place in India later this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/novak-djokovic-mirra-andreeva-alex-de-minaur-wimbledon-2750332-2025-07-03",
      "headline": "Novak Djokovic reaches special 99, Andreeva, de Minaur advanceWimbledon 2025: Novak Djokovic racked up his 99th win at SW19 after beating Dan Evans in straight sets on Centre Court. Mirra Andreeva, Alex de Minaur and Elena Rybakina also qualified for the third round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-nc-classic-bengaluru-javelin-event-press-conference-more-events-2750324-2025-07-03",
      "headline": "Neeraj Chopra plans addition of more athletic events to NC Classic in futureOlympic champion Neeraj Chopra on Thursday confirmed that the Neeraj Chopra Classic could feature additional events in the coming years. The inaugural edition of the World Athletics Gold-status meet, currently limited to the javelin throw, is set to take place at the Sree Kanteerava Stadium in Bengaluru on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-yashasvi-jaiswal-joe-root-bond-kumar-sangakkara-edgbaston-2750316-2025-07-03",
      "headline": "Joeswal at RR: Sangakkara on how Joe Root mentored Yashasvi JaiswalKumar Sangakkara revealed the close bond Yashasvi Jaiswal shared with Joe Root during their time together at Rajasthan Royals. Jaiswal and Root were teammates at RR during the IPL 2023 season. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}