{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-infra-says-ed-has-attached-assets-under-pmla-clarifies-anil-ambani-not-on-board-since-35-years-2812902-2025-11-03",
      "headline": "ED has attached assets under PMLA, Anil Ambani not on board: Reliance InfraThe clarification follows the ED's latest attachment of over 132 acres of land at Dhirubhai Ambani Knowledge City in Navi Mumbai, worth Rs 4,462 crore, in a bank fraud case involving Reliance Communications and related firms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/adani-power-bangladesh-opt-for-arbitration-to-settle-payment-dispute-report-2812852-2025-11-03",
      "headline": "Adani Power, Bangladesh opt for arbitration to settle payment dispute: ReportAdani Power stressed that it continues to meet its contractual obligation to supply electricity to Bangladesh and is receiving regular payments to the extent acknowledged by Bangladesh Power Development Board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/luxury-in-2026-why-financial-peace-is-the-ultimate-status-symbol-explains-ca-2812804-2025-11-03",
      "headline": "Luxury in 2026: Why financial peace is the ultimate status symbol, explains CALuxury isn't loud any more. In 2026, it's quiet, calm, and deeply personal. As one CA puts it, the ultimate status symbol is not a luxury car or a holiday abroad — it's the peace that comes from financial stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-october-rally-flat-auto-it-fmcg-shares-mahindra-maruti-itc-tcs-2812658-2025-11-03",
      "headline": "Sensex, Nifty take a breather after October's strong rally as markets end flatThe S&P BSE Sensex gained 39.78 points to close at 83,978.49, while the NSE Nifty50 added 41.25 points to end at 25,763.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-vs-groww-which-ipo-is-better-more-profit-details-review-latest-gmp-listing-gains-2812643-2025-11-03",
      "headline": "Lenskart vs Groww: Which IPO offers better value for investors? Lenskart offers exposure to India's growing eyewear market backed by a strong offline and online presence, while Groww provides access to the country's booming retail investment ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-loan-vs-credit-card-emi-which-option-saves-you-more-money-cost-effective-interest-on-credit-card-emi-2812602-2025-11-03",
      "headline": "Personal loan vs credit card EMI: Which option saves you more money?Managing expenses through instalments can be convenient, but it's important to know what you're signing up for. Should you go for a personal loan or a credit card EMI when you need quick funds? Let's find out which one benefits your pocket more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/renting-vs-buying-the-real-question-is-liquidity-vs-liability-says-expert-2812564-2025-11-03",
      "headline": "Renting vs buying? The real question is liquidity vs liability, says expertIs it smarter to rent or buy a home? An expert says that's not the question to ask. He believes the real issue lies in whether you're building liquidity or adding liability through your financial choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/looking-for-steady-returns-check-which-bank-giving-up-to-765-percent-on-3-year-fds-2812525-2025-11-03",
      "headline": "Looking for steady returns? Check who's giving up to 7.65% on 3-year FDsIf you're aiming for safe yet rewarding investments, 3-year fixed deposits are worth a look. Several banks are offering interest rates of up to 7.65%, giving savers a solid balance of security and returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-launches-employee-enrolment-scheme-2025-how-it-benefits-employers-and-workers-pension-scheme-2812498-2025-11-03",
      "headline": "EPFO launches Employee Enrolment Scheme 2025: How it benefits workersIn a move to strengthen the formal workforce, the government has rolled out the Employee Enrolment Scheme 2025 under the EPFO. The scheme aims to benefit workers by ensuring PF coverage and long-term financial security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-trusts-row-ratan-tata-sisters-emotions-family-not-cloud-business-decision-judgement-report-2812482-2025-11-03",
      "headline": "Amid Tata Trusts row, Ratan Tata's sisters recall his unwavering judgementRatan Tata died on October 9, 2024, at the age of 86. Though he never married, he maintained close relationships with his siblings, brother Jimmy Tata, half-brother Noel Tata, and half-sisters Shireen and Deanna Jejeebhoy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-triple-investment-usd-788-million-rare-earth-magnet-cut-china-reliance-report-2812463-2025-11-03",
      "headline": "India triples rare earth magnet investment to cut China reliance: ReportThe new plan represents a major step up from the earlier $290 million initiative, which was focused on ensuring supplies of essential materials for electric vehicles, renewable energy, and defence sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/mehli-mistry-sets-stage-for-legal-battle-with-caveat-after-ouster-move-at-tata-trusts-board-2812454-2025-11-03",
      "headline": "Mehli Mistry sets stage for legal battle after removal from Tata Trusts boardMehli Mistry's caveat sets up a hearing where questions of process, past resolutions, and trust deed interpretation will decide if the non-renewal stands or triggers a deeper inquiry in the coming weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-low-tariff-trade-deal-must-for-economic-growth-2812437-2025-11-03",
      "headline": "Why India needs a low-tariff trade deal with the US nowA trade pact with the US can expand exports and create millions of jobs, but only if India tackles agriculture and labour reforms. The opportunity is real, and the moment demands resolve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-open-in-red-private-banking-shares-pull-markets-down-2812435-2025-11-03",
      "headline": "Sensex, Nifty open in red as private lenders pull markets downThe S&P BSE Sensex was down by 252.57 points to 83,686.14, while the NSE Nifty50 was down by 50.40 points to 25,671.70 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-silver-prices-today-precious-metal-rates-down-why-prices-are-falling-2812426-2025-11-03",
      "headline": "Gold prices drop again: What's dragging precious metal rates downOn the Multi Commodity Exchange (MCX) in India, gold futures maturing on December 5, 2025, were trading at Rs 1,21,284 per 10 grams, down by Rs 224 or 0.18%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/mid-segment-housing-is-it-the-real-core-of-indias-property-boom-real-estate-home-buyers-2812112-2025-11-02",
      "headline": "Mid-segment housing: Is it the real core of India's property boom?After years of luxury-led projects, India's real estate developers are refocusing on the mid-segment — a market driven by young professionals, dual-income families, and first-time buyers. But is this segment truly the backbone of India's property boom?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-bankim-brahmbhatt-indian-origin-ceo-blackrock-loan-fraud-united-states-2811790-2025-11-01",
      "headline": "The 'missing' Indian-origin CEO behind Rs 4,200 crore BlackRock loan fraudBankim Brahmbhatt, the Indian-origin CEO of a US-based telecom company, is facing a lawsuit in the US filed by HPS, the private credit investment arm of BlackRock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-shine-again-after-slow-start-will-they-continue-to-rise-2811504-2025-11-01",
      "headline": "Gold and silver shine again after slow start. Will they continue to rise?After a dull opening, both gold and silver managed to regain some shine during the day. Will the upward trend continue?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cbi-links-anil-ambani-rana-kapoor-in-rs-2796-crore-yes-bank-loss-case-2811693-2025-11-01",
      "headline": "CBI links Anil Ambani, Rana Kapoor in Rs 2,796-crore Yes Bank loss caseThe CBI has accused industrialist Anil Ambani of approving favours to Yes Bank founder Rana Kapoor's family, causing huge financial losses to the bank. This development highlights alleged corruption and risky investments linked to Ambani's companies.\r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-thanja-vuur-praises-india-slams-south-africa-for-ignoring-womens-cricket-2812909-2025-11-03",
      "headline": "Actor Thanja Vuur praises India, slams South Africa for ignoring women's cricket South African actor Thanja Vuur has criticised her country's cricket legends and fans for ignoring the ICC Women's World Cup 2025 final. She contrasted it with the strong support shown by Indians for their own team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonakshi-sinha-recalls-zaheer-iqbal-asking-if-she-wanted-to-live-apart-from-her-in-laws-2812881-2025-11-03",
      "headline": "Sonakshi recalls Zaheer asking if she wanted to live apart from her in-laws Sonakshi Sinha recently opened up about her decision to live with her in-laws after her marriage to Zaheer Iqbal. She also shared insights into her married life and her close bond with the family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/milind-soman-pre-birthday-bash-diving-in-maldives-ankita-konwar-2812834-2025-11-03",
      "headline": "Milind Soman's thrilling pre-birthday bash: Diving in Maldives Actor Milind Soman offered a look at his pre-birthday celebrations in the Maldives on Monday. His latest social media post featured underwater exploration alongside his wife, Ankita Konwar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/anthony-hopkins-rejects-autism-claims-by-wife-calls-mental-health-labels-nonsense-2812828-2025-11-03",
      "headline": "Anthony Hopkins rejects autism claims by wife, calls mental health labels nonsense Actor Anthony Hopkins has dismissed suggestions of autism raised by his wife. He described mental health labels as nonsense and embraces the complexity of being human."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-gets-emotional-over-tribute-from-satish-kaushik-daughter-2812865-2025-11-03",
      "headline": "Anupam Kher gets emotional over tribute from Satish Kaushik's daughter. Video Anupam Kher got emotional after receiving a heartfelt tribute from his late friend Satish Kaushik's daughter, Vanshika, thanking her for her loving words. The actor shared that Satish would be proud, adding that he will always be there for Vanshika as a guiding presence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prakash-raj-criticises-national-film-awards-they-dont-deserve-mammootty-kerala-state-film-awards-2812851-2025-11-03",
      "headline": "Prakash Raj criticises National Awards, says they don't deserve Mammootty Kerala State Film Awards chairperson and actor Prakash Raj on Monday expressed concerns regarding Mammootty's lack of national recognition. He questioned the integrity of the National Awards process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-town-taemin-yedam-onewe-de-2812839-2025-11-03",
      "headline": "K-Town 3.0: Taemin's electrifying debut alongside Yedam, OneWe and D&E While the highlight of K-Town Festival India in its third edition was Taemin, veteran performers Donghae and Eunhyuk, and the K-pop group OneWe, also sizzled"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ankita-lokhande-remembers-late-father-on-his-birthday-shares-ai-video-tribute-2812832-2025-11-03",
      "headline": "Ankita Lokhande remembers late father on his birthday, shares AI video tribute Ankita Lokhande paid tribute to her late father on his birthday by sharing an emotional AI-generated video of him on Instagram. The actor wrote a heartfelt note, saying he continues to live on in their hearts, memories, and everything they do."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-king-to-be-set-in-two-different-timelines-2812816-2025-11-03",
      "headline": "Exclusive: Shah Rukh Khan's King to be set in two different timelines. Details Shah Rukh Khan's upcoming film 'King' is set to feature him in two distinct timelines. The film also marks Suhana Khan's big-screen debut, adding excitement around the movie. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parinda-completes-36-years-anil-kapoor-gets-nostalgic-shares-throwback-pics-2812797-2025-11-03",
      "headline": "Parinda completes 36 years: Anil Kapoor gets nostalgic, shares throwback pics Actor Anil Kapoor marked the 36th anniversary of 'Parinda' by sharing throwback photos. He also expressed that his grandson Vayu will hopefully watch the film soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tu-meri-main-tera-main-tera-tu-meri-christmas-release-day-moved-up-december-25-2812778-2025-11-03",
      "headline": "Kartik Aaryan, Ananya Panday's Tu Meri Main Tera release preponed to Christmas Day 'Tu Meri Main Tera Main Tera Tu Meri', the upcoming romantic drama featuring Kartik Aaryan and Ananya Panday is set for a Christmas Day release, moving up from its initially scheduled date. Directed by Sameer Vidwans, the film also stars Jackie Shroff and Neena Gupta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/godzilla-minus-zero-godzilla-minus-one-sequel-confirmed-with-new-title-2812766-2025-11-03",
      "headline": "Godzilla Minus Zero: Godzilla Minus One sequel confirmed with new title 'Godzilla Minus Zero' has been announced as the sequel to the acclaimed 'Godzilla Minus One'. The film reunites the Oscar-winning creative team, promising a thrilling continuation of the kaiju saga."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyami-kher-celebrates-indias-womens-odi-world-cup-win-with-an-emotional-note-2812742-2025-11-03",
      "headline": "Saiyami Kher celebrates India's Women's ODI World Cup win with an emotional note Saiyami Kher shared an emotional note after India's women's cricket team won their first-ever ODI World Cup, calling it a victory for every girl who dared to dream. The actor and former cricketer reflected on her own journey in the sport, saying the moment felt like life had come full circle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/maarigallu-review-engaging-yet-uneven-mystical-drama-with-shades-of-kantara-2812661-2025-11-03",
      "headline": "Maarigallu review: Engaging yet uneven mystical drama with shades of KantaraRelease Date:Fri Oct 31, 2025 The recent Kannada web series by PRK Productions and Zee5, 'Maarigallu' is a rural folklore thriller that touches upon aspects of culture, divinity and human vices, all surrounding a hunt for Kadamba treasure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tere-ishk-mein-usey-kehna-is-dhanush-kriti-sanon-heartache-anthem-2812654-2025-11-03",
      "headline": "Tere Ishk Mein: Usey Kehna is Dhanush, Kriti Sanon's heartache anthem. Watch here The new emotional song from Dhanush, Kriti Sanon's 'Tere Ishk Mein' released on November 3, 2025. The track depicts the emotional narrative of the film's premise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sweta-keswani-hollywood-auditions-social-media-casting-challenges-2812677-2025-11-03",
      "headline": "Sweta Keswani: Even Hollywood casting process based on social media following now Actor Sweta Keswani reveals her journey adapting to Hollywood's audition process. She also discusses how social media following influences casting in India and the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/the-first-ride-rules-korea-box-office-kpop-demon-hunters-sing-along-in-4th-place-2812657-2025-11-03",
      "headline": "First Ride rules Korea box office, KPop Demon Hunters sing along in 4th place South Korea's box office saw significant movement this weekend with the debut of road-trip comedy 'The First Ride' claiming the top spot, while animated and horror films from Japan maintained strong performances. Industry data shows the top ten films collectively grossed $4.5 million, reflecting changing audience interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-honoured-first-rk-laxman-award-excellence-pune-ceremony-2812679-2025-11-03",
      "headline": "Aamir Khan to be honoured with first-ever RK Laxman Award in Pune Aamir Khan has been named the first recipient of the RK Laxman Award for Excellence. The award, announced by the RK Laxman family, will be presented at a ceremony in Pune on November 23, 2025, featuring a live concert by composer AR Rahman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-state-film-awards-2024-mammootty-wins-best-actor-manjummel-boys-best-film-2812674-2025-11-03",
      "headline": "Kerala State Awards: Mammootty wins Best Actor, Manjummel Boys is Best Film The 55th Kerala State Film Awards announced Mammootty as Best Actor and 'Manjummel Boys' as Best Film. The awards highlight emerging talents and notable performances in Malayalam cinema."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/accused-truck-driver-had-an-altercation-with-car-owner-minutes-before-jaipur-rampage-that-killed-19-police-2812875-2025-11-03",
      "headline": "Jaipur trucker had argument with car driver minutes before deadly crash: CopsPolice said the drunk Jaipur truck driver, who killed 19 people and injured dozens, had argued with a car driver minutes before the crash, and enraged by the altercation, went on a reckless rampage. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-china-conducting-nuclear-tests-claims-us-president-donald-trump-2812547-2025-11-03",
      "headline": "Pakistan, China testing nuclear weapons, says Trump. Concern for India?US President Donald Trump has said that Pakistan and China, apart from Russia and North Korea, are testing nuclear weapons. This is of concern for India as it faces two nuclear-armed rivals on two fronts. Trump made the revelation in a CBS news interview, justifying his order to US forces to test nuclear weapons."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-crash-survivor-viswashkumar-ramesh-struggles-loss-ptsd-family-impact-2812552-2025-11-03",
      "headline": "Lost and broken, not talking to family: Lone Air India crash survivor's anguishViswashkumar Ramesh, the only survivor of the Air India crash that killed 241 people in June, described himself as the \"luckiest man\" alive, but stressed he has been unable to communicate with his family after the tragedy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/amazon-fires-employees-with-these-two-early-morning-text-messages-2812466-2025-11-03",
      "headline": "Amazon fires employees with these two early morning text messagesIn a move that caught many off guard, Amazon employees woke up to text messages informing them that their roles had been eliminated. Here is everything you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-donald-trump-nuclear-test-race-will-india-participate-hydrogen-bomb-thermonuclear-weapon-pakistan-china-2811856-2025-11-03",
      "headline": "Has Trump created a big nuclear opportunity for India?Will US President Donald Trump's orders to the US military to test nuclear weapons after a 33-year gap restart a nuclear test race? What is the status of India's nuclear weapons stockpile and does India need to participate in such a race?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-afghanistan-war-news-peace-talk-munir-pak-army-bypass-shehbaz-sharif-govt-creating-troubles-afghanistan-2812534-2025-11-03",
      "headline": "Pak army bypassing Sharif govt, creating friction with Kabul at US' behest?A startling revelation by Afghanistan's Taliban official suggests that the Asim Munir-led Pakistan Army might be pulling the strings, bypassing PM Shehbaz Sharif's civilian government to foment tensions with Kabul. This revelation follows claims that US drones were attacking Afghanistan using Pakistani soil."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-techie-kills-manager-dumbbells-light-switch-fight-chilli-powder-thrown-2812603-2025-11-03",
      "headline": "Chilli powder thrown, hit with dumbbell: Bengaluru techie kills manager over lightsA workplace argument over switching off lights turned deadly in Bengaluru when a 24-year-old man from Vijayawada killed his 41-year-old manager with a dumbbell and later surrendered to police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-infra-says-ed-has-attached-assets-under-pmla-clarifies-anil-ambani-not-on-board-since-35-years-2812902-2025-11-03",
      "headline": "ED has attached assets under PMLA, Anil Ambani not on board: Reliance InfraThe clarification follows the ED's latest attachment of over 132 acres of land at Dhirubhai Ambani Knowledge City in Navi Mumbai, worth Rs 4,462 crore, in a bank fraud case involving Reliance Communications and related firms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-animal-violence-maid-kills-dog-inside-lift-cctv-absconding-bns-2812646-2025-11-03",
      "headline": "Shocking CCTV: Bengaluru domestic help seen throwing dog on lift floor, pet diesA domestic help in Bengaluru allegedly killed a pet dog named Goofy after CCTV footage showed her throwing it inside a lift. The owner filed a complaint, and police have booked the absconding accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/vreels-a-game-changing-platform-pushing-social-media-beyond-tiktok-and-instagram-2811738-2025-11-01",
      "headline": "Vreels: A Game-Changing Platform Pushing Social Media Beyond TikTok and InstagramVreels isn't just about sharing, it's about connecting meaningfully. Through built-in chat, voice, and video call features, users can communicate without leaving the app."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-origin-adarsh-hiremath-surya-midhabecome-world-youngest-self-made-billionaires-22-zuckerberg-mercor-2812554-2025-11-03",
      "headline": "Indian-origin school friends become world's youngest self-made billionaires at 22At 22, Indian-origin school friends Adarsh Hiremath and Surya Midha, along with Brendan Foody, became the world's youngest self-made billionaires after their AI recruiting startup Mercor raised $350 million, valuing the company at $10 billion. They surpassed Meta CEO Mark Zuckerberg, who became a billionaire at 23, as the youngest billionaires."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/10-killed-40-injured-as-dumper-truck-driver-rams-vehicles-in-drunken-rampage-in-jaipur-2812619-2025-11-03",
      "headline": "19 dead as drunk truck driver drags vehicles for 5 km in Jaipur, PM condoles deathsEyewitnesses said the driver, suspected to be drunk, kept speeding for nearly five kilometres, ramming cars and motorcycles on Jaipur's Lohamandi Road. He has been taken into police custody. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-harmanpreet-kaur-amol-muzumdar-touches-feet-guru-shishya-viral-photo-2812460-2025-11-03",
      "headline": "Guru-Shishya: Harmanpreet touches coach Amol Muzumdar's feet after World Cup winWomen's World Cup: India captain Harmanpreet Kaur touching coach Amol Muzumdar's feet after their World Cup glory became a defining image of respect and gratitude between the two, The duo guided India to their first-ever Women's ODI World Cup triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-department-of-labor-restarts-h1b-perm-application-processing-green-card-holders-government-shutdown-indians-in-america-2812780-2025-11-03",
      "headline": "US Department of Labor restarts H‑1B application processingThe US Department of Labor has reopened its FLAG system, resuming H‑1B Labor Condition Applications (LCAs) and Program Electronic Review Management (PERM) labour certification submissions after a temporary shutdown caused by a funding lapse. Employers can now file new applications and track existing ones through the fully operational online portal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dmk-moves-supreme-court-against-sir-in-tamil-nadu-says-it-could-arbitrarily-remove-lakhs-from-voter-rolls-2812829-2025-11-03",
      "headline": "Could arbitrarily remove lakhs from voter rolls: DMK moves top court against SIRChief Minister M K Stalin has accused the Election Commission of attempting to remove \"true voters\" ahead of the polls, calling the exercise a political ploy similar to what he claimed was done in Bihar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/3-in-4-indian-student-visa-applications-to-canada-rejected-in-august-2812884-2025-11-03",
      "headline": "3 in 4 Indian student visa applications to Canada rejected in August: ReportFigures from Canada's immigration department show that about 74% of Indian applicants were denied study permits in August 2025, compared to 32% in August 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/is-silence-a-sign-of-comfort-or-trouble-in-a-relationship-2812560-2025-11-03",
      "headline": "Is silence a sign of comfort or trouble in a relationship?Do you notice that you and your partner sit in silence more often now, instead of talking like you did in the honeymoon phase? Is that silence comfort or is it a sign of distance?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/jaipur-woman-walks-1km-with-ola-driver-to-petrol-pump-still-charged-extra-for-detour-2812600-2025-11-03",
      "headline": "Jaipur woman walks 1 km with Ola driver to petrol pump, charged extra for detourA Jaipur woman narrated her Ola bike ride experience that turned into a lesson in empathy after she accompanied the driver to refuel his vehicle, arrived late, and still paid an extra charge for the detour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/when-delaying-divorce-becomes-a-strategy-for-the-childs-education-2811339-2025-11-01",
      "headline": "Let kids finish Class 12: Why Indian couples delay divorce, and the hidden costsMany Indian parents put off divorce thinking kids will cope better when they're older. But growing up in a quiet, loveless home often leaves deeper scars than separation ever could."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/adani-power-bangladesh-opt-for-arbitration-to-settle-payment-dispute-report-2812852-2025-11-03",
      "headline": "Adani Power, Bangladesh opt for arbitration to settle payment dispute: ReportAdani Power stressed that it continues to meet its contractual obligation to supply electricity to Bangladesh and is receiving regular payments to the extent acknowledged by Bangladesh Power Development Board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-amanjot-kaur-father-crying-india-vs-south-africa-watch-video-2812590-2025-11-03",
      "headline": "Amanjot Kaur's father sheds tears of joy as life comes full circle in Women's World CupWomen's World Cup: From Mohali's modest lanes to the world stage, Amanjot Kaur's inspiring rise came full circle as her father wept with pride watching India lift their maiden Women's ODI World Cup trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-why-it-matters-india-vs-south-africa-2812563-2025-11-03",
      "headline": "Women's World Cup win a present to the past, a promise for the futureWomen's World Cup final: From unreserved train rides to packed stadiums, Indian women's cricket has travelled decades for this night. The title triumph is a salute to the women who came before, and a signal to the next generation that the future is finally theirs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-state-film-awards-2024-mammootty-wins-best-actor-manjummel-boys-best-film-2812674-2025-11-03",
      "headline": "Kerala State Awards: Mammootty wins Best Actor, Manjummel Boys is Best FilmThe 55th Kerala State Film Awards announced Mammootty as Best Actor and 'Manjummel Boys' as Best Film. The awards highlight emerging talents and notable performances in Malayalam cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-to-add-muscle-in-arabian-sea-deploy-submarines-developed-with-china-in-2026-chinese-arms-islamabad-cpec-2812712-2025-11-03",
      "headline": "Pak to add muscle in Arabian Sea, deploy submarines developed with China in 2026Pakistan is set to deploy Hangor-class submarines, co-developed with China, in the Arabian Sea by 2026, its navy chief has said. The move to boost its maritime deterrence in the North Arabian Sea comes after India's Operation Sindoor exposed vulnerabilities of Pakistani defences. However, India's naval dominance in the region remains unmatched."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shikha-pandey-defends-jemimah-rodrigues-online-trolls-wc2025-2812916-2025-11-03",
      "headline": "Jemimah's trolls slammed by veteran India pacer: She is god's favourite child India veteran pacer Shikha Pandey came to the defence of Jemimah Rodrigues from her trolls following the Women's World Cup 2025 win. Jemimah played a big role in India's Women's World Cup win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-viral-rise-world-cup-social-media-followers-2812897-2025-11-03",
      "headline": "Women's World Cup: How team India played the social media game After being trolled not so long ago, Jemimah Rodrigues now stands as the most celebrated face of the Indian team on social media, following their Women's World Cup 2025 win. Apart from Jemimah, the other members of the team gained followers after the historic win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/nari-shakti-reigns-supreme-indias-women-clinch-historic-first-ever-world-cup-title-ytvd-2812895-2025-11-03",
      "headline": "Nari Shakti Reigns Supreme! India's Women Clinch Historic First-Ever World Cup Title This special report focuses on the Indian women's cricket team's historic, first-ever World Cup victory, led by captain Harmanpreet Kaur, after defeating South Africa in a thrilling final. Legendary cricketer Sunil Gavaskar stated, 'This is a victory for the ages — one that will rank among the greatest in Indian cricket history.' The bulletin covers the team's incredible journey, overcoming past heartbreaks and a challenging path to the finals, including a key semi-final win against Australia. The historic achievement has been met with nationwide celebration and significant financial rewards, including a ₹51 crore prize from the BCCI and gifts from industrialists, marking a pivotal moment for women's cricket in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/harmanpreets-smile-enjoy-mantra-that-led-india-to-world-cup-glory-ytvd-2812879-2025-11-03",
      "headline": "Harmanpreet's 'Smile & Enjoy' Mantra That Led India to World Cup Glory This special report focuses on the Indian women's cricket team's historic World Cup victory, with insights from captain Harmanpreet Kaur and spinner Radha Yadav. Radha Yadav revealed the captain's simple yet powerful message ahead of the final: 'She just said smile, enjoy. Itna hard work kiya hai. Bas ek final push aur bindas ho ke khelo (You have worked so hard. Just one final push and play freely)'. The conversation highlights the team's calm and composed mindset, which was forged through previous setbacks. Yadav explains that having failed in three matches before, the team had gained the crucial experience of how to stage a comeback, which they executed perfectly to lift the coveted trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/jemimah-rodrigues-parents-ms-dhoni-attitude-world-cup-2025-2812874-2025-11-03",
      "headline": "MS Dhoni attitude: How Jemimah Rodrigues became a Women's World Cup winner Jemimah Rodrigues' parents revealed how keeping an MS Dhoni attitude helped the 25-year-old progress in cricket and become a World Cup winner. Jemimah played a crucial role in India's Women's World Cup win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/jemimahs-tears-to-triumph-from-anxiety-being-dropped-to-world-cup-glory-ytvd-2812871-2025-11-03",
      "headline": "Jemimah's Tears To Triumph: From Anxiety & Being Dropped To World Cup Glory This special report focuses on Indian cricketer Jemimah Rodrigues and the women's team's historic World Cup victory. Rodrigues reflects on her personal struggles, including being dropped from the team and battling anxiety, which she revealed made her 'cry every single day' during the tournament. The report highlights her crucial, match-winning knock in the semi-final against Australia, which she felt was 'all scripted by someone above'. It delves into her emotional post-match comments about the team's resilience, where she emphasised that they looked out for each other through ups and downs, proving they are a 'real champion team'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-icc-womens-world-cup-final-run-praised-bjp-annamalai-2812856-2025-11-03",
      "headline": "Sports can sometimes be cruel: K Annamalai praises South Africa for spirited World Cup run BJP Tamil Nadu vice-president K. Annamalai lauded South Africa for their resilience and spirit in the ICC Women's World Cup, calling their journey to the final a champion's fight. He also praised skipper Laura Wolvaardt for her record-breaking run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-world-cup-2025-gateway-of-india-ms-dhoni-2812847-2025-11-03",
      "headline": "Harmanpreet Kaur does an MS Dhoni, poses with World Cup at Gateway of India India women's team captain Harmanpreet Kaur recreated MS Dhoni's iconic World Cup trophy pose at the Gateway of India on Monday, November 3. Harmanpreet masterminded India's maiden Women's World Cup triumph on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/renuka-singh-kranti-gaud-award-womens-world-cup-2025-2812823-2025-11-03",
      "headline": "Kranti Gaud, Renuka Singh rewarded: India pacers to get Rs 1 crore cash prize each Himachal's Renuka Singh Thakur and Madhya Pradesh's Kranti Gaud were each awarded Rs 1 crore by their state governments for their vital roles in India's historic 2025 ICC Women's World Cup triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/delhi-runs-in-killer-smog-nothing-short-of-stupidity-warns-expert-ytvd-2812822-2025-11-03",
      "headline": "Delhi Runs in Killer Smog: 'Nothing Short of Stupidity,' Warns Expert This special report focuses on the extreme health risks of outdoor exercise in Delhi's severe air pollution, with insights from medical expert and marathon runner, Dr. Agni Kumar. He stated that holding mass running events in these conditions is 'nothing sort of short of stupidity to be holding such mass marathons.' Dr. Kumar explains that while exercising, a person's air intake can increase from 5-6 litres per minute to as high as 100 litres, exponentially increasing the volume of toxic smog inhaled. This, he warns, is equivalent to smoking a vast number of cigarettes and significantly raises the risk of chronic lung diseases like COPD, emphysema, and asthma. The discussion also touches upon why people, influenced by herd mentality, continue to run and cycle in AQI levels of 400, sometimes in government-organised events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/deepti-sharmas-brother-avlesh-sharma-on-womens-world-cup-win-2812808-2025-11-03",
      "headline": "India was so tired of losing that a win was only option left: Deepti Sharma's brother India all-rounder Deepti Sharma's brother Avlesh Sharma reflected on the team's Women's World Cup 2025 triumph. Deepti Sharma was adjudged Player of the Tournament with 215 runs and 22 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-icc-womens-world-cup-final-run-praised-bjp-annamalai-2812856-2025-11-03",
      "headline": "Sports can sometimes be cruel: K Annamalai praises South Africa for spirited World Cup run BJP Tamil Nadu vice-president K. Annamalai lauded South Africa for their resilience and spirit in the ICC Women's World Cup, calling their journey to the final a champion's fight. He also praised skipper Laura Wolvaardt for her record-breaking run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-world-cup-2025-gateway-of-india-ms-dhoni-2812847-2025-11-03",
      "headline": "Harmanpreet Kaur does an MS Dhoni, poses with World Cup at Gateway of India India women's team captain Harmanpreet Kaur recreated MS Dhoni's iconic World Cup trophy pose at the Gateway of India on Monday, November 3. Harmanpreet masterminded India's maiden Women's World Cup triumph on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/renuka-singh-kranti-gaud-award-womens-world-cup-2025-2812823-2025-11-03",
      "headline": "Kranti Gaud, Renuka Singh rewarded: India pacers to get Rs 1 crore cash prize each Himachal's Renuka Singh Thakur and Madhya Pradesh's Kranti Gaud were each awarded Rs 1 crore by their state governments for their vital roles in India's historic 2025 ICC Women's World Cup triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/delhi-runs-in-killer-smog-nothing-short-of-stupidity-warns-expert-ytvd-2812822-2025-11-03",
      "headline": "Delhi Runs in Killer Smog: 'Nothing Short of Stupidity,' Warns Expert This special report focuses on the extreme health risks of outdoor exercise in Delhi's severe air pollution, with insights from medical expert and marathon runner, Dr. Agni Kumar. He stated that holding mass running events in these conditions is 'nothing sort of short of stupidity to be holding such mass marathons.' Dr. Kumar explains that while exercising, a person's air intake can increase from 5-6 litres per minute to as high as 100 litres, exponentially increasing the volume of toxic smog inhaled. This, he warns, is equivalent to smoking a vast number of cigarettes and significantly raises the risk of chronic lung diseases like COPD, emphysema, and asthma. The discussion also touches upon why people, influenced by herd mentality, continue to run and cycle in AQI levels of 400, sometimes in government-organised events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/deepti-sharmas-brother-avlesh-sharma-on-womens-world-cup-win-2812808-2025-11-03",
      "headline": "India was so tired of losing that a win was only option left: Deepti Sharma's brother India all-rounder Deepti Sharma's brother Avlesh Sharma reflected on the team's Women's World Cup 2025 triumph. Deepti Sharma was adjudged Player of the Tournament with 215 runs and 22 wickets. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/amanjot-kaur-womens-world-cup-exclusive-interview-final-2812807-2025-11-03",
      "headline": "No more losing close games, we were determined this time: Amanjot on World Cup gloryWomen's World Cup, IND vs SA: Amanjot Kaur said that India were determined to go past the finish line in the final against South Africa after losing a few close games in the league stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/radha-yadav-womens-world-cup-interview-final-2812790-2025-11-03",
      "headline": "Having failed earlier, India knew how to stay calm in World Cup final: Radha YadavWomen's World Cup 2025: In an interview, Radha Yadav said that India knew how to stay calm in the final, learning from their three losses on the trot against Australia, South Africa and England in the league stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-womens-cricket-journey-world-cup-2025-harmanpreet-kaur-2812787-2025-11-03",
      "headline": "Women willed, India won: World Cup's Bella Ciao momentAt the stroke of midnight on November 3, India's women didn't just win a World Cup – they sparked a revolution. After years of toil for recognition, Harmanpreet Kaur and her team fulfilled a dream that started in the 1970s and have started to make the younger generations dream of wearing India's famous blue jersey with pride. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-travis-head-to-miss-last-2-t20is-for-ashes-preparations-2812650-2025-11-03",
      "headline": "AUS vs IND: Travis Head to miss last 2 T20Is for Ashes preparationsAustralia batter Travis Head has withdrawn from the final two T20Is against India to rejoin South Australia in the Sheffield Shield, aiming to recalibrate his red-ball game ahead of the Ashes. The five-match T20I series between India and Australia is levelled 1-1 after four games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-heaven-premier-league-scam-srinagar-players-duped-2812752-2025-11-03",
      "headline": "Indian Heaven Premier League organisers dupe players, officials and flee KashmirThe Indian Heaven Premier League, a private cricket league being played in Srinagar, has found itself in the midst of controversy after the organisers fled from the city after duping the players and officials and with a trail of unpaid bills. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/jemimah-rodrigues-womens-world-cup-final-interview-2812750-2025-11-03",
      "headline": "Jemimah on India's journey in World Cup: We had each other's shoulders to cry onWomen's World Cup 2025: In an exclusive interview, Jemimah Rodrigues said how the Indian players supported each other when the team was going through a rough patch, losing three matches on the bounce in the mega event at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-why-it-matters-india-vs-south-africa-2812563-2025-11-03",
      "headline": "Women's World Cup win a present to the past, a promise for the futureWomen's World Cup final: From unreserved train rides to packed stadiums, Indian women's cricket has travelled decades for this night. The title triumph is a salute to the women who came before, and a signal to the next generation that the future is finally theirs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-photo-womens-world-cup-trophy-2812644-2025-11-03",
      "headline": "Cricket is everyone's game: Harmanpreet sends strong message with latest photoIndia captain Harmanpreet Kaur posted her photo with the Women's World Cup trophy. The photo had one simple message: Cricket is not just gentleman's game, it's everyone's game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-heaven-premier-league-scam-srinagar-players-duped-2812752-2025-11-03",
      "headline": "Indian Heaven Premier League organisers dupe players, officials and flee KashmirThe Indian Heaven Premier League, a private cricket league being played in Srinagar, has found itself in the midst of controversy after the organisers fled from the city after duping the players and officials and with a trail of unpaid bills. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/jemimah-rodrigues-womens-world-cup-final-interview-2812750-2025-11-03",
      "headline": "Jemimah on India's journey in World Cup: We had each other's shoulders to cry onWomen's World Cup 2025: In an exclusive interview, Jemimah Rodrigues said how the Indian players supported each other when the team was going through a rough patch, losing three matches on the bounce in the mega event at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-why-it-matters-india-vs-south-africa-2812563-2025-11-03",
      "headline": "Women's World Cup win a present to the past, a promise for the futureWomen's World Cup final: From unreserved train rides to packed stadiums, Indian women's cricket has travelled decades for this night. The title triumph is a salute to the women who came before, and a signal to the next generation that the future is finally theirs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-photo-womens-world-cup-trophy-2812644-2025-11-03",
      "headline": "Cricket is everyone's game: Harmanpreet sends strong message with latest photoIndia captain Harmanpreet Kaur posted her photo with the Women's World Cup trophy. The photo had one simple message: Cricket is not just gentleman's game, it's everyone's game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-harmanpreet-kaur-1983-moment-feature-2812640-2025-11-03",
      "headline": "India's Women's World Cup triumph: A 1983 moment and so much moreIndia's victory in the Women's World Cup 2025 marks a landmark moment in Indian cricket, echoing the historic 1983 men's World Cup triumph. But, its significance transcends the sporting arena.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-amanjot-kaur-father-crying-india-vs-south-africa-watch-video-2812590-2025-11-03",
      "headline": "Amanjot Kaur's father sheds tears of joy as life comes full circle in Women's World CupWomen's World Cup: From Mohali's modest lanes to the world stage, Amanjot Kaur's inspiring rise came full circle as her father wept with pride watching India lift their maiden Women's ODI World Cup trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/narendra-modi-meet-indian-womens-team-final-2812586-2025-11-03",
      "headline": "PM Narendra Modi likely to meet Indian women's team in DelhiPrime Minister Narendra Modi is likely to meet the Indian women's team on Wednesday, November 5. The meeting is likely to happen in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-heist-in-kashmir-stars-like-chris-gayle-duped-in-massive-league-fraud-ytvd-2812574-2025-11-03",
      "headline": "Cricket Heist in Kashmir: Stars Like Chris Gayle Duped in Massive League Fraud?This special report focuses on a major cricket scam in Jammu and Kashmir involving the 'Indian Heaven Premier League', where organisers fled midway through the tournament, leaving national and international players like Chris Gayle unpaid. 'Clearly the Jammu and Kashmir government rolled out the red carpet for the league without any background checks or verification process that's coming to the forefront at this point.' The scandal has left a trail of unpaid hotel bills amounting to tens of lakhs, with players and officials initially being prevented from leaving their hotel in Srinagar. While the J&K Sports Council, which had promoted the event and provided the Bakshi Stadium, has since tried to distance itself, questions are being raised about the lack of due diligence that allowed the fraudulent league to operate, tarnishing the region's image."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-world-cup-win-meaning-whats-next-2812471-2025-11-03",
      "headline": "Triumph and transition: Women's World Cup was not the destination, it's the dawnWomen's World Cup 2025, IND vs SA: Harmanpreet Kaur's India lifted the trophy after defeating South Africa on Sunday in Navi Mumbai — but the tougher journey now begins: sustaining that success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/father-sanjeev-verma-fiery-pep-talk-inspired-shafali-vermas-world-cup-final-heroics-2812550-2025-11-03",
      "headline": "How father's fiery pep talk inspired Shafali Verma's World Cup final heroicsShafali Verma's father, Sanjeev Verma, revealed how he kept her motivated during her year out of the ODI team. His support and Harmanpreet Kaur's trust helped Shafali deliver a match-winning performance in the Women's World Cup final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-india-vs-south-africa-final-harmanpreet-kaur-full-press-conference-2812556-2025-11-03",
      "headline": "Coaching stability, some harsh words: How India became world championsWomen's World Cup Final: India captain Harmanpreet Kaur credited the stability in the Indian team management behind the team's success in the World Cup. The skipper said that Amol Mazumdar's harsh words riled them up after they dropped form midway through the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-mandhana-wake-up-with-trophy-trend-after-world-cup-triumph-2812499-2025-11-03",
      "headline": "Jemimah, Smriti hop on viral 'wake up with trophy' trend after World Cup triumphIndia batters Jemimah Rodrigues and Smriti Mandhana hopped on to the 'wake up with trophy' trend after their historic maiden World Cup triumph. India beat South Africa by 52 runs to clinch their maiden World Cup title."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}