{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-whatsapp-channel-qr-code-number-heres-how-to-access-banking-digital-safety-2707973-2025-04-12",
      "headline": "RBI launches WhatsApp Channel: Here's how to access it via QR codeThe RBI said that the goal of the WhatsApp channel is to provide verified and timely information about banking, digital safety, and other important topics directly to users. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pentagon-ends-5-billion-contracts-accenture-deloitte-pete-hegseth-2707949-2025-04-12",
      "headline": "Pentagon cuts $5.1 billion contracts with Accenture, Deloitte: Wasteful spendingThe contracts appeared to be wide-ranging cuts to consulting services for the Navy, the Air Force, the Defense Advanced Research Projects Agency (DARPA) and the Defense Health Agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-bounces-back-after-wild-week-fueled-by-tariff-war-2707818-2025-04-12",
      "headline": "Wall Street bounces back after wild week fueled by tariff warAll three major US indexes ended the session sharply higher after assurances from Boston Federal Reserve President Susan Collins that the Fed is prepared to keep financial markets functioning should the need arise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-pushing-trade-deals-with-us-eu-with-high-urgency-s-jaishankar-trump-tariffs-2707776-2025-04-11",
      "headline": "India pushing for trade deals with US, EU with high urgency: JaishankarOn Wednesday, Trump announced a 90-day pause on his sweeping tariffs on all countries, except China as countries around the world wilted under the impact of the seismic action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-trump-tariffs-could-make-iphones-cars-and-clothes-in-the-us-2707519-2025-04-11",
      "headline": "How Trump tariffs could make iPhones, cars, and clothes costlier in the USTrump's latest plan includes a massive 145% tax on goods coming from China. Experts say this could end the long run of cheap, imported goods that Americans have enjoyed for decades. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-1300-points-higher-nifty-above-22500-tata-steel-up-5-percent-metal-stocks-gain-2707506-2025-04-11",
      "headline": "Sensex ends 1,300 points higher, Nifty above 22,500; Tata Steel up 5%The S&P BSE Sensex jumped 1,310.11 points to close at 75,157.26, while the NSE Nifty50 added 429.40 points to end at 22,828.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-sip-vs-ppf-what-rs-1-lakh-a-year-can-earn-in-15-years-2707471-2025-04-11",
      "headline": "Mutual fund SIP vs PPF: What Rs 1 lakh a year can earn in 15 yearsPPF is a government scheme with a current interest rate of around 7.1% per annum. On the other hand, SIPs typically offer higher interest when invested over the long term, especially in equity mutual funds. But they carry some risk, as returns depend on the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muthoot-finance-share-price-fall-over-8-percent-today-manappuram-finance-iifl-finance-stock-low-rbi-rules-2707451-2025-04-11",
      "headline": "Explained: Why Muthoot Finance shares fell over 8% todayMuthoot Finance stock price: Muthoot Finance, one of India's largest gold loan companies, has seen its share price decline by 14% in the past five trading sessions. The stock is also down 7% over the past month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-amfi-data-march-2025-sips-decrease-reason-trump-tariff-global-uncertainty-2707415-2025-04-11",
      "headline": "Mutual fund inflows hit in March. Trump tariffs to blame?The largest outflows were seen in debt mutual funds, where investors pulled out Rs 2.02 lakh crore, possibly due to end-of-year financial needs by institutions and ongoing global uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-ceo-nithin-kamath-money-advice-no-shortcuts-to-getting-rich-it-takes-good-habits-and-patience-2707411-2025-04-11",
      "headline": "Zerodha CEO Nithin Kamath's money advice: 'No shortcuts to getting rich'Nithin Kamath shared a video with a powerful message—earning more doesn't mean you're saving more. In fact, higher income often leads to more spending on gadgets, clothes, dining out, or things meant just to impress others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-china-trade-war-lower-loan-emis-repo-rate-rbi-explained-2707412-2025-04-11",
      "headline": "Trump tariffs, trade war fears could bring your loan EMIs down further this yearBorrowers could emerge as the unexpected winners if global headwinds linger and domestic growth slows further, with the RBI likely to step in again to lower the key interest rates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/share-market-rally-today-sensex-nifty-defy-wall-street-crash-key-reasons-retail-investors-need-to-know-2707375-2025-04-11",
      "headline": "Wall Street crashes, Dalal Street rallies: 5 things investors should knowStock market today: Dalal Street's leading indices rallied sharply, defying a global sell-off sparked by Wall Street's overnight crash. Here are the key factors behind today's stock market rally. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-kumar-sons-immerse-ashes-in-ganga-at-haridwar-family-members-attend-2707987-2025-04-12",
      "headline": "Manoj Kumar's sons immerse ashes in Ganga at Haridwar, family members attendManoj Kumar's sons Kunal Goswami and Vishal Goswami, along with other relatives, immersed the veteran actor's ashes in Haridwar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priya-prakash-varrier-viral-wink-thottu-thottu-pesum-sultana-good-bad-ugly-2707983-2025-04-12",
      "headline": "Beyond the wink: Priya Prakash Varrier's second viral wave with Good Bad UglyPriya Prakash Varrier is hogging all the limelight after the re-creation of the evergreen Tamil song, 'Thottu Thottu Pesum' in Ajith Kumar's 'Good Bad Ugly'. In an exclusive chat with India Today Digital, she talked about going viral in 2018 and again in 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-wants-british-government-king-charles-watch-kesari-chapter-2-they-should-say-sorry-2707962-2025-04-12",
      "headline": "Akshay Kumar wants King Charles to watch Kesari Chapter 2: They should say sorryAkshay Kumar shared that he wants the British government and King Charles to watch Kesari Chapter 2. The actor said, 'they should say sorry.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hema-malini-dharamendra-is-happy-with-jaat-success-esha-deol-praises-sunny-deol-2707946-2025-04-12",
      "headline": "Hema Malini says Dharamendra is happy with Jaat's success, Esha praises Sunny DeolHema Malini and Esha Deol praised Sunny Deol's 'Jaat'. The veteran actor stated that 'Dharam ji is very happy' over the film's bumper opening. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/phule-director-anant-mahadevan-controversy-caste-representation-2707928-2025-04-12",
      "headline": "Phule director calls controversy over film 'unnecessary', reveals why it was delayed'Phule' director Anant Mahadevan called the controversy around the film 'exaggerated' and 'unnecessary'. He said that the censor board was not the reason for postponing the release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-kundrra-slams-reports-of-wedding-with-tejasswi-sick-of-you-marrying-me-off-2707918-2025-04-12",
      "headline": "Karan Kundrra slams reports of wedding with Tejasswi: Sick of you marrying me offKaran Kundrra lost cool on reports of his wedding with Tejasswi Prakash. The actor shared a post and urged the media to verify information before publishing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-2-sunny-deol-gopichand-malineni-2707907-2025-04-12",
      "headline": "Jaat box office Day 2: Sunny Deol's film struggles to take off, mints Rs 16 croreDirector Gopichand Malineni's 'Jaat', starring Sunny Deol', seems to be struggling for a boost at the box office. In two days, the film has raked in Rs 16 crore nett in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sharmila-tagore-lung-cancer-2023-no-chemotherapy-soha-ali-khan-2707884-2025-04-12",
      "headline": "Sharmila Tagore didn't require chemotherapy: Soha on mother's lung cancer battleActor Soha Ali Khan, in a recent interview, revealed that her mother, Sharmila Tagore, battled 'stage zero' lung cancer in 2023. She underwent surgery to remove the tumour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/how-marvel-tv-brought-the-mcu-back-to-life-after-endgames-uncertain-future-2707617-2025-04-12",
      "headline": "How Marvel TV brought the MCU back to life after Endgame's uncertain futureAfter 'Avengers: Endgame', Marvel fans were uncertain about the future. However, shows like 'Agatha All Along' and 'Daredevil: Born Again' have reignited excitement and faith in the MCU."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-bad-ugly-box-office-collection-day-2-ajith-kumar-film-dip-big-numbers-over-first-weekend-2707861-2025-04-12",
      "headline": "Good Bad Ugly box office Day 2: Ajith's film dips, eyes big numbers over weekendAjith Kumar's 'Good Bad Ugly' saw a drop in numbers on Day 2. However, trade experts suggest that the film will make the most of the extended weekend due to Tamil New Year holiday on April 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/apoorva-mukhija-smiling-photo-cryptic-caption-publix-apology-2707855-2025-04-12",
      "headline": "Apoorva Mukhija posts smiling pic with cryptic caption after public apologyInfluencer and actor Apoorva Mukhija shared a smiling photo of herself with a cryptic caption on Friday. A couple of days ago, she publicly apologised for her comments and talked about the rape and death threats she received amid India's Got Latent controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gaurav-khanna-wins-celebrity-masterchef-nikki-tamboli-tejasswi-prakash-runner-ups-2707767-2025-04-11",
      "headline": "Gaurav Khanna wins Celebrity MasterChef, Nikki Tamboli, Tejasswi Prakash runner-upsActor Gaurav Khanna lifted the 'Celebrity MasterChef' trophy. Nikki Tamboli and Tejasswi Prakash bagged first and second runner-up spots, respectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prakash-raj-shares-pic-with-kunal-kamra-asks-how-to-reach-tamil-nadu-shiv-sena-2707747-2025-04-11",
      "headline": "Prakash Raj shares pic with Kunal Kamra, asks 'how to reach Tamil Nadu'Veteran actor Prakash Raj met comedian Kunal Kamra. However, it was the actor's caption that caught the attention of all. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-meets-priyanka-chopra-nick-jonas-in-us-krrish-4-casting-2707739-2025-04-11",
      "headline": "Hrithik Roshan meets Priyanka Chopra, Nick Jonas in USHrithik Roshan recently revealed that he met Priyanka Chopra and Nick Jonas in the US. Their meet-up comes amid rumours of Chopra's casting reports in Krrish 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/banijay-asia-exits-khatron-ke-khiladi-rohit-shetty-orry-munawar-faruqui-2707719-2025-04-11",
      "headline": "Exclusive: Banijay exits Khatron Ke Khiladi, future of new season uncertainKhatron Ke Khiladi 15's future looks uncertain as producer Banijay exited the show. This latest development has upset director Rohit Shetty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/puratawn-the-ancient-review-sharmila-tagore-rituparna-sengupta-suman-ghosh-2707696-2025-04-11",
      "headline": "Puratawn review: Sharmila Tagore's comeback film flows like a poemReleased-Fri Apr 11, 2025Puratawn review: Sharmila Tagore's comeback Bengali film explores the intertwining of past and present memories in an octogenarian's life. It also focusses on an intricate mother-daughter relationship. Read the full review here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-chahatt-khanna-reveals-harrowing-childhood-molestation-memory-2707693-2025-04-11",
      "headline": "Actor Chahatt Khanna shares disturbing childhood memory of being molestedActor Chahatt Khanna recently shared a disturbing childhood memory of being molested by an elderly neighbour.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/agnyathavasi-review-slow-and-steady-thriller-about-dark-choices-producer-hemanth-rao-2707586-2025-04-11",
      "headline": "Agnyathavasi review: Slow and steady thriller about dark choicesReleased-Fri Apr 11, 2025Agnyathavasi film review: Produced by Hemanth Rao, this Kannada thriller is an interesting ride with its engaging story and technical brilliance. It has been directed by Janardhan Chikkanna and features Rangayana Raghu in the lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kumar-shanus-daughter-shannon-k-to-perform-at-coachella-2025-2707622-2025-04-11",
      "headline": "Singer Kumar Sanu's daughter Shannon K to perform at Coachella 2025Singer Kumar Sanu's daughter Shannon K is set to make her Coachella 2025 debut. The singer will be the first indie Indian-origin singer to perform at the global event. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-murshidabad-west-bengal-peace-remain-calm-message-riots-violence-waqf-protests-chief-minister-2707977-2025-04-12",
      "headline": "Won't implement Waqf law, don't incite riots for politics: Mamata BanerjeeSaying that her government will not implement the Narendra Modi government's newly-enacted Waqf law in the state, West Bengal Chief Minister Mamata Banerjee on Saturday reached out to the violence-hit areas of Murshidabad district, appealing for peace."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/upi-services-down-for-many-users-india-npci-working-resolve-issue-latest-transactions-decline-update-downdetector-2707966-2025-04-12",
      "headline": "UPI services suffer outage, digital payments body says 'working to resolve issue'Users across platforms such as Paytm and Google Pay expressed frustration online, saying they were unable to complete UPI transactions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-illegal-immigrants-registration-rule-indian-h1b-visa-green-card-holders-documentation-2707985-2025-04-12",
      "headline": "Indian H1-B, green card holders need to carry ID 24x7? What new US rule saysThe rule came into effect on April 11. A US court allowed the Trump administration to enforce the contentious rule requiring illegal immigrants to register with the government and carry documentation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-aiadmk-alliance-looks-good-math-will-it-score-in-chemistry-tamil-nadu-assembly-election-2026-experts-explain-2707701-2025-04-12",
      "headline": "BJP-AIADMK alliance is good maths, but will it score in chemistry?The BJP and the AIADMK have confirmed an alliance for the 2026 Assembly polls. Post-Jayalalithaa, the AIADMK has become a fractured force, and the BJP is still trying to find its feet in Tamil Nadu. Here's a look at the maths and chemistry of the alliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/how-marvel-tv-brought-the-mcu-back-to-life-after-endgames-uncertain-future-2707617-2025-04-12",
      "headline": "How Marvel TV brought the MCU back to life after Endgame's uncertain futureAfter 'Avengers: Endgame', Marvel fans were uncertain about the future. However, shows like 'Agatha All Along' and 'Daredevil: Born Again' have reignited excitement and faith in the MCU."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-deadline-3-months-president-bills-referred-by-governors-2707895-2025-04-12",
      "headline": "In a first, Supreme Court sets deadline for President to decide on billsThe Supreme Court's ruling came as it set aside the Tamil Nadu Governor's decision to withhold assent to pending bills. The order was made public on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lsg-vs-gt-srh-vs-pbks-digvesh-rathi-celebration-ipl-moral-policing-2707976-2025-04-12",
      "headline": "From Digvesh to Maxwell: Should IPL stop moral policing its players?IPL has continually fined cricketers for either celebrating a wicket or showing frustration while getting out. If the players cannot do either, what remains to be the point of sports?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/helicopter-that-crashed-killing-siemens-executive-had-prior-mechanical-fault-2707986-2025-04-12",
      "headline": "Helicopter that crashed, killing Siemens executive, had prior mechanical faultAccording to Federal Aviation Administration records, the sightseeing helicopter experienced a mechanical issue with its transmission assembly in September and was taken in for repairs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/jindal-university-student-sneaks-girl-hidden-in-suitcase-into-boys-hostel-viral-video-2707969-2025-04-12",
      "headline": "Student caught sneaking girl hidden in suitcase into boys' hostel. Video goes viralA student at Jindal University in Haryana tried to sneak a girl into the boys' hostel by hiding her in a suitcase, but was caught red-handed by the hostel guards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pentagon-ends-5-billion-contracts-accenture-deloitte-pete-hegseth-2707949-2025-04-12",
      "headline": "Pentagon cuts $5.1 billion contracts with Accenture, Deloitte: Wasteful spendingThe contracts appeared to be wide-ranging cuts to consulting services for the Navy, the Air Force, the Defense Advanced Research Projects Agency (DARPA) and the Defense Health Agency."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sukhbir-singh-badal-re-elected-unopposed-as-shiromani-akali-dal-president-november-2024-resigned-religious-misconduct-2707990-2025-04-12",
      "headline": "Sukhbir Badal back as Akali chief months after resigning over religious misconductSukhbir Singh Badal re-elected Shiromani Akali Dal chief 5 months after resigning due to religious misconduct"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indian-origin-us-politician-arrested-in-gambling-racket-involving-italian-mafia-2707932-2025-04-12",
      "headline": "Indian-origin US politician arrested in gambling racket involving Italian mafiaAnand Shah, 42, a New Jersey council member and local business owner, was allegedly responsible for overseeing illegal gambling dens in New York alongside the notorious Lucchese crime family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priya-prakash-varrier-viral-wink-thottu-thottu-pesum-sultana-good-bad-ugly-2707983-2025-04-12",
      "headline": "Beyond the wink: Priya Prakash Varrier's second viral wave with Good Bad UglyPriya Prakash Varrier is hogging all the limelight after the re-creation of the evergreen Tamil song, 'Thottu Thottu Pesum' in Ajith Kumar's 'Good Bad Ugly'. In an exclusive chat with India Today Digital, she talked about going viral in 2018 and again in 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/newstrack-with-rahul-kanwal/video/adolescence-in-focus-experts-discuss-impact-of-social-media-parenting-on-teens-2707748-2025-04-11",
      "headline": "Adolescence in focus: Experts discuss impact of social media, parenting on teensBritish crime drama Adolescence has taken the world of the internet by storm and has sparked a global debate on the way parents nurture their kids as well as the kind of adverse effect social media could have on young, immature minds. The four-part Netflix series deals with a host of issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/katy-perry-space-tourist-flight-blue-origin-new-shepard-ns-31-date-and-time-2707534-2025-04-12",
      "headline": "Katy Perry to fly into space: How to see her historic flight LIVEThe New Shepard spacecraft, designed for suborbital flights, will launch from Blue Origin's facility in West Texas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-govt-notifies-10-pending-acts-without-governor-or-presidents-assent-only-sc-order-public-2707950-2025-04-12",
      "headline": "In a first, Tamil Nadu notifies 10 Acts without Governor, President assentThe Tamil Nadu government notified 10 Acts without receiving assent from either the Governor or the President. This move was enabled by a recent Supreme Court verdict. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-csk-fall-ipl-2025-2707902-2025-04-12",
      "headline": "CSK's fall in IPL 2025: Gotham burns and the Dark Knight can't save itIn IPL 2025, Chennai Super Kings are struggling in a deep slump, with MS Dhoni unable to turn the tide. Despite their rich legacy, the team's outdated tactics and lack of spark leave them on the brink of collapse, with no clear hero to save them.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-472-11-04-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-gunfight-encounter-akhnoor-army-officer-killed-pakistan-terrorists-infiltrators-line-of-control-loc-2707862-2025-04-12",
      "headline": "Army officer injured in gunfight with Pakistani infiltrators in J&K diesThe gunfight erupted after the Indian Army intercepted a group of terrorists attempting to infiltrate from across the border in the Keri Battal area."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-attack-case-chargesheet-intruder-knife-blade-jeh-actor-statement-2707953-2025-04-12",
      "headline": "Saw attacker standing next to Jeh with knife, hexablade: What Saif told policeSaif Ali Khan, in his statement to the police, recounted the terrifying moments of the incident at his Bandra home. It is part of the 1,612-page chargesheet recently filed by the Bandra police in court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/if-netflixs-adolescence-was-made-in-india-would-the-plot-take-a-darker-turn-2707733-2025-04-12",
      "headline": "If Netflix's Adolescence was made in India, would the plot take a darker turn?Adolescence left many contemplating several things - upbringing, peer influence, the challenges of being a teenager in the social media era. But for me, the biggest question was this: if a series like this were made in India, would the narrative have been any different?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/scooter-borne-attackers-stab-5-loot-3-of-them-within-1-hour-video-of-attack-surfaces-delhi-2707961-2025-04-12",
      "headline": "Scooter-borne attackers stab 5, loot 3 of them within 1 hour in DelhiThe crime spree began with an assault on a man named Mukesh, who was unloading goods from his pickup truck in a park. The criminals approached him on a scooter, stabbed him, and snatched Rs 1,200 and his phone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/tata-curvv-dark-edition-launched-price-starts-at-rs-1649-lakh-2707959-2025-04-12",
      "headline": "Tata Curvv Dark Edition launched, price starts at Rs 16.49 lakhThe Curvv Dark Edition features a gloss carbon black exterior, blacked-out elements, and an all-black cabin. The Dark Edition comes in the Accomplished S and Accomplished + A variants only."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/andhra-pradesh-class-11-12-inter-results-released-bieap-check-here-2707909-2025-04-12",
      "headline": "AP Inter 1st, 2nd Year Results 2025 declared: Direct link to downloadThe Andhra Pradesh Board of Intermediate Education (BIEAP) has  released the Intermediate Public Examination (IPE) results for both 1st and 2nd year students today, April 12, 2025, at 11 AM. The results has been announced in a press briefing and then made available on the official portals: resultsbie.ap.gov.in and bieap.apcfss.in"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-pbks-match-preview-precited-xi-weather-forecast-hyderabad-2707980-2025-04-12",
      "headline": "SRH vs PBKS, Match Preview: Struggling Hyderabad's test of fate against Project PunjabIPL 2025, SRH vs PBKS Match Preview: Sunrisers Hyderabad face a red-hot Punjab Kings side in a must-win encounter, with SRH battling form and confidence while PBKS continue their dominant run in IPL 2025 under the steady hands of Shreyas Iyer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lsg-vs-gt-srh-vs-pbks-digvesh-rathi-celebration-ipl-moral-policing-2707976-2025-04-12",
      "headline": "From Digvesh to Maxwell: Should IPL stop moral policing its players?IPL has continually fined cricketers for either celebrating a wicket or showing frustration while getting out. If the players cannot do either, what remains to be the point of sports?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-gt-live-score-lucknow-super-giants-vs-gujarat-titans-today-reactions-2707972-2025-04-12",
      "headline": "LSG vs GT LIVE, IPL 2025: Lucknow host Gujarat in top-heavy battle at EkanaLucknow Super Giants (LSG) vs Gujarat Titans (GT) LIVE Score, IPL 2025: The Lucknow Super Giants will host the Gujarat Titans at Ekana Stadium, with both teams hoping to extend their winning streaks. LSG has been erratic this season, winning three games and losing two. GT, on the other hand, has won all four of its matches after dropping the opener to Punjab Kings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-glenn-phillips-ruled-out-groin-injury-gujarat-titans-2707933-2025-04-12",
      "headline": "Gujarat Titans star Glenn Phillips ruled out of IPL 2025 with groin injuryIPL 2025: Gujarat Titans have suffered another setback as Glenn Phillips has been ruled out of IPL 2025 with a groin injury, joining Kagiso Rabada on the list of key players missing this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-rizwan-not-educated-english-speaking-psl-2707924-2025-04-12",
      "headline": "Mohammad Rizwan: Pakistan's demand from me is cricket, not EnglishPakistan captain Mohammed Rizwan has said that he is not ashamed his poor English. In an emotional rant, Rizwan has said that what Pakistan needs from him is cricket and not perfect English.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-super-giant-vs-bengaluru-fc-isl-final-live-streaming-tv-channel-2707917-2025-04-12",
      "headline": "ISL Final MBSG vs BFC,  Live streaming: When and where to watchA familiar rivalry is renewed as Mohun Bagan Super Giant and Bengaluru FC face off in the ISL 2025 Final, reigniting memories of their thrilling 2023 title clash in Kolkata's Salt Lake Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-csk-fall-ipl-2025-2707902-2025-04-12",
      "headline": "CSK's fall in IPL 2025: Gotham burns and the Dark Knight can't save itIn IPL 2025, Chennai Super Kings are struggling in a deep slump, with MS Dhoni unable to turn the tide. Despite their rich legacy, the team's outdated tactics and lack of spark leave them on the brink of collapse, with no clear hero to save them.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-vs-srh-ipl-2025-nehwal-wadhera-2707893-2025-04-12",
      "headline": "Out of form SRH still a very dangerous side: Nehal WadheraPunjab Kings play SRH in the evening game on Saturday, April 12. Ahead of the match, Nehal Wadhera has said that they are wary of SunRisers Hyderabad despite them being woefully out of form in IPL 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-csk-vs-kkr-kolkata-knight-riders-wicketkeeper-quinton-de-kock-press-conference-2707894-2025-04-12",
      "headline": "Ajinkya Rahane's familiarity with Chepauk helped KKR beat CSK, says de KockKolkata Knight Riders wicketkeeper Quinton de Kock said Ajinkya Rahane and Moeen Ali's familiarity with the Chepauk pitch helped his side beat Chennai Super Kings. \"When we bowled, it seemed a lot slower. We have guys Ajinkya and Moeen, who have been here (Chepauk) before and they knew it. That's why the selectors played an extra spinner against CSK,\" Moeen Ali said in the post-match press conference after the win over CSK."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-csk-vs-kkr-chennai-super-kings-batting-coach-michael-hussey-press-conference-2707874-2025-04-12",
      "headline": "KKR loss hurts a lot, time for self-reflection, says CSK batting coachChennai Super Kings' batting coach Michael Hussey said the entire team was disappointed after the heavy loss to Kolkata Knight Riders. \"Obviously, we are very disappointed with the result and the performance tonight,\" Hussey said in the post-match press conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-mike-hussey-press-conference-2707859-2025-04-12",
      "headline": "CSK not ready to surrender yet: Defiant Hussey hopeful of playoffs spotIPL 2025: CSK batting coach Mike Hussey said that the team is not ready to surrender just yet. CSK fell to a heavy defeat against KKR on Friday, April 11, losing their 5th game in a row.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-csk-fall-ipl-2025-2707902-2025-04-12",
      "headline": "CSK's fall in IPL 2025: Gotham burns and the Dark Knight can't save itIn IPL 2025, Chennai Super Kings are struggling in a deep slump, with MS Dhoni unable to turn the tide. Despite their rich legacy, the team's outdated tactics and lack of spark leave them on the brink of collapse, with no clear hero to save them.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-vs-srh-ipl-2025-nehwal-wadhera-2707893-2025-04-12",
      "headline": "Out of form SRH still a very dangerous side: Nehal WadheraPunjab Kings play SRH in the evening game on Saturday, April 12. Ahead of the match, Nehal Wadhera has said that they are wary of SunRisers Hyderabad despite them being woefully out of form in IPL 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-csk-vs-kkr-kolkata-knight-riders-wicketkeeper-quinton-de-kock-press-conference-2707894-2025-04-12",
      "headline": "Ajinkya Rahane's familiarity with Chepauk helped KKR beat CSK, says de KockKolkata Knight Riders wicketkeeper Quinton de Kock said Ajinkya Rahane and Moeen Ali's familiarity with the Chepauk pitch helped his side beat Chennai Super Kings. \"When we bowled, it seemed a lot slower. We have guys Ajinkya and Moeen, who have been here (Chepauk) before and they knew it. That's why the selectors played an extra spinner against CSK,\" Moeen Ali said in the post-match press conference after the win over CSK."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-csk-vs-kkr-chennai-super-kings-batting-coach-michael-hussey-press-conference-2707874-2025-04-12",
      "headline": "KKR loss hurts a lot, time for self-reflection, says CSK batting coachChennai Super Kings' batting coach Michael Hussey said the entire team was disappointed after the heavy loss to Kolkata Knight Riders. \"Obviously, we are very disappointed with the result and the performance tonight,\" Hussey said in the post-match press conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-mike-hussey-press-conference-2707859-2025-04-12",
      "headline": "CSK not ready to surrender yet: Defiant Hussey hopeful of playoffs spotIPL 2025: CSK batting coach Mike Hussey said that the team is not ready to surrender just yet. CSK fell to a heavy defeat against KKR on Friday, April 11, losing their 5th game in a row.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}