{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-maruti-mm-mahindra-why-auto-stocks-are-in-red-today-ubs-2597849-2024-09-11",
      "headline": "Tata Motors, Maruti, M&M: Why auto stocks are in red today Among the major components of the BSE Auto index, Tata Motors Ltd experienced the largest drop, falling by 5.60%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/semicon-2024-5-things-pm-modi-shared-on-india-semiconductor-ambitions-chips-2597811-2024-09-11",
      "headline": "Semicon 2024: 5 things PM Modi shared on India's semiconductor ambitionsSemicon India 2024: PM Modi shared a plan to create a workforce of 85,000 skilled professionals, including technicians, engineers, and R&D experts, who will be industry-ready in the coming years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ubs-view-tata-motors-share-price-sell-rating-20-percent-downside-risk-investors-buy-or-sell-stock-2597798-2024-09-11",
      "headline": "UBS sees 20% downside potential in Tata Motors stock. Should you hold or sell? UBS, which holds a \"sell\" rating on the stock, cited concerns that moderating demand, rising discounts, and the absence of new internal combustion engine and hybrid launches could severely impact JLR's financial performance by fiscal 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindenburg-research-questions-madhabi-puri-buchs-silence-on-congress-allegations-2597756-2024-09-11",
      "headline": "Hindenburg questions Sebi chief Madhabi Buch's silence on Congress's new chargeHindenburg Research's statement comes after the Congress party raised fresh allegations about Buch's links to listed companies regulated by Sebi. The short-seller also said that Madhabi Puri Buch has remained silent on the accusations for weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suzlon-energy-share-price-upper-circuit-5-percent-up-more-gains-left-2597705-2024-09-11",
      "headline": "Suzlon Energy hits 5% upper circuit for 2nd straight day. More upside left?Suzlon Energy has seen its stock value more than triple in the last year, gaining 223% over the past 12 months and 102% in 2024 alone.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/semicon-india-2024-pm-modi-you-can-bet-on-india-when-chips-are-down-2597684-2024-09-11",
      "headline": "You can bet on India when chips are down: PM Modi at Semicon India 2024Semicon India 2024 is a three-day event aimed at showcasing India's semiconductor strategy and policies, with the goal of establishing the country as a global hub for semiconductor manufacturing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-shares-hit-52-week-high-5-percent-rise-early-trade-more-upside-expert-view-2597669-2024-09-11",
      "headline": "Zomato shares hit 52-week high. Is there more upside? Global brokerage firms like Jefferies and JP Morgan have also shown optimism, maintaining a 'buy' recommendation. Jefferies set a target price of Rs 335 for Zomato, reinforcing the positive sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-slumps-6-percent-today-ubs-sell-rating-2597653-2024-09-11",
      "headline": "Explained: Why Tata Motors shares slumped nearly 6% today At 11:30 am, Tata Motors shares were trading 5.57% lower at Rs 977.80 on the Bombay Stock Exchange."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-gain-in-volatile-trade-tata-motors-plunges-5-zomato-up-3-2597639-2024-09-11",
      "headline": "Sensex, Nifty gain in volatile trade, Tata Motors plunges 5%, Zomato up 3%The S&P BSE was up 106.96 points at 82,030.60, while the NSE Nifty50 rose 32.85 points to 25,073.95 at 11:20 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-india-layoff-job-cut-executive-roles-over-200-business-slowdown-report-2597628-2024-09-11",
      "headline": "Samsung India layoffs: Tech giant set to cut 200 jobs, says reportSamsung layoffs: The job cuts will affect various departments, including mobile phones, consumer electronics, home appliances, and support functions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahindra-pidilite-dr-reddy-deny-conflict-interest-claims-involving-sebi-chairperson-madhavi-buch-husband-dhaval-buch-2597403-2024-09-10",
      "headline": "Mahindra, Pidilite, Dr Reddy's refute conflict allegations involving Dhaval BuchMahindra & Mahindra, Dr. Reddy's Laboratories, and Pidilite Industries have refuted Congress's allegations of conflict of interest involving SEBI Chairperson Madhabi Puri Buch's husband. The companies clarified their engagements with Dhaval Buch were based on his expertise and predate her SEBI tenure.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-toll-rules-pay-only-for-distance-covered-no-charges-for-first-20-km-gnss-2597322-2024-09-10",
      "headline": "New toll rules: Pay only for distance covered, no charges for first 20 kmThe new toll rules are part of the revised National Highways Fee Rules, 2024, which now focus on a pay-as-you-go system based on the distance you travel beyond the initial 20 km."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-day-2-latest-subscription-booked-8x-expected-listing-gains-2597288-2024-09-10",
      "headline": "Bajaj Housing Finance IPO booked 8x on Day 2. Check expected listing gainsBajaj Housing Finance is offering its shares in the price range of Rs 66-70 each. Investors can apply for a minimum of 214 shares and in multiples thereafter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-assets-hit-record-rs-66-lakh-crore-in-august-amfi-data-sip-2597259-2024-09-10",
      "headline": "Mutual fund assets hit record Rs 66 lakh crore in AugustData from the Association for Mutual Funds in India (AMFI) shows that inflows into equity mutual funds rose by 3% in August, reaching Rs 38,239 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noida-property-prices-all-time-high-circle-rate-hike-proposal-homebuyers-plight-2597254-2024-09-10",
      "headline": "Noida's housing dream fades as proposed rate hike pushes homes out of reachNoida's once-affordable housing dream is slipping away as soaring property prices and a proposed circle rate hike threaten to push homeownership further out of reach for the urban middle class."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-higher-driven-by-rally-in-it-pharma-stocks-2597181-2024-09-10",
      "headline": "Sensex, Nifty end higher driven by rally in IT and pharma stocks The S&P BSE Sensex added 361.75 points to end at 81,921.29, while the NSE Nifty50 gained 104.70 points to close at 25,041.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-election-trump-kamala-harris-risk-looms-over-wall-street-but-there-are-bigger-threats-federal-reserve-rate-2597159-2024-09-10",
      "headline": "US election risk looms over Wall Street, but there are bigger threatsRight now, Wall Street is facing some uncertain moments as investors keep a close eye on the US stock rally, with the presidential election and other big economic factors coming into play."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/mahindra-group-denies-conflict-of-interest-allegations-regarding-payments-to-dhaval-buch-2597155-2024-09-10",
      "headline": "Mahindra Group rejects conflict of interest claims over payments to Dhaval BuchIn a stock exchange filing, the Mahindra Group has clarified that Dhaval Buch was hired for his supply chain expertise, unrelated to the Sebi approvals cited by the Congress party. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-plans-to-raise-rs-5000-crore-through-fresh-issue-2597106-2024-09-10",
      "headline": "Swiggy plans to raise Rs 5,000 crore in upcoming IPO through fresh issueThe Bengaluru-based firm had earlier planned to raise Rs 3,750 crore through fresh issue, along with an additional Rs 6,664 crore offer for sale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-subscription-4x-expected-listing-gain-gmp-close-to-100-percent-2597080-2024-09-10",
      "headline": "Bajaj Housing Finance IPO subscribed over 4x, GMP nears 100%Bajaj Housing Finance has demonstrated impressive growth, with a compound annual growth rate (CAGR) of 30.9% in AUM from Fiscal 2022 to 2024."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-rahul-gandhi-slams-national-security-anti-national-remarks-us-university-event-2597665-2024-09-11",
      "headline": "Amit Shah attacks Rahul Gandhi over 'anti-national statements' in USUnion Home Minister Amit Shah said Rahul Gandhi's statement \"lays bare the Congress's politics of causing rifts on the lines of regionalism, religion, and linguistic differences\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/kamala-harris-confident-body-language-handshake-donald-trump-presidential-debate-2597583-2024-09-11",
      "headline": "Kamala Harris confident, unscathed; Trump fails to deliver a knockoutAn aggressive Kamala Harris managed to get under her rival Donald Trump's skin, hammering him over his criminal convictions, his views on abortion rights and the size of his rallies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-kashmir-encounter-security-forces-terrorists-udhampur-2597803-2024-09-11",
      "headline": "Gunfight breaks out between security forces, terrorists in J&K's UdhampurSecurity forces and police personnel reached Udhampur's Basantgarh area after receiving information about the presence of terrorists. As the area was being cordoned off, the terrorists started firing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/actor-malaika-arora-father-dies-by-suicide-after-jumping-off-building-terrace-mumbai-police-2597680-2024-09-11",
      "headline": "Actor Malaika Arora's father jumps to death from building terrace Bollywood actor and model Malaika Arora's father, Anil Arora, died by suicide after jumping off a building terrace on Wednesday, police said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/us-presidential-debate-kamala-harris-donald-trump-lotus-squelches-former-potus-opinion-2597744-2024-09-11",
      "headline": "The big US presidential debate: Lotus squelches former PotusRepublicans are morose, while Democrats are optimistic – in fact, so optimistic that they have offered a second debate. The biggest revelation of Tuesday night: Harris is a gun owner, something that was written about in 2019 but was not widely known."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-rahul-gandhi-us-mp-visit-ilhan-omar-criticism-anti-india-friends-jab-criticism-2597747-2024-09-11",
      "headline": "BJP's 'anti-India friends' jab as Rahul Gandhi meets US lawmaker Ilhan OmarRahul Gandhi's meeting with Ilhan Omar, who is the representative for Minnesota's 5th congressional district, and is known for her critical stance on India, drew sharp criticism from the BJP."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-responds-taylor-swift-twitter-childless-cat-lady-endorses-kamala-harris-donald-trump-us-presidential-debate-2597620-2024-09-11",
      "headline": "Elon Musk's low blow to Taylor Swift: I'll give you a child, guard your catsElon Musk's remark came shortly after pop star Taylor Swift said she would be voting for Kamala Harris in the US presidential election in November following the latter's debate with Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindenburg-research-questions-madhabi-puri-buchs-silence-on-congress-allegations-2597756-2024-09-11",
      "headline": "Hindenburg questions Sebi chief Madhabi Buch's silence on Congress's new chargeHindenburg Research's statement comes after the Congress party raised fresh allegations about Buch's links to listed companies regulated by Sebi. The short-seller also said that Madhabi Puri Buch has remained silent on the accusations for weeks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/olympics/video/vinesh-phogat-claims-lack-of-support-during-olympic-ordeal-is-she-speaking-truth-2597727-2024-09-11",
      "headline": "Vinesh Phogat claims lack of support during Olympic ordeal: What's the truth?India Today's Nikhil Naz dissects Vinesh Phogat's explosive claims about lack of support and politics during her Paris Olympic ordeal. The former wrestler accused Indian Olympic Association chief PT Usha of not supporting her in Paris. Vinesh returned empty-handed from the Olympics after her appeal against disqualification was rejected. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/kamala-harris-donald-trump-debate-abc-news-us-presidential-debate-have-a-plan-added-a-day-ago-democrats-republicans-2597786-2024-09-11",
      "headline": "I have a plan, said Kamala Harris in debate. The plan was added just a day ago\"I have a plan, let us talk about our plans,\" Democratic candidate Kamala Harris challenged her Republican rival Donald Trump during their first presidential debate. The plan that Kamala Harris was flaunting was revealed just a day ago, and came after 50 days of Joe Biden withdrawing from the race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-rohit-sharma-top-5-virat-kohli-yashasvi-jaiswal-india-vs-bangladesh-2597795-2024-09-11",
      "headline": "Rohit Sharma returns to top 5 in ICC Test rankings ahead of Bangladesh seriesICC Test Rankings: India captain Rohit Sharma returned to the top five for the first time since 2021. Sri Lankan batters, including captain Dhananjaya de Silva and opener Pathum Nissanka, made significant gains after their productive outings in a recently concluded three-Test series in England. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/locals-cops-clash-in-shimla-during-protest-over-illegal-mosque-construction-2597707-2024-09-11",
      "headline": "Locals, cops clash in Shimla during protest over 'illegal' construction in mosquePolice resorted to lathicharge and use of water cannons in order to disperse the angry protesters while they were on their way to the mosque."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/himachal-student-ragged-belted-by-seniors-for-refusing-alcohol-2597750-2024-09-11",
      "headline": "Himachal student's violent ragging caught on camera, whipped for refusing alcohol The student filed a complaint with the police, stating that the final-year students had been harassing him for several days before they assaulted him two days ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-undeclared-martial-law-pti-imran-khan-islamabad-jalsa-crackdown-arrests-new-law-to-curb-protest-2597713-2024-09-11",
      "headline": "New Pakistan law triggers claims of undeclared martial lawThe government in Pakistan swooped down on party leaders and supporters of Imran Khan after their show of strength in Islamabad. It used a freshly-minted stringent law to arrest protesters, and the Chief Minister of Khyber Pakhtunkhwa was missing for hours. People are claiming an undeclared martial law has been imposed in Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/semicon-2024-5-things-pm-modi-shared-on-india-semiconductor-ambitions-chips-2597811-2024-09-11",
      "headline": "Semicon 2024: 5 things PM Modi shared on India's semiconductor ambitionsSemicon India 2024: PM Modi shared a plan to create a workforce of 85,000 skilled professionals, including technicians, engineers, and R&D experts, who will be industry-ready in the coming years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jayam-ravi-aarti-ravi-divorce-announcement-consent-blindsided-2597615-2024-09-11",
      "headline": "Jayam Ravi's wife Aarti: Divorce announcement was made without my consentJayam Ravi's estranged wife Aarti Ravi shared her first statement regarding the dissolution of their marriage. In the statement, she explained that she was blindsided by Ravi's announcement, which was made without her consent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/mg-windsor-ev-launched-in-india-at-rs-999-lakh-low-range-but-good-package-overall-2597809-2024-09-11",
      "headline": "MG Windsor EV launched in India at Rs 9.99 lakhMG Windsor EV's test drives will start on September 25, bookings will commence on October 3 and deliveries will begin on October 12."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/buddhism-spread-sopan-joshi-sri-lanka-burma-india-gautam-buddha-india-jatakas-texts-englightenment-sarnath-varanasi-2597194-2024-09-11",
      "headline": "How Buddhism rode on mangoes to spread in India and abroad is aam kahaniThe story of Buddhism is intricately woven with the mango. The fruit plays a crucial role in Jataka tales, which suggests how Buddha must have used the fruit to explain difficult concepts to the aam janta of his time. Buddhism also rode the mango to spread in India and abroad, writes Sopan Joshi in his new book."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/kamala-harris-donald-trump-us-presidential-debate-democrat-republican-reactions-2597582-2024-09-11",
      "headline": "'This was Kamala Harris's night': X users declare Democrat winner of debateThis was the first debate between Kamala Harris and Donald Trump after President Joe Biden ended his re-election bid in July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/greater-noida-test-afg-v-nz-can-produce-result-noida-rain-greater-noida-sports-complex-ground-2597774-2024-09-11",
      "headline": "Greater Noida Test: Despite 3-day washout, AFG v NZ can produce result. Here's howThe one-off Test between Afghanistan and New Zealand has seen back-to-back washouts on the first three days. However, the match can still produce a result, with the apt use of MCC Laws."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/2-friends-travelled-to-27-countries-without-taking-a-single-flight-here-is-how-2597802-2024-09-11",
      "headline": "2 friends travelled to 27 countries without taking a single flight. Here's howMeet Tommaso Farinam and Adrian Lafuente, two friends from Europe, who have journeyed across 27 countries in 15 months without stepping foot on a plane. Here's their full story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/kalaburagi-ola-showroom-fire-customer-service-shop-set-on-fire-karnataka-2597776-2024-09-11",
      "headline": "Upset over faulty Ola electric scooter, man sets showroom on fireA dissatisfied Ola electric scooter customer in Karnataka set a showroom on fire after an argument over his faulty vehicle, causing damages worth Rs 8.5 lakh to the shop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-rahul-gandhi-sikh-remarks-justify-khalistani-state-demand-gurpatwant-singh-pannun-2597619-2024-09-11",
      "headline": "Rahul Gandhi's remark on Sikhs justifies demand for Khalistan: Terrorist PannunKhalistani terrorist Gurpatwant Singh Pannun said Rahul Gandhi's statement on the \"existential threat to Sikhs in India is not only bold and pioneering, but is also firmly grounded in the factual history of what Sikhs have been facing under successive regimes in India since 1947\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/malaika-arora-reaches-homes-from-pune-after-father-anil-arora-dies-by-suicide-2597792-2024-09-11",
      "headline": "Malaika Arora reaches home from Pune after father Anil Arora dies by suicideActor Malaika Arora, who was in Pune, has reached her parents' home in Mumbai after learning about her father Anil Arora's death."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/video/video-arjun-kapoor-at-malaika-aroras-house-after-her-fathers-death-2597816-2024-09-11",
      "headline": "Video: Arjun Kapoor at Malaika Arora's house after her father's deathArjun Kapoor visited Malaika Arora's family home following the tragic death of her father. According to police officials, Anil Arora died by suicide after jumping from a building terrace."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/video/salim-khan-arrives-at-malaika-aroras-family-home-with-salma-and-sohail-2597800-2024-09-11",
      "headline": "Salim Khan arrives at Malaika Arora's family home with Salma and SohailBollywood actor and model Malaika Arora's father, Anil Arora, died by suicide after jumping off a building terrace on Wednesday, police said. Salim Khan arrived at Malaika's family home to offer condolences with his wife Salma and son Sohail Khan. Arbaaz Khan, Malaika's ex-husband, was one of the first to rush to her father's residence after finding out about his death. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/salim-khan-sohail-khan-salma-khan-malaika-arora-house-father-anil-arora-death-2597805-2024-09-11",
      "headline": "Pics: Salim Khan, Sohail Khan at Malaika Arora's house after her father's death The entire Khan family, including Salim Khan, Sohail Khan, Salma Khan and others arrived at Malaika Arora's family home after her father Anil Arora's death. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arjun-kapoor-at-malaika-arora-house-father-anil-arora-dies-by-suicide-2597799-2024-09-11",
      "headline": "Arjun Kapoor arrives at Malaika Arora's house after her father dies by suicideActor Arjun Kapoor visited Malaika Arora's home after her father's tragic death. As per police officials, Anil Arora died by suicide after jumping off a building terrace."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/marnus-labuschagne-charged-for-showing-dissent-at-umpires-decision-2597853-2024-09-11",
      "headline": "Labuschagne charged for showing dissent at umpire's decisionAustralian batsman Marnus Labuschagne has been charged with umpire dissent following a heated exchange during a T20 Max semi-final. The incident took place during a match between Redlands and Valleys at Allan Border Field in Brisbane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-joe-root-jasprit-bumrah-root-vs-bumrah-eng-vs-ind-2025-2597847-2024-09-11",
      "headline": "Michael Vaughan fires Jasprit Bumrah warning to in-form Joe Root for 2025 seriesFormer England captain Michael Vaughan feels India speedster Jasprit Bumrah will trouble the in-form Joe Root in the five-match series between two countries next year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-malaysia-8-1-asian-champions-trophy-hockey-china-2597839-2024-09-11",
      "headline": "India hammer Malaysia 8-1 to complete hat-trick in title defenceAsian Champions Trophy Hockey: India came up with a superlative attacking performance to beat Malaysia 8-1 on Wednesday, September 11. A hat-trick from Raj Kumar Pal and brace from Hundal Araijeet Singh were the highlights of India's dominant show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/after-shakib-al-hasan-mashrafe-mortaza-accused-for-attacks-in-bangladesh-unrest-2597840-2024-09-11",
      "headline": "After Shakib, Mashrafe Mortaza charged for accused in Bangladesh unrestFormer captain Mashrafe Mortaza has been named amongst the 90 accused in connection with attacks on students during unrest in Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-hails-winner-rishabh-pants-comeback-and-return-to-test-cricket-2597835-2024-09-11",
      "headline": "Ricky Ponting hails winner Rishabh Pant's comeback and return to Test cricketFormer Delhi Capitals head coach Ricky Ponting hailed Rishabh Pant's remarkable return to cricket. Pant would be returning to India's Test side in the 2-match series against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-tour-of-england-mitchell-marsh-t20-world-cup-reflection-2597826-2024-09-11",
      "headline": "T20 World Cup setback in the past, Marsh geared up for England challengeAustralia tour of England: Captain Mitchell Marsh said Australia are determined to do well in the upcoming limited-overs series, reflecting on the disappointment of the T20 World Cup exit. Australia play three T20Is and five ODIs in the UK. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-rohit-sharma-top-5-virat-kohli-yashasvi-jaiswal-india-vs-bangladesh-2597795-2024-09-11",
      "headline": "Rohit Sharma returns to top 5 in ICC Test rankings ahead of Bangladesh seriesICC Test Rankings: India captain Rohit Sharma returned to the top five for the first time since 2021. Sri Lankan batters, including captain Dhananjaya de Silva and opener Pathum Nissanka, made significant gains after their productive outings in a recently concluded three-Test series in England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-aus-jacob-bethell-new-superstar-australia-t20i-series-2597793-2024-09-11",
      "headline": "Who is Jacob Bethell? England set to unleash new 'superstar' ENG vs AUS: Jacob Bethell will be among the three debutants for England when the hosts lock horns with Australia in the opening T20I at the Rose Bowl in Southampton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/greater-noida-test-afg-v-nz-can-produce-result-noida-rain-greater-noida-sports-complex-ground-2597774-2024-09-11",
      "headline": "Greater Noida Test: Despite 3-day washout, AFG v NZ can produce result. Here's howThe one-off Test between Afghanistan and New Zealand has seen back-to-back washouts on the first three days. However, the match can still produce a result, with the apt use of MCC Laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-focussing-on-game-as-an-all-rounder-to-rise-through-domestic-ranks-2597777-2024-09-11",
      "headline": "Tilak Varma 'focussing on game as an all-rounder' to rise through domestic ranksTilak Varma revealed that he has been focussing on emerging as an all-rounder in red-ball cricket and would use the ongoing domestic season to showcase his prowess. He didnt feature in India A's playing XI in round one. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/olympics/video/vinesh-phogat-claims-lack-of-support-during-olympic-ordeal-is-she-speaking-truth-2597727-2024-09-11",
      "headline": "Vinesh Phogat claims lack of support during Olympic ordeal: What's the truth?India Today's Nikhil Naz dissects Vinesh Phogat's explosive claims about lack of support and politics during her Paris Olympic ordeal. The former wrestler accused Indian Olympic Association chief PT Usha of not supporting her in Paris. Vinesh returned empty-handed from the Olympics after her appeal against disqualification was rejected. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-rohit-sharma-top-5-virat-kohli-yashasvi-jaiswal-india-vs-bangladesh-2597795-2024-09-11",
      "headline": "Rohit Sharma returns to top 5 in ICC Test rankings ahead of Bangladesh seriesICC Test Rankings: India captain Rohit Sharma returned to the top five for the first time since 2021. Sri Lankan batters, including captain Dhananjaya de Silva and opener Pathum Nissanka, made significant gains after their productive outings in a recently concluded three-Test series in England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-aus-jacob-bethell-new-superstar-australia-t20i-series-2597793-2024-09-11",
      "headline": "Who is Jacob Bethell? England set to unleash new 'superstar' ENG vs AUS: Jacob Bethell will be among the three debutants for England when the hosts lock horns with Australia in the opening T20I at the Rose Bowl in Southampton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/greater-noida-test-afg-v-nz-can-produce-result-noida-rain-greater-noida-sports-complex-ground-2597774-2024-09-11",
      "headline": "Greater Noida Test: Despite 3-day washout, AFG v NZ can produce result. Here's howThe one-off Test between Afghanistan and New Zealand has seen back-to-back washouts on the first three days. However, the match can still produce a result, with the apt use of MCC Laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-focussing-on-game-as-an-all-rounder-to-rise-through-domestic-ranks-2597777-2024-09-11",
      "headline": "Tilak Varma 'focussing on game as an all-rounder' to rise through domestic ranksTilak Varma revealed that he has been focussing on emerging as an all-rounder in red-ball cricket and would use the ongoing domestic season to showcase his prowess. He didnt feature in India A's playing XI in round one. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/olympics/video/vinesh-phogat-claims-lack-of-support-during-olympic-ordeal-is-she-speaking-truth-2597727-2024-09-11",
      "headline": "Vinesh Phogat claims lack of support during Olympic ordeal: What's the truth?India Today's Nikhil Naz dissects Vinesh Phogat's explosive claims about lack of support and politics during her Paris Olympic ordeal. The former wrestler accused Indian Olympic Association chief PT Usha of not supporting her in Paris. Vinesh returned empty-handed from the Olympics after her appeal against disqualification was rejected. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/otd-in-2023-kohli-rahuls-hundreds-power-india-to-biggest-win-over-pakistan-in-asia-cup-2597717-2024-09-11",
      "headline": "OTD in 2023: Kohli-Rahul's hundreds power India to biggest win over PakistanOn this day last year, Virat Kohli and KL Rahul's blistering hundreds guided India to their biggest-ever win over Pakistan in Asia Cup 2023. India won the contest by 228 runs against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/usa-football-mauricio-pochettino-new-coach-inspiration-fifa-world-cup-2597698-2024-09-11",
      "headline": "New coach Mauricio Pochettino promises 'something special' for USA football The USA senior national men's team appointed former Chelsea boss Mauricio Pochettino as their new head coach on Tuesday. The Argentine tactician said the decision to join the USA team was influenced by more than just football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pm-narendra-modi-pr-sreejesh-indian-hockey-team-paris-olympics-2024-2597674-2024-09-11",
      "headline": "PM Modi's heartfelt letter for PR Sreejesh: 'The wall between victory and defeat' Prime Minister Narendra Modi wrote a heartfelt letter for former India hockey player PR Sreejesh hailing him for his contribution in the national team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kieron-pollard-unleashes-six-hitting-prowess-to-guide-tkr-to-win-in-cpl-2024-2597676-2024-09-11",
      "headline": "Kieron Pollard unleashes six-hitting prowess to guide TKR to win in CPL 2024 Kieron Pollard rewind the clock as he unleashed his six-hitting prowess during the match between Trinbago Knight Riders and St Lucia Kings at CPL 2024. Pollard hit an unbeaten fifty to guide TKR to the win. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vinesh-phogat-pt-usha-paris-olympics-2024-indian-olympic-association-cas-wrestling-2597652-2024-09-11",
      "headline": "Vinesh Phogat says no support from PT Usha, 'politics' played during Olympics sagaFormer India wrestler Vinesh Phogat has accused Indian Olympic Association President PT Usha for not providing her support during the Paris Olympics 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-reveals-goofy-1-side-apart-from-rigorous-training-in-insta-post-2597643-2024-09-11",
      "headline": "Rohit Sharma reveals goofy 1% side apart from rigorous training in Insta postRohit Sharma shared a video on his Instagram where he showcased and revealed his 1% goofy side apart from being involved in training the rest 99% of the time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afg-vs-nz-greater-noida-stadium-noida-weather-kane-williamson-hashmatullah-shahidi-tim-southee-2597611-2024-09-11",
      "headline": "AFG vs NZ: Persistent rain in Greater Noida washes out play on Day 3 of the TestThe Day 3 of the one-off Test between Afghanistan and New Zealand was once again abandoned due to incessant rain at the Greater Noida Sports Complex Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chris-gayle-first-t20i-hundred-t20-world-cup-2007-vs-south-africa-2597586-2024-09-11",
      "headline": "OTD 2007: Chris Gayle gets T20 World Cup off the mark with a breathtaking hundredOn September 11, 2007 West Indies batter Chris Gayle played a scintillating knock of117 (57) in the first match of maiden edition of the T20 World Cup."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vinesh-phogat-pt-usha-paris-olympics-2024-indian-olympic-association-cas-wrestling-2597652-2024-09-11",
      "headline": "Vinesh Phogat says no support from PT Usha, 'politics' played during Olympics sagaFormer India wrestler Vinesh Phogat has accused Indian Olympic Association President PT Usha for not providing her support during the Paris Olympics 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-reveals-goofy-1-side-apart-from-rigorous-training-in-insta-post-2597643-2024-09-11",
      "headline": "Rohit Sharma reveals goofy 1% side apart from rigorous training in Insta postRohit Sharma shared a video on his Instagram where he showcased and revealed his 1% goofy side apart from being involved in training the rest 99% of the time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afg-vs-nz-greater-noida-stadium-noida-weather-kane-williamson-hashmatullah-shahidi-tim-southee-2597611-2024-09-11",
      "headline": "AFG vs NZ: Persistent rain in Greater Noida washes out play on Day 3 of the TestThe Day 3 of the one-off Test between Afghanistan and New Zealand was once again abandoned due to incessant rain at the Greater Noida Sports Complex Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chris-gayle-first-t20i-hundred-t20-world-cup-2007-vs-south-africa-2597586-2024-09-11",
      "headline": "OTD 2007: Chris Gayle gets T20 World Cup off the mark with a breathtaking hundredOn September 11, 2007 West Indies batter Chris Gayle played a scintillating knock of117 (57) in the first match of maiden edition of the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-kl-rahul-form-safaraz-khan-bangladesh-tour-of-india-2597576-2024-09-11",
      "headline": "Time for Rahul to replay selectors as India's busy Test season beginsIndia vs Bangladesh: With India's Test season set to begin, KL Rahul's performance in the upcoming Bangladesh series will be crucial in solidifying his place in the squad, especially with a major tour of Australia looming on the horizon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendon-mccullum-hails-jos-buttler-as-englands-greatest-white-ball-player-2597572-2024-09-11",
      "headline": "Brendon McCullum hails Jos Buttler as England's 'greatest white-ball player'England's newly appointed white-ball head coach Brendon McCullum has hailed Jos Buttler as the greatest white ball player to play for England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-aus-t20i-series-philip-salt-mitchell-marsh-travis-head-jofra-archer-liam-livingstone-2597566-2024-09-11",
      "headline": "England vs Australia T20I series: H2H, all you need to knowEngland and Australia will renew their rivalry in T20Is as both teams will lock horns on September 11, Wednesday at The Rose Bowl in Southampton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/nations-league-kevin-de-bruyne-slams-belgium-team-mates-after-loss-to-france-2597497-2024-09-10",
      "headline": "Kevin de Bruyne slams Belgium team-mates after loss to FranceBelgium captain Kevin De Bruyne slammed his teammates and questioned the manager's tactical decisions after his team's 2-0 loss to France in the Nations League."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}