{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-capital-ipo-allotment-tomorrow-check-latest-subscription-listing-gain-gmp-2602821-2024-09-19",
      "headline": "Northern Arc Capital IPO allotment tomorrow: Check latest subscription, GMPNorthern Arc Capital Limited, founded in 2009, provides retail loans to underserved households and businesses across India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-higher-after-us-feds-50-bps-rate-cut-ntpc-gains-2602758-2024-09-19",
      "headline": "Sensex, Nifty end higher after US Fed's 50 bps rate cut; NTPC gainsThe S&P BSE Sensex ended 236.57 points higher at 83,184.80, while the NSE Nifty50 settled 38.25 points higher at 25,415.80. Both the indices had hit fresh all-time highs in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-working-on-new-income-tax-act-budget-2025-check-inside-details-2602746-2024-09-19",
      "headline": " Government working on new income tax act. Check inside detailsThe new tax framework aims to replace the current 1961 act, simplifying the tax process for individuals and businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rpsg-sanjiv-goenka-firstsource-expands-globally-eyes-usd-550-million-boost-from-ai-2602719-2024-09-19",
      "headline": "RPSG's Firstsource expands globally, eyes $550 million boost from AIThe expansion is part of Firstsource's strategy to improve its business margins while continuing to create jobs in India. For every position created in Australia, the company plans to create three jobs in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-react-to-us-fed-rate-cut-what-investors-need-to-know-expert-view-2602676-2024-09-19",
      "headline": "Gold prices react to US Fed rate cut: What investors need to knowThe US Federal Reserve's rate cuts aim to stabilise the economy but raise concerns about their impact on global markets, particularly on gold prices, a key investment in uncertain times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-gain-small-midcap-stocks-under-pressure-reason-explained-2602658-2024-09-19",
      "headline": "Explained: Why small and midcap stocks are under pressure todayPublic Sector Undertaking (PSU) stocks, particularly in sectors such as defence, railways, and non-banking financial companies (NBFCs), have been hit hard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-rate-cut-stock-market-protfolio-rebalancing-strategies-it-banking-largecap-expert-views-2602618-2024-09-19",
      "headline": "IT, banking, large-cap stocks: Strategies to boost portfolio after Fed rate cutWill the US Fed's rate cut boost opportunities on Dalal Street? Check these expert strategies to realign your portfolio. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hal-irfc-bhel-rvnl-pfc-irctc-cochin-shipyard-rec-stocks-fall-why-psu-stocks-are-under-pressure-2602600-2024-09-19",
      "headline": "HAL, IRFC, BHEL stocks fall: Here's why PSU stocks are under pressurePSU stocks fell even as India's benchmark indices, Sensex and Nifty, rose on the back of higher-than-expected interest rate cuts by the US Federal Reserve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-50-bps-rate-cut-impact-on-indian-economy-explained-2602573-2024-09-19",
      "headline": "Explained: What US Fed's 50 bps rate cut means for Indian economyThe Fed's decision signalled a shift towards easing monetary policy, with experts divided on its implications for the global economy, including India. Here's a detailed look at how the bigger-than-expected rate cut could impact the Indian economy and the broader market."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cisco-job-cut-thousands-in-second-biggest-layoff-of-2024-report-2602557-2024-09-19",
      "headline": "Cisco cuts thousands of jobs in second biggest layoff of 2024: Report This latest round of layoffs follows a previous cut in February when Cisco let go of about 4,000 employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-cuts-rates-by-50-bps-how-will-it-affect-indian-stock-market-expert-view-volatility-it-fmcg-defence-2602546-2024-09-19",
      "headline": "US Fed cuts rates by 50 bps: How will it affect Indian stock market?This is the first time the Fed has reduced rates since 2020, and it has been done to address slowing economic growth and easing inflation in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-record-highs-jumps-600-points-crosses-25000-first-time-2602473-2024-09-19",
      "headline": "Sensex jumps over 700 points, Nifty crosses 25,500 for 1st time; IT stocks gainThe S&P BSE Sensex was up 758.7 points at 83,706.93 at 9:41 am, while the NSE Nifty50 gained 215.40 points to trade at 25,592.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-slashes-rates-by-50-bps-in-first-rate-reduction-since-2020-2602387-2024-09-18",
      "headline": "US Fed slashes rates by 50 bps in first rate reduction since 2020Policymakers see the Fed's benchmark rate falling by another half of a percentage point by the end of this year, another full percentage point in 2025, and by a final half of a percentage point in 2026 to end in a 2.75 per cent-3.00 per cent range."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-rate-decision-live-news-updates-today-at-1130-pm-5-things-to-watch-out-2602214-2024-09-18",
      "headline": "US Fed rate decision today at 11:30 pm – 5 things to watch outMarkets are widely expecting a 25-basis-point cut in the key interest rate, marking the first reduction in four years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tupperware-files-for-bankruptcy-chapter-11-once-household-name-struggles-to-stay-afloat-2602163-2024-09-18",
      "headline": "Tupperware, once a household name, files for bankruptcyTupperware Brands and some of its subsidiaries filed for Chapter 11 bankruptcy protection on Tuesday. The company, widely known for its food storage containers, has been struggling with falling sales in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-explained-details-how-to-invest-eligibility-criteria-online-buying-guide-2602103-2024-09-18",
      "headline": " NPS Vatsalya: How to invest, eligibility criteria, and online buying guideNPS Vatsalya enables parents or guardians to open a pension account for minors and contribute as little as Rs 1,000 annually, making it accessible to families from various economic backgrounds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-stocks-profit-booking-us-fed-rate-cut-decision-explained-2602086-2024-09-18",
      "headline": "Explained: Why IT stocks faced profit booking ahead of US Fed rate decisionMphasiS led the decline, dropping 5.6%, followed by L&T Technology Services, Persistent Systems, Tata Consultancy Services, HCL Technologies, and Tech Mahindra, which saw losses ranging from 3% to 4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-fall-amid-profit-booking-in-it-stocks-tcs-shares-fall-4-percent-2602047-2024-09-18",
      "headline": "Sensex, Nifty fall amid profit booking in IT stocks; TCS falls 4%The S&P BSE Sensex closed 131.43 points down at 82,948.23, whille the NSE Nifty50 lost 41 points to end at 25,377.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-infra-shares-hit-20-upper-circuit-whats-next-2602045-2024-09-18",
      "headline": "Reliance Infra shares hit 20% upper circuit. What's next? The sharp uptick in Reliance Infra's share price followed the company's announcement of a significant reduction in its standalone external debt, from Rs 3,831 crore to Rs 475 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-cross-rs-700-for-the-first-time-since-january-more-room-to-rise-2602021-2024-09-18",
      "headline": "Paytm shares cross Rs 700 for the first time since January. More room to rise?\tBefore today, the last time Paytm traded above Rs 700 was in late January, closing at Rs 761."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-strikes-lebanon-hezbollah-chief-speech-on-pager-walkie-talkie-blasts-2602950-2024-09-19",
      "headline": "Israel launches strikes across Lebanon during Hezbollah chief's speech Live UpdatesIsrael Defense Forces (IDF) said that it is currently striking Hezbollah targets in Lebanon to degrade the terror group's capabilities and infrastructure. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/tirupati-laddoos-contain-animal-fat-fish-oil-confirms-lab-report-ysrcp-tdp-2602893-2024-09-19",
      "headline": "Tirupati laddoos contain beef fat, fish oil, confirms lab reportA report by a private laboratory has revealed that the samples of the ghee used in making Tirupati laddoos contained foreign fat, including palm oil, fish oil, beef tallow and lard (obtained by rendering the fatty tissue of a pig)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/speculative-and-misleading-india-on-report-claiming-diversion-of-indian-ammunition-entering-ukraine-2602935-2024-09-19",
      "headline": "Speculative, misleading: India on report of diversion of ammunition to UkraineThe Ministry of External Affairs (MEA) has rejected the claims made by news agency Reuters that artillery shells sold by Indian arms makers were diverted by European customers to Ukraine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ey-india-employee-anna-perayil-death-chairman-rajiv-memani-denies-work-pressure-claim-2602925-2024-09-19",
      "headline": "EY India Chairman denies work pressure as reason for employee's death: ReportThe death of a 26-year-old Ernst & Young employee, Anna Sebastian Perayil, has sparked outrage after her mother's emotional letter went viral, raising concerns over work pressure within the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/emily-in-paris-netflix-lily-collins-2602829-2024-09-19",
      "headline": "I hate you (like I love you), Emily in ParisEmily Cooper's French visa is not expiring anytime soon. She is going to be on Netflix, and in our lives, for a long time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-us-court-summons-government-plot-murder-khalistani-terroirst-gurpatwant-pannun-2602747-2024-09-19",
      "headline": "India reacts after US court summons government in plot to murder Gurpatwant PannunThe US District Court for Southern District of New York named the Government of India, National Security Advisor Ajit Doval, former R&AW chief Samant Goel, in the summons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hezbollah-pager-blast-manufactured-shell-company-bac-explosive-pagers-covert-operation-lebanon-hungary-2602750-2024-09-19",
      "headline": "Israel didn't just rig Hezbollah pagers, it actually made those explosive pagersAfter thousands of pagers of Hezbollah fighters exploded in Lebanon, it was believed that Israel had somehow penetrated the supply chain and rigged the devices with explosives. However, jaw-dropping reports now suggest that Israel might have created shell companies that actually manufactured those explosive pagers for Hezbollah. Here's how it managed the unthinkable."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/chennai/story/delivery-boy-suicide-customer-scolding-delay-tamil-nadu-chennai-2602814-2024-09-19",
      "headline": "Food delivery agent ends own life after customer scolded him for delay in orderA 19-year-old food delivery executive died by suicide after being scolded by a customer for a delayed delivery in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-cm-designate-atishi-singh-aam-aadmi-party-news-aap-arvind-kejriwal-future-assembly-election-2025-party-unity-2602595-2024-09-19",
      "headline": "Can Kejriwal take AAP unity for granted?Politics is what takes place between what's said and what's left unsaid. Most AAP leaders said that Kejriwal would return after the election, and that's exactly why they have agreed to Atishi as the CM. What's unsaid is that Atishi is a stop-gap solution. But will AAP unity stand the test if Atishi continues as the CM? Will personal ambitions create a fissure within the ranks?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-chennai-test-day-1-r-ashwin-ravindra-jadeja-score-2602801-2024-09-19",
      "headline": "On a strange Chennai day, Ashwin and Jadeja lead a familiar rescue actIndia vs Bangladesh, 1st Test: R Ashwin and Ravindra Jadeja led a familiar rescue act for India, stitching an unbeaten 195-run partnership on Thursday. Bangladesh dominated the first half of a strangely overcast day in Chennai, but Inida fought back to take control. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/pm-modi-jammu-kashmir-election-pakistan-happy-congress-national-conference-support-2602762-2024-09-19",
      "headline": "Pakistan going 'balle-balle' over Congress-National Conference manifesto: PMPM Modi said while nobody is giving the Congress and National Conference any importance in Jammu and Kashmir, \"Pakistan main inki balle balle ho rahi hai\" (they are being celebrated in Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-water-supply-cut-civil-lines-hindu-rao-hospital-kamla-nagar-shakti-nagar-karol-bagh-maintenance-work-delhi-jal-board-2602941-2024-09-19",
      "headline": "Delhi water supply to be hit tomorrow, check list of affected areasWater supply will be affected in Civil Lines, Hindu Rao Hospital, Kamla Nagar, Shakti Nagar, Karol Bagh, Pahar Ganj, Inderpuri and several other parts of Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/when-priest-protested-against-amitabh-bachchan-jaya-bachchan-inter-caste-marriage-2602891-2024-09-19",
      "headline": "When priest protested against Amitabh-Jaya Bachchan's inter-caste marriageAmitabh Bachchan and Jaya Bachchan got married on June 3, 1973. Jaya's father Taroon Coomar Bhadhuri shared the details of their wedding in a 1989 article. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/justin-trudeau-liberal-party-loss-montreal-toronto-pm-approval-rating-grand-exit-2025-canada-election-2602646-2024-09-19",
      "headline": "How recent losses predict a Trudeau grand exitThe party of Canadian Prime Minister Justin Trudeau recently lost the byelection in Montreal, a safe seat. Seen together with the defeat in Toronto, another Liberal Party fortress, in June, and his plunging approval ratings, it could be a marker for Trudeau's grand exit in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-one-r-ashwin-hundred-chennai-chepauk-2602786-2024-09-19",
      "headline": "IND vs BAN: R Ashwin haunts Bangladesh again with 6th Test hundred in ChennaiR Ashwin has come to haunt Bangladesh once again as he scored his 6th Test hundred on Thursday, September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/nafrat-ka-saaman-mohabbat-ki-dukaan-pm-modi-targets-rahul-gandhi-jammu-rally-2602748-2024-09-19",
      "headline": "Congress heir went to US, said our 'devi-devta' are not God: PM jabs Rahul GandhiAddressing an election rally in Jammu, PM Modi said that Rahul Gandhi and the Congress can put faith and culture at stake for a few votes anytime. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-cobbler-ramayya-uncle-stray-animals-internet-helps-emotional-video-2602873-2024-09-19",
      "headline": "Bengaluru cobbler who pets stray animals gets help from Internet. Emotional videoRamayya Uncle, who has a tiny shop in Bengaluru's Whitefield, not only repairs shoes within that space but also provides a home to four dogs and a kitten. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-turns-59-astronaut-celebrates-birthday-400-km-above-earth-2602858-2024-09-19",
      "headline": "Sunita Williams turns 59: Astronaut celebrates birthday 400 km above EarthThis marks the second time Williams has celebrated her birthday in space, having previously done so during a 2012 mission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/woman-killed-body-severed-chennai-cops-recover-body-crime-tamil-nadu-2602566-2024-09-19",
      "headline": "Woman's body chopped up, found stuffed inside suitcase lying on Chennai roadThe Chennai Police detained a man after they found a woman's dismembered body in a suitcase, 100 metres away from his home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-mumbai-expressway-pothole-kcc-buildcon-nhai-terminate-employee-2602521-2024-09-19",
      "headline": "Employee blames rats for hole in Delhi-Mumbai highway, company fires himThe firm stated that the comment was made by a junior employee who had no technical understanding regarding the project and confirmed that he had been terminated from the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/stree-2-has-surpassed-jawan-at-box-office-but-its-not-what-you-think-check-detailed-box-office-report-2602866-2024-09-19",
      "headline": "Stree 2 has surpassed Jawan at box office but it's not what you think! Stree 2 is scripting history at the box office. But, there's one part of the story that's yet to be written: surpassing the lifetime collection of Jawan at the domestic ticket window. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/centre-probing-ernst-and-young-pune-woman-death-mother-work-pressure-2602594-2024-09-19",
      "headline": "Government probing EY India employee's death due to 'excessive workload'The incident has led to a massive outrage on social media after a letter written by the Pune woman's mother to the head of Ernst & Young India went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/pm-has-many-meetings-cant-confirm-specifics-india-on-modi-trump-us-meet-2602712-2024-09-19",
      "headline": "PM has many meetings, can't confirm specifics: India on Modi-Trump US meetPM Modi is scheduled to visit the US on a three-day trip to attend the sixth Quad Summit being held on September 21. The summit was initially supposed to be hosted by India, but the venue was moved at the US's request. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-vikarabad-hindu-muslim-communities-erection-of-flags-police-2602715-2024-09-19",
      "headline": "Communal tension in Telangana over erection of flags, police use lathichargeThe incident took place when a group of men, belonging to the Muslim community, erected a green flag at the site, which was later removed and discarded onto the road by members of the Hindu community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/sunil-grover-on-reuniting-with-kapil-sharma-after-fallout-mazaa-aa-raha-hai-2602976-2024-09-19",
      "headline": "Sunil Grover on reuniting with Kapil Sharma after fallout: Mazaa aa raha haiActor-comedian Sunil Grover talks about reuniting with Kapil Sharma on the Netflix show The Great Indian Kapil Show. Kapil and Sunil had a fallout, allegedly on a flight while returning to India from a tour in Australia in 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/photo/5-salman-khan-movies-you-must-watch-2602977-2024-09-19",
      "headline": "6 Salman Khan movies you must watchSalman Khan, in his career spanning over 35 years, has delivered several hits. Have a look at his top 6 films that you just should not miss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyami-kher-becomes-1st-indian-female-actor-to-finish-ironman-triathlon-in-germany-2602569-2024-09-19",
      "headline": "Saiyami Kher becomes 1st Indian female actor to finish Ironman Triathlon in GermanyBollywood actor Saiyami Kher set a new benchmark by becoming the first Indian female actor to complete the Ironman 70.3 triathlon in Germany. The event comprised of a 1.9 km swim, 90 km cycling, and a 21.1 km run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/cannes-winner-all-we-imagine-as-light-to-release-in-limited-screens-in-kerala-september-21-payal-kapadia-2602964-2024-09-19",
      "headline": "Cannes winner All We Imagine As Light to release in limited screens in KeralaAll We Imagine As Light, a Grand Prix winner at the 77th Cannes Film Festival, will make its limited screen debut in Kerala on Saturday, September 21. Spirit Media has secured exclusive distribution rights for this Indo-French co-production."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-champions-cup-babar-azam-sarfaraz-ahmed-stallions-troll-century-2602960-2024-09-19",
      "headline": "Sarfaraz Ahmed trolls Babar Azam. Star batter responds with hundredPakistan Champions Cup: Babar Azam raced his way to scoring 104 off 100 balls against the Dolphins on Thursday, September 19 at the Iqbal Stadium in Faisalabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-1st-test-chennai-yashasvi-jaiswal-press-conference-2602944-2024-09-19",
      "headline": "Hungry Yashasvi Jaiswal has no complaints about pace-friendly Chennai conditionsIndia vs Bangladesh: Opener Yashasvi Jaiswal was willing to look ugly and put his attacking instincts on the back seat as he survived a tough first session on Day 1 of the Chennai Test. Yashasvi hit a fifty when the rest of the top-order failed in tricky conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-banladesh-test-r-ashwin-ravindra-jadeja-all-round-heroics-sachin-tendulkar-chennai-2602940-2024-09-19",
      "headline": "Invaluable all-round brilliance: Tendulkar on Ashwin-Jadeja Chennai heroicsR Ashwin and Ravindra Jadeja's game-changing 195-run partnership rescued India after a top-order collapse against Bangladesh. Their unbeaten knocks drew praise from cricket legends, including Sachin Tendulkar, for turning the tide on Day 1 in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-sachin-tendulkar-rahul-dravid-ms-dhoni-records-stats-chepauk-test-2602926-2024-09-19",
      "headline": "Stat Pack: Ashwin emulates Dhoni, Dravid, after Chepauk Test hundredIND vs BAN: Ravi Ashwin scored an unbeaten 102 off 112 balls as India raced their way to 339 for six at Stumps on Day 1 of the opening Test at the MA Chidambaram Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-1st-test-day-2-score-kane-williamson-tom-latham-2602903-2024-09-19",
      "headline": "Kane Williamson, Tom Latham lead strong New Zealand reply on Day 2Sri Lanka vs New Zealand, 2nd Test: Tom Latham and Kane Williamson came up with solid fifties as New Zealand put themselves in a position of strength against hosts Sri Lanka on a rain-hit Day 2 in Galle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-tamim-iqbal-bangladesh-india-bangladesh-2602896-2024-09-19",
      "headline": "Bangladesh missed a trick by holding back Shakib: Tamim IqbalIND vs BAN: Shakib Al Hasan did not have the best of days after he had figures of 8-0-50-0 on Day 1 of Bangladesh's first Test against India at the MA Chidambaram Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-r-ashwin-century-memes-social-media-watch-chennai-2602895-2024-09-19",
      "headline": "R Ashwin's Chennai Test century ignites meme-fest on social mediaRavichandran Ashwin's century in India's first Test against Bangladesh not only turned the game in India's favor but also sparked a meme-fest on social media, with fans humorously celebrating his evolution into a dependable middle-order batsman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-r-ashwin-century-rishabh-pant-mindset-aggressive-batting-2602868-2024-09-19",
      "headline": "Go hard like Rishabh: R Ashwin reveals mantra behind Chennai Test hundredRavichandran Ashwin revealed that he adopted Rishabh Pant's aggressive batting style to score a crucial century, partnering with Ravindra Jadeja to rescue India after a top-order collapse on Day 1 of the Chennai Test against Bangladesh, taking India to 339/6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-sachin-tendulkar-chepauk-record-ind-vs-ban-2602822-2024-09-19",
      "headline": "R Ashwin emulates Tendulkar with back-to-back hundreds at ChepaukIND vs BAN: R Ashwin racked up his second Test hundred at the Chepauk and continued his love affair with the iconic venue in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-kl-rahul-dismissal-disappointing-zaheer-khan-chennai-2602810-2024-09-19",
      "headline": "KL Rahul's dismissal after getting set was disappointing: Zaheer KhanKL Rahul's dismissal after getting set at the crease in India's first Test against Bangladesh disappointed former pacer Zaheer Khan, who stressed Rahul missed a crucial opportunity to stabilize India's innings following an early top-order collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-chennai-test-day-1-r-ashwin-ravindra-jadeja-score-2602801-2024-09-19",
      "headline": "On a strange Chennai day, Ashwin and Jadeja lead a familiar rescue actIndia vs Bangladesh, 1st Test: R Ashwin and Ravindra Jadeja led a familiar rescue act for India, stitching an unbeaten 195-run partnership on Thursday. Bangladesh dominated the first half of a strangely overcast day in Chennai, but Inida fought back to take control. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-r-ashwin-century-memes-social-media-watch-chennai-2602895-2024-09-19",
      "headline": "R Ashwin's Chennai Test century ignites meme-fest on social mediaRavichandran Ashwin's century in India's first Test against Bangladesh not only turned the game in India's favor but also sparked a meme-fest on social media, with fans humorously celebrating his evolution into a dependable middle-order batsman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-r-ashwin-century-rishabh-pant-mindset-aggressive-batting-2602868-2024-09-19",
      "headline": "Go hard like Rishabh: R Ashwin reveals mantra behind Chennai Test hundredRavichandran Ashwin revealed that he adopted Rishabh Pant's aggressive batting style to score a crucial century, partnering with Ravindra Jadeja to rescue India after a top-order collapse on Day 1 of the Chennai Test against Bangladesh, taking India to 339/6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-sachin-tendulkar-chepauk-record-ind-vs-ban-2602822-2024-09-19",
      "headline": "R Ashwin emulates Tendulkar with back-to-back hundreds at ChepaukIND vs BAN: R Ashwin racked up his second Test hundred at the Chepauk and continued his love affair with the iconic venue in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-kl-rahul-dismissal-disappointing-zaheer-khan-chennai-2602810-2024-09-19",
      "headline": "KL Rahul's dismissal after getting set was disappointing: Zaheer KhanKL Rahul's dismissal after getting set at the crease in India's first Test against Bangladesh disappointed former pacer Zaheer Khan, who stressed Rahul missed a crucial opportunity to stabilize India's innings following an early top-order collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-chennai-test-day-1-r-ashwin-ravindra-jadeja-score-2602801-2024-09-19",
      "headline": "On a strange Chennai day, Ashwin and Jadeja lead a familiar rescue actIndia vs Bangladesh, 1st Test: R Ashwin and Ravindra Jadeja led a familiar rescue act for India, stitching an unbeaten 195-run partnership on Thursday. Bangladesh dominated the first half of a strangely overcast day in Chennai, but Inida fought back to take control. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-one-r-ashwin-hundred-chennai-chepauk-2602786-2024-09-19",
      "headline": "IND vs BAN: R Ashwin haunts Bangladesh again with 6th Test hundred in ChennaiR Ashwin has come to haunt Bangladesh once again as he scored his 6th Test hundred on Thursday, September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/laver-cup-2024-live-streaming-squads-schedule-carlos-alcaraz-bjorn-borg-2602775-2024-09-19",
      "headline": "Laver Cup 2024: Squads, schedule and when and all you need to knowLaver Cup 2024: Casper Ruud, Carlos Alcaraz, Taylor Fritz and several other stars will light up the tournament which is scheduled to take place across three days. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-2024-points-system-duleep-trophy-2024-format-2602764-2024-09-19",
      "headline": "Duleep Trophy 2024: How is winner decided without final? Points system explainedThe Duleep Trophy 2024-25 is in its final round and the winner of the tournament will be decided on the basis of the points table. Here's a look at the points system for the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/la-liga-fc-barcelona-fermin-lopez-injury-hansi-flick-guilty-spain-national-team-2602759-2024-09-19",
      "headline": "'Feel a bit guilty for Fermin Lopez's injury': FC Barcelona coach Hansi FlickFC Barcelona coach Hansi Flick expressed regret over Fermin Lopez's injury, acknowledging it could have been prevented with better management. As Barcelona prepares for their Champions League clash against AS Monaco, they face increasing challenges due to key injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-chennai-r-ashwin-ravindra-jadeja-partnership-record-kapil-dev-kirmani-2602757-2024-09-19",
      "headline": "R Ashwin-Ravindra Jadeja join Kapil Dev-Kirmani in elite Test partnership listIndia vs Bangladesh, Chennai Test: R Ashwin and Ravindra Jadeja became only the second Indian batting pair at No. 7 or below to score at least 500 runs in Tests at home. The spin twins steered India out of trouble on Day 1 of the first Test in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-ravindra-jadeja-sword-celebration-half-century-ma-chidambaram-2602755-2024-09-19",
      "headline": "Jadeja hits iconic sword celebration after Chennai rescue actRavindra Jadeja's iconic sword celebration followed his crucial half-century, reviving India's innings alongside R Ashwin after an early collapse on Day 1 of the first Test against Bangladesh in Chennai, bringing fresh hope to the home side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cpl-2024-dwayne-bravo-guard-of-honour-tkr-teammates-farewell-season-2602749-2024-09-19",
      "headline": "Bravo gets guard of honour from TKR teammates in farewell CPL seasonCPL 2024: Trinbago Knight Riders (TKR) paid respects to Dwayne Bravo and gave him a guard of honour before the match against Guyana Amazon Warriors on Wednesday. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/la-liga-fc-barcelona-fermin-lopez-injury-hansi-flick-guilty-spain-national-team-2602759-2024-09-19",
      "headline": "'Feel a bit guilty for Fermin Lopez's injury': FC Barcelona coach Hansi FlickFC Barcelona coach Hansi Flick expressed regret over Fermin Lopez's injury, acknowledging it could have been prevented with better management. As Barcelona prepares for their Champions League clash against AS Monaco, they face increasing challenges due to key injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-chennai-r-ashwin-ravindra-jadeja-partnership-record-kapil-dev-kirmani-2602757-2024-09-19",
      "headline": "R Ashwin-Ravindra Jadeja join Kapil Dev-Kirmani in elite Test partnership listIndia vs Bangladesh, Chennai Test: R Ashwin and Ravindra Jadeja became only the second Indian batting pair at No. 7 or below to score at least 500 runs in Tests at home. The spin twins steered India out of trouble on Day 1 of the first Test in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-ravindra-jadeja-sword-celebration-half-century-ma-chidambaram-2602755-2024-09-19",
      "headline": "Jadeja hits iconic sword celebration after Chennai rescue actRavindra Jadeja's iconic sword celebration followed his crucial half-century, reviving India's innings alongside R Ashwin after an early collapse on Day 1 of the first Test against Bangladesh in Chennai, bringing fresh hope to the home side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cpl-2024-dwayne-bravo-guard-of-honour-tkr-teammates-farewell-season-2602749-2024-09-19",
      "headline": "Bravo gets guard of honour from TKR teammates in farewell CPL seasonCPL 2024: Trinbago Knight Riders (TKR) paid respects to Dwayne Bravo and gave him a guard of honour before the match against Guyana Amazon Warriors on Wednesday. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-ravindra-jadeja-ind-vs-ban-chennai-test-2602742-2024-09-19",
      "headline": "Watch: R Ashwin leaves fans stunned with effortless six against Shakib al HasanStar India all-rounder Ravichandran Ashwin left the fans stunned with his effortless shot against Shakib al Hasan on Day 1 of the first Test against Bangladesh in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-fails-again-out-for-his-second-duck-in-duleep-trophy-2602744-2024-09-19",
      "headline": "Shreyas Iyer fails again, out for his second duck in Duleep Trophy Duleep Trophy 2024: Shreyas Iyer's form woes continued in the ongoing season as he registered his second duck of the tournament during India D's third-round clash against India B."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sumit-nagal-issues-clarification-after-aita-slams-star-for-not-playing-davis-cup-2602726-2024-09-19",
      "headline": "Sumit Nagal issues clarification after AITA slams star for not playing Davis CupSumit Nagal has offered clarification as to why he decided to skip the Davis Cup after getting backlash from the All India Tennis Association (AITA) recently. Nagal reiterated his desire to play for the country in his lengthy statement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-set-to-have-scan-on-hamstring-injury-ahead-of-pakistan-tour-2602696-2024-09-19",
      "headline": "Ben Stokes set to have scan on hamstring injury ahead of Pakistan tourEngland captain Ben Stokes is scheduled for a hamstring scan next week as the team evaluates his fitness for the upcoming Test series against Pakistan. The 33-year-old all-rounder has been sidelined since August due to the injury but remains active in training."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}