{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/imf-billion-dollar-loan-pakistan-criticims-india-abstains-from-voting-explained-2722671-2025-05-10",
      "headline": "Explained: Why the IMF is under fire for $1 billion loan to PakistanThe disbursement, approved on Friday under the Extended Fund Facility (EFF), raises total payouts under the programme to $2.1 billion. But the timing of the announcement has provoked a fierce backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-india-pakistan-tensions-what-it-means-for-dalal-street-investors-2722620-2025-05-10",
      "headline": "India–Pakistan tensions escalate. What's next for Dalal Street investors?While the Sensex and Nifty ended over 1% lower in the previous session, experts suggest that the decline was far less than what could have been expected in such a volatile environment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharama-asks-banks-to-stay-on-alert-amid-rising-indo-pak-tensions-2722375-2025-05-09",
      "headline": "Nirmala Sitharama asks banks to stay on alert amid rising Indo-Pak tensionsThe directive comes a day after India successfully intercepted multiple missile and drone attacks launched from Pakistan late on May 8. While India reported no major damage, the government has since asked all critical institutions to bolster their cybersecurity infrastructure in anticipation of potential retaliatory attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/go-homestays-cuts-ties-with-turkish-airlines-over-anti-india-stand-2722299-2025-05-09",
      "headline": "'Unsupportive stance towards India': Go Homestays ends ties with Turkish AirlinesGo Homestays ends ties with Turkish Airlines after Turkey backs Pakistan following 'Operation Sindoor'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/india-pak-tensions-oil-psus-assure-ample-fuel-stocks-urge-against-panic-buying-2722194-2025-05-09",
      "headline": "India-Pak tensions: Oil PSUs assure ample fuel stocks, urge against panic buyingIndian oil companies have issued statements assuring ample fuel stocks across the country. The Indian Oil Corporation and Bharat Petroleum Corporation Limited have emphasised that there is no shortage of petrol, diesel, CNG, or LPG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bharti-airtel-in-talks-to-acquire-49-percent-stake-in-haier-india-report-2722238-2025-05-09",
      "headline": "Bharti Airtel in talks to acquire 49% stake in Haier India: ReportSunil Mittal, the billionaire-founder of Indian telecom operator Bharti Airtel, has partnered with private equity firm, Warburg Pincus to buy a substantial stake in Haier India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/telecom-regulator-trai-recommends-5-year-satellite-spectrum-allotment-report-2722224-2025-05-09",
      "headline": "Telecom regulator recommends 5-year satellite spectrum allotment: ReportThe move comes amid growing interest in satellite internet services from global players like Elon Musk's Starlink and domestic telecom giants."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-880-points-lower-nifty-above-24000-titan-ends-4-percent-up-2722207-2025-05-09",
      "headline": "Sensex closes 880 points lower, Nifty above 24,000; Titan ends 4% upThe S&P BSE Sensex lost 880.34 points to end at 79,454.47, while the NSE Nifty50 was down by 265.80 points to close at 24,008.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-faces-no-shortage-of-essentials-items-government-amid-rising-tensions-pakistan-war-2722173-2025-05-09",
      "headline": "Essential goods supply to remain unaffected across India amid geopolitical heatPrices of key food items, including pulses and vegetables, are being watched closely to make sure they stay under control. Efforts are also being made to keep the supply of these items steady across all cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-an-fd-in-2025-check-these-6-banks-offering-attractive-interest-rates-2722156-2025-05-09",
      "headline": "Planning an FD in 2025? Check these 6 banks offering attractive interest ratesFor fixed deposits between 15 and 21 months, HDFC Bank is offering 7.05% to general citizens, while senior citizens get 7.55%"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-pakistan-tensions-finance-minister-nirmala-sitharaman-review-cyber-readiness-banks-financial-institutions-2722163-2025-05-09",
      "headline": "Finance Minister to review cyber readiness of banks, financial institutionsThe meeting will bring together representatives from several key institutions like the Reserve Bank of India (RBI), the National Payments Corporation of India (NPCI), the Bombay Stock Exchange (BSE), the National Stock Exchange (NSE), etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-share-price-jumped-over-7-percent-today-key-reasons-explained-2722110-2025-05-09",
      "headline": "Explained: Why Yes Bank share price jumped over 7% todayThe Yes Bank stock has now gained nearly 11% over the past five sessions, sparking investor curiosity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-crosses-100000-dollars-again-as-us-uk-trade-deal-lifts-market-mood-2722020-2025-05-09",
      "headline": "Bitcoin crosses $100,000 again, as US-UK trade deal lifts market moodThe announcement of a fresh trade deal between US President Donald Trump and UK Prime Minister Keir Starmer helped lift market mood across sectors and gave crypto investors an added reason to feel positive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/yes-securities-raises-paytm-target-to-rs-975-on-profitability-turnaround-and-surge-in-merchant-lending-2722100-2025-05-09",
      "headline": "YES Securities raises Paytm target to Rs 975 on profitability turnaround and surge in merchant lendingContribution margin rises to 56.1%, EBITDA turns positive before ESOP costs, and merchant loan volumes gain traction under DLG model."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/equity-mutual-fund-inflows-hit-one-year-low-in-april-amid-tariff-worries-says-amfi-2722081-2025-05-09",
      "headline": "Equity mutual fund inflows hit 1-year low in April amid tariff worries, says AMFIIndia's equity mutual fund inflows eased for a fourth month in April, dropping to Rs 242.69 billion, the weakest level in a year, reveals AMFI data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-dip-explained-in-5-points-sensex-down-500-points-india-pakistan-military-conflict-rising-tensions-2722059-2025-05-09",
      "headline": "Sensex tumbles 800 points: Why is the stock market falling today?The BSE Sensex was trading 722.62 points lower at 79,612.19 around 11:57 am, while the NSE Nifty50 was down 221.05 points to trade barely above 24,000. Most of the broader market indices also fell during the trading session as volatility surged due to the ongoing military escalations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-oil-assures-public-of-fuel-stock-india-pakistan-war-no-need-for-panic-buying-2722054-2025-05-09",
      "headline": "Indian Oil assures public of fuel stock: No need for panic buyingIndian Oil Corporation Limited (IOCL) requested the public to stay calm and avoid unnecessary rush at petrol pumps amid rising tensions between India and Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/star-health-hacker-xenzen-claims-sending-bullets-and-death-threats-to-top-executives-2722053-2025-05-09",
      "headline": "Star Health hacker claims sending bullets and death threats to top executivesIn the recent email, xenZen said he had sent two packages in February to the company's main office in Chennai. These packages reportedly contained bullet cartridges and threatening notes warning of further violence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/titan-share-price-rise-5-percent-q4-result-dividend-should-you-buy-bse-trading-2722033-2025-05-09",
      "headline": "Titan share price jumps over 4% after strong Q4 numbers. Should you buy?Titan's share price surged 4.95% to reach the day's high of Rs 3,530 on the BSE, compared to the previous close of Rs 3,363.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/drone-defence-warfare-stocks-rise-on-dalal-street-india-pakistan-conflict-tensions-2722013-2025-05-09",
      "headline": "Drone stocks light up Dalal Street, rally up to 17% amid Indo-Pak tensionsShares of ideaforge Technology jumped nearly 17% to Rs 450 on the Bombay Stock Exchange (BSE) after Indian forces deployed suicide drones to neutralise air defence systems in Lahore and Multan. Meanwhile, Droneacharya gained 5%, ZEN Technologies advanced 5%, and Paras Defence rose almost 5% in intraday trade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-likely-to-caution-imf-against-fresh-financial-support-to-pakistan-report-2721981-2025-05-09",
      "headline": "India likely to caution IMF against fresh financial support to Pakistan: ReportIndia seems to be sending a message that simply handing out money to Pakistan won't solve the deeper issues, especially when terrorism and poor handling of previous funds remain concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hal-bel-bharat-dynamics-defence-stocks-in-focus-rally-india-pakistan-tension-conflict-2721987-2025-05-09",
      "headline": "HAL, BEL, Bharat Dynamics: Defence stocks rally up to 7% amid Indo-Pak tensionsShares of Hindustan Aeronautics (HAL), Bharat Dynamics (BDL), Bharat Electronics Ltd (BEL), and Paras Defence jumped between 2 and 7% in Friday's trade, outperforming a jittery broader market shaken by geopolitical uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-news-india-pakistan-tension-what-should-investors-do-sensex-nifty-red-2721974-2025-05-09",
      "headline": "India-Pakistan tension: What should investors do as Sensex, Nifty trade in red?At 9:43 am, the S&P BSE Sensex had fallen by 507.64 points to 79,827.17, while the NSE Nifty50 dropped 160 points to 24,113.80. Most shares and sectors were trading lower, with only a few managing to stay in the green."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-volatility-rising-india-pakistan-conflict-tension-no-dalal-street-crash-explained-2721969-2025-05-09",
      "headline": "Markets volatile but no crash on D-Street amid Indo-Pak tensions. 3 things to knowThe Sensex dropped over 500 points within minutes, and the Nifty wasn't far behind. But despite the panic-inducing headlines, the market didn't spiral into chaos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-500-points-nifty-falls-as-indo-pak-tensions-spook-dalal-street-2721949-2025-05-09",
      "headline": "Market opens volatile amid India-Pakistan tension; Sensex down over 500 pointsSensex falls 500 points, Nifty falls as Indo-Pak tensions spook Dalal Street"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-live-updates-bse-sensex-nifty-share-market-today-pakistan-stock-exchange-india-pak-tension-conflict-war-situation-operation-sindoor-2721947-2025-05-09",
      "headline": "Stock market highlights: Sensex ends 880 points lower, Nifty holds above 24,000Share market: Investor sentiment has been dampened by rising border tensions between India and Pakistan as Dalal Street has taken a hit. However, experts have still asked investors not to panic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-may-9-sensex-nifty-crash-today-indo-pak-tension-war-like-trading-bse-nse-2721928-2025-05-09",
      "headline": "Stock market opening: Will Sensex, Nifty crash today amid Indo-Pak tension?Gift Nifty futures were trading at 23,987 as of 6:46 am, which suggests that the Nifty50 could open nearly 1.2% below Thursday's close of 24,273.8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-9-hal-swiggy-titan-zee-mcx-bharat-forge-lt-india-pakistan-war-2721914-2025-05-09",
      "headline": "Stocks to watch today: HAL, Swiggy, Titan, Zee, MCX, Bharat Forge, L&TDefence sector stocks such as Hindustan Aeronautics Ltd (HAL), Bharat Forge, and Bharat Dynamics Ltd (BDL) are likely to remain in focus. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-to-speed-up-higher-pension-applications-payouts-likely-by-year-end-report-2721644-2025-05-08",
      "headline": "EPFO to speed up higher pension applications, payouts likely by year-end: ReportThe EPFO has received about 1.75 million applications from pensioners who want to get a higher pension based on their actual wages, out of a total of 7.8 million pensioners. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-why-sensex-nifty-fell-sharply-before-today-market-closing-explained-2721626-2025-05-08",
      "headline": "Explained: Why Sensex, Nifty fell sharply moments before stock market closingBy market close, the BSE Sensex had dropped 411.97 points to 80,334.81, while the Nifty 50 fell 140.60 points to 24,273.80. The India VIX, often seen as the market's fear gauge, spiked over 10 per cent to cross the 21 mark—its highest since early April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-withdraws-operation-sindoor-trademark-says-it-was-filed-inadvertently-2721608-2025-05-08",
      "headline": "Reliance withdraws 'Operation Sindoor' trademark, says it was filed inadvertentlyOn May 7, four different applications were made to trademark the phrase 'Operation Sindoor' under Class 41 of the Nice Classification. This category includes services like films, shows, online content, education, cultural events and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/kamikaze-suicide-drone-makers-stock-jumps-after-operation-sindoor-details-here-2721607-2025-05-08",
      "headline": "Kamikaze 'suicide' drone maker's stock jumps after 'Operation Sindoor'. Details hereListed on the NASDAQ under the ticker ESLT, Elbit's stock rose 3.62% over two sessions, jumping from $400.00 on May 6 to $414.47 by May 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-falls-412-points-nifty-below-24300-as-indo-pak-tensions-hit-dalal-street-2721578-2025-05-08",
      "headline": "Sensex, Nifty end in red as panic grows over India-Pak tensionsThe S&P BSE Sensex had fallen over 700 points just a few minutes before closing. However, it bounced back to end 412 points lower at 80,334.81, while the NSE Nifty50 lost 140.60 points to close at 24,273.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-stock-exchange-trading-halted-after-7-per-cent-crash-post-operation-sindoor-2721546-2025-05-08",
      "headline": "Pakistan's Karachi Stock Exchange crashes 7%, trading haltedAccording to the official notification from the exchange, trading was paused after the benchmark index plunged 6.3% in a short period. The sharp fall triggered automatic circuit breakers to stop further decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-what-is-itr-form-3-check-eligibility-documents-and-deadlines-all-details-explained-2721527-2025-05-08",
      "headline": "ITR Filing 2025: What is ITR Form 3, check eliigibility, documents and deadlinesYou should file ITR-3 if you run a business or work as a self-employed professional, regardless of whether a tax audit is needed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/avic-chengdu-aircraft-co-ltd-share-price-india-pak-tensions-chinese-jet-maker-j-17-stock-by-36-percent-in-2-days-2721520-2025-05-08",
      "headline": "India-Pak tensions lift Chinese jet maker's stock by 36% in 2 daysAs of Thursday, the company's share price rose by 16.37% to reach 80.68 yuan. This was after a 17% jump on Wednesday. In total, the stock has gained 36.21% in two days and has gone up 44% in the past one month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retirement-age-is-moving-from-60-to-45-an-investment-banker-sarthak-ahuja-explains-why-2721482-2025-05-08",
      "headline": "'Retirement age is moving from 60 to 45': An investment banker explains whyUnlike lawyers or doctors, where experience adds value, senior professionals in corporate roles like sales, marketing, operations, product, and tech, are seen as costly and sometimes out of touch, said the investment banker."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-india-pakistan-tension-should-investors-on-dalal-street-panic-2721478-2025-05-08",
      "headline": "Why stock market investors shouldn't panic amid rising Indo-Pak tensionsWhile 'Operation Sindoor' led to worries about increased market volatility and losses, the main indices on Dalal Street actually managed to end in green in the previous session. Even today, the stock markets are trading in positive territory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-economy-going-down-forex-reserve-overflight-fees-airspace-ban-india-border-tension-2721445-2025-05-08",
      "headline": "Pakistan's forex is slipping fast. More trouble ahead for already debt-ridden economy?A bailout by the International Monetary Fund (IMF), including a loan of $2 billion in March this year, gave Pakistan some breathing room. But the current situation could undo much of that progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/you-can-now-automate-strategies-zerodha-founder-and-ceo-nithin-kamath-on-nse-new-algo-rules-2721437-2025-05-08",
      "headline": "'You can now automate strategies': Zerodha's Nithin Kamath on NSE's new algo rulesZerodha's founder and CEO, Nithin Kamath, hailed NSE's new rules to ease algo trading for retail users and explained the main update in simple terms."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rajkummar-rao-bhool-chuk-release-until-next-hearing-june-16-after-pvr-sued-maddock-films-2722850-2025-05-10",
      "headline": "No Bhool Chuk Maaf's release till next hearing on June 16: Bombay courtPVR sued Maddock Films, the production house, for cancelling the release of 'Bhool Chuk Maaf' citing Indo-Pak conflict. Now, Bombay High Court has restrained the film's release till the next hearing, which will take place on June 16."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nimrat-kaur-martyr-daughter-india-pakistan-conflict-terrorism-has-no-place-2722841-2025-05-10",
      "headline": "Actor Nimrat Kaur on Indo-Pak conflict: Terrorism has no placeActor Nimrat Kaur shared her personal journey as a martyr's daughter and highlighted the urgent need to address terrorism's root causes for lasting peace. She appealed to citizens to stay calm and support the armed forces amid Indo-Pak tensions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-says-need-assurance-that-attacks-wont-happen-again-saif-ali-khan-salutes-military-operation-sindoor-2722833-2025-05-10",
      "headline": "Op Sindoor: Aamir Khan wants assurance of no attacks in future, Saif salutes armyAamir Khan, at a recent event, spoke about the Pahalgam attack and said that we, as a nation, would need assurance that such attacks will not happen again. Saif Ali Khan applauded the armed forces for their bravery and Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-hit-3-success-meet-indo-pak-tension-2722801-2025-05-10",
      "headline": "Telugu actor Nani reveals why he went ahead with HIT 3 event amid Indo-Pak tensionsTelugu actor Nani was called out for holding 'HIT 3' success event amid escalating Indo-Pak tensions. He stated that he didn't want to give terrorists the satisfaction of cancelling an event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pvr-sues-maddock-films-after-cancellation-of-bhool-chuk-maaf-theatrical-release-2722768-2025-05-10",
      "headline": "PVR sues Maddock Films after cancellation of Bhool Chuk Maaf theatrical releasePVR has sued Maddock Films for Rs 60 crore for the last-minute cancellation of the theatrical release of Bhool Chuk Maaf. Maddock Films is yet to release an official statement on the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/black-white-and-gray-the-uncomfortable-fiction-of-this-highly-rated-crime-series-2722310-2025-05-10",
      "headline": "Black, White and Gray: The uncomfortable fiction of this highly rated crime series'Black, White and Gray - Love Kills' is a gripping mockumentary series on SonyLIV that blurs the line between fiction and reality with its true-crime-style storytelling set in Nagpur. This six-episode show masterfully explores obsession and truth, leaving viewers questioning what is real in relationships and crime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/all-about-film-on-operation-sindoor-makers-apology-and-clarification-2722755-2025-05-10",
      "headline": "All about film on Operation Sindoor, makers' apology and clarificationFilmmaker Uttam Maheshwari deleted the poster of his film titled 'Operation Sindoor', and also apologised for hurting the sentiments of people, while India continues to defend its sovereignty amid escalating tensions between India and Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rhea-chakraborty-moving-tribute-to-indian-army-from-one-fauji-home-to-another-2722728-2025-05-10",
      "headline": "Rhea Chakraborty's moving tribute to Indian army: From one fauji home to another...Actor Rhea Chakraborty wrote an emotional and empowering note as the 'daughter' of an Indian army officer. She sent her love to the families of the soldiers who are fighting for the country amid escalating tensions between India and Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-announces-film-line-up-kingdom-vd-14-svc-59-2722713-2025-05-10",
      "headline": "3 films, 3 different genres in Vijay Deverakonda's promising line-upActor Vijay Deverakonda announced his solid line-up of films on Friday. He shared the posters of the three films, indicating that the three belong to different genres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/when-nimrat-kaur-recalled-terrorists-killing-his-father-was-kidnapped-terminated-2722699-2025-05-10",
      "headline": "When Nimrat Kaur recalled terrorists killing her father: Was kidnapped, terminatedActor Nimrat Kaur is the daughter of an army major who was martyred in 1994. In an interview, she once spoke about what she remembered from the day when she realised she had lost her father to terrorism. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/khushbu-sundar-radikaa-sarathkumar-aarti-ravi-mohan-divorce-battle-2722690-2025-05-10",
      "headline": "Actors Khushbu, Radikaa Sarathukumar support Aarti over Ravi Mohan in divorce battleActors Khushbu Sundar and Radikaa Sarathkumar expressed their support for Aarti over actor Ravi Mohan in their divorce battle. This comes after Aarti's emotional yet strongly-worded statement following Ravi's latest public appearance with rumoured partner Kenishaa Francis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-season-2-cancelled-after-poor-reviews-report-2722672-2025-05-10",
      "headline": "Suits LA Season 2 cancelled after poor reviews: Report'Suits LA' Season 2 has been cancelled after the spin-off series received bad reviews and poor ratings upon its debut in February this year. The show has already premiered its 10 episodes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-warm-welcome-in-london-ahead-madame-tussauds-wax-statue-inauguration-pics-video-2722663-2025-05-10",
      "headline": "Ram Charan receives warm welcome in London ahead of wax statue inauguration. PicsRam Charan's wax statue at Madame Tussauds London will be launched tomorrow. As he arrived in London, he received a loud cheers and warm welcome from his fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-strong-note-for-trolls-across-the-border-i-am-nothing-if-not-indian-2722641-2025-05-10",
      "headline": "I'm nothing if not Indian: Hina Khan's strong note for trolls 'across the border'Hina Khan wrote a strongly-worded note against people 'across the border' who have been abusing her, cursing her and wishing the worst for her given her medical condition. She earlier expressed support for her country and the armed forces following Operation Sindoor against Pakistan-backed terrorism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/queer-representation-in-indian-cinema-kaathal-the-core-taps-my-son-is-gay-kadhal-enbadhu-podhu-udamai-2721698-2025-05-10",
      "headline": "Indian cinema's queer journey: From margins to mainstreamIndian cinema has gradually shifted from stereotypical portrayals of queer characters to more authentic and nuanced stories. This evolution reflects broader social shifts and growing acceptance of queer identities in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-sitaare-zameen-par-trailer-launch-india-pakistan-tensions-2722630-2025-05-10",
      "headline": "Aamir Khan postpones Sitaare Zameen Par trailer launch amid Indo-Pak tensionsActor Aamir Khan has postponed the trailer release of his upcoming film 'Sitaare Zameen Par' amid rising India-Pakistan border tensions. The decision reflects solidarity with the armed forces and a call for national unity during sensitive times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/raid-2-box-office-collection-day-9-detailed-report-ajay-devgn-film-smashes-rs-100-crore-actor-15th-in-the-club-2722626-2025-05-10",
      "headline": "Raid 2 box office Day 9: Ajay's film smashes Rs 100 crore, actor's 15th in the clubAjay Devgn's 'Raid 2' has surpassed the benchmark of Rs 100 crore at the box office. The film witnessed a drop in its collection during the weekdays, given the escalating tensions between India and Pakistan. However, it continued to perform decently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/khloe-kardashian-shah-rukh-khan-snapchat-post-met-gala-2025-debut-calls-srk-amazing-2722588-2025-05-10",
      "headline": "Khloe Kardashian 'loved seeing King Khan' at Met Gala, calls SRK 'amazing'Khloe Kardashian joined millions of those who think Shah Rukh Khan looked dashing in his Sabyasachi-designed look at Met Gala 2025. She shared a few photos of the superstar on Snapchat, and referred to him as 'King Khan' "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-ceasefire-jk-on-edge-after-pak-ceasefire-breach-no-firing-explosions-overnight-2722943-2025-05-11",
      "headline": "J&K on edge after Pak ceasefire breach, no firing, explosions overnightDespite Pakistan breaking the ceasefire deal within hours of it coming into effect, no firing or explosions were heard along the international borders through the night. However, Pakistani drones were spotted and blackouts were imposed in several areas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-tensions-live-update-operation-sindoor-blackout-india-pak-war-missile-drone-attack-pahalgam-terror-attack-air-strike-2721927-2025-05-09",
      "headline": "Highlights: Faithful ceasefire, says Pak PM post violationThe Pakistani Prime Minister, Shehbaz Sharif, in his media briefing expressed hope that the international community would actively engage in matters concerning the Indus Waters Treaty. Just hours after a ceasefire agreement was reached between India and Pakistan, the Pakistani Army violated the truce by launching unprovoked shelling along the International Border and the Line of Control. Reacting sharply, India's Foreign Secretary Vikram Misri condemned the aggression and called it a breach of mutual understanding. The ceasefire violation occurred roughly three hours after both nations agreed to halt hostilities following three days of intense military conflict—an agreement reportedly brokered through US mediation. US President Donald Trump later announced that the two countries had consented to a ceasefire following overnight talks. Additionally, both sides have agreed to engage in high-level diplomatic talks scheduled for May 12 at noon."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/soldier-injured-firing-nagrota-army-station-jammu-manhunt-intruders-2722904-2025-05-10",
      "headline": "Soldier injured in firing at Nagrota Army station in Jammu, manhunt on for intruderA brief exchange of gunfire took place at the Nagrota Army Station in Jammu, injuring a soldier. A manhunt has been launched for the suspect who attempted to trespass into the station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/janus-faced-china-condemns-pahalgam-attack-but-backs-friend-pakistan-2722928-2025-05-11",
      "headline": "Janus-faced China condemns Pahalgam attack but backs 'friend' PakistanChina maintained a delicate diplomatic balance by reaffirming strong support for Pakistan and simultaneously condemning the Pahalgam terror attack in talks with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-pakistan-ceasefire-agreement-violation-asim-munir-shahbaz-sharif-coup-confusion-2722882-2025-05-10",
      "headline": "All well in Pakistan, the land of confusion and coups?Minutes after Pakistan Prime Minister Shehbaz Sharif welcomed the ceasefire with India, without mentioning the word ceasefire, the Pakistani military started shelling and sending drones into Indian territory. Was General Asim Munir not agreeable to the ceasefire terms that the Sharif government must have agreed to? Is everything well within Pakistan, the land of confusion, contradictions and coups?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/vladimir-putin-peace-talks-ukraine-end-war-russia-volodymyr-zelenskyy-2722938-2025-05-11",
      "headline": "Putin proposes direct talks with Ukraine on May 15 to end war after three yearsRussian President Vladimir Putin has proposed direct peace talks with Ukraine on May 15 in Istanbul, aiming to resolve the conflict and restore lasting peace. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/what-the-hell-jk-chief-minister-says-blasts-in-srinagar-just-hours-after-ceasefire-2722866-2025-05-10",
      "headline": "This is no ceasefire: Omar Abdullah posts clip of air defence tackling Pak dronesJammu and Kashmir Chief Minister Omar Abdullah said explosions were heard in Srinagar just hours after Pakistan agreed to a ceasefire with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-snatched-defeat-from-jaws-of-victory-brahma-chellaney-on-ceasefire-with-pak-2722860-2025-05-10",
      "headline": "India snatched defeat from jaws of victory: Brahma Chellaney on ceasefire with PakTop geostrategist Brahma Chellaney criticised India's decision to agree to a ceasefire with Pakistan, calling it a repeat of past strategic mistakes. He argued that India had the upper hand militarily but gave up its advantage without securing long-term gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/terror-act-of-war-before-ceasefire-indias-israel-like-shift-in-policy-towards-pakistan-2722852-2025-05-10",
      "headline": "Before ceasefire came India's Israel-like shift in policy towards PakistanIndia and Pakistan agreed to a ceasefire after three days of military conflict across the border following India's Operation Sindoor strikes against terror infrastructure, which came in retaliation to the Pahalgam attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nsa-ajit-doval-holds-talks-china-wang-yi-india-pakistan-tensions-ceasefire-violation-2722894-2025-05-10",
      "headline": "War is not India's choice: NSA Ajit Doval to China's Wang Yi amid tensions with PakNational Security Advisor Ajit Doval and Chinese Foreign Minister Wang Yi held a telephonic conversation amid escalating tensions between India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-ceasefire-border-tensions-us-mediation-donald-trump-direct-talks-military-level-negotiation-2722836-2025-05-10",
      "headline": "Did New Delhi just refute US claims on India-Pak mediation?Donald Trump's assertion that the India-Pakistan ceasefire resulted from US mediation appears to have been unequivocally refuted by the Indian government, which said that the ceasefire was negotiated directly between the two nations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-ceasefire-talks-conflicts-operation-sindoor-2722790-2025-05-10",
      "headline": "Pakistan dialled India, both sides agreed to a ceasefire: New DelhiIndia-Pakistan ceasefire: Pakistan initiated contact with India, and both sides agreed to a ceasefire, effective from 5 pm Saturday, after direct talks between their military officials, the government said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/omar-abdullah-video-drones-sighted-in-srinagar-india-pakistan-ceasefire-2722881-2025-05-10",
      "headline": "'1, 2, 3...': Omar Abdullah shares clip of drone attack in SrinagarJammu and Kashmir Chief Minister Omar Abdullah shared a video of drones swarming the skies of Srinagar. Explosion sounds could be heard in the background."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shelling-reported-jammu-region-pakistan-breaks-ceasefire-agreement-india-tensions-operation-sindoor-2722858-2025-05-10",
      "headline": "Pak breaks ceasefire within hours with drone attack on Srinagar, other citiesPakistan launched artillery shelling and drone activity along the International Border and LoC in multiple locations, violating the ceasefire agreement reached just hours earlier. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-ceasefire-did-usd-1-billion-imf-loan-come-with-condition-reasons-explained-2722834-2025-05-10",
      "headline": "Did $1-billion IMF loan to Pakistan come with ceasefire condition?Extensive damage to its military assets might have made Pakistan call for a ceasefire with India, but a $1-billion loan from the IMF might have helped in the de-escalation process. The loan might have come with a clause, asking Pakistan to seek an end to the fighting that had been going on for the last three days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/china-supports-pakistan-amid-tensions-with-india-2722893-2025-05-10",
      "headline": "China says it will stand by 'iron-clad friend' PakistanThe Chinese foreign minister made these comments during a telephonic conversation with Deputy Prime Minister and Foreign Minister Ishaq Dar, according to a statement by the Foreign Office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-482-10-05-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/paks-jihadist-delusions-and-its-own-past-2722722-2025-05-10",
      "headline": "Pakistan resorts to the war it knows best: Jihad in subcontinentOn Saturday, the world witnessed the launch of a fresh season of Pakistan's perennial chimera of a fragmented India when it announced 'Bunyan-un-Marsoos', a military strike on India. The symbolism of the operation and the surrounding propaganda underlines a larger insidious plan to use Islam as a ruse to support terror, rally support and destabilise the Subcontinent"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-military-face-dg-ispr-lieutenant-general-ahmed-sharif-chaudhry-is-son-of-a-terrorist-linked-to-osama-bin-laden-2722704-2025-05-10",
      "headline": "Face of Pakistan's military is son of a terroristHeading Pakistan's disinformation campaign against India's anti-terror fight is Lieutenant General Ahmed Sharif Chaudhry, the Director General of Inter-Services Public Relations (ISPR). Chaudhry is the son of nuclear scientist Sultan Bashiruddin Mahmood, who met al-Qaida chief Osama bin Laden and tried to hand over nuclear weapons technology to terrorists. He features on the UN Security Council's al-Qaida Sanctions Committee list of terrorists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/queer-representation-in-indian-cinema-kaathal-the-core-taps-my-son-is-gay-kadhal-enbadhu-podhu-udamai-2721698-2025-05-10",
      "headline": "Indian cinema's queer journey: From margins to mainstreamIndian cinema has gradually shifted from stereotypical portrayals of queer characters to more authentic and nuanced stories. This evolution reflects broader social shifts and growing acceptance of queer identities in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-decided-to-ceasefire-with-pak-on-its-own-terms-sources-2722822-2025-05-10",
      "headline": "Ceasefire with Pak on our terms, PM made clear to NSA Ajit Doval, S JaishankarPM Modi made it clear to NSA Ajit Doval and S Jaishankar that a ceasefire will be agreed to \"on our terms,\" sources told India Today."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/in-the-time-of-war-may-god-give-us-the-sense-to-stay-ignorant-india-pakistan-tensions-2722826-2025-05-10",
      "headline": "In the time of war, may God give us the sense to stay ignorantIn an age of constant updates, staying wilfully ignorant may be the sanest choice, especially during war, when information overwhelms more than it empowers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amid-pak-tensions-india-to-treat-future-terror-attacks-as-acts-of-war-say-government-sources-2722747-2025-05-10",
      "headline": "Here on, India will treat terror attacks as acts of war against countryIndia has resolved to treat any future terror attacks as an act of war and will respond accordingly. The decision was taken following the Pahalgam terror attack, which left 26 dead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rajkummar-rao-bhool-chuk-release-until-next-hearing-june-16-after-pvr-sued-maddock-films-2722850-2025-05-10",
      "headline": "No Bhool Chuk Maaf's release till next hearing on June 16: Bombay courtPVR sued Maddock Films, the production house, for cancelling the release of 'Bhool Chuk Maaf' citing Indo-Pak conflict. Now, Bombay High Court has restrained the film's release till the next hearing, which will take place on June 16."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nimrat-kaur-martyr-daughter-india-pakistan-conflict-terrorism-has-no-place-2722841-2025-05-10",
      "headline": "Actor Nimrat Kaur on Indo-Pak conflict: Terrorism has no placeActor Nimrat Kaur shared her personal journey as a martyr's daughter and highlighted the urgent need to address terrorism's root causes for lasting peace. She appealed to citizens to stay calm and support the armed forces amid Indo-Pak tensions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-says-need-assurance-that-attacks-wont-happen-again-saif-ali-khan-salutes-military-operation-sindoor-2722833-2025-05-10",
      "headline": "Op Sindoor: Aamir Khan wants assurance of no attacks in future, Saif salutes armyAamir Khan, at a recent event, spoke about the Pahalgam attack and said that we, as a nation, would need assurance that such attacks will not happen again. Saif Ali Khan applauded the armed forces for their bravery and Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-hit-3-success-meet-indo-pak-tension-2722801-2025-05-10",
      "headline": "Telugu actor Nani reveals why he went ahead with HIT 3 event amid Indo-Pak tensionsTelugu actor Nani was called out for holding 'HIT 3' success event amid escalating Indo-Pak tensions. He stated that he didn't want to give terrorists the satisfaction of cancelling an event."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-mariano-navone-italian-open-comeback-2722925-2025-05-11",
      "headline": "After 104 days, Jannik Sinner makes strong comeback with thumping winItalian Open 2025: World No.1 Jannik Sinner defeated Argentina's Mariano Navone in straight sets on Saturday, May 10 and advanced to the Round of 32 of the clay-court tournament. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-pakistan-security-bcb-t20i-series-2722899-2025-05-10",
      "headline": "BCB pondering over Bangladesh's Pakistan tour amid security concernsThe Bangladesh Cricket Board (BCB) is still scratching its heads on the upcoming tour of Pakistan where the Tigers are set to participate in five T20Is from May 25 to June 3. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/marta-kostyuk-daria-kasatkina-italian-open-handshake-explainer-2722855-2025-05-10",
      "headline": "Why did Marta Kostyuk shake hands with 'Russian' Daria Kasatkina? ExplainedItalian Open 2025: Ukraine's Marta Kostyuk shook hands with Russia-born Daria Kasatkina after beating her 6-4, 6-2 in the Round of 64 clash on Friday, May 9. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-brian-lara-retirement-test-cricket-2722861-2025-05-10",
      "headline": "Test cricket needs Kohli, he is going to average 60-plus here on: Brian LaraThe legendary Brian Lara said that Virat Kohli should be persuaded to not retire from Test cricket. Earlier, Kohli reached out to the BCCI with his desire to step away from the purest format of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-india-pakistan-ceasefire-when-will-tournament-resume-bcci-2722851-2025-05-10",
      "headline": "IPL 2025 likely to resume soon after India, Pakistan agree to ceasefireThe BCCI is set to decide the future of IPL 2025 following a ceasefire between India and Pakistan. This development could allow the tournament to resume nationwide after earlier disruptions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-captain-after-rohit-sharma-retirement-rishabh-pant-vice-captain-2722848-2025-05-10",
      "headline": "Shubman, Rishabh to take charge of Indian team in post-Rohit eraShubman Gill is expected to take over as India captain following Rohit Sharma's retirement. The BCCI has also earmarked Rishabh Pant for the vice-captain's role in the Test team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retirement-rumours-ambati-rayudu-test-cricket-continuation-2722842-2025-05-10",
      "headline": "Virat Kohli, you have so much left: Ambati Rayudu amidst retirement rumoursAmbati Rayudu has appealed to Virat Kohli not to retire from Test cricket. The request comes amidst rumours following Rohit Sharma's retirement which signals a potential shift in India's Test team lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-danielle-collins-italian-open-rankings-exit-2722830-2025-05-10",
      "headline": "Iga Swiatek makes shock exit, set for huge drop in rankingsItalian Open 2025: Defending champion Iga Swiatek crashed out after losing in straight sets to Danielle Collins of the USA in the Round of 32 clash on May 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-suspended-foreign-players-depart-amid-india-pakistan-border-tension-2722808-2025-05-10",
      "headline": "IPL 2025: Foreign players fly out of India suspension of tournamentThe Indian Premier League have sent their foreign players back home amid India-Pakistan border tensions. Players left for their homes via different locations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-real-madrid-el-clasico-laliga-fancode-streaming-rights-2025-2722796-2025-05-10",
      "headline": "Barcelona vs Real Madrid: Latest live streaming detailsBarcelona and Real Madrid will meet in a decisive LaLiga clash on May 11. The shift in streaming rights to FanCode has sparked debate amongst Indian football fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-sri-lanka-womens-tri-series-final-harmanpreet-kaur-chamari-athapaththu-2722792-2025-05-10",
      "headline": "Can India avenge the Asia Cup heartbreak against Sri Lanka in grand finale?Harmanpreet Kaur's India and Chamari Athapaththu's Sri Lanka will face each other in the summit clash of the tri-nation series on Sunday, May 11 at the R Premadasa Stadium in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retirement-rumours-ambati-rayudu-test-cricket-continuation-2722842-2025-05-10",
      "headline": "Virat Kohli, you have so much left: Ambati Rayudu amidst retirement rumoursAmbati Rayudu has appealed to Virat Kohli not to retire from Test cricket. The request comes amidst rumours following Rohit Sharma's retirement which signals a potential shift in India's Test team lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-danielle-collins-italian-open-rankings-exit-2722830-2025-05-10",
      "headline": "Iga Swiatek makes shock exit, set for huge drop in rankingsItalian Open 2025: Defending champion Iga Swiatek crashed out after losing in straight sets to Danielle Collins of the USA in the Round of 32 clash on May 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-suspended-foreign-players-depart-amid-india-pakistan-border-tension-2722808-2025-05-10",
      "headline": "IPL 2025: Foreign players fly out of India suspension of tournamentThe Indian Premier League have sent their foreign players back home amid India-Pakistan border tensions. Players left for their homes via different locations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-real-madrid-el-clasico-laliga-fancode-streaming-rights-2025-2722796-2025-05-10",
      "headline": "Barcelona vs Real Madrid: Latest live streaming detailsBarcelona and Real Madrid will meet in a decisive LaLiga clash on May 11. The shift in streaming rights to FanCode has sparked debate amongst Indian football fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-sri-lanka-womens-tri-series-final-harmanpreet-kaur-chamari-athapaththu-2722792-2025-05-10",
      "headline": "Can India avenge the Asia Cup heartbreak against Sri Lanka in grand finale?Harmanpreet Kaur's India and Chamari Athapaththu's Sri Lanka will face each other in the summit clash of the tri-nation series on Sunday, May 11 at the R Premadasa Stadium in Colombo. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}