{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-planning-universal-pension-scheme-who-will-it-benefit-check-details-eligibility-2685950-2025-02-26",
      "headline": "Government plans Universal Pension Scheme: Who will benefit?The ministry of labour and employment is working on the proposed plan, which is expected to bring existing pension schemes under one framework. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-european-union-trade-tariff-cut-cars-wine-boost-ties-reduce-china-dependence-2685923-2025-02-26",
      "headline": "Explained: Why European Union wants India to cut tariffs on cars, wineApart from trade, the EU also sees India as an important security partner, given rising cyber threats and tensions in regions like the South China Sea and the Indo-Pacific."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/azad-engineering-qip-launch-rs-700-crore-all-you-need-to-know-share-price-2685905-2025-02-26",
      "headline": "Azad Engineering launches Rs 700 crore QIP: All you need to knowThe company's board approved the opening of the issue on February 25 for the QIP of equity shares with a face value of Rs 2 each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/volkswagen-only-carmaker-to-wrongly-classify-car-imports-tax-authorities-2685885-2025-02-26",
      "headline": "Volkswagen only carmaker to wrongly classify car imports: Tax authoritiesIndia says Volkswagen used a clandestine scheme to import auto parts in separate shipments, to evade detection and cut taxes, instead of declaring items as \"completely knocked down\", or CKD, units that face higher taxes of 30% to 35%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-gold-real-estate-which-investment-can-make-you-richer-where-to-invest-money-expert-view-2685862-2025-02-26",
      "headline": "Gold, stocks, or property: Which investment can make you richer?More people are turning to stocks, gold, and real estate to grow their wealth, but choosing the right one can be tricky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/capgemini-ceo-ashwin-yardi-on-ideal-workweek-not-90-70-not-even-50-hours-2685788-2025-02-26",
      "headline": "Capgemini CEO on ideal workweek: Not 90, not 70, not even 50 hoursCapgemini India's CEO, Ashwin Yardi, has introduced a different perspective, one that supports a more balanced approach in the debate about work-life balance and working hours in a week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/defence-stocks-like-bel-hal-are-in-a-slump-3-reasons-why-analysts-are-bullish-2685763-2025-02-26",
      "headline": "Defence stocks like BEL, HAL are in a slump. Is it an opportunity to buy? Even after the drop, analysts remain bullish about defence stocks. In the case of BEL, 24 out of 27 analysts have a 'buy' rating on the stock. Most analysts also remain positive about HAL's stock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-shares-tumble-nearly-9-percent-market-value-dips-below-1-trillion-dollar-key-reasons-2685741-2025-02-26",
      "headline": "Tesla shares tumble nearly 9%, market value dips below $1 trillion. Here's whyTesla share price: The decline followed data from the European Automobile Manufacturers Association, which reported Tesla's sales in Europe fell 45% in January."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-down-44-percent-from-52-week-high-should-you-buy-the-dip-2685727-2025-02-26",
      "headline": "Tata Motors shares down 44% from 52-week high. Should you buy the dip?Tata Motors shares: In the previous trading session, the stock closed lower 1.2% lower at Rs 660.30. So far this year, it's lost over 11%. In six months, it's down 40%. Over a year, it's fallen 30%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-lending-rules-ease-in-borrowing-for-small-borrowers-and-nbfcs-what-it-means-2685720-2025-02-26",
      "headline": "RBI eases lending rules for small borrowers and NBFCs. Here's what it meansThe RBI has also put on hold its earlier proposals to increase the capital that banks must set aside for new project loans and the liquidity they need to maintain for digital deposits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/new-india-co-op-bank-vault-had-12-times-its-capacity-on-paper-rs-122-crore-report-2685718-2025-02-26",
      "headline": "New India Co-op Bank vault had 12 times its capacity on paper: Report The Mumbai Police's Economic Offences Wing (EOW) is probing an alleged Rs 122-crore embezzlement at the bank and has arrested three people so far, including two former senior executives of the lender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-employees-get-5-to-8-percent-salary-hikes-lower-than-before-report-2685688-2025-02-26",
      "headline": "Infosys employees get 5-8% salary hikes, lower than before: ReportThe IT firm sent salary revision letters to employees, offering hikes between 5% and 8% for most, depending on their performance rating."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sex-education-actor-alexander-westwood-jailed-for-15-years-for-multiple-sex-offenses-2685969-2025-02-26",
      "headline": "Sex Education actor Alexander Westwood jailed for 15 years for sex offensesSex Education actor Alexander Westwood received a 15-year prison sentence for multiple sex offenses. The case has captured widespread media attention due to Westwood's role in the popular Netflix show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aashram-3-part-1-ending-explained-pammi-aaditi-pohankar-revenge-baba-nirala-bobby-deol-prakash-jha-2685961-2025-02-26",
      "headline": "Aashram 3 Part 1 ending explained: Will Pammi's revenge end Baba Nirala's reign?With Aashram Season 3 Part 2 releasing on February 27, let us take a look at how the season ended on a cliffhanger with Baba Nirala's misuse of power and a change in dynamics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-jasleen-royal-criticism-coldplay-opening-one-bad-act-wont-damage-reputation-of-indian-2685917-2025-02-26",
      "headline": "Amit Trivedi says Jasleen Royal's opening act for Coldplay was 'unfortunate'Amit Trivedi, in an interview with India Today Digital, discussed the controversy over Jasleen Royal's opening act for Coldplay's India tour and whether it would impact on the image of Indian artists."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-kanye-west-trying-to-save-marriage-with-bianca-censori-report-2685911-2025-02-26",
      "headline": "Rapper Kanye West trying to save marriage with Bianca Censori: ReportKanye West is reportedly trying to prevent his marriage with Bianca Censori from ending. An insider reveals that Bianca is considering divorce, and Kanye is panicking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/euphoria-palash-sen-akshay-kumar-bollywood-mahakal-chalo-mahashivratri-2685899-2025-02-26",
      "headline": "Singer Palash Sen on working with Akshay Kumar, not being 'accepted' by BollywoodEuphoria's lead vocalist Palash Sen spoke to India Today Digital about collaborating with Bollywood star Akshay Kumar on the song Mahakal Chalo, work opportunities in the Hindi film industry, and more in an exclusive interaction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aman-verma-vandana-lalwani-separate-9-years-of-marriage-2685910-2025-02-26",
      "headline": "Actors Aman Verma and Vandana Lalwani to separate after 9 years of marriageActors Aman Verma and Vandana Lalvani are separating after nine-years of marriage. Amid growing speculation, Aman has addressed the rumours about their relationship. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/baalveer-actor-dev-joshi-marries-girlfriend-aarti-first-pics-out-2685838-2025-02-26",
      "headline": "Baalveer actor Dev Joshi marries girlfriend Aarti, first pics outBaalveer actor Dev Joshi married his girlfriend Aarti in a beautiful ceremony. The wedding festivities, including haldi and mehndi, were spectacular and captured in stunning photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/be-happy-abhishek-bachchan-inayat-verma-prime-video-series-release-date-2685817-2025-02-26",
      "headline": "Be Happy: Abhishek Bachchan, Inayat Verma series to stream in MarchThe streaming date of Abhishek Bachchan and Inayat Verma-starrer Be Happy is out. It promises to be a touching film about a single father's journey to support his daughter's dream of performing on a dance reality show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/a-man-on-the-inside-review-ted-danson-netflix-charming-comedy-2685801-2025-02-26",
      "headline": "A Man on the Inside: Ted Danson's charming comedy deserves more loveA Man on the Inside is a warm and witty series which tackles multiple subjects, including loss, new beginnings and, well, crime. The Ted Danson-starrer is currently streaming on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshal-chikni-chameli-embarrassed-when-5-year-old-girls-sing-it-2685777-2025-02-26",
      "headline": "Shreya Ghoshal on Chikni Chameli: Embarrassed when 5-year-old girls sing itShreya Ghoshal says she feels embarrassed when young girls sing Chikni Chameli, stressing that lyrics should be written more thoughtfully, as music and films have a deep impact on society."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-updates-fans-about-cancer-treatment-my-chemo-and-surgery-are-over-2685753-2025-02-26",
      "headline": "Hina Khan updates fans about cancer treatment: My chemo and surgery are overHina Khan recently gave an update about her cancer treatment. The actor mentioned that her chemotherapy and surgery are over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tanmay-bhat-jokes-about-ranveer-allahbadia-ignoring-his-texts-2685715-2025-02-26",
      "headline": "Tanmay Bhat jokes about Ranveer Allahbadia ignoring his textsTanmay Bhat hilariously addressed the India's Got Latent controversy, joking about Ranveer Allahbadia ignoring his texts. The reaction video left fellow comedians laughing and also \"triggered\" them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/singer-udit-narayan-visits-maha-kumbh-mela-with-wife-expresses-gratitude-2685597-2025-02-25",
      "headline": "Singer Udit Narayan visits Maha Kumbh Mela with wife, expresses gratitude Singer Udit Narayan was among the latest celebrities to visit the holy city of Prayagraj for Maha Kumbh 2025. In an interview with ANI, he expressed his gratitude and congratulated Chief Minister Yogi Adityanath for the well-organised and efficient arrangements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/my-dearest-nemesis-review-moon-ga-young-choi-hyun-wook-2685507-2025-02-25",
      "headline": "My Dearest Nemesis review: Chaotic chemistry makes even familiar trope workMy Dearest Nemesis features K-drama stars Moon Ga young and Choi Hyun-wook in the lead. It is available to stream on Viki. Here's our take on the romantic drama. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/internet-calls-farah-khan-insensitive-for-mocking-gaurav-khannas-colour-blindness-celebrity-masterchef-2685266-2025-02-25",
      "headline": "Internet calls Farah Khan 'insensitive' for mocking Gaurav Khanna's colour blindnessCelebrity MasterChef judge Farah Khan mocked TV actor Gaurav Khanna's colour blindness on the show. Following the same, the internet is outraged by her comments, criticising the filmmaker and calling her 'insensitive'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/parineeti-chopra-gears-up-for-her-first-netflix-yet-to-be-titled-thriller-series-2685151-2025-02-25",
      "headline": "Parineeti Chopra gears up for her first Netflix yet-to-be-titled thriller seriesActor Parineeti Chopra is set to make her series OTT debut with a Netflix project. The actor shared a post and informed about sharing screen space with Nimrit Kaur, Soni Razdan, and others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tanmay-bhat-x-account-hacked-comedian-warns-followers-2685118-2025-02-25",
      "headline": "Tanmay Bhat's X account hacked, comedian warns followersTanmay Bhat's X account recently got hacked, leading to fraudulent messages being posted online. The comedian shared a post on his Instagram and warned his followers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-vrishank-khanal-haldi-pics-pre-wedding-festivties-wedding-karjat-2685070-2025-02-25",
      "headline": "Prajakta Koli-Vrishank Khanal can't take their eyes off each other in haldi picsActor Prajakta Koli is set to marry longtime boyfriend Vrishank Khanan on February 25. Ahead of the grand day, the actor shared pictures from her haldi function. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/anupam-mittal-on-india-got-latent-backlash-not-lost-episode-of-satyamev-jayate-2685071-2025-02-25",
      "headline": "Anupam Mittal on India's Got Latent backlash: Not a lost episode of Satyamev JayateAnupam Mittal weighs in on the India's Got Latent row, arguing that YouTube should also be held accountable. He calls Big Tech the real culprit, criticising digital platforms for fueling outrage-driven content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bobby-deol-says-aashram-helped-him-break-industry-image-explore-new-roles-2685062-2025-02-25",
      "headline": "Bobby Deol says Aashram helped him break industry image, explore new rolesActor Bobby Deol is all set to return as Baba Nirala in Prakash Jha's series, Aashram 3 part 2. The actor confessed that he wanted to step out of his comfort zone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-waking-of-a-nation-trailer-taaruk-raina-fights-to-prove-jallianwala-act-was-planned-2684901-2025-02-24",
      "headline": "Waking of Nation trailer: Taaruk Raina fights to prove Jallianwala Bagh was plannedA new show that explores the events surrounding the Jallianwala Bagh massacre is set to premiere on Sony LIV on March 8. Starring Taaruk Raina in the lead role, the series is titled The Waking of a Nation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-responds-to-rumours-of-drug-use-2684862-2025-02-24",
      "headline": "Singer Justin Bieber responds to rumours of drug useJustin Bieber's representative has reacted to the reports of the singer's drug use and called them false. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/ranveer-allahbadia-runs-to-car-after-recording-statement-in-latent-probe-2684803-2025-02-24",
      "headline": "Ranveer Allahbadia runs to car after recording statement in Latent probeRanveer Allahbadia was clicked in a hurried state, running towards his car as the paparazzi tried to capture his pictures on Monday. The YouTuber visited the Maharashtra Cyber office in Mahape after recording his statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kaushaljis-vs-kaushal-review-a-simple-yet-complex-tale-of-second-chance-in-love-2684706-2025-02-24",
      "headline": "Kaushaljis vs Kaushal review: A simple yet complex tale of second chance in loveReleased-Fri Feb 21, 2025Kaushaljis vs Kaushal movie review: This film is a heartfelt exploration of second chances in love, focusing on a middle-aged couple navigating the complexities of separation and familial expectations. Set in the relatable backdrop of Kannauj, the film captivates with its simplicity and stellar performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dupahiya-trailer-a-wedding-a-missing-bike-and-a-lot-of-chaos-in-offing-2684642-2025-02-24",
      "headline": "Dupahiya trailer: A wedding, a missing bike and a lot of chaos in offingThe first full trailer of Prime Video's upcoming comedy series, Dupahiya, is here. The show will feature actors such as Sparsh Shrivastava and Gajraj Rao in pivotal roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-dances-to-zingaat-with-fiance-at-mehndi-ceremony-watch-2684622-2025-02-24",
      "headline": "Bride-to-Be Prajakta Koli dances to Zingaat with fiance at mehndi ceremony. WatchPrajakta Koli shared glimpses of her mehndi ceremony as she danced joyfully with fiance Vrishank Khanal. The couple is set to marry on February 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zero-day-netflix-review-robert-de-niro-angela-bassett-jesse-plemons-political-drama-2684414-2025-02-24",
      "headline": "Zero Day review: Star power can't save this weakly executed political dramaReleased-Thu Feb 20, 2025Zero Day, directed by Lesli Linka Glatter, is a political drama featuring a stellar cast including Robert De Niro and Angela Bassett. While the performances are strong, the series struggles with plot depth and resolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/watch-jennie-and-doechii-bring-the-heat-with-extral-ahead-of-ruby-2684489-2025-02-24",
      "headline": "Watch: Jennie and Doechii bring the heat with ExtraL ahead of RubyJennie and Doechii are making waves with their latest collaboration, ExtraL. As Jennie gears up for her solo debut with the album Ruby, fans can expect a bold new chapter in her musical journey."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/munawar-faruqui-insulting-religion-jiohotstar-show-hafta-vasooli-complaint-2684460-2025-02-24",
      "headline": "Complaint against Munawar Faruqui for 'insulting religion' on Hafta Vasooli showComedian Munawar Faruqui landed in legal trouble after a complaint was filed against him for hurting religious sentiments through his show, Hafta Vasooli. The advocate shared a copy of the complaint on X. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mismatched-actor-prajakta-koli-shares-dreamy-pics-from-her-mehndi-ceremony-2684350-2025-02-23",
      "headline": "'Mismatched' actor Prajakta Koli shares dreamy pics from her mehndiContent creator and actor Prajakta Koli has started her pre-wedding celebrations with a vibrant mehndi ceremony. She shared joyful moments with her fiance Vrishank Khanal and family on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singhs-millionaire-concert-in-mumbai-comeback-stage-aajtak-2684255-2025-02-23",
      "headline": "Honey Singh's Millionaire concert in Mumbai showed what grand comebacks look likeYo Yo Honey Singh made a powerful return to the stage in Mumbai, captivating fans with his energy and heartfelt messages. His performance was a testament to his resilience and dedication to the art."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-indias-got-latent-controversy-tanmay-bhat-joke-unfiltered-tour-2684268-2025-02-23",
      "headline": "Samay Raina recalls what he asked Tanmay Bhat after India's Got Latent controversyComedian Samay Raina addresses the controversy surrounding YouTuber Ranveer Allahbadia's inappropriate remark on his show, India's Got Latent, during his tour in Canada. He recalled what he had asked Tanmay Bhat after the controversy erupted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-dig-badshah-raftaar-millionaire-india-tour-stage-aajtak-video-2684165-2025-02-23",
      "headline": "Honey Singh's jibe at Raftaar, Badshah: People say they'll write my destinyHoney Singh took a direct dig at fellow artists Badshah and Raftaar at the first Millionaire India Tour stop in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-take-on-diljit-dosanjh-punjabi-aa-gaya-oye-millionaire-tour-mumbai-stage-aajtak-2684161-2025-02-23",
      "headline": "Watch: Honey Singh's take on Diljit Dosanjh's 'Punjabi Aa Gaya Oye'Honey Singh launched his Millionaire India Tour in Mumbai, delivering a captivating performance that engaged a sold-out audience. He shared his take on Diljit Dosanjh's 'Punjabi aa gays oye', emphasising unity among diverse Indian communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/watch-honey-singh-kicks-off-millionaire-tour-with-a-grand-mumbai-show-2684048-2025-02-22",
      "headline": "Watch: Honey Singh kicks off Millionaire tour with a grand Mumbai showRapper Honey Singh launched his Millionaire Tour with a spectacular concert in Mumbai. The show featured dramatic entrances and a lineup of energetic performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/undercover-high-school-x-review-fans-give-thumbs-up-to-seo-kang-joons-k-drama-2683974-2025-02-22",
      "headline": "Undercover High School X review: Fans give thumbs up to Seo Kang-joon's K-dramaUndercover High School, featuring Seo Kang-joon and Jin Ki-joo, has premiered on MBC TV. The series, praised for its engaging storyline, follows an undercover NIS agent as a high school student."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-sean-diddy-combs-attorney-withdraws-from-case-says-under-no-circumstances-can-i-continue-2683745-2025-02-22",
      "headline": "Rapper Diddy's attorney withdraws from case: Under no circumstances can I continueAnthony Ricco, representing Sean 'Diddy' Combs, has filed to withdraw from the federal case citing reasons protected by attorney-client privilege. Ricco had once defended Osama bin Laden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/buried-hearts-review-park-hyung-sik-huh-joon-ho-jiohotstar-2683665-2025-02-21",
      "headline": "Buried Hearts review: Park Hyung-sik commands attention in his darkest roleReleased-Sat Feb 22, 2025The Korean drama Buried Hearts will captivate viewers with its blend of intense emotions and high-stakes drama. The series, featuring Park Hyung-sik, explores the complex dynamics of corporate intrigue and personal survival. Read the full review."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rakhi-sawant-reacts-to-summons-i-am-poor-not-criminal-focus-on-rape-cases-indias-got-latent-row-2683583-2025-02-21",
      "headline": "Rakhi Sawant reacts to summons: I'm poor, not criminal - focus on rape casesRakhi Sawant was summoned by the Maharashtra cyber cell to record her statement regarding YouTuber Ranveer Allahbadia's controversial remarks on Samay Raina's show, 'India's Got Latent'. She urged the police to focus on solving pending rape cases instead of treating her like a criminal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zero-day-critics-praise-robert-de-niro-criticise-show-incoherent-politics-netflix-2683507-2025-02-21",
      "headline": "Zero Day: Critics praise Robert De Niro, criticise show's 'incoherent politics'Critics have mixed reactions to Robert De Niro's latest Netflix series, Zero Day. While many have praised De Niro, a section of them are unhappy with the narrative of the show. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/pune/story/pune-woman-rape-in-bus-swargate-bus-junction-maharashtra-2685914-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pune woman raped inside state transport bus, Uddhav Sena workers vandalise depotA 26-year-old woman was allegedly raped inside a stationary bus at Pune's Swargate depot. Authorities have suspended 23 security guards, while police intensify the manhunt for accused Datta Gade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/southwest-flexjet-near-miss-collision-chicago-midway-airport-landing-runway-air-traffic-control-audio-2685797-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Tower, how'd that happen?': Chilling ATC audio of near-miss at US airportA Southwest Airlines passenger plane nearly collided with a business jet during a landing attempt at Chicago's Midway airport. Air traffic control audio of the incident has raised troubling questions about the role of the private jet pilot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/memories-of-maha-kumbh-mela-2025-how-foreigners-will-remember-prayagraj-shahi-snan-shivratri-2686021-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Memories of Maha Kumbh: How 3 million foreigners will remember the onenessOf the 650 million devotees at the Maha Kumbh 2025 in Prayagraj, 3 million were visitors from abroad. From a sense of security and being comfortable despite a massive crowd to an overwhelming feeling of oneness, foreigners narrate their Kumbh experience. For many, the Kumbh Mela was their primer to understanding India and Indians.       "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/teach-hindi-to-your-staff-not-students-dmk-saravanan-slams-zoho-ceo-sridhar-vembu-2686029-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DMK slams Zoho founder: Teach Hindi to your staff, not students in Tamil NaduDMK spokesperson Saravanan Annadurai hit back at Zoho founder Sridhar Vembu, questioning why Tamil Nadu students should learn Hindi for business needs. Annadurai told the CEO, \"Teach Hindi to your staff if your business needs it.\"  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-csk-ipl-morse-code-t-shirt-retirement-hint-2686009-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "One last time? Morse code on MS Dhoni's T-shirt sparks retirement speculationIPL 2025: MS Dhoni arrived in Chennai on Wednesday to join the Super Kings camp. A Morse code on Dhoni's T-shirt has created a stir on social media, intensifying speculation about his retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cbse-class-10-to-have-2-board-exams-in-2026-pros-and-cons-explained-2686034-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CBSE Class 10 to have 2 board exams in 2026? Pros and cons explained  CBSE's proposal for two Class 10 board exams has sparked debate over student well-being, teacher workload, and logistics. While some see flexibility, others fear it adds pressure. Will this reform ease academics or complicate the system further?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/matter-within-parliaments-domain-centre-plea-life-ban-convicted-politicians-2685912-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre opposes plea on life ban for convicted politicians: 'Parliament's domain'The central government told the Supreme Court that a lifetime ban on convicted politicians is a legislative matter, arguing that existing disqualification rules ensure deterrence while maintaining proportionality and fairness."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/drug-use-or-financial-crisis-police-investigate-motives-in-venjaramoodu-kerala-mass-murder-2685904-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Debt or drug use? Police stumped about motive in Kerala mass murder caseKerala police are investigating the motive behind five shocking murders, focusing on financial debt rather than drug abuse. The accused, 23-year-old Afan, confessed to the crimes, but remains hospitalised, while authorities probe digital evidence and financial records."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/luxuakry-car-run-over-child-ghaziabad-social-media-2686023-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Car runs over child playing in Ghaziabad society, woman driver flees spotThe driver failed to notice the young child playing nearby, leading to the unfortunate accident. An FIR has been registered, and police are investigating the incident.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-planning-universal-pension-scheme-who-will-it-benefit-check-details-eligibility-2685950-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Government plans Universal Pension Scheme: Who will benefit?The ministry of labour and employment is working on the proposed plan, which is expected to bring existing pension schemes under one framework. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/veer-savarkars-impact-on-lata-mangeshkar-and-her-family-2686062-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Veer Savarkar shaped Lata Mangeshkar's musical journeyFreedom fighter Veer Savarkar and the Mangeshkar family had close ties with collaborations that blended patriotism with music. He left a lasting mark on the Mangeshkar family that endures even today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/from-sangam-jal-delivery-to-virtual-dip-how-mahakumbh-2025-went-digital-2685966-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "From Sangam jal delivery to virtual dip: How Maha Kumbh 2025 went digitalMaha Kumbh 2025 was a mix of tradition and technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-reply-mans-explicit-email-5-work-accomplishment-mandate-us-federal-employees-2685949-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "That's only 4: Musk's cheeky reply to man's explicit email on work log ultimatumElon Musk's no-nonsense cost-cutting spree, which has been backed by President Donald Trump, has led to mass resignations and deep divisions within the administration. It has also generated a rather colourful response from one employer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/1-in-3-indian-schools-operate-with-less-than-50-students-says-report-2686007-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "1 in 3 Indian schools operate with less than 50 students, says reportOne in three schools in India, accounting for 35 percent, operates with fewer than 50 students and has either one or two teachers, according to the PRS report findings.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/bjp-contradicts-itself-on-karnataka-muda-scam-2685962-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did Karnataka BJP shoot itself in foot with the smoking gun called Muda scam? As BJP leaders soften their stance on the Muda scam, the party's attack on Congress appears to be crumbling, exposing internal contradictions instead of cornering the Siddaramaiah government. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-donald-trump-bizarre-video-vision-for-gaza-cocktails-beach-gold-statue-benjamin-netanyahu-elon-musk-2685819-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cocktails with Netanyahu, gold statue: Bizarre AI video of Trump's Gaza Earlier this month, Donald Trump made a shock announcement, saying that the US would \"take over and own\" the Gaza Strip and develop the besieged Palestinian enclave as \"Riviera of the Middle East\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/maha-kumbh-fire-officer-reunites-with-college-friend-37-years-wholesome-conversation-viral-video-2685945-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fire officer reunites with college friend after 37 years at Maha Kumbh. Video goes viralSanjeev Kumar Singh and Rashmi Gupta, college classmates from the 1988 batch, reunited at the Maha Kumbh and documented their interaction in the video that has delighted the internet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/neena-gupta-young-actors-should-advise-me-bloody-confident-hindi-vindi-mihir-ahuja-2686016-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Neena Gupta says young actors 'should advise me': They are bloody confidentActor Neena Gupta will be seen alongside actor Mihir Ahuja and Australian musician Guy Sebastian in 'Hindi Vindi'. In an exclusive chat with India Today Digital, Gupta opened up about working with young actors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cbse-boards-draft-norms-omit-punjabi-says-minister-board-says-list-not-final-2685915-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CBSE on row over Punjabi omission in Class 10 exams draft norms: List not finalPunjab's education minister claimed that CBSE's draft board exam policy omitted Punjabi from its subject list. The board has clarified that the list is not final and that no subjects will be removed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-becomes-first-woman-to-be-pushed-by-orry-ananya-panday-reacts-2685990-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Urvashi Rautela becomes 'first woman to be pushed' by Orry, Ananya Panday reactsUrvashi Rautela once again recreated Dabidi Dibidi with Orhan Awatramani. In a video shared by Orry himself, he is seen accidentally pushing the actor, sparking online reactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/punjab-haryana-high-court-kalyug-man-petition-challenging-mother-maintenance-2685968-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kalyug: Court on man's plea against Rs 5,000 maintenance to 77-year-old motherDismissing the plea, the court held that nothing was illegal in the family court's order and the maintenance amount of Rs 5,000 was on the \"lower side\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/contaminated-wheat-atta-resulting-in-hair-loss-what-is-wheat-selenium-thats-to-blame-explained-maharashtra-2685809-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why this atta is causing hair lossOver 300 people in Maharashtra's Buldhana district reported sudden hair loss and balding. A study by Padma Shri awardee physician Himmatrao Bawaskar found high levels of selenium in the wheat being distributed and consumed there as the reason for the surge in alopecia. Here's all about selenium, how it contaminates wheat, and the health risks from it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/united-states-gold-card-visa-trump-eligibility-impact-on-indians-2685855-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Trump's 'gold card' visa for the super rich will impact IndiansUS gold visa: Donald Trump announced a 'gold card' visa scheme for US citizenship for a hefty fee of USD 5 million. The program will compound the woes of skilled Indian professionals.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-calls-father-chunky-panday-choice-of-clothes-questionable-2686077-2025-02-26",
      "headline": "Ananya Panday calls father Chunky's choice of clothes questionableActor Ananya Panday shares a warm and sweet bond with father and actor Chunky Panday. She recently opened up about Chunky's fashion and their debate over film scripts in a new interview. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mahesh-manjrekar-on-sanjay-dutt-filming-vaastav-amid-ongoing-court-trials-2686036-2025-02-26",
      "headline": "Mahesh Manjrekar on Sanjay Dutt filming Vaastav amid ongoing court trialsDespite facing legal battles and financial constraints, Sanjay Dutt filmed the iconic movie Vaastav. Director Mahesh Manjrekar shared insights into the challenges and triumphs during its production."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/the-eye-trailer-shruti-haasan-mark-rowley-caught-up-in-the-mysteries-of-evil-eye-2686067-2025-02-26",
      "headline": "The Eye: Shruti Haasan makes her international debut with psychological thrillerActor Shruti Haasan is set to make her international debut with the British film The Eye. Directed by Daphne Schmon, the psychological thriller also stars Mark Rowley and explores the mysteries of the evil eye."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-joins-hands-marco-director-haneef-adeni-action-spectacle-dharma-productions-2686061-2025-02-26",
      "headline": "Karan Johar joins hands with Marco director Haneef Adeni for action spectacleKaran Johar and Marco director Haneef Adeni have collaborated for an upcoming untitled film. The multilingual film is currently under wraps. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-mohammad-amir-on-virat-kohli-playing-in-pakistan-2686078-2025-02-26",
      "headline": "If Kohli scored century in Pakistan, he'd receive same love as India: Mohammad AmirFormer Pakistan fast bowler Mohammad Amir said that Virat Kohli wouldn't have been able to differentiate between Pakistan and India, had he scored his century in Pakistan instead of Dubai. Kohli scored an unbeaten 100* (111) against Pakistan to help India win by six wickets in Champions Trophy 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ranji-trophy-final-danish-malewar-karun-nair-2686064-2025-02-26",
      "headline": "Danish Malewar, Karun Nair help Vidarbha recover on Day 1 Ranji Trophy 2024-25: Karun Nair and Danish Malewar helped Vidarbha finish Day 1 of the final against Kerala at 254 for four at the VCA Stadium in Nagpur. Malewar stayed not out on 138 at Stumps on the opening day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-mohammad-amir-hails-complete-package-jasprit-bumrah-as-worlds-no-1-bowler-2686048-2025-02-26",
      "headline": "Mohammad Amir hails 'complete package' Jasprit Bumrah as world's no 1 bowlerPakistan fast bowler Mohammad Amir has hailed India's Jasprit Bumrah as the best bowler in the world for his remarkable exploits across all three formats of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammad-amir-exclusive-virat-kohli-cristiano-ronaldo-pakistan-fans-love-2686039-2025-02-26",
      "headline": "Pakistan fans love Virat, he is a complete package like Ronaldo: Mohammad AmirChampions Trophy 2025: Speaking to India Today from Lahore, fast bowler Mohammad Amir explained why fans in Pakistan love Virat Kohli. The India star hit a match-winning hundred against Pakistan in their Group A meeting on Sunday, February 23 in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/maaya-rajeshwaran-rafael-nadal-training-2686028-2025-02-26",
      "headline": "Rafael Nadal keeps a close eye on 15-year-old India sensation Maaya Rajeshwaran15-year-old Maaya Rajeshwaran trained hard at the Rafael Nadal Academy as Nadal kept a close eye on the Indian tennis sensation. The teenager recently hogged the headlines after advancing to the semis of the Mumbai Open. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-csk-ipl-morse-code-t-shirt-retirement-hint-2686009-2025-02-26",
      "headline": "One last time? Morse code on MS Dhoni's T-shirt sparks retirement speculationIPL 2025: MS Dhoni arrived in Chennai on Wednesday to join the Super Kings camp. A Morse code on Dhoni's T-shirt has created a stir on social media, intensifying speculation about his retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-matthew-kuhnemann-cleared-for-bowling-in-international-cricket-by-icc-2686005-2025-02-26",
      "headline": "Matthew Kuhnemann cleared for bowling in international cricket by ICCAustralian left-arm spinner Matthew Kuhnemman has been cleared to bowl in international cricket by the ICC after his action was reported by match officials during the second Test against Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-alyssa-healy-injury-australia-new-zealand-2685992-2025-02-26",
      "headline": "After missing WPL, Alyssa Healy out of New Zealand T20I series Alyssa Healy will miss Australia's three-match T20I series against New Zealand as she recovers from a foot injury. Australia have called up Nicole Faltum with Beth Mooney confirmed to don the wicket-keeping gloves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-ibrahim-zadran-history-century-afghanistan-2685967-2025-02-26",
      "headline": "Ibrahim Zadran hits first-ever Champions Trophy century for Afghanistan Champions Trophy: Ibrahim Zadran became the first Afghanistan batter to score a hundred in the history of the tournament when he achieved the feat against England on Wednesday in Lahore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-jofra-archer-fastest-england-bowler-to-complete-50-odi-wickets-2685960-2025-02-26",
      "headline": "AFG vs ENG: Jofra Archer becomes fastest England bowler to complete 50 ODI wicketsFast bowler Jofra Archer became the fastest England bowler to complete 50 wickets in ODIs as he broke James Anderson's record against Afghanistan in the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-ms-dhoni-chennai-super-kings-arrives-pre-season-camp-ruturaj-2685953-2025-02-26",
      "headline": "MS Dhoni arrives in Chennai to join CSK pre-season camp: See picIPL 2025: MS Dhoni was spotted arriving at Chennai airport ahead of the Super Kings' pre-season camp. Dhoni, along with Ruturaj Gaikwad, Khaleel Ahmed, Anshul Kamboj, and Kamlesh Nagarkoti, was among the local stars who reached the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-matthew-kuhnemann-cleared-for-bowling-in-international-cricket-by-icc-2686005-2025-02-26",
      "headline": "Matthew Kuhnemann cleared for bowling in international cricket by ICCAustralian left-arm spinner Matthew Kuhnemman has been cleared to bowl in international cricket by the ICC after his action was reported by match officials during the second Test against Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-alyssa-healy-injury-australia-new-zealand-2685992-2025-02-26",
      "headline": "After missing WPL, Alyssa Healy out of New Zealand T20I series Alyssa Healy will miss Australia's three-match T20I series against New Zealand as she recovers from a foot injury. Australia have called up Nicole Faltum with Beth Mooney confirmed to don the wicket-keeping gloves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-ibrahim-zadran-history-century-afghanistan-2685967-2025-02-26",
      "headline": "Ibrahim Zadran hits first-ever Champions Trophy century for Afghanistan Champions Trophy: Ibrahim Zadran became the first Afghanistan batter to score a hundred in the history of the tournament when he achieved the feat against England on Wednesday in Lahore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-jofra-archer-fastest-england-bowler-to-complete-50-odi-wickets-2685960-2025-02-26",
      "headline": "AFG vs ENG: Jofra Archer becomes fastest England bowler to complete 50 ODI wicketsFast bowler Jofra Archer became the fastest England bowler to complete 50 wickets in ODIs as he broke James Anderson's record against Afghanistan in the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-ms-dhoni-chennai-super-kings-arrives-pre-season-camp-ruturaj-2685953-2025-02-26",
      "headline": "MS Dhoni arrives in Chennai to join CSK pre-season camp: See picIPL 2025: MS Dhoni was spotted arriving at Chennai airport ahead of the Super Kings' pre-season camp. Dhoni, along with Ruturaj Gaikwad, Khaleel Ahmed, Anshul Kamboj, and Kamlesh Nagarkoti, was among the local stars who reached the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-coach-aaqib-javed-india-defeat-dubai-advantage-press-conference-2685933-2025-02-26",
      "headline": "Playing only in Dubai helps India, but that's not why Pakistan lost: Aaqib JavedChampions Trophy: Speaking to the press on the eve of their last league game against Bangladesh in Rawalpindi, Pakistan head coach Aaqib Javed urged fans and pundits to be more understanding of the emotions in the dressing room after their tough loss to India. The former fast bowler also said India's familiarity with the conditions in Dubai is not why Pakistan lost the big-ticket clash on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ranji-trophy-danish-malewar-vidarbha-2685932-2025-02-26",
      "headline": "Who is Danish Malewar? 21-year-old batter lights up Ranji Trophy final with centuryRanji Trophy 2024-25: Right-handed batter Danish Malewar lit up the VCA Stadium in Nagpur after hitting a 168-ball hundred in the final between Vidarbha and Kerala. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-rohit-sharma-takes-a-walk-in-dubai-streets-triggering-massive-fan-frenzy-2685925-2025-02-26",
      "headline": "Watch: Rohit Sharma takes a stroll in Dubai, triggering a massive fan frenzyIndia captain Rohit Sharma was seen taking a stroll on the streets of Dubai after their clinical win over Pakistan in the ICC Champions Trophy 2025. Seeing Rohit on the streets, the fans went into a frenzy asking for selfies from the India captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-india-vs-pakistan-big-match-player-century-lalchand-rajput-2685826-2025-02-26",
      "headline": "Virat Kohli proved why he is a big match player: Lalchand RajputLalchand Rajput hailed Virat Kohli's century against Pakistan as a reminder of his \"big match\" prowess. The knock not only secured India's semi-final spot but also silenced critics questioning his recent form in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-icc-rankings-cricket-virat-kohli-shubman-gill-babar-azam-odi-2685842-2025-02-26",
      "headline": "Virat Kohli back in top 5, Shubman Gill extends lead over Babar AzamICC ODI Rankings: Following his hundred against Pakistan in Dubai, Virat Kohli has returned to the top five of men's ODI batting rankings. Shubman Gill has extended his lead over second-placed Babar Azam to 47 points. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-yograj-singh-pakistan-cricket-downfall-shoaib-akhtar-wasim-akram-commentary-2685785-2025-02-26",
      "headline": "Yograj Singh to Wasim, Shoaib: Don't just talk, I can fix Pakistan cricket in a yearFormer India cricketer Yograj Singh lashed out at the likes of Shoaib Akhtar and Wasim Akram, urging them to get out of the commentary boxes and help Pakistan players on the field. Yograj claimed he could fix Pakistan cricket team and improve their players in just a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sachin-tendulkar-india-masters-vs-england-masters-tim-bresnan-2685760-2025-02-26",
      "headline": "Watch: Sachin Tendulkar takes fans down memory lane with IML blitzSachin Tendulkar rolled back the years with a nostalgic knock, smashing a quickfire 34 off 21 balls for India Masters in the International Masters League, leading his side to a dominant nine-wicket win over England Masters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-icc-rankings-cricket-virat-kohli-shubman-gill-babar-azam-odi-2685842-2025-02-26",
      "headline": "Virat Kohli back in top 5, Shubman Gill extends lead over Babar AzamICC ODI Rankings: Following his hundred against Pakistan in Dubai, Virat Kohli has returned to the top five of men's ODI batting rankings. Shubman Gill has extended his lead over second-placed Babar Azam to 47 points. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-yograj-singh-pakistan-cricket-downfall-shoaib-akhtar-wasim-akram-commentary-2685785-2025-02-26",
      "headline": "Yograj Singh to Wasim, Shoaib: Don't just talk, I can fix Pakistan cricket in a yearFormer India cricketer Yograj Singh lashed out at the likes of Shoaib Akhtar and Wasim Akram, urging them to get out of the commentary boxes and help Pakistan players on the field. Yograj claimed he could fix Pakistan cricket team and improve their players in just a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sachin-tendulkar-india-masters-vs-england-masters-tim-bresnan-2685760-2025-02-26",
      "headline": "Watch: Sachin Tendulkar takes fans down memory lane with IML blitzSachin Tendulkar rolled back the years with a nostalgic knock, smashing a quickfire 34 off 21 balls for India Masters in the International Masters League, leading his side to a dominant nine-wicket win over England Masters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-imran-khan-india-vs-pakistan-watch-jail-upset-pcb-blame-game-2685739-2025-02-26",
      "headline": "Imran Khan warns of Pakistan cricket's death as blame game over flop show beginsImran Khan expressed disappointment over Pakistan's Champions Trophy exit, blaming poor leadership in cricket administration, while former PCB chief Najam Sethi held Imran responsible for the sport's decline due to his overhaul of the domestic structure. The turmoil in Pakistan cricket continues, with head coach Aaqib Javed reportedly set to be sacked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-crciekt-wpl-2025-attention-rcb-dc-mumbai-indians-2685596-2025-02-26",
      "headline": "Is the WPL getting enough love amid Champions Trophy festival? The Champions Trophy and the Women's Premier League are happening simultaneously. But with stars like Virat Kohli and Rohit Sharma in action in Dubai, is the WPL getting enough attention?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-vs-afghanistan-jos-buttler-boycott-taliban-women-law-2685710-2025-02-26",
      "headline": "Amid boycott call shadow, Jos Buttler speaks on women's plight under TalibanEngland captain Jos Buttler backed the ECB's decision to play Afghanistan in the Champions Trophy despite boycott calls, expressing concern for Afghan women but hoping sport can unite. Afghanistan captain Hashmatullah Shahidi distanced cricket from politics, while the Taliban's restrictions on women's sport remain under scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/champions-trophy/video/security-breach-during-champions-trophy-in-pakistan-ytvd-2685687-2025-02-26",
      "headline": "Security breach disrupts Champions Trophy in PakistanA security breach at Pakistan's Champions Trophy involved an intruder approaching cricketer Rachin Ravindra. The intruder, linked to an Islamist political group, has been banned by the Cricket Board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/steve-smith-welsh-fire-rashid-khan-oval-invincibles-ben-stokes-2685702-2025-02-26",
      "headline": "Steve Smith, Rashid Khan to star in The Hundred, Ben Stokes pulls outSteve Smith and Rashid Khan secured The Hundred deals, while England's Ben Stokes opted out to manage his workload. The tournament also saw major signings, including Trent Boult, Marcus Stoinis, Meg Lanning, and Laura Wolvaardt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-police-dismissed-refusing-duties-india-vs-pakistan-2685694-2025-02-26",
      "headline": "Over 100 Pakistani policemen dismissed for refusing Champions Trophy dutyIn an unprecedented move, over 100 Punjab Police officers were dismissed for refusing security duties during the ICC Champions Trophy 2025, as authorities emphasised zero tolerance for negligence in safeguarding international sporting events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-team-winning-prize-money-participating-pakistan-knocked-out-2685680-2025-02-26",
      "headline": "Clash of Champions: How much money are teams earning in Champions Trophy?The Champions Trophy has already delivered high-stakes drama, with hosts Pakistan crashing out alongside Bangladesh. However, every team, including those eliminated in the group stage, is set to receive financial rewards. Here's a breakdown of the prize money distribution for the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-cricket-dysfunctional-counselling-knocked-out-semi-final-2685664-2025-02-26",
      "headline": "Champions Trophy: Dysfunctional Pakistan need counselling, not surgeryPakistan team's horror run in the recent ICC tournaments keeps bringing up some similar patterns. Unfortunately, the country's cricketing ecosystem has turned a blind eye to all of them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-dubai-advantage-one-venue-nasser-hussain-michael-atherton-2685656-2025-02-26",
      "headline": "England greats accuse ICC of favouritism: India playing in Dubai an 'advantage'Former England cricketers Nasser Hussain and Michael Atherton believe India has a major advantage in the Champions Trophy by playing all their matches in Dubai, avoiding travel fatigue while other teams shuttle between Pakistan and the UAE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-england-afghanistan-rain-weather-lahore-2685460-2025-02-26",
      "headline": "England, Afghanistan in deep water in race for semi-finalChampions Trophy 2025: The upcoming clash between England and Afghanistan is expected to be a cracker at the Gaddafi Stadium in Lahore, but there is a chance of rain which could play spoilsport. On Wednesday, Rawalpindi saw the tournamen's first washed-off match between Australia and South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-cricket-board-beefs-up-ground-security-after-pitch-invasion-in-rawalpindi-2685598-2025-02-26",
      "headline": "Pakistan Cricket Board beefs up ground security after pitch invasion in RawalpindiThe Pakistan Cricket Board (PCB) has reinforced the security at all the venues of the ICC Champions Trophy 2025 after a pitch invasion by a fan during the New Zealand vs Bangladesh match in Rawalpindi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jos-buttler-reacts-to-indias-advantage-of-playing-in-dubai-2685576-2025-02-25",
      "headline": "JButtler takes a dig at India for only playing in Dubai: It's a unique tournamentEngland captain Jos Buttler commented on India's advantage of playing at just one venue in the ICC Champions Trophy 2025. The Men in Blue are playing all of their matches in Dubai after denying to travel to Pakistan for the tournament. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}