{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bloodbath-on-wall-street-dow-crashes-2200-points-sp-suffers-worst-6-collapse-since-2020-glbs-2704343-2025-04-05",
      "headline": "Trump tariffs trigger US markets rout, sharpest plunge since Covid-19US markets suffered their steepest decline since 2020 after China retaliated against Trump's tariffs. The S&P 500 fell 6%, fuelling recession fears and intensifying investor anxiety across global markets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dow-crashes-2000-points-as-trumps-tariffs-spark-global-market-panic-glbs-2704333-2025-04-05",
      "headline": "Dow crashes 2,000 points as Trump's tariffs spark global market panicGlobal markets plunged as Trump's tariffs triggered a trade war escalation with China. The Dow fell over 2,000 points, crude prices tumbled, and investors feared an impending global recession. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-chair-jerome-powell-warns-higher-inflation-slower-growth-trump-tariffs-2704280-2025-04-04",
      "headline": "Higher inflation, slower growth: US Federal Reserve chair warns after Trump tariffsUS Federal Reserve chair Jerome Powell spoke as global markets continued a swoon that has wiped some 10 per cent off major US stock indexes since Trump announced a raft of new tariffs on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stocks-opened-sharply-lower-after-chinas-retaliatory-tariff-measure-nasdaq-composite-2704230-2025-04-04",
      "headline": "US stocks plummet after China's retaliatory levies in response to Trump tariffsNasdaq IXIC dropped more than 20 per cent from its all-time closing high touched in December, putting it on course to confirm a bear market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-return-2025-itr-2-filing-now-made-easier-check-latest-updates-2704180-2025-04-04",
      "headline": "Income tax return 2025: ITR-2 filing now made easierITR-2 is meant for individuals whose annual income is above Rs 50 lakh or who earn from sources like rent, capital gains, or other sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-tumbles-over-900-points-nifty-ends-below-23000-it-metal-stocks-crash-2704038-2025-04-04",
      "headline": "Sensex tumbles over 900 points, Nifty ends below 23,000; IT, metal stocks crashThe S&P BSE Sensex tumbled 930.67 points to 75,364.69 at the closing bell, while the NSE Nifty50 tumbled 345.65 points to settle at 22,904.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-stocks-infoys-tcs-hcltech-down-nifty-sensex-crash-trump-tariff-fy26-outlook-2704032-2025-04-04",
      "headline": "IT stocks bleed as market crashes. Why TCS, Infosys, Wipro shares are down?All major IT stocks declined as fears of a US recession led to heavy selling. IT companies earn a large portion of their revenue from the US market, and concerns about a slowdown in technology spending have further weakened investor sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/piyush-goyal-shark-tank-india-criticism-startups-aman-gupta-boat-ice-cream-brand-2703988-2025-04-04",
      "headline": "With 'fancy ice-cream' jab, Piyush Goyal's cold message to Shark Tank judgesPiyush Goyal row: While flagging the trend of Indian startups focusing on 'fancy ice creams' and food delivery apps, Piyush Goyal drew a parallel with China to pitch for more innovation in deep-tech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ril-share-price-reliance-industries-stock-fall-4-percent-stock-market-crash-mukesh-ambani-net-worth-2703996-2025-04-04",
      "headline": "RIL share price falls 4% ahead of Q4 results. Should you sell?Reliance Industries stock: RIL shares opened at Rs 1,240 and fell to an intraday low of Rs 1,192.85 in the afternoon session. The stock was close to its 52-week low of Rs 1,156, which it touched on March 3, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-india-26-percent-clarity-while-house-new-document-trade-2703962-2025-04-04",
      "headline": "US tariffs stay at 26% as White House unveils new trade documentInitially, India's tariff rate was mentioned as 27% in the earlier version of the White House annex. However, the latest revision has adjusted it to 26%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/withdrawing-epf-know-rules-for-marriage-education-home-and-medical-needs-2703935-2025-04-04",
      "headline": "Withdrawing EPF? Know rules for marriage, education, home and medical needsIf you require money out of your EPF for the purposes of marriage or further studies, there are set regulations one needs to adhere to. You must have been an EPF member for at least seven years and must have at least Rs 1,000 in your EPF account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ashneer-grover-says-politicians-need-reality-check-after-piyush-goyal-startup-focused-on-food-delivery-remark-2703916-2025-04-04",
      "headline": "Politicians need reality check, says Ashneer Grover on Piyush Goyal's startup remarkAshneer Grover has said that Indian politicians need a reality check after Piyush Goyal criticised startups for being too focused on food delivery apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pension-rules-updates-8-rbi-guidelines-every-pensioner-must-know-2703884-2025-04-04",
      "headline": "Pension rules updates: 8 RBI guidelines every pensioner must knowIf a bank accidentally credits more pension than it should to a pensioner, then the bank must consult the Pension Sanctioning Authority before recovering the extra money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-fall-5-percent-today-why-reasons-explained-clsa-trump-tariff-2703862-2025-04-04",
      "headline": "Explained: Why Tata Motors share price has fallen 5% todayTata Motors share price: Tata Motors has gone down 8.68% in the last 5 days, 33.43% in the past month and 38.75% in the last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/piyush-goyal-slams-indian-startups-urges-to-shift-focus-from-food-delivery-apps-2703842-2025-04-04",
      "headline": "Piyush Goyal slams Indian startups, urges to shift focus from food delivery appsUnion Commerce Minister Piyush Goyal criticised India's startup ecosystem, saying it's too focused on food delivery, betting, and fantasy sports apps. In contrast, he praised Chinese startups for prioritising advanced tech like EVs, batteries, semiconductors, and AI, urging Indian innovators to shift toward deeper, tech-driven innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/share-market-crash-today-sensex-nifty-under-pressure-trump-reciprocal-tariffs-global-recession-it-sector-2703831-2025-04-04",
      "headline": "Sensex crashes 1,000 points: 3 reasons behind today's stock market bloodbathStock market crash: The S&P BSE Sensex was down 965.90 points to 75,329.46, while the NSE Nifty50 fell 361.10 points to 22,889.00 as of 2:08 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-india-startup-news-zepto-founder-aadit-palicha-mohandas-pai-defend-2703830-2025-04-04",
      "headline": "Storm of protest from startups after Minister Piyush Goyal's 'dukaandari' jibeStartup ecosystem leaders' response came after Piyush Goyal took a firm stance and said that while Indian startups were busy building food delivery platforms and fantasy gaming apps, those in countries like China were working on EVs, semiconductors, batteries, and AI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-falls-over-350-points-nifty-slides-below-23200-it-and-auto-stocks-drag-markets-2703803-2025-04-04",
      "headline": "Sensex tanks over 700 points as Wall Street bloodbath sinks Indian IT stocksStock market crash: The S&P BSE Sensex was down 698.89 points to 75,596.47 at around 10:06 am, while the NSE Nifty50 was trading 269.50 points lower at 22,980.60."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-expectations-april-4-sensex-nifty-today-wall-street-crash-trump-tariff-2703776-2025-04-04",
      "headline": "Trump's tariff jitters hit US stocks: Will Sensex, Nifty feel the heat today?The extensive tariff announcements by the US government have raised concerns about a global recession, leading to sharp losses in stock markets worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-april-4-shares-in-focus-hdfc-bank-zomato-dmart-nestle-india-sensex-nifty-2703770-2025-04-04",
      "headline": "Stocks to watch on April 4: Shares in news; HDFC Bank, Zomato, DMartStocks in news today: In Friday's session, shares of Zomato, Nestle India, HDFC Bank, DMart, Mazagon Dock, Bajaj Finance, and others will be in focus due to key corporate developments and financial updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-india-startups-grocery-delivery-comparison-china-ai-zepto-ceo-mohandas-pai-2703750-2025-04-04",
      "headline": "Dukaandari hi karni hai? Piyush Goyal slams startups stuck on food deliveryCommerce Minister Piyush Goyal asked Indian startups to shift their focus from food delivery apps to high-tech sectors like semiconductors and AI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dow-drops-1600-as-us-stocks-lead-sell-off-after-trumps-tariffs-cause-covid-like-shock-glbs-2703733-2025-04-04",
      "headline": "Trump tariff blitz wrecks Wall Street, markets suffer biggest fall since CovidTrump's sweeping tariffs sent shockwaves through financial markets, with Wall Street suffering its worst decline since 2020. Analysts warn of economic slowdowns, surging inflation, and a potential recession."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tech-retail-stocks-lead-rout-after-trumps-tariff-blow-glbs-2703723-2025-04-04",
      "headline": "US tech, retail stocks lead rout after Trump's tariff blowTrump's broad tariffs send US markets into a tailspin, with tech, retail, and banking stocks plunging. Apple, Walmart, and Nike face rising costs, while energy prices drop amid economic concerns."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wall-street-opens-sharply-lower-amid-trade-war-fears-after-trump-tariffs-2703618-2025-04-03",
      "headline": "Wall Street opens sharply lower amid trade war fears after Trump tariffsWall Street's major indexes fell sharply after President Trump's new tariffs raised trade war fears. The Dow dropped 2.66%, the S&P 500 declined 3.32%, and the Nasdaq plunged 4.50%, reflecting market uncertainty."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-crash-donald-trump-reciprocal-tariffs-recession-fears-2703617-2025-04-03",
      "headline": "Wall Street bleeds as Trump's tariffs stoke recession fears: 3 things to knowThe Dow Jones Industrial Index fell sharply by over 1,100 points, while the Nasdaq was down over 800 points moments after the US markets opened for trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ppf-nomination-updation-now-free-says-finance-minister-nirmala-sitharaman-2703506-2025-04-03",
      "headline": "PPF nomination updation now free, says Nirmala SitharamanIt is important to add a nominee to the PPFaccount so that the money is transferred in a smooth manner in the event of the death of the PPF account holder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-liberation-day-reciprocal-tariff-announcement-india-at-27-percent-pakistan-29-percent-tariff-2703432-2025-04-03",
      "headline": "Trump's 'Liberation Day' tariff: India at 27%, but where does Pakistan stand?Asian nations have been the hardest hit by Trump's latest tariff move. The new duties aim to cut the US trade deficit and change global supply chains. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-loses-300-points-as-trump-tariffs-weigh-but-nifty-holds-23200-amid-limited-impact-2703450-2025-04-03",
      "headline": "Sensex, Nifty snap 2-day winning streak as D-Street sees limited tariff impactThe S&P BSE Sensex fell 322.08 points to close at 76,295.36, while the NSE Nifty50 shed 82.25 points to end at 23,250.10.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-donald-trump-us-calculate-reciprocal-tariff-for-different-countries-explanation-factors-reasons-2703440-2025-04-03",
      "headline": "Explained: How Trump's administration calculated reciprocal tariffsIn a statement released on Wednesday night, the United States Trade Representative (USTR) explained how the tariffs were determined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byju-raveendran-shares-video-on-x-alleges-fraud-conspiracy-legal-battle-2703395-2025-04-03",
      "headline": "Byju Raveendran alleges conspiracy caught on video amid legal woesThe video he shared is one minute and 44 seconds long and appears to be a screen recording of a virtual meeting involving Byju's shareholders and their lawyers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-news-asia-countries-hardest-hit-china-vietnam-thailand-south-korea-india-2703307-2025-04-03",
      "headline": "Trump's tariff list: Here's why Asian countries took the biggest hitTrump tariff: Besides China, which now faces a total tariff of 54%, Vietnam has been hit with 46%, Thailand with 37%, South Korea with 25%, and India with 27%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/trumps-tariff-order-india-gets-key-exemptions-on-several-critical-minerals-ytvd-2703245-2025-04-03",
      "headline": "Trump's tariff order: India gets key exemptions on several critical mineralsTrump's new tariff order exempts India on copper, lumber, and critical minerals. The order imposes a 26% lower tariff on India compared to China, but experts question the calculation methods. Former diplomat Ashok Sajjanar criticises the non-transparent system and highlights the impact on strategic partnerships in the Indo-Pacific region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-analyzes-impact-of-us-tariff-mixed-bag-not-a-setback-commerce-ministry-ytvd-2703226-2025-04-03",
      "headline": "Mixed bag, not a setback: India's first response to Trump's tariffThe Commerce Ministry of India is analysing the impact of the 27% tariff imposed by the US. The ministry states it's a mixed bag and not a setback. Exemptions are expected in sectors like pharmaceuticals, semiconductors, and critical minerals. The tariff ranges from 10% to 27% across various sectors. India aims to sign a Bilateral Trade Agreement with the US by fall this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pharmaceutical-stocks-rising-today-donald-trump-reciprocal-tariff-exempt-glanf-pharma-cipla-dr-reddys-2703255-2025-04-03",
      "headline": "Sun Pharma, Gland, Cipla, Dr Reddy's: Why pharma stocks are rising todayShares of Sun Pharma, Dr Reddy's Laboratories, Gland Pharma, and Cipla rose sharply during early trade, defying the weak trend visible on the broader markets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-tanks-500-points-nifty-below-23200-it-stocks-worst-hit-hcltech-infosys-2703240-2025-04-03",
      "headline": "Trump tariffs roil Dalal Street: Sensex, Nifty fall as IT stocks worst hitThe S&P BSE Sensex fell 344.27 points to 76,273.17, while the NSE Nifty50 lost 80.60 points to 23,251.75 as of 9:31 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/russia-canada-north-korea-and-mexico-among-countries-missing-from-donald-trump-reciprocal-tariff-list-2703234-2025-04-03",
      "headline": "Why Russia, Canada and these countries were not part of Trump's tariff hit listThe exclusion has raised eyebrows, especially as major trade partners like India (27%), the European Union (20%), and Vietnam (46%) have been slapped with hefty duties. So, why were these countries spared?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-commerce-ministry-official-mixed-bag-not-setback-response-donald-trump-reciprocal-tariffs-announcement-analysing-impact-2703214-2025-04-03",
      "headline": "Mixed bag, not setback: Government official on Trump's tariffs on IndiaThe new tariffs announced by US President Donald Trump include a universal 10% duty on all imports into the US starting from April 5, with an additional 16% to be applied from April 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-april-3-dalal-street-donald-trump-reciprocal-tariff-2703207-2025-04-03",
      "headline": "Stock market opening on April 3: Will Sensex, Nifty fall after Trump tariff?The stock market extended its gains for the second consecutive session in its last session. The Sensex surged 592.93 points to close at 76,617.44, while the NSE Nifty50 rose 166.65 points to end at 23,332.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-april-3-maruti-suzuki-airtel-hdfc-bank-spicejet-trump-tariff-26-percent-2703202-2025-04-03",
      "headline": "Stocks to watch on April 3: Shares in focus; Maruti Suzuki, Airtel, HDFC BankThe stock market will closely track developments today as several companies such as Maruti Suzuki, HDFC Bank, SpiceJet, and more remain in focus due to key announcements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-26-percent-reciprocal-tariff-impact-decoded-sectors-at-risk-trade-deal-2703199-2025-04-03",
      "headline": "What Donald Trump's 27% reciprocal tariff means for IndiaThe 27% reciprocal tariff imposed by US President Donald Trump is a big blow to India's exports, affecting multiple industries. Here's what it means for the Indian economy and also a look at the key sectors at risk."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-praises-brother-in-law-narne-nithin-at-mad-square-success-bash-2704324-2025-04-04",
      "headline": "Jr NTR praises brother-in-law Nithin at MAD Square success bashMAD Square has been a hit among audiences, and Jr NTR couldn't be prouder of his brother-in-law Narne Nithin's acting journey. Speaking at the success bash on Friday, he reminisced about his initial reaction when Nithin first approached him to discuss his aspirations of becoming an actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-last-five-years-finally-hits-broadway-after-years-of-anticipation-glbs-2704301-2025-04-04",
      "headline": "The Last Five Years finally hits Broadway after years of anticipationNick Jonas and Adrienne Warren bring the beloved musical 'The Last Five Years' to Broadway for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/elizabeth-olsen-admits-marvel-films-arent-her-cup-of-tea-not-the-art-i-consume-2704292-2025-04-04",
      "headline": "Elizabeth Olsen admits Marvel films aren't her cup of tea: Not the art I consumeActor Elizabeth Olsen opened up about her personal film preferences and how they differ from her roles in the Marvel Cinematic Universe. Despite her pride in playing Wanda Maximoff, she shared the pressure to choose projects that reflect her true taste.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/new-sex-trafficking-charges-filed-against-sean-diddy-combs-glbs-2704291-2025-04-04",
      "headline": "New sex trafficking charges filed against Sean 'Diddy' CombsSean Diddy Combs faces two additional sex trafficking charges, expanding the federal indictment against him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-bad-ugly-trailer-ajith-kumar-adhik-ravichandran-trisha-krishnan-2704271-2025-04-04",
      "headline": "Good Bad Ugly trailer: Ajith Kumar brings mass back in Adhik Ravichandran's nextThe much-anticipated trailer of Ajith Kumar's Good Bad Ugly is finally out. Directed by Adhik Ravichandran, the film is set to hit theatres on April 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-cameron-unveils-avatar-fire-and-ash-trailer-at-cinemacon-glbs-2704261-2025-04-04",
      "headline": "James Cameron unveils Avatar Fire and Ash trailer at CinemaConJames Cameron unveiled his Avatar Fire and Ash movie's first trailer at CinemaCon introducing new Na'vi clans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-comedian-russell-brand-charged-with-rape-sexual-assault-2704238-2025-04-04",
      "headline": "Actor-comedian Russell Brand charged with rapeRenowned actor and comedian Russell Brand has been charged with serious allegations of rape and sexual assault and oral rape. The alleged offences took place between 1999 and 2005. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dan-da-dan-season-2-release-date-platform-watch-it-early-2704233-2025-04-04",
      "headline": "Dan Da Dan Season 2: Release date, platform and how to watch it earlyDan Da Dan fans can rejoice as the release date for the second season has been announced, along with an opportunity to watch the first three episodes before the full season airs. The episodes will be available in theatres outside Japan under the title Dan Da Dan: Evil Eye."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/palak-tiwari-on-criticism-of-new-gen-actors-well-get-there-but-itll-take-time-2704223-2025-04-04",
      "headline": "Palak Tiwari on criticism of new-gen actors: We'll get there, but it'll take timeActor Palak Tiwari discusses the challenges and criticisms faced by new-generation actors in Bollywood, expressing confidence that they will eventually win over audiences despite the longer time it may take compared to their predecessors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-lopez-stuns-in-plunging-gown-at-broadway-premiere-of-george-clooneys-show-glbs-2704200-2025-04-04",
      "headline": "Jennifer Lopez stuns in plunging gown at Broadway premiere of George Clooney's showJennifer Lopez dazzled at the Broadway premiere of Good Night, and Good Luck, supporting George Clooney.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanths-coolie-to-hit-theatres-ahead-of-independence-day-2704199-2025-04-04",
      "headline": "Rajinikanth's Coolie to hit theatres ahead of Independence DayThe release of Rajinikanth's next film, Coolie, is out. Directed by Lokesh Kanagaraj, it would hit theatres on August 14, ahead of Independence Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-mourns-manoj-kumars-loss-says-he-will-always-be-bharat-to-us-2704188-2025-04-04",
      "headline": "SRK mourns Manoj Kumar's loss, says he will always be 'Bharat to us'Veteran Bollywood actor and director Manoj Kumar died at 87, leaving a significant impact on Indian cinema. Bollywood celebrities, including Shah Rukh Khan and Salman Khan, paid heartfelt tributes to the legend known as 'Bharat Kumar'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/exploring-lee-dong-wook-range-versatility-true-masterclass-acting-weekly-kfix-2703731-2025-04-04",
      "headline": "From killing to reaping souls, Lee Dong-wook is a true masterclass in actingLee Dong-wook is a versatile actor who seamlessly transforms into any role, from the mysterious Grim Reaper in Goblin to the chilling killer in Strangers from Hell and the compassionate insurance worker in Divorce Insurance. In this week's K-Fix, let us take a look at Lee Dong-wook's range as an artiste."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-mother-soni-reminisces-old-holiday-memories-with-cute-throwback-pics-2704183-2025-04-04",
      "headline": "Alia Bhatt's mother Soni reminisces old holiday memories with cute throwback picsActor Alia Bhatt's mother Soni Razdan became nostalgic on Friday, sharing old travel memories with her daughter. Soni shared a bunch of adorable throwback pictures with her 'Aloo', reminiscing about the memories attached to each image.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-poetry-exclusive-interview-on-social-media-digitisation-revival-of-poetry-2704181-2025-04-04",
      "headline": "Digitising emotions: Javed Akhtar on social media's revival of poetry | ExclusiveLyricist and screenwriter Javed Akhtar, in a conversation with India Today, spoke about the revival of poetry through social media, and how digital platforms have made Urdu poetry accessible to a younger audience worldwide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/agnyathavasi-trailer-a-kannada-murder-mystery-around-realm-of-black-magic-2704087-2025-04-04",
      "headline": "Agnyathavasi trailer: A Kannada murder-mystery around realm of black magicProduced by Hemanth Rao, of Sapta Saagaradache Ello fame, Agnyathavasi is directed by Janardhan Chikanna and is scheduled to release in theatres on April 11, 2025. The trailer of the murder mystery was released on April 3. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shor-to-silence-how-manoj-kumar-carried-india-in-his-cinema-2704116-2025-04-04",
      "headline": "Atlas of Bollywood: How Manoj Kumar carried India in his cinemaManoj Kumar's patriotism in cinema was something else. He didn't believe in the chest-thumping, hand-pump-uprooting or Pakistan-bashing patriotism of quintessential Bollywood. His enemy was the malice within. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravikumar-menon-dies-of-cancer-at-71-on-chennai-2704066-2025-04-04",
      "headline": "Veteran Tamil-Malayalam actor Ravikumar Menon dies of cancer at 71Veteran actor Ravikumar Menon has died at the age of 71 in Chennai. Known for his roles in Tamil and Malayalam cinema, he left behind a legacy of diverse performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-olivia-munn-slams-all-female-blue-origin-space-trip-calls-it-gluttonous-2704090-2025-04-04",
      "headline": "Actor Olivia Munn slams all-female Blue Origin space trip, calls it 'gluttonous'Actor Olivia Munn slammed the all-female Blue Origin space trip.The 44-year0old actor admitted how the upcoming trip seems 'gluttonous' when so many people 'can't even afford eggs.'"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-3-day-visit-to-sri-lanka-key-meet-focus-security-energy-trade-anura-kumara-dissanayake-2704369-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM on 3-day visit to Sri Lanka, key meets to focus on security, energy, tradeDuring his three-day visit, PM Modi will be carrying forward India's initiative to help Sri Lanka rebuild after the 2022 economic crisis battered the island nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-in-talks-with-india-vietnam-israel-to-avert-looming-tariffs-report-glbs-2704346-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump in talks with India, Vietnam, Israel ahead of looming tariffs: ReportUS President Donald Trump is in talks with India, Israel, and Vietnam to secure trade deals and avoid looming tariffs, CNN reports. The negotiations aim to resolve trade imbalances and prevent new duties on imports from these key US partners."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/canada-ottawa-rockland-indian-national-stabbed-to-death-suspect-taken-into-custody-embassy-tweet-2704379-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian stabbed to death in Canada's Ottawa, suspect taken into custody: EmbassyThe Indian embassy in Canada confirmed the incident on X and said it was in touch with the victim's family. Authorities have not disclosed the cause of death or whether any charges have been filed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-an-incredible-unifier-of-nations-against-us-ian-bremmer-on-tariff-move-2704316-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump an incredible unifier of nations against US: Ian Bremmer on tariff moveGeopolitical expert Ian Bremmer criticised Donald Trump's new tariff policy, calling it a self-inflicted risk that could trigger a US recession. He warned of global economic fallout, growing opposition to the US, and China's rising influence.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-digvesh-rathi-rishabh-pant-sunil-narine-2704332-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LSG vs MI: Pant turns translator as Digvesh reveals Narine inspirationLSG captain Rishabh Pant turned translator for Digvesh Rathi as the mystery spinner revealed Sunil Narine to be his inspiration. Digvesh was the star of the show as LSG beat MI to secure the second win of their campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bloodbath-on-wall-street-dow-crashes-2200-points-sp-suffers-worst-6-collapse-since-2020-glbs-2704343-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump tariffs trigger US markets rout, sharpest plunge since Covid-19US markets suffered their steepest decline since 2020 after China retaliated against Trump's tariffs. The S&P 500 fell 6%, fuelling recession fears and intensifying investor anxiety across global markets.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-police-suspect-robbery-in-air-force-engineers-murder-kin-alleges-contract-hit-2704294-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Air Force engineer's death: Family claims murder not during robbery but a hit jobA man has been arrested for the killing of IAF chief engineer SN Mishra inside Prayagraj's Central Air Command. Police say it was a botched robbery; the family, however, alleged that it was a contract killing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-slams-china-imposing-additional-tariff-on-us-goods-trade-war-2704193-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "China played it wrong, they panicked: Trump slams additional 34% tariff on US goodsPresident Donald Trump criticised China for imposing 34% tariffs on US goods, calling it an overreaction. China said the move was a response to US tariffs. Tensions grew with export controls and business restrictions.\r\n "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/four-fram2-astronauts-splashdown-from-space-after-first-pole-to-pole-mission-2704296-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Four astronauts splashdown from space after 1st pole-to-pole missionThe Fram2 crew became the first humans to orbit Earth from pole to pole, completing a four-day mission aboard a SpaceX Dragon capsule. Led by Chun Wang, they conducted 22 microgravity experiments before safely returning to Earth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pm-modi-sri-lanka-visit-live-updates-hold-bilateral-talks-with-sri-lankan-president-anura-kumara-disanayaka-inaugurate-projects-2704360-2025-04-05#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "PM Modi Sri Lanka Visit Live: PM to hold talks with Sri Lankan President, inaugurate projects todayPM Modi Sri Lanka Live Updates: Prime Minister Narendra Modi arrived in Sri Lanka on Friday evening on a three-day visit to explore ways to bolster overall bilateral ties, especially in the areas of energy, trade, connectivity, digitalisation and defence. During his visit, he will participate in various programmes. It is also PM Modi's first visit to the island country since the election of its new president. Follow indiatoday.in for more updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-gifts-indian-handicrafts-thailand-visit-2025-2704260-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Budhha statue from Bihar, brocade shawl from Varanasi: PM's gift to ThailandDuring his official visit to Thailand for the sixth BIMSTEC Summit, Prime Minister Narendra Modi presented a series of traditional Indian handicrafts to the Thai royal family and top dignitaries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/how-turkey-hagia-sophia-once-cathedral-mosque-museum-waqf-property-amendment-bill-india-what-happened-2703902-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Turkey's Hagia Sophia, once a cathedral, became Waqf propertyThe Hagia Sophia is at the centre of Turkey's Byzantine, Ottoman and secular history. How did the sixth-century cathedral become a Waqf property, get converted to a museum, and again a mosque? Tracing the history of the Hagia Sophia amid the Waqf Bill debate in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-grants-tiktok-75-day-lifeline-to-secure-us-sale-glbs-2704310-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump extends TikTok sale deadline by 75 days amid US-China trade tensionsAfter Trump hiked tariffs by 34 per cent this week, China's exports to the US will now be taxed at an exorbitant 54 per cent. Amid China's retaliation and the ensuing trade war, the US President has now offered to reduce tariffs on China if Beijing helps facilitate a deal for ByteDance to sell TikTok."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-tilak-varma-retire-out-reaction-gavaskar-harbhajan-2704331-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Retiring Tilak Varma was a mistake: Mumbai Indians slammed after Lucknow lossIPL 2025, LSG vs MI: Former cricketers Sunil Gavaskar and Harbhajan Singh questioned Mumbai Indians' decision to retire out Tilak Varma in their failed chase of 204 in Lucknow. Tilak, batting out of position, hit 28 off 25 balls, struggling for momentum on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-bill-jdu-nda-parliament-support-rift-leaders-quit-2704174-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf Bill support triggers rift within JDU, 5th leader quits partySenior JDU leaders resigned over the NDA ally's support for the Waqf (Amendment) Bill. They said the move betrayed Muslim voters and the party's secular values."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shor-to-silence-how-manoj-kumar-carried-india-in-his-cinema-2704116-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Atlas of Bollywood: How Manoj Kumar carried India in his cinemaManoj Kumar's patriotism in cinema was something else. He didn't believe in the chest-thumping, hand-pump-uprooting or Pakistan-bashing patriotism of quintessential Bollywood. His enemy was the malice within. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-470-04-04-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-retaliates-pakistan-ceasefire-violation-loc-alert-2704283-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India retaliates after ceasefire breach, Pakistan puts LoC on high alertTensions escalated along the Line of Control after the Pakistan Army violated a four-year ceasefire agreement, prompting strong retaliation from the Indian Army. In response, Pakistan placed its forces on high alert across the LoC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-captain-return-what-to-expect-2704371-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dhoni as CSK captain one last time? What to expect if Thala returns in role MS Dhoni could be all set for one last dance as the CSK captain. So what can we expect as Thala makes his return as Chennai captain? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/elizabeth-olsen-admits-marvel-films-arent-her-cup-of-tea-not-the-art-i-consume-2704292-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elizabeth Olsen admits Marvel films aren't her cup of tea: Not the art I consumeActor Elizabeth Olsen opened up about her personal film preferences and how they differ from her roles in the Marvel Cinematic Universe. Despite her pride in playing Wanda Maximoff, she shared the pressure to choose projects that reflect her true taste.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-land-5-per-cent-india-area-more-than-metro-cities-combined-delhi-mumbai-bengaluru-2704143-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf land 5% of India's area, more than big metro cities combinedThe Waqf Amendment Bill, passed by Parliament, aims to make the conversion and management of Waqf properties transparent and efficient. Waqf boards in India collectively hold 39 lakh acres, which is almost 5% of the country's land area and more than the combined land held by the armed forces and the Railways."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhar-overly-obsessed-jibe-raghav-chadha-trade-debate-rajya-sabha-2704241-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jagdeep Dhankhar's 'overly obsessed' jibe at Raghav Chadha during trade debateWhile speaking in the Rajya Sabha, Raghav Chadha said that India should withhold regulatory approvals for Elon Musk's Starlink and use it as a \"bargaining chip\" to renegotiate tariffs imposed by Donald Trump. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tremors-felt-in-north-india-as-50-magnitude-earthquake-rocks-nepal-2704248-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tremors felt in North India as 5.0 magnitude earthquake rocks NepalA 5.0-magnitude earthquake shook Nepal on Friday evening, sending light tremors across parts of northern India. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-glenn-maxwell-key-spinner-pbks-vs-rr-sunil-joshi-2704382-2025-04-05",
      "headline": "Glenn Maxwell key spinner for PBKS on any venue: Spin bowling coach Sunil JoshiSpin coach Sunil Joshi backed Glenn Maxwell as a pivotal spinner for Punjab Kings ahead of their IPL 2025 clash against Rajasthan Royals, stressing the Australian's value with the ball even as his batting form remains a work in progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-tilak-varma-retire-out-vs-lsg-mi-coach-reaction-2704376-2025-04-05",
      "headline": "Tilak Verma retires out vs LSG: MI coach explains reason behind controversial callMI coach Mahela Jayawardene explained why they decided to retire from Tilak Verma during the loss to LSG. Tilak became the fourth player to be retired out in the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-captain-return-what-to-expect-2704371-2025-04-05",
      "headline": "Dhoni as CSK captain one last time? What to expect if Thala returns in role MS Dhoni could be all set for one last dance as the CSK captain. So what can we expect as Thala makes his return as Chennai captain? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-justin-langer-press-conference-call-from-reporters-mom-2704368-2025-04-05",
      "headline": "Watch: LSG coach Langer picks call from reporter's mom at presserLSG head coach Justin Langer picked up a call from a reporter's mother on the journalist's phone during the post-match press conference, delivering a hilarious moment after Lucknow's tense win over Mumbai Indians in the IPL 2025 clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-vs-dc-match-preview-ipl-2025-chennai-super-kings-delhi-capitals-2704232-2025-04-05",
      "headline": "CSK vs DC Match Preview: Can captain Dhoni's return halt Delhi's progress?IPL 2025, Chennai Super Kings vs Delhi Capitals Match Preview: MS Dhoni might return as the captain as the Chennai Super Kings are looking to halt the progress of Delhi Capitals, who have won both their matches thus far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-hardik-pandya-lsg-v-mi-defeat-lucknow-2704330-2025-04-05",
      "headline": "Hardik Pandya owns up to MI's Lucknow defeat amid Tilak Varma controversyIPL 2025, LSG vs MI: Hardik Pandya smashed 28 runs off 16 balls and finished with figures of 4-0-36-5, but Mumbai Indians lost to Lucknow Super Giants by 12 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-today-lsg-vs-mi-highlights-orange-purple-cap-2704339-2025-04-05",
      "headline": "Points Table, April 4: MI slide further after LSG defeatIPL Points Table Update, April 4: Mumbai Indians (MI) slumped to a 12-run defeat to the Lucknow Super Giants (LSG) on April 4 at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium in Lucknow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-rr-sanju-samson-press-conference-yashasvi-jaiswal-2704335-2025-04-05",
      "headline": "Samson backs RR opener Jaiswal to perform after poor IPL 2025 startRR skipper Sanju Samson has backed Yashasvi Jaiswal to perform well after a rocky start to his IPL 2025 campaign. Jaiswal has been short of runs at the top but Samson said that the southpaw is doing everything right and expects him to step up soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-tilak-varma-retire-out-reaction-gavaskar-harbhajan-2704331-2025-04-05",
      "headline": "Retiring Tilak Varma was a mistake: Mumbai Indians slammed after Lucknow lossIPL 2025, LSG vs MI: Former cricketers Sunil Gavaskar and Harbhajan Singh questioned Mumbai Indians' decision to retire out Tilak Varma in their failed chase of 204 in Lucknow. Tilak, batting out of position, hit 28 off 25 balls, struggling for momentum on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-digvesh-rathi-rishabh-pant-sunil-narine-2704332-2025-04-05",
      "headline": "LSG vs MI: Pant turns translator as Digvesh reveals Narine inspirationLSG captain Rishabh Pant turned translator for Digvesh Rathi as the mystery spinner revealed Sunil Narine to be his inspiration. Digvesh was the star of the show as LSG beat MI to secure the second win of their campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-hardik-pandya-lsg-v-mi-defeat-lucknow-2704330-2025-04-05",
      "headline": "Hardik Pandya owns up to MI's Lucknow defeat amid Tilak Varma controversyIPL 2025, LSG vs MI: Hardik Pandya smashed 28 runs off 16 balls and finished with figures of 4-0-36-5, but Mumbai Indians lost to Lucknow Super Giants by 12 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-today-lsg-vs-mi-highlights-orange-purple-cap-2704339-2025-04-05",
      "headline": "Points Table, April 4: MI slide further after LSG defeatIPL Points Table Update, April 4: Mumbai Indians (MI) slumped to a 12-run defeat to the Lucknow Super Giants (LSG) on April 4 at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium in Lucknow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-rr-sanju-samson-press-conference-yashasvi-jaiswal-2704335-2025-04-05",
      "headline": "Samson backs RR opener Jaiswal to perform after poor IPL 2025 startRR skipper Sanju Samson has backed Yashasvi Jaiswal to perform well after a rocky start to his IPL 2025 campaign. Jaiswal has been short of runs at the top but Samson said that the southpaw is doing everything right and expects him to step up soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-tilak-varma-retire-out-reaction-gavaskar-harbhajan-2704331-2025-04-05",
      "headline": "Retiring Tilak Varma was a mistake: Mumbai Indians slammed after Lucknow lossIPL 2025, LSG vs MI: Former cricketers Sunil Gavaskar and Harbhajan Singh questioned Mumbai Indians' decision to retire out Tilak Varma in their failed chase of 204 in Lucknow. Tilak, batting out of position, hit 28 off 25 balls, struggling for momentum on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-digvesh-rathi-rishabh-pant-sunil-narine-2704332-2025-04-05",
      "headline": "LSG vs MI: Pant turns translator as Digvesh reveals Narine inspirationLSG captain Rishabh Pant turned translator for Digvesh Rathi as the mystery spinner revealed Sunil Narine to be his inspiration. Digvesh was the star of the show as LSG beat MI to secure the second win of their campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-tilak-varma-lsg-vs-mi-retire-out-lucknow-2704319-2025-04-04",
      "headline": "Tilak Varma retires out after 23-ball 25, MI coach consoles himIPL 2025, LSG vs MI: Tilak Varma retired out for 25 off 23, but his selfless call went in vain as the Mumbai Indians lost to the Lucknow Super Giants by 12 runs at the Ekana Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-match-report-hardik-pandya-vain-lucknow-2704317-2025-04-04",
      "headline": "LSG vs MI: All-round Hardik Pandya show in vain as Lucknow win thriller at homeIPL 2025, LSG vs MI: Lucknow Super Giants piled up the misery on Mumbai Indians, denying them two points on Friday. After posting 203, LSG successfully defended the total, bowling well in the death overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kuldeep-yadav-csk-vs-dc-noor-ahmad-press-conference-2704251-2025-04-04",
      "headline": "Difficult to read him: Kuldeep Yadav wary of Noor Ahmad threat vs CSKIPL 2025, CSK vs DC: Kuldeep Yadav said that Delhi Capitals (DC) are wary of the threat Noor Ahmad could pose in the upcoming clash against the Chennai Super Kings (CSK) at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-rohit-sharma-dugout-tips-hardik-pandya-nicholas-pooran-wicket-2704286-2025-04-04",
      "headline": "Out injured, Rohit Sharma masterminds Nicholas Pooran wicket. Watch videoIPL 2025, LSG vs MI: Rohit Sharma did not play Friday's match in Lucknow due to a knee injury. However, he played a key role in Hardik Pandya's dismissal of Nicholas Pooran during the Lucknow Super Giants' innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-hardik-pandya-lsg-vs-mi-anil-kumble-record-2704282-2025-04-04",
      "headline": "Hardik Pandya scripts history, breaks Anil Kumble's 16-year-old recordIPL 2025, LSG vs MI: Hardik Pandya broke Anil Kumble's 16-year-old record to register the best bowling figures by a captain in the history of the T20 tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-lsg-vs-mi-captain-reactions-2704269-2025-04-04",
      "headline": "What's wrong with Pant? Fans concerned after LSG captain fails vs MIIPL 2025: Rishabh Pant failed to perform against Mumbai Indians (MI) after scoring only two runs from six balls in the clash on Friday at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium in Lucknow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rr-sanju-samson-full-return-impact-sub-2704250-2025-04-04",
      "headline": "No more impact sub! Fit-again Sanju Samson to resume RR captaincyRajasthan Royals captain Sanjus Samson has said that he will be back as the full-time skipper and wicketkeeper for the team ahead of the Punjab Kings clash on Saturday, April 5. Samson played as an impact sub for the first three games of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-rohit-sharma-dropped-fan-speculation-2704234-2025-04-04",
      "headline": "Rohit Sharma dropped? Fans speculate as MI legend misses LSG clashFans on social media are speculating if Rohit Sharma was dropped by the Mumbai Indians for their clash against Lucknow Super Giants on Friday, April 4 at the Ekana stadium. Rohit hasn't enjoyed the best of times in IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-hardik-pandya-lsg-vs-mi-anil-kumble-record-2704282-2025-04-04",
      "headline": "Hardik Pandya scripts history, breaks Anil Kumble's 16-year-old recordIPL 2025, LSG vs MI: Hardik Pandya broke Anil Kumble's 16-year-old record to register the best bowling figures by a captain in the history of the T20 tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-lsg-vs-mi-captain-reactions-2704269-2025-04-04",
      "headline": "What's wrong with Pant? Fans concerned after LSG captain fails vs MIIPL 2025: Rishabh Pant failed to perform against Mumbai Indians (MI) after scoring only two runs from six balls in the clash on Friday at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium in Lucknow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rr-sanju-samson-full-return-impact-sub-2704250-2025-04-04",
      "headline": "No more impact sub! Fit-again Sanju Samson to resume RR captaincyRajasthan Royals captain Sanjus Samson has said that he will be back as the full-time skipper and wicketkeeper for the team ahead of the Punjab Kings clash on Saturday, April 5. Samson played as an impact sub for the first three games of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-rohit-sharma-dropped-fan-speculation-2704234-2025-04-04",
      "headline": "Rohit Sharma dropped? Fans speculate as MI legend misses LSG clashFans on social media are speculating if Rohit Sharma was dropped by the Mumbai Indians for their clash against Lucknow Super Giants on Friday, April 4 at the Ekana stadium. Rohit hasn't enjoyed the best of times in IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-2025-japanese-grand-prix-carlos-sainz-misses-williams-pit-fp1-2704204-2025-04-04",
      "headline": "Blooper alert! Carlos Sainz misses Williams pit during Japanese GP FP1Carlos Sainz had a moment to forget as the Spaniard missed the Williams pit during the free practice 1 session of the Japanese Grand Prix on Friday, April 4. Sainz has had a rough time since making the switch to Williams. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-knee-injury-lsg-vs-mi-2704194-2025-04-04",
      "headline": "Rohit Sharma misses LSG vs MI clash due to knee injuryIPL 2025: Rohit Sharma sustained a knee injury in the nets' session and hence, the 37-year-old failed to make the cut for Lucknow Super Giants' match against Mumbai Indians on Friday at the Ekana Stadium in Lucknow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-captaincy-ruturaj-gaikwad-injury-2704185-2025-04-04",
      "headline": "MS Dhoni may captain CSK again in home game against Delhi CapitalsIPL 2025, CSK vs DC: Batting coach Michael Hussey said Ruturaj Gaikwad is in doubt to feature in Chennai's home game against Delhi on Saturday. MS Dhoni will lead CSK if Ruturaj isn't fit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-sudharsan-batting-approach-versatile-gt-vs-srh-2704184-2025-04-04",
      "headline": "Flexible Sudharshan opens up about batting mantra in era of fast-paced T20sGujarat Titans opener Sai Sudharsan opened up on the mindset behind his consistent run in IPL 2025, stressing the importance of being versatile with the bat and adapting to different match situations rather than chasing big totals blindly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-jos-buttler-captaincy-number-three-spot-2704175-2025-04-04",
      "headline": "GT's Jos Buttler feeling 'lighter' after quitting England captaincyGujarat Titans star Jos Buttler said that he feels 'lighter' after relinquishing England's white-ball captaincy. Buttler quit the role after England's poor performance in the Champions Trophy earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/olympics-2036-india-training-centre-preparation-2704160-2025-04-04",
      "headline": "India to have training centres for 10 sports as part of preparationIndia are on the way to setting up training centres for 10 sports as a part of preparations for the Olympics 2036. Last year, the Indian Olympic Association submitted India's formal bid to host the quadrennial event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/jimmy-butler-is-great-he-adds-a-championship-dna-lebron-james-reacts-to-warriors-bold-trade-glbs-2704149-2025-04-04",
      "headline": "Jimmy Butler is great. He adds a Championship DNA, LeBron James reacts to Warriors' bold tradeLeBron James praises Butler after the Golden State Warriors defeated the Los Angeles Lakers at Crypto.com Arena, on Thursday, April 4, during the NBA regular game in a thriller 123-116."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-jimmy-butler-injury-scare-during-warriors-vs-lakers-raises-concern-ahead-of-playoffs-glbs-2704140-2025-04-04",
      "headline": "NBA: Jimmy Butler injury scare during Warriors vs Lakers raises concern ahead of playoffsGolden State Warriors forward Jimmy Butler left the game on Thursday, April 3, during the NBA regular game at Crypto.com Arena with a potential left arm injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-kevin-de-bruyne-manchester-city-exit-pep-guardiola-2704111-2025-04-04",
      "headline": "Kevin de Bruyne announces exit from Manchester City, to leave in summerManchester City's star midfielder Kevin de Bruyne has announced his exit from the club. De Bruyne will be leaving the club as a free agent in the summer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-stephen-curry-shares-postgame-moment-with-david-beckham-after-warriors-defeat-lakers-glbs-2704089-2025-04-04",
      "headline": "NBA: Stephen Curry shares postgame moment with David Beckham after Warriors defeat LakersThe Golden State Warriors secured a crucial 123–116 victory over the Los Angeles Lakers on Thursday night, tightening the race for playoff seeding in the Western Conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-shah-rukh-khan-message-venkatesh-iyer-2704083-2025-04-04",
      "headline": "SRK texts KKR after SRH win, sends special message to Venkatesh IyerShah Rukh Khan sent a personal message to KKR players, including a motivating note to Venkatesh Iyer as vice-captain, silenced his price-tag critics with a crucial knock to beat SRH in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-lebron-james-shakes-off-injury-scare-in-lakers-showdown-against-warriors-glbs-2704073-2025-04-04",
      "headline": "NBA: LeBron James shakes off injury scare in Lakers' showdown against WarriorsLeBron James went down in the first quarter during the NBA regular game between the Los Angeles Lakers and the Golden State Warriors at Crypto.com Arena."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}