{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-trading-setup-sensex-nifty-july-15-nse-bse-inflation-global-trade-tariff-2755850-2025-07-15",
      "headline": "Sensex, Nifty today: Inflation drops, but will stock markets rise?Gift Nifty futures were trading at 25,166 points around 8:22 am, suggesting a possible higher start for Nifty50, which closed at 25,082.3 on Monday. This points to cautious optimism on Dalal Street after four straight sessions of losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/smartworks-coworking-spaces-ipo-allotment-status-online-guide-check-gmp-listing-date-2755848-2025-07-15",
      "headline": "Smartworks Coworking Spaces IPO allotment: Online guide to see status. Check GMPInvestors who applied for the IPO can check their allotment status either through the BSE website or the registrar's platform, MUFG Intime India Private Limited (also known as Link Intime India Pvt Ltd)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-hits-record-123000-as-us-policy-hopes-boost-crypto-market-btc-price-all-time-high-2755608-2025-07-14",
      "headline": "Bitcoin hits record $123,000 as US policy hopes boost crypto marketBitcoin is up about 30% so far this year and its rise has lifted other coins too. Ether, the second-biggest token, climbed to a five-month high of $3,059. XRP and Solana also rose about 3% each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-hits-6-year-low-in-june-to-210-2755534-2025-07-14",
      "headline": "Retail inflation cools to 6-year low of 2.10% in JuneThis is the fifth month in a row that inflation has remained below the Reserve Bank of India's (RBI) medium-term target of 4%, and the eighth consecutive month it has stayed under the central bank's upper limit of 6%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-247-points-lower-nifty-below-25100-eternal-zomato-up-3-percent-2755524-2025-07-14",
      "headline": "Sensex closes 247 points lower, Nifty below 25,100; Eternal up 3%The S&P BSE Sensex was down by 247.01 points to close at 82,253.46, while the NSE Nifty50 lost 67.55 points to end at 25,082.30."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ott-dark-pattern-50-percent-find-difficult-to-unsubscribe-local-circles-report-2755499-2025-07-14",
      "headline": "Trap, click, renew: How OTT apps make it hard to cancel subscriptionsAccording to data collected by community platform LocalCircles, 50% of respondents said they have frequently had difficulty cancelling subscriptions to digital services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/edelweiss-mutual-fund-radhika-gupta-on-why-your-portfolio-should-be-yours-not-someone-else-suno-sabki-portfolio-apni-2755465-2025-07-14",
      "headline": "Edelweiss' Radhika Gupta on why your portfolio should be yours, not someone else'sBuilding your investment portfolio should match your own risk comfort, timeframe and goals. What works for your friend may not work for you, says MD and CEO of Edelweiss Mutual Fund, Radhika Gupta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-your-tax-refund-may-be-delayed-this-year-2755425-2025-07-14",
      "headline": "Why your tax refund may be delayed this yearOne big reason for the delay is that the tax filing season began late this year. Normally, people can file their returns from April onwards. But this time, the Income Tax Department released the ITR utilities quite late."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-down-crash-sensex-nifty-decline-reason-why-bse-nse-top-losers-it-stocks-2755394-2025-07-14",
      "headline": "Sensex down 400 points: Why is stock market falling todayAs of 11:50 am, the S&P BSE Sensex was down by 388.85 points to 82,111.62, while the NSE Nifty50 lost 110.85 points to 25,039.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/only-67-percent-filed-itrs-coinswitch-co-founder-ashish-singhal-on-why-indians-delay-tax-filing-2755368-2025-07-14",
      "headline": "Only 6.7% filed ITRs: CoinSwitch co-founder on why Indians delay tax filingIndia has made big progress in digital tax filing over the years. There are new portals, better forms and more ways to pay taxes online. Yet, millions still wait till the last few days to get their documents in order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-rise-5-percent-q1-results-store-close-profit-sales-number-2755365-2025-07-14",
      "headline": "Explained: Why Ola Electric shares gained 5% todayOla Electric share price: The stock touched an intraday high of Rs 43.60 before trading 5.45% higher at Rs 41.99 around 11:11 am, shortly after the electric two-wheeler maker announced its financial results for the first quarter of FY26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-all-time-high-usd-120000-why-reasons-us-policy-latest-price-crypto-ether-2755326-2025-07-14",
      "headline": "Bitcoin zooms past $120,000 to reach all-time high. Here's whyThe world's largest cryptocurrency was last seen trading at $120,700.54, up 1.32%, as investor confidence remained strong ahead of important regulatory discussions in the United States."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-budget-update-ranbir-kapoor-film-is-rs-4000-crore-not-rs-1600-epic-in-2-parts-2755854-2025-07-15",
      "headline": "Ramayana's budget: Not Rs 1600 crore, Ranbir's film is Rs 4000 crore epic in 2 partsNitesh Tiwari's 'Ramayana' is set to become India's most expensive film ever, with a budget crossing Rs 4000 crore for both parts. Starring Ranbir Kapoor, Yash, and Sai Pallavi, the film promises a grand cinematic experience with world-class VFX, AI dubbing, and music by Hans Zimmer and AR Rahman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bollywood-producer-dheeraj-kumar-hospitalised-with-pneumonia-in-critical-condition-2755856-2025-07-15",
      "headline": "Producer Dheeraj Kumar hospitalised with pneumonia, in critical conditionVeteran actor and producer Dheeraj Kumar is in critical condition at Mumbai's Kokilaben Dhirubhai Ambani Hospital due to pneumonia. He is currently on ventilator support in the ICU."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/madam-secretary-stars-tea-leoni-and-tim-daly-wed-in-private-nyc-ceremony-glbs-2755817-2025-07-15",
      "headline": "Madam Secretary stars Téa Leoni and Tim Daly wed in private NYC ceremonyTéa Leoni and Tim Daly, co-stars of Madam Secretary, married in a private New York City ceremony after nearly a decade-long relationship that began quietly on the show's set in 2014.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/first-look-at-new-harry-potter-revealed-as-tv-series-begins-production-glbs-2755810-2025-07-15",
      "headline": "First look at new Harry Potter revealed as TV series begins productionProduction has officially begun on the new Harry Potter TV series, with the first look at Dominic McLaughlin as Harry revealed. The new series, debuting in 2027, has a fresh cast and will follow J.K. Rowling's original books.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/richa-chadha-on-radhika-yadav-murder-world-will-recall-deepak-yadav-loser-2755685-2025-07-14",
      "headline": "Richa Chadha condemns Radhika Yadav's killing, calls her father Deepak a loserActor Richa Chadha has voiced her outrage over the shocking murder of Radhika Yadav, allegedly at the hands of her father Deepak Yadav. She blamed deep-rooted societal pressures for the horrific act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dhanashree-verma-to-join-bigg-boss-19-yuzvendra-chahal-ex-wife-2755671-2025-07-14",
      "headline": "Dhanashree Verma, Yuzvendra Chahal's ex-wife, to join Bigg Boss 19: ReportIndian cricketer Yuzvendra Chahal's ex-wife and influencer Dhanashree Verma may join 'Bigg Boss 19'. She is reportedly in final negotiations with the makers of the reality show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-kashyap-slams-t-series-underpaying-music-dev-d-gangs-of-wasseypur-bhushan-kumar-2755653-2025-07-14",
      "headline": "Anurag Kashyap on T-Series underpaying his films' music: They don't get good musicDirector Anurag Kashyap recently opened up about being underpaid by T-Series for the music of 'Dev D' (2009) and 'Gangs of Wasseypur' (2012). He criticised the music label for undervaluing quality in film music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lee-soo-hyuk-leaves-yg-after-8-years-joins-sooyoung-agency-saraam-entertainment-2755672-2025-07-14",
      "headline": "Tomorrow actor Lee Soo-hyuk leaves YG after 8 years, joins Sooyoung's agencySARAM Entertainment, which currently manages talents like Sooyoung and Park Gyu-young, is all set to welcome actor Lee Soo-hyuk to its roster. Here's all you need to know.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shanaya-kapoor-no-competition-with-bffs-ananya-suhana-family-2755647-2025-07-14",
      "headline": "Shanaya Kapoor says no competition with BFFs Ananya-Suhana: They're familyShanaya Kapoor opens up about her close friendship with Ananya Panday and Suhana Khan. She emphasises that competition does not exist among them as they consider each other family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/b-saroja-devi-dies-87-kannada-cinema-first-female-superstar-2755663-2025-07-14",
      "headline": "B Saroja Devi dies at 87: PM Modi calls her pillar of Indian cinemaVeteran actor B Saroja Devi died at 87, leaving a lasting impact on Indian cinema. Her diverse roles across languages marked her as a versatile icon, mourned by Prime Minister Narendra Modi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/varun-dhawan-janhvi-kapoor-first-look-sunny-sanskari-ki-tulsi-kumari-bollywood-film-release-date-2755621-2025-07-14",
      "headline": "Sunny Sanskari Ki Tulsi Kumari release date out. See Varun, Janhvi's first lookThe first-look posters of actors Varun Dhawan and Janhvi Kapoor from the upcoming film 'Sunny Sanskari Ki Tulsi Kumari' were unveiled on Monday.  Directed by Shashank Khaitan, the film is set for release on October 2 this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shiva-rajkumar-to-vijay-sethupathi-celebs-mourn-b-saroja-devis-death-2755648-2025-07-14",
      "headline": "Shiva Rajkumar to Vijay Sethupathi, celebs mourn B Saroja Devi's deathThe news of veteran actor B Saroja Devi's death at the age of 87 in Bengaluru has prompted an outpouring of tributes from across the South Indian film industry. Actors like Shiva Rajkumar, Sudeep, Darshan, Simran, Ramya, and Vijay Sethupathi remembered her legacy and influence, offering heartfelt condolences on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/deepak-tijori-wants-jo-jeeta-wohi-sikandar-sequel-with-aamir-khan-2755559-2025-07-14",
      "headline": "Deepak Tijori wants Jo Jeeta Wohi Sikandar sequel with Aamir Khan as rival coachDeepak Tijori expressed his wish to create a 'Jo Jeeta Wohi Sikandar' sequel featuring Aamir Khan. He believes the rivalry between their characters as coaches would make for a captivating film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/wimbledon-tribute-jana-nayagan-indian-cinema-2025-jannik-sinner-carlos-alcaraz-2755604-2025-07-14",
      "headline": "Wimbledon posts Thalapathy Vijay's Jana Nayagan style poster with Jannik SinnerWimbledon posted a picture recreating Thalapathy Vijay's 'Jana Nayagan' Republic Day poster with Tennis star Jannik Sinner, commemorating his recent victory at the grand slam event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/benny-blanco-manifest-selena-gomez-with-his-love-checklist-2755596-2025-07-14",
      "headline": "Did Benny Blanco manifest Selena Gomez with his love checklist?Selena Gomez's fiance Benny Blanco's modest checklist for his ideal partner appears to have done the trick. He's seemingly found the real deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/santhosh-kumar-footloosers-feature-back-in-limelight-through-malayalam-film-footloosers-2755605-2025-07-14",
      "headline": "Malayalam movie 'Moonwalk' puts spotlight back on Kerala's breakdance troupeMoonwalk, a new Malayalam film inspired by real-life breakdancers in Thiruvananthapuram, revisits Kerala's 1980s street dance culture. The film traces the journey of the Footloosers troupe and its founder Babu Master, celebrating their resilience, influence, and enduring passion for dance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/farhan-akhtar-bhaag-milkha-bhaag-to-re-release-in-theatres-on-july-18-2755516-2025-07-14",
      "headline": "Farhan Akhtar's Bhaag Milkha Bhaag to re-release in theatres on July 18'Bhaag Milkha Bhaag', based on the life of athlete Milkha Singh, is set for a limited re-release in theatres. Actor Farhan Akhtar, who plays Milkha Singh in the film, said he is grateful that audiences will get to experience the film once again on the big screen. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/b-saroja-devi-dies-pan-india-queen-who-ruled-cinema-for-3-decades-with-unmatched-legacy-2755514-2025-07-14",
      "headline": "B Saroja Devi: Pan-India queen who ruled cinema for 3 decades with unmatched legacyPadma Bhushan B Saroja Devi was the first female superstar of Kannada cinema, who rose to stardom not just in Kannada but also in Tamil, Telugu and Hindi industries, earning her epithets like 'Abhinaya Saraswathi' (Saraswathi of expressions), 'Kannadathu Paingili' (Kannada's Parrot), and 'Chaturbhasha Taare' (Four-language Star). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-begins-targeted-therapy-after-cancer-surgery-2755494-2025-07-14",
      "headline": "Dipika Kakar begins targeted therapy after cancer surgery, shares health updateTelevision actor Dipika Kakar, who is battling stage 2 liver cancer, has started targeted therapy and shared her health update with fans. Despite early side effects like mouth ulcers, she remains positive and is following her doctors' advice strictly."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-student-succumbs-to-injuries-after-self-immolation-cm-vows-swift-justice-glbs-2755820-2025-07-15",
      "headline": "Odisha student, who self-immolated over inaction on harassment complaint, diesThe student reportedly set herself ablaze after repeated complaints of sexual harassment by her college's Head of Department allegedly went unaddressed by the principal and college authorities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-3rd-test-lords-ravindra-jadeja-knock-opinion-divided-2755790-2025-07-15",
      "headline": "Hero or villain? Jadeja's Lord's stand with Bumrah and Siraj divides opinionEngland vs India, 3rd Test: Ravindra Jadeja faced 181 balls for his 61 not out on Day 5. The all-rounder stretched India's fight into the last session with his partnerships with tail-enders Jasprit Bumrah and Mohammed Siraj. Could he have taken a few more risks? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-talks-dairy-agriculture-animal-feed-ban-milk-imports-religious-sensitivities-job-loss-2755700-2025-07-15",
      "headline": "Non-veg milk a red line in India-US trade talks. Here's whyAmid the India-US trade deal talks, Washington DC wants New Delhi to open its dairy market. But India insists on strict certification that ensures imported milk comes from cows not fed animal-based products like meat or blood. Rooted in religious and cultural sensitivities, India sees this as the \"non-negotiable red line\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uk-caa-flags-boeing-787-fuel-control-issues-before-air-india-crash-2755843-2025-07-15",
      "headline": "UK regulator flagged Boeing fuel switches four weeks before Air India crashThe UK Civil Aviation Authority issued a safety notice on fuel control switches on Boeing 787s weeks before the Air India crash. This raises concerns over oversight and aircraft safety compliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-to-return-home-undocking-to-splashdown-explained-in-graphics-2754518-2025-07-15",
      "headline": "Shux is coming home: Trailblazing return flight explained in graphicsThe departure from the Space Station follows a series of meticulously planned steps to ensure a safe and smooth return to Earth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/congress-bjp-row-erupts-over-protocol-at-ktaka-sigandur-bridge-inauguration-shivamogga-2755639-2025-07-14",
      "headline": "Shouldn't I have been invited? Siddaramaiah slams Gadkari over bridge openingA row over protocol marred the inauguration of Karnataka's Rs 473 crore Sigandur bridge, with Chief Minister Siddaramaiah alleging the Centre excluded his office from prior consultation or planning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-india-defiance-tale-victory-lords-test-2755827-2025-07-15",
      "headline": "At Lord's, India's defiance crafts a tale greater than victoryEngland vs India, Lord's Test: Ravindra Jadeja, Jasprit Bumrah, and Mohammed Siraj fight to the last ball, turning a Test match defeat into a timeless saga of courage that will become a part of the legend of Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mamdani-blasts-cuomos-comeback-bid-cutting-deals-with-billionaires-glbs-2755819-2025-07-15",
      "headline": "Cutting deals with billionaires: Mamdani blasts Cuomo's comeback bidZohran Mamdani's upset primary win over Cuomo reshapes NYC's mayoral race as the ex-governor refuses to bow out, setting up a four-way general election contest with Adams and Sliwa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-modi-govts-4-rajya-sabha-picks-signal-shift-in-strategic-template-2755515-2025-07-14",
      "headline": "How Modi government's 4 Rajya Sabha picks signal shift in strategic templateThe Upper House of Parliament, often mocked as a place for defeated politicians or ageing notables, is being reimagined as an instrument of deep influence\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-tourist-satish-rajesh-bhai-dies-paragliding-crash-himachal-pradesh-dharamshala-indrunag-ban-kangra-second-incident-six-months-2755847-2025-07-15",
      "headline": "Gujarat tourist, 25, dies after paraglider crashes in Himachal's DharamshalaThe accident happened when the paraglider failed to lift into the air during take-off and crashed after a short distance. Both Satish Rajesh Bhai from Gujarat's Ahmedabad and pilot, Suraj, sustained injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sledging-battle-win-lords-test-gill-crawley-siraj-duckett-2755853-2025-07-15",
      "headline": "India stoked the fire, but England doused it and won sledging battle at Lord'sThe Lord's Test took on a life of its own when India decided to escalate the sledging battle at the end of Day 3. However, on the decisive days that followed, it was England who counter-punched-winning both the match and the war of words."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-will-impose-very-severe-tariffs-on-russia-if-theres-no-deal-to-end-ukraine-war-in-50-days-trump-2755708-2025-07-14",
      "headline": "End Ukraine war or face 100% tariffs: Trump gives Putin 50-day deadlineNato Secretary General Mark Rutte, who joined Donald Trump for talks at the White House, said that if he was Putin, he would have thought about the US President's warning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/5-reasons-why-india-lost-to-england-at-lords-2755795-2025-07-15",
      "headline": "Where did India lose the Lord's Test match: Run out, extras, or somewhere else?England vs India: India lost the Lord's Test by 22 runs after a tense final-innings chase. What factors contributed to their narrow defeat in the 3rd Test?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/need-to-avoid-restrictive-trade-measures-jaishankar-tells-chinas-wang-yi-2755698-2025-07-14",
      "headline": "Need to avoid restrictive trade measures, Jaishankar tells China's Wang YiIn his opening remarks at the meeting, Jaishankar said the relations between the two countries can continue to develop on a \"positive trajectory\" on the foundation that differences should not become disputes and competition should not become conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/fauja-singh-marathon-runner-dies-in-punjab-jalandhar-road-accident-aged-114-2755788-2025-07-15",
      "headline": "Fauja Singh, 114-year-old marathon runner, dies in hit-and-run; PM Modi condolesHis demise was confirmed by author Khushwant Singh, who spoke to Fauja Singh's family members and also paid tribute to the veteran marathon runner on X. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/two-spicejet-flyers-try-to-enter-cockpit-causing-flight-delay-offloaded-2755860-2025-07-15",
      "headline": "Two SpiceJet flyers try to enter cockpit, causing flight delay; offloadedA SpiceJet flight was delayed after two passengers attempted to forcefully enter the cockpit. They were later offloaded from the flight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-its-the-best-time-to-be-pradhan-ji-in-bihar-2755439-2025-07-14",
      "headline": "Why it's the best time to be Pradhan-ji in BiharGleaming Panchayat Sarkar Bhawans, set for launch by CM Nitish Kumar on Independence Day, promise to make OTT's celebrated Phulera panchayat set‑piece look like their poor cousin\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-fined-celebration-gavaskar-hussain-defend-2755834-2025-07-15",
      "headline": "Mohammed Siraj fined: Cricket legends back India pacer after match fees deductionEngland vs India: Sunil Gavaskar and Nasser Hussain felt it was harsh for Mohammed Siraj to be fined for his celebrations after dismissing Ben Duckett on Day 4 of the Lord's Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-budget-update-ranbir-kapoor-film-is-rs-4000-crore-not-rs-1600-epic-in-2-parts-2755854-2025-07-15",
      "headline": "Ramayana's budget: Not Rs 1600 crore, Ranbir's film is Rs 4000 crore epic in 2 partsNitesh Tiwari's 'Ramayana' is set to become India's most expensive film ever, with a budget crossing Rs 4000 crore for both parts. Starring Ranbir Kapoor, Yash, and Sai Pallavi, the film promises a grand cinematic experience with world-class VFX, AI dubbing, and music by Hans Zimmer and AR Rahman."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/people-killed-after-small-plane-crashed-at-london-airport-shortly-after-takeoff-2755774-2025-07-14",
      "headline": "4 killed after plane crashed at London airport shortly after takeoffBritain's Air Accidents Investigation Branch, which investigates civil aircraft accidents, said it was \"too early\" to determine what caused the crash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/dark-chocolates-vs-dates-which-sweet-deserves-a-place-in-your-pantry-2755535-2025-07-14",
      "headline": "Dark chocolates vs dates: Which is the healthier sweet for your pantry?When it comes to healthy eating, reducing sugar intake is often one of the first steps. So, when comparing dark chocolate and dates, which is the healthier pick? Experts reveal the sweet truth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/we-dont-trust-the-ceasefire-ready-for-any-new-adventurism-iran-defence-chief-glbs-2755816-2025-07-15",
      "headline": "We don't trust the ceasefire, ready for any new adventurism: Iran defence chiefIran's Defence Minister Aziz Nasirzadeh says the country doesn't trust the ceasefire and is prepared with multiple scenarios to respond decisively to any new acts of military adventurism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-auto-fare-increased-from-rs-30-to-rs-36-for-first-two-km-in-effect-from-august-2755857-2025-07-15",
      "headline": "Bengaluru auto fare hiked to Rs 36 for first 2 km from August 1Autorickshaw fares within Bengaluru's BBMP limits are set to increase from August 1. The hikes include base and per-kilometre fares, with updated waiting, luggage, and night-time charges. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/one-of-the-worst-real-estate-deals-ever-made-trump-on-gaza-glbs-2755803-2025-07-15",
      "headline": "One of the worst real estate deals ever made: Trump on GazaThe US has been backing a 60-day ceasefire plan. This plan includes a gradual release of hostages, Israeli troops pulling back from parts of Gaza, and peace talks to end the fighting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-budget-update-ranbir-kapoor-film-is-rs-4000-crore-not-rs-1600-epic-in-2-parts-2755854-2025-07-15",
      "headline": "Ramayana's budget: Not Rs 1600 crore, Ranbir's film is Rs 4000 crore epic in 2 partsNitesh Tiwari's 'Ramayana' is set to become India's most expensive film ever, with a budget crossing Rs 4000 crore for both parts. Starring Ranbir Kapoor, Yash, and Sai Pallavi, the film promises a grand cinematic experience with world-class VFX, AI dubbing, and music by Hans Zimmer and AR Rahman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bollywood-producer-dheeraj-kumar-hospitalised-with-pneumonia-in-critical-condition-2755856-2025-07-15",
      "headline": "Producer Dheeraj Kumar hospitalised with pneumonia, in critical conditionVeteran actor and producer Dheeraj Kumar is in critical condition at Mumbai's Kokilaben Dhirubhai Ambani Hospital due to pneumonia. He is currently on ventilator support in the ICU."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/madam-secretary-stars-tea-leoni-and-tim-daly-wed-in-private-nyc-ceremony-glbs-2755817-2025-07-15",
      "headline": "Madam Secretary stars Téa Leoni and Tim Daly wed in private NYC ceremonyTéa Leoni and Tim Daly, co-stars of Madam Secretary, married in a private New York City ceremony after nearly a decade-long relationship that began quietly on the show's set in 2014.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/richa-chadha-on-radhika-yadav-murder-world-will-recall-deepak-yadav-loser-2755685-2025-07-14",
      "headline": "Richa Chadha condemns Radhika Yadav's killing, calls her father Deepak a loserActor Richa Chadha has voiced her outrage over the shocking murder of Radhika Yadav, allegedly at the hands of her father Deepak Yadav. She blamed deep-rooted societal pressures for the horrific act."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-heart-soul-statistics-beyond-lords-test-2755868-2025-07-15",
      "headline": "Ben Stokes, England's heart and soul, is beyond the statsEngland captain Ben Stokes gave a jaw dropping performance in the Lord's Test match. Braving pain, Stokes bowled a total of 44 overs, in an effort that once again furthered his legacy as a true leader in world cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-run-out-sunil-gavaskar-biggest-turning-point-lords-test-2755861-2025-07-15",
      "headline": "Rishabh Pant's run-out the biggest turning point of Lord's Test: GavaskarSunil Gavaskar pinpointed Rishabh Pant's run-out as the key turning point in India's heartbreaking 22-run loss to England at Lord's, highlighting how it derailed a dominant partnership and ultimately cost India the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-sunil-gavaskar-test-series-prediction-lords-loss-2755859-2025-07-15",
      "headline": "India could still win the Test series 3-2 against England: Sunil GavaskarIndia great Sunil Gavaskar has backed the Shubman Gill-led young side to bounce back from the Lord's Test heartbreak and win the five-match series 3-2 with victories in Manchester and at the Oval.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sledging-battle-win-lords-test-gill-crawley-siraj-duckett-2755853-2025-07-15",
      "headline": "India stoked the fire, but England doused it and won sledging battle at Lord'sThe Lord's Test took on a life of its own when India decided to escalate the sledging battle at the end of Day 3. However, on the decisive days that followed, it was England who counter-punched-winning both the match and the war of words."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-jofra-archer-sourav-ganguly-waving-shirt-stokes-win-lords-2755846-2025-07-15",
      "headline": "How Ganguly's iconic shirt-waving act inspired Jofra Archer's heroic spellJofra Archer drew inspiration from Sourav Ganguly's famous shirt-swinging celebration at the 2002 NatWest Trophy final to deliver a match-winning spell for England on day five of the third Test against India at Lord's on Monday, revealed England captain Ben Stokes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-fined-celebration-gavaskar-hussain-defend-2755834-2025-07-15",
      "headline": "Mohammed Siraj fined: Cricket legends back India pacer after match fees deductionEngland vs India: Sunil Gavaskar and Nasser Hussain felt it was harsh for Mohammed Siraj to be fined for his celebrations after dismissing Ben Duckett on Day 4 of the Lord's Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/5-reasons-why-india-lost-to-england-at-lords-2755795-2025-07-15",
      "headline": "Where did India lose the Lord's Test match: Run out, extras, or somewhere else?England vs India: India lost the Lord's Test by 22 runs after a tense final-innings chase. What factors contributed to their narrow defeat in the 3rd Test?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-india-defiance-tale-victory-lords-test-2755827-2025-07-15",
      "headline": "At Lord's, India's defiance crafts a tale greater than victoryEngland vs India, Lord's Test: Ravindra Jadeja, Jasprit Bumrah, and Mohammed Siraj fight to the last ball, turning a Test match defeat into a timeless saga of courage that will become a part of the legend of Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-test-lowest-score-27-mitchell-starc-boland-2755823-2025-07-15",
      "headline": "West Indies 27 all-out, 2nd lowest Test total, after Starc's six, Boland's hat-trickWI vs AUS, 3rd Test Score: West Indies were bowled out for 27, the second-lowest total in an innings in Test cricket history. Mitchell Starc ran through the batting line-up with six wickets on Sunday in Jamaica."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-shoaib-bashir-injury-ruled-out-2755801-2025-07-15",
      "headline": "Lord's hero Shoaib Bashir ruled out of remainder of Test series against IndiaOne of England's Lord's Test heroes, Shoaib Bashir has been ruled out of the remainder of the Test series against India due to the injury he sustained in the match. Bashir fought through pain and got the final wicket of the match to seal the win for the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sa-1st-t20i-tri-series-report-rubin-hermann-dewald-brevis-harare-2755799-2025-07-15",
      "headline": "ZIM vs SA: Hermann, Brevis star as South Africa win 1st match of tri-seriesDebutant Rubin Hermann and Dewald Brevis starred with the bat as South Africa defeated Zimbabwe by 5 wickets in the first T20I of the tri-series on Monday, July 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/5-reasons-why-india-lost-to-england-at-lords-2755795-2025-07-15",
      "headline": "Where did India lose the Lord's Test match: Run out, extras, or somewhere else?England vs India: India lost the Lord's Test by 22 runs after a tense final-innings chase. What factors contributed to their narrow defeat in the 3rd Test?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-india-defiance-tale-victory-lords-test-2755827-2025-07-15",
      "headline": "At Lord's, India's defiance crafts a tale greater than victoryEngland vs India, Lord's Test: Ravindra Jadeja, Jasprit Bumrah, and Mohammed Siraj fight to the last ball, turning a Test match defeat into a timeless saga of courage that will become a part of the legend of Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-test-lowest-score-27-mitchell-starc-boland-2755823-2025-07-15",
      "headline": "West Indies 27 all-out, 2nd lowest Test total, after Starc's six, Boland's hat-trickWI vs AUS, 3rd Test Score: West Indies were bowled out for 27, the second-lowest total in an innings in Test cricket history. Mitchell Starc ran through the batting line-up with six wickets on Sunday in Jamaica."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-shoaib-bashir-injury-ruled-out-2755801-2025-07-15",
      "headline": "Lord's hero Shoaib Bashir ruled out of remainder of Test series against IndiaOne of England's Lord's Test heroes, Shoaib Bashir has been ruled out of the remainder of the Test series against India due to the injury he sustained in the match. Bashir fought through pain and got the final wicket of the match to seal the win for the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sa-1st-t20i-tri-series-report-rubin-hermann-dewald-brevis-harare-2755799-2025-07-15",
      "headline": "ZIM vs SA: Hermann, Brevis star as South Africa win 1st match of tri-seriesDebutant Rubin Hermann and Dewald Brevis starred with the bat as South Africa defeated Zimbabwe by 5 wickets in the first T20I of the tri-series on Monday, July 14. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}