{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cartier-confirms-client-data-stolen-in-cyberattack-glbs-2735327-2025-06-04",
      "headline": "Cartier confirms client data stolen in cyberattackCartier confirmed a cyberattack in which client data was stolen, joining a growing list of major brands hit by breaches, including Victoria's Secret, Marks & Spencer, and The North Face."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/raghuram-rajan-on-viksit-bharat-indian-economy-gdp-growth-2735251-2025-06-03",
      "headline": "India needs 8-9% growth to become Viksit Bharat by 2047: Raghuram RajanCan India turn its economic momentum into lasting prosperity? As global risks loom and GDP rankings rise, Raghuram Rajan lays out what it will really take to become a developed nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-needs-8-9-growth-to-become-viksit-bharat-by-2047-raghuram-rajan-2735233-2025-06-03",
      "headline": "India needs 8-9% growth to become Viksit Bharat by 2047: Raghuram RajanIn an exclusive interview with India Today TV's Consulting Editor Rajdeep Sardesai, former RBI Governor Raghuram Rajan discussed India's economic outlook in uncertain global times. He emphasised the need for 8-9% growth for India to become a developed nation by 2047."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/oecd-cuts-global-growth-forecast-to-29-percent-in-2025-2026-trade-war-tariffs-impact-2735081-2025-06-03",
      "headline": "OECD cuts global growth forecast citing trade war risksThe OECD has reduced its global growth forecast to 2.9% for 2025 and 2026, attributing the slowdown to heightened trade tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/credit-score-made-easy-check-it-fix-it-boost-it-2735057-2025-06-03",
      "headline": "Credit score made easy: Check it, fix it, boost itYour credit score is mostly shaped by how timely you are with payments, missing even one EMI or credit card due can bring it down.  A score of 750 or above is considered good by most banks and lending companies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-636-points-lower-nifty-below-24600-adani-ports-down-2-percent-2735021-2025-06-03",
      "headline": "Sensex closes 636 points lower, Nifty below 24,600; Adani Ports down 2%The S&P BSE Sensex was down by 636.24 points to close at 80,737.51, while the NSE Nifty50 fell by 174.10 points to end at 24,542. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-news-investment-tips-smallcap-stocks-should-you-invest-expert-view-2734964-2025-06-03",
      "headline": "Smallcap stocks are back in action again. Should you ride the wave?Since the market's low in February 2025, the Nifty50 index has risen by 12%. But the real jump has been in the mid and smallcap space. The midcap index has gone up by 20%, and the smallcap index has climbed 22% during the same period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-bloodbath-dalal-street-key-reasons-explained-2734954-2025-06-03",
      "headline": "Sensex tumbles 700 points: What's behind today's stock market decline?The BSE Sensex was trading 740.82 points lower at 80,632.93 at around 1:13 pm, while the NSE Nifty50 fell 187.65 points to 24,528.95. All the other Nifty sectoral indices also fell as volatility rose during the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/own-property-in-india-why-you-must-fix-any-paperwork-issues-now-registration-bill-2025-2734925-2025-06-03",
      "headline": "Own property in India? Why you must fix any paperwork issues nowIn fact, for years, the biggest property scam in India has been when someone who isn't the real owner sells a property. The buyer, after paying a huge amount, later finds out they were cheated, and the actual owner was someone else all along."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-made-easy-here-is-simple-step-by-step-guide-to-file-income-tax-return-2734897-2025-06-03",
      "headline": "ITR filing made easy: Here's a simple step-by-step guide to file income tax returnBefore starting your income tax return, ensure you have key documents in hand. These include Form 16 from your employer, Form 26AS, the Annual Information Statement (AIS) and Tax Information Statement (TIS) from the income tax portal, and your bank statements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gdp-growth-fy26-slow-down-further-nomura-prediction-stock-market-2734854-2025-06-03",
      "headline": "India's GDP growth may decline to 6.2% in FY26, says NomuraThe assessment, published in a research note on Monday, comes amid what the brokerage describes as a growing \"divergence\" between headline indicators like GST collections and other key economic metrics such as automobile sales and bank credit growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/prostarm-info-systems-share-price-listing-strong-market-debut-19-percent-premium-bse-nse-2734852-2025-06-03",
      "headline": "Prostarm Info Systems shares make strong D-Street debut; list at 19% premiumProstarm Info Systems share price: The stock listed at Rs 125 on the BSE, which was 19.04% higher than its issue price of Rs 105. On the NSE, the stock opened at Rs 120, marking a 14.28% premium over its issue price."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/love-island-usa-season-7-how-to-watch-stream-schedule-and-premiere-details-glbs-2735354-2025-06-04",
      "headline": "Love Island USA Season 7: How to watch, stream schedule, and premiere detailsLove Island USA Season 7 premieres June 3 on Peacock with new twists, ten fresh Islanders in Fiji, and real-time audience interaction through the app. Episodes also air on Bravo and Hulu.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/diddy-gave-bag-of-cash-to-bury-hotel-assault-tape-ex-guard-tells-court-glbs-2735348-2025-06-04",
      "headline": "Diddy gave bag of cash to bury hotel assault tape, ex-guard tells courtA former hotel guard testified that Sean Combs paid $100,000 to suppress assault footage. The video, now key evidence in a federal case, supports multiple abuse allegations Combs denies.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/what-are-labubu-dolls-tiktoks-viral-collectible-is-selling-out-fast-glbs-2735344-2025-06-04",
      "headline": "What are Labubu Dolls? TikTok's viral collectible is selling out fastLabubu dolls, creepy-cute collectibles from Pop Mart, have gone viral on TikTok due to celebrity influence, surprise unboxing, and high resale value — some fetching up to $7,000 online.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/is-taylor-swift-pregnant-internet-buzzes-over-baby-bump-photo-glbs-2735329-2025-06-04",
      "headline": "Is Taylor Swift pregnant? Internet buzzes over 'baby bump' photoA viral photo of Taylor Swift sparked speculation that she may be pregnant with Travis Kelce's child, though fans are divided and the couple has not publicly addressed the rumors.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddharth-nigam-on-being-replaced-by-aaman-devgan-in-azaad-waited-an-entire-year-2735182-2025-06-03",
      "headline": "Siddharth Nigam on being replaced by Aaman Devgan in Azaad: Waited an entire yearActor Siddharth Nigam recently opened up on being replaced by Ajay Devgn's nephew Aaman Devgan in 'Azaad.' His mother recalled their shocking reaction after finding out Aaman was playing the lead in the period drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-supports-deepika-padukone-8-hour-workday-request-2735185-2025-06-03",
      "headline": "Pankaj Tripathi on long working hours amid Deepika-Sandeep Vanga's Spirit rowActor Pankaj Tripathi talked about fixed work hours in films, saying it's important to set limits. He believes saying \"no\" politely is necessary to maintain a healthy balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-invites-chandrababu-naidu-son-akhil-akkineni-zainab-ravdjee-wedding-2735159-2025-06-03",
      "headline": "Nagarjuna invites Chandrababu Naidu to son Akhil Akkineni-Zainab's weddingActor Nagarjuna met Andhra Pradesh Chief Minister N Chandrababu Naidu to invite him to his son Akhil Akkineni's wedding with Zainab Ravdjee on June 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/good-boy-cast-exclusive-park-bo-gum-kim-so-hyun-lee-sang-yi-on-bollywood-india-their-playlist-2735156-2025-06-03",
      "headline": "Good Boy Cast Exclusive: Park Bo Gum, Kim So Hyun, Lee Sang Yi on Bollywood, India, their playlistPark Bo Gum, Kim So Hyun, Lee Sang Yi, Heo Seong Tae and Tae Won Seo get real in this exclusive interview with Bhavna Agarwal on all things Good Boy—their action-packed K-drama that's already winning hearts, premiering on Prime Video in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/imran-khan-ex-wife-avantika-malik-on-divorce-struggles-to-save-her-marriage-2735133-2025-06-03",
      "headline": "Avantika Malik on divorce with Imran Khan: Was the worst thing I had to go throughActor Imran Khan's ex-wife Avantika Malik recently spoke about their painful separation. The couple ended their eight-year marriage in 2019. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-might-be-comedy-king-but-lets-discuss-when-he-was-villain-supreme-2735069-2025-06-03",
      "headline": "Paresh Rawal might be comedy king, but let's discuss when he was villain supremeBefore he became everyone's favourite Baburao Ganpatrao Apte, Paresh Rawal was one of Bollywood's most chilling and realistic villains. It's time to revisit his powerful negative roles that showed his true range long before he wore the crown of a comedy king. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/parvathy-thiruvothu-criticises-kerala-cm-pinarayi-vijayan-over-hema-committee-inaction-wcc-member-bina-paul-agrees-2735138-2025-06-03",
      "headline": "Actor Parvathy slams Kerala government's inaction on Hema Committee's findingsActor Parvathy Thiruvothu criticised the Kerala government's delay in acting on the Hema Committee report, which was submitted over five years ago. She called out the lack of urgency, and pushed for overdue reforms in the Malayalam film industry. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/maalik-teaser-rajkummar-rao-as-gangster-unleashes-wrath-violent-thriller-2735022-2025-06-03",
      "headline": "Maalik teaser: Rajkummar Rao unleashes wrath on adversaries in violent thrillerThe teaser of Rajkummar Rao starrer 'Maalik' is out. The film debuts the actor in a dark, ruthless gangster avatar in the teaser. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-shares-wedding-pics-on-52nd-anniversary-expresses-gratitude-to-fans-2735090-2025-06-03",
      "headline": "Big B shares wedding pics on 52nd anniversary, expresses gratitude to fansAmitabh Bachchan shared unseen pictures from his wedding on his 52nd anniversary. The actor even posted a note and expressed his gratitude to fans. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pankaj-tripathi-denies-kamal-haasan-collaboration-language-concerns-2734970-2025-06-03",
      "headline": "Pankaj Tripathi denies being part of Kamal Haasan's Thug LifeActor Pankaj Tripathi has dismissed rumours of working with Kamal Haasan in 'Thug Life'. He stresses his preference for Hindi-speaking roles citing difficulty with other languages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-close-to-taare-zameen-par-son-junaid-struggle-with-dyslexia-2734960-2025-06-03",
      "headline": "Aamir Khan on why Taare Zameen Par was personal: Junaid is dyslexicAamir Khan recently recalled his son Junaid's struggle with dyslexia. The actor spoke about how the story of 'Taare Zameen Par' (2007) resonated with him because of personal experiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diljit-dosanjh-exit-no-entry-2-scheduling-issues-anees-bazmee-2734942-2025-06-03",
      "headline": "Anees Bazmee reacts to Diljit Dosanjh's exit from No Entry 2Anees Bazmee clarified that Diljit Dosanjh's exit from 'No Entry 2' was due to scheduling conflicts. The director remained hopeful the issue would be resolved and filming would begin soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-with-malti-marie-and-nick-jonas-2734974-2025-06-03",
      "headline": "Priyanka Chopra shares adorable family moments with Malti and Nick Jonas. See picsPriyanka Chopra shared heartwarming family moments with Nick Jonas and their daughter Malti Marie on Instagram. The adorable photos gave fans a peek into their quality time together during her break from work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rana-naidu-trailer-rana-daggubati-arjun-rampal-lock-horns-in-crime-action-thriller-2734944-2025-06-03",
      "headline": "Rana Naidu trailer: Rana Daggubati-Arjun Rampal lock horns in crime action-thrillerThe trailer of 'Rana Naidu' unveiled on June 3, brings back the world of crime, deceit, rivalry and human complexities. Arjun Rampal joins the sequel as Rana Daggubati's arch rival in the high-octane action-thriller series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ankita-lokhande-remembers-sushant-singh-rajput-16-years-of-pavitra-rishta-2734930-2025-06-03",
      "headline": "Ankita Lokhande recalls moments with Sushant Singh RajputAnkita Lokhande celebrated 16 years of 'Pavitra Rishta' with a special vlog, revisiting memories and honouring her late co-actor Sushant Singh Rajput. She shared how Sushant supported and taught her acting during their early days on the show."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/raghuram-rajan-on-viksit-bharat-indian-economy-gdp-growth-2735251-2025-06-03",
      "headline": "India needs 8-9% growth to become Viksit Bharat by 2047: Raghuram RajanCan India turn its economic momentum into lasting prosperity? As global risks loom and GDP rankings rise, Raghuram Rajan lays out what it will really take to become a developed nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-signs-order-imposing-50-tariffs-for-steel-and-aluminum-spares-uk-glbs-2735347-2025-06-04",
      "headline": "Trump signs order hiking US steel, aluminium tariffs to 50% from today; UK sparedTrump signs executive order doubling tariffs on imported steel and aluminium to 50 per cent, citing national security risks and unfair pricing. The policy, effective June 4, aims to protect domestic industry.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-losses-4-day-conflict-with-india-6-fighter-jets-2-surveillance-planes-30-missiles-2735197-2025-06-03",
      "headline": "6 fighter jets, 2 surveillance planes: Pak's losses in 4-day conflict with IndiaSources told India Today that technical analysis of operational data confirms that six fighter aircraft belonging to the Pakistan Air Force were shot down during the air battles."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/three-indians-who-went-missing-in-iran-rescued-by-tehran-police-government-sources-2735292-2025-06-03",
      "headline": "3 Indians missing in Iran rescued by cops in TehranThree Indians who were travelling to Iran and went missing last month have been rescued by Tehran police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/no-thug-life-for-karnataka-as-no-malice-no-sorry-remains-kamal-haasan-stand-2735167-2025-06-03",
      "headline": "No 'Thug Life' for Karnataka as no malice, no sorry, remains Kamal Haasan's standWhat did Kamal Haasan say? That Kannada language came out of Tamil. Why did he say so? Because he wanted to convey to Kannada actor Shiva Rajkumar, who was present in the audience, that Kannada and Tamil came from the same family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/kcr-daughters-letter-bomb-fuels-brs-flux-will-party-fade-into-bjp-2735092-2025-06-03",
      "headline": "KCR daughter's letter bomb fuels BRS flux: Will party fade into BJP?The BJP won't inherit any baggage associated with KCR's family rule. What it wants are BRS MLAs and grassroots leaders who can deliver votes and influence\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/i-just-cant-stand-it-anymore-elon-musk-explodes-over-trumps-budget-bill-glbs-2735324-2025-06-04",
      "headline": "I just can't stand it anymore: Musk explodes over Trump's big, beautiful billElon Musk slammed Trump's massive tax-and-spending bill as a \"disgusting abomination,\" warning it will spike the deficit to $2.5 trillion and burden Americans with crushing, unsustainable debt."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-jibe-india-pakistan-ceasefire-bjp-rss-pm-modi-surrendered-trump-call-2735175-2025-06-03",
      "headline": "Trump said Narender surrender, says Rahul Gandhi, gets branded Pak agent by BJPRahul Gandhi accused the BJP and RSS of bowing under pressure and contrasted their response with Congress leaders of the past. Reacting to his remarks, the BJP called him uncivilised and said Indians look at him as \"an agent of Pakistan\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/why-sydney-sweeneys-viral-soap-has-the-internet-gagged-and-curious-2735005-2025-06-03",
      "headline": "Why Sydney Sweeney's viral soap has the Internet gagged (and curious)Sydney Sweeney's latest soap bar, in collaboration with a men's skincare brand, has created a buzz. Not just because it is Sweeney endorsing it, but because it allegedly has her used bathwater infused in it. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/whos-in-charge-democracy-or-generals-uk-mp-calls-pakistan-a-failed-state-glbs-2735357-2025-06-04",
      "headline": "Who's in charge, democracy or generals? UK MP calls Pakistan a failed stateUK MP Bob Blackman called Pakistan a \"failed state\" and questioned whether it's ruled by democracy or the military. He accused Pakistan of backing terrorism against India and misusing foreign aid. Blackman voiced strong UK support for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/karnataka-high-court-judge-acted-as-kannadiga-tamil-nadu-mla-backs-kamal-haasan-2735293-2025-06-04",
      "headline": "Karnataka High Court judge acted as Kannadiga: Tamil Nadu MLA backs Kamal HaasanAmid the ongoing controversy over Kamal Haasan's remarks, which led to demands for a ban on his upcoming film 'Thug Life' in Karnataka, a Tamil Nadu MLA has expressed his support for the actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-to-lead-unsc-taliban-sanctions-committee-glbs-2735342-2025-06-04",
      "headline": "Pakistan to lead UNSC Taliban sanctions committeePakistan will chair the 1988 Taliban Sanctions Committee for 2025, while also holding key roles in other UN Security Council bodies during its 2025–26 non-permanent membership term.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/who-is-sana-yousaf-pakistan-teen-influencer-17-shot-dead-islamabad-honour-killing-2735135-2025-06-03",
      "headline": "Who is Sana Yousaf? The 17-year-old Pakistani influencer shot dead in IslamabadPakistani influencer Sana Yousaf, 17, was shot dead at her Islamabad home on Monday evening. Read on to know more about her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/retail-gets-personal-how-brands-are-fast-learning-what-you-want-2735043-2025-06-03",
      "headline": "Retail gets personal: How brands are fast learning what you wantAn abundance of choice has brought personalisation into vogue. The consumer's journey may start digitally but end at an offline store\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-gold-card-to-be-a-game-changer-for-indian-investors-us-commerce-secretary-glbs-2735333-2025-06-04",
      "headline": "Trump Gold Card to be a game-changer for Indian investors: US Commerce SecretaryUS Commerce Secretary Howard Lutnick says the USD 5 million Trump Gold Card residency program will thrive in India, offering wealthy Indians a Green Card-like opportunity to invest and live in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/rich-thief-owning-flat-bungalow-bought-money-stolen-arrested-mumbai-2735240-2025-06-03",
      "headline": "Flat in Mumbai, bungalow in Bihar: Cross-dressing thief who amassed wealth caughtThe accused had been committing thefts in posh areas of Mumbai and was able to evade the police and the CCTV cameras installed in the vicinity by disguising himself as a woman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/the-brahmaputra-myth-majesty-and-politics-of-water-2735064-2025-06-03",
      "headline": "The Brahmaputra: Myth, majesty and politics of waterAssam Chief Minister Himanta Biswa Sarma believes a reduction in the Brahmaputra's water by China could actually help the state control its recurring, destructive floods. But the Brahmaputra is a complicated river, difficult even for the Himalayas to tame. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/exclusive-indian-astronaut-shubhanshu-shukla-speak-to-pm-modi-2735211-2025-06-03",
      "headline": "Will Shubhanshu Shukla speak to PM Modi from space?  Indian astronaut answersIndian Astronaut Shubhanshu Shukla, set to launch on June 10, will become only the second Indian to travel to space after Rakesh Sharma and the first to visit the ISS. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/south-koreas-new-president-lee-jae-myung-vows-end-to-martial-law-turmoil-glbs-2735350-2025-06-04",
      "headline": "South Korea's new president Lee Jae-myung vows end to martial law turmoilSouth Korea's new president, Lee Jae-myung, took office amid political unrest and economic slowdown after the failed martial law attempt by former leader Yoon Suk Yeol. Lee won with 49.42% votes, pledging to restore unity, boost the economy, and prioritise crucial trade talks with the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/launch-of-indian-astronaut-shubhanshu-shukla-to-space-station-delayed-to-june-10-2735198-2025-06-03",
      "headline": "Indian astronaut Shubhanshu Shukla's launch to Space Station postponedThe mission, part of Axiom Space's Ax-4 programme, was originally slated for May 29 and then rescheduled to June 8, but operational adjustments and ongoing quarantine protocols have now pushed the launch to June 10."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/video-thar-driver-rams-man-in-noida-after-fight-throws-him-into-drain-2734951-2025-06-03",
      "headline": "Video: Thar rams man in Noida after fight, throws him into drainA man was grievously injured after being hit by a Thar vehicle in Uttar Pradesh's Noida. The incident reportedly followed a prior fight, after which the accused allegedly attempted to run the victim over with the vehicle.\r\n\r\nThe victim was thrown off the road and fell into a nearby drain. A video capturing the incident has gone viral on social media, prompting police to take immediate notice.\r\n\r\nAuthorities have registered a case and formed a special team to apprehend the accused. Investigation is currently underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/build-air-india-kanishka-victims-memorial-gurdwara-hindu-group-urge-canada-govt-1985-air-bombing-anniversary-2735140-2025-06-03",
      "headline": "Build memorial for Kanishka victims, gurdwara, Hindu group urge Canada govtTwo Indo-Canadian groups have urged the government of Canada to build a memorial to the 1985 Air India bombing victims in the province of British Colombia. The demand comes ahead of the 40th anniversary of the terror attack by Khalistanis, which remains the worst attack in Canadian history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-opening-ceremony-shankar-mahadevan-songs-patriotism-india-win-operation-sindoor-pakistan-2735184-2025-06-03",
      "headline": "Spirit of India the real winner as war-paused IPL enters Final battleThe mini-war between India and Pakistan saw the popular IPL cricket tournament being halted for eight days. Ahead of the RCB vs PBKS IPL Final on Tuesday, a tribute to the armed forces, a string of deshbhakti songs and fluttering Indian flags made the spirit of India the real winner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/wont-release-thug-life-in-karnataka-for-now-kamal-haasan-to-court-after-being-rapped-over-kannada-remark-2734999-2025-06-03",
      "headline": "Kamal Haasan refuses to apologise, says won't release film in Karnataka for nowActor Kamal Haasan's counsel told the Karnataka High Court that Thug Life will not be released in the state for now, after the court questioned his lack of apology over remarks on Kannada's origins."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-pbks-virat-kohli-compares-ipl-2025-win-with-test-cricket-2735362-2025-06-04",
      "headline": "IPL win among my best, but five rungs below Test cricket: Virat KohliIndia and Royal Challengers Bengaluru (RCB) star Virat Kohli compared his historic Indian Premier League 2025 (IPL 2025) triumph with Test cricket and ranked it five levels below the longest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-18-year-wait-worth-virat-kohli-victory-speech-2735358-2025-06-04",
      "headline": "Virat Kohli's stirring IPL victory speech was worth the 18-year waitAfter 18 long years, RCB finally lifted their maiden IPL trophy on Tuesday. Virat Kohli's stirring, emotional victory speech made the wait feel profoundly worth it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-virat-kohli-rajat-patidar-ahmedabad-2735337-2025-06-04",
      "headline": "Virat Kohli's message to RCB captain Rajat Patidar: IPL win is as big for othersVirat Kohli had a special message for Rajat Patidar and the RCB squad as they ended their IPL jinx and won the title on Tuesday, June 3. Kohli and Patidar were able to mastermind RCB's first title win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bengaluru-celebrations-rcb-lifts-title-ee-sala-cup-namde-fireworks-red-2735339-2025-06-04",
      "headline": "Ee Sala Cup Namdu: Bengaluru celebrates like never before after RCB wins IPL 2025The moment RCB sealed their maiden IPL title, Bengaluru celebrated like never before. Fans flooded the streets in every direction, lit fireworks, and filled the night with chants of 'Ee Sala Cup Namdu!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-bengaluru-victory-parade-celebrations-virat-kohli-date-2735336-2025-06-04",
      "headline": "Virat Kohli promises special RCB victory parade in Bengaluru on June 4IPL 2025 final: Virat Kohli said RCB players and members of the support staff will celebrate the Indian Premier League victory with fans in Bengaluru on Wednesday evening. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-carlos-alcaraz-beats-tommy-paul-reach-semifinal-2735335-2025-06-04",
      "headline": "Merciless Carlos Alcaraz makes easy work of Tommy Paul to reach semisCarlos Alcaraz showed no mercy on Tuesday evening as he produced a clinical, commanding performance to dismantle American Tommy Paul 6-0, 6-1, 6-4 and reach the semi-finals of the French Open.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-odi-series-sweep-west-indies-jamie-smith-maiden-fifty-oval-2735332-2025-06-04",
      "headline": "England crush West Indies to complete 3-0 ODI series win England completed a 3-0 sweep of West Indies in their one-day international series with opener Jamie Smith's rapid half-century paving the way for a convincing seven-wicket victory at the Oval on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/krunal-pandya-reaction-rcb-ipl-2025-title-win-two-man-of-the-match-2735325-2025-06-04",
      "headline": "Told Hardik that Pandya household would have 9 trophies: KrunalAfter becoming the first player to win two Player of the Match awards in IPL finals, RCB star Krunal Pandya revealed that he had told his brother Hardik that the Pandya household would boast nine trophies in 11 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-virat-kohli-rajat-patidar-ahmedabad-2735328-2025-06-04",
      "headline": "Virat Kohli deserved IPL trophy more than anyone else: RCB captain Rajat PatidarRajat Patidar said that Virat Kohli deserved to win the IPL trophy as RCB defeated PBKS to end their 18-year wait. Patidar said it was a great opportunity for him to captain Kohli and learn as a captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-reaction-punjab-kings-lose-final-rcb-win-ipl-2025-2735321-2025-06-04",
      "headline": "Shreyas Iyer dejected after final heartbreak vs RCB, vows to win IPL next yearPunjab Kings captain Shreyas Iyer was dejected after the narrow final defeat to RCB but said the job was only half done, adding that he and his team would come back stronger in pursuit of the title next year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-full-list-of-award-winners-ahmedabad-2735322-2025-06-04",
      "headline": "IPL 2025: Full list of award winners for the seasonThe IPL 2025 season has come to an end with RCB winning their first title with a final win over PBKS on Tuesday, June 3. Here's a look at all the award winners from the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-odi-series-sweep-west-indies-jamie-smith-maiden-fifty-oval-2735332-2025-06-04",
      "headline": "England crush West Indies to complete 3-0 ODI series win England completed a 3-0 sweep of West Indies in their one-day international series with opener Jamie Smith's rapid half-century paving the way for a convincing seven-wicket victory at the Oval on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/krunal-pandya-reaction-rcb-ipl-2025-title-win-two-man-of-the-match-2735325-2025-06-04",
      "headline": "Told Hardik that Pandya household would have 9 trophies: KrunalAfter becoming the first player to win two Player of the Match awards in IPL finals, RCB star Krunal Pandya revealed that he had told his brother Hardik that the Pandya household would boast nine trophies in 11 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-virat-kohli-rajat-patidar-ahmedabad-2735328-2025-06-04",
      "headline": "Virat Kohli deserved IPL trophy more than anyone else: RCB captain Rajat PatidarRajat Patidar said that Virat Kohli deserved to win the IPL trophy as RCB defeated PBKS to end their 18-year wait. Patidar said it was a great opportunity for him to captain Kohli and learn as a captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-reaction-punjab-kings-lose-final-rcb-win-ipl-2025-2735321-2025-06-04",
      "headline": "Shreyas Iyer dejected after final heartbreak vs RCB, vows to win IPL next yearPunjab Kings captain Shreyas Iyer was dejected after the narrow final defeat to RCB but said the job was only half done, adding that he and his team would come back stronger in pursuit of the title next year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-full-list-of-award-winners-ahmedabad-2735322-2025-06-04",
      "headline": "IPL 2025: Full list of award winners for the seasonThe IPL 2025 season has come to an end with RCB winning their first title with a final win over PBKS on Tuesday, June 3. Here's a look at all the award winners from the 2025 season. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}