{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sell-india-buy-china-why-foreign-investors-are-shifting-bets-2685237-2025-02-25",
      "headline": "Sell India, Buy China: Why FIIs are falling out of love with Dalal StreetDalal Street has witnessed correction over the past six months, with the Nifty50 plummeting from 25,200 levels to around 22,500 levels by the end of February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bets-big-on-assam-to-invest-rs-50000-crore-in-next-5-years-summit-pm-modi-2685213-2025-02-25",
      "headline": "Reliance bets big on Assam, to invest Rs 50,000 crore in next 5 yearsManaging Director Mukesh Ambani announced an investment of Rs 50,000 crore in Assam. A major part of Reliance's investment will be directed towards making Assam a leader in technology and artificial intelligence (AI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hungary-announces-tax-exemption-for-mothers-with-2-or-more-children-2685199-2025-02-25",
      "headline": "Hungary announces tax exemption for mothers with 2 or more children The said announcement comes ahead of the 2026 elections and is a part of Orban's efforts to boost the country's birth rate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/dbs-set-to-cut-4000-jobs-over-3-years-due-to-ai-says-ceo-2685206-2025-02-25",
      "headline": "DBS set to cut 4,000 jobs over 3 years due to AI, says CEODBS CEO Piyush Gupta said the bank will shrink its workforce by 10% in the next three years due to artificial intelligence replacing human roles. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hein-schumacher-to-step-down-as-unilever-ceo-in-march-2685192-2025-02-25",
      "headline": "Hein Schumacher to step down as Unilever CEO in MarchThe departure comes just weeks after Unilever announced underwhelming full-year earnings and chose Amsterdam over London and New York as the primary listing for its ice cream business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-investment-share-price-jumps-10-percent-today-ipo-news-group-company-details-2685184-2025-02-25",
      "headline": "Explained: Why Tata Investment share price jumped 10% todayAt around 12:56 pm, shares of the non-banking financial company were up 7.65% to Rs 6,195.85 on the Bombay Stock Exchange (BSE). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-universal-pension-scheme-here-all-you-need-to-know-2685156-2025-02-25",
      "headline": "What is Universal Pension Scheme? Here's all you need to know With India's senior citizen population aged 60 years and above expected to touch 227 million by 2036, a comprehensive social security or pension scheme is necessary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-commits-to-invest-rs-50000-crore-in-assam-details-here-2685154-2025-02-25",
      "headline": "Adani Group commits to invest Rs 50,000 crore in Assam. Details hereThe investment will focus on infrastructure projects aimed at transforming Assam into a major economic hub. Funds will be allocated to sectors such as airports, aero cities, city gas distribution, transmission networks, cement production, and road projects, with the goal of enhancing connectivity and industrial capacity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-tax-regime-save-more-itr-nps-benefit-key-details-explained-2685103-2025-02-25",
      "headline": "New Tax Regime: Income up to Rs 13.7 lakh can be tax-free. Here's howFollowing the Union Budget 2025, annual income up to Rs 12 lakh became tax-free. But there's a way to push it even further to Rs 13.7 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-proposes-tighter-rules-for-index-derivatives-heres-what-it-means-2685106-2025-02-25",
      "headline": "Sebi proposes tighter rules for index derivatives. Here's what it meansIn a consultation paper released late Monday, Sebi said it wants to link stock derivative position limits to the cash market. The idea is to cap the market-wide position limit at the lower of 15% of a stock's free-float market cap or 60 times its average daily delivery value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-holiday-open-or-close-on-maha-shivratri-2025-dalal-street-trading-sensex-nifty-nse-bse-2685083-2025-02-25",
      "headline": "Dalal Street holiday: Is the stock market open or close on Maha Shivratri 2025?Stock markets usually operate from Monday to Friday, except on declared holidays. They remain closed on Saturdays and Sundays."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tata-capital-clears-ipo-plan-to-issue-230-million-new-shares-2685061-2025-02-25",
      "headline": "Tata Capital IPO to soon make Dalal Street debut as board clears listing plansTata Capital will be the first company from the Tata Group to launch an IPO since Tata Technologies went public in November 2023."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/parineeti-chopra-gears-up-for-her-first-netflix-yet-to-be-titled-thriller-series-2685151-2025-02-25",
      "headline": "Parineeti Chopra gears up for her first Netflix yet-to-be-titled thriller seriesActor Parineeti Chopra is set to make her series OTT debut with a Netflix project. The actor shared a post and informed about sharing screen space with Nimrit Kaur, Soni Razdan, and others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tanmay-bhat-x-account-hacked-comedian-warns-followers-2685118-2025-02-25",
      "headline": "Tanmay Bhat's X account hacked, comedian warns followersTanmay Bhat's X account recently got hacked, leading to fraudulent messages being posted online. The comedian shared a post on his Instagram and warned his followers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-vrishank-khanal-haldi-pics-pre-wedding-festivties-wedding-karjat-2685070-2025-02-25",
      "headline": "Prajakta Koli-Vrishank Khanal can't take their eyes off each other in haldi picsActor Prajakta Koli is set to marry longtime boyfriend Vrishank Khanan on February 25. Ahead of the grand day, the actor shared pictures from her haldi function. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/anupam-mittal-on-india-got-latent-backlash-not-lost-episode-of-satyamev-jayate-2685071-2025-02-25",
      "headline": "Anupam Mittal on India's Got Latent backlash: Not a lost episode of Satyamev JayateAnupam Mittal weighs in on the India's Got Latent row, arguing that YouTube should also be held accountable. He calls Big Tech the real culprit, criticising digital platforms for fueling outrage-driven content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bobby-deol-says-aashram-helped-him-break-industry-image-explore-new-roles-2685062-2025-02-25",
      "headline": "Bobby Deol says Aashram helped him break industry image, explore new rolesActor Bobby Deol is all set to return as Baba Nirala in Prakash Jha's series, Aashram 3 part 2. The actor confessed that he wanted to step out of his comfort zone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-waking-of-a-nation-trailer-taaruk-raina-fights-to-prove-jallianwala-act-was-planned-2684901-2025-02-24",
      "headline": "Waking of Nation trailer: Taaruk Raina fights to prove Jallianwala Bagh was plannedA new show that explores the events surrounding the Jallianwala Bagh massacre is set to premiere on Sony LIV on March 8. Starring Taaruk Raina in the lead role, the series is titled The Waking of a Nation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-responds-to-rumours-of-drug-use-2684862-2025-02-24",
      "headline": "Singer Justin Bieber responds to rumours of drug useJustin Bieber's representative has reacted to the reports of the singer's drug use and called them false. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/ranveer-allahbadia-runs-to-car-after-recording-statement-in-latent-probe-2684803-2025-02-24",
      "headline": "Ranveer Allahbadia runs to car after recording statement in Latent probeRanveer Allahbadia was clicked in a hurried state, running towards his car as the paparazzi tried to capture his pictures on Monday. The YouTuber visited the Maharashtra Cyber office in Mahape after recording his statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kaushaljis-vs-kaushal-review-a-simple-yet-complex-tale-of-second-chance-in-love-2684706-2025-02-24",
      "headline": "Kaushaljis vs Kaushal review: A simple yet complex tale of second chance in loveReleased-Fri Feb 21, 2025Kaushaljis vs Kaushal movie review: This film is a heartfelt exploration of second chances in love, focusing on a middle-aged couple navigating the complexities of separation and familial expectations. Set in the relatable backdrop of Kannauj, the film captivates with its simplicity and stellar performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dupahiya-trailer-a-wedding-a-missing-bike-and-a-lot-of-chaos-in-offing-2684642-2025-02-24",
      "headline": "Dupahiya trailer: A wedding, a missing bike and a lot of chaos in offingThe first full trailer of Prime Video's upcoming comedy series, Dupahiya, is here. The show will feature actors such as Sparsh Shrivastava and Gajraj Rao in pivotal roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-dances-to-zingaat-with-fiance-at-mehndi-ceremony-watch-2684622-2025-02-24",
      "headline": "Bride-to-Be Prajakta Koli dances to Zingaat with fiance at mehndi ceremony. WatchPrajakta Koli shared glimpses of her mehndi ceremony as she danced joyfully with fiance Vrishank Khanal. The couple is set to marry on February 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zero-day-netflix-review-robert-de-niro-angela-bassett-jesse-plemons-political-drama-2684414-2025-02-24",
      "headline": "Zero Day review: Star power can't save this weakly executed political dramaReleased-Thu Feb 20, 2025Zero Day, directed by Lesli Linka Glatter, is a political drama featuring a stellar cast including Robert De Niro and Angela Bassett. While the performances are strong, the series struggles with plot depth and resolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/watch-jennie-and-doechii-bring-the-heat-with-extral-ahead-of-ruby-2684489-2025-02-24",
      "headline": "Watch: Jennie and Doechii bring the heat with ExtraL ahead of RubyJennie and Doechii are making waves with their latest collaboration, ExtraL. As Jennie gears up for her solo debut with the album Ruby, fans can expect a bold new chapter in her musical journey."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/munawar-faruqui-insulting-religion-jiohotstar-show-hafta-vasooli-complaint-2684460-2025-02-24",
      "headline": "Complaint against Munawar Faruqui for 'insulting religion' on Hafta Vasooli showComedian Munawar Faruqui landed in legal trouble after a complaint was filed against him for hurting religious sentiments through his show, Hafta Vasooli. The advocate shared a copy of the complaint on X. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mismatched-actor-prajakta-koli-shares-dreamy-pics-from-her-mehndi-ceremony-2684350-2025-02-23",
      "headline": "'Mismatched' actor Prajakta Koli shares dreamy pics from her mehndiContent creator and actor Prajakta Koli has started her pre-wedding celebrations with a vibrant mehndi ceremony. She shared joyful moments with her fiance Vrishank Khanal and family on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singhs-millionaire-concert-in-mumbai-comeback-stage-aajtak-2684255-2025-02-23",
      "headline": "Honey Singh's Millionaire concert in Mumbai showed what grand comebacks look likeYo Yo Honey Singh made a powerful return to the stage in Mumbai, captivating fans with his energy and heartfelt messages. His performance was a testament to his resilience and dedication to the art."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-indias-got-latent-controversy-tanmay-bhat-joke-unfiltered-tour-2684268-2025-02-23",
      "headline": "Samay Raina recalls what he asked Tanmay Bhat after India's Got Latent controversyComedian Samay Raina addresses the controversy surrounding YouTuber Ranveer Allahbadia's inappropriate remark on his show, India's Got Latent, during his tour in Canada. He recalled what he had asked Tanmay Bhat after the controversy erupted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-dig-badshah-raftaar-millionaire-india-tour-stage-aajtak-video-2684165-2025-02-23",
      "headline": "Honey Singh's jibe at Raftaar, Badshah: People say they'll write my destinyHoney Singh took a direct dig at fellow artists Badshah and Raftaar at the first Millionaire India Tour stop in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-take-on-diljit-dosanjh-punjabi-aa-gaya-oye-millionaire-tour-mumbai-stage-aajtak-2684161-2025-02-23",
      "headline": "Watch: Honey Singh's take on Diljit Dosanjh's 'Punjabi Aa Gaya Oye'Honey Singh launched his Millionaire India Tour in Mumbai, delivering a captivating performance that engaged a sold-out audience. He shared his take on Diljit Dosanjh's 'Punjabi aa gays oye', emphasising unity among diverse Indian communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/watch-honey-singh-kicks-off-millionaire-tour-with-a-grand-mumbai-show-2684048-2025-02-22",
      "headline": "Watch: Honey Singh kicks off Millionaire tour with a grand Mumbai showRapper Honey Singh launched his Millionaire Tour with a spectacular concert in Mumbai. The show featured dramatic entrances and a lineup of energetic performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/undercover-high-school-x-review-fans-give-thumbs-up-to-seo-kang-joons-k-drama-2683974-2025-02-22",
      "headline": "Undercover High School X review: Fans give thumbs up to Seo Kang-joon's K-dramaUndercover High School, featuring Seo Kang-joon and Jin Ki-joo, has premiered on MBC TV. The series, praised for its engaging storyline, follows an undercover NIS agent as a high school student."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-sean-diddy-combs-attorney-withdraws-from-case-says-under-no-circumstances-can-i-continue-2683745-2025-02-22",
      "headline": "Rapper Diddy's attorney withdraws from case: Under no circumstances can I continueAnthony Ricco, representing Sean 'Diddy' Combs, has filed to withdraw from the federal case citing reasons protected by attorney-client privilege. Ricco had once defended Osama bin Laden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/buried-hearts-review-park-hyung-sik-huh-joon-ho-jiohotstar-2683665-2025-02-21",
      "headline": "Buried Hearts review: Park Hyung-sik commands attention in his darkest roleReleased-Sat Feb 22, 2025The Korean drama Buried Hearts will captivate viewers with its blend of intense emotions and high-stakes drama. The series, featuring Park Hyung-sik, explores the complex dynamics of corporate intrigue and personal survival. Read the full review."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rakhi-sawant-reacts-to-summons-i-am-poor-not-criminal-focus-on-rape-cases-indias-got-latent-row-2683583-2025-02-21",
      "headline": "Rakhi Sawant reacts to summons: I'm poor, not criminal - focus on rape casesRakhi Sawant was summoned by the Maharashtra cyber cell to record her statement regarding YouTuber Ranveer Allahbadia's controversial remarks on Samay Raina's show, 'India's Got Latent'. She urged the police to focus on solving pending rape cases instead of treating her like a criminal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zero-day-critics-praise-robert-de-niro-criticise-show-incoherent-politics-netflix-2683507-2025-02-21",
      "headline": "Zero Day: Critics praise Robert De Niro, criticise show's 'incoherent politics'Critics have mixed reactions to Robert De Niro's latest Netflix series, Zero Day. While many have praised De Niro, a section of them are unhappy with the narrative of the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/onerepublic-grammy-nominated-band-collaborates-with-karan-aujla-for-new-song-tell-me-2683449-2025-02-21",
      "headline": "Grammy-nominated band OneRepublic unites with Karan Aujla for new song Tell MeGlobal pop-rock sensation OneRepublic is collaborating with Punjabi artist Karan Aujla for a new track titled Tell Me. It will release on February 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-marry-boyfriend-fiance-vrishank-khanal-february-25-karjat-2683433-2025-02-21",
      "headline": "Mismatched actor Prajakta Koli to marry boyfriend on February 25: ReportActor Prajakta Koli is set to marry her boyfriend Vrishank Khanal on February 25. Their wedding festivities will begin on February 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/crime-beat-review-saqib-saleem-rahul-bhat-sai-tamhankar-fail-to-impress-2683407-2025-02-21",
      "headline": "Crime Beat review: Rahul Bhat, Saqib Saleem's crime drama gets lost in its own chaosReleased-Fri Feb 21, 2025'Crime Beat', a political thriller, premiered on Zee5 on February 21. Based on the book titled 'The Price You Pay', the show falls short due to outdated tropes and exaggerated clichés. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yo-yo-honey-singh-a-great-cook-reveals-his-favourite-dish-aaj-tak-millionaire-tour-2683425-2025-02-21",
      "headline": "Honey Singh says he's a great cook, reveals his favourite dishRapper and music producer Yo Yo Honey Singh opens up about his favourite cuisine, his cooking skills and more in an exclusive interaction with us. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/park-bo-young-versatility-melo-movie-strong-girl-bong-soon-k-drama-2683400-2025-02-21",
      "headline": "From heartfelt to hilarious, in praise of Park Bo-young's versatilityKorean star Park Bo-young has been acting for almost two decades now. Her ability to completely inhabit the skin of her characters makes her truly stand out. She is currently seen in Melo Movie, which is streaming on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-on-his-mumbai-concert-doing-something-ive-never-done-before-2683388-2025-02-21",
      "headline": "Honey Singh on his Mumbai concert: Doing something I've never done beforeRapper Honey Singh is starting his countrywide tour from Mumbai on Saturday. In an exclusive interview with us, the singer talked about the gig and what he's doing differently this time at 'Millionaire India Tour at Stage Aajtak'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kangana-ranaut-announces-emergency-ott-release-when-and-where-to-watch-2683366-2025-02-21",
      "headline": "Kangana Ranaut's Emergency to premiere on Netflix. Check release dateKangana Ranaut's film, Emergency, is going to hit the screens next month. The actor shared a quick announcement in her Instagram stories on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/robin-tunney-10-years-the-mentalist-finale-simon-baker-2683326-2025-02-21",
      "headline": "Robin Tunney marks 10 years since The Mentalist finale, thanks fan for their loveActor Robin Tunney celebrated the 10th anniversary of The Mentalist finale, expressing gratitude to fans for their unwavering support. She also reflected on the show's impact on her life and career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/atif-aslam-surprise-street-performance-london-leaves-fans-in-disbelief-2683349-2025-02-21",
      "headline": "Atif Aslam's surprise street performance in London leaves fans in disbelief. WatchSinger Atif Aslam's video of him performing on a London street has emerged online. This surprise clip has left many fans in disbelief. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yo-yo-honey-singh-millionaire-tour-what-makes-it-special-2683339-2025-02-21",
      "headline": "Honey Singh Millionaire tour: Reasons why it's unlike any otherYo Yo Honey Singh is set to electrify Mumbai with his high-energy performance as part of the Stage Tak Millionaire tour, promising an unforgettable night of music and nostalgia. Here are a few reasons why one should not miss it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nobody-wants-this-season-2-on-netflix-what-is-leighton-meester-playing-in-husband-adam-brody-show-2683330-2025-02-21",
      "headline": "Nobody Wants This 2: What is Leighton Meester playing in husband Adam Brody's show?Netflix renewed 'Nobody Wants This' for season 2 last year, and now actor Leighton Meester, known for playing Blair Waldorf in 'Gossip Girl', has joined the show. Her husband, actor Adam Brody, plays the lead character, Noah, in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/varun-grover-jibe-at-beerbiceps-ranveer-allahabadia-samay-raina-indias-got-latent-controversy-2683270-2025-02-21",
      "headline": "Comic Varun Grover's sharp take on Ranveer Allahbadia, censorship and BeerBicepsComedian-lyricist Varun Grover recently took a jibe at the recent controversy surrounding podcaster Ranveer Allahbadia's appearance on India's Got Latent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bb-18-alice-kaushik-tajinder-bagga-and-others-reunite-at-arfeen-saras-goa-bash-2683249-2025-02-21",
      "headline": "BB 18's Alice Kaushik, Tajinder Bagga, others reunite at Arfeen-Sara's Goa bashBigg Boss 18 contestants, including Alice Kaushik, Tajinder Bagga, and Nyrraa Banerjii reunited to celebrate Sara and Arfeen Khan's anniversary in Goa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dhanashree-verma-shares-cryptic-post-amid-divorce-rumours-with-yuzvendra-chahal-stressed-to-blessed-2683241-2025-02-21",
      "headline": "Dhanashree Verma's cryptic post amid divorce rumours: From stressed to blessedDhanashree Verma recently shared a cryptic message on social media, suggesting a shift from 'stressed to blessed'. This comes amid swirling rumours of a possible divorce with cricketer Yuzvendra Chahal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/popular-tv-actor-dipika-kakar-ibrahim-has-quit-celebrity-masterchef-india-2683158-2025-02-20",
      "headline": "TV actor Dipika Kakar Ibrahim quits Celebrity MasterChef amid health concernsPopular TV actor Dipika Kakar Ibrahim has withdrawn from Celebrity MasterChef due to health issues. Despite the show's support, she prioritised her well-being over the competition."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/ex-congress-mp-sajjan-kumar-sentenced-to-life-imprisonment-in-1984-anti-sikh-riots-case-2685210-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sajjan Kumar, ex-Congress MP, sentenced to life in jail in anti-Sikh riots caseFormer Congress MP Sajjan Kumar gets a second life sentence for his involvement in the killing of two Sikhs in the 1984 riots. He is already serving life for the Delhi Cantonment case.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cag-audit-report-aap-delhi-liquor-policy-led-to-rs-2000-crore-revenue-loss-assembly-session-atishi-arvind-kejriwal-lg-vk-saxena-2685169-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AAP's Delhi liquor policy led to Rs 2,002 crore revenue loss: CAG reportThe Comptroller and Auditor General of India report on the now-scrapped Delhi liquor policy scam was tabled in the Assembly today by Chief Minister Rekha Gupta."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/preity-zinta-statement-after-new-india-cooperative-bank-writes-off-18-crore-loan-2685099-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Preity Zinta vs Kerala Congress: Full-blown fight over bank's Rs 18 crore loanPreity Zinita called reports of New India Cooperative Bank writing off her Rs 18-crore loan false. She blasted Congress for promoting fake news by linking her with Bharatiya Janata Party (BJP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-assembly-session-atishi-aap-mlas-suspended-marshalled-out-uproar-cag-report-rekha-gupta-bjp-2685095-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Atishi, 20 AAP MLAs suspended after chaos over CAG report in Delhi Assembly  Live UpdatesAs the Delhi Assembly session commenced for the day, Lt Governor VK Saxena's address to the House was disrupted by AAP legislators as they resorted to loud sloganeering against the BJP government. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-congress-politics-space-kerala-state-assembly-election-rahul-gandhi-leadership-2685179-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress has no heart or house for Mr TharoorDespite his intellect, eloquence, and four consecutive wins from Thiruvananthapuram, Congress MP Shashi Tharoor remains an outsider in his own party. The Congress has no heart or house for Tharoor as it finds him too independent for national politics and too unconventional for Kerala's faction-ridden political affairs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/united-states-donald-trump-un-resolution-russia-ukraine-war-europe-votes-2684995-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US sides with Russia at UN on Ukraine vote in stunning move, India abstainsThe United Nations General Assembly on Monday adopted two resolutions on Russia's war in Ukraine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-congress-rift-praises-government-selfie-piyush-goyal-buzz-2685174-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shashi Tharoor's praise for Centre, selfie with Piyush Goyal amid rift buzzThe latest development has once again brought to focus Shashi Tharoor's souring of ties with the Congress and fuelled a buzz over his future with the party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-vs-sachin-tendulkar-odi-runs-ricky-ponting-reaction-2685264-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will Virat Kohli overtake Sachin Tendulkar's ODI runs tally? Ricky Ponting reactsRicky Ponting has said that he will not write off Virat Kohli when it comes to overtaking Sachin Tendulkar's ODI runs tally. Kohli scored his 51st ODI hundred against Pakistan in Dubai on February 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/indias-first-hyperloop-test-track-delhi-to-jaipur-in-30-mins-2685155-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India's first hyperloop test track. Delhi to Jaipur in 30 minutes?Delhi is not far away from Jaipur now. The 422-meter facility at IIT Madras marks a significant milestone in revolutionising transportation between major Indian cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/lpus-2025-batch-final-year-student-bags-rs-103-crore-118000-placement-package-2682322-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LPU's 2025 Batch Final Year Student Bags Rs 1.03 Crore ($1,18,000) Placement Package-Betireddy Naga Vamsi Reddy B. Tech student has secured a 1.03 Crore ($1,18,000) package with an AI robotics company and is set to graduate in May 2025. \r\n\r\n-Over 1,700 students have received packages ranging from Rs 10 LPA – Rs 1 Crore per annum \r\n\r\n-1,912 students received multiple job offers while Adireddy Vasu, secured 7 job offers, setting a rare and impressive record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pakistani-media-black-magic-theory-on-india-win-champions-trophy-viral-video-2685114-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistan media's bizarre claim on India's win is viral: 22 pandits did black magicA video from a Pakistani news channel featuring a panel discussing how their country lost to India due to 'black magic' has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/enduring-daaku-maharaaj-netflix-urvashi-rautela-bobby-deol-2685193-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Enduring Daaku Maharaaj: 2.5 hours of second-hand embarrassmentSouth star Nandamuri Balakrishna might have impressed his fans with Daaku Maharaaj, but is it really worth all the hype? Read on to find out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/makhana-is-a-super-food-but-its-also-super-expensive-heres-why-2684778-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Makhana is a superfood, but it's also super expensive. Here's whyMakhana is a superfood with a super price tag. The real story behind makhana's high cost lies not just in its nutritional value but in the intricate process of harvesting and processing these delicate seeds. As demand continues to rise, understanding the challenges faced by farmers and producers can help them appreciate the true worth of this superfood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-ultimatum-email-war-us-federal-employees-firings-confusion-2685139-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk doubles down on mail to federal staff: Will result in terminationElon Musk issued another ultimatum as the deadline to reply to his proof-of-work email ended on Monday. Several US departments asked their employees not to comply with the email."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/emmanuel-macron-interrupts-donald-trump-fact-checks-ukraine-funding-viral-video-2685030-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Macron intervenes, fact-checks Trump in real time on Ukraine aid: No, we paidAs the US President was answering a question about Europe's funding to Ukraine, Macron grabbed Trump's arm to interrupt him and issued a fact check."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-keeps-employees-loyal-to-their-company-hr-survey-says-2683290-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What keeps employees loyal to their company? HR survey says…Innovation, upskilling and ample career progression are key factors determining how long employees will stick around, indicates a survey by a top staffing firm\r\n "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/indian-fashion-blooms-on-the-white-lotus-season-3-2685125-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian fashion blooms in The White Lotus season 3The White Lotus Season 3 is back with a hearty dose of drool-worthy vacation style inspiration. This season, the fashion factor boasts an Indian touch as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uddhav-sena-attacks-bjp-over-usaid-funds-21-million-used-to-win-2024-polls-2685159-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uddhav Sena attacks BJP over USAID funds: $21 million used to win 2024 pollsShiv Sena (UBT)'s mouthpiece Saamana has accused the BJP of misusing USD 21 million from the United States Agency for International Development (USAID) to manipulate the 2024 Lok Sabha elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/doctors-attacked-at-hassan-medical-college-in-karnataka-students-protest-over-security-2685255-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Drunk men assault doctors at Hassan Medical College in KarnatakaA scuffle broke out at Hassan Medical College in Karnataka, as intoxicated men attacked doctors, triggering panic. PG and MBBS students staged a protest, demanding strict action and better security measures.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/heatwave-alert-mumbai-thane-raigad-ratnagiri-february-temperature-imd-2685090-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Heatwave to scorch Mumbai, Thane, mercury to touch 38 degrees this weekThe India Meteorological Department issued a heatwave alert for Mumbai, Thane and Maharashtra's Konkan belt, with temperatures likely to be in the range of 37 to 38 degrees Celsius in the coming days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/shah-rukh-khan-hugs-aadar-jain-blesses-alekha-at-their-wedding-2685134-2025-02-25#?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Shah Rukh Khan hugs Aadar Jain, blesses Alekha at their weddingShah Rukh Khan attended Aadar Jain and Alekha Advani's wedding in Mumbai, accompanied by Gauri Khan. Dressed in a black suit, SRK posed with the couple and blessed the bride in a candid moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/shows/story/the-buzz-watch-hackers-allegedly-play-ai-video-of-trump-kissing-elon-musks-feet-on-hud-monitors-glbs-2684997-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AI video of Trump kissing Elon Musk's feet played on TVs at US government officeHackers allegedly hijacked HUD building monitors to play an AI-generated video of Trump kissing Musk's feet, mocking their relationship. The incident went viral, sparking online debate and official concern.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/timothee-chalamet-sag-awards-speech-about-aspirations-and-greatness-goes-viral-2685100-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Timothee Chalamet's 'I am in pursuit of greatness' acceptance speech goes viralActor Timothee Chalamet became the youngest person ever to win the Best Actor award at SAG. The 29-year-old owned his win and the stage by delivering a captivating speech about his \"pursuit of greatness\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-endorses-vivek-ramaswamy-for-ohio-governor-amid-rift-reports-good-luck-2685109-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk-Vivek Ramaswamy's X-change over Ohio Governor bid: Let's rollElon Musk endorsed his former DOGE partner Vivek Ramaswamy for the post of Governor of Ohio as he launched his campaign on Monday night."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/is-nanis-hit-3-teaser-hinting-at-the-angry-cop-trope-making-a-violent-comeback-2685242-2025-02-25",
      "headline": "Is Nani's HIT 3 teaser hinting at violent comeback of the 'angry cop' trope?Over the decades, Indian cinema has transformed its portrayal of police officers—from righteous law enforcers to morally complex figures. But with HIT 3 Spirit and Officer on Duty in the mix is raising questions about the comeback of the angry cop trope this time with a more violent edge."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/internet-calls-farah-khan-insensitive-for-mocking-gaurav-khannas-colour-blindness-celebrity-masterchef-2685266-2025-02-25",
      "headline": "Internet calls Farah Khan 'insensitive' for mocking Gaurav Khanna's colour blindnessCelebrity MasterChef judge Farah Khan mocked TV actor Gaurav Khanna's colour blindness on the show. Following the same, the internet is outraged by her comments, criticising the filmmaker and calling her 'insensitive'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-wife-sunita-ahuja-divorce-report-37-years-of-marriage-2685265-2025-02-25",
      "headline": "Govinda-Sunita Ahuja heading for divorce after 37 years: ReportBollywood actor Govinda and his wife Sunita Ahuja may be heading for a divorce after 37 years of marriage, as per reports. While Govinda avoided the question, Sunita did not respond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saqib-saleem-landed-83-by-messaging-kabir-khan-2685227-2025-02-25",
      "headline": "Saqib Saleem landed 83 by messaging Kabir Khan: Everything has been a hustleSaqib Saleem revealed he bagged 83 after cold messaging Kabir Khan. The actor, who has been hustling for roles, said he specifically sought to play Mohinder Amarnath due to his love for cricket"
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/lakshya-sen-age-fraud-karnataka-high-court-plea-rejected-2685229-2025-02-25",
      "headline": "Court rejects Lakshya Sen's plea in birth certificate forgery caseLakshya Sen's legal troubles deepen as the Karnataka High Court dismisses his plea, allowing investigations into alleged birth certificate forgery. The case, which involves his family and coach, raises serious concerns over age fraud in Indian sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pat-cummins-india-advantage-controversy-twitter-2685211-2025-02-25",
      "headline": "Pat Cummins slams Australian paper for fabricating quote on IndiaPat Cummins has called out an Australian newspaper for quoting him incorrectly about India in the Champions Trophy. Cummins hit out at the publication, stating that he never said that India had an unfair advantage in the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-south-africa-live-cricket-score-today-match-updates-rawalpindi-2685195-2025-02-25",
      "headline": "AUS vs SA LIVE: Rain delays toss at RawalpindiAustralia (AUS) vs South Africa (SA) Live Score, Champions Trophy: In what is already hailed to be a mega Champions Trophy clash at Rawalpindi, consistent drizzling has resulted in the toss facing a delay. Australia will take on South Africa in this Group B fixture with both sides, with their eyes set on the semi-final spot after securing big wins in their previous fixtures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-advantage-pat-cummins-honest-take-2685182-2025-02-25",
      "headline": "India getting huge advantage by playing at same venue: Pat CumminsInjured Australia captain Pat Cummins has said that India have a huge advantage in the Champions Trophy. Cummuns said that playing at the same venue throughout the tournament gives India a better chance of success.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-knocked-out-cannot-win-tournaments-parthiv-patel-2685105-2025-02-25",
      "headline": "Outdated Pakistan do not have a team that can win tournamentsPakistan's early Champions Trophy exit, despite hosting the tournament, has raised concerns over their cricketing structure. Parthiv Patel and Dinesh Karthik pointed out flaws in the team's approach, coaching setup, and inability to perform in high-pressure ICC events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-virat-kohli-india-vs-pakistan-immortal-class-century-2685115-2025-02-25",
      "headline": "Clash of Champions: Virat Kohli's immortal class proves critics wrong againVirat Kohli has consistently silenced his doubters, proving his class once again with a match-winning century against Pakistan in the Champions Trophy. His redemption should remind fans to stand by their heroes, especially when they face challenging phases in their careers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rcb-vs-upw-wpl-richa-ghosh-run-out-ms-dhoni-2685098-2025-02-25",
      "headline": "Watch: Richa Ghosh pulls off MS Dhoni-like run-out in RCB vs UPW gameRoyal Challengers Bengaluru wicketkeeper Richa Ghosh affected a MS Dhoni-like last-ball run out in the team's WPL game against UP Warriorz. Richa forced the game into WPL's first ever Super Over with some quick thinking.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ms-dhoni-new-bat-weight-less-ipl-2025-csk-2685077-2025-02-25",
      "headline": "MS Dhoni set to use new bats for IPL 2025, says reportLegendary MS Dhoni might be using new bats for the upcoming edition of the Indian Premier League. A report suggests that Dhoni might reduce the weight of his bat for the 2025 season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-new-zealand-vs-bangladesh-najmul-shanto-batting-feilding-improvement-2685064-2025-02-25",
      "headline": "Shanto urges batting, fielding improvement after Bangladesh's crash outBangladesh captain Najmul Shanto defended his team's bowling efforts in the Champions Trophy despite their early exit but admitted the need for major improvements in batting and fielding. Expressing disappointment, he lamented yet another embarrassing ICC tournament failure for his side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-new-zealand-vs-bangladesh-rachin-ravindra-simple-batting-century-2685053-2025-02-25",
      "headline": "NZ's Rachin Ravindra reveals reason behind 'simple' batting vs BangladeshNew Zealand's Rachin Ravindra credited his ability to adapt to conditions in Rawalpindi for making his century against Bangladesh look effortless. In his comeback match from injury, Ravindra found the perfect balance between timing and aggression against a strong Bangladesh bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-brydon-carse-ruled-out-injury-england-vs-aghanistan-rehand-ahmed-replacement-2685042-2025-02-25",
      "headline": "England's Brydon Carse out of Champions Trophy, Rehan Ahmed to join squadEngland suffered a major blow as Brydon Carse was ruled out of the Champions Trophy due to a toe injury. Rehan Ahmed replaces him, but he won't arrive in time for England's must-win clash against Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rcb-vs-upw-wpl-richa-ghosh-run-out-ms-dhoni-2685098-2025-02-25",
      "headline": "Watch: Richa Ghosh pulls off MS Dhoni-like run-out in RCB vs UPW gameRoyal Challengers Bengaluru wicketkeeper Richa Ghosh affected a MS Dhoni-like last-ball run out in the team's WPL game against UP Warriorz. Richa forced the game into WPL's first ever Super Over with some quick thinking.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ms-dhoni-new-bat-weight-less-ipl-2025-csk-2685077-2025-02-25",
      "headline": "MS Dhoni set to use new bats for IPL 2025, says reportLegendary MS Dhoni might be using new bats for the upcoming edition of the Indian Premier League. A report suggests that Dhoni might reduce the weight of his bat for the 2025 season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-new-zealand-vs-bangladesh-najmul-shanto-batting-feilding-improvement-2685064-2025-02-25",
      "headline": "Shanto urges batting, fielding improvement after Bangladesh's crash outBangladesh captain Najmul Shanto defended his team's bowling efforts in the Champions Trophy despite their early exit but admitted the need for major improvements in batting and fielding. Expressing disappointment, he lamented yet another embarrassing ICC tournament failure for his side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-new-zealand-vs-bangladesh-rachin-ravindra-simple-batting-century-2685053-2025-02-25",
      "headline": "NZ's Rachin Ravindra reveals reason behind 'simple' batting vs BangladeshNew Zealand's Rachin Ravindra credited his ability to adapt to conditions in Rawalpindi for making his century against Bangladesh look effortless. In his comeback match from injury, Ravindra found the perfect balance between timing and aggression against a strong Bangladesh bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-brydon-carse-ruled-out-injury-england-vs-aghanistan-rehand-ahmed-replacement-2685042-2025-02-25",
      "headline": "England's Brydon Carse out of Champions Trophy, Rehan Ahmed to join squadEngland suffered a major blow as Brydon Carse was ruled out of the Champions Trophy due to a toe injury. Rehan Ahmed replaces him, but he won't arrive in time for England's must-win clash against Afghanistan."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}