{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-rate-cuts-rationalisation-simpler-tax-structure-good-simple-tax-cheaper-goods-2772146-2025-08-16",
      "headline": "Real wallet-friendly shake-up: GST 2.0 to feel like 'Good and Simple Tax'The government is set to launch GST 2.0 with major rate cuts, making essentials cheaper and simplifying tax slabs. The overhaul promises lower prices, fewer complications, and a true 'Good and Simple Tax'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/motor-car-insurance-best-tips-policy-comparison-add-ons-first-time-mistake-personal-finance-2771761-2025-08-16",
      "headline": "What nobody tells you about buying motor insuranceWhile car sales are climbing, many buyers remain unaware about the finer points of motor insurance, a gap that can cost them money and create problems when making a claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-proposes-two-gst-rates-of-5-and-18-tobacco-at-40-tax-cuts-for-farm-and-health-sectors-sources-2771789-2025-08-15",
      "headline": "Government proposes 5%, 18% GST slabs; tobacco at 40%, relief for farmers: SourcesThe government has proposed reducing GST to two slabs: 5% and 18% with sin goods at 40%, aiming to cut taxes on essentials like farm products, health items, handicrafts, and insurance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-rating-importance-what-do-they-mean-india-upgrade-pakistan-sp-global-2771729-2025-08-15",
      "headline": "Credit ratings decoded: How a simple upgrade can change a country's fortuneGlobal credit rating agency S&P Global has upgraded India's long-term unsolicited sovereign credit rating to 'BBB' from 'BBB-'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/gst-council-meeting-in-september-12-slam-may-be-dropped-sources-2771695-2025-08-15",
      "headline": "GST council meeting in September, 12% slam may be dropped: SourcesTwo-day GST Council meetings are expected in September to pave the way for reforms. The announcement was made by the Prime Minister from the ramparts of the Red Fort. These reforms are seen as a Diwali gift for the middle class. Key changes include the removal of the 12% GST slab and rate rationalisation for health and life insurance policies. The government aims to reduce the GST on most items currently in the 12% slab to 5%. This move is expected to make essential items such as footwear, bags, clothes, and toothpastes more affordable. The government is addressing concerns about inflation and the rising cost of living. Feedback regarding health insurance, which impacts the common person, has also been considered. The meetings in September are crucial for approving these changes, with implementation anticipated before Diwali. The Finance Ministry and state finance ministers have been involved in the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/removal-of-12-tax-slab-among-key-reforms-to-be-discussed-in-gst-council-meetings-in-september-sources-2771661-2025-08-15",
      "headline": "GST Council may drop 12% slab, more tax reforms in September meeting: SourcesThe meeting comes after Prime Minister Narendra Modi, in his Independence Day speech, announced plans for a major overhaul of the Goods and Services Tax (GST) system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/same-sex-couple-tax-law-biased-uneven-challenge-gits-received-partners-bombay-hc-report-2771623-2025-08-15",
      "headline": "Claiming bias, same-sex couple approaches court over uneven tax: ReportThe petition was admitted by a bench of Justice BP Colabawalla and Justice Firdoush Pooniwalla, which has also issued a notice to the Attorney General as the case raises a constitutional question."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/independence-day-pm-modi-announces-next-generation-gst-reform-with-significantly-lower-rates-2771561-2025-08-15",
      "headline": "PM Modi announces next-generation GST reform with significantly lower ratesDuring his Independence Day address, Prime Minister Narendra Modi announced a sweeping overhaul of the GST system, promising to unveil a \"next-generation\" tax regime with substantially lower rates this Diwali, which he hailed as a festive gift from the Centre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-speech-announces-rs-1-lakh-crore-pradhan-mantri-viksit-bharat-rojgar-yojana-scheme-2771555-2025-08-15",
      "headline": "Rs 15,000 from government on 1st private-sector job: PM's big youth schemePM Modi in his Independence Day speech said that the Pradhan Mantri Viksit Bharat Rojgar Yojana will create nearly 3.5 crore new employment opportunities for the youth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-cut-coming-soon-what-to-expect-after-pm-modi-big-diwali-promise-2771554-2025-08-15",
      "headline": "GST cut coming soon? What to expect after PM Modi's big Diwali promisePrime Minister Narendra Modi's announcement has set expectations for a substantial overhaul of the current multi-slab GST structure, which has been in place since 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-semiconductor-chips-2025-end-pm-modi-independence-day-speech-red-fort-gst-diwali-energy-nuclear-2771547-2025-08-15",
      "headline": "India to roll out its own semiconductor chips by end of 2025: PM ModiSpeaking on the country's 79th Independence Day, PM Modi hoisted the national flag for the 12th consecutive time before outlining the government's plans for technology, energy, and economic reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pms-double-diwali-promise-says-next-generation-gst-with-lower-taxes-coming-soon-2771537-2025-08-15",
      "headline": "PM's Double Diwali promise, says next-generation GST with much lower taxes soonPrime Minister Narendra Modi promised the roll-out a next-generation GST regime with substantially lower taxes before this Diwali, calling it a major festive gift to benefit individuals, MSMEs, and the economy."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-expresses-gratitude-to-fans-after-war-2-success-2772161-2025-08-16",
      "headline": "Love speaks the loudest: Kiara Advani expresses gratitude to fans after War 2 successAyan Mukerji's 'War 2', starring Hrithik Roshan, Kiara Advani and Jr NTR, crossed Rs 100 crore at the box office within two days of release. The cast, including Kiara, Hrithik and Jr NTR, shared heartfelt messages thanking fans for their love and support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-deol-says-playing-hanuman-in-nitesh-tiwari-ramayana-is-a-big-challenge-2772149-2025-08-16",
      "headline": "Sunny Deol says playing Hanuman in Nitesh Tiwari's Ramayana is a big challengeSunny Deol, set to play Lord Hanuman in Nitesh Tiwari's 'Ramayana', shared that the role is both exciting and challenging. He also expressed hope that the film's scale and effects will match Hollywood standards and satisfy audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-dubs-husband-saif-ali-khan-her-lion-in-goofy-55th-birthday-post-2772131-2025-08-16",
      "headline": "To our lion: Kareena's roar of love for husband Saif Ali Khan on his 55th birthdaySaif Ali Khan celebrated his 55th birthday on August 16. Heartfelt wishes from family, especially his wife Kareena Kapoor Khan and sisters Soha and Saba, poured in via Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-on-co-parenting-son-arhaan-with-ex-arbaaz-khan-2772124-2025-08-16",
      "headline": "Malaika Arora on co-parenting son Arhaan with ex Arbaaz: We have our boundariesMalaika Arora opened up about her divorce with Arbaaz Khan, saying co-parenting has its challenges but they have managed to maintain balance for their son Arhaan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vivek-agnihotri-cries-dictatorship-as-kolkata-blocks-the-bengal-files-trailer-launch-2772109-2025-08-16",
      "headline": "Vivek Agnihotri cries dictatorship as Kolkata blocks The Bengal Files trailer launchFilmmaker Vivek Agnihotri faced significant hurdles during the trailer launch of his film 'The Bengal Files' in Kolkata. Despite the challenges and cancellations, the trailer was eventually unveiled, highlighting the film's exploration of West Bengal's turbulent political history and communal violence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-honoured-as-he-attends-independence-day-ceremony-at-rashtrapati-bhavan-2772075-2025-08-16",
      "headline": "Anupam Kher attends Independence Day ceremony at Rashtrapati BhavanAnupam Kher attended the Independence Day At Home ceremony at Rashtrapati Bhavan, hosted by President Droupadi Murmu. The actor said he felt honoured and blessed to be part of the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-slams-troll-asking-him-to-celebrate-pakistan-independence-day-2772073-2025-08-16",
      "headline": "Javed Akhtar claps back after troll suggests he celebrate Pak Independence DayOn Independence Day, Javed Akhtar shared a message remembering freedom fighters but was trolled online. He gave a sharp reply, reminding that his ancestors went to Kaala Pani for India's freedom while some others supported the British."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/geetha-govindam-turns-7-vijay-deverakonda-rashmika-mandanna-share-bts-pics-2772056-2025-08-16",
      "headline": "Geetha Govindam turns 7: Vijay Deverakonda, Rashmika share BTS pics, special postsVijay Deverakonda and Rashmika Mandanna celebrated seven years of their hit film 'Geetha Govindam' by sharing heartfelt notes on social media. While Vijay called the film \"special\" and said he is \"missing\" the team, Rashmika posted throwback pictures and said the film will \"always be the most special.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jitendra-kumar-ravi-kishan-to-join-mirzapur-the-film-shooting-begins-soon-2772045-2025-08-16",
      "headline": "Jitendra Kumar, Ravi Kishan to join Mirzapur The Film, shooting begins soon: ReportActors Jitendra Kumar and Ravi Kishan are reported to have joined the cast of the upcoming Mirzapur film, though an official confirmation is still awaited. The big-screen adaptation will also see Ali Fazal, Pankaj Tripathi, Divyenndu and Shweta Tripathi return, with shooting expected to begin soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/iffm-2025-aamir-khan-honoured-neeraj-ghaywans-homebound-abhishek-bachchan-sweeps-big-awards-2772030-2025-08-16",
      "headline": "IFFM 2025: Aamir Khan honoured, Neeraj Ghaywan's Homebound sweeps big awardsThe Indian Film Festival of Melbourne 2025 honoured Aamir Khan, Abhishek Bachchan, Jaideep Ahlawat, Arvind Swamy, and others for their contributions to cinema. Meanwhile, director Neeraj Ghaywan's 'Homebound' bagged top honours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-happiest-father-on-earth-as-son-abhishek-bachchan-wins-iffm-2025-2772026-2025-08-16",
      "headline": "Big B is the happiest father on Earth as son Abhishek Bachchan wins big at IFFM 2025Amitabh Bachchan wrote a heartfelt note after Abhishek Bachchan won Best Actor at the Indian Film Festival of Melbourne 2025, calling him \"the pride of the family.\" The proud father said Abhishek's hard work and never-give-up attitude have finally brought him the respect he deserves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-box-office-day-2-hrithik-roshan-jr-ntr-film-soars-past-rajinikanth-coolie-on-independence-day-2772012-2025-08-16",
      "headline": "War 2 box office Day 2: Hrithik, Jr NTR film soars past Coolie on Independence Day'War 2' has made a powerful impact at the box office, crossing Rs 100 crore in just two days despite mixed reviews. The Hindi version thrived on the Independence Day holiday, setting the stage for a fierce competition with Coolie as audiences across India flock to theatres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/when-did-rajinikanth-become-god-chasing-the-man-the-myth-the-legend-2772000-2025-08-16",
      "headline": "When did Rajinikanth become God? Chasing the man, the myth, the legendFrom bus conductor to cinema deity, Rajinikanth is beyond a superstar; he is a phenomenon. For millions, his films are festivals, his words are scripture, and his very presence radiates the energy of a living legend. Fifty years on, the question isn't how he became a star, but how he became God."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-box-office-day-2-rajinikanth-reigns-supreme-with-rs-119-crore-in-india-2771984-2025-08-16",
      "headline": "Coolie box office Day 2: Rajinikanth reigns supreme with Rs 119 crore in IndiaRajinikanth's latest film 'Coolie' sets new records, becoming the first Tamil film to earn Rs 100 crore in two days, and breaking records overseas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-celebrates-family-milestones-india-independence-day-jonas-anniversaries-birthdays-2771976-2025-08-16",
      "headline": "Priyanka Chopra's New York celebrations blend family milestones, Independence DayPriyanka Chopra marked a series of family celebrations and extended her best wishes for India's Independence Day. Alongwith a bunch of lively photos, the celebrated star wrote a thoughtful and lengthy note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-deeply-grateful-as-pm-narendra-modi-congratulates-him-on-50-years-in-cinema-2771964-2025-08-16",
      "headline": "Rajinikanth deeply grateful as PM Modi congratulates him on 50 years in cinemaPrime Minister Narendra Modi warmly congratulated Rajinikanth on completing 50 years in cinema, praising his iconic journey and diverse roles. The superstar expressed heartfelt gratitude in a post on X. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dear-students-teaser-nayanthara-nivin-pauly-reunite-in-comedy-drama-with-a-twist-2771958-2025-08-16",
      "headline": "Dear Students teaser: Nayanthara, Nivin Pauly reunite in comedy drama with a twistThe teaser for 'Dear Students', starring Nayanthara and Nivin Pauly, sets up a mystery-filled narrative. Directed by Sandeep Kumar and George Philip Roy, it features intriguing characters and action sequences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-prime-video-this-weekend-2771635-2025-08-16",
      "headline": "Top films and shows to watch on Prime Video this weekendTop picks to stream on Prime Video this weekend, from horror to espionage thrillers to animation and documentaries. Here is a glimpse at the new releases to add to your binge-list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-raghav-chadhas-tricolour-themed-independence-day-feast-at-home-2771865-2025-08-15",
      "headline": "Parineeti Chopra, Raghav Chadha's tricolour-themed Independence Day feast at homeParineeti Chopra and Raghav Chadha shared a glimpse of their Independence Day with a tricolour-themed lunch at home. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-on-ukraine-war-after-putin-meet-seeks-direct-peace-not-ceasefire-2772116-2025-08-16",
      "headline": "Trump pivots on Ukraine war after Putin meet, seeks direct peace not ceasefireTrump said he and Putin had agreed the best way forward was \"to go directly to a peace agreement, which would end the war, and not a mere ceasefire agreement\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-welcomes-trump-putin-alaska-meet-calls-leadership-commendable-and-backs-dialogue-on-ukraine-conflict-2772111-2025-08-16",
      "headline": "India praises Trump-Putin Alaska meet, backs dialogue to end Ukraine warIndia welcomed the Alaska Summit between US President Donald Trump and Russian President Vladimir Putin, praising their leadership in pursuing peace. New Delhi emphasised dialogue and diplomacy as the only path to end the Ukraine conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-pawan-khera-slams-ncert-partition-module-2772144-2025-08-16",
      "headline": "Set fire to book if facts missing: Congress slams NCERT's Partition moduleAn NCERT module to mark Partition Horrors Remembrance Day holds Muhammad Ali Jinnah, the Congress, and then Viceroy Lord Mountbatten responsible for the partition. The module has evoked a sharp reaction from the Congress."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-fox-interview-putin-meet-alaska-russia-sanctions-ukraine-war-2771978-2025-08-16",
      "headline": "Relief for India? Trump softens stance on Russia oil buyers after Putin meetIn an interview with Fox News, Donald Trump said the meeting with Russian President Putin in Alaska went well, rating it a '10/10'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/how-vladimir-putin-is-winner-alaska-summit-anchorage-donald-trump-ukraine-war-ceasefire-talks-five-points-explained-2772101-2025-08-16",
      "headline": "How Putin is the winner of Alaska meet | Explained in 5 pointsAt the Alaska Summit, US President Donald Trump threatened \"severe consequences\" but left without pressing Russian President Vladimir Putin on the Ukraine ceasefire. Instead, Putin dominated the talks, won symbolic optics with a red-carpet welcome, hinted at new business ventures, and projected himself as a confident world leader. Here is how he won the meet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ready-for-constructive-cooperation-says-zelenskyy-after-trump-putin-summit-to-travel-to-washington-on-monday-2772054-2025-08-16",
      "headline": "Ready to work for peace: Zelenskyy to head to US after Trump-Putin summitAfter his summit with Putin yielded no agreement on the Ukraine war, Trump told Zelenskyy, in a call lasting over an hour, that Putin preferred a comprehensive deal to end the war to a ceasefire.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/election-commission-press-conference-rahul-gandhi-vote-theft-allegations-bihar-voter-list-revision-2025-2772128-2025-08-16",
      "headline": "Poll body press meet tomorrow, likely to address Rahul Gandhi's vote theft claimThe briefing is expected to address recent political developments, including Congress leader Rahul Gandhi's allegations of vote theft. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/body-expert-dissects-trump-putin-alaska-handshake-glbs-2771935-2025-08-16",
      "headline": "From dominant to deflated: How Trump's body language swung during Putin meetTwo experts have now decoded how the body language of Donald Trump, who appeared upbeat, underwent a drastic change in the course of the summit with Putin on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/bill-gates-shares-best-answers-to-toughest-job-interview-questions-2772156-2025-08-16",
      "headline": "Why should we hire you? Bill Gates shares perfect answers for job interviewsBill Gates once role-played as a college dropout applying for his first job. His witty, practical answers with Stephen Curry reveal timeless lessons for job-seekers facing tough interview questions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-putin-meeting-alaska-ukraine-war-optics-the-beast-chat-red-carpet-welcome-handshake-2771967-2025-08-16",
      "headline": "Red carpet, secret chat in The Beast: Trump came in roaring, Putin left laughingTrump-Putin Alaska summit: Trump arrived for the summit roaring. He threatened Putin with 'severe consequences' over the Ukraine war. However, when the two leaders met, Trump's compulsive bluster was gone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/new-ncert-module-on-partition-horrors-triggers-row-over-who-was-responsible-2772037-2025-08-16",
      "headline": "New NCERT module on Partition horrors partly blames Congress, sparks rowNCERT has released a special module on Partition Horrors Day for Classes 6–12, sparking political debate over its interpretation of history and responsibility for India's division. Congress spokesperson Pawan Khera said the module should be burnt as it \"didn't tell the truth.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jaipur-retired-army-captain-dies-car-accident-hit-and-run-cctv-footage-2772024-2025-08-16",
      "headline": "Retired Army captain dragged for 10 feet after getting stuck under car, diesThe incident happened on the morning of August 15 when Narsaram Jajra, a retired Army captain, was going to Jaipur's Chitrakoot Stadium on his bicycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/meet-14-year-old-parineeti-who-left-school-to-become-a-chatgpt-expert-2772113-2025-08-16",
      "headline": "Meet 14-year-old Parineeti, who left school to become a ChatGPT expertAt just 14, Parineeti left school to focus on ChatGPT and AI automation. She now runs her own business, sparking debate online over education, ambition, and the future of work."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kunal-ghosh-criticises-vivek-agnihotri-bengal-files-trailer-launch-cancelled-political-agenda-2772160-2025-08-16",
      "headline": "Doing drama, dividing people: Kunal Ghosh vs Vivek Agnihotri over The Bengal FilesKunal Ghosh accused Agnihotri of using cinema to push a political agenda, stating that his work is designed to divide people and create controversy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/motorcyclist-killed-hit-and-run-suv-delhi-moti-nagar-2772047-2025-08-16",
      "headline": "Thar runs over biker in Delhi, multiple liquor bottles found inside carThe victim's younger brother said the incident occurred while Bechu Lal was on his way to the hospital. He had parked his bike behind a truck near a signal when a Thar came from behind and hit him, killing him on the spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/badminton-shuttlecocks-crisis-bai-secretary-2771982-2025-08-16",
      "headline": "How China's changing food habits has forced a shuttlecock crisisThe world of badminton is going through a shuttlecock crisis. With China shifting its food habits, the badminton community stares at an unprecedented crisis in its hands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-514-15-08-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/stray-dogs-attacks-debate-delhi-supreme-court-speciesism-peter-singer-philosophers-say-pigs-animals-2770783-2025-08-16",
      "headline": "No, dog lovers are not hypocritesOur preference for dogs over other animals reflects speciesism. We favour those we live with and love, not those whose suffering is equal. Protecting dogs is valid, but not at the predictable cost of vulnerable humans. Here's a philosophical take on the stray dog debate that takes into account ethics and morality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/mahindra-vision-s-concept-is-this-a-new-scorpio-2772009-2025-08-16",
      "headline": "Mahindra Vision S concept: Is this a new Scorpio?The Vision S SUV will be underpinned by the new NU_IQ platform, production slated for 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-slams-troll-asking-him-to-celebrate-pakistan-independence-day-2772073-2025-08-16",
      "headline": "Javed Akhtar claps back after troll suggests he celebrate Pak Independence DayOn Independence Day, Javed Akhtar shared a message remembering freedom fighters but was trolled online. He gave a sharp reply, reminding that his ancestors went to Kaala Pani for India's freedom while some others supported the British."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bhopal-student-to-harvard-reaction-video-delights-internet-viral-instagram-video-2771997-2025-08-16",
      "headline": "Bhopal woman gets into Harvard, her family's reaction in video will leave you in tearsA now-viral video showing a Bhopal student and her family's reaction to her acceptance into Harvard has struck a chord with the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-new-rocket-force-command-arfc-chinese-people-liberation-army-india-operation-sindoor-5-big-points-explained-2771310-2025-08-16",
      "headline": "Pak's anti-India rocket force to be built on Chinese template | 5 big pointsPakistan has announced a new Army Rocket Force Command (ARFC), which will be modelled on China's PLA Rocket Force. Islamabad aims to boost its conventional missile capabilities following its drubbing in the four-day military conflict with India. Here are five key points explaining the development, the rocket force command, and what it signifies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/karnataka-education-policy-youth-development-bilingual-schooling-2772016-2025-08-16",
      "headline": "Karnataka to roll out state-specific education policy with two-language modelKarnataka Chief Minister Siddaramaiah has announced steps for a state-specific education policy, including a two-language model, more schools, new colleges, and skill-based training for students."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-expresses-gratitude-to-fans-after-war-2-success-2772161-2025-08-16",
      "headline": "Love speaks the loudest: Kiara Advani expresses gratitude to fans after War 2 successAyan Mukerji's 'War 2', starring Hrithik Roshan, Kiara Advani and Jr NTR, crossed Rs 100 crore at the box office within two days of release. The cast, including Kiara, Hrithik and Jr NTR, shared heartfelt messages thanking fans for their love and support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-deol-says-playing-hanuman-in-nitesh-tiwari-ramayana-is-a-big-challenge-2772149-2025-08-16",
      "headline": "Sunny Deol says playing Hanuman in Nitesh Tiwari's Ramayana is a big challengeSunny Deol, set to play Lord Hanuman in Nitesh Tiwari's 'Ramayana', shared that the role is both exciting and challenging. He also expressed hope that the film's scale and effects will match Hollywood standards and satisfy audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-dubs-husband-saif-ali-khan-her-lion-in-goofy-55th-birthday-post-2772131-2025-08-16",
      "headline": "To our lion: Kareena's roar of love for husband Saif Ali Khan on his 55th birthdaySaif Ali Khan celebrated his 55th birthday on August 16. Heartfelt wishes from family, especially his wife Kareena Kapoor Khan and sisters Soha and Saba, poured in via Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-on-co-parenting-son-arhaan-with-ex-arbaaz-khan-2772124-2025-08-16",
      "headline": "Malaika Arora on co-parenting son Arhaan with ex Arbaaz: We have our boundariesMalaika Arora opened up about her divorce with Arbaaz Khan, saying co-parenting has its challenges but they have managed to maintain balance for their son Arhaan."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-sa-3rd-t20i-glenn-maxwell-seals-t20i-series-dewald-brevis-nathan-ellis-2772159-2025-08-16",
      "headline": "AUS vs SA: Maxwell masterclass seals T20I series with thrilling chase in 3rd T20IGlenn Maxwell's match-winning 62* (36) in the third T20I against South Africa helped Australia seal the three-match series by 2-1 in Cairns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jacob-bethell-set-to-lead-like-ben-stokes-in-captaincy-debut-2772145-2025-08-16",
      "headline": "Inspired by Ben Stokes, Jacob Bethell set to lead by example on captaincy debutEngland all-rounder Jacob Bethell is ready to lead from the front like Ben Stokes ahead of his captaincy debut in the upcoming three-match T20I series against Ireland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sunil-chhetri-cafa-nations-cup-snubbed-khalid-jamil-india-probables-2772143-2025-08-16",
      "headline": "No Sunil Chhetri in Khalid Jamil's India probables for CAFA Nations CupSunil Chhetri has been left out of India's 35-man probables for the CAFA Nations Cup. The AIFF offered no explanation, leaving uncertainty around the legend's international future as the Blue Tigers prepare for their campaign later this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-sa-3rd-t20i-dewald-brevis-100-m-six-video-cairns-2772133-2025-08-16",
      "headline": "Watch: Dewald Brevis launches 100m six out of stadium in T20I vs AustraliaAUS vs SA, 3rd T20I: Dewald Brevis continued his impressive run in the T20I series against Australia with a quick 53 in the final match. He hit 6 sixes, including a 100m biggie, on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chennai-super-kings-rubbish-dewald-brevis-rumours-after-ashwins-claim-2772104-2025-08-16",
      "headline": "Chennai Super Kings rubbish Dewald Brevis rumours after Ashwin's explosive claimChennai Super Kings (CSK) have rubbished the rumours regarding the signing of Dewald Brevis midway through the IPL 2025 after Ravichandran Ashwin's big claim on his Youtube channel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-yashasvi-jaiswal-shubman-gill-india-squad-aakash-chopra-2772105-2025-08-16",
      "headline": "Yashasvi Jaiswal ahead of Shubman Gill in race for Asia Cup squad: Aakash ChopraAakash Chopra has claimed that Yashasvi Jaiswal is ahead of Shubman Gill in the race to be a part of India's Asia Cup squad. India will reveal their side for the tournament either on August 19 or 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/silesia-diamond-league-live-stream-noah-lyles-kenny-bednarek-100m-final-2772100-2025-08-16",
      "headline": "Lyles-Bednarek rivalry: Beef explained as sprinters resume heated rivalryNoah Lyles and Kenny Bednarek renew their sprint rivalry at the Silesia Diamond League. Their tense history and recent showdown add spice ahead of the Tokyo World Championships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-guatam-gambhir-utkarsh-wedding-photos-rohit-sharma-2772097-2025-08-16",
      "headline": "MS Dhoni, Gambhir reunite at star-studded wedding, Rohit joins the celebrationMS Dhoni and Gautam Gambhir were seen sharing a light moment at a high-profile wedding. Rohit Sharma, Tilak Varma, Irfan Pathan and Parthiv Patel were also in attendance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/gukesh-st-louis-rapid-blitz-2025-levon-aronian-title-2772077-2025-08-16",
      "headline": "D Gukesh finishes tied sixth at St. Louis Rapid and Blitz, Levon Aronian wins titleD Gukesh faltered in the second half of the final day of the St. Louis Rapid and Blitz tournament to finish tied sixth in the standings. The USA's Levon Aronian won the title in comprehensive fashion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-sa-aiden-markram-opening-stubbs-brevis-2772046-2025-08-16",
      "headline": "Markram moves up to accommodate destructive Brevis and Stubbs in batting orderSouth Africa captain Aiden Markram has moved to the openers' slot in the T20Is. The move is aimed at supporting more destructive options in the middle order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/silesia-diamond-league-live-stream-noah-lyles-kenny-bednarek-100m-final-2772100-2025-08-16",
      "headline": "Lyles-Bednarek rivalry: Beef explained as sprinters resume heated rivalryNoah Lyles and Kenny Bednarek renew their sprint rivalry at the Silesia Diamond League. Their tense history and recent showdown add spice ahead of the Tokyo World Championships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-guatam-gambhir-utkarsh-wedding-photos-rohit-sharma-2772097-2025-08-16",
      "headline": "MS Dhoni, Gambhir reunite at star-studded wedding, Rohit joins the celebrationMS Dhoni and Gautam Gambhir were seen sharing a light moment at a high-profile wedding. Rohit Sharma, Tilak Varma, Irfan Pathan and Parthiv Patel were also in attendance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/gukesh-st-louis-rapid-blitz-2025-levon-aronian-title-2772077-2025-08-16",
      "headline": "D Gukesh finishes tied sixth at St. Louis Rapid and Blitz, Levon Aronian wins titleD Gukesh faltered in the second half of the final day of the St. Louis Rapid and Blitz tournament to finish tied sixth in the standings. The USA's Levon Aronian won the title in comprehensive fashion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-sa-aiden-markram-opening-stubbs-brevis-2772046-2025-08-16",
      "headline": "Markram moves up to accommodate destructive Brevis and Stubbs in batting orderSouth Africa captain Aiden Markram has moved to the openers' slot in the T20Is. The move is aimed at supporting more destructive options in the middle order."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}