{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirav-modis-brother-in-law-maiank-mehta-pardoned-in-rs-13000-crore-pnb-scam-case-2794352-2025-09-27",
      "headline": "Nirav Modi's brother-in-law Maiank Mehta pardoned in Rs 13,000 crore PNB scam caseA special CBI court granted pardon to Maiank Mehta, brother-in-law of fugitive diamantaire Nirav Modi, in the Rs 13,000 crore Punjab National Bank fraud case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/what-to-expect-from-the-national-stock-exchange-in-the-next-5-years-india-today-conclave-2794051-2025-09-26",
      "headline": "What to expect from the National Stock Exchange in the next 5 years?Ashish Chauhan, CEO of NSE Chauhan, said the rise in investors and market size over the last decade gives a clear idea of the potential ahead. In 2014, India had just 1.67 crore unique investors. Today, there are about 12 crore investors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/50-tariffs-and-growth-why-india-must-focus-on-reform-not-retaliation-2794039-2025-09-26",
      "headline": "50% tariffs and growth: Why India must focus on reform, not retaliationAt the India Today Conclave Mumbai 2025, experts called for reforms, investment-led growth, and targeted support for vulnerable sectors to navigate challenges from steep US tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-stock-market-advantage-vs-global-india-today-conclave-mumbai-ashish-chauhan-nse-ceo-2794031-2025-09-26",
      "headline": "Explained: Why Dalal Street has an edge over global stock marketsAt the India Today Conclave in Mumbai, Ashish Chauhan, CEO of the National Stock Exchange of India (NSE), explained why India's markets and economy hold a stronger position for the future compared to others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-50-tariffs-to-growth-why-india-needs-reforms-not-retaliation-2794011-2025-09-26",
      "headline": "From 50% tariffs to growth: Why India needs reforms, not retaliationAs the US slaps steep tariffs on Indian goods, the debate is shifting from retaliation to reform. Experts at the India Today Conclave Mumbai 2025 say India should use this moment to push for deeper reforms that fuel investment and boost domestic demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/how-to-invest-in-pharma-and-it-stocks-during-current-slowdown-2793962-2025-09-26",
      "headline": "How to invest in pharma and IT stocks during current slowdownWith the US announcing fresh tariffs on branded drugs and uncertainty around H-1B visa rules, both sectors are experiencing headwinds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-talks-advance-amid-tariff-and-energy-discussions-2793911-2025-09-26",
      "headline": "India-US trade talks advance amid tariff and energy discussionsIndia-US trade discussions are gaining momentum, with both nations exploring ways to enhance economic cooperation, address tariffs, and boost energy trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-733-points-nifty-below-24700-pharma-it-stocks-hit-hard-2793901-2025-09-26",
      "headline": "Sensex tumbles 733 points as pharma, IT stocks hitThe sell-off came after the United States announced a steep 100% tariff on imports of branded and patented pharmaceutical products, effective October 1."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-air-passengers-rise-to-1317-lakh-in-august-2025-amid-rising-costs-icra-report-2793857-2025-09-26",
      "headline": "Indian air passengers rise to 131.7 lakh in August 2025 amid rising costs: ReportIndia's aviation sector is bouncing back, but the journey isn't without turbulence. Rising fuel costs, operational challenges, and financial pressures are testing airlines, even as passenger traffic shows steady growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-down-800-points-nifty-fall-pharma-it-auto-fmcg-shares-trump-announcement-2793865-2025-09-26",
      "headline": "Sensex tanks 800 points: Why is stock market falling today?By 2:37 pm, the S&P BSE Sensex had lost 782.71 points to trade at 80,376.97, while the NSE Nifty50 slipped 247.10 points to 24,643.75. Both indices were on track to end the week in negative territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/18-upcoming-ipos-next-week-glottis-fabtech-om-freight-advance-agrolife-sme-public-listings-2793844-2025-09-26",
      "headline": "Investors brace for IPO wave as 18 public listings hit Dalal Street next weekThe four mainboard IPOs opening next week together aim to raise over Rs 850 crore. Apart from them, 14 SME IPOs will also open for bidding next week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-policy-private-grievance-platforms-claim-denied-2793797-2025-09-26",
      "headline": "Why more insurance policyholders are turning to private grievance platformsAs claim rejections soar and official channels frustrate, policyholders turn to private grievance platforms. Experts warn regulatory reform and competent brokers could restore trust in India's struggling insurance system."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pm-modi-tribute-lata-mangeshkar-zubeen-garg-mann-ki-baat-2794756-2025-09-28",
      "headline": "PM Modi pays tributes to Lata Mangeshkar and Zubeen Garg in Mann Ki Baat PM Modi paid an emotional tribute to playback legend Lata Mangeshkar on her birthday on Sunday, and hailed late singer Zubeen Garg during his radio show, Mann Ki Baat"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/120-bahadur-teaser-special-tribute-lata-mangeshkar-birth-anniversary-farhan-akhtar-2794734-2025-09-28",
      "headline": "120 Bahadur teaser out as special tribute on Lata Mangeshkar's birth anniversary To mark Lata Mangeshkar's birth anniversary, the makers of '120 Bahadur' released a poignant teaser featuring her iconic song 'Ae Mere Watan Ke Logon'. The film, set during the Rezang La battle, will release in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-celebrates-18-years-in-cinema-peddi-makers-release-special-poster-2794744-2025-09-28",
      "headline": "Ram Charan celebrates 18 years in cinema, Peddi makers release special poster Tollywood star Ram Charan celebrates 18 years in cinema, with his upcoming film 'Peddi' marking the milestone by releasing a special poster. The film, starring Janhvi Kapoor and featuring music by A.R. Rahman, is halfway through production and has already secured a massive OTT deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/punjabi-singer-rajvir-jawanda-hospitalised-in-critical-condition-after-bike-accident-2794728-2025-09-28",
      "headline": "Punjabi singer Rajvir Jawanda hospitalised in critical condition after bike accident Punjabi singer Rajvir Jawanda is in critical condition after a motorcycle accident in Himachal Pradesh, sustaining severe head and spine injuries and requiring ventilator support. Fans, fellow artists, and political leaders have expressed concern and prayed for his speedy recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-thanks-wife-shalini-for-her-silent-strength-nothing-comes-easy-24h-barcelona-race-2794696-2025-09-28",
      "headline": "Nothing comes easy: Ajith Kumar thanks wife Shalini for her silent strength Ahead of his 24H Barcelona race on September 28, actor Ajith Kumar spoke about the delicate balance between family and passion, crediting wife Shalini's unwavering support. The Tamil superstar also spoke about his love for racing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-box-office-collection-day-2-ishaan-khatter-vishal-jethwa-janhvi-kapoor-film-gets-lukewarm-response-2794688-2025-09-28",
      "headline": "Homebound box office day 2: Ishaan's film gets lukewarm response with Rs 50 lakh India's Oscar entry 'Homebound', starring Ishaan Khatter, Vishal Jethwa, and Janhvi Kapoor, has seen a muted response at the domestic box office, earning just Rs 80 lakh so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/they-call-him-og-box-office-collection-day-3-pawan-kalyan-film-crosses-rs-120-crore-mark-2794692-2025-09-28",
      "headline": "They Call Him OG box office day 3: Pawan Kalyan's film crosses Rs 120 crore mark  Pawan Kalyan's 'They Call Him OG' has emerged as a box office hit, earning over Rs 120 crore in India and becoming his highest-grossing film. The action-drama, also starring Emraan Hashmi and Priyanka Mohan, performed strongly despite mixed reviews."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-weekend-ka-vaar-salman-khan-schools-amaal-mallik-gauahar-khan-urges-awez-darbar-to-raise-voice-2794673-2025-09-28",
      "headline": "BB19 Weekend Ka Vaar: Salman schools Amaal, Gauahar urges Awez to raise voice This Weekend Ka Vaar of 'Bigg Boss 19' featured Tanya Mittal's birthday celebrations with heated confrontations, sharp remarks, and emotional breakdowns. Salman Khan schooled Amaal and Baseer for their gameplay, with Gauahar Khan urging Awez to raise his voice."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-responds-abhinav-kashyap-allegations-bigg-boss-19-negativity-2794653-2025-09-28",
      "headline": "Please get some work: Did Salman Khan take a dig at Abhinav Kashyap? Salman Khan subtly addressed criticism against him after 'Dabangg' director Abhinav Kashyap made negative comments about him in a recent podcast. During a recent 'Bigg Boss 19' episode, Salman urged people to get a job and stop spreading negativity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-the-raja-saab-trailer-launch-details-2794667-2025-09-28",
      "headline": "Prabhas' The RajaSaab trailer release date and time, all you need to know Pan-India superstar Prabhas fans are excited about his next release, The RajaSaab. The film opens in January 2026 and the buzz is already building, with the trailer all set to be launched.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-gets-sweet-birthday-wishes-from-riddhima-kapoor-sahni-neetu-kapoor-2794652-2025-09-28",
      "headline": "Ranbir Kapoor gets sweet birthday wishes with throwback pics from Riddhima, Neetu Ranbir Kapoor turned 43 and got sweet birthday wishes from his sister Riddhima Kapoor Sahni and mother Neetu Kapoor, who shared old family photos and messages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-back-in-mumbai-with-alia-bhatt-paps-shower-birthday-wishes-at-airport-2794628-2025-09-28",
      "headline": "Ranbir Kapoor back in Mumbai with Alia Bhatt, paps shower birthday wishes at airport Actor Ranbir Kapoor was seen with wife Alia Bhatt at the airport on his birthday. He acknowledged warm wishes from the paparazzi, who were stationed at the Mumbai airport on Sunday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-karur-tvk-rally-stampede-kamal-haasan-rajinikanth-celebs-extend-condolences-2794603-2025-09-28",
      "headline": "Vijay Karur rally stampede: Kamal Haasan, Rajinikanth, celebs extend condolences The Karur rally tragedy has deeply saddened Tamil Nadu, with the film fraternity expressing shock and grief over the loss of 39 lives, including children, due to overcrowding and poor arrangements. Rajinikanth, Kamal Haasan, and other celebs mourned the loss of lives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-benny-blanco-are-married-singer-shares-dreamy-photos-2794577-2025-09-28",
      "headline": "Selena Gomez-Benny Blanco are married, singer shares dreamy photos Singer-actor Selena Gomez has married her longtime boyfriend and record producer Benny Blanco in an intimate wedding ceremony in Santa Barbara, California. She shared stunning pictures from the private celebration held on September 27, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-in-sanjay-leela-bhansali-film-actor-visits-filmmaker-sparks-buzz-2794461-2025-09-27",
      "headline": "Ahaan Panday in Sanjay Leela Bhansali film? Actor visits filmmaker, sparks buzz Bollywood's rising star Ahaan Panday was seen at Sanjay Leela Bhansali's office on Saturday, sparking widespread speculation about a potential collaboration between the two. Fans are eagerly awaiting an official announcement as excitement builds over this possible new project. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/varalaxmi-sarathkumar-makes-directorial-debut-saraswathi-prakash-raj-priyamani-2794442-2025-09-27",
      "headline": "Varalaxmi Sarathkumar's directorial debut Saraswathi to star Priyamani, Prakash Raj Varalaxmi Sarathkumar is making her directorial debut with 'Saraswathi', produced under the new banner Dosa Diaries launched with her sister Pooja. The actor shared the announcement post on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-dream-formula-one-hollywood-film-racing-passion-2794437-2025-09-27",
      "headline": "Ajith Kumar talks about dream F1 film collaboration and his racing passion Tamil superstar Ajith Kumar hinted at the possibility of making a Formula One film, blending his passion for racing with cinema. In an interview with India Today, he also expressed hope for an Indian driver to become a Formula One World Champion in his lifetime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-benny-blanco-wedding-taylor-swift-santa-barbara-date-guest-list-what-we-know-so-far-2794385-2025-09-27",
      "headline": "Selena Gomez and Benny Blanco's wedding: Date, guest list, what we know so far Set against the scenic backdrop of Santa Barbara, Selena Gomez and Benny Blanco are set for a secret, celebrity-filled wedding that promises to be intimate, unforgettable, and all that one can talk about. Here's all we know about D-Day so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amaal-mallik-gets-scolded-by-salman-khan-and-gauahar-khan-in-bigg-boss-19-promo-2794393-2025-09-27",
      "headline": "Bigg Boss 19: Amaal Mallik is scolded by Salman Khan and Gauahar; watch promo In the upcoming 'Bigg Boss 19' Weekend Ka Vaar, Salman Khan scolded Amaal Mallik for his abusive behaviour and urged him to focus on his talent. Former winner Gauahar Khan also entered the house to give Amaal and Awez Darbar a reality check."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-trade-talks-india-brazil-market-access-tariffs-negotiations-2794617-2025-09-28",
      "headline": "Need to fix India, stop actions harming US interests: Trump aide's new threatTaking a potshot at India and Brazil, US Commerce Secretary Howard Lutnick said that these countries need to do more to open their markets and stop taking actions that harm US interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-asia-cup-2025-final-match-live-score-dubai-india-pakistan-2794706-2025-09-28",
      "headline": "IND vs PAK Live: India, Pakistan set for high-voltage finaleIndia (IND) vs Pakistan (PAK) Live Score, Asia Cup Final Match: India take on Pakistan for the third time in this Asia Cup, and this time it is for the big prize in the final at the Dubai International stadium. Amidst all the controversies, fans are prepared for a big clash between the two arch-rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-digs-deep-for-donald-trump-favour-flaunts-rare-earths-at-white-house-meet-2794693-2025-09-28",
      "headline": "Pak's rock show at White House to seduce TrumpThe White House has released a picture of Donald Trump staring at what it described as rare earth minerals, fixated on Munir's presentation displayed in a neatly arranged wooden box, as Pakistan's Prime Minister Shehbaz Sharif looked on with a smile."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tvk-cadres-attacked-five-ambulances-during-karur-stampede-rescue-claims-service-provider-2794733-2025-09-28",
      "headline": "TVK workers attacked 5 ambulances during Karur stampede rescue: Service providerThe ambulance service provider described how people stood atop makeshift shade sheets on rooftops that gave way under the pressure of the crowd."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/power-cut-narrow-roads-crowd-surge-eyewitnesses-recount-what-led-to-karur-stampede-vijay-tvk-rally-2794630-2025-09-28",
      "headline": "Power cut, narrow roads, crowd surge: Eyewitnesses on what led to stampedeEyewitnesses and victim families cited a combination of a power cut, narrow roads, crowd surge, and lack of immediate assistance as key factors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mithun-manhas-bcci-president-delhi-cricketer-india-2794694-2025-09-28",
      "headline": "Mithun Manhas, ex-Delhi cricketer, elected as new BCCI presidentMithun Manhas has officially taken the helm of Indian cricket as the President of the Board of Control for Cricket in India (BCCI), following the conclusion of the Annual General Meeting (AGM) in Mumbai on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-airport-several-schools-other-institutions-receive-bomb-threat-via-email-investigation-underway-2794742-2025-09-28",
      "headline": "Delhi airport, schools, other institutions receive bomb threat emails, probe onDelhi airport, several schools and institutions received bomb threats via email on Sunday triggering extensive security checks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/varanasi-purana-durga-puja-2025-idol-refused-to-move-vijayadashami-pandal-madanpura-bengali-tola-1767-idol-mukherjee-family-2794035-2025-09-28",
      "headline": "The 260-year-old Durga that refused to move for immersion in Shiva's KashiImmersion of idols on Vijayadashami caps Durga Puja celebrations every year. However, in Varanasi's Madanpura, it's the same clay idol that has been being worshipped for almost 260 years now. Legend has it that in 1767, the Durga idol at Bengali Tola refused to move when people tried to take it out for immersion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/interviews/story/david-beckham-butter-chicken-and-beyond-the-saransh-goila-story-on-anything-but-2794654-2025-09-28",
      "headline": "David Beckham, butter chicken and beyond: The Saransh Goila story on 'Anything But'He grew up vegetarian, fell in love over vegan rajma chawal, and turned butter chicken into a global phenomenon — this is the story of Saransh Goila on 'Anything But', where we talk about everything but their work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/tiktok-saga-highlights-shift-to-geo-national-tech-governance-in-india-2794633-2025-09-28",
      "headline": "TikTok and the Death of Borderless TechThe TikTok saga signals the end of borderless tech. Platforms, AI, and supply chains now align with national priorities, marking a shift from supra-national to geo-national technology governance worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hotel-hopping-fake-pmo-link-how-molestation-accused-delhi-baba-evaded-cops-2794658-2025-09-28",
      "headline": "Hotel-hopping, fake PMO link: How molestation-accused Delhi baba evaded copsAccording to Delhi Police sources, the molestation-accused spiritual leader changed locations more than 15 times in an effort to avoid arrest. He strategically checked into hotels near prominent religious sites, knowing these areas attract less scrutiny and would allow him to blend in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-final-ind-vs-pak-suryakumar-yadav-bold-call-opinion-2794572-2025-09-28",
      "headline": "Asia Cup final: Did Suryakumar mock Pakistan one game too early?India vs Pakistan, Asia Cup final: Suryakumar Yadav's blunt words may sound confident, but against Pakistan they can do more harm than good. In a rivalry where every comment becomes fuel, the only answer that matters will come from his bat, not from what he says before the first ball is bowled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-thanks-wife-shalini-for-her-silent-strength-nothing-comes-easy-24h-barcelona-race-2794696-2025-09-28",
      "headline": "Nothing comes easy: Ajith Kumar thanks wife Shalini for her silent strengthAhead of his 24H Barcelona race on September 28, actor Ajith Kumar spoke about the delicate balance between family and passion, crediting wife Shalini's unwavering support. The Tamil superstar also spoke about his love for racing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-slams-media-democratic-party-epstein-files-mention-2794622-2025-09-28",
      "headline": "He tried to get me...: Elon Musk lashes out over Epstein Files mentionExplaining his side of the story, Elon Musk claimed that he refused Epstein's invitation to the private island and added, \"Yet they name me even before Prince Andrew, who did visit.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-final-india-vs-pakistan-preview-coronation-without-handshakes-dubai-suryakumar-yadav-salman-ali-agha-2794567-2025-09-28",
      "headline": "India vs Pakistan final: Asia Cup ready for coronation without handshakesIndia vs Pakistan, Asia Cup final: Forty-one years after the inaugural Asia Cup, India and Pakistan face off in the final for the first time. Although India won their two earlier encounters comfortably, the cricket has been overshadowed by snubs, heated exchanges, and provocative gestures. This Asia Cup looks set to crown a champion without any handshakes between the finalists."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/after-trump-shehbaz-sharif-yunus-in-demon-avatar-at-bengal-durga-puja-pandal-2794699-2025-09-28",
      "headline": "After Trump, Shehbaz Sharif, Yunus in demon avatar at Bengal Durga puja pandalAt the Sadhak Narendra Smriti Sangha pandal in Murshidabad's Berhampore, the traditional demon Mahishasura has been sculpted to closely resemble Dr Yunus, while a severed head held by Goddess Durga is clearly modeled after Shehbaz Sharif."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-final-cricket-rivalry-2794615-2025-09-28",
      "headline": "Can Pakistan ride on law of averages to ruffle high-flying India?Asia Cup Final, IND vs PAK: Pakistan have lost seven matches on the trot against India, and will look to end their losing streak when they play in the grand finale on Sunday at the Dubai International Cricket Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-528-26-09-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/shashi-tharoor-has-little-sympathy-for-idli-critics-his-poetic-reply-to-x-user-goes-viral-2794621-2025-09-28",
      "headline": "Shashi Tharoor has little sympathy for idli critics. His reply to X user goes viralShashi Tharoor used all poetic words when replying to an X user who said idli tastes like 'steamed regret.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/accenture-lays-off-11000-employees-warns-more-job-cuts-are-coming-due-to-ai-story-in-5-points-2794605-2025-09-28",
      "headline": "Accenture lays off 11,000 employees, warns more job cuts are coming due to AIAccenture cuts over 11,000 jobs in three months amid a major AI-focused restructuring. The move signals a shift towards automation but raises concerns about the future of human expertise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/maruti-suzuki-baleno-premium-hatchback-is-now-priced-under-rs-six-lakh-after-gst-reduction-2794705-2025-09-28",
      "headline": "This best-selling premium hatchback is now priced under Rs 6 lakhMaruti Suzuki has slashed prices of its best-selling premium hatchback, with the base variant now starting under Rs 6 lakh, making it more accessible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/prediabetes-rises-in-india-young-adults-early-detection-metformin-treatment-2794005-2025-09-28",
      "headline": "Why prediabetes should be treated with same urgency as diabetes in IndiaPrediabetes is becoming a major health challenge in India, especially among young adults. Early screening and preventive treatments like metformin could reduce future diabetes burden."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/security-stepped-up-at-vijays-chennai-home-after-deadly-karur-stampede-kills-39-people-tvk-vijay-rally-2794606-2025-09-28",
      "headline": "Security stepped up at Vijay's Chennai home after deadly Karur stampedeKarur District Police have filed FIRs against Anand, TVK's general secretary and second-in-command, and joint general secretary Nirmal Kumar following the Karur rally stampede that killed 39 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-boxer-mary-koms-faridabad-home-robbed-thieves-flee-with-tv-valuables-2794576-2025-09-28",
      "headline": "Video: Boxer Mary Kom's Faridabad home robbed, thieves flee with TV, valuablesCCTV footage from the night of the incident shows suspicious individuals carrying items, including a television set, and other valuables from the house. The footage is currently being reviewed by authorities."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/amita-sharma-appointed-womens-selection-panel-chairman-mithun-manhas-bcci-president-2794739-2025-09-28",
      "headline": "Amita Sharma, former India all-rounder, named women's selection panel chairman Amita Sharma has been appointed chairman of the women's selection panel, replacing Neetu David. Mithun Manhas takes over as BCCI president, signalling new leadership ahead of the Women's World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-historic-win-west-indies-maiden-t20i-series-rohit-paudel-martyrs-protests-2794714-2025-09-28",
      "headline": "NEP vs WI: Skipper Rohit Paudel dedicates Nepal's historic win to martyrs back home Nepal recorded its first-ever win against a Full ICC Member by defeating West Indies in the opening T20I. The victory offers hope amid national unrest following violent protests and social media restrictions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-asia-cup-2025-final-match-live-score-dubai-india-pakistan-2794706-2025-09-28",
      "headline": "IND vs PAK Live: India, Pakistan set for high-voltage finale India (IND) vs Pakistan (PAK) Live Score, Asia Cup Final Match: India take on Pakistan for the third time in this Asia Cup, and this time it is for the big prize in the final at the Dubai International stadium. Amidst all the controversies, fans are prepared for a big clash between the two arch-rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mithun-manhas-bcci-president-delhi-cricketer-india-2794694-2025-09-28",
      "headline": "Mithun Manhas, ex-Delhi cricketer, elected as new BCCI president Mithun Manhas has officially taken the helm of Indian cricket as the President of the Board of Control for Cricket in India (BCCI), following the conclusion of the Annual General Meeting (AGM) in Mumbai on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-political-gestures-cricket-focus-final-2794685-2025-09-28",
      "headline": "No drama, just cricket: India, Pakistan should focus on being competitive on the field Asia Cup 2025: The upcoming final needs to be a contest measured by the brand of cricket and not by the gestures made by the players, despite the heightened tensions between the two countries.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-final-india-pakistan-security-measures-dubai-2794677-2025-09-28",
      "headline": "No fireworks, flares: Dubai Police issues strict security measures for Asia Cup final The Asia Cup 2025 final between India and Pakistan will be held under strict security protocols in Dubai. Authorities aim to ensure safety amid recent regional tensions and high fan expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arundhati-reddy-injury-recovery-india-beat-new-zealand-warm-up-match-2794668-2025-09-28",
      "headline": "Arundhati Reddy recalls freak injury in England warm-up clash: Scared to even get up Women's World Cup, INDW vs NZW: Arundhati Reddy overcame a scary leg injury sustained against England, returning to take two crucial wickets against New Zealand with figures of 9-0-42-2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-female-led-commentary-panel-2025-womens-world-cup-india-sri-lanka-2794644-2025-09-28",
      "headline": "Dinesh Karthik, Mithali Raj in star-studded commentary panel The ICC has unveiled a star-studded, female-led commentary panel for the 2025 Women's World Cup, combining legendary players, former international stars, and seasoned broadcasters to deliver expert and engaging coverage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-india-captain-asia-cup-2025-pakistan-clash-pressure-2794508-2025-09-28",
      "headline": "IND vs PAK, Asia Cup Final : Pressure on Suryakumar Yadav to walk the talk India captain Suryakumar Yadav will have a huge task at hand to live up to his words in the Asia Cup 2025 final against Pakistan, after dismissing the rivalry between the two teams. His poor form will only add to the pressure as he sets out to win his first major T20I crown as a skipper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-final-india-vs-pakistan-sanju-samson-t20i-record-ms-dhoni-rishabh-pant-2794632-2025-09-28",
      "headline": "Samson can topple Dhoni and Pant in Asia Cup final despite limited chances Sanju Samson could make T20I history in the Asia Cup final against Pakistan. Despite limited chances, the wicketkeeper-batter is closing in on records set by MS Dhoni and Rishabh Pant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-final-cricket-rivalry-2794615-2025-09-28",
      "headline": "Can Pakistan ride on law of averages to ruffle high-flying India? Asia Cup Final, IND vs PAK: Pakistan have lost seven matches on the trot against India, and will look to end their losing streak when they play in the grand finale on Sunday at the Dubai International Cricket Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arundhati-reddy-injury-recovery-india-beat-new-zealand-warm-up-match-2794668-2025-09-28",
      "headline": "Arundhati Reddy recalls freak injury in England warm-up clash: Scared to even get up Women's World Cup, INDW vs NZW: Arundhati Reddy overcame a scary leg injury sustained against England, returning to take two crucial wickets against New Zealand with figures of 9-0-42-2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-female-led-commentary-panel-2025-womens-world-cup-india-sri-lanka-2794644-2025-09-28",
      "headline": "Dinesh Karthik, Mithali Raj in star-studded commentary panel The ICC has unveiled a star-studded, female-led commentary panel for the 2025 Women's World Cup, combining legendary players, former international stars, and seasoned broadcasters to deliver expert and engaging coverage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-india-captain-asia-cup-2025-pakistan-clash-pressure-2794508-2025-09-28",
      "headline": "IND vs PAK, Asia Cup Final : Pressure on Suryakumar Yadav to walk the talk India captain Suryakumar Yadav will have a huge task at hand to live up to his words in the Asia Cup 2025 final against Pakistan, after dismissing the rivalry between the two teams. His poor form will only add to the pressure as he sets out to win his first major T20I crown as a skipper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-final-india-vs-pakistan-sanju-samson-t20i-record-ms-dhoni-rishabh-pant-2794632-2025-09-28",
      "headline": "Samson can topple Dhoni and Pant in Asia Cup final despite limited chances Sanju Samson could make T20I history in the Asia Cup final against Pakistan. Despite limited chances, the wicketkeeper-batter is closing in on records set by MS Dhoni and Rishabh Pant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-final-cricket-rivalry-2794615-2025-09-28",
      "headline": "Can Pakistan ride on law of averages to ruffle high-flying India? Asia Cup Final, IND vs PAK: Pakistan have lost seven matches on the trot against India, and will look to end their losing streak when they play in the grand finale on Sunday at the Dubai International Cricket Stadium."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}