{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-european-union-leaders-visit-india-pivotal-push-for-landmark-india-eu-free-trade-agreement-2857391-2026-01-24",
      "headline": "Explained: Why EU leaders' India visit matters for the mega trade dealBy linking one of the world's fastest-growing major economies with a bloc that remains a central pillar of global trade, the deal would reshape supply-chain flows at a time when governments are rethinking their economic dependencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigos-10-flight-curbs-kick-in-centre-redistributes-slots-to-airlines-2857273-2026-01-24",
      "headline": "IndiGo's 10% flight curbs kick in, Centre redistributes slots to airlinesIndia's aviation sector is witnessing a strategic reshuffle as the government redistributes 10 per cent of IndiGo's flight operations to other domestic carriers. This phased approach aims to balance capacity while ensuring passenger convenience and connectivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/life-insurance-india-why-most-indians-are-underinsured-term-vs-endowment-explainer-how-to-choose-cover-2857105-2026-01-24",
      "headline": "Why most Indians are still underinsured despite buying insuranceSeveral insurer-backed studies show that a large share of Indian policyholders have life cover of less than five times their annual income. Most financial planners recommend at least 10 to 15 times annual income, and often more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/will-ai-kill-jobs-across-the-globe-and-how-can-india-ride-the-ai-wave-experts-weigh-in-2857006-2026-01-23",
      "headline": "Will AI kill jobs across the globe and how can India ride the AI wave? Experts weigh inIn this India Today special show from the World Economic Forum in Davos, top artificial intelligence innovators share their perspectives on the global AI race, AI's impact on the Indian economy and much more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/from-income-protection-to-easier-credit-what-gig-workers-expect-from-budget-2026-2856878-2026-01-23",
      "headline": "From income protection to easier credit: What gig workers expect from Budget 2026Delivery partners, drivers and freelancers form the backbone of India's fast-growing gig economy, yet financial security remains fragile for many. As Budget 2026 approaches, gig workers are hoping for measures that offer income protection, smoother credit access and faster support during emergencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-shines-at-record-highs-what-should-investors-do-now-2856796-2026-01-23",
      "headline": "Gold shines at record highs: What should investors do now?With gold touching new lifetime highs, the metal has once again proved its role as a refuge in uncertain times. But for investors, the rally raises a key question: what is the right move at current levels? Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-personal-loans-becoming-the-go-to-option-during-medical-emergencies-2856764-2026-01-23",
      "headline": "Are personal loans becoming the go-to option during medical emergencies?A sudden medical emergency can quickly turn into a financial crisis. With healthcare costs rising and insurance cover often falling short, many Indian families are increasingly turning to personal loans to bridge the gap."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-crash-2856763-2026-01-23",
      "headline": "Sensex sinks 770 points, Nifty tumbles as FII selling hits sentiment hardMarkets slipped sharply as foreign investor selling, sector-wide pressure and a weakening rupee crushed sentiment. With Nifty near a key support zone, the next few sessions could set the tone for February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-falling-sensex-down-750-points-nifty-tumble-reason-fii-selling-2856718-2026-01-23",
      "headline": "Sensex down nearly 800 points at closing: Why stock market fell todayAt the closing bell, the S&P BSE Sensex was down 769.67 points at 81,537.70 and the NSE Nifty50 slipped 241.25 points to 25,048.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-accuses-pwc-and-ey-executives-in-yes-banks-2022-share-sale-report-2856713-2026-01-23",
      "headline": "Sebi accuses PwC and EY executives in Yes Bank's 2022 share sale: ReportIn total, 19 individuals have been accused of insider trading violations. Seven are alleged to have traded using privileged information, while four are accused of sharing it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/can-budget-2026-help-make-insurance-more-affordable-for-indians-2856656-2026-01-23",
      "headline": "Can Budget 2026 help make insurance more affordable for Indians?With healthcare costs rising and insurance still out of reach for many, Budget 2026 is being closely watched by households and insurers alike. Industry leaders believe the right tax and policy moves could make insurance more affordable for millions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/french-president-emmanuel-macron-viral-davos-shades-give-ivision-tech-a-38-crore-stock-boost-2856639-2026-01-23",
      "headline": "French President's viral Davos shades give iVision Tech a 38 crore stock boostFrench President Emmanuel Macron's look during his World Economic Forum speech went viral online and the market reacted instantly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/from-easier-credit-to-insurance-what-msmes-want-from-union-budget-2026-2856627-2026-01-23",
      "headline": "From easier credit to insurance: What MSMEs want from Union Budget 2026As the Union Budget 2026 approaches, MSMEs are looking for practical support to ease everyday financial pressures. Industry leaders say better access to credit, lower insurance costs and simpler rules could help small businesses grow with confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/earning-50000-month-how-to-invest-smartly-build-portfolio-investment-plan-salary-2856594-2026-01-23",
      "headline": "Is Rs 50,000 salary enough to invest? Sebi advisor explains what actually worksFinancial advisors say this income level is enough to begin building a long-term portfolio, provided the focus remains on discipline, safety and clear financial goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indigo-share-price-today-why-indigo-stock-fell-after-q3-results-interglobe-aviation-buy-sell-hold-2856574-2026-01-23",
      "headline": "IndiGo share price down 4% after Q3 results: Buy, sell or hold?IndiGo share price: The stock slipped as much as 3.9% during early trade to hit an intraday low of Rs 4,723.60. It later recovered part of the losses but continued to trade in the red."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-prices-record-highs-should-investors-buy-sell-2856563-2026-01-23",
      "headline": "Gold and silver hit new highs again. Should you still buy?While the domestic trend remains sharply bullish, experts say understanding the broader backdrop can help investors think about why the rally is persisting and what it could mean for portfolios this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/infosys-hiring-plans-20000-graduates-in-fy27-as-ai-demand-surges-2856555-2026-01-23",
      "headline": "Infosys to hire 20,000 graduates in FY27 as AI demand surges: ReportInfosys is gearing up for heavier AI workloads in 2026 and beyond, and the scale of its campus hiring shows where the company believes client spending is beginning to stabilise and grow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-open-in-green-over-improved-global-cues-tcs-up-1-2856536-2026-01-23",
      "headline": "Sensex, Nifty open in green over improved global cues; TCS up 1%The S&P BSE Sensex was up by 77.47 points to 82,384.84, while the NSE Nifty50 added 31.95 points to 25,321.85 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-update-employee-bodies-meeting-salary-hike-demands-report-2856518-2026-01-23",
      "headline": "8th Pay Commission: Employee bodies to meet soon to finalise salary hike demandsThe meeting will be held under the banner of the National Council (Staff Side) of the Joint Consultative Machinery, which represents central government employees in discussions with the government. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/shadowfax-ipo-allotment-status-check-online-guide-gmp-listing-gains-bse-kfin-subscription-2856508-2026-01-23",
      "headline": "Shadowfax IPO allotment: Step-by-step guide to check status and listing gainsInvestors who applied for Shadowfax IPO can check their allotment status online through the Bombay Stock Exchange (BSE) website or the portal of KFin Technologies Limited, which is the official registrar for the issue."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/seema-sajdeh-opens-up-divorce-sohail-khan-life-single-mother-2857392-2026-01-24",
      "headline": "Seema Sajdeh breaks silence on Sohail Khan divorce: Better separated than fighting Seema Sajdeh reflected on her separation from Sohail Khan, outlining the circumstances of their divorce, its emotional impact on their family, and her journey towards practical independence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranbir-kapoor-realistic-transformation-animal-prosthetics-acting-mastery-2857383-2026-01-24",
      "headline": "Ranbir Kapoor's fat suit look in Animal still has fans doing a double take A recently resurfaced behind-the-scenes video showcases the intricate prosthetics work behind Ranbir Kapoor's physical transformation in the 2023 film Animal, highlighting the actor's evolving career and fans' reactions to his convincing appearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-fewer-opportunities-industry-driven-by-hits-not-communal-bias-ram-gopal-varma-2857351-2026-01-24",
      "headline": "Ram Gopal Varma shuts down AR Rahman's communal claim: Cinema runs on money Film director Ram Gopal Varma and singer Sona Mohapatra respond to AR Rahman's comments about communal bias in the Hindi film industry, stating that commercial viability remains the key driver of Bollywood's choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/athiya-shetty-kl-rahul-third-wedding-anniversary-heartfelt-social-media-posts-2857343-2026-01-24",
      "headline": "Soft launch of forever? Athiya Shetty's 'Happy Three' post melts the internet Bollywood actor Athiya Shetty and cricketer KL Rahul marked their third wedding anniversary by sharing heartfelt moments on Instagram, drawing warm reactions from fans, friends and family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-promotion-japan-allu-arjun-rashmika-mandanna-japanese-fan-fluent-telugu-2857318-2026-01-24",
      "headline": "Japanese fan speaks perfect Telugu, leaves Allu Arjun and Rashmika shocked During a promotional event for Pushpa 2: The Rule in Japan, actors Allu Arjun and Rashmika Mandanna were taken aback when a Japanese fan, Kazu, spoke fluent Telugu and praised their performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mouni-roy-harassment-incident-karnal-performer-safety-2857312-2026-01-24",
      "headline": "Disgusted and humiliated: Mouni Roy calls out stage harassment in Haryana Actor Mouni Roy has publicly detailed an incident of harassment she experienced at a recent event in Karnal, expressing her distress and urging authorities to respond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/linkin-park-debut-india-emily-armstrong-cultural-tribute-bengaluru-concert-2857257-2026-01-24",
      "headline": "Linkin Park's Emily Armstrong wears Assamese Gamusa during India debut. Watch Linkin Park's first India concert in Bengaluru saw new vocalist Emily Armstrong wearing a traditional Assamese gamusa during their performance of Faint, drawing significant attention online and prompting discussions about cultural appreciation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/yami-gautam-emraan-hashmi-haq-tops-netflix-charts-in-pakistan-and-nigeria-2857239-2026-01-24",
      "headline": "Yami Gautam, Emraan Hashmi's Haq tops Netflix charts in Pakistan and Nigeria Actors Yami Gautam and Emraan Hashmi's Haq has sparked significant discussion in Pakistan and Nigeria. Viewers and public figures in both countries are reacting strongly to its themes of faith, law, marriage, and women's rights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-king-release-date-announced-check-details-2857264-2026-01-24",
      "headline": "Shah Rukh Khan's King release date announced: Check details Shah Rukh Khan's upcoming film King is set for a December 2026 release. The Siddharth Anand directorial marks their much-anticipated reunion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mona-singh-heartfelt-performance-border-2-nationwide-appreciation-2857218-2026-01-24",
      "headline": "Mona Singh thanks fans as Border 2 earns strong audience praise Mona Singh has garnered significant appreciation following the release of Border 2, as audiences and critics highlight her impactful performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/battle-of-galwan-song-maatrubhoomi-salman-khan-strikes-a-patriotic-chord-2857194-2026-01-24",
      "headline": "Battle of Galwan song Maatrubhoomi: Salman Khan strikes a patriotic chord Maatrubhumi, the first song from the upcoming war drama Battle of Galwan, has been released ahead of Republic Day. Featuring Salman Khan, the track honours the nation and its soldiers. The song features vocals by Arijit Singh, Shreya Ghoshal and Master Mani Dharamkot"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikram-bhatt-daughter-krishna-booked-for-alleged-fraud-of-rs-135-crore-2857182-2026-01-24",
      "headline": "Filmmaker Vikram Bhatt, daughter booked for alleged fraud of Rs 13.5 crore A businessman has accused filmmaker Vikram Bhatt and his daughter, Krishna Bhatt, of defrauding him of Rs 13.5 crore through false promises of investment returns. The Economic Offences Wing has taken over the investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-post-midnight-show-surge-across-india-theatres-republic-day-weekend-report-2857170-2026-01-24",
      "headline": "From 7 am to 3 am, Border 2 drives round-the-clock screenings: Report The release of Border 2 sees theatre chains across India reportedly introducing post-midnight screenings. Some shows are running as late as 3 am, in response to high audience demand during the Republic Day weekend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rani-mukerji-faces-3-khans-on-kapil-sharma-show-ahead-of-mardaani-3-2857162-2026-01-24",
      "headline": "Rani Mukerji faces the '3 Khans' on Kapil Sharma show ahead of Mardaani 3. Watch Rani Mukerji is set to appear on The Great Indian Kapil Show to promote her upcoming film Mardaani 3. The episode will feature comedians Sunil Grover, Krushna Abhishek and Kiku Sharda impersonating the three Khans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-ravi-kishan-hit-the-gym-together-find-out-which-film-it-is-for-2857140-2026-01-24",
      "headline": "Anupam Kher, Ravi Kishan hit the gym together. Find out which film it's for Veteran actor Anupam Kher shared a glimpse of an intense workout with Ravi Kishan. The post is drawing attention online for both the actors' dedication to fitness and preparation for their upcoming film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/border-2-sonu-nigam-backs-sandese-aate-hain-return-amid-javed-akhtar-critique-2857121-2026-01-24",
      "headline": "Border 2: Sonu Nigam backs Sandese Aate Hain return amid Javed Akhtar critique Sonu Nigam has addressed Javed Akhtar's opposition to reworking old songs. Nigam, who re-created Sandese Aate Hain for Border 2 alongside other singers, acknowledged Akhtar's viewpoint while expressing the song's significance to the franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/new-talent-timeless-craft-malayalam-cinema-new-age-actors-and-their-legacy-2857056-2026-01-24",
      "headline": "New talent, timeless craft: Malayalam cinema's new-age actors and their legacy As Malayalam cinema expands its pan-Indian and global footprint, a new generation of actors is stepping into larger creative and commercial roles — balancing the industry's legacy of rooted storytelling with Gen-Z authenticity, genre experimentation and growing cross-industry ambition.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-box-office-collection-day-1-detailed-report-sunny-deol-film-beats-dhurandhar-chhaava-not-gadar-2-2857120-2026-01-24",
      "headline": "Border 2 box office Day 1: Sunny Deol film beats Dhurandhar, Chhaava; not Gadar 2 Sunny Deol's Border 2 opened on a solid note at the box office on Friday. While it surpassed the first day business of both Chhaava and Dhurandhar, it couldn't overshadow Sunny's previous blockbuster, Gadar 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mrunal-thakur-dhanush-viral-wedding-photo-chennai-ai-generated-fake-2857110-2026-01-24",
      "headline": "Mrunal Thakur- Dhanush viral wedding photo sparks buzz, but here's the truth A digitally created image of actors Mrunal Thakur and Dhanush at a wedding altar has gone viral. The photo has fuelled speculation about their marital status. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/federal-agents-kill-another-person-in-minneapolis-amid-immigration-crackdown-2nd-fatal-shooting-in-3-weeks-2857396-2026-01-24",
      "headline": "Federal agents kill another person in Minneapolis amid immigration crackdownThe shooting comes weeks after the fatal January 7 incident involving one Renee Good and has further inflamed tensions, with angry crowds confronting federal officers as authorities investigate the latest incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-partcipation-pcb-mohsin-naqvi-bangladesh-boycott-2857319-2026-01-24",
      "headline": "Pakistan to pull out of T20 World Cup? Mohsin Naqvi reponds to Bangladesh exitPCB chairman Mohsin Naqvi said that Pakistan's participation in the T20 World Cup will depend on the government's call. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-threatens-100-tariff-on-all-canadian-imports-over-potential-china-trade-deal-2857345-2026-01-24",
      "headline": "Trump threatens 100% tariff on all Canadian imports over potential China trade dealTrump directly targeted Canadian Prime Minister Mark Carney, saying he would not allow Canada to become a conduit for Chinese goods into the US."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/minneapolis-shooting-updates-us-news-governor-tim-walz-president-donald-trump-immigration-crackdown-2857410-2026-01-24",
      "headline": "Live: Minneapolis Mayor, Governor inciting insurrection, Trump on ICE-linked deathMinneapolis shooting updates: Minnesota Governor Tim Walz said federal agents shot and killed another person in Minneapolis on Saturday amid an intensified immigration enforcement operation, sharply criticising the Trump administration's actions. Walz, a Democrat, called the shooting \"sickening\" and urged an immediate end to the federal crackdown, demanding removal of what he described as \"violent, untrained officers.\" The incident in south Minneapolis occurred as daily protests continued after the controversial January 7 killing of Renee Good by an ICE officer. Federal authorities say the person shot had a firearm with two magazines; details remain limited as investigations proceed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-ipl-axe-bangladesh-t20-world-cup-exit-timeline-2857381-2026-01-24",
      "headline": "The chain of events that led Bangladesh out of T20 World Cup 2026From Mustafizur Rahman's IPL removal to Bangladesh's dramatic exit from the 2026 T20 World Cup, a political storm, security fears and ICC ultimatums reshaped the tournament in just three weeks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/minneapolis-police-say-victim-was-us-citizen-homeland-security-claims-man-carried-a-gun-2857408-2026-01-24",
      "headline": "Minneapolis police say shooting victim US citizen; feds claim man carried a gunMinneapolis police said the man shot during a federal operation was a 37-year-old city resident and US citizen who legally owned a firearm and had a permit to carry, while Homeland Security claimed he was carrying a gun at the time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/raipur-cbi-court-reverses-ex-cm-bhupesh-baghels-discharge-in-2017-chhattisgarh-sex-cd-case-2857352-2026-01-24",
      "headline": "CBI court reverses Bhupesh Baghel's discharge in 2017 Chhattisgarh sex CD caseA Special CBI Court in Raipur has reopened the 2017 obscene video case, setting aside a 2024 order that discharged former Chhattisgarh CM Bhupesh Baghel. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/gen-z-vs-millennials-corporate-world-culture-traditional-household-2856961-2026-01-24",
      "headline": "How Gen Z is challenging the hustle culture that Millennials normalisedHandcrafted ByOur Editors Gen Z is the chhoti bahu of the corporate world, setting boundaries, prioritising mental health, and refusing to glorify burnout. Millennials, the badi bahu of workplaces, quietly carried the weight of commitment and sacrifice, yet rarely received credit for it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-airport-car-crash-speeding-mercedes-crashed-into-airport-terminal-in-detroit-metro-terminal-6-hurt-2857359-2026-01-24",
      "headline": "Speeding Mercedes crashes into airport terminal in Detroit, 6 hurtA speeding car crashed into the McNamara Terminal at Detroit Metropolitan Wayne County Airport, injuring six people and causing panic among travellers. The driver was taken into custody while authorities investigate the cause of the incident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-bangladesh-tantrum-manufactured-crisis-icc-stand-india-trave-security-threat-2857133-2026-01-24",
      "headline": "Cowardice cosplaying as tantrum: Bangladesh's manufactured World Cup crisisBy weaponising fabricated security concerns to settle a political score, the BCB has traded its integrity for domestic applause, holding its own players hostage in a transparent act of geopolitical duplicity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-man-vijay-kumar-wife-relatives-shot-dead-killed-domestic-dispute-atlanta-georgia-us-shooting-mission-children-hid-closet-911-2857127-2026-01-24",
      "headline": "Indian man shoots wife, 3 relatives dead in US; children hid in closetThe shooter has been identified as Vijay Kumar, 51, and the victims are his wife, Meemu Dogra, 43, and their relatives Gourav Cumar, 33, Nidhi Chander, 37, and Harish Chander, 38."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/us-trump-tariff-on-india-treasury-secretary-scott-bessent-considers-rollback-25-percent-tariff-russian-oil-imports-2857161-2026-01-24",
      "headline": "US may roll back 25% India tariffs after Russian oil import cuts: Scott BessentUS Treasury Secretary Scott Bessent said the Trump administration may consider rolling back 25% of the 50% tariffs on India, citing a sharp decline in India's purchases of Russian oil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/have-you-seen-the-viral-nihilist-penguin-video-heres-why-the-internets-obsessing-over-it-2857310-2026-01-24",
      "headline": "Have you seen the viral Nihilist Penguin video? Here's why the internet is hookedA lone penguin's inland walk from a Werner Herzog documentary has now become a viral meme, as it symbolises modern emotional struggles and isolation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-announces-up-to-ps3-million-in-scholarships-empowering-future-global-leaders-2856640-2026-01-23",
      "headline": "University of Bath School of Management announces up to £3 million in scholarships, empowering future global leadersStrategic Scholarship Investment Aimed at Attracting Exceptional Talent Worldwide"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nobel-laureate-amartya-sen-bengal-sir-rushed-voter-exclusion-democracy-2857296-2026-01-24",
      "headline": "Muslims might face bias: Amartya Sen says 'rushed' Bengal SIR risks democracyNobel laureate Amartya Sen has warned that the Special Intensive Revision of electoral rolls in West Bengal is being conducted in undue haste.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/country-made-bombs-thrown-at-police-van-on-trichy-chennai-highway-eps-slams-dmk-govt-in-tamil-nadu-2857323-2026-01-24",
      "headline": "Bombs thrown at police van on Trichy-Chennai highway: EPS slams DMK govtFormer Tamil Nadu Chief Minister Edappadi K Palaniswami has highlighted a serious law and order issue following a bomb attack on a police vehicle, blaming the current government for police inefficiency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasa-lunar-regolith-earth-water-source-meteorites-apollo-artemis-findings-2857387-2026-01-24",
      "headline": "Where did Earth's water come from? Secret hidden on the MoonNasa researchers studying Apollo-era lunar soil discovered that meteorites from the Moon provided only a small fraction of Earth's water. This groundbreaking study challenges the popular theory that space rocks filled our vast oceans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/miami-university-a-top-us-destination-for-future-tech-and-engineering-leaders-2856701-2026-01-23",
      "headline": "Miami University: A Top U.S. Destination for Future Tech and Engineering LeadersMiami University Expands Opportunities for International Students Through Industry-Integrated Computer Science & Engineering Programs"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/news/weekly-quiz-563-23-01-2026",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-talks-why-hanging-up-spacesuit-nasa-retirement-moon-exclusive-india-today-interview-artemis-2857347-2026-01-24",
      "headline": "Sunita Williams talks about why she is hanging up her spacesuitExclusive: Sunita Williams tells India Today why she is retiring after 27 years as Nasa looks towards the Moon. She also opens up about her family connection to Orissa and her future on Earth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/new-talent-timeless-craft-malayalam-cinema-new-age-actors-and-their-legacy-2857056-2026-01-24",
      "headline": "New talent, timeless craft: Malayalam cinema's new-age actors and their legacyAs Malayalam cinema expands its pan-Indian and global footprint, a new generation of actors is stepping into larger creative and commercial roles — balancing the industry's legacy of rooted storytelling with Gen-Z authenticity, genre experimentation and growing cross-industry ambition.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-bangladesh-replaced-scotland-icc-bcb-bcci-jay-shah-2857224-2026-01-24",
      "headline": "Bangladesh officially out of T20 WC, ICC names Scotland as replacementThe ICC informed Bangladesh via a letter on Saturday, January 24 that they have been replaced by Scotland for the upcoming T20 World Cup 2026, according to sources. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-winter-storm-snow-ice-power-outages-united-states-rain-texas-flight-cancelled-texas-oklahoma-and-kansas-2857103-2026-01-24",
      "headline": "Monster winter storm sweeps US, over 9,000 flights cancelled over weekendA ferocious winter storm, unofficially dubbed Winter Storm Fern, is battering much of the United States with heavy snow, ice, sleet and extreme cold, prompting emergency declarations in at least 18 states and Washington, DC. Ice accumulations and sub-zero temperatures threaten power outages, dangerous travel, and prolonged storm impacts well into next week. Authorities have mobilised emergency response teams and resources as communities brace for widespread disruption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mouni-roy-harassment-incident-karnal-performer-safety-2857312-2026-01-24",
      "headline": "Disgusted and humiliated: Mouni Roy calls out stage harassment in HaryanaActor Mouni Roy has publicly detailed an incident of harassment she experienced at a recent event in Karnal, expressing her distress and urging authorities to respond."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-day-8-updates-aryna-sabalenka-carlos-alcaraz-coco-gauff-melbourne-2857419-2026-01-25",
      "headline": "Australian Open 2026, Day 8 Live: Aryna Sabalenka, Carlos Alcaraz set to be in action Australian Open 2026 Live: We enter the round of 16 with Aryna Sabalenka, Carlos Alcaraz, Coco Gauff and Alex de Minaur all in action as quarter-final spots are up for grabs in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-bcb-central-contract-comeback-retirement-plan-2857413-2026-01-25",
      "headline": "Bangladesh cricket board open door for Shakib Al Hasan's comeback BCB have retained Shakib Al Hasan in their central contract list and reopened the door for his international return, as the veteran all-rounder reveals plans to retire at home after one final series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-england-beat-sri-lanka-level-odi-series-colombo-2857415-2026-01-24",
      "headline": "SL vs ENG: All-round Joe Root brilliance helps England draw series level Joe Root starred with bat and ball as England beat Sri Lanka by five wickets in Colombo to level the ODI series ahead of the decider."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20-world-cup-boycott-government-call-bcb-director-2857409-2026-01-24",
      "headline": "Bangladesh's T20 WC boycott a government call, we wanted to play: Board director Bangladesh's T20 World Cup boycott was a government call, according to board director Amjad Hossain. The BCB official said that Bangladesh did want to be a part of the tournament but had to abide by the directive from the government. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-unbeaten-run-ends-horror-show-vs-delhi-capitals-wpl-2026-2857406-2026-01-24",
      "headline": "Royal Challengers Bengaluru's unbeaten run ends after horror-show vs Delhi Capitals Royal Challengers Bengaluru's five-match winning streak ended in stunning fashion as Delhi Capitals produced a dominant bowling display and chased down a modest target to seal a crushing WPL victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-3rd-t20i-predicted-xi-ishan-kishan-sanju-samson-opener-experiment-axar-patel-2857397-2026-01-24",
      "headline": "IND vs NZ, 3rd T20I Predicted XI: Will India experiment with Ishan Kishan as opener? IND vs NZ, 3rd T20I Predicted XI: Ishan Kishan's blistering knock has reopened India's opener debate ahead of the third T20I against New Zealand. Will Gautam Gambhir persist with Sanju Samson or make a late experiment at the top?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-pakistan-replacement-team-if-pull-out-uganda-bangladesh-2857399-2026-01-24",
      "headline": "Who replaces Pakistan if they boycott T20 World Cup 2026 like Bangladesh? Following Bangladesh's boycott of the T20 World Cup 2026, Pakistan's participation in the tournament remains under a cloud. Bangladesh were replaced by Scotland on Saturday, January 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-ipl-axe-bangladesh-t20-world-cup-exit-timeline-2857381-2026-01-24",
      "headline": "The chain of events that led Bangladesh out of T20 World Cup 2026 From Mustafizur Rahman's IPL removal to Bangladesh's dramatic exit from the 2026 T20 World Cup, a political storm, security fears and ICC ultimatums reshaped the tournament in just three weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishtiaque-sadeque-resigns-bangladesh-cricket-board-t20-world-cup-controversy-2857378-2026-01-24",
      "headline": "After Bangladesh's ugly T20 World Cup snub, BCB director steps down On the very day when Bangladesh were left out of the T20 World Cup with Scotland replacing them for the tournament, BCB director Ishtiaque Sadeque stepped down as the director. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-apologises-ballgirl-strike-incident-australian-open-2026-2857358-2026-01-24",
      "headline": "Novak Djokovic apologises for ballgirl incident: Sorry for causing any distress Novak Djokovic apologised after a frustrated shot narrowly missed a ballgirl during his Australian Open third-round win, escaping punishment despite echoes of his 2020 US Open default."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/why-icc-replaced-bangladesh-with-scotland-t20-world-cup-2026-2857346-2026-01-24",
      "headline": "Why Bangladesh was replaced by Scotland in T20 World Cup? ICC explains decision The International Cricket Council (ICC) explained the reasons behind their call to replace Bangladesh from the T20 World Cup 2026 and name Scotland as their replacement on Saturday, January 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ayush-mhatre-leads-india-unbeaten-u19-world-cup-group-stage-win-new-zealand-2857342-2026-01-24",
      "headline": "Ayush Mhatre returns to form as dominant India U19 storm into Super 6 unbeatenU19 World Cup, IND vs NZ: India beat New Zealand by seven wickets via DLS after chasing down a revised target of 130 in 13.3 overs. They also ended the league stage unbeaten with wins in all three games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pratika-rawal-injury-comeback-india-test-squad-australia-tour-2857332-2026-01-24",
      "headline": "Baby steps: Out with injury, Pratika Rawal grinds it out in gym after Test call-upPratika Rawal shared a video of herself training intensively in the gym as she prepares for her international comeback, following her selection for India's upcoming Test against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-partcipation-pcb-mohsin-naqvi-bangladesh-boycott-2857319-2026-01-24",
      "headline": "Pakistan to pull out of T20 World Cup? Mohsin Naqvi reponds to Bangladesh exitPCB chairman Mohsin Naqvi said that Pakistan's participation in the T20 World Cup will depend on the government's call. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-australian-open-ball-incident-incident-punishment-2857288-2026-01-24",
      "headline": "Novak Djokovic escapes punishment after shot in anger nearly hits ballgirl: WatchNovak Djokovic escaped sanction after a ball struck in frustration narrowly missed a ballgirl during his third-round win at the Australian Open, before he went on to seal victory and a historic 400th Grand Slam match win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-coaching-philosophy-pretoria-capitals-sa20-final-2857284-2026-01-24",
      "headline": "Sourav Ganguly's coaching mantra: A friend, a mentor and something moreAhead of the SA20 final, Sourav Ganguly offers rare insight into his coaching philosophy and why being a guide matters more than being in charge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/stan-wawrinka-ends-australian-open-journey-milestone-third-round-40-2857251-2026-01-24",
      "headline": "Wawrinka goes full Stone Cold Steve Austin, exits AUS Open with beer toastStan Wawrinka marked his final Australian Open appearance with a heartfelt farewell, and enjoyed a beer toast in Melbourne as he made his exit from the tournament. Wawrinka played his final match against Taylor Fritz.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-iga-swaiatek-australian-open-anna-kalinskaya-2857258-2026-01-24",
      "headline": "Djokovic rewrites history with 400 Grand Slam wins, Swiatek survives huge scareAustralian Open: Former World No.1 Novak Djokovic stormed into the fourth round at Melbourne Park after beating Botic van de Zandschulp of the Netherlands 6-3, 6-4, 7-6 (4) at the Rod Laver Arena."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-bangladesh-replaced-scotland-icc-bcb-bcci-jay-shah-2857224-2026-01-24",
      "headline": "Bangladesh officially out of T20 WC, ICC names Scotland as replacementThe ICC informed Bangladesh via a letter on Saturday, January 24 that they have been replaced by Scotland for the upcoming T20 World Cup 2026, according to sources. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/najam-sethi-urges-support-for-bangladesh-icc-bias-t20-world-cup-2026-pull-out-2857211-2026-01-24",
      "headline": "If ICC members support BAN, it won't be Indian Cricket Council: Ex PCB chiefFormer PCB chairman Najam Sethi urges cricketing nations to support Bangladesh amid concerns about the ICC's alleged bias towards India. Bangladesh have pulled out of the T20 World Cup 2026, citing security concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-ms-dhoni-nets-session-viral-video-jharkhand-chennai-super-kings-preperation-2857212-2026-01-24",
      "headline": "MS Dhoni begins IPL 2026 preparations? CSK icon's Jharkhand nets video goes viralMS Dhoni has sparked fresh IPL 2026 buzz after a Jharkhand nets video went viral. Wearing yellow pads, the CSK icon's early return to batting has fans dreaming of one final title push."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/naomi-osaka-withdraws-australian-open-health-concerns-walkover-2857210-2026-01-24",
      "headline": "Heartbroken Naomi Osaka pulls out midway from Australian Open: Can't risk more damageNaomi Osaka withdrew from the Australian Open before her third-round match against Maddison Inglis, ending her campaign early to focus on recovery. Maddison Inglis, on the other hand, advanced to the Round of 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-ishan-kishan-ashwin-amazed-reaction-fearless-mindset-2857196-2026-01-24",
      "headline": "Ishan Kishan's fearless mindset sets him apart: Ashwin amazed by batter's Raipur blitzR Ashwin was left amazed by Ishan Kishan's Raipur blitz against New Zealand. The former India spinner praised Kishan's fearless mindset, forged in domestic cricket, as the quality that truly separates him from the rest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricket-boycott-concerns-najmul-hossain-shanto-call-for-stability-2857193-2026-01-24",
      "headline": "Bangladesh Test captain urges BCB to save cricket after T20 World Cup boycottBangladesh Test captain Najmul Hossain Shanto has called on the Bangladesh Cricket Board to take decisive action to protect the future of the sport amid ongoing uncertainty over participation in the T20 World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-suryakumar-yadav-credits-wife-advice-comeback-knock-raipur-t20i-2857191-2026-01-24",
      "headline": "Suryakumar Yadav credits wife Devisha Shetty's advice for Raipur T20I comeback knockIND vs NZ: Suryakumar Yadav's return to form in Raipur had a personal touch behind it. The India captain credited his wife's advice for slowing down, regaining confidence, and powering a match-winning knock against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pratika-rawal-vaishnavi-sharma-kranti-gaud-india-test-squad-australia-tour-2857169-2026-01-24",
      "headline": "Pratika Rawal, Vaishnavi Sharma and Kranti earn maiden Test call up for Australia tourPratika Rawal has earned her maiden Test call-up as India prepare for the one-off game against Australia in Perth. India will tour Australia for three T20Is and as many ODIs along with one Test, with the tour set to begin on February 15 in Sydney with T20I series."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricket-boycott-t20-world-cup-2026-security-icc-dispute-syed-ashraful-haque-2857157-2026-01-24",
      "headline": "Bangladesh will now be seen as potential troublemaker in cricket: Ex BCB secretaryFormer Bangladesh Cricket Board (BCB) general secretary Syed Ashraful Haque has slammed the current board administration for pulling out of the T20 World Cup 2026 in India. He fears Bangladesh will now be seen as a troublemaker in world cricket and have put their future in jeopardy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-jannik-sinner-heat-stop-controversy-vs-eliot-spizzirri-angry-fans-reaction-2857158-2026-01-24",
      "headline": "Sinner heat break controversy: He didn't win, Aus Open won it for him, say angry fansJannik Sinner's heat-hit escape against Eliot Spizzirri has divided opinion at the Australian Open. Fans raged as a mid-match heat stoppage flipped momentum and helped the defending champion survive into Round 4."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-bangladesh-tantrum-manufactured-crisis-icc-stand-india-trave-security-threat-2857133-2026-01-24",
      "headline": "Cowardice cosplaying as tantrum: Bangladesh's manufactured World Cup crisisBy weaponising fabricated security concerns to settle a political score, the BCB has traded its integrity for domestic applause, holding its own players hostage in a transparent act of geopolitical duplicity."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}