{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-swiggy-customer-data-restaurants-controversy-privacy-concerns-2823623-2025-11-21",
      "headline": "Recipe for trouble? Zomato's customer data move stirs up controversyZomato customer data: Food delivery giant Zomato has decided to start sharing customer data with restaurants. Politicians and marketing gurus have called it a recipe for trouble, expressing concerns about data privacy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/reliance-industries-halts-russian-oil-imports-at-jamnagar-refinery-amid-sanctions-ytvd-2823600-2025-11-21",
      "headline": "Russian Oil: Reliance Halts Russian Crude Imports at Jamnagar SEZ RefineryThis report covers Reliance Industries' decision to halt the import of Russian crude oil for its export-oriented refinery in Jamnagar, Gujarat. The move is in compliance with European Union and United States sanctions targeting Russian oil majors Rosneft and Lukoil, with a wind-down period ending November 21. Reliance stated, 'we'll stay aligned with government's policy.' The company will now source crude from other regions, including West Asia and the EU, for its Special Economic Zone (SEZ) refinery, with all exports to be derived from non-Russian oil starting December 1. The decision impacts a long-term deal between Reliance and Rosneft for the supply of crude oil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jp-power-share-price-falls-after-rally-profit-taking-2823589-2025-11-21",
      "headline": "JP Power share price tumbles 7% after strong rally. Why is it down today?The JP Power share price dip reflects profit-taking after a steep run, as the market waits for clearer evidence that the broader group's restructuring will lift the company's long-term fortunes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-share-price-rises-after-two-day-fall-q2-results-why-billionbrains-stock-up-2823581-2025-11-21",
      "headline": "Groww shares jump nearly 7% after two-day tumble: What's driving today's rally?Around 10:03 am, the shares of the company were trading 6.30% higher at Rs 166.44 on the Bombay Stock Exchange (BSE). The rebound comes amid growing anticipation around Groww's performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-200-points-nifty-below-26200-hindalco-down-nearly-3-2823559-2025-11-21",
      "headline": "Sensex, Nifty fall in early trade as hopes of US rate cut fadeAround 9:23 am, the S&P BSE Sensex was down 131 points at 85,501.03, while the NSE Nifty50 slipped 40.70 points to 26,151.45. Volatility was high in early trade and all major sectoral indices were in the red, reflecting the cautious mood on Dalal Street."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-halts-russian-crude-jamnagar-sez-refinery-eu-sanctions-glbs-2823492-2025-11-21",
      "headline": "Reliance ends use of Russian crude for exports to comply with EU sanctionsReliance's decision shows how quickly the global rules around Russian oil are changing, and how Indian refiners are now being pushed to realign their supply chains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-group-says-ed-attached-assets-belong-to-rcom-not-part-of-group-since-2019-2823468-2025-11-20",
      "headline": "Reliance Group says ED-attached assets belong to RCom, not part of group since 2019The ED, meanwhile, detailed its searches across Tamil Nadu in a land-forgery and inflated compensation scam involving forged deeds, dummy buyers and layered transactions, seizing and freezing assets worth Rs 18.10 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/when-will-you-get-itr-refund-december-2025-cbdt-chairman-ravi-agrawal-delay-reason-2823254-2025-11-20",
      "headline": "Waiting for your tax refund? Here's why it's delayed and when it may arriveAccording to the Income Tax Department, more than 7.57 crore returns were filed by September 23, yet refunds for many taxpayers remain pending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-nearly-450-points-higher-nifty-nears-life-time-high-2823139-2025-11-20",
      "headline": "Sensex ends nearly 450 points higher, Nifty nears life-time highThe S&P BSE Sensex rose 446.21 points to close at 85,632.68, while the NSE Nifty50 climbed 139.50 points to finish at 26,192.15. Broader indices were mixed, but the tone across frontline stocks remained firmly positive, led by gains in heavyweight financial counters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-surges-500-points-nifty-nears-life-time-high-whats-driving-the-rally-2823064-2025-11-20",
      "headline": "Sensex surges 500 points, Nifty nears life-time high. What's driving the rally?At 1.58 am, the S&P BSE Sensex was up 526.63 points to 85,713.10, while the NSE Nifty50 hit a fresh 52-week high and was nearing an all-time high of 26,277. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-share-price-falls-for-second-day-tumbles-10-post-listing-rally-over-2823020-2025-11-20",
      "headline": "Groww share price falls 10% again: Is the post-listing rally over?Around 1:12 pm, shares of the company were trading 9.18% lower at Rs 154.30. Over the last two sessions, the stock has slipped nearly 18%, a sharp reversal that has investors wondering whether the post-listing rally has already run its course."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/leading-e-commerce-platforms-say-they-now-comply-with-anti-dark-pattern-rules-2823001-2025-11-20",
      "headline": "Leading e-commerce platforms say they now comply with anti–dark pattern rulesAmong the 26 companies listed by the CCPA are well-known names such as Flipkart, Myntra, Zomato, Swiggy, Meesho, BigBasket, JioMart and others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/the-new-trade-playbook-why-the-world-needs-a-more-distributed-system-2822970-2025-11-20",
      "headline": "The new trade playbook: Why the world needs a more distributed systemThese shifts are not driven by a single factor but by the combined influence of policy changes, supply chain lessons from recent years, and the evolving priorities of businesses and governments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sip-for-beginners-rs-5000-monthly-investment-tips-how-to-make-1-crore-stock-market-investing-2822963-2025-11-20",
      "headline": "Investing Rs 5,000 every month in SIPs? This is when you can hit Rs 1 crorePeople know SIPs are useful, they hear stories of long-term gains, and they see friends investing every month, but when it comes to choosing where to put a small amount like Rs 5,000, most feel lost."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ed-attaches-anil-ambani-linked-assets-worth-rs-1400-crore-total-nears-rs-9000-crore-2822929-2025-11-20",
      "headline": "ED attaches Anil Ambani-linked assets worth Rs 1,400 crore; total nears Rs 9,000 croreThe latest attachment has been made under the Prevention of Money Laundering Act (PMLA). The properties are located across Navi Mumbai, Chennai, Pune and Bhubaneswar, the sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/considering-personal-loan-for-holiday-travel-ask-these-5-questions-first-2822904-2025-11-20",
      "headline": "Considering a personal loan for holiday travel? Ask these 5 questions firstFunding that year-end getaway through an instant personal loan might seem like a savvy move, but it is important to assess the need thoroughly. An impulsive decision may be overshadowing some important financial realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jp-powers-share-price-zooms-10-today-why-is-it-rising-today-2822883-2025-11-20",
      "headline": "JP Power share price zooms 10%. Why is it rising today?JP Power, which was trading at Rs 22.37, gained over 10% in early trade as investors reacted to clarity on the future of the JP Group's stressed assets. JAL, the former promoter entity, holds close to 24% stake in JP Power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-shares-falling-today-why-reason-down-8-percent-two-day-slide-billionbrains-stock-lower-circuit-2822879-2025-11-20",
      "headline": "Groww shares down 8% again: Why Billionbrains stock is falling todayGroww has been under pressure for two consecutive days. On Wednesday, the stock had already slipped around 10%. This comes after the company made a strong market debut, listing at Rs 112, about 12% higher than its issue price of Rs 100."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-150-points-nifty-crosses-26000-adani-enterprises-gains-1-2822865-2025-11-20",
      "headline": "Sensex rises over 150 points, Nifty crosses 26,000; Groww shares tumble 7%The S&P BSE Sensex climbed over 150 points in early trade, while the NSE Nifty50 moved past the 26,000 mark, signalling a mildly bullish undertone across the market. Broader indices also edged higher, mirroring gains in frontline stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/missed-emi-loan-harassment-digital-lending-expert-panel-india-2822580-2025-11-19",
      "headline": "When missed EMIs become a nightmare: Inside India's loan harassment trapBehind India's digital lending rise is a quieter story of calls, pressure and fear. Data suggests that loan recovery harassment is growing at a pace the system can no longer keep up with."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/delhi-high-court-permits-120-bahadur-release-with-ahir-soldiers-names-2823668-2025-11-21",
      "headline": "Watch 120 Bahadur before seeking changes, Delhi High Court tells petitioners The Delhi High Court has allowed the release of the film '120 Bahadur' despite objections from the Sanyukt Ahir Regiment Morcha. The court ruled it was too late to change the movie title but ensured the names of all 120 Ahir soldiers appear in the credits, allowing corrections for the OTT release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/do-deewane-seher-mein-first-look-siddhant-chaturvedi-mrunal-thakur-bring-soulful-old-school-romance-2823663-2025-11-21",
      "headline": "Do Deewane Seher Mein: Siddhant–Mrunal bring soulful, old-school romance 'Do Deewane Seher Mein' unveils its dreamy first look, introducing Siddhant Chaturvedi and Mrunal Thakur in a soulful love story backed by Sanjay Leela Bhansali. The film promises a warm, nostalgic romance ahead of its February 2026 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/de-de-pyaar-de-2-box-office-ajay-rakul-film-wraps-week-1-with-rs-57-crore-2823626-2025-11-21",
      "headline": "De De Pyaar De 2 box office: Ajay-Rakul's film wraps week 1 with Rs 57 crore The romantic-comedy 'De De Pyaar De 2', featuring Ajay Devgn and Rakul Preet Singh, earned Rs 57.78 crore in its first week, maintaining remarkable consistency through the weekdays. The film theatrically released on November 14, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-solo-concert-film-runseokjin-tour-the-movie-december-release-2823645-2025-11-21",
      "headline": "BTS' Jin to bring his first solo concert film to theatres this December BTS' oldest member Jin will premiere his first solo concert film worldwide this December. The film celebrates his solo tour and offers fans an immersive, interactive experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/120-bahadur-film-screening-rezang-la-war-memorial-ladakh-farhan-akhtar-2823629-2025-11-21",
      "headline": "120 Bahadur makes history with first-ever screening at Rezang La War Memorial '120 Bahadur' makes history with the first-ever film screening at Rezang La War Memorial in Ladakh. The event honours the bravery of soldiers from the 1962 Sino-Indian War and brings the story closer to troops stationed in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rais-touching-tribute-to-late-father-celebrates-love-across-generations-2823635-2025-11-21",
      "headline": "Aishwarya Rai's touching tribute to late father celebrates love across generations Aishwarya Rai Bachchan marked her late father Krishnaraj Rai's birthday by sharing family photos and a heartfelt note, highlighting the close bond between the generations. Her daughter, Aaradhya Bachchan, is also seen in the photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ali-fazal-shares-bts-pics-as-mirzapurthe-film-cast-shoots-in-rajasthan-2823620-2025-11-21",
      "headline": "Ali Fazal shares BTS pics as Mirzapur: The Film cast shoots in Rajasthan Ali Fazal shared cheerful behind-the-scenes photos from the sets of 'Mirzapur: The Film', featuring Pankaj Tripathi, Divyenndu, Abhishek Banerjee and new cast member Jitendra Kumar. The actor also teased the film's theatrical arrival while cheering for the latest release '120 Bahadur'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaaras-ahaan-panday-denies-dating-aneet-padda-but-says-their-bond-is-special-2823605-2025-11-21",
      "headline": "Ahaan Panday dating Aneet Padda? Read what Saiyaara hero said on rumours Ahaan Panday reacts to dating rumours with his 'Saiyaara' co-star Aneet Padda. He called her his \"best friend\", and shared that the success of their film was a collective dream they manifested. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mona-singh-ai-impact-ott-films-creativity-human-connection-2823592-2025-11-21",
      "headline": "Exclusive: Mona Singh on why AI won't upend OTT and films Mona Singh shares why AI won't disrupt OTT and film storytelling. She emphasises that creativity and human connection remain central despite technological changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/wicked-for-good-review-cynthia-erivo-ariana-grande-visuals-slow-screenplay-2823547-2025-11-21",
      "headline": "Wicked For Good review: Cynthia Erivo-Ariana film's gorgeous but emotionally flatRelease Date:Fri Nov 21, 2025 Wicked: For Good arrives as a visually stunning but emotionally uneven finale. The film's heavy tone and slow pace challenge audience engagement despite strong performances. Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-talks-about-anxiety-amid-cancer-treatment-2823552-2025-11-21",
      "headline": "My heart can't hold it all: Dipika Kakar talks about anxiety amid cancer treatment Dipika Kakar opened up in an emotional vlog about her ongoing liver cancer diagnosis, revealing that despite normal reports, she continues to battle anxiety and physical challenges every day. The actress urged others facing similar struggles to stay strong, keep moving forward, and trust in God."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kalamkaval-release-postponed-mammootty-starrer-malayalam-film-delay-2823535-2025-11-21",
      "headline": "Mammootty's Kalamkaval postponed, new release date to be announced soon The release of Mammootty's film 'Kalamkaval', initially set for November 27, has been postponed with a revised date pending announcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/divya-khosla-kumar-shares-call-recording-with-mukesh-bhatt-amid-savi-jigra-feud-2823527-2025-11-21",
      "headline": "Divya Khosla Kumar shares call recording with Mukesh Bhatt amid Savi–Jigra feud Divya Khosla Kumar has released a phone call recording with Mukesh Bhatt, where the filmmaker denies ever accusing her of creating the 'Savi' vs 'Jigra' controversy for publicity. The actor said she is \"deeply shocked\" and calls out alleged lobbying, hierarchy and \"industry mafia\" within Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-kane-williamson-air-hockey-dubai-watch-week-2023-2823514-2025-11-21",
      "headline": "Dhanush and cricketer Kane Williamson play air hockey at Dubai Watch Week. Video Actor Dhanush and cricketer Kane Williamson met and played air hockey at Dubai Watch Week. Their light-hearted interaction has caught attention on social media, highlighting the event's star appeal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/got-a-knight-of-the-seven-kingdoms-gets-renewed-for-season-2-ahead-of-premiere-2823504-2025-11-21",
      "headline": "GoT's A Knight of the Seven Kingdoms renewed for Season 2 ahead of premiere HBO has renewed 'A Knight of the Seven Kingdoms' for a second season ahead of its January 2026 premiere, strengthening the expanding 'Game of Thrones' universe. The prequel, based on George R.R. Martin's 'Tales of Dunk and Egg', will return in 2027 alongside continued developments in 'House of the Dragon'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hridayapoorvam-mohanlal-subtle-acting-heartwarming-malayalam-drama-2823009-2025-11-21",
      "headline": "The simplicity of Hridayapoorvam and Mohanlal's subtle yet moving act 'Hridayapoorvam' showcases Mohanlal's subtle and natural performance in a simple family drama. The film's gentle storytelling offers a refreshing change from typical high-octane actioners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ariana-grande-tests-covid-19-positive-amid-busy-wicked-for-good-promotions-2823498-2025-11-21",
      "headline": "Ariana Grande tests Covid-19 positive amid busy Wicked: For Good promotions Ariana Grande shared she tested positive for Covid-19, forcing her to cancel upcoming press appearances as the 'Wicked: For Good' promotional tour nears its end. The announcement follows a series of setbacks during the film's press run, including travel issues, health concerns and a red-carpet security breach."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chase-stokes-breaks-silence-on-kelsea-ballerini-split-with-cryptic-instagram-posts-2823494-2025-11-21",
      "headline": "Chase Stokes breaks silence on Kelsea Ballerini split with cryptic Instagram posts Chase Stokes appeared to address reports of his breakup with Kelsea Ballerini through cryptic Instagram Stories, marking his first major reaction since their split surfaced in September. His posts reignited speculation about the couple's status, especially after recent sightings of them together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-family-man-season-3-review-manoj-bajpayee-jaideep-ahlawat-nimrat-kaur-raj-and-dk-2823429-2025-11-21",
      "headline": "The Family Man 3 review: Manoj Bajpayee's spy saga gets personal and more dangerousRelease Date:Fri Nov 21, 2025 The Family Man Season 3 review: Prime Video's 'The Family Man' returns with Season 3, exploring Northeast India's complex geopolitics and new security threats. Manoj Bajpayee's portrayal of Srikant Tiwari remains compelling as the stakes rise with new threats and darker challenges ahead."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-schools-ordered-to-halt-outdoor-activities-due-to-air-pollution-after-supreme-court-directive-2823634-2025-11-21",
      "headline": "Delhi bans outdoor activities in schools amid worsening air pollutionDelhi schools have been ordered to halt outdoor activities as the air quality deteriorated further to the 'severe' category. The government order came following a Supreme Court directive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-swiggy-customer-data-restaurants-controversy-privacy-concerns-2823623-2025-11-21",
      "headline": "Recipe for trouble? Zomato's customer data move stirs up controversyZomato customer data: Food delivery giant Zomato has decided to start sharing customer data with restaurants. Politicians and marketing gurus have called it a recipe for trouble, expressing concerns about data privacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/john-kiriakou-cia-pakistan-pti-party-imran-khan-letter-apology-toilet-paper-reply-operation-sindoor-india-superior-war-2823622-2025-11-21",
      "headline": "Told Pakistanis will use letter to wipe my a**: Ex-CIA analyst on India war winFormer CIA officer John Kiriakou has revealed that the President of former PM Imran Khan's PTI tried to strong-arm him into apologising for saying that India would decisively win a conventional war against Pakistan. Kiriakou said he replied by telling the PTI President that he'd use the letter demanding an apology as a toilet paper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/unspoken-costs-unwritten-complaints-the-silent-crisis-in-delhi-university-hiring-teacher-recruitment-2823181-2025-11-21",
      "headline": "Rs 50 lakh for a teaching post? The quiet questions around DU hiringTeachers who were shut out of Delhi University's hiring cycle say they were nudged toward \"informal payments\" to the tune of a few lakh rupees. Claims they hesitate to formalise for lack of proof. Such stories float in the margins of interviews and exam prep groups, forming a shadow narrative around recruitment. This is a crisis built not on paperwork, but on murmurs"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-family-man-season-3-review-manoj-bajpayee-jaideep-ahlawat-nimrat-kaur-raj-and-dk-2823429-2025-11-21",
      "headline": "The Family Man 3 review: Manoj Bajpayee's spy saga gets personal and more dangerousRelease Date:Fri Nov 21, 2025The Family Man Season 3 review: Prime Video's 'The Family Man' returns with Season 3, exploring Northeast India's complex geopolitics and new security threats. Manoj Bajpayee's portrayal of Srikant Tiwari remains compelling as the stakes rise with new threats and darker challenges ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/earthquake-reported-in-bangladesh-tremors-felt-in-kolkata-2823596-2025-11-21",
      "headline": "Tremors in Kolkata, Northeast India after 5.5 magnitude earthquake near DhakaTremors were felt in Kolkata and other parts of Northeast India after a 5.5 magnitude earthquake struck Bangladesh. No reports of damage or injuries have been reported."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cbse-notice-jaipur-school-bullying-class-5-student-suicide-2823637-2025-11-21",
      "headline": "Jaipur girl bullied with 'bad words' before suicide, teachers ignored pleas: ProbeA CBSE probe has found that Neerja Modi School ignored 18 months of bullying complaints from a Class 4 student who later died by suicide, prompting the board to issue a notice to the school for gross violations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-jr-visits-ambanis-vantara-wildlife-centre-in-gujarats-jamnagar-glbs-2823495-2025-11-21",
      "headline": "Video: Trump Jr plays dandiya during Gujarat temple tour on Ambani family's inviteDonald Trump Jr visited Anant Ambani's Vantara wildlife centre in Jamnagar after a stop at the Taj Mahal, touring the facility before heading to Udaipur for a wedding."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/will-be-declared-fugitive-why-nobel-peace-winner-maria-corina-machado-cant-receive-prize-in-person-trump-mudro-2823689-2025-11-21",
      "headline": "Will be declared fugitive: Why Nobel winner Machado can't receive prize in personNobel laureate Maria Corina Machado would be branded a \"fugitive\" if she travelled to Norway to receive her peace prize on December 10. That's due to multiple criminal cases registered against the Venezuelan Opposition leader, the Latin American country's Attorney General said. Last week Machado expressed her desire to go to Norway to receive the prestigious award.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/delhi-high-court-permits-120-bahadur-release-with-ahir-soldiers-names-2823668-2025-11-21",
      "headline": "Watch 120 Bahadur before seeking changes, Delhi High Court tells petitionersThe Delhi High Court has allowed the release of the film '120 Bahadur' despite objections from the Sanyukt Ahir Regiment Morcha. The court ruled it was too late to change the movie title but ensured the names of all 120 Ahir soldiers appear in the credits, allowing corrections for the OTT release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rais-touching-tribute-to-late-father-celebrates-love-across-generations-2823635-2025-11-21",
      "headline": "Aishwarya Rai's touching tribute to late father celebrates love across generationsAishwarya Rai Bachchan marked her late father Krishnaraj Rai's birthday by sharing family photos and a heartfelt note, highlighting the close bond between the generations. Her daughter, Aaradhya Bachchan, is also seen in the photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/tokyo-trials-radhabinod-pal-war-tribunal-dissent-justice-hiroshima-nagasaki-nuremberg-film-show-russell-crowe-india-japan-2823370-2025-11-21",
      "headline": "When an Indian judge tried to save Japanese Generals from hangman's nooseWhile the post-World War 2 Nuremberg Trials of Europe are taught as part of history, nothing much is said about the Asian version—the Tokyo Trials. Also forgotten in India is the role played by Radhabinod Pal, the lone jurist among the 11 judges to dissent and seek the release of Japan's wartime Generals. Revisiting Pal's role in the Tokyo Trials as the world marks the 80th anniversary of the Nuremberg Trials, and is gripped by a Russel Crowe-starrer on it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/cgc-university-mohali-where-vision-becomes-legacy-and-education-becomes-evolution-2821185-2025-11-17",
      "headline": "CGC University, Mohali: Where vision becomes legacy and education becomes evolutionStories of students who dare to dream, of educators who ignite curiosity, and of a community that chooses progress with purpose."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/west-bengal-bjp-dig-mamata-political-earthquake-kolkata-sir-process-2823610-2025-11-21",
      "headline": "Earthquake because of SIR? BJP's dig at Mamata Banerjee as tremors felt in KolkataThe Bengal BJP mocked Chief Minister Mamata Banerjee after Friday's earthquake tremors in Kolkata, asking whether it was also due to the Special Intensive Revision (SIR) process, amid an escalating political confrontation over the voter roll exercise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/siddaramaiah-dk-shivakumar-karnataka-congress-mlas-demand-power-sharing-promise-2823520-2025-11-21",
      "headline": "No discussion of Karnataka Chief Minister change, Congress sources say amid tussle Live updatesCongress MLAs loyal to Deputy CM DK Shivakumar will meet party leaders in Delhi on Friday to demand the fulfilment of what they describe as a 2023 power-sharing promise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/hoogly-googly-why-bjp-hits-a-wall-in-west-bengal-mamata-banerjee-trinamool-congress-election-muslim-voters-sir-2822689-2025-11-20",
      "headline": "The Hooghly googly: Why BJP hits a wall in West BengalPM Modi might use the Ganga metaphor to talk about an electoral victory in Bengal after Bihar, but geography itself throws up a Hooghly googly. On the demographic back foot in West Bengal, the BJP's problem is how does it dislodge Mamata Banerjee, who hasn't lodged herself as the CM even after 14 years, playing the eternal opposition to a \"scheming Dilli\"?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-coast-guard-denies-swastika-hate-symbol-glbs-2823489-2025-11-21",
      "headline": "Swastika no longer a hate symbol under new US Coast Guard rules: ReportThe new Coast Guard guidelines categorise Swastikas, nooses and similar imagery as potentially divisive, not explicit hate symbols. Supervisors would be required to inquire about a reported display, consult legal staff and decide whether to remove it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/you-can-be-a-gold-digger-or-a-beauty-digger-and-thats-your-choice-2823048-2025-11-21",
      "headline": "You can be a gold digger or a beauty digger, and that's your choiceChoosing a partner for their wealth or good looks is a personal choice, and no one should be judged for it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/weeks-after-walking-out-for-being-called-dummy-mexicos-fatima-bosch-wins-miss-universe-2823582-2025-11-21",
      "headline": "Mexico's Fatima Bosch wins Miss Universe weeks after being called 'dummy'Fatima Bosch grew up in Mexico's Villahermosa city, where she built a reputation for her work with animals long before the pageant spotlight found her. She has spoken openly about living with dyslexia, ADHD and hyperactivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/honeymoon-travel-trends-top-destinations-india-international-2823249-2025-11-20",
      "headline": "Honeymoon diaries: What's on Indian newlyweds' bucketlist?Today's newlyweds are splitting their honeymoon into two chapters: a quick minimoon and a grand, big-moon. Here's how much they're investing in love, and the destinations winning their hearts.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaaras-ahaan-panday-denies-dating-aneet-padda-but-says-their-bond-is-special-2823605-2025-11-21",
      "headline": "Ahaan Panday dating Aneet Padda? Read what Saiyaara hero said on rumoursAhaan Panday reacts to dating rumours with his 'Saiyaara' co-star Aneet Padda. He called her his \"best friend\", and shared that the success of their film was a collective dream they manifested. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-ind-vs-sa-guwahati-test-mumbai-specialist-doctor-neck-injury-2823597-2025-11-21",
      "headline": "Gill ruled out of 2nd Test, to seek specialist's opinion on injury in MumbaiIndia captain Shubman Gill has been ruled out of the second Test against South Africa in Guwahati and left for Mumbai on Friday morning to consult a specialist for further assessment and injury management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hridayapoorvam-mohanlal-subtle-acting-heartwarming-malayalam-drama-2823009-2025-11-21",
      "headline": "The simplicity of Hridayapoorvam and Mohanlal's subtle yet moving act'Hridayapoorvam' showcases Mohanlal's subtle and natural performance in a simple family drama. The film's gentle storytelling offers a refreshing change from typical high-octane actioners."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/delhi-high-court-permits-120-bahadur-release-with-ahir-soldiers-names-2823668-2025-11-21",
      "headline": "Watch 120 Bahadur before seeking changes, Delhi High Court tells petitionersThe Delhi High Court has allowed the release of the film '120 Bahadur' despite objections from the Sanyukt Ahir Regiment Morcha. The court ruled it was too late to change the movie title but ensured the names of all 120 Ahir soldiers appear in the credits, allowing corrections for the OTT release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/do-deewane-seher-mein-first-look-siddhant-chaturvedi-mrunal-thakur-bring-soulful-old-school-romance-2823663-2025-11-21",
      "headline": "Do Deewane Seher Mein: Siddhant–Mrunal bring soulful, old-school romance'Do Deewane Seher Mein' unveils its dreamy first look, introducing Siddhant Chaturvedi and Mrunal Thakur in a soulful love story backed by Sanjay Leela Bhansali. The film promises a warm, nostalgic romance ahead of its February 2026 release."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-proposal-palash-mucchal-video-dy-patil-cricket-stadium-2823695-2025-11-21",
      "headline": "Watch: Palash Muchhal's surprise proposal to Smriti Mandhana at World Cup venue Smriti Mandhana received the surprise of her life at the DY Patil Stadium, where fiancé Palash Muchhal proposed in the middle of the pitch. The Indian cricketer was part of the Women's World Cup team, which won the final at the same venue earlier in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-harry-brook-edge-walks-after-steve-smith-drs-review-perth-test-2823656-2025-11-21",
      "headline": "Watch: Harry Brook tries to get away with edge, walks after Smith's DRS review England vice-captain Harry Brook tried to get away from the edge but was forced to walk off after Australia's review for a caught-behind decision on the opening day of the Perth Test in the Ashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-australia-vs-england-mitchell-starc-seven-wickets-perth-test-record-2823642-2025-11-21",
      "headline": "Mitchell Starc destroys England with 7 wickets after hitting special 100 Mitchell Starc starred with a seven-wicket haul to give Australia a strong start in the Ashes series. England were bowled out for 172 after lasting just 32.5 overs in their first innings in Perth on Friday, November 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-secures-australian-open-super-500-semifinal-berth-2823628-2025-11-21",
      "headline": "Lakshya Sen overcomes compatriot Ayush Shetty to enter semis Lakshya Sen defeated compatriot Ayush Shetty in straight games to advance to the semifinals of the Australian Open Super 500. The seventh seed prevailed 23-21, 21-11 in the quarterfinal and will next face Chou Tien Chen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-mitchell-starc-first-over-wicket-perth-england-crawley-james-anderson-record-2823631-2025-11-21",
      "headline": "The Ashes: Mitchell Starc's first-over strike edges him closer to Anderson's record Mitchell Starc produced a blistering first-over spell to remove Zak Crawley and set the tone for Australia in the Ashes opener at Perth. With the wicket, Starc edges closer to James Anderson's record for the most first-over wickets in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-injury-update-comeback-delayed-bcci-medical-review-2823627-2025-11-21",
      "headline": "Shreyas Iyer to be out of action for 2 more months, cautious rehab plan recommended Shreyas Iyer faces a lengthier spell on the sidelines as fresh medical assessments have advised him to avoid high-intensity training and follow a controlled rehabilitation roadmap. After suffering a spleen laceration during the Sydney ODI, Iyer is progressing well but will require another scan in two months before beginning formal rehab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-kolkata-test-ajinkya-rahane-pitch-spin-gautam-gambhir-2823606-2025-11-21",
      "headline": "Don't blame batters: Want spinning pitches? Then train accordingly, says Rahane India vs South Africa: Senior batter Ajinkya Rahane contradicted Gautam Gambhir's take on India's loss to South Africa in Kolkata, saying it is unfair to blame the batters for their inability to play on spin-friendly pitches. Rahane added that visiting teams have been preparing better for Tests in India than the home side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-ind-vs-sa-guwahati-test-mumbai-specialist-doctor-neck-injury-2823597-2025-11-21",
      "headline": "Gill ruled out of 2nd Test, to seek specialist's opinion on injury in Mumbai India captain Shubman Gill has been ruled out of the second Test against South Africa in Guwahati and left for Mumbai on Friday morning to consult a specialist for further assessment and injury management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sania-mirza-advises-richa-ghosh-ignore-social-media-criticism-world-cup-india-2823570-2025-11-21",
      "headline": "Sania Mirza's advice to Richa Ghosh: Social media can't make or break your day Six-time Grand Slam champion Sania Mirza offered a powerful piece of advice to young Indian cricketer Richa Ghosh, reminding her that online chatter must never define her self-worth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-100th-ashes-wicket-joe-root-fails-duck-perth-test-2823550-2025-11-21",
      "headline": "Ashes: Joe Root's Australian nightmare continues, falls for a duck in Perth Joe Root's troubles in Australia resurfaced in the opening session of the Ashes Test in Perth, where the England batter was dismissed for a duck by Mitchell Starc inside the first hour of play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-kolkata-test-ajinkya-rahane-pitch-spin-gautam-gambhir-2823606-2025-11-21",
      "headline": "Don't blame batters: Want spinning pitches? Then train accordingly, says Rahane India vs South Africa: Senior batter Ajinkya Rahane contradicted Gautam Gambhir's take on India's loss to South Africa in Kolkata, saying it is unfair to blame the batters for their inability to play on spin-friendly pitches. Rahane added that visiting teams have been preparing better for Tests in India than the home side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-ind-vs-sa-guwahati-test-mumbai-specialist-doctor-neck-injury-2823597-2025-11-21",
      "headline": "Gill ruled out of 2nd Test, to seek specialist's opinion on injury in Mumbai India captain Shubman Gill has been ruled out of the second Test against South Africa in Guwahati and left for Mumbai on Friday morning to consult a specialist for further assessment and injury management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sania-mirza-advises-richa-ghosh-ignore-social-media-criticism-world-cup-india-2823570-2025-11-21",
      "headline": "Sania Mirza's advice to Richa Ghosh: Social media can't make or break your day Six-time Grand Slam champion Sania Mirza offered a powerful piece of advice to young Indian cricketer Richa Ghosh, reminding her that online chatter must never define her self-worth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-100th-ashes-wicket-joe-root-fails-duck-perth-test-2823550-2025-11-21",
      "headline": "Ashes: Joe Root's Australian nightmare continues, falls for a duck in Perth Joe Root's troubles in Australia resurfaced in the opening session of the Ashes Test in Perth, where the England batter was dismissed for a duck by Mitchell Starc inside the first hour of play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-dream-india-gautam-gambhir-threat-2823530-2025-11-21",
      "headline": "Is the World Test Championship final a distant dream for India in the Gambhir era?Reaching the final of every tournament has long been India's benchmark. But just a few months into Gautam Gambhir's tenure, the World Test Championship dream seems to be drifting further out of reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-second-test-guwahati-tea-before-lunch-early-sunset-2823377-2025-11-21",
      "headline": "IND vs SA: Pitch dark at 4:30 pm as early sunset set to affect Guwahati TestIndia vs South Africa, second Test: An early sunset and a revised schedule add to the Guwahati challenge, but India's bigger task is fixing what went wrong in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-rishabh-pant-captaincy-shubman-gill-injury-guwahati-test-2823470-2025-11-21",
      "headline": "IND vs SA: Can Rishabh Pant step up in Guwahati with the series on the line?India find themselves at a crucial juncture in their Test history as they prepare to face South Africa without Shubman Gill. In his absence, Rishabh Pant will be tasked with reviving the team's fortunes as he steps in for his official Test captaincy debut in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/east-bengal-fc-pm-narendra-modi-letter-isl-crisis-aiff-tender-india-fifa-ranking-2823456-2025-11-20",
      "headline": "East Bengal urges PM Modi to intervene as ISL crisis grips Indian footballEast Bengal has urged Prime Minister Narendra Modi to step in as uncertainty grips the ISL. With the national team also slipping rapidly, the club's message reflects just how serious Indian football's crisis has become."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sikandar-raza-all-round-show-zimbabwe-thrash-sri-lanka-by-67-runs-t20i-tri-series-2823449-2025-11-20",
      "headline": "Sikandar Raza's all-round show help Zimbabwe stun Sri Lanka by 67 runsSikandar Raza led Zimbabwe with an all-round performance to defeat Sri Lanka by 67 runs in Match 2 of the T20I Tri Series at Rawalpindi Cricket Stadium. The victory helped Zimbabwe climb to the top of the tri-series points table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/monty-panesar-hits-back-steve-smith-2018-ball-tampering-ashes-test-2823430-2025-11-20",
      "headline": "Panesar hits back at Smith: My mistakes were on TV, his were on cricket fieldMonty Panesar has responded to Steve Smith's mocking remarks ahead of the first Ashes Test in Perth. Smith had recalled Panesar's embarrassing appearance on the British quiz show Mastermind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ryan-williams-india-football-fifa-approval-citizenship-elgible-aiff-2823399-2025-11-20",
      "headline": "Ryan Willaims officially eligible for India selection after FIFA approvalRyan Williams has finally received FIFA clearance to represent India, ending the long wait for his international eligibility. The Bengaluru FC forward is now officially available for selection for the Blue Tigers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/east-bengal-fc-pm-narendra-modi-letter-isl-crisis-aiff-tender-india-fifa-ranking-2823456-2025-11-20",
      "headline": "East Bengal urges PM Modi to intervene as ISL crisis grips Indian footballEast Bengal has urged Prime Minister Narendra Modi to step in as uncertainty grips the ISL. With the national team also slipping rapidly, the club's message reflects just how serious Indian football's crisis has become."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sikandar-raza-all-round-show-zimbabwe-thrash-sri-lanka-by-67-runs-t20i-tri-series-2823449-2025-11-20",
      "headline": "Sikandar Raza's all-round show help Zimbabwe stun Sri Lanka by 67 runsSikandar Raza led Zimbabwe with an all-round performance to defeat Sri Lanka by 67 runs in Match 2 of the T20I Tri Series at Rawalpindi Cricket Stadium. The victory helped Zimbabwe climb to the top of the tri-series points table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/monty-panesar-hits-back-steve-smith-2018-ball-tampering-ashes-test-2823430-2025-11-20",
      "headline": "Panesar hits back at Smith: My mistakes were on TV, his were on cricket fieldMonty Panesar has responded to Steve Smith's mocking remarks ahead of the first Ashes Test in Perth. Smith had recalled Panesar's embarrassing appearance on the British quiz show Mastermind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ryan-williams-india-football-fifa-approval-citizenship-elgible-aiff-2823399-2025-11-20",
      "headline": "Ryan Willaims officially eligible for India selection after FIFA approvalRyan Williams has finally received FIFA clearance to represent India, ending the long wait for his international eligibility. The Bengaluru FC forward is now officially available for selection for the Blue Tigers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-26-prediction-ponting-backs-england-two-test-wins-aus-vs-eng-2823368-2025-11-20",
      "headline": "Ponting makes bold prediction for England in Ashes 2025 despite poor past recordRicky Ponting expects a fiercely competitive Ashes 2025-26 series, backing England to win two Tests in Australia but ultimately tipping the hosts for a narrow 3-2 victory with no drawn matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-26-australia-vs-england-first-test-perth-squad-live-streaming-session-timings-2823334-2025-11-20",
      "headline": "Ashes live streaming in India: When and where to watch AUS vs ENG 1st TestThe Ashes 2025-26 series kicks off with Australia hosting England at Perth's Optus Stadium for the first Test. England haven't won a Test in Australia since 2011 while Australia are holding the Ashes since 2017-18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nikhat-zareen-world-boxing-cup-gold-medal-5th-51-kg-category-paris-olympics-ghosts-2823337-2025-11-20",
      "headline": "Nikhat Zareen wins 5th World Boxing Gold for India: Buries ghosts from Paris gamesNikhat Zareen clinched gold in the 51 kg category at the World Boxing Cup Finals, sealing India's fifth gold medal from the women's boxing contingent at the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-1st-test-preview-australia-vs-england-pitch-team-news-perth-2823329-2025-11-20",
      "headline": "Let the Ashes begin: Ben Stokes leads a fearless England into the furnaceAshes 1st Test preview: Bazball meets its fiercest examination as England storm into Australia with swagger, scars, and something to prove. The rivalry is crackling, the barbs are flying, and the stage in Perth is primed for a statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/narendra-modi-prime-minister-smriti-mandhana-palash-muchhal-engagement-congratulations-2823318-2025-11-20",
      "headline": "PM Modi congratulates Smriti Mandhana and Palash Mucchal, wedding on November 23PM Narendra Modi wished Smriti Mandhana and Palash Muchhal on their engagement. The letter from PM Modi also stated that the couple are set to get married on November 23."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-kagiso-rabada-injury-update-guwahati-test-piet-botha-south-africa-2823293-2025-11-20",
      "headline": "IND vs SA: South Africa to decide on Rabada, Harmer cleared for 2nd Test in GuwahatiSouth Africa bowling coach Piet Botha has said that a final call on Kagiso Rabada's participation in the Guwahati Test will be made on the eve of the match. Rabada missed the first Test due to an injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sam-konstas-fiery-reply-to-virat-kohli-shoulder-charge-boxing-day-test-mcg-2823245-2025-11-20",
      "headline": "Sam Konstas' fiery reply to Kohli after shoulder charge revealed by Oliver PeakeSam Konstas' debut in the Boxing Day Test featured a notable exchange with India star Virat Kohli who shoulder charged him. Oliver Peake has finally lifted the lid on what transpired between the two during the heated incident."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}