{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-south-2025/video/how-can-ease-of-business-be-improved-in-indias-real-estate-sector-2784309-2025-09-09",
      "headline": "How can ease of business be improved in India's real estate sector?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/the-pf-problem-why-so-many-employees-struggle-to-access-their-own-money-2784319-2025-09-09",
      "headline": "The PF problem: Why so many employees struggle to access their own moneyEvery month, employees across India save a part of their salary in the Provident Fund. But system errors, bureaucratic delays, and glitches mean that for millions, claiming their own PF money has become a frustrating challenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-south-2025/story/affordable-housing-india-how-to-build-cheap-houses-tax-tata-realty-ceo-sanjay-dutt-2784290-2025-09-09",
      "headline": "How can India achieve affordable housing? Tata Realty CEO explainsSanjay Dutt, Managing Director and CEO of Tata Realty & Infrastructure Ltd, spoke about how India can work towards making affordable housing more accessible and practical."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-agarwals-to-patels-which-surnames-rule-india-richest-family-businesses-2784257-2025-09-09",
      "headline": "From Agarwals to Patels: Which surnames rule India's richest family businesses?Behind India's richest family businesses lies an interesting pattern, certain surnames appear again and again. The Hurun India Rich List 2025 reveals which surnames dominate this legacy of wealth, with Agarwals, Guptas and Jains leading the pack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/selling-property-here-are-9-smart-ways-to-save-on-capital-gains-tax-2784232-2025-09-09",
      "headline": "Selling property? Here are 9 smart ways to save on capital gains taxSelling property can bring you a good profit, but it often comes with the worry of paying a hefty capital gains tax. Luckily, the Income Tax Act offers several ways to cut down or even avoid this tax if you plan wisely."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cash-gold-property-how-to-protect-your-wedding-gifts-from-tax-trouble-2784223-2025-09-09",
      "headline": "Cash, gold, property: How to protect your wedding gifts from tax troubleMost of these gifts are legally tax-free. Under Section 56(2)(x) of the Income Tax Act, gifts received by the bride or groom on the occasion of marriage are completely exempt from tax."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/amanta-healthcare-share-price-rs-135-stock-market-debut-premium-7-percent-nse-bse-2784202-2025-09-09",
      "headline": "Amanta Healthcare IPO lists at 7% premium on stock market debutAmanta Healthcare share price: The pharmaceutical company listed at Rs 135 on the National Stock Exchange (NSE), giving investors a 7.14% premium over the issue price of Rs 126."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-all-time-high-of-rs-110000-per-10-grams-why-is-it-rallying-today-2784197-2025-09-09",
      "headline": "Gold hits all-time high of Rs 1,10,000 per 10 grams. Why is it rallying today?On the Multi Commodity Exchange (MCX), gold futures for December delivery jumped Rs 458, or 0.41%, to Rs 1,10,047 per 10 grams. The most-traded October contract also touched a lifetime high of Rs 1,09,000 per 10 grams, gaining Rs 482."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-tcs-wipro-it-stocks-rallying-today-explained-2784183-2025-09-09",
      "headline": "Why are Infosys and other IT stocks rallying? Here is all you need to knowInfosys was the star performer. Its shares rose 3.4% after the company said its board will meet on September 11 to consider a share buyback. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-infosys-shares-jumped-4-today-buyback-plan-2784174-2025-09-09",
      "headline": "Explained: Why Infosys shares jumped 4% today The stock was trading 3.88% higher at Rs 1,488.25 around 9:45 am on the Bombay Stock Exchange (BSE). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-323-points-higher-nifty-above-24850-infosys-up-3-percent-2784160-2025-09-09",
      "headline": "Sensex, Nifty rise amid rising hopes of US rate cut; IT stocks lead rallyThe S&P BSE Sensex added 315.61 points to 81,102.91, while the NSE Nifty50 gained 82 points to 24,855.15, as of 9:32 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-sebi-legal-battle-begin-today-derivative-trading-stock-manipulation-report-2784158-2025-09-09",
      "headline": "Jane Street vs Sebi courtroom battle begins todayJane Street filed its appeal last week, claiming that Sebi denied it access to key documents needed to defend against the allegations. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ali-fazal-attends-rule-breakers-screening-at-uk-parliament-mp-alice-mcdonald-joins-2784297-2025-09-09",
      "headline": "Ali Fazal attends Rule Breakers screening at UK Parliament with MP Alice McDonaldActor Ali Fazal attended the screening of 'Rule Breakers'' at UK Parliament. He was joined by MP Alice McDonald. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tanishaa-mukerji-says-outsiders-lack-loyalty-nepo-babies-dont-opens-up-on-breakup-with-uday-chopra-armaan-kohli-2784291-2025-09-09",
      "headline": "Tanishaa Mukerji says outsiders lack loyalty, opens up on Uday Chopra, Armaan KohliActor Tanishaa Mukerji opened up about her breakups with Uday Chopra and Armaan Kohli, while also calling Bollywood outsiders \"not loyal\" to the industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-farrhana-bhat-ashnoor-kaur-fight-bigg-boss-19-tv-actor-2784229-2025-09-09",
      "headline": "Hina slams Farrhana for belittling Ashnoor's TV career, calls her a wannabeActor Hina Khan criticised Farrhana Bhatt for commenting about Ashnoor Kaur's television background on 'Bigg Boss 19'. She later deleted the post. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ghmc-notice-allu-arjun-illegal-building-extension-jubilee-hills-2784260-2025-09-09",
      "headline": "Allu Arjun receives show-cause notice from corporation over illegal constructionActor Allu Arjun has been served a show-cause notice by Greater Hyderabad Municipal Corporation (GHMC) for unauthorised construction at his Jubilee Hills property. The notice threatens demolition of the illegal extension, raising concerns about compliance and legal action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakesh-roshan-confirms-krrish-4-release-2027-shooting-to-begin-next-year-hrithik-roshan-2784244-2025-09-09",
      "headline": "Rakesh Roshan confirms Krrish 4's release in 2027, shooting to begin next yearVeteran filmmaker Rakesh Roshan recently shared that his son Hrithik Roshan's 'Krrish 4' is expected to release in theatres in 2027. The shooting will begin in 2026. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-day-15-kunickaa-sadanand-tanya-mittal-mridul-tiwari-natalia-janoszek-2784199-2025-09-09",
      "headline": "Bigg Boss 19 day 15: Kunickaa-Tanya's clash escalates, Mridul confronts NataliaDay 15 of 'Bigg Boss 19' saw explosive confrontations amongst housemates. Kunickaa Sadanand and Tanya Mittal had a notably intense argument in the kitchen and later during the nomination task. The episode also featured Mridul Tiwari confessing his feelings for Natalia Janoszek."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-box-office-collection-day-4-detailed-report-major-monday-drop-for-tiger-shroff-film-hints-at-bleak-future-2784226-2025-09-09",
      "headline": "Baaghi 4 box office Day 4: Major Monday drop for Tiger's film hints at bleak futureTiger Shroff's 'Baaghi 4' struggled on its first Monday with collections dropping to Rs 4.25 crore, taking the film's four-day total to Rs 35.50 crore at the Indian box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/elumale-kannada-film-review-innocent-lovers-stuck-between-bandits-smugglers-and-the-police-2784033-2025-09-09",
      "headline": "Elumale review: Impressive thriller blends romance with Veerappan's manhuntRelease Date:Fri Sep 05, 2025Elumale movie review: The rooted Kannada film, written and directed by debutant Punit Rangaswamy, is set in 2004 and weaves love, family drama, and crime thriller elements effectively. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/harry-potter-tom-felton-dedicates-post-pratik-gandhi-calls-him-brother-2784206-2025-09-09",
      "headline": "Harry Potter's Tom Felton dedicates post to Pratik Gandhi, calls him brotherHarry Potter star Tom Felton shared a dedicated post to 'Scam 1997' actor Pratik Gandhi. The two worked together in the upcoming series called 'Gandhi', directed by Hansal Mehta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dabangg-director-says-salman-khan-arbaaz-khan-didnt-want-malaika-in-munni-badnaam-hui-muslim-conservative-2784190-2025-09-09",
      "headline": "Dabangg director says Salman Khan, Arbaaz didn't want Malaika in Munni Badnaam Hui'Dabangg' director Abhinav Kashyap claimed that Salman Khan and Arbaaz Khan were against Malaika Arora performing in 'Munni Badnaam Hui', calling the Khan brothers \"conservative\" about her costumes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-dedicates-58-birthday-post-fans-who-still-believe-2784167-2025-09-09",
      "headline": "Akshay Kumar dedicates 58th birthday post to fans who still believeBollywood actor Akshay Kumar began his 58th birthday with a heartfelt thank-you post on social media. The 'Jolly LLB 2' star shared that this journey belongs as much to his fans as it does to him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-battle-of-galwan-climax-scenes-in-first-schedule-2784169-2025-09-09",
      "headline": "Exclusive: Salman Khan to shoot Battle of Galwan climax scenes in first scheduleSalman Khan is currently shooting the important climax sequences of his film, 'Battle of Galwan', in Leh and Ladakh.  The production aims to complete key scenes quickly due to unpredictable weather, ensuring high-quality visuals and authenticity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/little-hearts-review-nostalgia-meets-teen-drama-in-the-pre-jio-era-mouli-tanuj-prasanth-sai-marthand-2784098-2025-09-09",
      "headline": "Little Hearts review: Nostalgia meets hilarious teen drama in pre-Jio eraRelease Date:Fri Sep 05, 2025'Little Hearts' may not aim to break new ground in Telugu cinema, but it beautifully captures a bygone era cherished by millennials, combining youthful energy, situational humour, and heartfelt moments into a nostalgic, engaging ride."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-roasts-donald-trump-during-new-jersey-gig-2784148-2025-09-09",
      "headline": "Badshah roasts Trump on stage during high-energy New Jersey gig. WatchIndian rapper and singer Badshah leaves the New Jersey crowd in splits with a tweeked 'Tareefan' lyric change, taking a jibe at US President Donald Trump's tariffs during his electrifying Unfinished USA Tour.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/apoorva-mukhija-india-tour-announcement-online-scepticism-2784132-2025-09-09",
      "headline": "Apoorva Mukhija trolled for India tour announcement, Internet is puzzledContent creator and influencer Apoorva Mukhija announced her India tour recently and faced online scepticism. The Internet trolled her, questioning the content she would put up during her live performance. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ilaiyaraaja-copyright-dispute-halts-good-bad-ugly-film-release-2784119-2025-09-09",
      "headline": "Madras High Court bans use of Ilaiyaraaja's songs in Ajith Kumar's Good Bad UglyMadras High Court has restrained the makers of 'Good Bad Ugly' from exhibiting the film using Ilaiyaraaja's songs. The court granted an interim injunction against the film producers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kajal-aggarwal-denies-accident-rumours-assures-fans-safe-2784113-2025-09-09",
      "headline": "Kajal Aggarwal rubbishes accident and death rumours: Perfectly fine and safeActor Kajal Aggarwal assured fans of her safety amid false accident rumours. In an Instagram post, the actor called the rumours 'amusing' and urged focus on positivity. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manisha-koirala-condemns-deadly-nepal-protests-social-media-ban-2784090-2025-09-09",
      "headline": "Manisha Koirala reacts to deadly Nepal protests, calls it a black dayActor Manisha Koirala reacts strongly to deadly protests in Nepal following a social media ban. The unrest highlights growing public anger over corruption and government actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/anuparna-roy-bags-best-director-in-venice-film-festival-parents-thrilled-2784005-2025-09-08",
      "headline": "Purulia girl Anuparna Roy bags Best Director in Venice, parents thrilled with winPurulia-born Anuparna Roy won Best Director at the 82nd Venice Film Festival for her debut film. She became the first Indian to win the award at the prestigious global film festival. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-protest-kp-sharma-oli-flee-dubai-asylum-social-media-ban-kathmandu-2784271-2025-09-09",
      "headline": "Nepal Army Chief asks PM Oli to step down, he requests for safe exit: SourcesAs the Gen Z protests in Nepal entered Day 2 on Tuesday, students leading the agitation are demanding the resignation of Prime Minister KP Sharma Oli. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-protest-live-updates-curfew-in-kathmandu-oli-government-in-emergency-huddle-security-forces-use-tear-gas-2783755-2025-09-08",
      "headline": "Live: Nepal airport shut down; protesters torch Nepal President, PM's homesNepal protest Live: Protests continued in Nepal for the second day on Tuesday despite the government announcing that it had lifted the ban on social media platforms. Tuesday's protests demanded KP Sharma Oli's ouster and the government's dismissal after 20 people were killed on Monday and over 250 injured. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-presidential-elections-today-nda-eyes-win-india-bloc-tests-unity-2784117-2025-09-09",
      "headline": "Battle lines drawn as vice-presidential polls kick off, numbers back NDAThe election comes fifty days after Jagdeep Dhankhar resigned from the post on July 21, citing health reasons. The vacancy triggered a fresh contest for the nation's second-highest constitutional office, and with it, a political test of strength between the ruling NDA and the opposition INDIA bloc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dk-shivakumar-india-today-conclave-rahul-gandhi-prime-minister-siddaramaiah-bengaluru-2784304-2025-09-09",
      "headline": "Very confident Rahul Gandhi will be PM in 2029, says DK ShivakumarIn a wide-ranging interview at India Today's South Conclave, DK Shivakumar spoke about his relationship with Siddaramaiah, controversy over him singing the RSS anthem and the Dharmasthala case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/interactive/photo-essay/india-monsoon-extreme-rainfall-pattern-floods-climate-change-307-05-09-2025",
      "headline": "Rains, ruins, resilience: Story of India's dramatically shifting monsoonThe monsoon season in 2025 has caused havoc in India, killing hundreds of people and disrupting livelihoods. Experts point towards the changing climate and a major shift in the monsoon pattern that is leading to new wet and dry spots across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-president-election-result-2025-live-updates-voting-polling-cp-radhakrishnan-b-sudershan-reddy-2784147-2025-09-09",
      "headline": "Live: Voting in Veep election still on, NDA sets table for celebration dinnerVice President Election 2025 Voting Live Updates: India will have a new Vice President by Tuesday night, with members of Parliament voting to fill the post left vacant after Jagdeep Dhankhar's abrupt resignation. The contest has pitted the BJP-led ruling NDA's nominee, Maharashtra Governor CP Radhakrishnan, against the opposition INDIA bloc's choice, former Supreme Court judge B Sudershan Reddy. Polling will begin at 10 am in the new Parliament building, with members of both Lok Sabha and Rajya Sabha eligible to cast their votes until 5 pm. Counting of ballots will start at 6 pm, and the results are expected later in the evening. Although the BJP-led alliance has a numerical advantage, the outcome could hinge on cross-voting since MPs are not bound by a party whip and ballots are cast in secrecy. Stay with IndiaToday.in for live updates"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-protest-sudan-gurung-hami-nepal-social-media-ban-kp-sharma-oli-2784166-2025-09-09",
      "headline": "Who is Sudan Gurung, the face of massive Gen Z revolt in Nepal?At least 20 people were killed and over 300 injured as the Nepal government's ban on 26 social media platforms sparked the country's deadliest youth protests in years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/noida-woman-leaving-india-due-to-reservation-policies-viral-linkedin-post-sparks-debate-2784242-2025-09-09",
      "headline": "Noida woman's 'I choose to leave India' post sparks debate on reservation policiesA Noida-based woman shared that she is leaving India to pursue an MBA abroad after failing to secure admission to the institutes she considered the \"best\" in the country, blaming reservation policies for it. Her LinkedIn post has now sparked a debate on the issue. Read on:"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/asal-uttar-india-pakistan-war-1965-60-years-how-india-crushed-pakistan-in-biggest-tank-battle-since-second-world-war-2784067-2025-09-09",
      "headline": "How India crushed Pak in biggest tank battle since WW IIIn the 1965 War, Pakistan fielded its latest US-made M47 and M48 Patton tanks against India's aging Shermans and limited Centurions. With exceptional battle skills and strategy, the Indian Army turned the village of Asal Uttar in Punjab into a graveyard of Pakistani Pattons. Revisiting the battle on its 60th anniversary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-mp-need-training-presidential-vice-president-election-cp-radhakrishnan-b-sudershan-reddy-jagdeep-dhankhar-complicated-explained-2783832-2025-09-08",
      "headline": "Why MPs need training for Vice-Presidential election? It's complicatedThe Vice-President election is scheduled for September 9, and MPs from both the Lok Sabha and Rajya Sabha are undergoing training to understand the complex voting process. Here's a closer look at how both Presidential and Vice Presidential elections are conducted and why MPs need training."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-event-2025-iphone-17-cases-leaked-from-techwoven-to-liquid-silicon-all-that-is-coming-2784254-2025-09-09",
      "headline": "Apple event 2025: iPhone 17 cases leaked, from TechWoven to Liquid SiliconApple is expected to release new accessories to accompany its new iPhone 17 set to launch today at its Awe Dropping iPhone event. Let's take a look at what could be in store."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/indian-couple-assaulted-by-chinese-man-during-switzerland-holiday-shares-post-pics-2784220-2025-09-09",
      "headline": "Indian couple assaulted by Chinese man during Switzerland holiday, shares post, picsAn Indian-origin couple alleged that they were brutally assaulted by a Chinese hotel manager during their holiday in Switzerland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/open-and-arranged-marriage-the-changing-marriage-playbook-for-indians-in-their-30s-2783783-2025-09-09",
      "headline": "The changing marriage playbook for Indians in their 30sIs the arranged marriage scene in India shifting from compatibility to openness? For many in their 30s, finding 'the one' may no longer be enough."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-high-court-injunction-aishwarya-rai-bachchan-image-misuse-2784298-2025-09-09",
      "headline": "High Court steps in after Aishwarya Rai flags her morphed photos onlineDelhi High Court is set to pass injunction orders protecting Aishwarya Rai Bachchan's personality rights after she flagged the misuse of her images on the Internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/without-hope-there-is-no-life-deputy-cm-dk-shivakumar-on-karnataka-chief-ministerial-post-at-india-today-south-conclave-2025-2784287-2025-09-09",
      "headline": "Without hope, there is no life: DK Shivakumar on Karnataka Chief Ministerial postSpeaking at India Today Conclave South 2025, Karnataka Deputy Chief Minister DK Shivakumar avoided a direct answer on succeeding Siddaramaiah, stressing unity, party discipline, and commitment to governance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/taylor-swift-engagement-travis-kelce-fans-subreddit-gaylors-sexuality-internet-call-her-bisexual-1989-liner-here-is-more-2783636-2025-09-09",
      "headline": "Why Taylor Swift's engagement has left her Gaylor fans shockedTaylor Swift's engagement to Travis Kelce thrilled most fans but devastated the Gaylor sub-fandom, who believe she's secretly queer. Their subreddit erupted in despair, drew widespread mockery, and went private. Despite Swift dismissing such theories, some Gaylors still insist the engagement is either staged or \"classic bisexual behaviour\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/meet-the-maruti-suzuki-suv-with-a-lot-of-firsts-challenging-creta-seltos-2784262-2025-09-09",
      "headline": "Meet the Maruti Suzuki SUV with a lot of firsts, challenging Creta, SeltosMaruti Suzuki Victoris is a feature-loaded mid-size SUV under the Arena umbrella, packed with brand-first technologies and premium touches to rival the Hyundai Creta, Kia Seltos and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/great-nicobar-project-sonia-gandhi-bjp-questions-congress-rahul-gandhi-2784112-2025-09-09",
      "headline": "BJP targets Congress over stand on Great Nicobar Project: On whose behalf...BJP's Anil K Antony countered Congress criticism of the Rs 72,000-crore \"Holistic Development of Great Nicobar\" project, citing the islands' strategic location and questioning Rahul Gandhi's opposition to the plan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ghmc-notice-allu-arjun-illegal-building-extension-jubilee-hills-2784260-2025-09-09",
      "headline": "Allu Arjun receives show-cause notice from corporation over illegal constructionActor Allu Arjun has been served a show-cause notice by Greater Hyderabad Municipal Corporation (GHMC) for unauthorised construction at his Jubilee Hills property. The notice threatens demolition of the illegal extension, raising concerns about compliance and legal action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/space-travel-accelerates-ageing-of-blood-forming-stem-cells-in-human-body-2784255-2025-09-09",
      "headline": "Space travel tampers human body's ability to form healthy blood cellsResearchers monitored human hematopoietic stem and progenitor cells, responsible for producing all blood cells, from the bone marrow of individual donors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-202-team-preview-squads-schedule-tickets-2784094-2025-09-09",
      "headline": "Asia Cup preview: India favourites as battle for continental supremacy beginsThe 17th edition of the Asia Cup is all set to kickstart on September 9 as Afghanistan and Hong Kong will lock horns in the curtain-raiser fixture of the event. Here are the complete details of the continental event and what will make it exciting for the viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sabalenka-alcaraz-viral-tv-moment-us-open-2784245-2025-09-09",
      "headline": "Sabalenka's hilarious fumble on TV, calls Carlos Alcaraz Jannik SinnerUS Open champions Aryna Sabalenka and Carlos Alcaraz were put together in a TV programme. In the show, Sabalenka had a hilarious fumble when she mistakenly addressed Alcaraz as Jannik Sinner."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/exercise-caution-and-adhere-to-steps-by-authorities-indias-advisory-amid-gen-z-protests-in-nepal-2784201-2025-09-09",
      "headline": "Exercise caution, adhere to guidelines: India issues advisory amid Nepal protestsIndia has advised its citizens in Nepal to exercise caution after violent Gen Z protests left at least 20 dead and prompted curfews in several cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/white-house-denies-writing-letter-as-congress-releases-alleged-trump-note-to-epstein-glbs-2784105-2025-09-09",
      "headline": "Democrats release suggestive note to Epstein allegedly by Trump. White House deniesHouse Democrats unveiled a sexually suggestive 2003 birthday note allegedly signed by Trump and included in Epstein's album. The White House denies Trump's authorship, stirring renewed demands for Epstein-file transparency."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-simranjeet-singh-bowling-shubman-gill-india-uae-cricket-2784249-2025-09-09",
      "headline": "UAE bowler shares unique connection to Shubman Gill, now they meet at Asia Cup 2025Simranjeet Singh recalls bowling to Shubman Gill as he prepares to face India in Asia Cup 2025. His journey from Punjab to UAE cricket highlights resilience and cultural acceptance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sabalenka-alcaraz-viral-tv-moment-us-open-2784245-2025-09-09",
      "headline": "Sabalenka's hilarious fumble on TV, calls Carlos Alcaraz Jannik SinnerUS Open champions Aryna Sabalenka and Carlos Alcaraz were put together in a TV programme. In the show, Sabalenka had a hilarious fumble when she mistakenly addressed Alcaraz as Jannik Sinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-asia-cup-snub-kevin-pietersen-surprised-india-t20-squad-2025-2784224-2025-09-09",
      "headline": "Kevin Pietersen baffled by Yashasvi Jaiswal's Asia Cup snub: He's a major starKevin Pietersen was puzzled at how Yashasvi Jaiswal's omission was not included in India's Asia Cup squad. The former England captain sees the young opening batter as the next big star in Indian cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-injury-rehabilitation-bcci-bengaluru-west-indies-series-return-2784200-2025-09-09",
      "headline": "Rishabh Pant targets return in West Indies series after rehab in Bengaluru: ReportRishabh Pant is reportedly set to begin rehabilitation in Bengaluru after fracturing his foot in England. He is expected to return during the West Indies Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-uae-match-timing-hardik-bumrah-2784180-2025-09-09",
      "headline": "UAE excited to play against superstars Hardik, Bumrah: Alishan SharafuIndia play their opener in the Asia Cup 2025 against UAE on September 10. Ahead of the game, UAE batter Alishan Sharafu said that he was excited to go up against superstars Hardik Pandya and Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/golf/video/igpl-through-arjuna-awardee-shiv-kapurs-eyes-the-future-of-indian-golf-starts-here-2784149-2025-09-09",
      "headline": "IGPL through Arjuna awardee Shiv Kapur's eyes: The future of Indian golf starts hereWith IGPL, Shiv Kapur envisions a cricket-style revolution in Indian golf, aiming to make the sport cooler, inclusive, and accessible, with Yuvraj Singh bringing eyeballs, media reach, and invaluable experience to the league."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-all-you-need-to-know-live-streaming-schedule-venues-2784131-2025-09-09",
      "headline": "Asia Cup 2025 all you need to know: Live streaming, schedule, venuesThe Asia Cup 2025 begins in the UAE with India eyeing a record ninth title under Suryakumar Yadav's captaincy. Without Virat Kohli and Rohit Sharma, the team faces a transitional test against fierce continental rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/krafton-india-battlegrounds-showdown-2025-bgmi-international-cup-prize-pool-2784106-2025-09-09",
      "headline": "Krafton India announces BGMI events with international teamsKrafton India has unveiled two major BGMI tournaments for the second half of 2025. These events will feature international teams and offer Rs 1 crore prize pools, opening new opportunities for Indian players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-202-team-preview-squads-schedule-tickets-2784094-2025-09-09",
      "headline": "Asia Cup preview: India favourites as battle for continental supremacy beginsThe 17th edition of the Asia Cup is all set to kickstart on September 9 as Afghanistan and Hong Kong will lock horns in the curtain-raiser fixture of the event. Here are the complete details of the continental event and what will make it exciting for the viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-xabi-alonso-real-madrid-manager-of-the-month-award-debut-season-2784085-2025-09-08",
      "headline": "Real Madrid's Xabi Alonso bags LaLiga manager of the month award debut seasonXabi Alonso's debut month at Real Madrid couldn't have gone better. Three wins, a new midfield balance without Luka Modric, and Arda Güler's rise earned him the La Liga Manager of the Month award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/morne-morkel-on-kuldeep-yadavs-england-series-snub-asia-cup-2025-2784070-2025-09-08",
      "headline": "Kuldeep Yadav has kept working hard even without playing in England: Morne MorkelIndian bowling coach Morne Morkel has revealed that wrist spinner Kuldeep Yadav has been working hard on his bowling despite not getting a chance to play in England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-all-you-need-to-know-live-streaming-schedule-venues-2784131-2025-09-09",
      "headline": "Asia Cup 2025 all you need to know: Live streaming, schedule, venuesThe Asia Cup 2025 begins in the UAE with India eyeing a record ninth title under Suryakumar Yadav's captaincy. Without Virat Kohli and Rohit Sharma, the team faces a transitional test against fierce continental rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/krafton-india-battlegrounds-showdown-2025-bgmi-international-cup-prize-pool-2784106-2025-09-09",
      "headline": "Krafton India announces BGMI events with international teamsKrafton India has unveiled two major BGMI tournaments for the second half of 2025. These events will feature international teams and offer Rs 1 crore prize pools, opening new opportunities for Indian players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-202-team-preview-squads-schedule-tickets-2784094-2025-09-09",
      "headline": "Asia Cup preview: India favourites as battle for continental supremacy beginsThe 17th edition of the Asia Cup is all set to kickstart on September 9 as Afghanistan and Hong Kong will lock horns in the curtain-raiser fixture of the event. Here are the complete details of the continental event and what will make it exciting for the viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-xabi-alonso-real-madrid-manager-of-the-month-award-debut-season-2784085-2025-09-08",
      "headline": "Real Madrid's Xabi Alonso bags LaLiga manager of the month award debut seasonXabi Alonso's debut month at Real Madrid couldn't have gone better. Three wins, a new midfield balance without Luka Modric, and Arda Güler's rise earned him the La Liga Manager of the Month award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/morne-morkel-on-kuldeep-yadavs-england-series-snub-asia-cup-2025-2784070-2025-09-08",
      "headline": "Kuldeep Yadav has kept working hard even without playing in England: Morne MorkelIndian bowling coach Morne Morkel has revealed that wrist spinner Kuldeep Yadav has been working hard on his bowling despite not getting a chance to play in England. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}