{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-flat-as-markets-await-cpi-data-banking-stocks-see-decline-2648275-2024-12-11",
      "headline": "Sensex, Nifty end flat as markets await CPI data; banking stocks see declineThe S&P BSE Sensex added 16.09 points to close at 81,526.14, while the NSE Nift50 gained 31.75 points to end at 24,641.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanjay-malhotra-takes-charge-new-rbi-governor-challenges-for-him-inflation-growth-gdp-weak-rupee-2648260-2024-12-11",
      "headline": "What challenges await Sanjay Malhotra as he takes charge as RBI Governor?Sanjay Malhotra takes over at a challenging time, with India's economic growth slowing to 5.4% in the July-September quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mobikwik-vishal-mega-mart-ipo-which-is-better-should-you-subscribe-to-latest-gmp-details-2648217-2024-12-11",
      "headline": "Mobikwik vs Vishal Mega Mart IPO: Which public issue should you subscribe to? The IPO of Vishal Mega Mart aims to raise Rs 8,000 crore via an offer for sale of 102.56 crore shares, while that of Mobikwik is looking to raise Rs 572 crore through an entirely fresh issue of 2.05 crore shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-proposes-using-digilocker-for-reducing-unclaimed-assets-3-things-to-know-2648203-2024-12-11",
      "headline": "Sebi proposes using DigiLocker to help heirs claim mutual fundsSebi has proposed using DigiLocker to simplify asset management, reduce unclaimed assets, and enable faster paperless services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mobikwik-ipo-fully-subscribed-on-day-1-key-reasons-behind-strong-demand-2648136-2024-12-11",
      "headline": "Mobikwik IPO fully subscribed on Day 1. What's behind the strong demand?Mobikwik's IPO was subscribed over 3.5 times as of 1 pm. According to data, Mobikwik's IPO received bids for 3,96,80,623 shares against the 1,18,71,696 shares on offer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-bima-sakhi-yojana-explained-eligibility-stipend-and-application-details-2648124-2024-12-11",
      "headline": "LIC Bima Sakhi Yojana explained: Check eligibility, and stipendThe LIC Bima Sakhi Yojana empowers women aged 18-70 with training, stipends, and LIC agent roles, promoting financial inclusion and independence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pnc-infratech-share-price-jumps-12-percent-early-completion-highway-project-2648110-2024-12-11",
      "headline": "Explained: Why PNC Infratech share price jumped 12% todayAt around 12:08 pm, shares of PNC Infratech were trading 9.81% higher at Rs 341.25. The strong performance came after the civil construction firm announced the early completion of a key highway project, boosting investor sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-ports-opt-out-of-553-million-us-loan-dfc-sri-lanka-colombo-terminal-reason-apsez-share-price-2648101-2024-12-11",
      "headline": "Why Adani Ports decided to opt out of $553 million US loan for Sri Lanka projectAdani Ports and Special Economic Zone Ltd (APSEZ) said it would instead use its own resources to fund the project, citing alignment with its capital management plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-tesla-resumes-hunt-for-new-delhi-showroom-with-dlf-says-report-2648089-2024-12-11",
      "headline": "Elon Musk's Tesla resumes hunt for New Delhi showroom with DLF: ReportTesla has resumed showroom space searches in New Delhi, exploring options with DLF, as it reconsiders entering India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/railway-stocks-rise-today-reason-why-share-price-of-irctc-rvnl-titagarh-irfc-jupiter-wagons-2648087-2024-12-11",
      "headline": "RVNL, Titagarh, Jupiter Wagons: Why railway stocks are rallying todayRailway stocks: Share price of stocks from the railway sector such as IRCTC, RVNL, Titagarh, IRFC, Jupiter Wagons, witnessed a rise in early trade on Wedesday after major announcements from the government "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vedanta-share-price-surges-over-4-check-key-factors-behind-todays-rally-2648064-2024-12-11",
      "headline": "Vedanta share price surges over 4%. Check key factors behind today's rallyVedanta share price today: The rally can be attributed to several factors, including operational enhancements, bullish market sentiment, and positive brokerage ratings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sai-life-sciences-ipo-opens-for-subscription-should-you-apply-check-all-details-latest-gmp-2648058-2024-12-11",
      "headline": "Sai Life Sciences IPO opens: Should you apply? Check all details, latest GMPSai Life Sciences IPO: The public offering includes a fresh share issue worth Rs 950 crore, while promoters and existing shareholders will offload 3.81 crore shares amounting to Rs 2,092.62 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mobikwik-ipo-open-details-latest-gmp-price-band-lot-size-subscribe-skip-review-2648055-2024-12-11",
      "headline": "Mobikwik IPO open for bidding: Subscribe or skip? Check latest GMPMobikwik IPO for bidding: The Mobikwik IPO aims to raise Rs 572 crore and will close for subscription on December 13, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-as-inflation-data-keeps-market-on-edge-adani-stocks-2648032-2024-12-11",
      "headline": "Sensex, Nifty open flat as inflation data keeps market on edgeThe S&P BSE Sensex was up 1.44 points to 81,511.49, while the NSE Nifty50 gained 13.85 points to 24,623.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vishal-mega-mart-ipo-open-for-bidding-latest-gmp-price-band-lot-size-details-should-you-subscribe-2648027-2024-12-11",
      "headline": "Vishal Mega Mart IPO: Should you subscribe? Check latest GMPVishal Mega Mart IPO: The public offering is entirely an offer for sale of 102.56 crore shares, which means the company will receive no capital from the listing and all proceeds will go to the selling shareholders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-ports-share-price-to-be-in-spotlight-today-reason-loan-deal-us-dfc-cancel-self-fund-2648001-2024-12-11",
      "headline": "Adani Ports shares to be in spotlight today. Here's why Adani group stocks: Shares of Adani Ports are expected to be in focus today after the firm shared a crucial announcement to the stock exchanges for one of its projects in Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pan-2-0-a-step-by-step-guide-to-apply-for-a-reprint-with-qr-code-2647779-2024-12-11",
      "headline": "PAN 2.0: A step-by-step guide to applying for a reprint with QR codeIndian PAN cardholders can now reprint their PAN card with a QR code for just Rs 50 through Protean or UTIITSL portals, the process of which is simple and user-friendly. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-adani-ports-enterprises-ambuja-cements-bajaj-auto-ntpc-green-energy-2647995-2024-12-11",
      "headline": "Stocks to watch today: Adani Ports, Bajaj Auto, NTPC Green EnergySeveral stocks are likely to be in focus due to recent news and developments, such as Adani Ports, Adani Green Energy, Bajaj Auto, Star Health, Awfis Space, NTPC Green, among others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-ports-group-us-funding-colombo-port-project-indictment-controversy-2647976-2024-12-11",
      "headline": "Will use own resources: Adani Ports opts out of US funding for Colombo Port projectAdani Ports said the Colombo Port project was on track for commissioning by early next year and that it will fund the project through \"internal accruals\", aligning with its capital management strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/haldirams-attracts-bids-from-alpha-wave-2-others-for-15-20-percent-stake-2647746-2024-12-10",
      "headline": "Haldiram's attracts bids from Alpha Wave, 2 others for 15-20% stake: ReportThe bids, which could mark one of India's largest private-equity deals, peg the company's valuation at Rs 75,000-80,000 crore ($8.8-9.4 billion)."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kalyan-banerjee-objectionable-remarks-against-jyotiraditya-scindia-lok-sabha-uproar-2648398-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uproar over Kalyan Banerjee's objectionable remarks against Jyotiraditya ScindiaTrinamool Congress leader Kalyan Banerjee made personal remarks against Jyotiraditya Scindia on Wednesday. The remarks were expunged by the Lok Sabha Speaker and Banerjee apologised for them, but Scindia refused to accept his apology."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/atul-subhashs-mother-says-my-son-was-tortured-faints-during-media-interaction-2648364-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Atul Subhash's mother says 'my son was tortured', faints during media interaction\"My son was tortured,\" a heartbroken mother cried out, collapsing on the road as she spoke to the media about her son Atul Subhash, a Bengaluru techie who died by suicide on December 9."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/canada-khalistani-sikh-separatists-india-denying-visas-diplomatic-row-2648162-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Canada report claims India denying visas to Khalistanis, but here is the ironyIndia-Canada row: The report claims India has been denying visas to pro-Khalistani citizens unless they explicitly denounce their support for separatism. It has come under scathing criticism from geopolitical experts over its underlying irony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-winter-session-congress-bjp-adani-soros-debate-deadlock-taxpayer-money-2648262-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "In battle of two billionaires, Indian taxpayer bleeding Rs 2.5 lakh per minuteParliament's winter session has almost been a washout because of disruptions. The BJP and the Congress are locked in a battle over billionaires Gautam Adani and George Soros. The lack of House business is resulting in waste of taxpayer money and ignoring of issues of public priority."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/sympathy-for-luigi-mangione-shooter-of-unitedhealthcare-ceo-brian-thompson-health-insurance-cost-2648222-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why wave of sympathy for killer of UnitedHealthcare CEOThe murder of UnitedHealthcare CEO Brian Thompson by Luigi Mangione, a 26-year-old Ivy League graduate, has cast a stark spotlight on the frustrations of Americans with unaffordable healthcare and health insurance companies. There is unusual sympathy with shooter Luigi Mangione."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/four-visakhapatnam-students-run-from-hostel-to-earn-money-after-being-inspired-by-lucky-bhaskar-movie-plot-2648386-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "4 Andhra students flee hostel, were 'influenced' by plot of film Lucky BhaskarFour ninth-grade students from Visakhapatnam went missing after reportedly being inspired by actor Dulquer Salmaan's film Lucky Bhaskar. The children reportedly fled with the goal of earning enough money to buy cars, similar to the film's protagonist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhar-mallikarjun-kharge-no-confidence-motion-rajya-sabha-chairman-india-bloc-2648235-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jagdeep Dhankhar a government spokesperson: Mallikarjun Kharge on no-trust moveMallikarjun Kharge alleged that Vice President Jagdeep Dhankhar's \"fidelity\" was towards the ruling BJP instead of the Constitution and constitutional tradition. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/six-asteroids-to-come-dangerously-close-to-earth-tonight-2648310-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Six asteroids to come dangerously close to Earth tonightThe most concerning of tonight's visitors, 2007 XB23, will pass just 0.00298 AU—less than 4,50,000 kilometers from Earth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pm-narendra-modi-meets-raj-kapoor-birth-cenetary-family-ranbir-kapoor-alia-bhatt-kareena-kapoor-karisma-kapoor-2648199-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM meets Raj Kapoor's family, honours his life and legacy ahead of birth centenaryPrime Minister Narendra Modi met the Kapoor family to honour legendary filmmaker Raj Kapoor's legacy ahead of his birth centenary on December 14. The Kapoor family invited the PM to the Raj Kapoor Film Festival, celebrating his 100-year legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/first-things-fast/video/mukherjee-nagar-is-delhis-upsc-capital-dying-india-today-culture-project-2647774-2024-12-10?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Mukherjee Nagar: Is Delhi's UPSC capital dying? | India Today Culture ProjectOnce the beating heart of UPSC dreams, Mukherjee Nagar was more than a locality — it was a way of life for aspirants chasing India's toughest exam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/thailand-announces-e-visa-in-india-from-january-1-60-day-exemption-to-continue-2648319-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Thailand announces e-visa for Indians from January 1, 60-day exemption to remainThailand will introduce an Electronic Travel Authorisation (ETA) system for Indian travellers from January 1, 2025, onwards for smoother entry and travel arrangements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jagannath-temple-bengal-digha-puri-mamata-banerjee-suvendu-adhikari-2648357-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Puri-like Jagannath temple construction in Bengal sparks BJP, Trinamool slugfestLeader of the Opposition and BJP leader Suvendu Adhikari said the Jagannath Temple in Puri was one of the Char Dhams and 'replicating' it was unacceptable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/despatch-review-manoj-bajpayee-sahana-goswami-kanu-behl-2648297-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Despatch review: Manoj Bajpayee shines, but script misses the markReleased-Fri Dec 13, 2024Despatch, starring Manoj Bajpayee, promises intrigue but falters in execution. Despite a stellar lead performance, the film struggles with a weak script and disjointed storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-to-find-the-right-mental-health-therapist-2648233-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How to find the right mental health therapistMental health is critical to quality of life and yet, we are often reluctant to seek professional support. Kanika Agarwal, founder of Mindpeers, explains how to go about it\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengaluru-techie-suicide-case-wife-uncle-refutes-harassment-allegations-uttar-pradesh-2648286-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Atul Subhash took out his frustration: Techie's in-laws reject harassment chargeAtul Subhash's in-laws have dismissed the accusations of harassment as \"baseless\". His mother-in-law accused Subhash of \"taking out his frustration\" on her daughter and their family."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-late-team-hotel-departure-adelaide-airport-rohit-sharma-2648336-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yashasvi Jaiswal delays departure to airport, team bus leaves without himAustralia vs India: Yashasvi Jaiswal missed the team bus to the Adelaide airport on Wednesday after arriving unusually late for the scheduled departure from the hotel. Team India players reached Brisbane in the afternoon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/revanth-reddy-kcr-and-the-politics-of-reinventing-telangana-talli-opinion-2648257-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Revanth Reddy, KCR and the politics of reinventing Telangana TalliBRS insiders believe that Reddy is aggressive in making the Congress synonymous with Telangana because he is aware of the power of Telangana sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-proposes-using-digilocker-for-reducing-unclaimed-assets-3-things-to-know-2648203-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sebi proposes using DigiLocker to help heirs claim mutual fundsSebi has proposed using DigiLocker to simplify asset management, reduce unclaimed assets, and enable faster paperless services."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengaluru-techie-suicide-atul-subhash-letter-president-justice-system-2648220-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "A dead man must speak because...: Bengaluru techie's letter to PresidentBengaluru techie suicide: In his letter to the President, which emerged on Wednesday, Atul Subhash criticised the justice system and highlighted a rising trend of false cases being filed against men by their estranged wives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-telangana-talli-the-unifying-symbol-of-states-pride-is-caught-in-a-political-divide-2648224-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Telangana Talli, the unifying symbol of state's pride, is caught in a political divideCM Revanth Reddy calls the mystical mother's new statue at the secretariat a turning point in the state's history, but the BRS charges the Congress with disrespecting Telangana identity\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/heeramandi-animal-12th-fail-8-pakistan-google-top-10-searched-shows-films-2024-indian-2648293-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistan is hooked to Indian films, shows: Google's most-searched list is proofPakistan's fascination with Indian cinema is evident as Google's 2024 trending searches reveal that Indian films and shows dominate the list in the neighbouring country. Heeramandi, 12th Fail, and Animal are among the top searches, showcasing the popularity of Indian content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shamika-ravi-funding-george-soros-pm-adviser-pawan-khera-2648043-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM's adviser clarifies funding from George Soros charge: No money came directlyShamika Ravi has shot back at Congress leader Pawan Khera after he claimed that she had received funds from an organisation funded by American investor George Soros."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/photo/kashmir-snow-winter-valley-2647588-2024-12-11?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Snowfall turns Kashmir into winter wonderland: Breathtaking photosA light dusting of snow adds a touch of winter charm to the Valley's scenic beauty."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-speaker-om-birla-meet-remove-derogatory-remarks-bjp-mps-parliament-house-function-constitution-debate-2648148-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rahul Gandhi says House must run; 'Only when Congress decides,' Trinamool scoffsRahul Gandhi asserted that the Opposition's main aim was to allow Parliament to function and insisted that the Constitution debate should take place on December 13."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/fir-cast-reunion-9-years-kavita-kaushik-aamir-ali-gopi-bhalla-sandeep-anand-2648396-2024-12-11",
      "headline": "FIR cast reunites after 9 years: Kavita Kaushik, Aamir Ali share picsThe team of the show FIR recently reunited and their pictures from the get-together have surprised fans. Kavita Kaushik, Gopi Bhalla, Aamir Ali, and Sandeep Anand were present.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/anurag-kashyap-daughter-aaliyah-kashyap-shane-wedding-kalki-koechlin-khushi-kapoor-imtiaz-ali-2648344-2024-12-11",
      "headline": "Anurag Kashyap's daughter's wedding: Ex-wife Kalki, Imtiaz Ali, celebs attendAnurag Kashyap's daughter, Aaliyah, is set to marry her longtime partner, Shane Gregoire, on December 11. Pictures from the wedding have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/despatch-review-manoj-bajpayee-sahana-goswami-kanu-behl-2648297-2024-12-11",
      "headline": "Despatch review: Manoj Bajpayee shines, but script misses the markReleased-Fri Dec 13, 2024Despatch, starring Manoj Bajpayee, promises intrigue but falters in execution. Despite a stellar lead performance, the film struggles with a weak script and disjointed storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jim-carrey-on-returning-after-retirement-bought-a-lot-of-stuff-need-the-money-2648294-2024-12-11",
      "headline": "Jim Carrey on returning after retirement: Bought a lot of stuff, need the moneyHollywood star Jim Carrey has returned to acting after earlier announcing his retirement plans. Carrey said he needed the money, which is why he agreed to do Sonic the Hedgehog 3. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-prithvi-shaw-mumbai-vs-vidarbha-syed-mushtaq-ali-trophy-rapid-49-2648358-2024-12-11",
      "headline": "Prithvi Shaw smashes rapid 49 days after going unsold in IPL auctionSyed Mushtaq Ali Trophy: Days after going unsold in the IPL mega auction, Prithvi Shaw showed glimpses of his vintage best. The 25-year-old starred with a 26-ball 49 in Mumbai's win over Vidarbha in the quarter-final on Wednesday in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-michael-kasprovicz-rohit-sharma-jasprit-bumrah-australia-vs-india-border-gavaskar-trophy-2648351-2024-12-11",
      "headline": "Jasprit Bumrah's use of bowlers was far better than Rohit Sharma: Simon KatichFormer Australia bowler Michael Kasprovicz feels Jasprit Bumrah was better in using his bowlers in Perth than Rohit Sharma in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-nathan-mcsweeney-jasprit-bumrah-gabba-test-2648346-2024-12-11",
      "headline": "Hope I can throw a few more punches at Jasprit Bumrah at Gabba: Nathan McSweeneyDespite being dismissed by Jasprit Bumrah three times across four innings, Nathan McSweeney is determined to \"throw a few more punches\" at his Indian nemesis in what promises to be an intense encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-women-vs-india-women-smriti-mandhana-perth-record-2648343-2024-12-11",
      "headline": "Mandhana scripts Women's ODI history with spectacular hundred in PerthAUS-W vs IND-W: Smriti Mandhana scored 105 runs off 109 balls with 14 fours and a six when India faced Australia in the third Women's ODI on Wednesday at the WACA in Perth. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-late-team-hotel-departure-adelaide-airport-rohit-sharma-2648336-2024-12-11",
      "headline": "Yashasvi Jaiswal delays departure to airport, team bus leaves without himAustralia vs India: Yashasvi Jaiswal missed the team bus to the Adelaide airport on Wednesday after arriving unusually late for the scheduled departure from the hotel. Team India players reached Brisbane in the afternoon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-smat-report-card-audition-for-australia-tests-2648313-2024-12-11",
      "headline": "Mohammed Shami's SMAT report card: 35.3 ov, 11 wickets in audition for Australia TestsBorder-Gavaskar Trophy: Mohammed Shami's auditions for the Australia Tests ended with a two-wicket, expensive spell in Bengal's 41-run defeat in the quarterfinals. The Indian pacer took 11 wickets in nine matches at an economy of 7.8."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-mithali-raj-gujarat-giants-auction-2648295-2024-12-11",
      "headline": "Mithali Raj parts ways with Gujarat Giants before WPL auction: Sources   Gujarat Giants and Mithali Raj have parted ways after the team failed to qualify beyond the league stages in both editions of the Women's Premier League. The Giants have the highest purse amongst all five teams in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-viswanathan-anand-birthday-plans-sambar-chocolate-cake-world-championship-2648289-2024-12-11",
      "headline": "Chess, chocolate cake and sambar rice: Viswanathan Anand reveals birthday plansChess great Viswanathan Anand thanked his fans for their birthday wishes and revealed his plans for the special day. Anand was gearing up to watch Game 13 of the Chess World Championship on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-haris-rauf-danni-wyatt-hodge-icc-player-of-the-month-for-november-2648278-2024-12-11",
      "headline": "Haris Rauf, Danni Wyatt-Hodge named ICC Players of the Month for NovemberPakistan fast bowler Haris Rauf and England women's batter Danni Wyatt-Hodge were adjudged ICC Player of the Month for November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/badminton-malaysian-doubles-specialist-coach-tan-kim-her-satwik-chiraj-india-2nd-stint-2648273-2024-12-11",
      "headline": "Malaysian doubles specialist coach Tan Kim Her returns to India for second stintThe Badminton Association of India (BAI) has appointed Malaysian doubles specialist Tan Kim Her to work with the national team for the second time. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-mithali-raj-gujarat-giants-auction-2648295-2024-12-11",
      "headline": "Mithali Raj parts ways with Gujarat Giants before WPL auction: Sources   Gujarat Giants and Mithali Raj have parted ways after the team failed to qualify beyond the league stages in both editions of the Women's Premier League. The Giants have the highest purse amongst all five teams in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-viswanathan-anand-birthday-plans-sambar-chocolate-cake-world-championship-2648289-2024-12-11",
      "headline": "Chess, chocolate cake and sambar rice: Viswanathan Anand reveals birthday plansChess great Viswanathan Anand thanked his fans for their birthday wishes and revealed his plans for the special day. Anand was gearing up to watch Game 13 of the Chess World Championship on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-haris-rauf-danni-wyatt-hodge-icc-player-of-the-month-for-november-2648278-2024-12-11",
      "headline": "Haris Rauf, Danni Wyatt-Hodge named ICC Players of the Month for NovemberPakistan fast bowler Haris Rauf and England women's batter Danni Wyatt-Hodge were adjudged ICC Player of the Month for November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/badminton-malaysian-doubles-specialist-coach-tan-kim-her-satwik-chiraj-india-2nd-stint-2648273-2024-12-11",
      "headline": "Malaysian doubles specialist coach Tan Kim Her returns to India for second stintThe Badminton Association of India (BAI) has appointed Malaysian doubles specialist Tan Kim Her to work with the national team for the second time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-womens-u19-t20-world-cup-2024-australia-squad-caoimhe-bray-2648270-2024-12-11",
      "headline": "Australia name 15-year-old WBBL sensation in U19 T20 World Cup squad Australia picked 15-year-old Caoimhe Bray for the upcoming edition of the Women's U19 T20 World Cup to be staged next year in Malaysia. The youngster recently played for Sydney Sixers in the WBBL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sports-cricket-venkatesh-iyer-madhya-pradesh-syed-mushtaq-ali-trophy-baroda-hardik-pandya-2648231-2024-12-11",
      "headline": "SMAT: Venkatesh Iyer's all-round show takes Madhya Pradesh to semi finalsVenkatesh Iyer took Madhya Pradesh to the semi-final of the Syed Mushtaq Ali Trophy 2024-25 with his all-round show in the semi final against Saurashtra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-rankings-test-harry-brook-number-one-travis-head-top-2648192-2024-12-11",
      "headline": "Harry Brook crowned as new No. 1 batter, Travis Head returns to top 10 ICC Test Rankings: England's young batting sensation Harry Brook replaced teammate Joe Root at the top of the batting charts.  Travis Head returned to the top 10 after his match-winning hundred in the Adelaide Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-arundhati-reddy-australia-women-vs-india-women-3rd-odi-annabel-sutherland-tahlia-macgrath-2648180-2024-12-11",
      "headline": "Watch: Arundhati Reddy's 'banana swing' rattles Australia in 3rd ODIIndian seamer Arundhati Reddy put on a swing masterclass during the third ODI against Australia as she scalped four wickets in her ten overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-test-rankings-virat-kohli-rohit-sharma-drop-down-rishabh-pant-jasprit-bumrah-2648181-2024-12-11",
      "headline": "ICC Test Rankings: Virat Kohli and Rohit Sharma suffer massive dips in batting chartVirat Kohli and Rohit Sharma experienced massive dips in the newly-updated ICC Test Rankings for batters on Wednesday, December 11. Kohli and Rohit had a bad time with the bat during the Adelaide Test loss to Australia in the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-3rd-test-rohit-sharma-form-captaincy-brisbane-test-harbhajan-pujara-2648160-2024-12-11",
      "headline": "Under-pressure Rohit Sharma must tick 2 boxes in Brisbane Test, say punditsAustralia vs India, 3rd Test: Rohit Sharma has been dismissed for eight single-digit scores in his last 12 innings in Tests. The India captain needs to return to form with the bat to feel more confident as a leader, said Cheteshwar Pujara and Harbhajan Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/big-bash-league-season-14-marcus-stoinis-replaces-glenn-maxwell-to-become-new-melbourne-stars-captain-2648164-2024-12-11",
      "headline": "BBL: Marcus Stoinis replaces Glenn Maxwell to become new Melbourne Stars captainMelbourne Stars have announced Marcus Stoinis as their new captain, replacing fellow all-rounder Glenn Maxwell. Stoinis has been with the Stars since the third season of the Big Bash League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-3rd-test-isa-guha-jasprit-bumrah-fitness-injury-brisbane-test-2648149-2024-12-11",
      "headline": "Isa Guha outlines major Jasprit Bumrah concern for India ahead of 3rd TestIND vs AUS: Former England cricketer Isa Guha feels that Jasprit Bumrah's fitness is a major concern for India ahead of the 3rd Test match in Brisbane. Bumrah was taken off the attack after bowling just 4 overs on Day 2 morning session of the 2nd Test match.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-test-rankings-virat-kohli-rohit-sharma-drop-down-rishabh-pant-jasprit-bumrah-2648181-2024-12-11",
      "headline": "ICC Test Rankings: Virat Kohli and Rohit Sharma suffer massive dips in batting chartVirat Kohli and Rohit Sharma experienced massive dips in the newly-updated ICC Test Rankings for batters on Wednesday, December 11. Kohli and Rohit had a bad time with the bat during the Adelaide Test loss to Australia in the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-3rd-test-rohit-sharma-form-captaincy-brisbane-test-harbhajan-pujara-2648160-2024-12-11",
      "headline": "Under-pressure Rohit Sharma must tick 2 boxes in Brisbane Test, say punditsAustralia vs India, 3rd Test: Rohit Sharma has been dismissed for eight single-digit scores in his last 12 innings in Tests. The India captain needs to return to form with the bat to feel more confident as a leader, said Cheteshwar Pujara and Harbhajan Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/big-bash-league-season-14-marcus-stoinis-replaces-glenn-maxwell-to-become-new-melbourne-stars-captain-2648164-2024-12-11",
      "headline": "BBL: Marcus Stoinis replaces Glenn Maxwell to become new Melbourne Stars captainMelbourne Stars have announced Marcus Stoinis as their new captain, replacing fellow all-rounder Glenn Maxwell. Stoinis has been with the Stars since the third season of the Big Bash League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-3rd-test-isa-guha-jasprit-bumrah-fitness-injury-brisbane-test-2648149-2024-12-11",
      "headline": "Isa Guha outlines major Jasprit Bumrah concern for India ahead of 3rd TestIND vs AUS: Former England cricketer Isa Guha feels that Jasprit Bumrah's fitness is a major concern for India ahead of the 3rd Test match in Brisbane. Bumrah was taken off the attack after bowling just 4 overs on Day 2 morning session of the 2nd Test match.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-beer-snake-marnus-labuschagne-mohammed-siraj-adelaide-test-2648132-2024-12-11",
      "headline": "Aus vs Ind: Cost of Adelaide 'beer snake' that angered Mohammed Siraj revealedA man with a beer snake who halted play during day 1 of the second Test between India and Australia revealed the cost of his creation and apologised to Marnus Labuschagne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-australian-top-order-usman-khawaja-steve-smith-david-warner-brisbane-2648122-2024-12-11",
      "headline": "Pressure on entire top order, not just Usman Khawaja: David Warner sends warningDavid Warner has sent a warning to the Australian top order, saying that the pressure will be on all of them to perform and not just Usman Khawaja. The Aussie opener, along with the likes of Steve Smith and Mitchell Marsh, has failed to inspire in the 2 Tests so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-3rd-test-brisbane-pitch-report-the-gabba-2648103-2024-12-11",
      "headline": "3rd Test: Gabba curator hints at pacey Brisbane pitchIND vs AUS: Gabba curator David Sandurski has hinted that the Brisbane track is expected to have its usual bounce and carry. Sandurski spoke about preparation of the wicket before the third Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-brisbane-arrival-video-shubman-gill-selfie-fan-airport-2648105-2024-12-11",
      "headline": "Watch: Shubman Gill poses for selfie with fan as Team India arrives in BrisbaneAustralia vs India:  Shubman Gill took time out to pose for a selfie with a fan at Brisbane Airport on Wednesday. Team India players arrived in the city ahead of the third Test, starting December 14 at the Gabba. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}