{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/advance-tax-alert-first-instalment-due-by-june-15-find-out-if-you-are-liable-2740396-2025-06-13",
      "headline": "Advance tax alert: First instalment due by June 15, find out if you are liableAdvance tax simply means paying your income tax in parts throughout the year, instead of waiting till the end. If your total tax due for the year is more than Rs 10,000, then you must pay it in advance in four instalments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iran-israel-tensions-rise-why-india-should-worry-strait-of-hormuz-plays-a-vital-role-in-global-energy-supply-2740371-2025-06-13",
      "headline": "Iran-Israel tensions rise. Why India should worryThe escalating Iran-Israel conflict poses significant challenges for India, particularly concerning oil imports and economic stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-settles-573-points-lower-nifty-below-24800-adani-ports-falls-3-percent-iran-israel-war-2740342-2025-06-13",
      "headline": "Sensex settles 573 points lower, Nifty below 24,800; Adani Ports falls 3%The S&P BSE Sensex was down by 573.38 points to end at 81,118.60, while the NSE Nifty50 lost 169.60 points to close at 24,718.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-prices-surge-india-israel-iran-conflict-geopolitical-tensions-2740330-2025-06-13",
      "headline": "Gold prices rise sharply amid Israel-Iran tensions in IndiaThe rise in gold prices is being linked to worries over a possible wider conflict in the Middle East, which has made investors turn to gold as a safe place to park money. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/oswal-pumps-ipo-subscription-june-13-to-17-rs-1387-crore-issue-strong-brokerage-ratings-2740309-2025-06-13",
      "headline": "Oswal Pumps opens Rs 1,387 crore IPO with strong brokerage backingOswal Pumps targets Rs 1,387.34 crore from IPO. Experts recommend subscribing due to strong fundamentals. IPO open until June 17, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-crash-rattles-hotel-and-ticketing-stocks-as-investor-confidence-wavers-impact-on-indian-stock-market-2740247-2025-06-13",
      "headline": "Air India crash rattles hotel and ticketing stocks, as investor confidence waversOnline travel companies were among the most affected. Shares of Thomas Cook India fell by 2.39%, trading at Rs 160.03 as of June 13, 1PM. TBO Tek dropped 1.10% to Rs 1,287.40, while Mahindra Holidays slipped 1.47% to Rs 342.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-crash-in-ahmedabad-how-airline-insurance-works-and-why-premiums-may-rise-2740170-2025-06-13",
      "headline": "Air India crash: How airline insurance works and why premiums may riseIncidents like the recent Air India crash can result in a total loss, meaning the aircraft is beyond repair with no salvageable parts. In such cases, the losses can reach around $130 million, roughly $80 million for the plane and $30-50 million in liabilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-insurance-cover-new-india-assurance-tata-aig-global-reinsurers-2740162-2025-06-13",
      "headline": "Who are the likely insurers for Air India plane crash?The plane involved in the crash was a Boeing 787-8 Dreamliner, one of the most modern aircraft used in commercial aviation. It was carrying 242 people, including 12 crew members. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-comeback-on-trial-after-air-india-dreamliner-crash-kills-241-2740174-2025-06-13",
      "headline": "Boeing's revival on trial after deadly Air India Dreamliner crash in AhmedabadThe fatal crash of Air India flight AI-171, a Boeing 787-8 Dreamliner, minutes after takeoff from Ahmedabad, has killed 241 people on board, reigniting serious doubts over Boeing's aircraft safety and corporate oversight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/oil-stocks-fall-israel-iran-war-brent-crude-oil-price-rise-bpcl-ongc-ioc-asian-paints-2740141-2025-06-13",
      "headline": "Oil shock hits Dalal Street: BPCL, ONGC, IOC, other crude-sensitive stocks fallBrent crude oil futures jumped more than 9% to touch around $75.61 per barrel, reaching a multi-month high. The gain came after Israel said it had launched what it called \"preemptive strikes\" against Iran."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-steps-in-to-contain-fallout-of-oil-price-jump-on-rupee-2740112-2025-06-13",
      "headline": "RBI steps in to contain fallout of oil price jump on rupee: ReportThe Indian rupee dropped to 86.20 against the US dollar in early trade but later recovered to 86.04, helped by the central bank's likely intervention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/aviation-stocks-fall-market-crash-spicejet-indigo-adani-enterprises-tata-group-shares-air-india-plane-crash-2740108-2025-06-13",
      "headline": "Aviation stocks tumble after Air India plane crash in AhmedabadSpiceJet's share price dropped 3.42% at the start of the trading session. InterGlobe Aviation Ltd, the company that runs IndiGo, also fell 4.83%, slipping to Rs 5,212 in early trade."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bipasha-basu-slams-trolls-postpartum-weight-gain-husband-karan-singh-grover-shows-support-2740613-2025-06-14",
      "headline": "Bipasha Basu slams trolls over postpartum weight gain, husband Karan shows supportActor Bipasha Basu addressed the online buzz about her weight gain post-motherhood in a recent Instagram post. She slammed trolls and wrote how they don't define her identity or self-worth.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-discharged-hospital-surgery-free-from-tumour-cancer-shaoib-ibrahim-2740598-2025-06-14",
      "headline": "Dipika Kakar discharged from hospital after surgery: Free from the tumourActor Dipika Kakar has been discharged from Kokilaben Hospital. In her health update, Kakar said that the tumour has been successfully removed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-traitors-season-4-begins-filming-with-alan-cumming-and-star-cast-glbs-2740571-2025-06-14",
      "headline": "The Traitors Season 4 begins filming with Alan Cumming and star castPeacock's The Traitors returns for Season 4 with Alan Cumming and a star-studded cast from Survivor, Big Brother, Drag Race, and more. Filming is underway in the Scottish Highlands.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/country-star-lauren-alaina-gives-birth-to-baby-girl-beni-doll-arnold-glbs-2740559-2025-06-14",
      "headline": "Country star Lauren Alaina gives birth to baby girl Beni Doll ArnoldCountry star Lauren Alaina and husband Cam Arnold welcomed their daughter, Beni Doll Arnold, on June 11. Alaina released a tribute song, \"Heaven Sent,\" honoring her late father and newborn.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/air-india-crash-ahmedabad-boeing-back-in-the-dock-heres-a-list-of-docus-on-the-aviation-giant-2740471-2025-06-13",
      "headline": "Air India crash reignites Boeing concerns: Here's what global documentaries revealThe recent Air India crash in Ahmedabad has once again cast a spotlight on Boeing. As questions mount about potential technical failures, several documentaries have resurfaced, shedding light on Boeing's troubled history. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-expresses-grief-over-air-india-crash-sends-prayers-2740459-2025-06-13",
      "headline": "Amitabh Bachchan expresses grief over Air India crash, sends prayersMegastar Amitabh Bachchan sent prayers for the victims and families of those affected by the Air India flight crash in Ahmedabad. Several celebrities from the Indian film industry have shared their condolences on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sabrina-carpenter-defends-racy-artwork-and-lyrics-of-her-songs-you-are-sharing-them-2740424-2025-06-13",
      "headline": "You're sharing them: Sabrina Carpenter defends racy artwork and lyrics of her songsIn a recent interview, singer-songwriter Sabrina Carpenter clapped back at the critics, addressing the backlash she received for her recent cover artwork for her upcoming album 'Man's Best Friend'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/unni-mukundan-recalls-growing-up-near-air-india-crash-site-ahmedabad-spent-24-years-2740422-2025-06-13",
      "headline": "Actor Unni Mukundan recalls growing up near Air India crash site: Spent 24 yearsMalayalam actor Unni Mukundan spent his childhood and adolescence in Ahmedabad and stayed in proximity to the Air India flight crash site until he turned 24. He expressed deep shock over the tragic crash that claimed 265 lives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-basil-joseph-to-collaborate-on-a-superhero-film-report-2740394-2025-06-13",
      "headline": "Allu Arjun, Basil Joseph to collaborate on a superhero film: ReportAfter locking 'AA22' with Atlee, superstar Allu Arjun is now eyeing a fresh collaboration with Malayalam director Basil Joseph for what's rumoured to be a superhero film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-reunion-what-it-means-for-the-fandom-and-indian-army-2740219-2025-06-13",
      "headline": "BTS reunion: What it means for the fandom and Indian ARMYBTS's six members have completed their military service, promising a long-awaited reunion with fans globally, especially the passionate Indian ARMY. Their comeback marks not just a musical event but a cultural and economic milestone poised to energise India's live music scene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-leaves-fans-swooning-with-recent-public-appearance-in-chennai-2740404-2025-06-13",
      "headline": "Ajith Kumar, 54, leaves fans swooning with recent public appearance in ChennaiActor Ajith Kumar was clicked leaving the passport office in Chennai earlier today. As soon as the clip surfaced online, fans couldn't help but gush over the look in a formal outfit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/harshvardhan-rane-sonam-bajwa-fire-incident-2740358-2025-06-13",
      "headline": "Harshvardhan Rane-Sonam Bajwa's Deewaniyat set catches fire amid celebrationA freak incident occurred on the sets of Harshvardhan Rane and Sonam Bajwa's 'Ek Deewane Ki Deewaniyat' on Thursday when helium balloons caught fire. However, no injuries were reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sana-makbul-diagnosed-with-liver-cirrhosis-hopes-to-avoid-transplant-2740372-2025-06-13",
      "headline": "Actor Sana Makbul diagnosed with liver cirrhosis, hopes to avoid transplantActor Sana Makbul's health has taken a serious turn as she's been diagnosed with liver cirrhosis. She shared that she has begun immunotherapy and is now focused on her recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonam-bajwa-joins-diljit-dosanjh-in-border-2-to-start-shooting-this-month-report-2740346-2025-06-13",
      "headline": "Sonam Bajwa joins Diljit Dosanjh in Border 2, to start shooting this month: ReportActor Sonam Bajwa reportedly joined the cast of Sunny Deol starrer 'Border 2'. She is expected to start shooting for the film by the end of June and has been paired opposite Diljit Dosanjh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-calls-rajnikanths-coolie-whistle-worthy-film-praises-lokesh-kanagaraj-2740345-2025-06-13",
      "headline": "Nagarjuna calls Rajnikanth's Coolie whistle-worthy film, praises Lokesh KanagarajAhead of his big release 'Coolie', actor Nagarjuna Akkineni spoke about working with director Lokesh Kanagaraj, calling him a 'whistle factor' and recalled the massive fan response he witnessed on the streets of Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/roshan-mathews-wwe-inspired-malayalam-wrestling-film-chatha-pacha-starts-shooting-2740321-2025-06-13",
      "headline": "Chatha Pacha: Roshan Mathew's WWE-inspired Malayalam wrestling film beginsDirected by debutant Adhvaith Nayar, the wrestling film titled 'Chatha Pacha' stars Roshan Mathew, Arjun Ashokan, Vishak Nair and Ishan Shaukath in lead roles. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/materalists-review-this-romance-glitters-but-fades-like-perfume-in-wind-2740339-2025-06-13",
      "headline": "Materialists review: This romance glitters, but fades like perfume in windReleased-Fri Jun 13, 2025'Materialists' works well when it shows a flawed, ambitious, beautiful woman just trying to live her best life. But, what she preaches, and the choices she makes, especially when it comes to men, doesn't really seem right. Also, how does a romantic film work in the absence of good intimate scenes, especially when you have such pretty faces leading the story? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/alia-bhatts-childhood-pic-with-paresh-rawal-goes-viral-fans-link-it-to-tamanna-sets-2740253-2025-06-13",
      "headline": "Munawar Faruqui hangs out with newlyweds Hina Khan and Rocky Jaiswal on show setsActors Hina Khan and Rocky Jaiswal met comedian Munawar Faruqui on the sets of their upcoming show, 'Pati Patni Aur Panga.' They were seen spending quality time on the sets of the show. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-iran-tensions-conflict-benjamin-netanyahu-nuclear-sites-hit-2740505-2025-06-13",
      "headline": "Iranian missiles hit Tel Aviv as Tehran retaliates for deadly Israeli strikesIran and Israel targeted each other with airstrikes early on Saturday after Israel launched its biggest-ever offensive against its longtime foe in a bid to prevent it from developing a nuclear weapon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-airstrikes-iran-operation-rising-lion-retaliation-nuclear-programme-khamenei-netanyahu-middle-east-tensions-conflict-2740080-2025-06-13",
      "headline": "Live: Israeli military says fresh barrage of missiles fired from Iran, one deadIsrael Iran War News Live: Iran and Israel exchanged airstrikes early Saturday, marking a dangerous escalation after Israel launched its largest-ever offensive against its longtime rival in an effort to prevent it from developing nuclear weapons. Iranian missiles and rockets struck Tel Aviv and Jerusalem, Israel's two largest cities, before dawn, leaving multiple people injured. Israel had initiated the first wave of attacks on Iran on Friday, followed by several more rounds, including a fresh wave on Saturday morning.At least 80 people have been reported killed, with dozens more injured in the ongoing strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-forms-high-level-committee-to-probe-air-india-plane-crash-in-ahmedabad-review-sops-2740580-2025-06-14",
      "headline": "Government forms high-level committee to probe Air India plane crash, review SOPsThe ministry said the panel will assess the circumstances leading to the crash and evaluate existing Standard Operating Procedures (SOPs) and safety guidelines currently in place. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-on-israels-iran-strikes-we-knew-everything-still-hopes-for-nuclear-deal-glbs-2740566-2025-06-14",
      "headline": "Trump says US knew about Israeli strikes on Iran: Tried to save them from deathUS President Donald Trump confirmed US had prior knowledge of Israel's Iran strikes, praised the operation, urged diplomacy, and reaffirmed strong US-Israel ties despite rising regional tensions and Iranian retaliation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-flight-171-crash-pilots-shaken-fear-airport-ahmedabad-london-aviation-safety-plane-heres-how-2740435-2025-06-13",
      "headline": "I don't want to be next: How Air India crash must have shaken pilots at AhmedabadThe Air India Flight 171 crash shook many, but what must it have been like for the pilots in line to take off from Ahmedabad after the ill-fated jet? Despite rigorous training, pilots admit that fear lingers, but they rely on muscle memory and a problem-solving mindset to carry on."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/aviation-body-orders-fuel-engine-system-checks-for-every-air-india-boeing-dreamliner-flight-from-june-15-2740428-2025-06-13",
      "headline": "Safety checks for Air India Boeing Dreamliners enhanced from June 15The Directorate General of Civil Aviation (DGCA) has ordered enhanced safety checks for Boeing Dreamliner planes operated by Air India, in view of the deadly Ahmedabad crash that claimed at least 265 lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/watch-how-israel-used-covert-mossad-ops-to-strike-deep-into-irans-heartland-glbs-2740586-2025-06-14",
      "headline": "Spy wars: Israel's Mossad shares rare video of covert ops deep inside IranIsrael's Mossad shared rare footage of covert drone strikes inside Iran, targeting military and nuclear sites. The strikes reportedly killed top Iranian generals and scientists, significantly escalating regional tensions.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/black-box-of-air-india-flight-recovered-from-rooftop-of-building-it-hit-in-ahmedabad-sources-2740391-2025-06-13",
      "headline": "Black box of Air India flight recovered from rooftop of building it hitA day after the Air India Ahmedabad-London flight crash in Ahmedabad, investigators have located the black box, an important device that will help investigate what led to the accident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/photo/ahmedabad-plane-crash-grief-families-victims-air-india-boeing-london-hostel-2740363-2025-06-13",
      "headline": "Grief, rubble, and fading voices: What remains after Air India plane crashIn the searing aftermath of Air India Flight 171's crash, grief blankets Ahmedabad. The Boeing 787-8, headed for London, went down minutes after takeoff, killing at least 265 people, including students at a government-run medical hostel. Now, devastated families mourn for their loved ones who left for the skies but never returned, holding onto photos, last messages and the unbearable weight of what could have been."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israeli-jet-spotted-refueling-mid-air-over-syria-likely-on-way-back-after-iran-strike-2740562-2025-06-14",
      "headline": "Israeli jet spotted refueling mid-air over Syria likely on way back after Iran strikeOnline footage reportedly shows an Israeli Boeing 707 tanker refueling an Israeli F-16 fighter jet mid-air over Syria's Deir Ezzor province."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/man-slips-while-getting-off-local-train-at-mumbais-ghatkopar-station-dies-2740511-2025-06-13",
      "headline": "Man slips while getting off local train at Mumbai's Ghatkopar station, diesA passenger died after his foot slipped and he fell on the railway track while trying to get off a local train at Mumbai's Ghatkopar station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-aus-wtc-final-day-4-rain-stands-between-south-africa-and-icc-glory-2740599-2025-06-14",
      "headline": "SA vs AUS, WTC Final Day 4: Rain stands between South Africa and ICC glorySouth Africa's hopes of sealing a historic WTC Final win over Australia may now rest as much on the skies as their bats. With rain on the forecast, Day 4 could bring tense delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-frequent-flyers-struggle-with-anxiety-and-doubts-over-air-travel-safety-2740568-2025-06-14",
      "headline": "After Air India plane crash, flyers struggle with anxiety and doubts over safetyFrom business travelers juggling multiple cities every week to NRIs flying frequently to visit family, many are now questioning the safety of air travel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israels-strike-on-iran-causing-radioactive-contamination-iaea-chief-glbs-2740569-2025-06-14",
      "headline": "Israel's strike on Iran causing radioactive contamination: IAEA chiefIAEA chief Rafael Grossi told the UN that Israel's strike on Iran's Natanz site caused radioactive and chemical contamination. Iran reported further attacks and vowed decisive retaliation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-reveals-millions-in-crypto-earnings-217-million-from-florida-properties-glbs-2740582-2025-06-14",
      "headline": "From crypto to golf resorts: Trump discloses diverse wealth sources in new filingUS President Donald Trump reported USD 57.35 million in crypto income and massive token holdings in World Liberty Financial, alongside USD 217.7 million earned from Florida resorts, in his latest financial disclosure filing.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-171-crash-ahmedabad-london-plane-bhagavat-gita-emerges-burnt-debris-site-heres-more-2740483-2025-06-13",
      "headline": "Almost-intact Bhagavad Gita emerges from burnt debris at Air India crash siteIn the wreckage of the Air India Flight 171 crash in Ahmedabad that killed 265 people, an almost-intact copy of the Bhagavad Gita was found at the site. Despite the intense fire, the holy book remained largely unharmed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-discharged-hospital-surgery-free-from-tumour-cancer-shaoib-ibrahim-2740598-2025-06-14",
      "headline": "Dipika Kakar discharged from hospital after surgery: Free from the tumourActor Dipika Kakar has been discharged from Kokilaben Hospital. In her health update, Kakar said that the tumour has been successfully removed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-496-13-06-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-helping-intercept-iranian-missiles-aimed-at-israel-report-glbs-2740558-2025-06-14",
      "headline": "US helping intercept Iranian missiles aimed at Israel: ReportThe US military assisted Israel in intercepting Iranian missiles launched in retaliation for Israeli strikes. US officials confirmed involvement but gave no details on the assets used in the operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/blood-donation-benefits-heart-health-india-blood-shortage-2740331-2025-06-14",
      "headline": "Donating blood isn't just life-saving, it is good for your heart tooIndia faces the world's largest blood shortage. Regular blood donation not only saves lives but also offers heart health benefits to donors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/history-of-it/story/ahmedabad-air-crash-vijay-rupani-air-india-1965-india-pakistan-war-sabre-gujarat-cm-balwantrai-mehta-2740230-2025-06-13",
      "headline": "When a Pak fighter jet shot down Gujarat CM's plane 60 years agoSixty years before former Gujarat CM Vijay Rupani lost his life in the Air India crash on Thursday, a sitting Gujarat CM was lost mid-air, not to malfunction, but to a Pakistani strike. During the India-Pakistan War of 1965, a Pakistani fighter shot down Balwantrai Mehta's Beechcraft aircraft, perceiving it as to be a surveillance aircraft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-faces-widespread-water-crisis-as-yamuna-levels-dip-below-normal-2740575-2025-06-14",
      "headline": "Delhi faces widespread water crisis as Yamuna levels dip below normalSeveral areas in Delhi are likely to experience water supply disruptions after a sharp drop in raw water availability forced the Wazirabad and Chandrawal water treatment plants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/khamenei-appoints-general-amir-hatami-as-new-army-chief-glbs-2740583-2025-06-14",
      "headline": "Iran's Khamenei names new Army chief after Israeli strike kills predecessorAyatollah Khamenei appointed Major General Amir Hatami as Iran's new Army Chief, urging a \"revolutionary approach\" to boost combat readiness, following a top command reshuffle after recent military tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-issues-shoot-at-sight-order-at-night-amid-ongoing-communal-tension-in-dhubri-2740581-2025-06-14",
      "headline": "Assam issues shoot-at-sight order at night amid ongoing communal tension in DhubriPeople protested in Dhubri town on Sunday after pieces of meat were found near a temple. Prohibitory orders were imposed in the town on Monday and it was withdrawn the next day."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/wtc-final-2025-sa-vs-aus-day-3-daniel-vettori-full-press-conference-2740622-2025-06-14",
      "headline": "Big challenge awaits us on Day 4, need conditions to go our way: Daniel VettoriAustralia's spin bowling coach Daniel Vettori admitted that they face a challenging situation on Day 4 as South Africa require 69 runs to win the World Test Championship (WTC) final 2025 with eight wickets in hand. However, he didn't rule out the possibility of their bowlers triggering South Africa's collapse if they find conducive conditions to bowl in. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/wtc-final-sa-vs-aus-day-3-ashwell-prince-full-press-conference-2740618-2025-06-14",
      "headline": "We understand the magnitude of the situation, but we must stay calm: Ashwell PrinceSouth Africa batting coach Ashwell Prince revealed that they understand the magnitude of the situation they've brought themselves into, but it's also crucial to remain in the moment and stay calm. South Africa are just 69 runs away from wining WTC Final 2025 against Australia and still have eight wickets in hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-kl-rahul-and-shardul-thakur-shine-on-day-1-of-indias-intra-squad-game-2740614-2025-06-14",
      "headline": "Gill, KL Rahul and Shardul Thakur shine on Day 1 of India's intra-squad gameIndia captain Shubman Gill and star batter KL Rahul scored half-centuries on Day 1 of their match simulation practice against India A in Beckenham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-aus-wtc-final-day-4-rain-stands-between-south-africa-and-icc-glory-2740599-2025-06-14",
      "headline": "SA vs AUS, WTC Final Day 4: Rain stands between South Africa and ICC glorySouth Africa's hopes of sealing a historic WTC Final win over Australia may now rest as much on the skies as their bats. With rain on the forecast, Day 4 could bring tense delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aiden-markrams-technical-adjustment-helped-him-in-wtc-final-batting-coach-reveals-2740597-2025-06-14",
      "headline": "Aiden Markram bore fruit of technical rework in WTC final, batting coach revealsSouth Africa batting coach Ashwell Prince revealed how Aiden Markram fine-tuned his technique ahead of his marvellous century in the World Test Championship (WTC) final 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-assistant-coach-daniel-vettori-says-wtc-final-not-over-yet-2740590-2025-06-14",
      "headline": "Matter of 1 wicket: Australia assistant coach Vettori says WTC Final not over yetAustralia assistant coach Daniel Vettori said that World Test Championship (WTC) final against Australia isn't over yet and they're just one wicket away from triggering a collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wtc-final-lords-sa-vs-aus-matthew-hayden-steyn-cummins-2740552-2025-06-14",
      "headline": "Huge error: Matthew Hayden, Dale Steyn slam Australia's tactics in WTC FinalFormer cricketers Matthew Hayden and Dale Steyn questioned Australia's defensive approach with the ball on Day 3 of the WTC Final. Australia now have just 69 runs to defend after Day 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ultimate-table-tennis-jaipur-patriots-vs-dabang-delhi-semi-final-2740579-2025-06-14",
      "headline": "Jaipur Patriots edge Dabang Delhi to reach first-ever UTT Grand FinalIn a nail-biting -final, Jaipur Patriots held their nerve to edge past Dabang Delhi TTC 8-7, with Sreeja Akula sealing the deal after Yashansh Malik's stunning upset over Delhi skipper Sathiyan Gnanasekaran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wtc-final-sa-vs-aus-dale-steyn-day-4-prediction-2740551-2025-06-13",
      "headline": "SA will be chasing their hardest 69 runs vs AUS on Day 4: SteynSouth Africa are on the verge of a historic win in the World Test Championship Final, but Dale Steyn believes the side will face the toughest 69 runs they've ever had to score on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/temba-bavuma-lion-heroics-wtc-final-sa-vs-aus-injury-hamstring-fifty-2740546-2025-06-13",
      "headline": "Standing like a lion: Bavuma's heroic innings earns respect of fans in WTC FinalTemba Bavuma's lion-hearted stand at Lord's, battling injury and pressure in South Africa's record WTC chase, has become the emotional heartbeat of a nation dreaming of its first ICC men's trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wtc-final-australia-vs-south-africa-aiden-markram-temba-bavuma-2740538-2025-06-13",
      "headline": "Markram's flair, Bavuma's grit bring South Africa on the cusp of historyAiden Markram and Temba Bavuma showed remarkable resilience on day 3 of the World Test Championship final. Their fightback against Australia has brought South Africa on the cusp of history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wtc-final-lords-sa-vs-aus-matthew-hayden-steyn-cummins-2740552-2025-06-14",
      "headline": "Huge error: Matthew Hayden, Dale Steyn slam Australia's tactics in WTC FinalFormer cricketers Matthew Hayden and Dale Steyn questioned Australia's defensive approach with the ball on Day 3 of the WTC Final. Australia now have just 69 runs to defend after Day 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ultimate-table-tennis-jaipur-patriots-vs-dabang-delhi-semi-final-2740579-2025-06-14",
      "headline": "Jaipur Patriots edge Dabang Delhi to reach first-ever UTT Grand FinalIn a nail-biting -final, Jaipur Patriots held their nerve to edge past Dabang Delhi TTC 8-7, with Sreeja Akula sealing the deal after Yashansh Malik's stunning upset over Delhi skipper Sathiyan Gnanasekaran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wtc-final-sa-vs-aus-dale-steyn-day-4-prediction-2740551-2025-06-13",
      "headline": "SA will be chasing their hardest 69 runs vs AUS on Day 4: SteynSouth Africa are on the verge of a historic win in the World Test Championship Final, but Dale Steyn believes the side will face the toughest 69 runs they've ever had to score on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/temba-bavuma-lion-heroics-wtc-final-sa-vs-aus-injury-hamstring-fifty-2740546-2025-06-13",
      "headline": "Standing like a lion: Bavuma's heroic innings earns respect of fans in WTC FinalTemba Bavuma's lion-hearted stand at Lord's, battling injury and pressure in South Africa's record WTC chase, has become the emotional heartbeat of a nation dreaming of its first ICC men's trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wtc-final-australia-vs-south-africa-aiden-markram-temba-bavuma-2740538-2025-06-13",
      "headline": "Markram's flair, Bavuma's grit bring South Africa on the cusp of historyAiden Markram and Temba Bavuma showed remarkable resilience on day 3 of the World Test Championship final. Their fightback against Australia has brought South Africa on the cusp of history."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}