{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-green-energy-stocks-share-price-rise-9-percent-today-explained-why-cfo-statement-bond-sale-2643338-2024-12-02",
      "headline": "Explained: Why Adani Green Energy shares rose 9% todayAdani Green Energy share price: The rise in shares marked the fourth consecutive session of gains for the stock, which has climbed an impressive 60.66% in just four trading days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-lower-gdp-growth-concerns-key-rbi-decision-2643317-2024-12-02",
      "headline": "Sensex, Nifty open lower as growth concerns loom ahead of key RBI decisionThe S&P BSE Sensex was down 228.52 points to 79,574.27, while the NSE Nifty50 lost 101.55 points to 24,029.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suraksha-diagnostic-ipo-day-2-should-you-subscribe-skip-based-latest-gmp-2643309-2024-12-02",
      "headline": "Suraksha Diagnostic IPO: Should you subscribe based on latest GMP?The price band for the IPO has been set between Rs 420 and Rs 441 per share. Each application must include a minimum of 34 shares, making the smallest investment for retail investors Rs 14,994 at the upper price limit."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stock-why-adani-green-energy-shares-will-be-in-focus-today-cfo-jugeshinder-singh-bond-sale-2643295-2024-12-02",
      "headline": "Adani group stock: Why Adani Green Energy shares will be in focus todayShares of Adani Green Energy rose by 20.64% last week, reflecting renewed investor interest. However, the stock remains down by 17.88% over the past month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-adani-group-hyundai-tata-motors-cochin-shipyard-eicher-motors-cipla-2643277-2024-12-02",
      "headline": "Stocks to watch today: Hyundai, Tata Motors, Cochin Shipyard, Eicher MotorsIn today's trade, several stocks, including Eicher Motors, Tata Motors, Hyundai, and Cipla, are expected to be in focus due to recent developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q2-gdp-growth-slows-lowest-in-six-quarters-2642308-2024-11-29",
      "headline": "India's Q2 GDP slows to 5.4%, hits 18-month low on weak consumptionThe weaker-than-expected GDP growth raises concerns about the sustainability of economic recovery, particularly as key sectors like manufacturing and mining face challenges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-nifty-closing-bell-q2-gdp-data-in-focus-2642284-2024-11-29",
      "headline": "Sensex, Nifty end higher as heavyweight stocks gain; Q2 GDP data in focusThe S&P BSE Sensex was up 759.05 points to 79,802.79 at the closing bell, while the NSE Nifty50 rose 216.95 points to 24,131.10. Both the indices had declined roughly 1.5% yesterday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pan-2-project-faqs-who-can-apply-qr-code-security-other-key-details-2642232-2024-11-29",
      "headline": "PAN 2.0 FAQs: Who can apply, QR code feature, and other key detailsPAN 2.0 is a government initiative combining PAN and TAN systems with a QR code for secure and quick identity verification, simplifying taxpayer registration and promoting a tech-driven tax ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rebound-today-sensex-700-points-nifty-gains-key-factors-bull-run-dalal-street-2642204-2024-11-29",
      "headline": "Sensex surges 800 points: Key factors behind bull run on Dalal StreetStock market today: Sensex and Nifty regained their footing, driven by improved investor sentiment and stock-specific action. Read on to find out the key reasons behind today's rebound on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-ipo-stock-market-listing-should-you-hold-for-long-term-or-book-profit-now-2642133-2024-11-29",
      "headline": "Enviro Infra makes solid market debut: Should you hold or book profit?Enviro Infra IPO listing: Shares of Enviro Infra Engineers have dipped slightly following their strong listing, prompting investors to weigh whether to hold onto their shares or book profits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-gain-sharply-stock-market-key-factors-why-2642119-2024-11-29",
      "headline": "Adani Green, Adani Energy Solutions: Why these Adani Group stocks are gainingAdani Green Energy led the surge, rising 14.64% to hit Rs 1,247.55. Adani Energy Solutions followed, reaching a day's high of Rs 825.85. Most other Adani Group stocks also registered gains in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-engineers-stock-market-listing-49-percent-premium-ipo-price-2642108-2024-11-29",
      "headline": "Enviro Infra shares make strong debut, list at 49% premium over IPO priceEnviro Infra Engineers listing: The shares opened at Rs 220 on the NSE, marking a 48.64% jump from the IPO price of Rs 148. On the BSE, the stock listed at Rs 218, reflecting a 47.29% premium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-jumps-700-points-nifty-rises-adani-stocks-gain-2642097-2024-11-29",
      "headline": "Sensex rallies 700 points, Nifty above 24,000; Adani stocks surgeThe S&P BSE Sensex surged 663 points to reach 79,702.09 by 10:33 am, while the NSE Nifty50 climbed 154.60 points to trade at 24,084.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-drops-1200-points-nifty-falls-it-stocks-us-inflation-data-interest-rate-cut-2641678-2024-11-28",
      "headline": "Sensex crashes 1,200 points, Nifty falls below 24,000; IT stocks tumbleAt the closing bell, the S&P BSE Sensex ended 1190.34 points lower at 79,043.74, while the NSE Nifty50 fell 360.75 to settle below 24,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/renewable-energy-stocks-could-make-you-greener-ntpc-suzlon-jsw-adani-5-reasons-why-market-tips-2641640-2024-11-28",
      "headline": "Renewable energy stocks could make your portfolio green. 5 reasons whyWith the global shift towards clean energy, renewable energy stocks have proven to be rewarding for many, delivering strong returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-ltim-hcltech-tcs-information-technology-stocks-sensex-nifty-2641611-2024-11-28",
      "headline": "Infosys, LTIM, HCLTech, TCS: Why IT stocks are tumbling todayInfosys led the decline with a 3% drop, while Tech Mahindra and LTIMindtree were down by 2.5%. HCLTech, MPhasis, and TCS also recorded losses exceeding 2%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/grain-to-glass-how-this-firm-pernod-ricard-india-distillery-blending-sustainability-india-alcohol-industry-2641594-2024-11-28",
      "headline": "How this firm is blending sustainability in India's alcohol industryThe company's innovative approach, dubbed 'Grain to Glass', is transforming how businesses can contribute to environmental and social development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-jump-today-shajapur-solar-project-exchange-filing-2641576-2024-11-28",
      "headline": "Explained: Why newly-listed NTPC Green Energy shares gained 5% todayNTPC Green Energy share price: The latest surge follows NTPC Green Energy's announcement regarding the commercial operation of the first phase of its Shajapur Solar Project in Madhya Pradesh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/suraksha-diagnostic-ipo-opens-tomorrow-details-check-price-band-issue-size-latest-gmp-2641573-2024-11-28",
      "headline": "Suraksha Diagnostic IPO opens tomorrow: Check price band, issue size, GMPSuraksha Diagnostic IPO: The IPO will open for bidding on Friday and is expected to list on the stock exchanges on December 6, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-rally-rise-above-rs-90-citi-target-is-it-time-to-buy-2641559-2024-11-28",
      "headline": "Ola Electric shares continue positive rally, rise above Rs 90. Time to buy?Ola Electric share price: With this, the stock has gained over 35% in the last five sessions and has surpassed the Rs 90 target set by Citi on November 26."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/farmers-protest-march-noida-delhi-demands-parliament-complex-security-measures-route-advisory-2643294-2024-12-02",
      "headline": "UP farmers' march from Noida to Delhi today, barricades installed, routes divertedFarmers from Uttar Pradesh will begin their protest at 12 pm near the Mahamaya Flyover in Noida and march towards Delhi on foot and tractors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/why-joe-biden-pardoned-son-hunter-biden-guncase-earlier-pledges-no-clemency-white-house-2643305-2024-12-02",
      "headline": "Biden pardons Biden: Father's love trumps allIn his final days as President, Joe Biden issued a controversial pardon for his son Hunter Biden, overturning his earlier public promises never to grant him clemency. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-finalised-as-chief-minister-claims-senior-bjp-leader-report-2643237-2024-12-01",
      "headline": "Devendra Fadnavis finalised as Chief Minister, claims senior BJP leader: ReportCaretaker Chief Minister Eknath Shinde has said that he would fully support the decision taken by PM Modi and Home Minister Amit Shah with regard to the chief minister's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-border-iskcon-members-denied-entry-to-india-benapole-hindu-minorities-2643273-2024-12-02",
      "headline": "Bangladesh stops over 50 Iskcon members from crossing into India: ReportsBangladesh border authorities said they received instructions from higher authorities to deny entry to 54 members of the Hindu spiritual organisation Iskcon into India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/can-you-lose-weight-without-working-out-2642365-2024-12-02",
      "headline": "Can you lose weight without working out? In a recent viral interview, actress Himanshi Khurana revealed how she shed 11 kgs through a simple diet and without going to the gym.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-bgt-wtc-final-scenario-south-africa-vs-sri-lanka-2643334-2024-12-02",
      "headline": "Road to WTC Final: What is the updated scenario ahead of Adelaide Test?India brought themselves right back into the World Test Championship Final contention with a resounding Test match win in Perth. But how realistic are India's chances actually? Let's have a look.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lok-sabha-s-jaishankar-speech-india-china-border-agreement-lac-bilateral-relations-parliament-winter-session-2643296-2024-12-02",
      "headline": "S Jaishankar to brief Lok Sabha today on India-China border truce progressFor the first time since India and China reached an agreement on disengagement at the Line of Actual Control, External Affairs Minister S Jaishankar is expected to address the Lok Sabha today on developments in the bilateral relations between the two nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/7-maoists-including-top-commander-killed-in-telanganas-mulugu-district-encounter-2643350-2024-12-02",
      "headline": "7 Naxals killed in encounter with security forces in Telangana's MuluguSeven Maoists, including a top commander, were killed in an encounter with Telangana's anti-naxal Greyhounds in Mulugu district. The early morning gunfight in Chalpaka forests also led to the seizure of several weapons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-retirement-temporary-break-from-films-2643268-2024-12-02",
      "headline": "'12th Fail' actor Vikrant Massey announces break from filmsActor Vikrant Massey announced a temporary break from films. He shared a note on Instagram announcing his decision and stated that it was time to recalibrate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/mla-basanagouda-patil-yatnal-by-vijayendra-yediyurappa-rift-show-cause-notice-2643331-2024-12-02",
      "headline": "BJP's notice to Karnataka MLA Yatnal amid public spat with state party chiefSenior party MLA Basanagouda Patil Yatnal has been consistently attacking party state chief BY Vijayendra and accusing him of promoting dynasty politics and contributing to the BJP's poll losses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-winter-session-india-bloc-bjp-congress-nda-gautam-adani-bribery-issue-sambhal-violence-bangladeshi-hindus-s-jaishankar-lok-sabha-rajya-sabha-india-china-border-2643313-2024-12-02",
      "headline": "Live: Parliament session to resume today after washout for 4 consecutive daysParliament Session Live: After four days of no business being transacted in both the Lok Sabha and Rajya Sabha due to Opposition protests last week, proceedings in both Houses will resume at 11 am today. Before the Parliament session resumes, INDIA bloc leaders will meet Congress chief Mallikarjun Kharge at his office. Opposition MPs have been demanding a discussion on the Sambhal violence and the US's indictment of Gautam Adani on bribery charges. External Affairs Minister S Jaishankar is expected to make a statement in the Lok Sabha on the India-China border agreement as well. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-passengers-stranded-kuwait-embassy-visa-gulf-air-mumbai-manchester-2643250-2024-12-01",
      "headline": "Indian passengers stranded in Kuwait for 13 hours finally leave for ManchesterThe Indian Embassy in Kuwait said that it had taken up the matter immediately with Gulf Air, and a team from the embassy was present at the airport to assist the passengers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/desi-groom-plays-ludo-with-friends-on-phone-amid-wedding-ceremony-viral-pic-2643330-2024-12-02",
      "headline": "Groom plays Ludo with friends on phone amid wedding ceremony. Viral picA groom playing Ludo on his phone during his wedding ceremony has taken the internet by storm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-siraj-form-jasprit-bumrah-ind-vs-aus-bgt-2643308-2024-12-02",
      "headline": "Keep talking to Jassi bhai: Siraj shows trust in Bumrah to find success in AUSMohammed Siraj has revealed that chats with Jasprit Bumrah have helped him get into rhythm. The India pacer found form in the Adelaide Test match after a dry home season earlier this year. Siraj opened up on his form slump and how he got back to his best."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-government-uttar-pradesh-maha-kumbh-area-new-district-2643315-2024-12-02",
      "headline": "Uttar Pradesh declares Maha Kumbh area as new district ahead of Kumbh MelaAhead of a grand religious event, Maha Kumbh Mela, slated for January 2025, Yogi Adityanath's government in Uttar Pradesh declared Maha Kumbh area as a new district. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/top-stories/story/popular-kannada-tv-actor-shobitha-dies-by-suicide-at-hyderabad-home-2643260-2024-12-02",
      "headline": "Kannada TV actor Shobitha dies by suicide at Hyderabad homeThe actor, originally from Sakleshpur in Karnataka, stepped away from acting projects after her marriage last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/story/filmfare-ott-awards-2024-winners-kareena-kapoor-best-actress-diljit-dosanjh-best-actor-chamkila-jaane-jaan-heeramandi-2643292-2024-12-02",
      "headline": "Filmfare OTT Awards: Kareena bags Best Actress, Diljit wins Best ActorThe Filmfare OTT Awards, held in Mumbai on December 1, was a star-studded affair. Nominations across 39 categories, celebrating the best in web series and films, were revealed earlier in the evening before the grand ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-pm-justin-trudeau-vowed-tougher-border-controls-meeting-with-president-elect-donald-trump-official-2643258-2024-12-02",
      "headline": "Trudeau falls in line, promises tougher border controls at dinner with TrumpJustin Trudeau flew to Florida on Friday to have dinner with Donald Trump, who has promised to slap tariffs on Canadian imports unless Ottawa prevented migrants and drugs from crossing the frontier."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cyclone-fengal-live-updates-schools-colleges-shut-puducherry-tamil-nadu-heavy-rainfall-chennai-airport-operations-resume-2643267-2024-12-02",
      "headline": "Cyclone Fengal weakens, schools shut today in Puducherry and parts of Tamil Nadu Live UpdatesCyclone Fengal update: All schools and colleges were closed for today in Puducherry and parts of Tamil Nadu as heavy rainfall triggered by Cyclone Fengal continued in those places. The cyclone weakened into a deep depression."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-leone-hyderabad-event-at-pub-cancelled-last-minute-police-permission-denied-2643286-2024-12-02",
      "headline": "Sunny Leone's Hyderabad event cancelled last minute after police interventionSunny Leone was invited to perform at the Illuzion Pub in Jubilee Hills, Hyderabad on November 30. However, the event was cancelled at the last minute after police officers denied permission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/dua-lipa-levitating-woh-ladki-jo-mashup-perfromance-mumbai-concert-shah-rukh-khan-2643325-2024-12-02",
      "headline": "Dua Lipa reacts to Levitating X Woh Ladki Jo mashup performance Singer Dua Lipa reacted to the viral mashup of her song Levitating with Woh Ladki Jo which she performed at her Mumbai concert. She commented on a fan's Instagram reel. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/maharashtra/story/maharashtra-congress-candidate-bunty-shekle-show-cause-notice-rss-agent-nana-patole-sabotage-defeat-bjp-collusion-2643272-2024-12-02",
      "headline": "Congress candidate's 'RSS agent' charge against Nana Patole: He destroyed partyBunty Shelke, the Congress candidate from Nagpur Central, blamed Maharashtra Congress chief Nana Patole for his defeat, alleging sabotage and a lack of party support. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/tamil-nadu-bjp-chief-k-annamalai-on-actor-vijays-party-tvks-foray-into-politics-khichdi-politics-2643262-2024-12-02",
      "headline": "Annamalai mocks Vijay's TVK: Khichdi politics by mixing rasam, curd and sambarSpeaking at a conclave in Coimbatore, Annamalai dismissed TVK's ideological approach as \"khichdi politics\", referring to its blend of various political philosophies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ex-bangladesh-pm-khaleda-zias-son-48-others-acquitted-2004-grenade-attack-case-2643278-2024-12-02",
      "headline": "Bangladesh court acquits Khaleda Zia's son, 48 others in 2004 grenade attackBangladesh's High Court acquitted former Prime Minister Khaleda Zia's son, Tarique Rahman, and 48 others, overturning their verdicts in a deadly 2004 grenade attack on a political rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/dua-lipa-levitating-woh-ladki-jo-mashup-perfromance-mumbai-concert-shah-rukh-khan-2643325-2024-12-02",
      "headline": "Dua Lipa reacts to Levitating X Woh Ladki Jo mashup performance Singer Dua Lipa reacted to the viral mashup of her song Levitating with Woh Ladki Jo which she performed at her Mumbai concert. She commented on a fan's Instagram reel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sharib-hashmi-job-16-years-in-cinema-the-family-man-films-2643304-2024-12-02",
      "headline": "Actor Sharib Hashmi reflects on 16 years in cinemaActor Sharib Hashmi shared a post on social media and reminisced about the time when he took a leap of faith and joined cinema. He even gave a shout-out to people who helped him in his career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/story/filmfare-ott-awards-2024-winners-kareena-kapoor-best-actress-diljit-dosanjh-best-actor-chamkila-jaane-jaan-heeramandi-2643292-2024-12-02",
      "headline": "Filmfare OTT Awards: Kareena bags Best Actress, Diljit wins Best ActorThe Filmfare OTT Awards, held in Mumbai on December 1, was a star-studded affair. Nominations across 39 categories, celebrating the best in web series and films, were revealed earlier in the evening before the grand ceremony."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-leone-hyderabad-event-at-pub-cancelled-last-minute-police-permission-denied-2643286-2024-12-02",
      "headline": "Sunny Leone's Hyderabad event cancelled last minute after police interventionSunny Leone was invited to perform at the Illuzion Pub in Jubilee Hills, Hyderabad on November 30. However, the event was cancelled at the last minute after police officers denied permission."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/cricket-bgt-ind-vs-aus-adelaide-pink-ball-test-travis-head-press-conference-2643347-2024-12-02",
      "headline": "Australia know what they did wrong in Perth: Travis Head ahead of pink ball TestBorder-Gavaskar Trophy: Australia batter Travis Head feels that the hosts know what they did wrong in Perth. The batter has asked for more energy from the side before the pink ball Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-juan-martin-del-potro-bids-farewell-to-tennis-wins-final-match-vs-novak-djokovic-2643343-2024-12-02",
      "headline": "Juan Martin del Potro bids farewell to tennis, wins final match vs Novak DjokovicJuan Martin del Potro bid an emotional farewell to tennis, defeating Novak Djokovic in his final match. Despite a career marred by injuries, the 2009 US Open champion leaves a legacy of resilience, passion, and unforgettable moments on the court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-bgt-wtc-final-scenario-south-africa-vs-sri-lanka-2643334-2024-12-02",
      "headline": "Road to WTC Final: What is the updated scenario ahead of Adelaide Test?India brought themselves right back into the World Test Championship Final contention with a resounding Test match win in Perth. But how realistic are India's chances actually? Let's have a look.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/u-19-asia-cup-to-t10-league-mis-recruit-ghazanfar-plays-4-matches-in-3-days-2643324-2024-12-02",
      "headline": "U-19 Asia Cup to T10 League: MI's recruit Ghazanfar plays 4 matches in 3 daysAllah Ghazanfar turned heads by bagging a Rs 4.80 crore deal with MI in the IPL auction. He recently came into the limelight for participating in 4 matches in a span of 3 days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-siraj-form-jasprit-bumrah-ind-vs-aus-bgt-2643308-2024-12-02",
      "headline": "Keep talking to Jassi bhai: Siraj shows trust in Bumrah to find success in AUSMohammed Siraj has revealed that chats with Jasprit Bumrah have helped him get into rhythm. The India pacer found form in the Adelaide Test match after a dry home season earlier this year. Siraj opened up on his form slump and how he got back to his best."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-first-look-adelaide-pitch-pink-ball-test-match-2643297-2024-12-02",
      "headline": "First look at Adelaide pitch ahead of pink ball Test matchBorder-Gavaskar Trophy: Australia are expected to prepare a spicy pitch in Adelaide - for the pink ball Test match. Here's the first look at the pitch coming out of the Adelaide Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-manchester-city-vs-liverpool-highlights-man-united-vs-everton-amorim-2643290-2024-12-02",
      "headline": "PL wrap: Man City's misery continues vs Liverpool, United shine under AmorimPremier League wrap: Pep Guardiola's misery deepened after Manchester City lost 0-2 to Liverpool on Sunday, December 1. On the other hand, Manchester United under new coach Ruben Amorim lifted their moods with a 4-0 win over Everton.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bgt-ind-vs-aus-mohammed-siraj-form-bharat-arun-jasprit-bumrah-morne-morkel-2643287-2024-12-02",
      "headline": "Mohammed Siraj credits Bharat Arun, Morne Morkel for form-revivalIndia pacer Mohammed Siraj said that he was enjoying his bowling once again. Siraj said that before the Border-Gavaskar Trophy, he spoke to Bharat Arun and Morne Morkel which helped him return to his best form.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wi-vs-ban-2nd-test-jayden-seals-masterclass-stuns-visitors-on-day-2-2643274-2024-12-02",
      "headline": "WI vs BAN, 2nd Test: Seals masterclass stuns visitors on Day 2WI vs BAN: Fast bowler Jayden Seales stunned Bangladesh with his riveting efort. Seales bowled 15.5 overs out of which 10 were maiden and gave away just 5 runs. The pacer also picked up 4 wickets to destroy Bangladesh middle order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pat-cummins-best-captains-mayank-markande-2643251-2024-12-01",
      "headline": "Cummins is one of the best captains I have played under: Markande IPL 2025: Mayank Markande said that he enjoyed playing under Pat Cummins in the previous edition of the tournament. The 27-year-old will play for the Kolkata Knight Riders (KKR) next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-premier-league-liverpool-beat-manchester-city-pep-guardiola-mohamed-salah-anfield-2643248-2024-12-01",
      "headline": "Liverpool outplay Manchester City as Guardiola's side remain winless in 7 gamesManchester City's woes continued as Liverpool beat them 2-0 to extend their lead at the top of the table to 9 points. City have now lost 4 consecutive games in the Premier League and have 6 defeats in the last 7 matches.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-manchester-city-vs-liverpool-highlights-man-united-vs-everton-amorim-2643290-2024-12-02",
      "headline": "PL wrap: Man City's misery continues vs Liverpool, United shine under AmorimPremier League wrap: Pep Guardiola's misery deepened after Manchester City lost 0-2 to Liverpool on Sunday, December 1. On the other hand, Manchester United under new coach Ruben Amorim lifted their moods with a 4-0 win over Everton.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bgt-ind-vs-aus-mohammed-siraj-form-bharat-arun-jasprit-bumrah-morne-morkel-2643287-2024-12-02",
      "headline": "Mohammed Siraj credits Bharat Arun, Morne Morkel for form-revivalIndia pacer Mohammed Siraj said that he was enjoying his bowling once again. Siraj said that before the Border-Gavaskar Trophy, he spoke to Bharat Arun and Morne Morkel which helped him return to his best form.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wi-vs-ban-2nd-test-jayden-seals-masterclass-stuns-visitors-on-day-2-2643274-2024-12-02",
      "headline": "WI vs BAN, 2nd Test: Seals masterclass stuns visitors on Day 2WI vs BAN: Fast bowler Jayden Seales stunned Bangladesh with his riveting efort. Seales bowled 15.5 overs out of which 10 were maiden and gave away just 5 runs. The pacer also picked up 4 wickets to destroy Bangladesh middle order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pat-cummins-best-captains-mayank-markande-2643251-2024-12-01",
      "headline": "Cummins is one of the best captains I have played under: Markande IPL 2025: Mayank Markande said that he enjoyed playing under Pat Cummins in the previous edition of the tournament. The 27-year-old will play for the Kolkata Knight Riders (KKR) next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-premier-league-liverpool-beat-manchester-city-pep-guardiola-mohamed-salah-anfield-2643248-2024-12-01",
      "headline": "Liverpool outplay Manchester City as Guardiola's side remain winless in 7 gamesManchester City's woes continued as Liverpool beat them 2-0 to extend their lead at the top of the table to 9 points. City have now lost 4 consecutive games in the Premier League and have 6 defeats in the last 7 matches.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-ishan-kishan-departure-mumbai-indians-hardik-pandya-2643246-2024-12-01",
      "headline": "Knew would be difficult to get Ishan Kishan in auction: MI captain Hardik PandyaMumbai Indians captain Hardik Pandya admitted that the franchise knew it would be difficult to get Ishan Kishan in the IPL 2025 Auction. Kishan moved on from MI and joined Sunrisers Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/badminton-syed-modi-international-pv-sindhu-retirement-talk-2643241-2024-12-01",
      "headline": "PV Sindhu brushes off retirement talk: Definitely playing next couple of yearsPV Sindhu has brushed aside talk of retirement as the Indian ace aims to definitely play for the next couple of years. Sindhu claimed her third title win at the Syed Modi International on Sunday, December 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-2024-d-gukesh-ding-liren-final-2643232-2024-12-01",
      "headline": "I just like playing chess: Gukesh on rejecting early draw against Ding World Chess Championship 2024: D Gukesh opened up on why he rejected an early draw in the sixth game of the final against Ding Liren on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-premier-league-manchester-united-ruben-amorim-rashford-zirzkee-chelsea-2643231-2024-12-01",
      "headline": "Premier League: Manchester United thump Everton 4-0, Chelsea go joint-secondRuben Amorim's Old Trafford Premier League debut ended in fine fashion as Manchester United thrashed Everton on Sunday, December 1. Chelsea went joint-second in the league after they defeated Aston Villa 3-0 at Stamford Bridge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-zimbabwe-vs-pakistan-1st-t20i-sufiyaan-muqeem-abrar-ahmed-tayyab-tahir-2643228-2024-12-01",
      "headline": "Pakistan thump Zimbabwe in opener after Muqeem, Abrar, Tahir shineZIM vs PAK: Pakistan beat Zimbabwe by 57 runs in the opening T20I at the Queens Sports Club in Bulawayo after Sufiyaan Muqeem, Abrar Ahmed picked up three wickets each and Tayyab Tahir played a cameo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-cooch-behar-trophy-suman-kumar-bihar-10-wickets-hat-trick-2643221-2024-12-01",
      "headline": "Watch: Suman Kumar makes history with 10 wickets, hat-trick vs RajasthanCooch Behar Trophy: Bihar left-arm spinner Suman Kumar took 10 wickets and a hat-trick in the same innings during the match against Rajasthan at the Moin Ul Haq Stadium in Patna. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-vs-sri-lanka-gerald-coetzee-ruled-2nd-test-pakistan-series-2643219-2024-12-01",
      "headline": "SA vs SL: Gerald Coetzee ruled out of 2nd Test and Pakistan series due to injurySouth African fast bowler Gerald Coetzee will miss the second Test against Sri Lanka and the Pakistan tour due to a groin injury. Scans confirmed a strain in his right groin muscle, sidelining him for four to six weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-zimbabwe-vs-pakistan-1st-t20i-sufiyaan-muqeem-abrar-ahmed-tayyab-tahir-2643228-2024-12-01",
      "headline": "Pakistan thump Zimbabwe in opener after Muqeem, Abrar, Tahir shineZIM vs PAK: Pakistan beat Zimbabwe by 57 runs in the opening T20I at the Queens Sports Club in Bulawayo after Sufiyaan Muqeem, Abrar Ahmed picked up three wickets each and Tayyab Tahir played a cameo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-cooch-behar-trophy-suman-kumar-bihar-10-wickets-hat-trick-2643221-2024-12-01",
      "headline": "Watch: Suman Kumar makes history with 10 wickets, hat-trick vs RajasthanCooch Behar Trophy: Bihar left-arm spinner Suman Kumar took 10 wickets and a hat-trick in the same innings during the match against Rajasthan at the Moin Ul Haq Stadium in Patna. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-vs-sri-lanka-gerald-coetzee-ruled-2nd-test-pakistan-series-2643219-2024-12-01",
      "headline": "SA vs SL: Gerald Coetzee ruled out of 2nd Test and Pakistan series due to injurySouth African fast bowler Gerald Coetzee will miss the second Test against Sri Lanka and the Pakistan tour due to a groin injury. Scans confirmed a strain in his right groin muscle, sidelining him for four to six weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-zimbabwe-vs-pakistan-mujeeb-ur-rahman-odi-t20i-squads-2643203-2024-12-01",
      "headline": "Mujeeb returns in Afghanistan ODI, T20I squads for Zimbabwe tourZIM vs AFG: Mujeeb Ur Rahman has been picked in the Afghanistan ODI and T20I squads for the tour of Zimbabwe. The off-spinner recently recovered from an injury and is currently taking part in the Abu Dhabi T10 League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jay-shah-bcci-icc-new-chairman-test-cricket-womens-cricket-la-olympics-2028-2643197-2024-12-01",
      "headline": "Jay Shah promises special focus on Test and women's cricket as new ICC chairmanThe newly elected Chairman of the ICC, Jay Shah has vowed to keep Test cricket as the pinnacle of the game under his tenure and also promised to work on the development of women's cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-d-gukesh-vs-ding-liren-game-6-report-singapore-2643193-2024-12-01",
      "headline": "World Chess Championship: D Gukesh holds Ding Liren to a draw after 46 movesGame 6 of the World Chess Championship match between India's D Gukesh and Ding Liren has ended in a draw on Sunday, December 1. Both men decided to settle for a draw after 46 moves during the game on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-scott-boland-threat-warm-up-adelaide-test-2643188-2024-12-01",
      "headline": "India see off Boland threat in warm-ups, give Australia more to think ofAUS vs IND: Fast bowler Scott Boland is set to replace Josh Hazlewood in the playing XI when Australia take the field against India in the Adelaide Test from December 6. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}