{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-will-tax-reforms-and-clearer-rules-revive-indias-crypto-market-2851983-2026-01-14",
      "headline": "Budget 2026: Will tax reforms and clearer rules revive India's crypto market?With the Union Budget 2026 around the corner, the virtual digital asset sector is hoping for changes that can ease taxation and provide regulatory certainty. Experts believe this could reignite growth in India's crypto ecosystem."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wholesale-inflation-rises-to-083-in-december-as-prices-firm-up-2851918-2026-01-14",
      "headline": "Wholesale inflation rises to 0.83% in December as prices firm upFood prices showed mixed trends during the month. Wholesale food inflation remained flat in December, compared with a sharp 2.6% decline recorded in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-mis-selling-senior-citizens-trust-bank-targets-agent-commission-2851860-2026-01-14",
      "headline": "Trust, targets and commissions: How senior citizens are trapped by mis-sold insuranceHandcrafted ByOur Editors Senior citizens walk into banks seeking safety and certainty. Too often, they walk out with complex insurance products that quietly put their savings and peace of mind at risk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-what-real-estate-sector-expects-on-housing-tax-relief-and-infra-2851821-2026-01-14",
      "headline": "Budget 2026: What real estate sector expects on housing, tax relief and infraWith the Union Budget 2026 around the corner, real estate developers are hoping for policy steps that improve affordability, simplify taxes and strengthen urban infrastructure to support long-term growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/where-does-lic-invest-bonds-debt-policyholders-money-and-how-returns-work-2851807-2026-01-14",
      "headline": "Buying an LIC policy? Here's where your money goes and what you get backWith assets under management of over Rs 57 lakh crore, LIC is not just an insurance company but also one of India's biggest long-term investors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-245-points-lower-nifty-below-25700-tcs-down-it-auto-metal-psu-banking-up-2851801-2026-01-14",
      "headline": "Sensex ends 245 points lower, Nifty below 25,700; TCS down 2%The S&P BSE Sensex was down by 244.98 points to close at 83,382.71, while the NSE Nifty50 lost 66.70 points to end at 25,665.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-iran-tariff-india-impact-trade-markets-negligible-rice-export-2851775-2026-01-14",
      "headline": "US targets Iran trading partners with 25% tariff: Will India be impacted?Markets in India have turned cautious as investors assess whether stricter US penalties on countries trading with Iran could have a spillover impact on Indian exporters, oil trade and overall market sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/when-can-you-withdraw-100-percent-of-your-pf-money-epfo-rules-explained-2851761-2026-01-14",
      "headline": "When can you withdraw 100% of your PF money? EPFO rules explainedWithdrawing your provident fund money has often felt complicated for many employees. Recent changes by EPFO now clearly explain when members can withdraw their full PF balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/will-budget-2026-simplify-tax-rules-for-investors-2851731-2026-01-14",
      "headline": "Will Budget 2026 simplify tax rules for investors?As policymakers prepare Budget 2026, tax experts and investors are hoping for tax changes that make savings and investments simpler, fairer and more predictable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hip-tip-before-sip-experts-take-on-smart-financial-planning-2851714-2026-01-14",
      "headline": "HIP, TIP before SIP: Experts take on smart financial planningMany investors focus on SIPs to build wealth, but experts say protection should come first. Health and term insurance can safeguard savings and ensure long-term financial plans stay on track during emergencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/affordable-housing-disappearing-in-india-budget-2026-revival-plan-2851712-2026-01-14",
      "headline": "Affordable housing is shrinking in India. Can Budget 2026 fix the problem?Industry experts warn that India is heading towards a divided housing market. Can Budget 2026 bridge the growing gap between luxury and affordable homes?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-will-healthcare-get-better-access-and-patient-first-reforms-2851680-2026-01-14",
      "headline": "Budget 2026: Will healthcare get better access and patient-first reforms?With Budget 2026 around the corner, healthcare stakeholders are calling for reforms that put patients first. Better access, affordable treatment and stronger preventive care remain top priorities for the sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/kotak-mahindra-bank-stock-split-80-percent-fall-explained-2851692-2026-01-14",
      "headline": "Kotak Mahindra stock split: Did private lender's shares really crash 80% today?At first glance, the share fall caused concern among investors tracking the stock. However, the sharp fall was not due to any problem in the bank's business or financial health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/housing-demand-falling-in-india-good-opportunity-for-homebuyers-2851682-2026-01-14",
      "headline": "Housing demand falls after 2 years. Is it an opportunity for homebuyers?For homebuyers planning a purchase, this phase offers more options, steadier prices, and room to negotiate, but choosing the right location and builder matters more than chasing short-term discounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/vedanta-share-price-jump-today-brokerage-views-demerger-expectations-explained-2851655-2026-01-14",
      "headline": "Vedanta share price jumps 6%: Why is the stock rising today?The rally was driven by a combination of positive brokerage commentary, renewed focus on the company's proposed demerger, and firm momentum in the metals and mining space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-price-unstoppable-rally-continues-geopolitics-buy-now-or-wait-for-dip-2851635-2026-01-14",
      "headline": "Gold and silver prices continue to rally: Buy now or wait for a dip?With gold and silver near record highs, investors face a choice between chasing momentum or waiting for pullbacks. Price levels, support zones, and timing will decide near-term returns for portfolios."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-providend-fund-pf-recent-withdrawal-rule-changes-explained-2851608-2026-01-14",
      "headline": "NPS, PF withdrawal rule changes: What you can take out and whenNPS and EPF withdrawal rules have changed, affecting how much money can be accessed and when. From early exits to emergency withdrawals, here is what subscribers should check now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-lower-it-shares-fall-cautious-sentiment-2851597-2026-01-14",
      "headline": "Muted start on Dalal Street as benchmark indices drift lowerThe S&P BSE Sensex was up marginally by 15.58 points to 83,643.27, while the NSE Nifty50 added 7.95 points to 25,740.25 as of 9:23 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bccl-ipo-allotment-today-gmp-listing-gain-expectations-share-price-market-debut-2851587-2026-01-14",
      "headline": "BCCL IPO allotment today: What listing gains can investors expect?BCCL IPO: The public listing opened for subscription on January 9, 2026, and closed on January 13, 2026. Shares are scheduled to list on the BSE and NSE on January 16, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bccl-ipo-allotment-status-check-listing-date-gmp-expected-share-price-bse-kfin-2851569-2026-01-14",
      "headline": "BCCL IPO allotment out: Check your status, listing date, and GMPBharat Coking Coal IPO saw extraordinary demand across all investor categories by the time bidding closed on January 13, 2026. BCCL IPO was subscribed 143.85 times overall."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-sonu-nigam-vishal-mishra-honour-indian-navy-karwar-naval-base-live-show-varun-dhawan-sunny-deol-ahan-shetty-2852090-2026-01-14",
      "headline": "Border 2: Sonu Nigam, Vishal Mishra honour Indian Navy with live show at Karwar The entire team of 'Border 2' honoured the Indian Navy at the Karwar Naval Base. The event turned special with Sonu Nigam and Vishal Mishra's live performance.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-dcaa-parts-ways-with-kartik-aaryan-after-2-months-2852079-2026-01-14",
      "headline": "Karan Johar's artist agency parts ways with Kartik Aaryan after 2 months Kartik Aaryan and Dharma Collab Artists Agency (DCAA) have ended their association after two months. The split follows the underperformance of 'Tu Meri Main Tera Main Tera Tu Meri', which also starred Ananya Panday, another actor that the agency represents.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-announces-comeback-with-3rd-mini-album-deadline-in-february-details-2852077-2026-01-14",
      "headline": "Blackpink announces comeback with 3rd mini album Deadline in February. Details Popular K-band Blackpink announced their comeback after 3 years with a third mini album. Titled 'Deadline', it will release on February 27."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bluff-trailer-priyanka-chopra-turns-fierce-bloody-to-protect-her-family-russo-brothers-2852063-2026-01-14",
      "headline": "The Bluff trailer: Priyanka Chopra turns fierce and bloody to protect her family The trailer of Prime Video's upcoming film 'The Bluff' featuring Priyanka Chopra is out. The movie will premiere on the streaming giant on February 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshaye-khanna-to-return-as-rehman-dakait-in-ranveer-singh-dhurandhar-2-reports-2852025-2026-01-14",
      "headline": "Akshaye Khanna to return as Rehman Dakait in Ranveer Singh's Dhurandhar 2: Reports Actor Akshaye Khanna is all set to return to Ranveer Singh's 'Dhurandhar 2' as Rehman Dakait, according to reports. The film was directed by Aditya Dhar and also featured R Madhavan, Arjun Rampal and Sanjay Dutt in lead roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-beats-baahubali-2-animal-is-biggest-indian-hit-in-us-box-office-2851963-2026-01-14",
      "headline": "Dhurandhar beats Baahubali 2, Animal; is biggest Indian hit in US box office. Reports Ranveer Singh's 'Dhurandhar' became the highest-grossing Indian film in the USA with $21 million gross. It surpassed the nine-year-old record held by 'Baahubali 2'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ameesha-patel-completes-26-years-in-bollywood-career-achievements-independence-2851999-2026-01-14",
      "headline": "Ameesha Patel's rumoured boyfriend celebrates her film journey, actor reacts Actor Ameesha Patel celebrated 26 years in the film industry, with business partner and rumoured boyfriend Kunal Goomer acknowledging her milestone and independence through a public message on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-drops-18-kg-ahead-of-happy-patel-credits-anti-inflammatory-diet-2851995-2026-01-14",
      "headline": "Aamir Khan drops 18 kg ahead of Happy Patel, credits anti-inflammatory diet Aamir Khan discussed his significant weight loss and the effects of an anti-inflammatory diet ahead of his cameo in Happy Patel: Khatarnak Jasoos. The film is set for release on January 16, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-announces-release-date-of-drishyam-3-teases-past-never-stays-silent-2851982-2026-01-14",
      "headline": "Mohanlal announces release date of Drishyam 3, teases 'past never stays silent' Mohanlal's Drishyam 3 is set for a global release on April 2, coinciding with Maundy Thursday. Mohanlal made the announcement on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-meets-uttar-pradesh-chief-minister-yogi-adityanath-gorakhpur-mahotsav-bollywood-night-2851897-2026-01-14",
      "headline": "Badshah meets Yogi Adityanath before Gorakhpur show, praises his compassion Rapper-singer Badshah shares reflections after meeting Chief Minister Yogi Adityanath in Gorakhpur, highlighting the leader's calm and compassionate nature ahead of his performance at the closing ceremony of the Gorakhpur Mahotsav."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hussain-ustara-mumbai-underworld-razor-wielder-shahid-kapoor-o-romeo-film-2851874-2026-01-14",
      "headline": "Who was Hussain Ustara? The razor-wielder who 'inspired' Shahid Kapoor's O' Romeo Hussain Ustara, known to be a contract killer in Mumbai, features in Vishal Bhardwaj's O' Romeo. His family has filed a defamation suit raising questions about how the film portrays him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-ranbir-kapoor-mumbai-reception-dance-style-2851893-2026-01-14",
      "headline": "Alia Bhatt, Ranbir Kapoor's dance to dhol beats at friend's reception goes viral A video of Alia Bhatt and Ranbir Kapoor dancing to dhol beats at a friend's reception at Gauri Khan's restaurant in Mumbai has gone viral, as the couple briefly stepped away from their current film projects to join the celebration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rahu-ketu-film-ua-16-plus-certificate-cbfc-content-changes-2851852-2026-01-14",
      "headline": "Rahu Ketu: Kantara scream, drug-snorting scenes cut; censors issue U/A certificate Pulkit Samrat and Varun Sharma's 'Rahu Ketu' is set to release in theatres on January 16. Ahead of its release, the censor boardrd has suggested a few cuts, including the removal of the 'Kantara' scream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-lokesh-kanagaraj-announce-new-film-shoot-begins-this-year-2851879-2026-01-14",
      "headline": "Allu Arjun, Lokesh Kanagaraj announce new film, shoot begins this year Lokesh Kanagaraj announced his next film starring Allu Arjun with a viral Pongal–Makar Sankranti promo. Produced by Mythri Movie Makers, the untitled project marks AA23 and LK7, with Anirudh Ravichander composing the music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nupur-sanon-says-sister-kriti-convinced-mother-about-interfaith-wedding-to-stebin-2851823-2026-01-14",
      "headline": "Nupur Sanon says sister Kriti convinced mother about interfaith wedding to Stebin Nupur Sanon opened up about her interfaith marriage to Stebin Ben. She revealed that her elder sister Kriti Sanon helped in convincing their mother about Stebin.\r\n\r\n\r\n, Stebin Ben open up on their interfaith wedding; Kriti Sanon helped convince their mother\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-makes-dosas-as-konidela-family-marks-bhogi-allu-arjun-skips-2851854-2026-01-14",
      "headline": "Ram Charan makes dosas as Konidela family marks Bhogi, Allu Arjun skips The Konidela family came together at Chiranjeevi's home in Hyderabad for Bhogi celebrations on Wednesday. While Allu Arjun is away in Japan for a film release, he skipped the annual family tradition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/parasakthis-sivakarthikeyan-calls-vijay-his-brother-jana-nayagan-will-release-soon-2851857-2026-01-14",
      "headline": "Parasakthi's Sivakarthikeyan calls Vijay his brother: Jana Nayagan will release soon Parasakthi actor Sivakarthikeyan referred to Vijay as his brother in an interview during Pongal celebrations in Delhi. The actor also commented on the viral social media war between his and Vijay's fans on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/abhishek-malhan-denies-fake-chat-allegations-amid-social-media-misinformation-2851800-2026-01-14",
      "headline": "Abhishek Malhan dismisses fake chat rumours, asks fans to value authenticity Abhishek Malhan recently responded to viral fake chat screenshots circulating on social media and addressed ongoing rumours about his personal life. He urged fans to respect his boundaries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/scott-adams-dilbert-corporate-satire-workplace-culture-controversies-death-2851766-2026-01-14",
      "headline": "Scott Adams (1957–2026): The Dilbert creator who mapped corporate absurdity Scott Adams, creator of Dilbert, highlighted corporate workplace absurdities through satire. His controversial views sparked backlash, but his legacy as a cultural critic remains significant."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/iran-foreign-minister-dials-s-jaishankar-discusses-evolving-situation-amid-deadly-unrest-2852039-2026-01-14",
      "headline": "Iran Foreign Minister dials S Jaishankar as deadly unrest intensifiesAs tension has accelerated in Iran in the last few days, the Foreign Minister of Iran, Seyed Abbas Araghchi called S Jaishankar and discussed the existing situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-asks-some-personnel-to-evacuate-its-airbase-in-qatar-after-mention-of-attack-by-an-iranian-official-2852018-2026-01-14",
      "headline": "Iran to attack US airbases in Qatar? American troops asked to evacuateQatar said the measures were in response to current tensions and reaffirmed steps to protect citizens, residents, and critical infrastructure."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/lawrence-bishnoi-gang-operating-in-canada-on-behalf-of-indian-government-royal-canadian-mounted-police-report-rcmp-2851861-2026-01-14",
      "headline": "Canadian police link Bishnoi gang's activities in Canada to Indian govtCanada's national police service has said that the Lawrence Bishnoi gang was operating in the country on behalf of the Indian government. The assessment, in a report seen by Global News, added that despite being designated a terrorist organisation, the gang continued to expand its footprint in Canada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rajkot-odi-report-rohit-kohli-failure-mitchell-2852047-2026-01-14",
      "headline": "Ro-Ko misfire, weak bowling haunt India as New Zealand level series in RajkotDaryl Mitchell's hundred and a poor day at the office for India meant that New Zealand levelled the series on Wednesday, January 14 in Rajkot. KL Rahul's 112 went in vain as India's batting collapsed once again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/stalin-stirs-the-pongal-pot-is-the-festival-tamil-dravidian-or-national-2851872-2026-01-14",
      "headline": "Stalin stirs the Pongal pot: Is the festival Tamil, Dravidian or national?By branding Pongal as a \"Dravidian festival\", Chief Minister M K Stalin has turned a centuries-old harvest celebration into a political statement ahead of the 2026 polls, reopening a familiar debate in Tamil Nadu over culture, identity and where regional pride ends and national tradition begins."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-protest-ayatollah-ali-khamenei-outsource-hezbollah-badr-iraqi-shia-militia-from-iran-pilgrim-visa-irgc-basij-2851984-2026-01-14",
      "headline": "How Khamenei outsourced Iran killings to Arabic-speaking Iraqi militiasAmid massive anti-Khamenei demonstrations in Iran, Ayatollah Khamenei's regime has reportedly brought in Iraqi Shia militias to suppress the protests. Reports and experts suggest that approximately 800-850 Arabic-speaking fighters from Iraq have crossed over to Iran as pilgrims, as the Ayatolah's IRCG and Basij forces have shown reluctance in firing at their own people. The influx of foreign militia coincides with reports of a sharp spike in killings of protesters in Iran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/greenland-strategic-importance-us-nato-support-acquisition-danish-opposition-2851981-2026-01-14",
      "headline": "Anything less than Greenland control not acceptable: Trump ahead of Vance's key meetTrump's outreach to Nato came hours before Vice President JD Vance was set to meet Danish and Greenlandic officials in Washington to discuss the future of Greenland."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/zubin-garg-was-severely-intoxicated-had-declined-life-jacket-singapore-police-to-court-on-singers-death-2851914-2026-01-14",
      "headline": "Zubeen Garg was very drunk, had declined life jacket: Singapore cops to courtSingapore police told a coroner's court that singer Zubeen Garg drowned off Lazarus Island last September after entering the water without a life jacket while severely intoxicated, with investigators ruling out foul play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/shashi-tharoor-a-swiftie-ophelia-worked-her-magic-instagram-viral-video-taylor-swift-song-the-fate-of-ophelia-2852050-2026-01-14",
      "headline": "Shashi Tharoor is a Swiftie. Of course it was OpheliaCongress MP Shashi Tharoor has once again gone viral after sharing an Instagram video of himself vibing to Taylor Swift's 'The Fate of Ophelia' during a brief break from work, delighting Swifties and fans alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/end-of-the-raider-how-mahmud-ghaznis-empire-went-up-in-flames-2851677-2026-01-14",
      "headline": "End of the Raider: How Mahmud Ghazni's empire went up in flamesMahmud Ghazni plundered India for 24 years, sacking temples like Somnath. His empire crumbled after his death, ending in flames. It was poetic justice for his brutal raids."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/what-pushed-blinkit-swiggy-zepto-swiggymart-to-drop-10-minute-delivery-reality-2851855-2026-01-14",
      "headline": "What changed after Blinkit dropped 10-minute promise? We spoke to delivery boysHandcrafted ByOur Editors A silent strike on New Year's Eve forced quick commerce giants to drop their flashy 10-minute delivery promises within days. What brought the change and has the race against time really slowed down for delivery agents?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/india-weather-forecast-tomorrow-cold-wave-snowfall-north-india-imd-skymet-news-2852000-2026-01-14",
      "headline": "Cold wave, fog to intensify on Thursday, mountains brace for snowfallNorth India is set to witness a fresh spell of heavy snowfall and biting cold as a new Western Disturbance arrives tomorrow. The IMD has issued a dense fog alert for the northern plains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/when-the-marathas-defeated-the-british-at-the-battle-of-wadgaon-in-1779-2851764-2026-01-14",
      "headline": "A rare Maratha victory over the British came in 1779In the Battle of Wadgaon in 1779, the Marathas defeated the British East India Company, though the victory did not last long as the British later broke the treaty and its terms. In that decisive battle, the Marathas showed that true resistance could come only from their formidable military power. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/erfan-soltani-iran-public-execution-tehran-protests-anti-khamenei-family-tehran-news-live-2851696-2026-01-14",
      "headline": "Iran protester, 26, to be executed, family got just 10 minutes for final meetingErfan Soltani, a 26-year-old Iranian, is set to be executed in public, in Iran's first death sentence linked to the anti-Khamenei protests, which entered its 20th day on Wednesday. The Khamenei regime moved fast from his \"trial\" to the execution stage. Soltani's family got just 10 minutes to say goodbye to him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/leave-iran-by-available-means-of-transport-indian-embassy-to-nationals-amid-rising-instability-in-country-2851805-2026-01-14",
      "headline": "Leave Iran: India's advisory to citizens amid deadly unrest, US attack UpdatesThe advisory, dated January 14, urges Indians to exercise due caution, avoid areas of protests or demonstrations, remain in contact with the Embassy, and keep travel and identity documents readily available. In another advisory, the Ministry of External Affairs urged Indians to avoid any travel to Iran until further notice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricketers-boycott-bcb-director-najmul-islam-comments-2852101-2026-01-14",
      "headline": "Bangladesh cricketers threaten boycott after director's controversial remarksThe Bangladesh cricketers have threatened boycott unless director Najmul Islam resigns after his controversial comments on Wednesday, January 14. Najmul questioned the commitment of the players on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-lokesh-kanagaraj-announce-new-film-shoot-begins-this-year-2851879-2026-01-14",
      "headline": "Allu Arjun, Lokesh Kanagaraj announce new film, shoot begins this yearLokesh Kanagaraj announced his next film starring Allu Arjun with a viral Pongal–Makar Sankranti promo. Produced by Mythri Movie Makers, the untitled project marks AA23 and LK7, with Anirudh Ravichander composing the music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/trinamool-plea-to-protect-i-pac-data-seized-by-ed-disposed-of-after-agency-says-nothing-collected-in-raids-2851811-2026-01-14",
      "headline": "No docs seized, Mamata Banerjee illegally took records: ED to court on I-PAC raidsThe court recorded the ED's categorical statement that nothing was seized during the searches conducted at the premises linked to the consultancy firm on January 8."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/sikhs-rescue-teen-abducted-pak-grooming-gang-london-2851763-2026-01-14",
      "headline": "Teen abducted, raped by Pak grooming gang in London, 200 Sikhs come to her rescueAccording to a report by the Sikh Press Association, the accused, believed to be in his early 40s and known for suspiciously \"befriending\" under-16s in West London's Hounslow area, began forming a relationship with the Sikh girl when she was around 13 years old."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/greenland-announces-increased-military-presence-with-nato-allies-co-operation-amid-trumps-threats-2852023-2026-01-14",
      "headline": "Greenland to boost military presence with NATO allies' help amid Trump's threatsGreenland announced an increased military presence in coordination with NATO allies as US President Donald Trump renewed calls for Washington to take control of the island, a threat constantly rejected by Denmark and Greenland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indian-phd-students-win-200000-settlement-discrimination-university-colorado-boulder-2851613-2026-01-14",
      "headline": "Palak paneer row leads to Rs 1.8-crore win for 2 Indians against US universityIndian PhD students Aditya Prakash and Urmi Bhattacheryya also argued that departmental kitchen rules at the University of Colorado Boulder singled out South Asians, discouraging community members from opening their lunches in common areas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/what-is-flash-fog-imd-weather-cold-wave-delhi-ncr-makar-sankranti-2851663-2026-01-14",
      "headline": "What is flash fog? The science behind Delhi's blink-and-you-miss-it fogThis wasn't your standard all-night fog. What Delhi-NCR experienced was a short-lived but intense phenomenon often referred to as rapid-onset or flash fog."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-protests-live-updates-death-toll-ayatollah-ali-khamenei-violent-unrest-economic-crisis-glbs-2851522-2026-01-14",
      "headline": "Live: US withdraws troops from key Middle East bases as tension with Iran soarsIran Protests Live Updates: The death toll from nationwide protests in Iran has crossed 2,600 on Wednesday as Iranians were able to make phone calls abroad for the first time in days after authorities cut communications during a sweeping crackdown. The protests, which began more than two weeks ago over the country's struggling economy, have since broadened into direct opposition to the ruling theocracy, including Supreme Leader Ayatollah Ali Khamenei. Iranian state television issued its first indirect acknowledgement of the scale of the deaths, saying the country had suffered a lot of martyrs. While US President Donald Trump urged Iranians to keep protesting, saying help was on the way. Stay tuned to indiatoday.in for all the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-will-tax-reforms-and-clearer-rules-revive-indias-crypto-market-2851983-2026-01-14",
      "headline": "Budget 2026: Will tax reforms and clearer rules revive India's crypto market?With the Union Budget 2026 around the corner, the virtual digital asset sector is hoping for changes that can ease taxation and provide regulatory certainty. Experts believe this could reignite growth in India's crypto ecosystem."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-washington-sundar-t20i-series-ruled-out-t20-world-cup-scare-2852105-2026-01-14",
      "headline": "India suffer T20 World Cup scare as Washinton Sundar ruled out of NZ T2OIs India's T20 World Cup preparations face fresh uncertainty as Washington Sundar is ruled out of the New Zealand T20Is, adding to selection worries with Tilak Varma's fitness also under a cloud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricketers-boycott-bcb-director-najmul-islam-comments-2852101-2026-01-14",
      "headline": "Bangladesh cricketers threaten boycott after director's controversial remarks The Bangladesh cricketers have threatened boycott unless director Najmul Islam resigns after his controversial comments on Wednesday, January 14. Najmul questioned the commitment of the players on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-beat-up-warriorz-seven-wickets-wpl-2026-2852097-2026-01-14",
      "headline": "Nervous Delhi Capitals survive UP Warriorz scare to open account in WPL 2026 WPL 2026, DC vs UPW: Jemimah Rodrigues' Delhi Capitals opened their account in the tournament after beating Meg Lanning's UP Warriorz by seven wickets on Wednesday in Navi Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-poor-fielding-vs-new-zealand-rajkot-odi-fans-reaction-angry-shubman-gill-acknowledges-2852078-2026-01-14",
      "headline": "India's sloppy fielding in Rajkot rings alarm bells ahead of T20 World Cup India's sloppy fielding in the Rajkot ODI has triggered concern ahead of the T20 World Cup. Captain Shubman Gill admitted missed chances are costing games, putting the spotlight firmly on India's defensive standards."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricketers-financial-loss-t20-world-cup-india-security-concerns-2852054-2026-01-14",
      "headline": "Bangladesh players won't be compensated if T20 World Cup is boycotted: BCB BCB finance chief M. Nazmul Islam said Bangladesh players, not the board, would bear the financial hit if the team pulls out of the T20 World Cup amid ongoing uncertainty over participation in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rajkot-odi-report-rohit-kohli-failure-mitchell-2852047-2026-01-14",
      "headline": "Ro-Ko misfire, weak bowling haunt India as New Zealand level series in Rajkot Daryl Mitchell's hundred and a poor day at the office for India meant that New Zealand levelled the series on Wednesday, January 14 in Rajkot. KL Rahul's 112 went in vain as India's batting collapsed once again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kerala-blasters-juan-rodriguez-part-ways-overseas-player-loss-isl-delay-aiff-2852033-2026-01-14",
      "headline": "ISL boat still leaking: Kerala Blasters lose 3rd foreigner in 2 weeks after delay IND vs NZ: Kerala Blasters parted ways with Juan Rodriguez minutes after confirming ISL participation under the new format. The move underlined the club's reset after shutting operations during months of league uncertainty."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-unhygenic-controversy-anders-antonsen-badminton-chief-srejects-2852019-2026-01-14",
      "headline": "India badminton chief slams Antonsen: Can't comment while sitting in Denmark BAI secretary general Sanjay Mishra hit back at Anders Antonsen's criticism of India Open conditions, rejecting claims made from abroad. The Indian body insisted standards were met and politics had no place in sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-kl-rahul-rahul-dravid-like-crisis-man-sunil-gavaskar-reacts-rajkot-odi-2851991-2026-01-14",
      "headline": "KL Rahul is India's crisis man, like Rahul Dravid once was: Sunil Gavaskar IND vs NZ: Sunil Gavaskar has hailed KL Rahul as India's modern-day ODI crisis man after his unbeaten 112 in Rajkot. The comparison with Rahul Dravid underlines Rahul's growing importance at No. 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-india-open-conditions-hygiene-row-blichfeldt-antonsen-2851969-2026-01-14",
      "headline": "PV Sindhu finds no issues with India Open conditions amid hygiene claims India's star badminton player PV Sindhu said that she found the playing conditions at the Indira Gandhi Indoor Stadium to be fine amid the hygiene row surrounding the India Open. The conditions in Delhi was questioned by Anders Antonsen and Mia Blichfeldt. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dc-vs-upw-live-score-wpl-2026-delhi-capitals-vs-up-warriorz-womens-match-2851967-2026-01-14",
      "headline": "DC vs UPW Highlights: Delhi Capitals open account with 7-wicket win Delhi Capitals Women (MI) vs UP Warriorz Women (GG) Highlights: Delhi Capitals (DC) looked rusty on the night but eventually found a way to open their account in the Women's Premier League (WPL) 2026. On Wednesday, January 14, the Capitals edged past the UP Warriorz by seven wickets in Match No. 7 at the Dr DY Patil Sports Academy, Navi Mumbai"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/danish-shuttler-pulls-out-of-india-open-citing-delhis-poisonous-air-ytvd-2851953-2026-01-14",
      "headline": "Delhi Air 'Not Safe': Danish Shuttler Pulls Out Of India Open Citing Delhi's 'Poisonous' AirThis news bulletin addresses the alarming levels of air pollution in Delhi and its impact on international sporting events. A prominent Danish badminton player has withdrawn from the India Open, citing hazardous air quality in the national capital. The speaker notes that the athlete's decision was not based on injury or scheduling but on the fact that the 'air in the national capital is simply not safe.' The programme highlights the embarrassment of a global sporting event being deemed unfit for athletes due to breathing risks. The shuttler reportedly stated that Delhi is 'not the place to host tournaments under such conditions,' a comment the speaker describes as an indictment of years of apathy and inaction. The report concludes by calling the situation a national shame, as the city's air turns poisonous every winter, posing a daily risk to residents and now deterring international competitors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-special-celebration-daughter-century-vs-new-zealand-rajkot-odi-2851892-2026-01-14",
      "headline": "Saw KL Rahul's hundred celebration in Rajkot ODI? Here's what it meansKL Rahul scored a brilliant hundred for India after his return to the No.5 spot and decided to repeat his special celebration for his daughter during the Rajkot ODI on Wednesday, January 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zeland-kl-rahul-century-number-5-spot-odi-rajkot-gautam-gambhir-2851878-2026-01-14",
      "headline": "KL Rahul hits 87-ball 100 in Rajkot. Should Gautam Gambhir give him No. 5 spot?KL Rahul's unbeaten 112 in Rajkot has reignited the No. 5 debate in India's ODI setup. With consistent returns in that role, Rahul is making a compelling case to be locked in there."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-roadmap-laliga-premier-league-bundesliga-aiff-kalyan-chaubey-trust-2851836-2026-01-14",
      "headline": "ISL roadmap inspired by LaLiga, Premier League, Bundesliga: AIFF chief seeks trustUnder-fire AIFF president Kalyan Chaubey has unveiled a 21-year roadmap inspired by Europe's elite leagues. The plan promises structured governance for the ISL and I-League as Indian football searches for stability amid ongoing administrative chaos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-australia-t20i-series-2026-lahore-warm-up-icc-t20-world-cup-2851812-2026-01-14",
      "headline": "Ahead of T20 World Cup 2026, Australia to tour Pakistan for three-match seriesPakistan and Australia will face off in a three-match T20I series at Gaddafi Stadium, Lahore, starting January 29, 2026. Both teams are using the series as their final preparation for the ICC Men's T20 World Cup, with injuries impacting key players from each side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-2026-pv-sindhu-loses-first-round-nguyen-thuy-linh-2851814-2026-01-14",
      "headline": "PV Sindhu disappoints, 17-year-old Tanvi goes down fighting against World No. 2India Open 2026: 12th-ranked PV Sindhu lost to familiar foe Nguyen Thuy Linh of Vietnam despite winning the opening game of their women's singles first-round match. Meanwhile, 17-year-old Tanvi Sharma stretched World No. 2 Wang Zhi Yi to three games in her debut at the Super 750 tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wahab-riaz-appointed-pakistan-womens-cricket-mentor-south-africa-white-ball-series-2851798-2026-01-14",
      "headline": "Wahab Riaz named as Pakistan women's team mentor after World Cup debacleWahab Riaz has been appointed as mentor for the Pakistan women's cricket team for their upcoming white-ball tour of South Africa, with the appointment confirmed by the Pakistan Cricket Board. The tour, set to begin February 10, marks the team's first series since finishing last at the ICC Women's World Cup, and includes new faces as well as key recalls in both T20I and ODI squads."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-cleanliness-criticism-kidambi-srikanth-mia-blichfeldt-reaction-2851769-2026-01-14",
      "headline": "Faced power cuts in Denmark: Kidambi Srikanth defends India Open amid criticismIndia Open 2026: Former world No. 1 Kidambi Srikanth defended playing conditions in New Delhi while responding to criticism from Denmark's Mia Blichfeldt, who said she experienced unclean and unhygienic training conditions in the capital on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-no-1-spot-in-icc-odi-rankings-after-4-years-rohit-sharma-drops-to-third-2851750-2026-01-14",
      "headline": "Virat Kohli returns to No. 1 spot after 4 years, Rohit Sharma drops to thirdICC ODI Rankings: Virat Kohli returned to the No. 1 spot in the ODI batting charts for the first time in four years. He rose to the top spot after a sensational run in the 50-over format since his return to competitive action in October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-2nd-odi-ayush-badoni-nitish-kumar-reddy-debut-team-news-2851732-2026-01-14",
      "headline": "Rajkot ODI: No debut for Ayush Badoni as India pick Washington Sundar replacementIndia vs New Zealand, 2nd ODI: India picked fast-bowling all-rounder Niitsh Kumar Reddy as Washington Sundar's replacement for the second ODI in Rajkot on Wednesday. Ayush Badoni, who was handed his maiden call-up, will have to wait for his first chance to play for the senior national team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/josh-hazlewood-australia-return-t20-world-cup-2026-injury-setback-2851723-2026-01-14",
      "headline": "Josh Hazlewood confident of T20 World Cup 2026 return after injury setbacksAustralia pacer Josh Hazlewood is confident of being fit for the T20 World Cup in Sri Lanka next month after an injury-hit summer, with the fast bowler targeting a warm-up game ahead of Australia's opening match on February 11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-2026-anders-antonsen-pulls-out-delhi-extreme-pollution-2851708-2026-01-14",
      "headline": "India Open: After hygiene row, World No. 2 says polluted Delhi unfit for badmintonWorld No. 2 Anders Antonsen revealed why he was not a part of the India Open in Delhi, citing extreme air pollution as the reason, raising fresh concerns over player safety and tournament conditions. His statement came a day after his compatriot Mia Blichfeldt called out unhygienic training conditions in New Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-conversion-rate-better-than-rohit-sharma-mohammad-kaif-2851689-2026-01-14",
      "headline": "Kohli's conversion rate puts him ahead of Rohit Sharma in ODIs: Former batterMohammad Kaif praises Virat Kohli's impressive conversion rate in ODI cricket, saying it puts him ahead of Rohit Sharma in ODI cricket. Kohli scored 93 (91) in the first ODI against New Zealand in Vadodara."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-2nd-odi-ayush-badoni-selection-kris-srikkanth-favouritisim-2851670-2026-01-14",
      "headline": "Ayush Badoni's ODI selection unfair: Kris Srikkanth alleges favouritism in explosive takeIND vs NZ: Former selector Kris Srikkanth has slammed Ayush Badoni's ODI selection as unfair, questioning the yardstick used by selectors and alleging favouritism after consistent performers were overlooked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-delhi-capitals-up-women-meg-lanning-reunion-2851638-2026-01-14",
      "headline": "WPL 2026: Meg Lanning set for emotional reunion as Capitals, Warriorz seek redemptionWPL 2026, DC vs UPW: Meg Lanning is all set for an emotional reunion with the Delhi Capitals as UP Warriorz look to bounce back following back-to-back defeats in the competition. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-2026-injuries-tilak-varma-washington-sundar-2851256-2026-01-14",
      "headline": "Multiple injuries ring alarm bells for India's T20 World Cup title defence at homeIndia's preparations for the T20 World Cup 2026 face hurdles due to injuries to key players namely Tilak Varma and Washington Sundar. The unforeseen injuries have hampered India's preparedness ahead of their title defence at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2026-sebastian-offner-tie-break-rules-nishesh-basavareddy-comeback-watch-video-2851615-2026-01-14",
      "headline": "Tennis player forgets tie-break rules, celebrates early and suffers crushing lossSebastian Ofner's early celebration backfired in stunning fashion as Nishesh Basavareddy staged a dramatic comeback to win a chaotic Australian Open qualifier tiebreak 13–11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-2nd-odi-live-score-rohit-sharma-virat-kohli-shubman-gill-rajkot-2851594-2026-01-14",
      "headline": "2nd ODI Highlights: Mitchell 131* powers New Zealand to 7-wicket win, level series 1-1India (IND) vs New Zealand (NZ), 2nd ODI Highlights: Daryl Mitchell scored an unbeaten 131 as New Zealand stormed to a seven-wicket win after chasing down 285 with 15 balls to spare in Rajkot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/grace-hayden-joe-root-gamble-ashes-tennis-switch-interview-2851582-2026-01-14",
      "headline": "Grace Hayden on her dad's gamble on Joe Root, India connection and foray into tennisGrace Hayden talks about her father Matthew Hayden's risky Joe Root bet, the overwhelming love she receives from Indian fans, and why she's excited to step beyond cricket and into the world of tennis broadcasting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-fit-and-fierce-pv-sindhu-targets-world-championships-asian-games-2851571-2026-01-14",
      "headline": "Fit and fierce PV Sindhu targets World Championships, Asian Games in 2026India's star shuttler PV Sindhu has returned to full fitness. Sindhu made a tremendous return to Malaysia Masters, the first competition of the season, and is now ready for a long series which includes the World Championships and Asian Games."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}