{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-engineering-fraud-nfra-probe-financial-record-account-book-sebi-investigation-2728102-2025-05-21",
      "headline": "Gensol's books under review: NFRA launches preliminary probeIn April, Sebi took action against Gensol Engineering and its promoters brothers Anmol Jaggi and Puneet Jaggi. The market regulator barred the two from accessing the stock markets and called for a forensic audit into the affairs of the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/moody-credit-rating-agency-explains-india-economy-not-affected-tariff-threat-2728067-2025-05-21",
      "headline": "Explained : Why Moody's thinks tariffs won't slow down India's economyThe credit ratings agency said India is in a better position than many other emerging markets to handle the tariff challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/accenture-promotions-15000-india-six-month-delay-report-global-salary-hike-it-consulting-job-2728039-2025-05-21",
      "headline": "Accenture promotions: 15,000 India staff finally get nod, says reportAccenture will offer 50,000 promotions globally. The global consulting and technology firm, which is headquartered in Dublin, had initially planned to roll out promotions in December 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bengaluru-peepalco-group-ceo-ashish-singhal-middle-class-salary-crisis-2728029-2025-05-21",
      "headline": "'Biggest scam': Bengaluru CEO on India's silent middle-class salary crisisIn a LinkedIn post, PeepalCo Group CEO Ashish Singhal called India's middle-class salary stagnation amid soaring costs \"the biggest scam no one talks about\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iphone-production-india-donald-trump-tim-cook-apple-ceo-why-foxconn-investment-2727994-2025-05-21",
      "headline": "Why Trump desperately wants Apple back in the US?Apple has been working closely with partners like Foxconn, Pegatron and Tata Electronics to make more iPhones in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bel-share-price-jumps-4-percent-defence-stock-in-focus-should-you-buy-hold-or-sell-2727969-2025-05-21",
      "headline": "BEL share price jumps 4% today. Should you buy, hold or sell?The stock has surged over 26% in the past month, driven by improving operating margins and robust order book visibility, even as FY25 order inflows fell slightly short of guidance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-jump-today-trading-session-what-is-driving-the-stock-market-dalal-street-rally-2727963-2025-05-21",
      "headline": "Sensex jumps 700 points despite global headwinds. What's driving the rally?The BSE Sensex jumped over 687.83 points to 81,874.27 by 10:18 am, while the NSE Nifty50 gained 214.15 points to 24,898.05. The rebound was broad-based, with all major indices trading higher after a sharp fall in the previous session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-vs-belrise-industries-comparison-better-ipo-check-latest-gmp-price-band-listing-subscription-2727954-2025-05-21",
      "headline": "Borana Weaves vs Belrise Industries: Which IPO to bid, has the better GMP?The initial public offering (IPO) of Borana Weaves Limited opened for bidding on Tuesday and has already been subscribed nearly 9 times with investors taking an interest in the public listing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-volatility-returns-foreign-investors-selling-what-analysts-say-investors-2727947-2025-05-21",
      "headline": "FII selling back to haunt Dalal Street? What investors need to knowSeveral global triggers are behind Dalal Street's recent correction, including the downgrade of US sovereign credit, a rise in US and Japanese bond yields, a spike in Covid cases, and geopolitical chatter about a possible Israeli strike on Iran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-235-points-higher-nifty-above-24500-eternal-down-1-percent-indusind-bank-2727934-2025-05-21",
      "headline": "Sensex, Nifty rebound with gains led by pharma; market faces FII pressureThe S&P BSE Sensex was up 116.72 points to 81,303.16, while the NSE Nifty gained 18 points to 24,701.90 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/belrise-industries-ipo-open-bidding-should-you-subscribe-skip-gmp-today-shows-listing-gain-details-review-2727931-2025-05-21",
      "headline": "Belrise Industries IPO: Should you subscribe or skip? GMP shows listing gainBelrise Industries IPO will remain open for bidding for three days and will close on Friday, May 23, 2025. The price band for the IPO has been fixed at Rs 85 to Rs 90 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-likely-to-open-higher-check-key-levels-trading-strategy-2727915-2025-05-21",
      "headline": "Sensex, Nifty likely to open higher today. Check key levels, trading strategyBoth the Nifty50 and the BSE Sensex ended lower in the last session as foreign portfolio investors sold shares worth Rs 10,016.10 crore, according to provisional data. This was the highest single-day outflow since February 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-share-market-trading-news-may-21-ongc-indigo-rvnl-indusind-bank-sbi-sensex-nifty-2727909-2025-05-21",
      "headline": "Stocks to watch today on May 21: ONGC, IndiGo, RVNL, IndusInd Bank, SBIAmong the companies that will report their financial results today are Oil and Natural Gas Corporation (ONGC), IndusInd Bank, InterGlobe Aviation (which operates IndiGo), Colgate-Palmolive (India), NTPC Green Energy, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-qatar-economic-forum-committed-to-being-ceo-of-tesla-in-5-years-2727862-2025-05-20",
      "headline": "Elon Musk vows to retain Tesla CEO post for next 5 years: No doubt about thatMusk made a video appearance at the Qatar Economic Forum hosted by Bloomberg after he recently travelled to Doha as part of Donald Trump's Mideast trip last week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-1-sahaj-vs-itr-4-sugam-which-itr-form-should-you-use-tax-filing-2025-2727615-2025-05-20",
      "headline": "ITR-1 Sahaj vs ITR-4 Sugam: Which ITR form should you use?ITR-1 is for straightforward income from salary or pension, while ITR-4 is suitable if you're into small business or freelance work and are using the presumptive taxation scheme. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-closes-873-points-lower-nifty-falls-below-25000-eternal-down-4-2727592-2025-05-20",
      "headline": "Sensex closes 873 points lower, Nifty falls below 25,000; Eternal down 4%The S&P BSE Sensex lost 872.98 points to end at 81,186.44, while the NSE Nifty50 was down by 261.55 points to close at 24,683.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-itr-u-check-who-can-file-penalties-and-last-date-2727537-2025-05-20",
      "headline": "What is ITR-U? Check who can file, penalties, and last dateIf you missed filing your return on time or made a mistake in your previous ITR, the ITR-U gives you another chance to set things right—this time with more time on your hands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/real-estate-gcc-coverage-south-city-bangalore-hyderabad-bengaluru-chennai-hyderabad-2727538-2025-05-20",
      "headline": "South India emerges as top choice for GCC offices in early 2025With Bengaluru, Chennai, and Hyderabad collectively securing a dominant 64% share of all GCC office leasing in Q1 2025, the southern region has firmly established itself as the preferred destination for global corporations setting up specialised capability centres in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-boom-in-india-guess-what-is-fuelling-the-rs-65-lakh-crore-surge-2727514-2025-05-20",
      "headline": "Mutual fund boom in India: Guess what's fuelling the Rs 65 lakh crore surgeMumbai alone leads the chart, contributing 27% (Rs 17.75 lakh crore), followed by Delhi at 12.63%, Bengaluru at 5.39%, Pune at 4%, and Kolkata at 3.49%. These numbers haven't changed much since last year, according to data from the Association of Mutual Funds in India (AMFI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-falls-after-positive-opening-reasons-behind-sensex-nifty-fall-explained-2727500-2025-05-20",
      "headline": "Explained: Why Sensex tanked nearly 900 points todayAt today's closing, the Sensex had plunged 872.98 points to settle at 81,186.44, while the Nifty 50 fell 261.55 points to end at 24,683.90. All major sectoral indices closed in the red, with Auto, Media, Financial Services, and Healthcare stocks among the worst hit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/defence-stocks-nifty-rally-pause-what-should-investors-do-book-profit-paras-cochin-shipyard-ideaforge-2727480-2025-05-20",
      "headline": "Is the defence stock party over? Here's what investors need to knowShares of Paras Defence and Cochin Shipyard dropped more than 6% each during the day. The broader Nifty India Defence index was also down. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lost-your-uan-step-by-step-guide-to-get-it-back-in-minutes-2727476-2025-05-20",
      "headline": "Lost your UAN? Here's a step-by-step guide to get it back in minutesYour UAN is more than just a number. Without your UAN, you can't check your PF balance, update your account, or even withdraw money when you need it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paras-defence-cochin-shipyard-why-these-defence-stocks-tumbled-over-6-today-2727451-2025-05-20",
      "headline": "Paras Defence, Cochin Shipyard: Why these defence stocks tumbled over 6% todayLeading the slide were Paras Defence, Cochin Shipyard. Both fell over 6% in intraday trade. The broader Nifty India Defence index dropped 1.4% to around 11:50 am, marking its second straight day of decline after a blistering multi-week rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-checklist-who-must-file-deadlines-documents-and-the-truth-about-zero-tax-2727441-2025-05-20",
      "headline": "ITR checklist: Who must file, deadlines, documents and the truth about 'zero tax'In the 2025–26 Union Budget, the government gave a big relief, i.e., no tax on income up to Rs 12 lakh under the new tax regime. But here's the catch: You must file your ITR to claim it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-protean-egov-shares-are-in-free-fall-2727426-2025-05-20",
      "headline": "Explained: Why Protean eGov shares are in free fallAfter crashing 20% on Monday, the stock fell another 13% in early trade, briefly hovering near the Rs 995 mark—perilously close to its 52-week low of Rs 930."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pfizer-share-price-jump-12-percent-why-reason-q4-fy25-profit-rise-dividend-2727401-2025-05-20",
      "headline": "Pfizer share price rises 12% today. Here's whyPfizer stock: The stock jumped 11.91% during the day to touch a high of Rs 4,995.85 on the stock exchanges, after starting the day at Rs 4,698.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-bangladesh-trade-route-curbs-economic-impact-explained-2727389-2025-05-20",
      "headline": "Explained: How Bangladesh is hurting itself by curbing Indian exportsIndia's new import rules sharply limit Bangladesh's access through Northeast land ports, forcing key goods onto restricted sea routes. The move comes after Bangladesh imposed similar restrictions on Indian goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/forget-crypto-gold-and-stocks-why-indias-ultra-rich-are-buying-land-2727378-2025-05-20",
      "headline": "Forget crypto, gold and stocks: Why India's ultra-rich are buying landA luxury real estate advisor has said that India's top 0.001%, from unicorn founders to legacy dynasties, are quietly building Rs 75–500 crore portfolios, but not in stocks or crypto. Their focus is on land and branded real estate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-150-points-up-nifty-below-25000-tata-steel-gains-2-percent-2727369-2025-05-20",
      "headline": "Sensex opens 150 points up, Nifty below 25,000; Tata Steel gains 3%The S&P BSE Sensex gained 150.58 points to 82,210.00, while the NSE Nifty50 added 20.45 points to 24,965.90 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-open-for-bidding-subscribe-skip-review-gmp-good-bad-listing-gain-price-band-2727363-2025-05-20",
      "headline": "Borana Weaves IPO open for bidding: Should you subscribe? Check latest GMPThe company aims to raise Rs 144.89 crore through a fresh issue of 67 lakh shares. Borana Weaves IPO will remain open for three days and will close on Thursday, May 22, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-fall-rise-prediction-trade-setup-nse-bse-2727357-2025-05-20",
      "headline": "Stock market opening: Will Sensex, Nifty rise or fall today?Foreign Portfolio Investors (FPIs) sold shares worth Rs 525.95 crore, which added pressure on stock prices. This selling by investors was one of the reasons why the market fell slightly on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-20-bel-indusind-bank-rvnl-bel-dlf-trading-nse-bse-2727351-2025-05-20",
      "headline": "Stocks to watch on May 20: BEL, IndusInd Bank, RVNL, BEL, DLFMarkets ended lower in the last session. This decline came after global markets reacted to Moody's decision to lower the credit rating of the United States. However, mid-cap and small-cap stocks continued to do wel. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/two-foreign-funds-with-investment-in-adani-group-under-sebi-scanner-2727060-2025-05-19",
      "headline": "Two foreign funds with investment in Adani Group under Sebi scannerThe Adani Group and its 13 offshore investors have been facing an investigation by the Securities and Exchange Board of India (Sebi) since Hindenburg Research in 2023 alleged improper use of tax havens by the group, triggering a stock sell-off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-insider-trading-sebi-probe-six-officials-accounting-error-report-2727042-2025-05-19",
      "headline": "Six IndusInd Bank officials under Sebi scanner for insider trading: ReportThe Securities and Exchange Board of India (Sebi) is checking the timing of these trades to find out whether the share sales broke Sebi's rules or the bank's own internal code of conduct."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byju-raveendran-promises-comeback-despite-big-setbacks-i-am-not-giving-up-2727035-2025-05-19",
      "headline": "Byju's Raveendran promises comeback despite big setbacks: 'I am not giving up'Byju Raveendran, the founder of the edtech company, Byju's, admitted that the company made some business mistakes during its rapid global expansion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boycott-turkey-hits-fashion-online-shopping-e-commerce-myntra-ajio-stop-selling-turkish-labels-2727016-2025-05-19",
      "headline": "'Boycott Turkey' hits fashion: Myntra, Ajio stop selling these Turkish labelsThe two leading online fashion platforms have removed Turkish products after growing boycott calls over Turkey's support to Pakistan during the recent India-Pakistan military conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-271-points-lower-nifty-below-25000-eternal-zomato-falls-3-percent-2727011-2025-05-19",
      "headline": "Sensex closes 271 points lower, Nifty below 25,000, Eternal falls 3%The S&P BSE Sensex was down 271.17 points to end at 82,059.42, while the NSE Nifty50 lost 74.35 points to close at 24,945.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/high-salaries-may-not-last-forever-zoho-ceo-sridhar-vembu-warns-software-engineers-2726990-2025-05-19",
      "headline": "'High salaries may not last forever': Zoho's Sridhar Vembu warns software engineersSridhar Vembu explained that the upcoming changes in software development, especially with large language models (LLMs) and new tools powered by artificial intelligence (AI), might lead to many software jobs being lost."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/vodafone-idea-share-price-fall-drop-10-percent-why-reason-supreme-court-hearing-agr-dues-plea-rejected-2726952-2025-05-19",
      "headline": "Vodafone Idea shares drop 10%. Here's whyVodafone Idea share price: Over the last month, Vodafone Idea's stock has gone down by 16.73%. In the last year, it has fallen over 50%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-new-in-itr-forms-for-fy-2024-25-5-key-changes-you-must-know-2726940-2025-05-19",
      "headline": "What's new in ITR Forms for FY 2024-25? 5 key changes you must knowNow taxpayers need to clearly mention the specific TDS section under which tax was deducted from your income. This change applies to ITR forms 1, 2, 3 and 5. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ram-gopal-varma-slammed-for-crass-post-on-actor-kiara-advani-war-2-bikini-pic-deletes-later-2728084-2025-05-21",
      "headline": "Ram Gopal Varma slammed for crass post on Kiara's War 2 bikini pic, deletes laterFilmmaker Ram Gopal Varma recently faced criticism over a distasteful post on X about actor Kiara Advani's bikini shot from the teaser of War 2. He later deleted his late-night post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jurassic-world-rebirth-second-trailer-unveiled-releasing-on-july-2-in-theatres-2728022-2025-05-21",
      "headline": "Jurassic World Rebirth second trailer out, film to release on July 2The second trailer of 'Jurassic World Rebirth' was unveiled on May 20. The trailer revealed a range of mutant dinosaurs who were left behind on an island where they were once experimented on. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/exclusive-at-cannes-2025-the-second-wind-shines-as-india-only-women-led-film-interview-with-filmmaker-indira-baikerikar-2728082-2025-05-21",
      "headline": "Exclusive: At Cannes 2025, The Second Wind shines as India's only women-led filmFilmmaker Indira Baikerikar took her debut film 'The Second Wind' at the Cannes International Film Festival 2025. IndiaToday.in spoke to the director about presenting India's only women-centric film at the prestigious film festival this year, and showcasing the real-life stories of real Indian women on a global platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shilpa-shetty-kundra-emotional-message-for-son-viaan-whos-officially-a-teenager-now-2728083-2025-05-21",
      "headline": "Shilpa Shetty's emotional message for son Viaan who's officially a teenager nowShilpa Shetty celebrated her son Viaan's 13th birthday with a heartfelt video montage capturing his childhood memories. She also shared an emotional message encouraging him to stay curious, work hard, and enjoy his teenage years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-learning-ai-in-us-thug-life-2728087-2025-05-21",
      "headline": "Kamal Haasan on learning AI: It's here to stay, but don't be threatenedKamal Haasan went to the US to learn Artifical Intelligence (AI) for three months. In an interview with India Today, he spoke about the use of AI in movies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-emotional-tribute-to-f1-legend-ayrton-senna-wins-the-internet-2728080-2025-05-21",
      "headline": "Ajith Kumar emotional tribute to F1 legend Ayrton Senna wins the internetAjith Kumar paid an emotional tribute to Formula One icon Ayrton Senna. He visited his memorial in Imola, Italy and kissed his statue. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/achint-kaur-seeks-acting-voice-work-social-media-family-loss-2728030-2025-05-21",
      "headline": "Jamai Raja actor Achint Kaur on seeking work via social media postActor Achint Kaur of Jamai Raja fame posted a video seeking acting and voice roles after her mother's death. She was initially terrified but received strong support, opening doors to new opportunities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/amul-pays-tribute-to-tom-cruises-mission-impossible-8-better-ethan-the-rest-2728034-2025-05-21",
      "headline": "Amul pays tribute to Tom Cruise's Mission Impossible 8: Better Ethan the restAmul paid a fun tribute to Tom Cruise's 'Mission: Impossible - The Final Reckoning' with a witty cartoon showing him hanging from a helicopter while holding buttered toast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sean-diddy-threatened-ex-cassie-ventura-with-sex-tapes-demanded-20000-says-her-mother-2728056-2025-05-21",
      "headline": "Sean Diddy threatened ex Cassie with sex tapes, demanded $20,000, says her motherCassandra \"Cassie\" Ventura's mother has alleged that Sean \"Diddy\" Combs demanded $20,000 out of anger after learning that her daughter had started dating someone else. Diddy and Cassie were in a relationship for nearly a decade.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/actor-lakshmi-manchu-defends-mind-numbing-the-royals-nice-to-see-some-nonsense-2728027-2025-05-21",
      "headline": "Nice to see some nonsense: Actor Lakshmi Manchu defends 'mind-numbing' The RoyalsLakshmi Manchu came forward in support of Ishaan Khatter-Bhumi Pednekar's show 'The Royals.' She praised Ishaan's look and Bhumi's wardrobe in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-lopez-sued-by-paparazzi-for-posting-her-pics-without-permission-2728020-2025-05-21",
      "headline": "Paparazzi sues Jennifer Lopez for posting pics without permissionSinger-actor Jennifer Lopez is facing a lawsuit for sharing paparazzi photos of herself on social media. \r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mission-impossible-8-the-final-reckoning-box-office-collection-day-4-detailed-report-tom-cruise-film-pulls-off-a-steady-tuesday-2728017-2025-05-21",
      "headline": "Mission Impossible 8 box office Day 4: Tom Cruise's film pulls off a steady TuesdayTom Cruise's 'Mission: Impossible - The Final Reckoning' entered its first week at the box office in India. After seeing a drop on Monday, the film recorded a steady collection on Tuesday, nearing Rs 50 crore in four days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-fulfills-maasi-duties-shares-cute-moment-with-nephew-river-2728014-2025-05-21",
      "headline": "Ananya Panday fulfills maasi duties, shares cute moment with nephew River. WatchAnanya Panday shared adorable moments with her nephew River on Instagram, winning hearts with their sweet bond. The video is now going viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-tells-bts-jin-to-video-call-his-mom-instead-of-sending-a-selfie-2727972-2025-05-21",
      "headline": "No selfie, video call your mom, says Tom Cruise to BTS JinHollywood star Tom Cruise met BTS's Jin during his South Korea tour for 'Mission: Impossible – The Final Reckoning' and appeared on episode 5 of 'Run Jin.' A clip from the show has gone viral moment where Cruise encouraged Jin to video call his mother instead of sending a selfie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-announces-release-date-of-his-biography-mukharagam-on-birthday-2728008-2025-05-21",
      "headline": "Mohanlal announces release date of his biography, Mukharagam, on birthdayMalayalam icon Mohanlal marks his 65th birthday by revealing the release date of his much-anticipated biography Mukharagam. The book, penned by Bhanu Prakash, highlights his illustrious 47-year journey in cinema and beyond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-praises-mm-keeravani-for-hari-hara-veera-mallu-song-felicitates-him-2728012-2025-05-21",
      "headline": "Show me your Oscar: Pawan Kalyan tells Keeravaani as he felicitates himPawan Kalyan is awaiting the release of his upcoming movie 'Hari Hara Veera Mallu'. Ahead of its release, he visited Oscar-winning composer MM Keeravani's residence and felicitated him for the third single, Asura Hananam.'\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lady-gaga-wins-sports-emmy-for-super-bowl-performance-2727974-2025-05-21",
      "headline": "Lady Gaga wins Sports Emmy for Super Bowl performanceLady Gaga is now an Emmy winner. She was honoured for her Super Bowl performance of her hit number, 'Hold My Hand'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sushmita-sen-celebrates-31-years-of-miss-universe-2727973-2025-05-21",
      "headline": "India's 1st ever victory: Sushmita Sen celebrates 31 years of winning Miss UniverseActor Sushmita Sen shared a note and celebrated 31 years of Miss Universe.  The actor in her note mentioned how it was 'India's first ever victory.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/george-wendt-dies-in-his-sleep-at-76-2727960-2025-05-21",
      "headline": "'Cheers' actor George Wendt dies in his sleep at 76Actor George Wendt died peacefully in his sleep on May 20. He was 76. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-waqf-law-hearing-waqf-by-user-principle-government-land-2728061-2025-05-21",
      "headline": "Waqf is like charity, not an essential part of Islam: Centre to Supreme CourtThe Centre told the Supreme Court that the latest Waqf law amendments 'resolved problems' that the British and successive Indian governments could not settle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-grants-interim-bail-to-ashoka-university-professor-over-op-sindoor-post-refuses-to-stay-probe-2728018-2025-05-21",
      "headline": "Ashoka professor gets bail, rapped for 'cheap publicity' in Op Sindoor postAli Khan Mahmudabad of Ashoka University was arrested last week after his social media post on Operation Sindoor was perceived as critical of the armed forces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/not-a-drug-lord-terrorist-murderer-supreme-court-grants-anticipatory-bail-to-ex-ias-trainee-puja-khedkar-2728059-2025-05-21",
      "headline": "Not a murderer, terrorist: Top court grants bail to ex-IAS trainee Puja KhedkarProviding relief to Puja Khedkar, the Supreme Court observed that she is 'not a drug lord or a terrorist' while the Delhi Police strongly opposed the anticipatory bail, stating that she was not cooperating with the probe."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/nikhil-somawanshi-iisc-graduate-toxic-work-culture-ola-krutrim-extreme-pressure-may-8-death-in-bengaluru-lake-2728055-2025-05-21",
      "headline": "Tell everyone I died in accident, Ola Krutrim techie texted friend before suicideNikhil Somawanshi, a machine learning engineer at Krutrim, who allegedly died by suicide had messaged his friend to tell everyone that he had died by accident. His body was found in a Bengaluru lake the next morning. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/post-operation-sindoor-indian-security-needs-to-look-east-kashmir-pakistan-terrorism-isi-bangladesh-2727759-2025-05-21",
      "headline": "Post-Op Sindoor, why Pak's threat for India will emerge from the eastAs Pakistan's military establishment licks its wounds after Operation Sindoor, it will look for spots far from Kashmir to foment trouble so that no smoking gun leads to it. There are reasons galore that India's security establishment should be keeping a hawk-eyed watch on its eastern borders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/sonia-gandhi-rahul-enjoyed-rs-142-crore-in-proceeds-of-crime-ed-to-court-in-national-herald-case-2727992-2025-05-21",
      "headline": "Rs 142 crore in proceeds of crime: Big charge on Gandhis in National Herald caseAdditional Solicitor General SV Raju, representing the federal agency, told the court that the accused were 'enjoying the proceeds of crime' until the Enforcement Directorate (ED) attached properties worth Rs 751.9 crore linked to the National Herald in November 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/encounter-underway-between-district-reserve-guard-jawans-naxals-in-chhattisgarhs-narayanpur-2727982-2025-05-21",
      "headline": "Chhattisgarh encounter: Top Naxal leader carrying Rs 1 crore bounty among 30 killedAs many as 30 Naxals were killed in an encounter with District Reserve Guard (DRG) jawans in Chhattisgarh's Narayanpur district."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/national-herald-money-laundering-case-explained-charges-against-sonia-gandhi-rahul-2728000-2025-05-21",
      "headline": "Are Sonia Gandhi, Rahul in trouble in the National Herald case?The National Herald case involves allegations of financial irregularities and money laundering against Sonia Gandhi, her son Rahul Gandhi. In this edition of The Lowdown, we delve into the intricacies of the case, the charges against the Congress leaders and the consequences if the allegations are proved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/sbi-anekal-taluk-branch-officer-customer-kannada-speaking-argument-viral-video-2727968-2025-05-21",
      "headline": "Won't speak Kannada, this is India: SBI official spars with customer, transferredA viral video showing an SBI staffer refusing to speak Kannada has sparked backlash, prompting an apology from the bank. However, pro-Kannada activists demanded respect for the state's official language and have called for a protest outside its main office in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rjd-tejashvi-yadav-patna-nmch-rats-nibble-patients-toes-sipped-9-lakh-litre-liquor-bihar-need-pied-piper-2727574-2025-05-21",
      "headline": "Why Bihar needs its very own Pied PiperRats nibbled at a patient's toes at a Patna hospital recently. Rats seem to have overrun Bihar, guzzling lakhs of litres of booze and saline water, and damaging dams, resulting in floods. Bihar might be in need of a Pied Piper to lead the rats away."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistanis-came-to-india-to-create-problem-ethiopian-envoy-on-pahalgam-attack-glbs-2727899-2025-05-21",
      "headline": "Pakistanis came to India to create problem: Ethiopian envoy on Pahalgam attackEthiopian Ambassador Fesseha Shawel Gebre condemned the April 22 Pahalgam terror attack, blaming Pakistan for cross-border violence and praising India's response. He affirmed solidarity in fighting terrorism globally.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/exclusive-at-cannes-2025-the-second-wind-shines-as-india-only-women-led-film-interview-with-filmmaker-indira-baikerikar-2728082-2025-05-21",
      "headline": "Exclusive: At Cannes 2025, The Second Wind shines as India's only women-led filmFilmmaker Indira Baikerikar took her debut film 'The Second Wind' at the Cannes International Film Festival 2025. IndiaToday.in spoke to the director about presenting India's only women-centric film at the prestigious film festival this year, and showcasing the real-life stories of real Indian women on a global platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-multi-party-delegation-on-terror-is-narendra-modis-diplomatic-domestic-masterstroke-2727616-2025-05-20",
      "headline": "Why multi-party delegation on terror is Modi's diplomatic, domestic masterstrokeWhile projecting national unity to the world against terrorism, it pushes the Opposition to align on a burning issue or risk appearing opportunistic"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-prepares-strike-iran-nuclear-facilities-rising-tensions-2728074-2025-05-21",
      "headline": "Why Israel cannot strike Iranian nuclear facilities without US helpIsrael lacks the specialist munitions that could completely destroy Iranian nuclear weapons infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-global-outreach-starts-today-delegations-briefed-india-new-normal-2727916-2025-05-21",
      "headline": "India's Operation Sindoor outreach starts, 2 delegations head to Japan, UAEForeign Secretary Vikram Misri briefed Members of Parliament who are part of delegations visiting various countries as part of India's Operation Sindoor global outreach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indian-astronaut-shubhanshu-shukla-will-wear-this-special-watch-while-living-and-working-in-space-2728037-2025-05-21",
      "headline": "Indian astronaut will wear this special watch while living in spaceThese watches are engineered to withstand the extreme conditions of space, from microgravity to intense temperature fluctuations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/tamil-nadu-approaches-supreme-court-against-centre-for-withholding-education-funds-over-not-implementing-nep-2727925-2025-05-21",
      "headline": "Tamil Nadu takes Centre to Supreme Court for withholding education fundsTamil Nadu in its petition to the Supreme Court accused the Central government of financial coercion. Tamil Nadu said the Centre was forcing the state to impose NEP, and sought judicial intervention to protect federalism and education rights. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/spy-youtuber-jyoti-malhotra-confesses-met-pakistani-intelligence-agents-2727961-2025-05-21",
      "headline": "'Spy' YouTuber admits to meeting Pak agents, use of encrypted apps: SourcesHaryana-based YouTuber Jyoti Malhotra has told interrogators that she was in regular contact with Danish, a Pakistani High Commission official in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indian-origin-doctor-mohanadas-balasingham-licence-revoked-over-misconduct-allegations-in-sydney-australia-2728015-2025-05-21",
      "headline": "Indian-origin Sydney doctor files suit after licence suspended over vaginal testAn Indian-origin doctor's licence was suspended in Sydney for three years after a patient accused him of asking inappropriate sexual questions and performing a vaginal examination without informed consent. Mohanadas Balasingham denied the allegations and filed an AUD $20-million suit against the Australian tribunal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-pink-couture-banaras-cannes-red-carpet-homebound-2727908-2025-05-21",
      "headline": "Janhvi Kapoor stuns in pink couture from Banaras on Cannes red carpet. PicsJanhvi Kapoor made her red carpet debut at Cannes on Tuesday in Tarun Tahiliani's couture. Her blush pink outfit was handcrafted from Banaras."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/what-is-golden-dome-trumps-175-billion-defence-shield-to-counter-china-russia-glbs-2727883-2025-05-21",
      "headline": "Trump unveils $175-billion 'Golden Dome' defence plan to counter China, RussiaUS President Donald Trump has announced a $175 billion missile defence plan, the Golden Dome. It will use satellites to track and stop missiles from threats like China and Russia. The system also targets new dangers like AI drones and hypersonic weapons.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-metro-women-insta-page-secretly-films-women-bmrcl-cops-register-case-2728013-2025-05-21",
      "headline": "Case against Instagram page for secretly filmed videos of women on Bengaluru MetroA user on the social media site 'X' exposed an Instagram page posting secretly recorded videos of women on the Bengaluru Metro. They tagged city authorities demanding action. DSP South confirmed that an FIR has been registered in this regard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-is-banu-mushtaq-kannada-writer-who-made-history-with-international-booker-prize-2025-2727978-2025-05-21",
      "headline": "Who is Banu Mushtaq, Kannada writer who made history with International Booker?Banu Mushtaq scripted history by becoming the first Kannada writer to win the coveted International Booker Prize. With this achievement, Mushtaq now joins an elite list of Indians who have won the coveted prize since its inception in 1969 -- including V.S. Naipaul, Salman Rushdie, Arundhati Roy, Kiran Desai, Aravind Adiga, and Geetanjali Shree."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-new-test-captain-squad-announcement-shubman-gill-rishabh-pant-2728075-2025-05-21",
      "headline": "India's new Test captain, England tour squad likely to be announced on May 24The new Indian Test team captain and the England tour squad are likely to be announced on May 24, sources have told India Today. India's tour of England will begin on June 20, with the first Test in Headingley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-knocked-out-hs-prannoy-malaysia-masters-2728068-2025-05-21",
      "headline": "PV Sindhu crashes out of Malaysia Masters, HS Prannoy advancesPV Sindhu's poor run of form in 2025 continued after Vietnam's Nguyen Thuy Linh defeated her 21-11, 14-21, 21-15 in the first round of the Malaysia Masters 2025. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-anushka-sharma-rcb-pickleball-event-2728045-2025-05-21",
      "headline": "Virat Kohli, Anushka Sharma become pickleball partners at RCB team eventVirat Kohli and Anushka Sharma showed off their real-life partnership on the pickleball court during a pickleball event for the RCB squad as part of their team bonding activities. RCB will be heading to Lucknow for their final two games in the league phase. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-europa-league-final-manchester-united-vs-tottenham-hotspur-ruben-amorim-2728036-2025-05-21",
      "headline": "Manchester United boss Ruben Amorim says winning Europa League won't save seasonRuben Amorim feels that winning the Europa League will not save Manchester United's poor 2024-25 season. United will face Tottenham Hotspur in the final on Wednesday, May 21 in Bilbao. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-vs-dc-mahela-jayawardene-press-conference-playoffs-2728021-2025-05-21",
      "headline": "MI have played good cricket, deserve to have playoffs fate in own hands: JayawardeneIPL 2025, MI vs DC: Mahela Jayawardene said that Mumbai Indians have played good cricket, having won six out of their last seven matches, and deserve to have play-off fate in their own hands. A win for MI on Wednesday will send them through to the playoffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-retirement-csk-vs-rr-sanjay-bangar-2728010-2025-05-21",
      "headline": "If I was MS Dhoni, I would say enough: Sanjay Bangar on CSK legend's retirementSanjay Bangar said that if he was MS Dhoni he would call it a day and walk away from the IPL. Dhoni and CSK endured a torrid time during the IPL 2025 season as Chennai are languishing at the bottom of the table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mahela-jayawardene-mi-vs-dc-press-conference-2728003-2025-05-21",
      "headline": "Amidst heavy showers in Mumbai, Jayawardene hopes new IPL rule will help MIMumbai Indians head coach Mahela Jayawardene expressed hope that the IPL's extended match window will help avoid rain disruptions as the team gears up for a crucial do-or-die clash against Delhi Capitals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-preview-team-news-pitch-wankhede-2727995-2025-05-21",
      "headline": "Delhi under must-win pressure as Mumbai look to seal playoff berthIPL 2025: Mumbai Indians will look to secure their berth in the playoffs when they lock horns with the Delhi Capitals on May 21 at the Wankhede Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-europa-league-final-manchester-united-vs-tottenham-hotspur-head-to-head-team-news-livestreaming-details-2727988-2025-05-21",
      "headline": "Manchester United vs Tottenham, UEFA Europa League final: All you need to knowManchester United and Tottenham Hotspur are all set to square off in an exciting UEFA Europa League final in Bilbao on Wednesday, May 21. United and Spurs will be aiming to end a wretched 2024-25 campaign with some silverware. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-mumbai-weather-rain-threat-parth-jindal-2727967-2025-05-21",
      "headline": "Amidst rain threat in Mumbai, Parth Jindal wants MI vs DC clash moved out: ReportAmidst rain threat in Mumbai, DC co-owner Parth Jindal has reportedly requested the IPL to move their clash against MI on May 21 out of the city. The MI vs DC clash is considered to be a virtual knockout in the IPL 2025 play-off race. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-vikram-rathour-press-conference-csk-vs-rr-2727965-2025-05-21",
      "headline": "Rajasthan are going to come back stronger as a batting unit: Vikram RathourIPL 2025, CSK vs RR: Rajasthan Royals batting coach Vikram Rathour said that his team would make a strong comeback next season as a batting unit. On Tuesday, the Royals finished their campaign with a six-wicket win over five-time champions Chennai Super Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mahela-jayawardene-mi-vs-dc-press-conference-2728003-2025-05-21",
      "headline": "Amidst heavy showers in Mumbai, Jayawardene hopes new IPL rule will help MIMumbai Indians head coach Mahela Jayawardene expressed hope that the IPL's extended match window will help avoid rain disruptions as the team gears up for a crucial do-or-die clash against Delhi Capitals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-preview-team-news-pitch-wankhede-2727995-2025-05-21",
      "headline": "Delhi under must-win pressure as Mumbai look to seal playoff berthIPL 2025: Mumbai Indians will look to secure their berth in the playoffs when they lock horns with the Delhi Capitals on May 21 at the Wankhede Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-europa-league-final-manchester-united-vs-tottenham-hotspur-head-to-head-team-news-livestreaming-details-2727988-2025-05-21",
      "headline": "Manchester United vs Tottenham, UEFA Europa League final: All you need to knowManchester United and Tottenham Hotspur are all set to square off in an exciting UEFA Europa League final in Bilbao on Wednesday, May 21. United and Spurs will be aiming to end a wretched 2024-25 campaign with some silverware. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-mumbai-weather-rain-threat-parth-jindal-2727967-2025-05-21",
      "headline": "Amidst rain threat in Mumbai, Parth Jindal wants MI vs DC clash moved out: ReportAmidst rain threat in Mumbai, DC co-owner Parth Jindal has reportedly requested the IPL to move their clash against MI on May 21 out of the city. The MI vs DC clash is considered to be a virtual knockout in the IPL 2025 play-off race. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-vikram-rathour-press-conference-csk-vs-rr-2727965-2025-05-21",
      "headline": "Rajasthan are going to come back stronger as a batting unit: Vikram RathourIPL 2025, CSK vs RR: Rajasthan Royals batting coach Vikram Rathour said that his team would make a strong comeback next season as a batting unit. On Tuesday, the Royals finished their campaign with a six-wicket win over five-time champions Chennai Super Kings. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}