{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-subscription-details-sees-rs-32-lakh-crore-bids-gmp-crosses-100-percent-2598016-2024-09-11",
      "headline": "Bajaj Housing Finance IPO sees Rs 3.2 lakh crore bids, GMP crosses 100%Bajaj Housing Finance IPO: Before the public issue, Bajaj Housing Finance managed to raise Rs 1,758 crore from 104 anchor investors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-toll-collection-explained-how-gnss-will-change-your-highway-experience-2597975-2024-09-11",
      "headline": "New toll collection explained: How GNSS will change your highway experienceUnder the new rules, the GNSS will automatically grant exemptions for travel up to 20 km per day, charging toll fees only for the distance travelled beyond this limit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thematic-mutual-funds-explained-should-you-invest-all-you-need-to-know-2597951-2024-09-11",
      "headline": "Thematic mutual funds explained: Are they the right bet for investors?Thematic funds have outpaced traditional categories in popularity. But what are they, and why are AMCs launching so many? Here's what you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-funds-sahi-hai-amfi-data-why-so-many-indians-are-betting-big-on-sips-2597876-2024-09-11",
      "headline": "Mutual funds sahi hai? Why so many Indians are betting big on SIPsIt took 50 years to build Rs 10 lakh crore in AUM from 1963 to 2013, but in just six more years, it reached Rs 23 lakh crore by 2019. As of August 2024, the AUM has tripled to Rs 66.70 lakh crore, demonstrating strong investor confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-fall-tata-motors-share-price-2597865-2024-09-11",
      "headline": "Sensex dips 400 points, Nifty ends below 25,000; Tata Motors tanks 6%The S&P BSE Sensex fell 398.13 points to 81,523.16 at the closing bell, while the NSE Nifty50 declined 122.65 points to settle at 24,918.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-electronics-global-job-cuts-layoffs-india-employees-2597858-2024-09-11",
      "headline": "Samsung plans global job cuts up to 30%, 1,000 layoffs likely in India: Report In India, Samsung has already begun offering severance packages to mid-level employees, with up to 1,000 jobs expected to be affected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-maruti-mm-mahindra-why-auto-stocks-are-in-red-today-ubs-2597849-2024-09-11",
      "headline": "Tata Motors, Maruti, M&M: Why auto stocks are in red today Among the major components of the BSE Auto index, Tata Motors Ltd experienced the largest drop, falling by 5.60%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/semicon-2024-5-things-pm-modi-shared-on-india-semiconductor-ambitions-chips-2597811-2024-09-11",
      "headline": "Semicon 2024: 5 things PM Modi shared on India's semiconductor ambitionsSemicon India 2024: PM Modi shared a plan to create a workforce of 85,000 skilled professionals, including technicians, engineers, and R&D experts, who will be industry-ready in the coming years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ubs-view-tata-motors-share-price-sell-rating-20-percent-downside-risk-investors-buy-or-sell-stock-2597798-2024-09-11",
      "headline": "UBS sees 20% downside potential in Tata Motors stock. Should you hold or sell? UBS, which holds a \"sell\" rating on the stock, cited concerns that moderating demand, rising discounts, and the absence of new internal combustion engine and hybrid launches could severely impact JLR's financial performance by fiscal 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindenburg-research-questions-madhabi-puri-buchs-silence-on-congress-allegations-2597756-2024-09-11",
      "headline": "Hindenburg questions Sebi chief Madhabi Buch's silence on Congress's new chargeHindenburg Research's statement comes after the Congress party raised fresh allegations about Buch's links to listed companies regulated by Sebi. The short-seller also said that Madhabi Puri Buch has remained silent on the accusations for weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suzlon-energy-share-price-upper-circuit-5-percent-up-more-gains-left-2597705-2024-09-11",
      "headline": "Suzlon Energy hits 5% upper circuit for 2nd straight day. More upside left?Suzlon Energy has seen its stock value more than triple in the last year, gaining 223% over the past 12 months and 102% in 2024 alone.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/semicon-india-2024-pm-modi-you-can-bet-on-india-when-chips-are-down-2597684-2024-09-11",
      "headline": "You can bet on India when chips are down: PM Modi at Semicon India 2024Semicon India 2024 is a three-day event aimed at showcasing India's semiconductor strategy and policies, with the goal of establishing the country as a global hub for semiconductor manufacturing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-shares-hit-52-week-high-5-percent-rise-early-trade-more-upside-expert-view-2597669-2024-09-11",
      "headline": "Zomato shares hit 52-week high. Is there more upside? Global brokerage firms like Jefferies and JP Morgan have also shown optimism, maintaining a 'buy' recommendation. Jefferies set a target price of Rs 335 for Zomato, reinforcing the positive sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-slumps-6-percent-today-ubs-sell-rating-2597653-2024-09-11",
      "headline": "Explained: Why Tata Motors shares slumped nearly 6% today At 11:30 am, Tata Motors shares were trading 5.57% lower at Rs 977.80 on the Bombay Stock Exchange."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-gain-in-volatile-trade-tata-motors-plunges-5-zomato-up-3-2597639-2024-09-11",
      "headline": "Sensex, Nifty gain in volatile trade, Tata Motors plunges 5%, Zomato up 3%The S&P BSE was up 106.96 points at 82,030.60, while the NSE Nifty50 rose 32.85 points to 25,073.95 at 11:20 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-india-layoff-job-cut-executive-roles-over-200-business-slowdown-report-2597628-2024-09-11",
      "headline": "Samsung India layoffs: Tech giant set to cut 200 jobs, says reportSamsung layoffs: The job cuts will affect various departments, including mobile phones, consumer electronics, home appliances, and support functions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahindra-pidilite-dr-reddy-deny-conflict-interest-claims-involving-sebi-chairperson-madhavi-buch-husband-dhaval-buch-2597403-2024-09-10",
      "headline": "Mahindra, Pidilite, Dr Reddy's refute conflict allegations involving Dhaval BuchMahindra & Mahindra, Dr. Reddy's Laboratories, and Pidilite Industries have refuted Congress's allegations of conflict of interest involving SEBI Chairperson Madhabi Puri Buch's husband. The companies clarified their engagements with Dhaval Buch were based on his expertise and predate her SEBI tenure.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-toll-rules-pay-only-for-distance-covered-no-charges-for-first-20-km-gnss-2597322-2024-09-10",
      "headline": "New toll rules: Pay only for distance covered, no charges for first 20 kmThe new toll rules are part of the revised National Highways Fee Rules, 2024, which now focus on a pay-as-you-go system based on the distance you travel beyond the initial 20 km."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-day-2-latest-subscription-booked-8x-expected-listing-gains-2597288-2024-09-10",
      "headline": "Bajaj Housing Finance IPO booked 8x on Day 2. Check expected listing gainsBajaj Housing Finance is offering its shares in the price range of Rs 66-70 each. Investors can apply for a minimum of 214 shares and in multiples thereafter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-assets-hit-record-rs-66-lakh-crore-in-august-amfi-data-sip-2597259-2024-09-10",
      "headline": "Mutual fund assets hit record Rs 66 lakh crore in AugustData from the Association for Mutual Funds in India (AMFI) shows that inflows into equity mutual funds rose by 3% in August, reaching Rs 38,239 crore."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-clashes-in-mandyas-nagamangala-as-stones-thrown-during-ganpati-procession-2598225-2024-09-12",
      "headline": "Clashes in Karnataka's Mandya as stones thrown during Ganpati processionAs per initial information, some people from Badarikoppalu village were taking out a procession for Ganpati idol immersion. As the procession was passing on the main road in Nagamangala, stones were allegedly thrown at them from near a mosque."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/health-coverage-extended-all-senior-citizens-age-70-years-above-ayushman-bharat-scheme-2598099-2024-09-11",
      "headline": "Centre extends Ayushman health insurance coverage to all above 70Union Minister Ashwini Vaishnaw said the coverage aims to benefit six crore senior citizens from 4.5 crore families with Rs five lakh free health insurance cover."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/congress-candidates-haryana-polls-randeep-surjewala-son-aditya-fielded-kaithal-2598208-2024-09-11",
      "headline": "Randeep Surjewala's son among 40 candidates announced by CongressWith this list, the Congress has declared a total of 81 candidates for elections to the 90-member Assembly.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-doctor-rape-murder-protests-medics-agree-talks-west-bengal-government-2597864-2024-09-11",
      "headline": "Doctors demand live telecast, 30-member team for meeting with Mamata BanerjeeOn Wednesday morning, doctors said they had agreed to a meeting and emailed the Chief Minister's Office. They demanded a live telecast of the meeting, and demanded that a delegation of 30 representatives be present. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/first-presidential-debate-who-won-democrat-kamala-harris-republican-donald-trump-abc-news-philadelphia-pennsylvania-2597966-2024-09-11",
      "headline": "Kamala Harris vs Donald Trump: Who won presidential debate? What US media saidThe first presidential debate between Kamala Harris and Donald Trump was held on Tuesday, with Harris widely seen as the winner by US media outlets. Media analysis highlights Harris's strong performance, with many outlets noting that she effectively baited Trump and presented a clear and crisp message, while Trump appeared angry and defensive."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/malaika-arora-father-anil-mehta-final-words-suicide-mumbai-police-probe-2598230-2024-09-12",
      "headline": "Before his death, Anil Mehta's final words to Malaika Arora: I am sick and tired Anil Mehta, 65, died on Wednesday morning by jumping from the sixth-floor balcony of his residence in Bandra. Mehta's wife, Joyce Polycarp, was in their flat at Ayesha Manor in Bandra when the incident took place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-taylor-swift-endorsing-kamala-harris-democrat-republican-childless-cat-lady-2597965-2024-09-11",
      "headline": "She'll pay the price...: Trump jabs Taylor Swift for endorsing Kamala HarrisIn an interview with Fox & Friends, Trump said Swift has always endorsed a Democrat, and she will probably \"pay a price for it in the marketplace\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-sikh-remark-us-visit-protest-delhi-bjp-2597909-2024-09-11",
      "headline": "Sikhs protest outside Rahul Gandhi's house in Delhi over remarks in USRahul Gandhi's remark on the Sikh community has drawn a sharp reaction. On Wednesday, a BJP-backed Sikh group protested outside his residence in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/video/watch-pm-attends-ganpati-puja-celebrations-at-chief-justice-chandrachuds-home-2598144-2024-09-11",
      "headline": "Watch: PM attends Ganpati Puja celebrations at Chief Justice Chandrachud's homePrime Minister Narendra Modi took part in the Ganesh Puja celebrations held at the Delhi residence of Chief Justice of India, DY Chandrachud. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-statement-father-anil-kuldip-mehta-suicide-2598124-2024-09-11",
      "headline": "Malaika Arora shares first statement after father Anil Mehta's deathMalaika Arora shares a heartfelt statement following the tragic death of her father, Anil Mehta. He died on September 11 in what police have termed a prima facie case of suicide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-1st-t20i-travis-head-19-ball-fifty-2598214-2024-09-11",
      "headline": "Travis Head blasts 30 runs off Sam Curran, races to 19-ball fiftyEngland vs Australia, 1st T20I: Australian opener Travis Head smashed 30 runs off a single over from Sam Curran on his way to a 19-ball fifty against England in the series opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/vir-das-first-indian-to-host-international-emmy-awards-2024-2598145-2024-09-11",
      "headline": "Vir Das to host International Emmy Awards 2024Stand-up comedian and actor Vir Das, who won his first International Emmy last year, will be returning to the Emmys stage as the host of International Emmy Awards 2024. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thematic-mutual-funds-explained-should-you-invest-all-you-need-to-know-2597951-2024-09-11",
      "headline": "Thematic mutual funds explained: Are they the right bet for investors?Thematic funds have outpaced traditional categories in popularity. But what are they, and why are AMCs launching so many? Here's what you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/engineer-baramulla-mp-rashid-walks-out-jail-vows-fight-modis-naya-kashmir-narrative-2597955-2024-09-11",
      "headline": "Engineer Rashid walks out of jail, vows to fight 'Modi's Naya Kashmir narrative'Engineer Rashid, who has been in jail since 2019 for a terror funding case, was granted interim bail till October 2 to campaign for the upcoming Jammu and Kashmir Assembly elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/kamala-harris-wear-earpiece-presidential-debate-donald-trump-us-election-2024-2598020-2024-09-11",
      "headline": "Did Kamala Harris wear earpiece during debate with Donald Trump? What we knowMany social media users claimed that the pearl earrings Kamal Harris wore were actually an audio earpiece, and she was being fed answers during the debate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/donald-trump-jd-vance-immigration-row-ohion-springfield-boy-death-car-crash-haitian-man-2598084-2024-09-11",
      "headline": "Ohio man slams Trump, Vance for politicising son's death in immigration rowAn 11-year-old boy's death, caused when a minivan collided with a school bus in Ohio, has been used by Donald Trump to criticise immigration. The boy's father has slammed the use of his son's death for political gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/mohammad-ali-jinnah-journey-from-congress-supporter-muslim-league-leader-india-partition-2598012-2024-09-11",
      "headline": "How Jinnah went from a pro-Congress nationalist to the leader of Muslim LeagueMohammad Ali Jinnah's journey from India's youngest lawyer to the architect of India's partition paints a vivid portrait of political transformation. His shift from championing unity to forging a separate Muslim state captures the tumultuous spirit of his time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-us-statement-religious-minorities-india-sikhs-ilhan-omar-khalistani-terrorist-gurpatwant-singh-pannun-2597878-2024-09-11",
      "headline": "Even if in good faith, Rahul Gandhi shows India in bad light abroadRahul Gandhi's two remarks and a meeting in the US have sparked a massive controversy with the BJP attacking him for \"running down India on foreign soil\". Here's how Rahul Gandhi, now the Leader of the Opposition (LoP) in the Lok Sabha, allowed his remarks to be hijacked by a Khalistani terrorist and portrayed India as 'not a fair place'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/how-to-keep-your-cabin-baggage-safe-during-a-flight-2597662-2024-09-11",
      "headline": "How to keep your cabin baggage safe during a flightWith the rise in in-flight thefts, are you concerned about someone sneaking your belongings out of your cabin baggage? By taking a few precautions, you can ensure your luggage stays secure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/billionaire-polaris-dawn-astronaut-to-conduct-worlds-first-private-spacewalk-2598011-2024-09-11",
      "headline": "Billionaire astronaut to conduct world's first private spacewalkThe groundbreaking event is scheduled to take place on the third day of the five-day mission, which launched on September 10 from NASA's Kennedy Space Center in Florida."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jayam-ravi-aarti-ravi-divorce-announcement-consent-blindsided-2597615-2024-09-11",
      "headline": "Jayam Ravi's wife Aarti: Divorce announcement was made without my consentJayam Ravi's estranged wife Aarti Ravi shared her first statement regarding the dissolution of their marriage. In the statement, she explained that she was blindsided by Ravi's announcement, which was made without her consent."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/olympics/video/vinesh-phogat-claims-lack-of-support-during-olympic-ordeal-is-she-speaking-truth-2597727-2024-09-11",
      "headline": "Vinesh Phogat claims lack of support during Olympic ordeal: What's the truth?India Today's Nikhil Naz dissects Vinesh Phogat's explosive claims about lack of support and politics during her Paris Olympic ordeal. The former wrestler accused Indian Olympic Association chief PT Usha of not supporting her in Paris. Vinesh returned empty-handed from the Olympics after her appeal against disqualification was rejected. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-responds-taylor-swift-twitter-childless-cat-lady-endorses-kamala-harris-donald-trump-us-presidential-debate-2597620-2024-09-11",
      "headline": "Elon Musk's low blow to Taylor Swift: I'll give you a child, guard your catsElon Musk's remark came shortly after pop star Taylor Swift said she would be voting for Kamala Harris in the US presidential election in November following the latter's debate with Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/rahul-gandhis-meeting-ilhan-omar-us-representative-anti-india-bjp-2597851-2024-09-11",
      "headline": "Who is Ilhan Omar, US lawmaker whose meeting with Rahul Gandhi sparked row?The BJP criticised Rahul Gandhi's meeting with Ilhan Omar, alleging her anti-India stance on issues including Kashmir and the killing of Khalistani terrorist Hardeep Singh Nijjar."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/malaika-arora-father-anil-mehta-final-words-suicide-mumbai-police-probe-2598230-2024-09-12",
      "headline": "Before his death, Anil Mehta's final words to Malaika Arora: I am sick and tired Anil Mehta, 65, died on Wednesday morning by jumping from the sixth-floor balcony of his residence in Bandra. Mehta's wife, Joyce Polycarp, was in their flat at Ayesha Manor in Bandra when the incident took place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/vir-das-first-indian-to-host-international-emmy-awards-2024-2598145-2024-09-11",
      "headline": "Vir Das to host International Emmy Awards 2024Stand-up comedian and actor Vir Das, who won his first International Emmy last year, will be returning to the Emmys stage as the host of International Emmy Awards 2024. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/watch-ranbir-kapoor-mother-neetu-kapoor-perform-ganesh-aarti-before-visarjan-2598113-2024-09-11",
      "headline": "Watch: Ranbir Kapoor, mother Neetu Kapoor perform Ganesh Aarti  before visarjanBollywood actor Ranbir Kapoor and his mother, actor Neetu Kapoor, bid adieu to Ganapati. The mother-son duo performed Ganapati aarti before the visarjan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-statement-father-anil-kuldip-mehta-suicide-2598124-2024-09-11",
      "headline": "Malaika Arora shares first statement after father Anil Mehta's deathMalaika Arora shares a heartfelt statement following the tragic death of her father, Anil Mehta. He died on September 11 in what police have termed a prima facie case of suicide."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-1st-t20i-score-travis-head-matthew-short-bowlers-win-southampton-2598237-2024-09-12",
      "headline": "ENG v AUS, 1st T20I: Travis Head, bowlers fire Australia to big win, 1-0 lead England vs Australia, 1st T20I: Travis Head's blazing fifty and a disciplined bowling effort helped Australia win the series opener in Southampton by 28 runs. Liam Livingstone's all-round effort went in vain for the hosts on a chilly evening on Wednesday, September 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-1st-t20i-travis-head-19-ball-fifty-2598214-2024-09-11",
      "headline": "Travis Head blasts 30 runs off Sam Curran, races to 19-ball fiftyEngland vs Australia, 1st T20I: Australian opener Travis Head smashed 30 runs off a single over from Sam Curran on his way to a 19-ball fifty against England in the series opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-phil-salt-2598206-2024-09-11",
      "headline": "ENG vs AUS: Phil Salt honoured with England T20I captaincyENG vs AUS: England stand-in captain Phil Salt said that he was honoured to receive the leadership position for the T20I side. Salt is filling in for injured Jos Buttler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-board-franchise-owners-yet-to-reach-consensus-on-scheduling-of-psl-2025-2598204-2024-09-11",
      "headline": "PCB, franchise owners yet to reach consensus on scheduling of PSL 2025The Pakistan Cricket Board (PCB) and franchise owners in the Pakistan Super League (PSL) are yet to decide the scheduling of next year's T20 tournament. The proposed April-May window for PSL 2025 will clash with the Indian Premier League (IPL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/srihari-natraj-wins-tamil-nadu-quartet-breaks-mixed-4x100m-medley-record-2598185-2024-09-11",
      "headline": "Srihari Natraj wins, Tamil Nadu quartet breaks mixed 4x100m medley recordKarnataka's Srihari Natraj clinched the men's 100m freestyle, while Tamil Nadu's quartet set a new record in the mixed 4x100m medley. Other notable performances include Vritti Agarwal's lead in the women's 1500m freestyle and multiple close finishes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/former-dc-head-coach-ricky-ponting-teases-ipl-2025-return-2598162-2024-09-11",
      "headline": "Former DC head coach Ricky Ponting teases IPL 2025 returnFormer Australia cricketer Ricky Ponting has teased his return to the Indian Premier League. The former DC coach revealed that there might be some opportunities coming up for him in the next few weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-welcome-lfp-mediation-with-mbappe-over-wage-dispute-2598147-2024-09-11",
      "headline": "PSG welcome LFP mediation with Mbappe over wage disputeParis St Germain has accepted a mediation offer from the French football league's governing body (LFP) regarding Kylian Mbappe's wage dispute. The dispute follows Mbappe's departure to Real Madrid after refusing a contract extension with PSG."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anton-roux-steps-down-as-sri-lanka-fielding-coach-2598126-2024-09-11",
      "headline": "Anton Roux steps down as Sri Lanka fielding coachAnton Roux, currently serving as Sri Lanka's national fielding coach, announced his decision to step down from the role. Roux became Sri Lanka's national fielding coach in March 2022.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/narayan-jagadeesan-sets-ultimate-india-goal-after-ipl-snub-last-season-2598125-2024-09-11",
      "headline": "Ultimate aim is to be part of Team India: Narayan JagadeesanNarayan Jagadeesan said that he aims to play for India and find his way back into the IPL. Last season, the Tamil Nadu wicketkeeper went sold in the auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-uniteds-losses-rise-despite-a-year-of-record-revenues-2598115-2024-09-11",
      "headline": "Manchester United's losses rise despite a year of record revenuesManchester United reported losses of 113.2 million pounds in its latest accounts despite record revenues of 661.8 million pounds. Despite the losses, United said it remained in compliance with the financial rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/former-dc-head-coach-ricky-ponting-teases-ipl-2025-return-2598162-2024-09-11",
      "headline": "Former DC head coach Ricky Ponting teases IPL 2025 returnFormer Australia cricketer Ricky Ponting has teased his return to the Indian Premier League. The former DC coach revealed that there might be some opportunities coming up for him in the next few weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-welcome-lfp-mediation-with-mbappe-over-wage-dispute-2598147-2024-09-11",
      "headline": "PSG welcome LFP mediation with Mbappe over wage disputeParis St Germain has accepted a mediation offer from the French football league's governing body (LFP) regarding Kylian Mbappe's wage dispute. The dispute follows Mbappe's departure to Real Madrid after refusing a contract extension with PSG."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anton-roux-steps-down-as-sri-lanka-fielding-coach-2598126-2024-09-11",
      "headline": "Anton Roux steps down as Sri Lanka fielding coachAnton Roux, currently serving as Sri Lanka's national fielding coach, announced his decision to step down from the role. Roux became Sri Lanka's national fielding coach in March 2022.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/narayan-jagadeesan-sets-ultimate-india-goal-after-ipl-snub-last-season-2598125-2024-09-11",
      "headline": "Ultimate aim is to be part of Team India: Narayan JagadeesanNarayan Jagadeesan said that he aims to play for India and find his way back into the IPL. Last season, the Tamil Nadu wicketkeeper went sold in the auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-uniteds-losses-rise-despite-a-year-of-record-revenues-2598115-2024-09-11",
      "headline": "Manchester United's losses rise despite a year of record revenuesManchester United reported losses of 113.2 million pounds in its latest accounts despite record revenues of 661.8 million pounds. Despite the losses, United said it remained in compliance with the financial rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/afi-to-rejig-qualification-system-for-indian-athletics-domestic-schedule-2598101-2024-09-11",
      "headline": "AFI plans to change the domestic schedule for Indian athleticsThe Athletics Federation of India plans to overhaul its domestic competition and qualification system starting in 2025 to ensure athletes peak at the right time for international events. This move comes in response to the decline in performance at the 2024 Paris Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/delhi-hc-issues-notice-on-bajrang-punia-plea-nada-2598049-2024-09-11",
      "headline": "Delhi HC issues notice on Bajrang Punia's plea against NADA The Delhi High Court issued a notice to the National Anti-Doping Agency (NADA) regarding a plea filed by renowned wrestler Bajrang Punia, who was denied any interim relief. The case has been postponed until October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-sachins-highest-test-score-of-248-and-a-133-run-stand-with-zaheer-2598015-2024-09-11",
      "headline": "Memorable IND v BAN moments: Tendulkar's 248, his record partnership with ZaheerIndia vs Bangladesh Recapped: Sachin Tendulkar's unbeaten 248, his highest Test score, not only led India to a dominant victory in a Test match in Dhaka in 2004, but also saw him equal the legendary Sunil Gavaskar's record of 34 Test centuries. He also shared a record-breaking 133-run partnership alongside Zaheer Khan for the 10th wicket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-test-downfall-ind-vs-ban-bcci-central-contract-2597940-2024-09-11",
      "headline": "More than just poor form: What led to Shreyas Iyer's downfall in Tests?Star India batter Shreyas Iyer has been left out of the Indian Test squad for the upcoming series against Bangladesh. Earlier this year, Iyer was at the center of controversy when he was removed from the BCCI's Central Contracts List. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/acc-confirms-inaugural-womens-u19-t20-asia-cup-focus-on-world-cup-preparations-2598035-2024-09-11",
      "headline": "Asian Cricket Council confirms inaugural Women's U19 T20 Asia CupThe Asian Cricket Council, in the ACC Executive Board Meeting in Kuala Lumpur, announced the inaugural edition of the Women's U19 T20 Asia Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kanpur-test-vs-bangladesh-to-proceed-as-planned-despite-protest-threats-2598003-2024-09-11",
      "headline": "Kanpur Test vs Bangladesh to proceed as planned despite protest threats: SourcesIndia vs Bangladesh: The second Test between the two neighbours will take place in Kanpur as scheduled, despite threats of protest from a right-wing outfit. The board is closely monitoring the situation and has taken necessary measures to ensure the match proceeds smoothly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/usa-win-davis-cup-opener-vs-chile-despite-missing-taylor-fritz-frances-tiafoe-2598000-2024-09-11",
      "headline": "USA win Davis Cup opener vs Chile despite missing Fritz, Tiafoe The United States beat Chile 3-0 on Wednesday after Reilly Opelka, Brandon Nakashima and the doubles duo of Rajeev Ram and Austin Krajicek triumphed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/david-beckham-farm-chickens-vegetables-ms-dhoni-instagram-2597992-2024-09-11",
      "headline": "After MS Dhoni, David Beckham gives sneak peak into post-retirement farm lifeFormer England footballer David Beckham posted a video of his farm life on Instagram. In the video, Beckham showed glimpses of the vegetables that he had been growing on his land. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/acc-confirms-inaugural-womens-u19-t20-asia-cup-focus-on-world-cup-preparations-2598035-2024-09-11",
      "headline": "Asian Cricket Council confirms inaugural Women's U19 T20 Asia CupThe Asian Cricket Council, in the ACC Executive Board Meeting in Kuala Lumpur, announced the inaugural edition of the Women's U19 T20 Asia Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kanpur-test-vs-bangladesh-to-proceed-as-planned-despite-protest-threats-2598003-2024-09-11",
      "headline": "Kanpur Test vs Bangladesh to proceed as planned despite protest threats: SourcesIndia vs Bangladesh: The second Test between the two neighbours will take place in Kanpur as scheduled, despite threats of protest from a right-wing outfit. The board is closely monitoring the situation and has taken necessary measures to ensure the match proceeds smoothly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/usa-win-davis-cup-opener-vs-chile-despite-missing-taylor-fritz-frances-tiafoe-2598000-2024-09-11",
      "headline": "USA win Davis Cup opener vs Chile despite missing Fritz, Tiafoe The United States beat Chile 3-0 on Wednesday after Reilly Opelka, Brandon Nakashima and the doubles duo of Rajeev Ram and Austin Krajicek triumphed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/david-beckham-farm-chickens-vegetables-ms-dhoni-instagram-2597992-2024-09-11",
      "headline": "After MS Dhoni, David Beckham gives sneak peak into post-retirement farm lifeFormer England footballer David Beckham posted a video of his farm life on Instagram. In the video, Beckham showed glimpses of the vegetables that he had been growing on his land. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-kl-rahul-middle-order-tussle-sledging-room-podcast-2597969-2024-09-11",
      "headline": "IND vs BAN: KL Rahul, Shreyas Iyer and India's middle-order tussle The anticipation was finally over as the BCCI released the Indian squad for the first Test against Bangladesh on a lazy and uneventful Sunday night on September 8. As expected, the regulars were all picked for the 16-member team, which welcomed Rishabh Pant back to all-whites. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-india-sensation-shreyanka-patil-turns-gangster-in-latest-advertisement-2597961-2024-09-11",
      "headline": "Watch: India's Shreyanka Patil turns gangster in latest advertisement Indian off-spinner Shreyanka Patil played the role of a gangster in a latest advertisement. Shreyanka is a part of the Indian squad for the Women's T20 World Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/archie-vaughan-five-wicket-haul-somerset-vs-surrey-county-championship-2597960-2024-09-11",
      "headline": "Watch: Archie, Michael Vaughan's son, picks maiden 5-wicket haul for SomersetCounty Championship 2024: Archie, 18-year-old son of Michael Vaughan, picked his maiden five-wicket haul in only his second first-class match. He finished with figures of 6 for 108 "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/burj-khalifa-lights-up-with-womens-t20-world-cup-as-icc-announces-ticket-prices-2597958-2024-09-11",
      "headline": "Burj Khalifa lights up with Women's T20 World Cup as ICC announces ticket pricesThe world's tallest building, Burj Khalifa, lit up with the colours of ICC Women's T20 World Cup 2024. The ICC also revealed the prices of match tickets. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}