{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-swiggy-zomato-and-amazon-gig-workers-going-on-strike-on-december-31-2842084-2025-12-26",
      "headline": "Why are Swiggy, Zomato and Amazon gig workers going on strike on December 31?The strike has been announced by the Telangana Gig and Platform Workers Union along with the Indian Federation of App-Based Transport Workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/swiss-pharma-stock-cosmo-surges-40-percent-after-breakthrough-baldness-drug-2842023-2025-12-26",
      "headline": "Wonder drug for male baldness puts Swiss firm Cosmo's shares on steroidsStrong trial data has rewritten Cosmo's prospects, but the real test lies ahead as regulators, partners and patients decide whether this promising science can truly deliver commercial success globally eventually."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-falling-sensex-down-400-points-decoding-dalal-street-decline-2842052-2025-12-26",
      "headline": "Sensex tumbles over 400 points: Why is the stock market down today?At 1:02 pm, the BSE Sensex was down 386.20 points to 85,022.50, while the NSE Nifty50 fell 106.80 points to trade at 26,035.30. Most of the broader market indices were also trading in negative territory as volatility rose during the session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hindustan-copper-share-price-trends-strong-rally-key-reason-explained-2842043-2025-12-26",
      "headline": "Hindustan Copper shares at 15-year high: What's driving the rallyThe stock has been one of the standout performers in the metal space, and Friday's move reflects a mix of strong commodity trends and sustained investor interest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/made-a-mistake-in-your-itr-here-is-how-many-times-you-can-still-revise-it-2842028-2025-12-26",
      "headline": "Made a mistake in your ITR? Here's how many times you can still revise itIf you think filing your income tax return locks everything in, that is not entirely true. The tax department recognises that genuine mistakes can happen and allows taxpayers to revise their returns, provided they act within the allowed time window."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-will-insurance-industry-trends-create-new-opportunities-in-2026-2842021-2025-12-26",
      "headline": "How will insurance industry trends create new opportunities in 2026?Powered by artificial intelligence, rising climate risks, and changing customer expectations, the insurance industry is now silently transforming itself. Some of the trends that we may see in 2026 could look very different from what most people expect today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-price-record-rally-conitnues-buy-now-or-avoid-2842014-2025-12-26",
      "headline": "Gold, silver extend record rally: Should you buy now?With gold anchoring portfolios and silver leading returns, should investors keep adding exposure, or step back and wait as record prices test discipline and long-term allocation strategies?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-indias-real-estate-market-entering-a-more-mature-and-institutional-phase-2842007-2025-12-26",
      "headline": "Is India's real estate market entering a more mature and institutional phase?Forces such as digitisation, institutional capital and changing consumer preferences reshaped the sector. More than just building structures, real estate is now about creating ecosystems that are interoperable with transit, logistics, digital infrastructure and services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-refund-delay-revised-itr-december-31-what-you-should-do-2841983-2025-12-26",
      "headline": "What happens if you do not file a revised ITR after your refund is put on holdWhen a return is flagged under the risk management framework, the refund does not move forward on its own. If a taxpayer does not revise the return or respond to the issue flagged, the refund can remain on hold indefinitely, even if the claim is otherwise genuine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rvnl-share-price-up-11-percent-why-is-it-rising-what-should-investors-do-2841967-2025-12-26",
      "headline": "RVNL share price zooms over 11% today. What investors need to knowAt around 10:32 am, the RVNL share price was trading 11.01% higher at Rs 383.75 on the BSE, making it one of the top-performing public sector stocks during the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/irfc-share-price-today-rising-sharply-key-reasons-pre-budget-rally-2841952-2025-12-26",
      "headline": "IRFC shares jump over 7% today. Here's what's driving the rallyAt around 10:32 am, IRFC shares were trading 7.42% higher on the BSE at Rs 130.50, emerging as one of the top gainers among public sector stocks during the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rvnl-irfc-irctc-railway-stocks-pre-budget-rally-what-next-2841939-2025-12-26",
      "headline": "RVNL, IRFC, IRCTC: Why are these railway stocks rising today?At around 9:55 am, IRCTC was up 1.35% at Rs 688.85 on the BSE, while Rail Vikas Nigam Limited surged 8.94% to Rs 376.60. Indian Railway Finance Corporation also saw strong buying, rising 6.07% to Rs 128.87."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/egg-prices-india-cost-no-relief-in-winter-key-reasons-explained-2841928-2025-12-26",
      "headline": "Eggs on the boil: Why prices are high and when they might coolEgg prices reflect a market resetting after years of strain, where higher costs, cautious supply, and steady demand mean consumers should expect easing, not a return to cheap eggs soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/dalal-street-sensex-nifty-santa-rally-why-is-it-missing-2841924-2025-12-26",
      "headline": "Why Dalal Street's Santa rally failed to take off this yearWhat began as a tentative Santa rally faded quietly, leaving benchmark indices range-bound and investors asking why seasonal cheer failed to translate into sustained gains. Read on to find out what it means for Dalal Street investors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-slip-at-open-as-dalal-street-rally-loses-momentum-2841921-2025-12-26",
      "headline": "Sensex, Nifty slip at open as Dalal Street rally loses momentumAt around 9:18 am, the S&P BSE Sensex was down 95.26 points at 85,313.44, while the NSE Nifty50 slipped 40.80 points to trade at 26,101.30. Broader markets also traded in the red, with volatility ticking up during early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-egg-prices-crossing-rs-8-in-many-indian-cities-this-winter-2841608-2025-12-25",
      "headline": "Why are egg prices crossing Rs 8 in many Indian cities this winter?Eggs, often seen as one of the most affordable sources of protein, are turning expensive in many Indian cities this winter. As prices move past Rs 8 per piece, consumers are keen to understand what is pushing rates higher."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/revised-or-belated-itr-what-taxpayers-should-file-before-december-31-2841581-2025-12-25",
      "headline": "Revised or belated ITR? What taxpayers should file before December 31With the December 31 deadline fast approaching, many taxpayers are unsure whether they need to file a revised or a belated income tax return. Recent alerts from the income tax department have made it even more important to understand the right option."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-how-inflation-could-shape-salary-and-pension-revisions-2841550-2025-12-25",
      "headline": "8th Pay Commission: How inflation could shape salary and pension revisionsAs discussions around the 8th Pay Commission gather pace, the debate around pay hikes has already begun. Inflation may be under control on paper, yet higher rents and household expenses are shaping expectations from the next salary and pension revision."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-epf-claims-get-rejected-and-how-employees-can-avoid-it-2841277-2025-12-24",
      "headline": "Why EPF claims get rejected and how employees can avoid itAn EPF claim rejection can be frustrating, especially when employees need the money urgently. Understanding why claims get rejected and how to avoid common mistakes can save time and stress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-airline-noc-al-hind-air-flyexpress-india-aviation-duopoly-dgca-2841111-2025-12-24",
      "headline": "Centre okays 3 new airlines after IndiGo chaos: Shankh Air, Al Hind Air, FlyExpressShankh Air, Al Hind Air and FlyExpress have received no objection certificates from the civil aviation ministry, as the government looks to reduce heavy dependence on a few airlines following recent disruption at IndiGo."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajat-kapoor-confirms-return-in-drishyam-3-says-his-character-has-no-arc-2842086-2025-12-26",
      "headline": "Rajat Kapoor confirms return in Drishyam 3, says his character has no arc Rajat Kapoor will return as Mahesh Deshmukh in Drishyam 3, playing the grieving father of a deceased son. He shared that his character has \"no arc\" and mainly stays behind Tabu's character."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/dhurandhar-crosses-1000-crore-21-days-box-office-record-hindi-spy-thrillers-2842067-2025-12-26",
      "headline": "Dhurandhar enters Rs 1000-crore club: A look at films that crossed the milestone Aditya Dhar's spy thriller 'Dhurandhar', starring Ranveer Singh, has surpassed all industry forecasts by reaching the Rs 1000 crore mark at the box office within 21 days of its release. The film has become the top-grossing movie of 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rekha-meets-amitabh-bachchan-grandson-agastya-nanda-hugs-him-in-old-viral-video-amid-ikkis-buzz-2842071-2025-12-26",
      "headline": "Rekha meets Big B's grandson Agastya, hugs him in old viral video amid Ikkis buzz An old video from the RK Film Festival featuring Rekha and Agastya Nanda has gained attention once again as Agastya prepares for the release of Ikkis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-tops-indian-tv-ratings-anupamaa-second-spot-2842054-2025-12-26",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi beats Anupamaa to top ratings chart Ektaa Kapoor's Kyunki Saas Bhi Kabhi Bahu Thi has surpassed Anupamaa to become the most-watched television show this week. Last week, Bigg Boss 19 grand finale was the No.1 show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anirudh-jana-nayagan-audio-launch-malaysia-vijay-last-film-tribute-concert-2842024-2025-12-26",
      "headline": "Anirudh flies to Malaysia for audio launch of Vijay's Jana Nayagan: One last dance Music composer Anirudh, while speaking to the media before leaving for Malaysia for Jana Nayagan audio launch, said he was excited to perform in front of a huge crowd on Thalapathy Vijay's 'one last dance'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-mana-celebrate-43rd-wedding-anniversary-with-granddaughter-evaarah-vipula-rahul-in-frame-2842049-2025-12-26",
      "headline": "Suniel Shetty-Mana celebrate 43rd anniversary with granddaughter Evaarah in frame Suniel Shetty celebrated 43 years of marriage with Mana Shetty by sharing a family photo featuring their granddaughter Evaarah Vipula Rahul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/martin-scorsese-calls-rob-reiner-death-an-obscenity-recalls-friendship-2842018-2025-12-26",
      "headline": "Martin Scorsese calls Rob Reiner's death an obscenity, recalls friendship Martin Scorsese reflected on his friendship and professional relationship with Rob Reiner and his wife, Michele, after their deaths. The director offered personal insights and honoured their legacy in a guest essay published on Christmas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukones-fans-slam-dhruv-rathee-for-skin-lightening-claims-in-new-video-2842026-2025-12-26",
      "headline": "Deepika Padukone's fans slam Dhruv Rathee for skin-lightening claims in new video Dhruv Rathee's recent video about Bollywood celebrities and alleged skin-lightening treatments drew sharp reactions from Deepika Padukone's fans online. The post came after he criticised Dhurandhar as a propaganda cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-box-office-collection-rs-1000-crore-global-highest-grossing-films-2025-ranveer-singh-aditya-dhar-2842031-2025-12-26",
      "headline": "Dhurandhar enters Rs 1,000 crore club in record time, tops 2025 Indian box office Aditya Dhar's Dhurandhar has entered the Rs 1,000 crore club worldwide within just 21 days of release, becoming the highest-grossing Indian film of 2025 and surpassing the global lifetime collection of Kantara Chapter 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/how-salman-khan-plans-to-ring-in-60th-birthday-on-december-27-exclusive-info-2842025-2025-12-26",
      "headline": "How Salman Khan plans to ring in 60th birthday on December 27: Exclusive info Source says that Salman Khan's 60th birthday plans reportedly include the customary party on December 27 for near and dear ones at Panvel farmhouse, and a very special video for the superstar"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/irrfan-shot-angrezi-medium-in-severe-pain-says-costume-designer-2842020-2025-12-26",
      "headline": "Irrfan shot Angrezi Medium in severe pain, says costume designer: He was ailing Costume designer Smriti Chauhan has shared how Irrfan continued shooting Angrezi Medium despite intense pain and deteriorating health, requiring constant costume adjustments for comfort."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/avatar-fire-and-ash-box-office-india-week-1-james-cameron-film-tops-f1-becomes-2025-biggest-hollywood-hit-in-india-2842001-2025-12-26",
      "headline": "Avatar Fire and Ash becomes 2025's biggest Hollywood hit in India, tops F1 Avatar: Fire and Ash box office Week 1 report: James Cameron's film has become the biggest Hollywood grosser of 2025 in India, surpassing F1 in just seven days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mark-kichcha-sudeep-calls-fans-response-his-biggest-reward-2841982-2025-12-26",
      "headline": "Mark: Kichcha Sudeep calls fans' response his 'biggest reward' Actor Kichcha Sudeep has thanked fans following the release of the action thriller Mark. The actor described the outpouring of support as an overwhelming experience that left him at a loss for words."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neetu-kapoor-shares-unseen-christmas-family-photo-with-ranbir-kapoor-alia-bhatt-raha-2842000-2025-12-26",
      "headline": "Neetu Kapoor shares unseen Christmas photo with Ranbir, Alia, Raha: Cherish family Neetu Kapoor shared an unseen family photo from the Kapoor clan's Christmas celebration, featuring Ranbir Kapoor, Alia Bhatt and daughter Raha Kapoor, which quickly caught fans' attention online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-jana-nayagan-audio-launch-in-malaysia-no-political-speech-and-security-heightened-2841990-2025-12-26",
      "headline": "Jana Nayagan audio launch: No political speech at Vijay's event, security tightened Thalapathy Vijay's Jana Nayagan audio launch will take place in Malaysia on December 27. Malaysian police have issued clear guidelines for the event, emphasising an absolute ban on political speeches and symbols."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/daayra-investigative-crime-thriller-meghna-gulzar-2026-release-2841981-2025-12-26",
      "headline": "It's a wrap up for Meghna Gulzar's Daayra with Kareena and Prithivraj Filming for director Meghna Gulzar's new investigative crime thriller Daayra, starring Kareena Kapoor Khan and Prithviraj Sukumaran, has concluded. The film, produced by Junglee Pictures and Pen Studios, is now moving to post-production ahead of its planned 2026 theatrical release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-wraps-delhi-schedule-for-peddi-film-set-for-march-2026-release-2841951-2025-12-26",
      "headline": "Ram Charan's Peddi schedule in Capital: Red Fort, Rashtrapati Bhawan, Delhi winters The filming of Ram Charan's sports drama 'Peddi' progresses steadily, with the Delhi schedule completed and new phases underway, keeping the project on track for its planned March 2026 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-vijay-jana-nayagan-audio-launch-malaysia-thalapathy-thiruvizha-tribute-2841971-2025-12-26",
      "headline": "Actor Vijay off to Malaysia for Jana Nayagan event: Nelson, Prabhudheva to attend Actor Vijay has left for Malaysia to attend the Jana Nayagan audio launch and tribute concert. The grand event marks his farewell film before entering politics and features many prominent artists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rgv-compares-aditya-dhar-to-francis-ford-coppola-in-10th-post-praising-dhurandhar-2841974-2025-12-26",
      "headline": "RGV compares Aditya Dhar to Francis Ford Coppola in 10th post praising Dhurandhar Ram Gopal Varma praised Aditya Dhar's Dhurandhar in his 10th post on X, comparing the film to the works of the legendary American filmmaker, Francis Ford Coppola. He called it a benchmark for Indian cinema."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-anti-drone-systems-india-border-loc-operation-sindoor-fear-2842040-2025-12-26",
      "headline": "Fear of Op Sindoor 2.0? Panicked Pakistan rushes anti-drone systems to LoCIntelligence inputs indicate fresh installations of counter-unmanned aerial systems (C-UAS) opposite the Rawalakot, Kotli and Bhimber sectors amid growing anxiety within the Pakistan army of a Sindoor redux."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/vv-rajesh-bjp-secures-historic-first-mayoral-win-in-kerala-thiruvananthapuram-ending-four-decades-of-left-rule-2842092-2025-12-26",
      "headline": "BJP breaks four-decade barrier, wins Thiruvananthapuram Mayor's postThe BJP has made a historic breakthrough in Kerala by securing its first-ever mayoral post in Thiruvananthapuram, ending nearly 40 years of Left dominance. This victory signals a significant shift in the state's local political landscape."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/udaipur-gangrape-ceo-rape-manager-it-firm-jeetesh-sisodia-shilpa-sirohi-2842029-2025-12-26",
      "headline": "Udaipur rape-accused CEO's IT firm rated itself 4.7/5 on women friendlinessA female manager of an IT firm in Rajasthan Udaipur has accused her CEO Jeetesh Sisodia, executive head Shilpa Sirohi and her husband Gaurav of gangraping her after a birthday party earlier this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tarique-rahman-plan-bangladesh-election-bnp-hindus-india-violence-2842011-2025-12-26",
      "headline": "Bangladesh: What Tarique Rahman's plan signals for India and HindusBangladesh: Tarique Rahman, delivering his first speech in Bangladesh in 17 years, invoked Martin Luther and said, 'I have a plan'. Through his speech and previous statements, Tarique has given glimpses of what his plan holds for Bangladesh, Hindus and India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sheikh-hasina-refuge-india-new-delhi-dharma-muli-partridge-hammir-dev-chauhan-dalai-lama-pm-modi-nehru-history-2841869-2025-12-26",
      "headline": "Will India hand over Sheikh Hasina? History shows even a partridge wasn't betrayedProtecting someone who has sought refuge, even by sacrificing their own life, has been a civilisational ethos of Indians. Those demanding that India hand over Sheikh Hasina should be told how 200 people gave their lives to shield an injured partridge in Gujarat's Muli. From Jam Sataji and Hamir Dev Chauhan to India sheltering the Dalai Lama, this is a dharma that Indians have taken pride in and stayed true to."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-box-office-collection-rs-1000-crore-global-highest-grossing-films-2025-ranveer-singh-aditya-dhar-2842031-2025-12-26",
      "headline": "Dhurandhar enters Rs 1,000 crore club in record time, tops 2025 Indian box officeAditya Dhar's Dhurandhar has entered the Rs 1,000 crore club worldwide within just 21 days of release, becoming the highest-grossing Indian film of 2025 and surpassing the global lifetime collection of Kantara Chapter 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/centre-opposes-plea-seeking-gst-cut-on-air-purifiers-questions-petitioners-motive-2842019-2025-12-26",
      "headline": "Centre opposes plea for GST cut on air purifiers, questions petitioner's motiveThe High Court, while hearing the petition, filed by advocate Kapil Madan, on December 24, had asked the GST Council to hold a meeting urgently on the issue of GST cut on air purifiers amid worsening air pollution in the national capital had asked the GST council to consider holding an urgent meeting and take a decision on the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/saudi-arabia-makkah-masjid-al-haram-suicide-attempt-foiled-2842008-2025-12-26",
      "headline": "Suicide bid at Mecca Grand Mosque, hero security guard breaks man's fallA suicide attempt at Masjid al-Haram in Makkah was foiled after Saudi security personnel swiftly intervened, preventing a fatal fall; the officer suffered fractures during the rescue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/swiss-pharma-stock-cosmo-surges-40-percent-after-breakthrough-baldness-drug-2842023-2025-12-26",
      "headline": "Wonder drug for male baldness puts Swiss firm Cosmo's shares on steroidsStrong trial data has rewritten Cosmo's prospects, but the real test lies ahead as regulators, partners and patients decide whether this promising science can truly deliver commercial success globally eventually."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-man-sets-wife-on-fire-pushes-daughter-into-flames-nallakunta-2842083-2025-12-26",
      "headline": "Suspecting affair, Telangana man sets wife on fire, pushes daughter into flames tooA man in Telangana allegedly murdered his wife by setting her on fire after suspecting her character, an act witnessed by their children. He also pushed his daughter into the flames when she tried to intervene."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-protest-live-updates-tarique-rehman-dhaka-violence-mob-lynching-2841888-2025-12-26",
      "headline": "Live: Hindu groups sit on dharna outside Bangladesh Deputy High CommissionBangladesh Violence Live Updates: A Hindu man has been beaten to death in Bangladesh, the second such killing in days, heightening concerns over the safety of religious minorities in the country. Local media reported that 29-year-old Amrit Mondal, also known as Samrat, was attacked and killed in Rajbari's Pangsha sub-district late on Wednesday night, around three-and-a-half hours from Dhaka. The killing follows the lynching of Dipu Chandra Das, whose body was set on fire earlier this week. The latest incident coincides with the return of senior opposition leader Tarique Rahman to Bangladesh after 17 years in self-imposed exile, as he pledged to ensure safety and justice if his party wins next year's elections. Stay with IndiaToday.com for live updates-"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/former-bihar-chief-minister-rabri-devi-vacates-iconic-bungalow-10-circular-road-quietly-belongings-moved-in-the-dead-of-night-2841960-2025-12-26",
      "headline": "Rabri Devi begins vacating 10 Circular Road, belongings moved in the dead of nightRabri Devi has started vacating the iconic 10 Circular Road bungalow, ending the Lalu family's nearly two-decade-long hold on the residence. This marks a significant political shift in Bihar as the family moves out from their traditional power base."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/atal-bihari-vajpayee-birth-anniversary-iconic-speeches-1999-nda-without-trinamool-congress-mamata-banerjee-sir-2841860-2025-12-26",
      "headline": "When some in NDA sought Vajpayee's exit, Mamata stood like a rockSome within the NDA flirted with the idea of moving beyond Atal Bihari Vajpayee and running a government without him after he lost the no-confidence motion in 1999. However, TMC chief Mamata Banerjee and the MDMK's Vaiko made it clear there would be no NDA without Vajpayee at the helm, recalls the ex-PM's media advisor Ashok Tandon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-woman-says-bengaluru-should-be-indias-national-capital-internet-reacts-2841806-2025-12-25",
      "headline": "Delhi woman says Bengaluru should be India's national capital. Internet reactsA woman from Delhi has sparked a conversation online after sharing her experiences comparing Bengaluru and Delhi, highlighting issues of air quality, safety, and infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/ai-going-to-kill-all-remote-jobs-work-from-home-will-no-longer-exist-google-deepmind-co-founder-2842035-2025-12-26",
      "headline": "AI going to kill all remote jobs: Google DeepMind co-founderGoogle DeepMind co-founder Shane Legg warns that as AI moves closer to human-level intelligence, remote and work-from-home roles based purely on cognitive tasks could be among the first to face disruption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/blinkit-saves-the-day-during-womans-visa-emergency-at-us-embassy-in-delhi-2842044-2025-12-26",
      "headline": "Blinkit saves the day during woman's visa emergency at US Embassy in DelhiGauri Gupta used Blinkit to print and deliver key documents for a US visa interview in just 15 minutes. The incident has sparked discussion about the efficiency and convenience of India's rapid delivery services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukones-fans-slam-dhruv-rathee-for-skin-lightening-claims-in-new-video-2842026-2025-12-26",
      "headline": "Deepika Padukone's fans slam Dhruv Rathee for skin-lightening claims in new videoDhruv Rathee's recent video about Bollywood celebrities and alleged skin-lightening treatments drew sharp reactions from Deepika Padukone's fans online. The post came after he criticised Dhurandhar as a propaganda cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-scores-77-vs-gujarat-vijay-hazare-trophy-2025-26-rohit-sharma-duck-2841958-2025-12-26",
      "headline": "Virat Kohli hits rapid 77 in Bengaluru after Rohit Sharma's golden duck in JaipurVirat Kohli scored 77 runs against Gujarat in the Vijay Hazare Trophy 2025-26. Despite a strong start, he missed out on his second successive century in the tournament."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/indian-student-shot-dead-near-toronto-campus-consulate-expresses-anguish-glbs-2841886-2025-12-26",
      "headline": "Indian student, 20, shot dead near Toronto campus; hunt on for culpritShivank Avasthi, an Indian doctoral student, was shot dead near the University of Toronto Scarborough campus. Toronto police said he was gunned down in the Highland Creek Trail–Old Kingston Road area."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/udaipur-it-firm-ceo-executive-rape-manager-after-party-case-rajasthan-2841894-2025-12-26",
      "headline": "Udaipur IT firm CEO, female executive, husband offer lift to colleague, rape herUdaipur Police arrested a private firm's CEO, a senior executive and her husband after a female staff alleged gang rape in a moving car, with medical reports and dashcam footage backing complaint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/boxing-day-tsunami-when-earth-released-energy-equal-to-23000-atomic-bombs-in-2004-2842076-2025-12-26",
      "headline": "Tsunami with energy equal to 23,000 atomic bombs: What happened in 2004?The disaster gave rise to global tsunami warning networks, saving countless lives since, as seen in Japan's 2011 Tohoku event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-brendon-mccullum-new-zealand-spies-ashes-2023-england-defeat-2842027-2025-12-26",
      "headline": "Dhurandhar in Ashes? Fans joke Ben Stokes, Brendon McCullum are New Zealand spiesAshes 2025-26: Ben Stokes and Brendon McCullum are being humorously labelled as New Zealand spies amid England's poor Ashes performance. The viral memes highlight fan frustration and raise questions about England's preparation and conduct during the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-launches-powerful-and-deadly-strikes-on-isis-targeting-christians-in-nigeria-glbs-2841883-2025-12-26",
      "headline": "US bombs Nigeria over attacks on Christians, Trump wishes dead terrorists Merry XmasNigeria has faced years of extremist violence from Islamic State (IS) terrorists and Boko Haram, with attacks often hitting civilians and religious communities across the country's north."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/bihar/story/bihar-man-who-married-thrice-in-3-years-without-divorcing-wives-arrested-2842009-2025-12-26",
      "headline": "Bihar man, who married thrice in 3 years without divorcing wives, arrestedThe case came to light after the two women approached police, alleging that Barnwal, the accused, repeatedly married women for financial gain and abandoned them after subjecting them to torture."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-australia-vs-england-boxing-day-test-20-wickets-ben-stokes-2842064-2025-12-26",
      "headline": "20 wickets tumble on Boxing Day as England's Ashes horror continues  Ashes 2025–26: England's batters failed to build on the good work done by their bowlers as 20 wickets fell in a single day for the first time in 124 years in the Ashes. The visitors ended the opening day on the back foot at the Melbourne Cricket Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/city-football-group-exits-mumbai-city-fc-indian-super-league-uncertainty-2842050-2025-12-26",
      "headline": "Manchester City owners explain decision to cut ties with Mumbai FC amid ISL fiasco City Football Group, which owns several top clubs worldwide, including English Premier League giants Manchester City, has explained its decision to pull out of its association with Mumbai City FC amid uncertainty over the future of the Indian Super League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-scores-70-virat-kohli-delhi-vs-gujurat-vijay-hazare-trophy-2025-26-2842047-2025-12-26",
      "headline": "Vijay Hazare Trophy: Pant's sublime 70 guides Delhi to 254 against Gujarat Rishabh Pant played a brilliant innings, scoring 70 as Delhi posted 254 against Gujarat in the Vijay Hazare Trophy. Vishal Jayswal's four-wicket haul troubled Delhi batters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-brendon-mccullum-new-zealand-spies-ashes-2023-england-defeat-2842027-2025-12-26",
      "headline": "Dhurandhar in Ashes? Fans joke Ben Stokes, Brendon McCullum are New Zealand spies Ashes 2025-26: Ben Stokes and Brendon McCullum are being humorously labelled as New Zealand spies amid England's poor Ashes performance. The viral memes highlight fan frustration and raise questions about England's preparation and conduct during the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-targets-t20-world-cup-return-india-sri-lanka-2842022-2025-12-26",
      "headline": "Australia's Pat Cummins targets T20 World Cup return after Ashes cameo Australia captain Pat Cummins says he is \"cooling his heels a little bit\" as he targets a return at next year's ICC T20 World Cup, following his comeback in the third Ashes Test in Adelaide after a back injury ruled him out of the opening two matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-pradhan-mantri-rashtriya-bal-puraskar-president-droupadi-murmu-2842012-2025-12-26",
      "headline": "Vaibhav Suryavanshi conferred National Children's Award by President Murmu Vaibhav Suryavanshi was honoured with the Pradhan Mantri Rashtriya Bal Puraskar award today by the President of India, Droupadi Murmu, in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/boxing-day-test-ashes-josh-tongue-five-wickets-mcg-record-crowd-2841970-2025-12-26",
      "headline": "Josh Tongue ends England's 27-year wait before record MCG crowd on Boxing Day Ashes, Boxing Day Test: Josh Tongue starred with a five-wicket haul as England bowled out Australia for 152 on Day 1 at the MCG. His performance ended a 27-year wait for an England five-for at the venue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-scores-77-vs-gujarat-vijay-hazare-trophy-2025-26-rohit-sharma-duck-2841958-2025-12-26",
      "headline": "Virat Kohli hits rapid 77 in Bengaluru after Rohit Sharma's golden duck in Jaipur Virat Kohli scored 77 runs against Gujarat in the Vijay Hazare Trophy 2025-26. Despite a strong start, he missed out on his second successive century in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-jaipur-fans-vijay-hazare-trophy-golden-duck-mumbai-vs-uttarakhand-2841940-2025-12-26",
      "headline": "No show: Rohit Sharma out for 0 in Jaipur, disappointed fans leave stadium Rohit Sharma was dismissed for a golden duck in the Vijay Hazare Trophy match against Uttarakhand. The early wicket left fans disappointed after they braved the winter morning cold to fill the Sawai Mansingh Stadium in Jaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/special-report-ashish-limayes-historic-asian-gold-and-jitu-virwanis-vision-for-indian-equestrian-ytvd-2841918-2025-12-26",
      "headline": "Special Report: Ashish Limaye's Historic Asian Gold and Jitu Virwani's Vision for Indian Equestrian In this special report, India Today explores the resilience of Indian equestrian sports amidst administrative crises. Ashish Limaye, the first Indian to win an individual gold at the Asian Equestrian Championships, describes his victory as 'a dream come true' and 'unbelievable'. The report highlights the pivotal role of Jitu Virwani, Chairman of Embassy Group, whose Embassy International Riding School (EIRS) in Bengaluru has become a cradle for champions like Limaye and Fouaad Mirza. Despite the Equestrian Federation of India (EFI) facing infighting and a split Junior National Equestrian Championship, private initiatives like EIRS are ensuring the sport's future. Virwani shares his vision of making the sport 'affordable and accessible' to create a legacy of champions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-hazare-trophy-2025-live-score-matches-today-virat-kohli-rohit-sharma-2841913-2025-12-26",
      "headline": "Vijay Hazare Trophy live score: Rinku slams century for UP, Kohli out for 77 Vijay Hazare Trophy live: Rinku Singh has slammed a splendid century for UP guiding them to a massive score of 367. Meanwhile, Virat Kohli continued his rich form, scoring 77 for Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-dominate-sri-lanka-t20-series-harmanpreet-eyes-preview-trivandrum-2841762-2025-12-26",
      "headline": "Trivandrum triumph a foregone conclusion? India eye series win vs toothless Sri LankaIND-W vs SL-W, 3rd T20I: Harmanpreet Kaur's side have dominated the five-match T20I series so far, winning both matches in Vizag and now looking to carry that momentum into Trivandrum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-vs-sl-w-harmanpreet-kaur-to-join-meg-lanning-most-successful-t20i-captain-2841898-2025-12-26",
      "headline": "Harmanpreet on the cusp of history, set to surpass Meg Lanning's major recordHarmanpreet Kaur is one win away from becoming the most successful T20I captain in history. She will surpass Meg Lanning to occupy the top of the list with another victory against Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-form-t20-world-cup-2026-gautam-gambhir-india-middle-order-2841889-2025-12-26",
      "headline": "2026 beckons: Can Rinku Singh finally boss India's T20I middle order?Rinku Singh hasn't enjoyed the best run in T20 cricket over the past couple of years, but a solid campaign at next year's T20 World Cup could prove to be a game-changer for him in the shortest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-tamore-rohit-sharma-lookalike-viral-vijay-hazare-trophy-mumbai-2841864-2025-12-26",
      "headline": "Rohit Sharma's lookalike? Meet Hardik Tamore, Mumbai player who has gone viralRohit Sharma returned to the Vijay Hazare Trophy with a scintillating hundred against Sikkim. A moment from the game involving Rohit and Mumbai keeper Hardik Tamore went viral on the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ashish-limaye-asian-gold-indian-equestrian-embassy-riding-school-2841855-2025-12-25",
      "headline": "How Embassy Riding Club and Ashish Limaye are reshaping equestrian in IndiaAshish Limaye's Asian gold medal marks a turning point for Indian equestrian sport. Private initiatives like Embassy Riding School are vital amid federation challenges to nurture future talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kartik-sharma-csk-ipl-auction-plan-to-spend-money-2841843-2025-12-25",
      "headline": "Kartik Sharma on Rs 14.2 crore IPL deal: First, I'll repay my father's loansYoung Kartik Sharma fetched a massive sum of Rs 14.20 crore from Chennai Super Kings in the IPL auction. Sharma revealed how he wanted to spend his money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-india-vs-sri-lanka-third-t20i-deepti-sharma-amol-mumzumdar-2841834-2025-12-25",
      "headline": "Deepti Sharma recovers, but is Jemimah Rodrigues fit? India coach shares an updateIND vs SL: India Women are monitoring Jemimah Rodrigues' minor fitness issue ahead of the third T20I against Sri Lanka, while Deepti Sharma's return gives the team management a selection headache."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/noakhali-express-coaches-protest-poor-facilities-bpl-2026-sylhet-2841814-2025-12-25",
      "headline": "BPL 2026: Noakhali Express boycott training, coaches charge out of ground in angerNoakhali Express found themselves at the centre of a controversy in the 2026 Bangladesh Premier League (BPL) when coaches Khaled Mahmud Sujon and Talha Jubair stormed out of the ground in frustration over inadequate training facilities in Sylhet."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-hazare-trophy-where-to-watch-rohit-sharma-virat-kohli-livestream-2841807-2025-12-25",
      "headline": "Virat Kohli, Rohit Sharma return to action. Will BCCI livestream matches?Vijay Hazare Trophy returns with its Round 2 fixtures on Boxing Day. Centurions Virat Kohli and Rohit Sharma are expected to play on Friday, but will the BCCI livestream the games?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-ticket-sales-start-navi-mumbai-vadodara-2841800-2025-12-25",
      "headline": "WPL 2026: When and how to buy tickets for upcoming seasonThe tickets for the Women's Premier League (WPL) 2026 will go live on December 26. The tournament is scheduled to take place from January 9 to February 5 in Navi Mumbai and Vadodara. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-practice-punjab-india-t20-world-cup-snub-2841778-2025-12-25",
      "headline": "After T20 World Cup snub, Shubman Gill returns to intense batting practice sessionShubman Gill has responded to his T20 World Cup snub by returning to intense domestic preparations, even as questions grow over his T20 future following further omissions and recent struggles in the format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa20-2025-36-full-teams-format-live-streaming-details-2841747-2025-12-25",
      "headline": "SA20 returns for fourth edition: Full teams, format and live-streaming detailsThe fourth edition of the SA20 will get underway on Boxing Day, 26 December 2025, as South Africa prepares for another high-octane season of franchise cricket. Here is all you need to know"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/equestrian-federation-elections-no-voting-for-clubs-delhi-high-court-2841748-2025-12-25",
      "headline": "No voting rights for clubs in Equestrian Federation elections: Delhi High CourtThe Delhi High Court has ruled that clubs affiliated with the Equestrian Federation of India cannot vote in federation elections. This decision reinforces the governance role of state and Union Territory associations, impacting EFI's electoral structure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-ashes-struggles-drinking-scandal-team-changes-melbourne-test-2841656-2025-12-25",
      "headline": "Boozy break behind them, England hope Santa ends Ashes hangover in Boxing Day TestAUS vs ENG: England have already conceded the Ashes, but there is still plenty to play for, especially with the team languishing in the bottom half of the table in the 2025–27 World Test Championship cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-remains-calm-amid-fan-abuse-india-video-2841701-2025-12-25",
      "headline": "Watch: Hardik Pandya ignores abusive fan after refusing selfie requestIndian all-rounder Hardik Pandya remained calm and composed after a fan hurled abuse at him outside a restaurant, earning praise for handling the situation with restraint.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-fully-ready-2027-world-cup-childhood-coach-backs-india-legend-2841689-2025-12-25",
      "headline": "Virat Kohli fully ready for World Cup: Childhood coach backs India legendVirat Kohli is fully ready for the 2027 ODI World Cup, believes his childhood coach Rajkumar Sharma, after the India great marked his return to the Vijay Hazare Trophy with a commanding, record-breaking century for Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-role-jharkhand-syed-mushtaq-ali-trophy-triumph-revealed-2841645-2025-12-25",
      "headline": "MS Dhoni's role in Jharkhand's historic Syed Mushtaq Ali Trophy triumph revealedJSCA joint secretary Shahbaz Nadeem said that MS Dhoni's inputs were taken at every stage of the appointment process before Jharkhand went on to win their first Syed Mushtaq Ali Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-century-vijay-hazare-trophy-rohit-sharma-domestic-cricket-return-2841637-2025-12-25",
      "headline": "Virat Kohli in Vijay Hazare Trophy: Andhra bowler meets his God of CricketVijay Hazare Trophy: For B Vinay Kumar, a young cricketer from Andhra, meeting Virat Kohli and watching him bat felt surreal. Moments like these show why the presence of star players in domestic cricket is important."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tanmay-chaudhary-six-sixes-dc-school-cup-modern-school-victory-2841632-2025-12-25",
      "headline": "16-year-old Tanmay Chaudhary steals the show in DC School CupSixteen-year-old Tanmay Chaudhary announced himself as one of Delhi's most exciting young batting prospects after producing a series of standout performances in the DC School Cup, highlighted by the rare feat of hitting six sixes in an over. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}