{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-ends-200-points-lower-nifty-below-23000-hdfc-falls-over-2-2682897-2025-02-20",
      "headline": "Sensex ends 200 points lower, Nifty below 23,000; HDFC falls over 2%Stock market closing today: The S&P BSE Sensex ended 203.22 points lower at 75,735.96, while the NSE Nifty50 fell 19.75 points to settle at 22,913.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-impact-on-indian-rupee-jefferies-explained-2682872-2025-02-20",
      "headline": "Will Donald Trump's reciprocal tariffs hurt Indian rupee? It may be noted that India was the 10th biggest exporter to the US in 2024, and higher tariffs might make it tougher for Indian businesses to sell their goods there."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/supreme-court-gratuity-act-can-employers-deny-gratuity-in-any-situation-check-ruling-2682833-2025-02-20",
      "headline": "Can employers deny gratuity in any situation? Here's all you need to knowWith the latest ruling, the Supreme Court has stated that if an employer dismisses an employee on grounds of moral turpitude, his gratuity can be forfeited without waiting for a court's verdict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fiis-continue-to-dump-indian-stocks-which-stocks-are-feeling-the-heat-2682829-2025-02-20",
      "headline": "FIIs continue to dump Indian stocks: Which stocks are feeling the heat? Data from National Securities Depository Limited (NSDL) showed that FPIs have dumped $3.5 billion worth of financial stocks in 2025 so far, accounting for 31% of their total sales of $11.45 billion as of February 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-may-offer-relief-for-new-india-co-op-bank-depositors-scam-scrutiny-2682825-2025-02-20",
      "headline": "RBI may allow some depositors of New India Co-op Bank to withdraw funds: Report Last week, the RBI took strict action against New India Co-operative bank by suspending deposit withdrawals for six months, stopping the issuance of new loans, and appointing an administrator. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uday-kotak-explains-how-fiis-foreign-outflow-are-gaining-at-the-expense-of-domestic-retail-investors-stock-market-2682813-2025-02-20",
      "headline": "Uday Kotak explains how FIIs are gaining at the expense of domestic investorsUday Kotak said that FIIs are benefiting from the investments made by domestic retail investors, who are continuously putting money into the stock market. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-pay-new-bill-payment-google-pay-begins-charging-for-bill-payments-what-users-need-to-know-2682787-2025-02-20",
      "headline": "Google Pay begins charging for bill payments. Here's what users need to knowThis is not the first time Google Pay has announced the imposition of fees. Last year, it levied Rs 3 convenience fee for mobile recharges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-threat-indian-exporters-minimal-impact-explained-2682790-2025-02-20",
      "headline": "Indian exporters aren't losing sleep over Donald Trump's tariff threat. Here's whyIndustry executives say US tariff hikes on autos and pharmaceuticals won't hurt Indian exporters much, as competitors from other countries will face the same impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-cuts-budget-2025-rbi-bulletin-consumption-middle-class-2682747-2025-02-20",
      "headline": "Will tax cuts for middle class in budget help boost consumption? RBI says this The RBI bulletin pointed out that the government has given a Rs 1 lakh crore tax break to the middle class, which should leave more money in their pockets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dalal-street-top-market-investors-lose-over-rs-80000-crore-radhakishan-damani-dmart-jhunjhunwala-2682742-2025-02-20",
      "headline": "Dalal Street carnage: Top market investors lose over Rs 80,000 croreThe recent stock market downturn has wiped out over Rs 80,000 crore from the portfolios of some of India's most renowned investors, such as Radhakishan Damani and the Jhunjhunwala family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-to-roll-out-upi-based-claim-withdrawals-within-3-months-check-details-2682731-2025-02-20",
      "headline": "EPFO to roll out UPI-based EPF claim withdrawals within 3 months. Check detailsOnce integrated, claim amounts can be easily accessed by the subscribers via digital wallets, mention sources. This would minimise the processing time and lead to an enhanced user-friendly experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-economy-rbi-bulletin-key-points-global-challenges-high-frequency-indicators-2682718-2025-02-20",
      "headline": "Is India's economy set for a strong recovery? Here's what RBI saysThe government's push on capital spending, MSMEs, agriculture, and exports is expected to help the economy in the long run while keeping the fiscal deficit in check. A recent repo rate cut might also support domestic demand."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/will-prime-video-jack-reacher-ever-visit-india-author-lee-child-speaks-2682815-2025-02-20",
      "headline": "Will Prime Video's Jack Reacher ever visit India? Author Lee Child speaksAuthor Lee Child, whose Reacher books have inspired a series on Prime Video, spoke to India Today Digital, about the possibility of seeing his leading character travelling to India in the future. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/shenaz-treasury-reveals-losing-a-brand-deal-after-ranveer-allahbadia-controversy-samay-raina-indias-got-latent-2682822-2025-02-20",
      "headline": "Vlogger Shenaz Treasury reveals losing a brand deal after Ranveer Allahbadia row Former actor and influencer Shenaz Treasury recently shared how she lost a brand deal after Ranveer Allahbadia's controversy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nadaaniyan-ibrahim-ali-khan-explains-love-to-miss-briganza-release-date-out-2682803-2025-02-20",
      "headline": "Nadaaniyan: Ibrahim Ali Khan explains love to Miss Briganza; release date outNetflix on Thursday announced the release date of Ibrahim Ali Khan and Khushi Kapoor's 'Nadaaniyan'. The film is a Gen-Z love story and is set in Delhi-Noida. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/palak-muchhal-on-timeless-appeal-of-sanam-teri-kasam-title-song-2682763-2025-02-20",
      "headline": "Palak Muchhal on timeless appeal of Sanam Teri Kasam title song: It's magicalSanam Teri Kasam's title track is topping the music charts. Singer Palak Muchhal calls it surreal, recalls recording it, and hints at a new version. She also discusses Amitabh Bachchan's praise and the evolving music industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/comedian-daniel-fernandes-samay-raina-ranveer-allahbadia-indias-got-latent-2682707-2025-02-20",
      "headline": "They'll just ask Samay Raina to write a 300-word essay: Comic mocks outrageComedian Daniel Fernandes mocked the outrage over Samay Raina's controversy, joking that he'd only need to write a \"300-word essay.\" He also criticised calls to ban India's Got Latent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/aap-rocky-rihanna-promised-to-name-their-next-baby-after-lawyer-joe-tacopina-2682691-2025-02-20",
      "headline": "Rihanna, A$AP Rocky to name next baby after lawyer who helped win caseIn a statement, A$AP Rocky's lawyer revealed that the rapper and his long-time partner Rihanna jokingly promised to name their next child after him. A$AP Rocky was found not guilty in a felony assault trial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aashram-3-part-2-trailer-bobby-deol-is-back-as-the-menacing-baba-nirala-2682511-2025-02-19",
      "headline": "Aashram 3 part 2 trailer: Bobby Deol is back as the menacing Baba NiralaAshram Season 3, Part 2 trailer: The much-awaited Aashram returns with Part 2 of Season 3, directed by Prakash Jha. The new season delves into themes of power, betrayal, and revenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/melo-movie-review-slow-burn-netflix-drama-choi-wooshik-park-boyoung-kim-jaewook-2682347-2025-02-19",
      "headline": "Melo Movie review: A slow-burn, mature drama that will stay with youReleased-Fri Feb 14, 2025Melo Movie released in Netflix on February 14. Starring Choi Woo-shik and Park Bo-young, the 10-episode-show deals with love, loss, and grief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/new-matthew-perry-documentary-promises-to-dig-deep-into-the-hollywood-tragedy-2682494-2025-02-19",
      "headline": "New Matthew Perry documentary promises to dig deep into the Hollywood tragedyA new Matthew Perry documentary called Matthew Perry: A Hollywood Tragedy will be out later this month, wherein the makers will investigate the untimely death of the Friends star. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-first-frost-review-love-trauma-longing-new-chinese-drama-delivers-it-all-2682428-2025-02-19",
      "headline": "The First Frost review: Love, trauma, longing - new Chinese drama delivers it all Released-Thu Feb 20, 2025The First Frost review: This Chinese drama delves into the complexities of love, trauma, and longing, offering a poignant narrative that diverges from typical romance tropes. With its melancholic visuals and dual perspectives, it explores the tangled history between its protagonists, making it a compelling watch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javed-mother-on-her-bold-fashion-was-shocked-at-first-but-i-support-her-2682289-2025-02-19",
      "headline": "Uorfi Javed's mother on her bold fashion: Was shocked at first, but I support herUorfi Javed revealed her mother was the first in their family to try Botox. Her mother also recalled her reaction when she saw Uorfi's \"new style\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suzhal-the-vortex-season-2-trailer-kathir-takes-on-gripping-murder-mystery-with-aishwarya-rajesh-2682271-2025-02-19",
      "headline": "Suzhal 2 trailer: Kathir takes on gripping murder mystery with Aishwarya RajeshThe official trailer of the highly-anticipated second season of the Tamil crime thriller Suzhal - The Vortex was released on Wednesday. Starring Kathir and Aishwarya Rajesh in lead roles, the series will premiere on Prime Video on February 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rihanna-thankful-humbled-after-aap-rocky-found-not-guilty-in-shooting-case-2682140-2025-02-19",
      "headline": "Rihanna 'thankful, humbled' after A$AP Rocky found not guilty in shooting caseA$AP Rocky was declared not guilty in a felony assault trial, leading to an emotional embrace with Rihanna in court. After the verdict, the singer issued her first statement, expressing relief. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papons-valentines-day-special-show-retro-hits-to-soulful-music-moh-moh-ke-dhaage-to-bulleya-2681678-2025-02-18",
      "headline": "Retro hits to soulful music: Magical evening at Papon's Valentine's Day special showPapon's concert in Delhi, hosted by TV9, was an unforgettable night filled with soulful music. Held at Major Dhyan Chand National Stadium, the event was part of the World Travel and Tourism Festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-picks-fathers-video-call-during-live-concert-2681893-2025-02-18",
      "headline": "Watch: Arijit Singh attends father's video call during live concertArijit Singh's live concert in Chandigarh was made memorable by a surprise video call from his father during his performance. The singer shared heartfelt moments from the event on Instagram, expressing gratitude to his fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/baarishein-singer-anuv-jain-married-shares-photos-with-wife-2681838-2025-02-18",
      "headline": "Pics: Singer Anuv Jain married, shares photos with wifeSinger Anuv Jain, popular for songs like Baarishein, is now married. He shared photos from the wedding and pre-wedding festivities on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-akhil-sachdeva-on-diljit-dosanjh-infrastructure-remark-2681792-2025-02-18",
      "headline": "Singer Akhil Sachdeva on Diljit Dosanjh's infrastructure remark: I feel it's amazingSinger Akhil Sachdeva discusses the rise of concerts in India, film vs indie music, ticket prices, and Diljit Dosanjh's comments on concert infrastructure. He also stresses the importance of crediting technicians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/k-drama-2025-when-life-gives-you-tangerine-to-wife-of-a-21st-century-prince-full-list-from-kakao-entertainment-2681749-2025-02-18",
      "headline": "K-slate 2025: When Life Gives You Tangerine to Wife of a 21st Century PrinceKakao Entertainment is set to make 2025 a landmark year for K-dramas and films, with a rich array of releases across various genres. From gripping thrillers to heartwarming romances, the lineup promises stellar performances and captivating stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dabba-cartel-trailer-netflix-shabana-azmi-jyotika-gajraj-rao-2681735-2025-02-18",
      "headline": "Dabba Cartel trailer: Shabana Azmi, Jyotika promise an addictive showThe trailer for Netflix's Dabba Cartel unveils a gripping crime drama about five women whose dabba business unexpectedly plunges them into the dangerous world of a drug cartel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-sae-rons-father-blames-youtuber-for-death-co-star-won-bin-breaks-down-at-funeral-2681684-2025-02-18",
      "headline": "Kim Sae-ron's father blames YouTuber for death, co-star Won Bin breaks downSouth Korean actor Kim Sae-ron's father spoke out at her funeral, held a day after her death, highlighting the emotional distress she suffered due to a YouTuber's videos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-singh-grover-back-on-tv-5-years-after-kasautii-zindagii-kay-report-2681666-2025-02-18",
      "headline": "Karan Singh Grover back on TV 5 years after Kasautii Zindagii Kay: ReportActor Karan Singh Grover might just be a part of a romantic show very soon. He is reported to be seen alongside Helly Shah in this new TV show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/linkin-park-singer-chester-benningtons-child-comes-out-as-transgender-2681663-2025-02-18",
      "headline": "Late Linkin Park singer Chester Bennington's child comes out as transgenderLinkin Park singer Chester Bennington's child, Draven, has come out as transgender. The artiste shared the news on her social media handle, while stating her preferred pronouns in a small note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-global-artists-ed-sheeran-dua-lipa-coldplay-india-purely-business-exclusive-2680888-2025-02-18",
      "headline": "Amit Trivedi: Global artists performing in India is nothing but pure businessIndia has become a hotspot for global artists to perform, drawing big names like Coldplay, Ed Sheeran, and Dua Lipa. Music composer Amit Trivedi believes their choice is driven by business interests, as they seek lucrative opportunities in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-4-first-look-benedict-sophies-love-story-takes-centre-stage-2681436-2025-02-17",
      "headline": "Bridgerton 4 first look: Benedict-Sophie's love story takes centre stageThe fourth season of Bridgerton is set to spotlight Benedict Bridgerton's romance with Sophie Baek. New characters like Katie Leung's Lady Araminta Gun will add intrigue to the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/legends-of-shiva-amish-tripathi-get-real-about-lord-shiva-in-discovery-show-2681343-2025-02-17",
      "headline": "Legends of Shiva: Amish Tripathi gets real about Lord Shiva in his latest showAuthor and producer Amish Tripathi returns as host of Legends of Shiva with Amish, a new show on Discovery Channel, exploring Lord Shiva beyond myths. Unveiled at the New Delhi Book Fair, it promises a deep dive into mythology coinciding with Maha Kumbh 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amortage-review-jisoos-album-shakes-things-up-like-an-earthquake-2681277-2025-02-17",
      "headline": "Amortage review: Jisoo's album shakes things up like an 'earthquake'Jisoo's new EP, Amortage, released on February 14, 2025, marks her evolution as a solo artist. The EP blends pop and R&B to explore love's many facets, featuring English tracks and her own songwriting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bhabiji-writer-manoj-santoshi-battles-cancer-shilpa-shinde-takes-care-of-him-2681295-2025-02-17",
      "headline": "Bhabiji writer Manoj Santoshi battles cancer, Shilpa Shinde takes care of himActor Kavita Kaushik made an emotional post on social media, highlighting screenwriter Manoj Santoshi's struggle with liver cancer. She also mentioned actor Shilpa Shinde and thanked her for taking care of him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-witch-review-park-jinyoung-roh-jeong-eui-shine-in-slow-burning-psychological-mystery-2681258-2025-02-17",
      "headline": "The Witch review: Jinyoung, Jeong-eui shine in slow-burning psychological mysteryReleased-Sat Feb 15, 2025The Witch review: The Witch, a new K-drama starring Jinyoung and Jeong-eui, captivates with its psychological mystery and slow-burning narrative. The series, based on a popular webtoon, blends mystery, romance, and suspense, leaving viewers intrigued by the enigmatic characters and their complex interactions, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rashami-desai-on-love-hate-bond-with-sidharth-shukla-we-would-communicate-through-eyes-2681270-2025-02-17",
      "headline": "Rashami Desai on love-hate bond with Sidharth Shukla: We'd communicate through eyesActor Rashami Desai, who had worked with the late Sidharth Shukla on 'Dil Se Dil Tak' and 'Bigg Boss 13', was reminded of her relationship with him on comedian Bharti Singh's podcast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/stray-kids-felix-arm-fracture-in-car-accident-misses-fan-meet-2681229-2025-02-17",
      "headline": "Stray Kids' Felix suffers fracture after car accident, misses group's fan meetFelix, a member of the boy band Stray Kids, suffered an arm fracture in a minor car accident, causing him to miss the band's fifth fan meeting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/south-korean-actor-kim-sae-ron-suicide-comeback-to-films-2681202-2025-02-17",
      "headline": "South Korean actor Kim Sae-ron wanted to make a comeback to films, open a cafeSouth Korean actor Kim Sae-ron, who was found dead in her apartment on Sunday, had wished to make a comeback to the entertainment world, revealed a friend recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gajraj-rao-renuka-shahane-dupahiya-prime-video-teaser-2681147-2025-02-17",
      "headline": "Gajraj Rao, Renuka Shahane's Dupahiya to bring laughter and chaos to Prime VideoPrime Video's Dupahiya is set in a crime-free village where the first-ever theft of a motorbike creates chaos and drama. Starring Gajraj Rao and Renuka Shahane, the comedy series starts streaming on March 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/south-korean-actor-kim-sae-ron-found-dead-at-24-2680949-2025-02-16",
      "headline": "South Korean actor Kim Sae-ron, 24, found deadSouth Korean actor Kim Sae-ron, known for her roles in Bloodhounds and The Man from Nowhere, was found dead at her home in Seoul. She was 24. Authorities are investigating the circumstances of her death, with no signs of foul play reported yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-3-review-lisa-parker-posey-and-jason-isaacs-show-is-predictable-but-entertaining-2680925-2025-02-16",
      "headline": "The White Lotus S3 review: Predictable? Yes. Addictive? Also, yesReleased-Mon Feb 17, 2025The White Lotus Season 3 review: The White Lotus returns with a new season set in Thailand, offering a fresh cultural backdrop while retaining its biting satire on the ultra-rich. The series continues to entertain with its dark humour and ensemble cast, though its formula is starting to feel familiar. Read our full review. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-says-he-fought-5-hours-for-grammy-tickets-amid-guest-list-confusion-2680934-2025-02-16",
      "headline": "Kanye West says he fought 5 hours for Grammy tickets amid guest list confusionRapper Kanye West, in a post on X, revealed that he fought for five hours to secure Grammy tickets amid guest list chaos. This comes amid claims that Kanye arrived at the event uninvited. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/comedian-anubhav-singh-bassi-lucknow-show-cancelled-by-cops-law-and-order-concern-2680788-2025-02-16",
      "headline": "Comedian Anubhav Bassi's Lucknow show cancelled after warning over foul languageThe shows of comedian Anubhav Singh Bassi in Lucknow were cancelled due to concerns over inappropriate content, following a complaint by the UP Women's Commission vice-chairperson. Authorities cited potential law and order issues as reasons for the cancellation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/chum-darang-blushes-karan-veer-mehra-confesses-love-valentine-day-bigg-boss-18-2680773-2025-02-16",
      "headline": "Watch: Chum Darang blushes as Karan Veer confesses love on Valentine's DayKaran Veer Mehra confessed his love for Chum Darang on Valentine's Day. Chum shared a post from their romantic outing on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-pauses-delhi-concert-for-fan-wears-team-india-dream-11-jersey-2680728-2025-02-16",
      "headline": "Watch: Ed Sheeran pauses Delhi concert as fan faints, wears Team India jerseyEd Sheeran wrapped up his India tour in Gurugram on February 15. He paused his concert briefly to help a fan who fainted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shalin-bhanot-reacts-to-indias-got-latent-row-advocates-self-discipline-2680673-2025-02-16",
      "headline": "Shalin Bhanot reacts to India's Got Latent Row, advocates self-disciplineTV actor Shalin Bhanot has reacted to the controversy surrounding YouTuber Ranveer Allahbadia's comment on India's Got Latent during the FDCI's India Men's Weekend in Jaipur. He emphasised self-discipline and responsibility.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jay-z-reacts-after-rape-lawsuit-against-him-dropped-2680571-2025-02-15",
      "headline": "Today is a victory: Jay-Z reacts after rape lawsuit against him droppedIn a significant legal victory, rapper Jay-Z has seen a sexual assault lawsuit against him dismissed. The rapper and entrepreneur expressed relief and satisfaction over the court's decision."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/follow-ethics-code-strictly-central-government-advisory-ott-platforms-ranveer-allahbadia-samay-raina-joke-row-india-got-latent-2682831-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Adhere to ethics code: Centre to OTT platforms amid vulgar joke rowThe Centre's move came after the top court on Tuesday stressed that \"there was a need to do something\", and that YouTubers were misusing the lack of regulation on online platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rekha-gupta-delhi-chief-minister-new-bjp-pm-narendra-modi-present-ramlila-ground-mega-oath-ceremony-2682755-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rekha Gupta takes oath as Delhi's 4th woman Chief Minister amid NDA unity showDelhi New CM: Rekha Gupta took oath as the fourth woman Chief Minister of Delhi in the presence of Prime Minister Narendra Modi and NDA Chief Ministers in a mega show of unity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-donald-trump-hints-at-us-poll-meddling-in-india-they-were-trying-to-get-someone-elected-2682615-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump drops bombshell, suggests US deep state was trying to elect someone elseDonald Trump's latest remarks come as he continues to defend the Elon Musk-led Department of Government Efficiency's move to cut the $21 million funding for India, while questioning why the country needs it despite its strong economic position. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-bangladesh-live-score-today-match-updates-group-a-dubai-2682762-2025-02-20#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "IND vs BAN Live: Jaker Ali, Towhid Hridoy take Bangladesh past 100India vs Bangladesh Live Score, Champions Trophy updates:  Jaker Ali Anik and Towhid Hridoy have built on a handy partnership after Bangladesh lost the early wickets. Rohit Sharma and Hardik Pandya dropped two catches, giving the Bangladeshi batters lifelines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/mahakumbh-2025-to-end-with-all-seven-planets-of-solar-system-visible-from-india-2682770-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Maha Kumbh to end with all seven planets visible from IndiaThis celestial alignment adds a unique layer of significance to Maha Kumbh, as many believe that such cosmic events amplify spiritual energies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-chief-minister-oath-rekha-gupta-swati-maliwal-stage-ramlila-maidan-aap-mp-congress-devendra-yada-2682868-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Swati Maliwal seen at Delhi Chief Minister's oath-takingAAP has been accusing Swati Maliwal of being a BJP agent amid her ongoing rift with the party leadership since May last year when she accused Bibhav Kumar, a close aide of Kejriwal, of physically assaulting her at Arvind Kejriwal's residence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/what-makes-bjp-minister-majinder-singh-sirsa-minister-oath-delhi-rekha-gupta-seven-delhi-cabinet-2682799-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What got Manjinder Singh Sirsa into Delhi's magnificent sevenThe BJP's decision to induct Manjinder Singh Sirsa into the Delhi Cabinet of Chief Minister Rekha Gupta isn't just about representation. It's a calculated move with an eye on Punjab. By elevating Sirsa, a Sikh leader, the BJP is seemingly aiming to consolidate support in Delhi while setting the stage for a larger battle against AAP in Punjab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-bangladesh-axar-patel-rohit-sharma-catch-drop-2682873-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit Sharma drops catch to deny Axar hat-trick, slams ground in frustrationIndia vs Bangladesh: India captain Rohit Sharma dropped the simplest of catches in the slip on Thursday, February 20. Rohit's drop in 1st slip denied Axar Patel of what could have been his maiden hat trick.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-illegal-immigration-crackdown-indians-among-300-deportees-detained-panama-hotel-not-allowed-to-leave-2682675-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Help us' signs on windows of Panama hotel holding Indian deportees from USAccording to an Associated Press report, a majority of the nearly 300 deportees belonged to India, Nepal, Sri Lanka, Pakistan, Afghanistan and China. Panama is being used as a stop-over as the US faces difficulties in the deportation process to some of these nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/lpus-2025-batch-final-year-student-bags-rs-103-crore-118000-placement-package-2682322-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LPU's 2025 Batch Final Year Student Bags Rs 1.03 Crore ($1,18,000) Placement Package-Betireddy Naga Vamsi Reddy B. Tech student has secured a 1.03 Crore ($1,18,000) package with an AI robotics company and is set to graduate in May 2025. \r\n\r\n-Over 1,700 students have received packages ranging from Rs 10 LPA – Rs 1 Crore per annum \r\n\r\n-1,912 students received multiple job offers while Adireddy Vasu, secured 7 job offers, setting a rare and impressive record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/omar-abdullah-jk-chief-minister-india-pakistan-talks-kashmir-issue-bbc-interview-2682817-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No scope: Omar Abdullah's U-turn on dialogue with Pakistan over KashmirOmar Abdullah, who had last year pitched for talks between the two nations, accused Pakistan of 'meddling' in the affairs of Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-israel-gaza-ceasefire-deal-bodies-of-youngest-hostages-kfir-bibas-infant-brother-ariel-handed-over-red-cross-2682818-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hamas releases bodies of youngest Israeli hostages, their mother under truce dealShiri, Ariel and Kfir Bibas were aged 32, four and nine months when they were abducted as Hamas launched its unprecedented attack on Israel on October 7, 2023. Without any evidence, Hamas said the next month that the three were killed in an Israeli airstrike. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indigo-staff-passenger-heated-argument-video-viral-damaged-luggage-airline-reacts-2682844-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IndiGo staff, passenger argue over damaged luggage. Airline reacts to viral videoAn IndiGo passenger shared a clip that showed a staff member telling him, \"You can't take my video,\" as he attempted to record the incident. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-bangladesh-arshdeep-singh-dropped-harshit-rana-reactions-2682850-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Favouritism at its peak: Fans fume as India drop Arshdeep, pick Harshit RanaIndia vs Bangladesh, Champions Trophy 2025: India dropped Arshdeep Singh and picked Harshit Rana in their XI for their first match in Dubai on Thursday. Mohammed Shami returned to the XI along with Ravindra Jadeja. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vijender-gupta-delhi-assembly-speaker-once-dragged-out-of-delhi-vidhan-sabha-2682714-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP's Vijender Gupta, once thrown out of Delhi Assembly, comes back as SpeakerVijender Gupta, who won in 2015 and 2020 amid the Kejriwal wave, will chair the proceedings of the Delhi Assembly from where he was once dragged out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yuzvendra-chahal-divorce-rumours-2682857-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yuzvendra Chahal shares another cryptic post, thanks God amid divorce rumoursIndia cricketer Yuzvendra Chahal shared yet another cryptic post on Instagram amid divorce rumours with partner Dhanashree Verma. Chahal took to Instagram to thank God for protecting him from evil.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/tired-of-job-portals-woman-asks-hinge-matches-for-work-shares-chat-screenshots-2682753-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tired of job portals, woman asks Hinge matches for work, shares chat screenshotsAn X user, who goes by the name Coca, shared four screenshots of her conversations with matches on the dating app Hinge where she directly asked them whether they were hiring."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/woman-detained-beating-up-boy-objects-dog-entry-lift-greater-noida-gaur-city-2-society-2682617-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Noida woman drags 8-year-old out of lift after he objects to dog's entryAfter a video of the incident went viral on social media, angry residents held a protest against the woman outside the gate of society and demanded strict action against her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-leader-alka-lamba-nostalgic-photo-from-1995-for-rekha-gupta-we-took-oath-together-2682681-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress leader's nostalgic post from 1995 for Rekha Gupta: We took oath togetherCongress leader Alka Lamba shared a photo with Delhi Chief Minister Rekha Gupta, reminiscing the day they took oath together 30 years ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vs-epf-which-one-is-better-for-tax-saving-under-new-income-tax-regime-2682697-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why NPS is better than EPF for tax saving under new tax regimeNPS vs EPF: In the case of EPF, employee contributions generally qualify for a deduction under Section 80C of the Income Tax Act, capped at Rs 1.5 lakh annually, under the Old Income Tax regime. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/what-is-secondary-infertility-and-why-is-it-rising-in-india-2682432-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What is secondary infertility, and why is it rising in IndiaSecondary infertility is on the rise in India but is seldom discussed. Lack of awareness is the reason why it is still a lesser-known term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-pauses-lokpal-ruling-on-power-to-hear-complaints-against-high-court-judges-very-disturbing-2682701-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Disturbing: Supreme Court pauses Lokpal order on power to probe High Court judgesThe Supreme Court took up the matter suo moto following an order passed by the Lokpal last month while it was hearing two complaints filed against a judge of a High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/iphone-16e-vs-iphone-se-3-apple-rebrands-iphone-se-4-with-big-upgrades-here-are-the-top-5-2682662-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "iPhone 16e vs iPhone SE 3: Here are the top 5 upgradesThe iPhone 16e replaces the iPhone SE 3 as Apple's most affordable iPhone. But what are the key upgrades in the iPhone 16e versus the iPhone SE 3? We list the top 5 in this article."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/kashmiri-medical-student-ragged-at-al-ameen-medical-college-bijapur-omar-abdullah-chief-minister-intervene-2682669-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kashmiri MBBS student ragged in Karnataka, Omar Abdullah writes to SiddaramaiahA Kashmiri MBBS student at Al-Ameen Medical College in Bijapur, Karnataka, was allegedly subjected to ragging and assault by seniors. The Jammu and Kashmir Students Association called for urgent intervention and strict action against the accused students."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/composer-thaman-s-says-no-one-should-marry-as-girls-want-to-be-independent-2682904-2025-02-20",
      "headline": "Composer Thaman S says no one should marry as 'girls want to be independent'Music composer Thaman S appeared on a podcast and discussed his views on marriage. The 'Daaku Maharaaj' composer, who's been married for over 30 years, blamed independent women for changing society. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-prashanth-neel-begin-dragon-shooting-pic-sets-ntr-31-mythri-movie-makers-2682898-2025-02-20",
      "headline": "Jr NTR, Prashanth Neel begin 'deadliest showdown' for NTR 31, see pic from setsJr NTR has begun shooting for his next film with director Prashanth Neel. The film is tentatively titled Dragon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pooja-hegde-to-star-in-special-dance-number-for-rajinikanths-coolie-report-2682417-2025-02-20",
      "headline": "Pooja Hegde to star in special dance number in Rajinikanth's Coolie: ReportActor Pooja Hegde is reportedly set to shake a leg in Coolie, adding to the film's star power. Directed by Lokesh Kanagaraj, the Rajinikanth-starrer is one of the most awaited releases of 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sky-force-director-sandeep-kewlani-on-casting-veer-pahariya-trolls-akshay-kumar-role-2682879-2025-02-20",
      "headline": "Sky Force director on Veer's casting, trolls, Akshay Kumar's role | ExclusiveSky Force director Sandeep Kewlani, in an exclusive conversation with India Today, opened up about casting Veer Pahariya and the trolling for his performance. He further spoke about Akshay Kumar's faith in the project."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azams-poor-intent-at-start-cost-pakistan-game-vs-new-zealand-2682596-2025-02-20",
      "headline": "Babar Azam's poor intent at start cost Pakistan vs New Zealand: Sanjay BangarFormer India cricketer and batting coach Sanjay Bangar said that Babar Azam's poor intent with the bat cost Pakistan dearly in their opening match of the Champions Trophy vs New Zealand."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-empty-stands-in-india-vs-bangladesh-match-go-viral-low-crowd-2682882-2025-02-20",
      "headline": "Is ODI cricket dying? Fans question empty stands in India vs Bangladesh gameThe empty stands at the Dubai International Cricket Stadium during the India vs Bangladesh match of the ICC Champions Trophy 2025 went viral all over social media as fans began questioning the relevance of ODI cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-bangladesh-axar-patel-rohit-sharma-catch-drop-2682873-2025-02-20",
      "headline": "Rohit Sharma drops catch to deny Axar hat-trick, slams ground in frustrationIndia vs Bangladesh: India captain Rohit Sharma dropped the simplest of catches in the slip on Thursday, February 20. Rohit's drop in 1st slip denied Axar Patel of what could have been his maiden hat trick.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yuzvendra-chahal-divorce-rumours-2682857-2025-02-20",
      "headline": "Yuzvendra Chahal shares another cryptic post, thanks God amid divorce rumoursIndia cricketer Yuzvendra Chahal shared yet another cryptic post on Instagram amid divorce rumours with partner Dhanashree Verma. Chahal took to Instagram to thank God for protecting him from evil.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-bangladesh-arshdeep-singh-dropped-harshit-rana-reactions-2682850-2025-02-20",
      "headline": "Favouritism at its peak: Fans fume as India drop Arshdeep, pick Harshit RanaIndia vs Bangladesh, Champions Trophy 2025: India dropped Arshdeep Singh and picked Harshit Rana in their XI for their first match in Dubai on Thursday. Mohammed Shami returned to the XI along with Ravindra Jadeja. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/emma-raducanu-fixated-fan-banned-dubai-championship-2682810-2025-02-20",
      "headline": "WTA bans 'fixated' fan after Emma Raducanu incident in Dubai incidentThe WTA has banned a man for \"fixated behavior\" toward Emma Raducanu after security removed him during her Dubai Championship match, leaving the former U.S. Open champion visibly shaken but determined to compete."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-fakhar-zaman-injury-update-india-vs-pakistan-dubai-2682802-2025-02-20",
      "headline": "Fakhar Zaman ruled out of Champions Trophy before Pakistan vs IndiaChampions Trophy 2025: Fakhar Zaman has been ruled out of the tournament before Pakistan's marquee clash against India. Imam-ul-Haq, who hasn't played an ODI since the World Cup 2023, has replaced the swashbuckling batter in the squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-bangladesh-live-score-today-match-updates-group-a-dubai-2682762-2025-02-20",
      "headline": "IND vs BAN Live: Jaker Ali, Towhid Hridoy take Bangladesh past 100India vs Bangladesh Live Score, Champions Trophy updates:  Jaker Ali Anik and Towhid Hridoy have built on a handy partnership after Bangladesh lost the early wickets. Rohit Sharma and Hardik Pandya dropped two catches, giving the Bangladeshi batters lifelines. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-babar-azam-pakistan-vs-new-zealand-mental-pressure-cheteshwar-pujara-2682754-2025-02-20",
      "headline": "Babar under mental pressure? Pujara reacts to Pakistan star's 90-ball 64Cheteshwar Pujara criticised Babar Azam for his slow innings in Pakistan's Champions Trophy opener, highlighting his lack of attacking intent as a major concern in their 60-run loss to New Zealand, which further complicated their semi-final hopes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-sanju-samson-ipl-retirement-talks-thoda-aur-2682737-2025-02-20",
      "headline": "Watch: MS Dhoni reacts as Sanju Samson urges him to play 'thoda aur' in IPLSharing the stage with MS Dhoni at a promotional event, Sanju Samson requested the Chennai Super Kings star to not consider retirement anytime soon. Dhoni, 43, will play as an uncapped player for CSK in IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/emma-raducanu-fixated-fan-banned-dubai-championship-2682810-2025-02-20",
      "headline": "WTA bans 'fixated' fan after Emma Raducanu incident in Dubai incidentThe WTA has banned a man for \"fixated behavior\" toward Emma Raducanu after security removed him during her Dubai Championship match, leaving the former U.S. Open champion visibly shaken but determined to compete."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-fakhar-zaman-injury-update-india-vs-pakistan-dubai-2682802-2025-02-20",
      "headline": "Fakhar Zaman ruled out of Champions Trophy before Pakistan vs IndiaChampions Trophy 2025: Fakhar Zaman has been ruled out of the tournament before Pakistan's marquee clash against India. Imam-ul-Haq, who hasn't played an ODI since the World Cup 2023, has replaced the swashbuckling batter in the squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-bangladesh-live-score-today-match-updates-group-a-dubai-2682762-2025-02-20",
      "headline": "IND vs BAN Live: Jaker Ali, Towhid Hridoy take Bangladesh past 100India vs Bangladesh Live Score, Champions Trophy updates:  Jaker Ali Anik and Towhid Hridoy have built on a handy partnership after Bangladesh lost the early wickets. Rohit Sharma and Hardik Pandya dropped two catches, giving the Bangladeshi batters lifelines. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-babar-azam-pakistan-vs-new-zealand-mental-pressure-cheteshwar-pujara-2682754-2025-02-20",
      "headline": "Babar under mental pressure? Pujara reacts to Pakistan star's 90-ball 64Cheteshwar Pujara criticised Babar Azam for his slow innings in Pakistan's Champions Trophy opener, highlighting his lack of attacking intent as a major concern in their 60-run loss to New Zealand, which further complicated their semi-final hopes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-sanju-samson-ipl-retirement-talks-thoda-aur-2682737-2025-02-20",
      "headline": "Watch: MS Dhoni reacts as Sanju Samson urges him to play 'thoda aur' in IPLSharing the stage with MS Dhoni at a promotional event, Sanju Samson requested the Chennai Super Kings star to not consider retirement anytime soon. Dhoni, 43, will play as an uncapped player for CSK in IPL 2025. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}