{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-card-spending-drops-in-what-causing-indians-to-spend-less-2701752-2025-03-31",
      "headline": "Credit card spending drops. What's causing Indians to spend less?Big credit card issuers like HDFC Bank, SBI Cards, and ICICI Bank witnessed fewer new customers in February. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-reciprocal-tariffs-could-lead-to-another-round-of-stock-market-correction-key-things-to-know-2701667-2025-03-31",
      "headline": "US reciprocal tariffs: Will Dalal Street face more turbulence from April 2?US reciprocal tariffs have put Dalal Street on edge as investors brace for potential market swings. With FPIs cautious and auto stocks under pressure, domestic markets could face more turbulence in the near term.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-stock-market-impact-9-stocks-to-watch-buy-sell-hold-investor-advice-expert-view-2701644-2025-03-31",
      "headline": "Trump tariffs could hit these 9 stocks. Should you sell?The IT sector is under pressure due to concerns over Trump's trade policies and potential increases in H-1B visa costs. Indian IT firms earn over 50% of their revenue from the US, making them vulnerable to higher hiring costs and reduced outsourcing contracts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uk-primark-boss-paul-marchant-resigns-after-error-of-judgement-2701626-2025-03-31",
      "headline": "UK's Primark boss resigns after 'error of judgement' in social settingThe group said on Monday that Paul Marchant had cooperated with an investigation led by external lawyers, acknowledged his \"error of judgement\" and accepted that his actions fell below the standards expected by AB Foods."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/claiming-hra-but-not-paying-tds-beware-of-tax-notices-and-penalties-2701582-2025-03-31",
      "headline": "Claiming HRA but not paying TDS? Beware of tax notices and penaltiesThe landlord's PAN must be mentioned in the TDS challan. However, if the PAN is missing or inactive, the TDS is levied at 20% under Section 206AA. On the other hand, for Non-Resident Indian (NRI) landlords, the rate of TDS is 30%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upcoming-ipos-fy26-slow-start-4-listings-sme-platform-desco-infratech-shri-ahimsa-naturals-atc-energies-2701574-2025-03-31",
      "headline": "IPO market off to a slow start in FY26, but these 4 firms to debut soonThe IPO pipeline for FY26 could be worth nearly Rs 2 lakh crore. Some major companies, including Zepto, Reliance Jio, and LG Electronics, are reportedly in the process of finalising their listing plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/haldiram-stake-sale-temasek-pwc-expansion-snacks-packaged-foods-market-2701531-2025-03-31",
      "headline": "Haldiram's to sell stake to Singapore's Temasek, says PwCThis stake sale is expected to help Haldiram expand both in India and internationally, strengthening its position in the highly competitive snacks and packaged foods market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/atm-cash-withdrawal-to-get-costlier-may-1-rs-23-charges-go-up-check-new-rbi-rules-here-2701499-2025-03-31",
      "headline": "ATM withdrawals to cost Rs 23 from May 1 as RBI hikes fee. Check detailsATM cash withdrawal will see an increase from the current charge of Rs 21 per transaction. Despite the fee hike, customers will continue to receive a limited number of free ATM transactions every month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-holiday-eid-2025-is-nse-bse-closed-for-trading-monday-dalal-street-sensex-nifty-2701479-2025-03-31",
      "headline": "Is stock market closed today for Eid?The stock market follows a five-day workweek, operating from Monday to Friday. Regular trading hours are from 9:15 am to 3:30 pm. Markets remain closed on weekends and designated public holidays as per the official schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-parent-tax-penalty-order-income-tax-department-airline-contest-frivolous-directive-2701324-2025-03-30",
      "headline": "IndiGo gets Rs 944 crore tax penalty, calls it erroneous and frivolousBudget carrier IndiGo's parent company said it had received a Rs 944 crore tax penalty order from the Income Tax Department. The company plans to challenge the order legally and called it \"frivolous and erroneous\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-gainers-losers-stock-market-sensex-nifty-nse-bse-shares-it-auto-trump-tariff-2700664-2025-03-28",
      "headline": "Sensex, Nifty closing: Top stocks that gained and lost on BSE, NSEIT and auto sector stocks dragged the market down. The fall in IT and auto stocks is linked to concerns over US reciprocal tariffs, which are set to come into effect on April 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thailand-stock-exchange-halts-trading-after-earthquake-hits-myanmar-2700603-2025-03-28",
      "headline": "Thailand stock exchange halts trading after earthquake hits MyanmarFollowing tremors from the Myanmar earthquake, the Stock Exchange of Thailand suspended all trading for the Friday afternoon session."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zayn-malik-cancels-mexico-show-due-to-severe-food-poisoning-apologises-to-fans-2701818-2025-03-31",
      "headline": "Zayn Malik cancels Mexico show due to severe food poisoning: Sorry to let you downZayn Malik was forced to cancel his Mexico City concert after suffering from severe food poisoning. The singer expressed his heartbreak and gratitude towards fans for their understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-eid-2025-waves-fans-from-galaxy-through-bulletproof-glass-check-viral-pics-2701813-2025-03-31",
      "headline": "Salman Khan makes mandatory Eid appearance, greets fans through bulletproof glassActor Salman Khan greeted his fans on Eid. The superstar waved to the fans while standing behind the bulletproof glass that he got installed at his Galaxy apartment earlier this year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-empuraan-controversy-over-riot-depiction-timeline-2701788-2025-03-31",
      "headline": "Explained: Mohanlal's Empuraan controversy over riot depictionMohanlal and director Prithviraj Sukumaran's 'L2: Empuraan' is in the midst of a political storm over sequences that appear to be references to the 2002 Gujarat riots. From backlash from right-wing factions to the film being re-edited, here's all that happened."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-funny-reaction-not-bringing-cook-dilip-at-lakme-fashion-week-watch-2701760-2025-03-31",
      "headline": "Watch: Farah Khan's funny reaction as paps ask about not bringing cook Dilip at LFWAt Lakme Fashion Week, Farah Khan had a hilarious reaction when asked about her cook, Dilip. The viral moment left fans joking that Dilip is now a bigger star than Farah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-press-conference-for-kim-sae-ron-everything-that-he-said-about-death-controversy-case-lawsuit-to-denying-allegations-2701749-2025-03-31",
      "headline": "Lawsuit to denying allegations, everything Kim Soo-hyun said on Kim Sae-ron caseFor the first time since Kim Sae-ron's death snowballed into a big controversy, Korean actor Kim Soo-hyun spoke about what all happened, asking fans to give him a fair chance to present his side of the story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/tanmay-bhat-trolls-ranveer-allahbadia-rebirth-post-ashish-chanchlani-comments-2701751-2025-03-31",
      "headline": "Tanmay Bhat trolls Ranveer Allahbadia on rebirth post, Ashish Chanchlani commentsRanveer Allahbadia's recent posts announcing his comeback had comments from several people, including Ashish Chanchlani and Apoorva Mukhija, who were a part of the same India's Got Latent episode as him. Tanmay Bhat also dropped cheeky comments on one of the posts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-joins-the-ghibli-trend-shares-ai-edited-pics-from-his-fan-meet-2701726-2025-03-31",
      "headline": "Amitabh Bachchan hops on Ghibli trend, shares AI edited pics from his fan meetVeteran actor Amitabh Bachchan is the latest to share his Ghibli edits, sharing his thoughts on this popular trend. The latest trend has taken over the internet for the last few days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/45-teaser-a-mythology-inspired-showdown-between-shiva-rajkumar-upendra-for-raj-b-shetty-2701684-2025-03-31",
      "headline": "45 teaser: Mythology-inspired showdown between Shiva Rajkumar, UpendraThe teaser of '45', starring Shiva Rajkumar, Upendra and Raj B Shetty, was released on March 30, 2025, marking the festive occasion of Ugadi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prajakta-koli-on-adapting-to-social-media-challenges-2701721-2025-03-31",
      "headline": "Prajakta Koli on adapting to social media's challenges: You either swim or surfPrajakta Koli opens up about social media scrutiny, adapting to feedback, and learning from mistakes. She reflects on evolving as a creator while balancing authenticity and audience accountability."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-breaks-silence-in-kim-sae-ron-death-case-gets-emotional-took-me-so-long-2701693-2025-03-31",
      "headline": "Emotional Kim Soo-hyun says sorry, speaks on Kim Sae-ron death: Took me so longKim Soo-hyun said in a press conference that he feels distressed for the late actor and his ex-girlfriend Kim Sae-ron. He accepted his relationship with Sae-ron, but maintained that she wasn't a minor when they dated each other four years ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shabana-azmi-javed-akhtar-on-decline-of-hindi-cinema-where-are-good-stories-exclusive-2701673-2025-03-31",
      "headline": "Where are good stories: Shabana Azmi on decline of Hindi cinema | ExclusiveIn an exclusive chat with India Today, Shabana Azmi critiques Bollywood's weak storytelling, OTT's impact, and the lack of recall value in films. She also praises changing roles for women, saying actresses now have longer careers than before."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/barkha-bisht-says-ex-husband-indraneil-sengupta-cheated-2701676-2025-03-31",
      "headline": "Barkha Bisht accuses ex-husband Indraneil of cheating: My belief in humanity brokeActor Barkha Bisht said that her ex-husband, actor Indraneil Sengupta, cheated on her when they were married. Barkha, who was married to Indraneil for 15 years, tried to save the marriage, and even stayed with him for two years after learning about his infidelity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dame-helen-mirren-on-not-liking-james-bond-said-its-born-out-of-profound-sexism-2701672-2025-03-31",
      "headline": "Helen Mirren on not liking James Bond: It's born out of profound sexismHollywood icon Dame Helen Mirren has criticised the James Bond franchise for its sexist portrayal of women. She advocated for more recognition of real-life female spies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sudhanshu-pandey-joins-wagle-ki-duniya-as-a-rockstar-2701653-2025-03-31",
      "headline": "Actor Sudhanshu Pandey joins Wagle Ki Duniya as a rockstarSudhanshu Pandey joins the cast of Wagle Ki Duniya as a rockstar named Rocky. His arrival brings a mix of excitement, jealousy, and intrigue as the neighborhood buzzes with his rockstar charm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-murali-gopy-left-right-left-controversy-2701535-2025-03-31",
      "headline": "Two films, two fates: Empuraan writer Murali Gopy's tryst with political dramasIn 2013, writer Murali Gopy's 'Left Right Left' criticised the Left factions. His recent film 'Empuraan' was called out for its 'anti-Hindu' ideology. In this piece, let's take a look at how the two films faced different fates. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/volkan-konak-dies-after-collapsing-onstage-in-cyprus-2701646-2025-03-31",
      "headline": "Turkish singer Volkan Konak dies after onstage collapse in CyprusRenowned Turkish singer Volkan Konak tragically died after collapsing on stage during a concert in Cyprus. Despite immediate medical attention, he was declared dead at the hospital, leaving fans and the music world in mourning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-son-aadvik-fanboy-moment-football-legend-ronaldinho-2701633-2025-03-31",
      "headline": "Ajith Kumar's son Aadvik's fanboy moment with football legend RonaldinhoAjith Kumar's son, Aadvik, had a fanboy moment when he met football legend Ronaldinho in Chennai. Shalini Ajith Kumar shared a video of the special moment on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-gets-mobbed-in-gangtok-while-shooting-for-anurag-basus-film-watch-2701610-2025-03-31",
      "headline": "Kartik Aaryan gets mobbed in Gangtok while shooting for Anurag Basu's film. WatchKartik Aaryan has been shooting for Anurag Basu's romantic drama with Sreeleela in Northeast India. A video has surfaced online in which he is seen being surrounded by a huge crowd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/richa-chadha-slams-top-filmmakers-stereotyping-actors-we-can-learn-from-south-2701592-2025-03-31",
      "headline": "Richa Chadha slams top filmmakers stereotyping actors: We can learn from SouthRicha Chadha has openly criticised the film industry's tendency to typecast actors, urging a shift towards more inclusive casting. She highlighted the South Indian film industry as a model for diverse role opportunities."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/myanmar-earthquake-toll-death-injured-bangkok-mandalay-epicentre-2701811-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Myanmar quake toll crosses 2,000-mark, search for survivors onThe death toll from the 7.7 magnitude earthquake, which struck Myanmar on March 28, crossed the 2,000-mark and over 3,900 people were injured. Rescuers were racing against time to search for more survivors three days after the temblor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ifs-nidhi-tewari-appointed-pm-modis-private-secretary-all-we-know-about-her-2701637-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Nidhi Tewari, IFS officer appointed as PM Modi's private secretary?Nidhi Tewari, a 2014-batch IFS officer, is currently serving as Deputy Secretary in the Prime Minister's Office (PMO)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-police-officers-reach-kunal-kamra-home-eknath-shinde-joke-row-2701821-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mumbai cops reach Kunal Kamra's home amid Eknath Shinde joke rowMumbai police visited comedian Kunal Kamra's residence after he failed to appear for questioning over jokes about Deputy Chief Minister Eknath Shinde. Facing multiple FIRs, Kamra secured interim anticipatory bail from the Madras High Court until April 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/imd-summer-season-hotter-than-usual-temperatures-heatwave-days-india-2701837-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "April to be hotter than usual with 3 heatwave days in Delhi, 6 in Bengal, BiharAddressing a press conference, IMD chief Mrutyunjay Mohapatra said several parts of the country may experience higher-than-normal maximum temperatures from April to June."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-eid-2025-waves-fans-from-galaxy-through-bulletproof-glass-check-viral-pics-2701813-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan makes mandatory Eid appearance, greets fans through bulletproof glassActor Salman Khan greeted his fans on Eid. The superstar waved to the fans while standing behind the bulletproof glass that he got installed at his Galaxy apartment earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-kkr-live-score-ipl-match-today-updates-mumbai-hardik-ajinkya-2701831-2025-03-31#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "MI vs KKR Live: Struggling Mumbai bank on Wankhede magic vs KolkataMumbai Indians (MI) vs Kolkata Knight Riders (KKR) Live Score and Updates, IPL 2025: Kolkata knight Riders have travelled to Mumbai to play their third match of the season. Sunil Narine is expected to return to the line-up for Kolkata. On the other hand, Hardik's Mumbai are still searching for their first point.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/message-from-maha-kumbh-bjp-rss-bonhomie-pm-narendra-modi-mohan-bhagwat-up-cm-yogi-adityanath-2701728-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Message from the Maha Kumbh and the BJP-RSS bonhomieThe unprecedented gathering at the Maha Kumbh in Prayagraj must have sent a powerful signal to the BJP and the RSS. Like he did after the game-changing UP election in 2017, PM Narendra Modi acknowledged this ground message from Prayagraj during his visit to the RSS headquarters in Nagpur. It's time for the two to ride the wave together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/thiland-earthquake-probe-against-chinese-firm-after-bangkok-skyscraper-collapsed-in-friday-quake-2701683-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stolen papers, China link emerge in probe into Bangkok quake high-rise collapseThai authorities are investigating a Chinese-backed firm after a 33-storey high-rise in Bangkok collapsed during Myanmar's 7.7-magnitude earthquake, killing 17. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/girl-dies-run-over-hyundai-car-driven-teen-delhi-paharganj-accused-arrested-2701778-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Toddler dies after being crushed under car driven by 15-year-old neighbourA two-year-old girl died after she was hit by a Hyundai Venue car driven by her 15-year-old neighbour in central Delhi's Paharganj. The teen and his father, the owner of the vehicle, were arrested."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kera-asha-workers-women-protest-shave-head-cut-hair-indefinite-fast-hunger-strike-demands-2701803-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "50 days, hunger strike, heads shaved: Why Kerala's ASHA workers are protestingASHA workers in Kerala have been protesting for 50 days. On Monday, some shaved their heads while others cut their hair, marching down MG Road in Thiruvananthapuram with their chopped hair in hand. But why are they protesting? Read on to learn about their demands and the government's response."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-murali-gopy-left-right-left-controversy-2701535-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Two films, two fates: Empuraan writer Murali Gopy's tryst with political dramasIn 2013, writer Murali Gopy's 'Left Right Left' criticised the Left factions. His recent film 'Empuraan' was called out for its 'anti-Hindu' ideology. In this piece, let's take a look at how the two films faced different fates. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/driver-who-rammed-lamborghini-into-2-workers-in-noida-granted-bail-2701817-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Driver who rammed Lamborghini into 2 workers in Noida granted bailA Surajpur court granted bail to Deepak, involved in a Lamborghini crash in Noida. The accident occurred during a test drive, injuring two labourers. The car, owned by YouTuber Mridul Tiwari, has been confiscated. Investigations continue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/myanmar-earthquake-isro-satellite-images-reveal-scale-of-destruction-2701764-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Myanmar earthquake: Isro satellite images reveal scale of destructionThe earthquake has resulted in catastrophic damage across multiple regions. Infrastructure such as roads, residential buildings, and historical landmarks suffered severe destruction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/annamalai-softens-on-bjp-aiadmk-alliance-after-eps-meets-amit-shah-ka-sengottaiyan-visits-delhi-2701679-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Annamalai softens stance on BJP-AIADMK alliance after top leader meets Amit ShahBJP Tamil Nadu chief Annamalai softened his stance on AIADMK after party general secretary Edappadi K Palaniswamy met Amit Shah. While the BJP state chief avoided alliance discussions, he hinted at leadership flexibility."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/hamas-executes-6-gazans-flogs-people-in-public-to-quell-anti-hamas-protests-importance-gaza-war-israel-2701691-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Protest-shocked Hamas executes 6 Gazans, flogs people in publicShocked by unprecedented protests in Gaza, Hamas is resorting to executions, torture and enforced disappearances to crush the anti-Hamas agitation. As Palestinians seethe in anger and frustration, Hamas' grip on power seems to be shakier than ever."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/director-sanoj-kumar-mishra-who-offered-film-to-maha-kumbh-viral-girl-monalisa-arrested-in-rape-case-2701636-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Director who offered film to Maha Kumbh-viral Monalisa arrested in rape caseThe complainant, a 28-year-old woman, alleged that she met Mishra through social media platforms TikTok and Instagram in 2020 while living in Uttar Pradesh's Jhansi. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-press-conference-for-kim-sae-ron-everything-that-he-said-about-death-controversy-case-lawsuit-to-denying-allegations-2701749-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lawsuit to denying allegations, everything Kim Soo-hyun said on Kim Sae-ron caseFor the first time since Kim Sae-ron's death snowballed into a big controversy, Korean actor Kim Soo-hyun spoke about what all happened, asking fans to give him a fair chance to present his side of the story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-will-lead-even-in-2029-devendra-fadnavis-shuts-down-retirement-claim-2701678-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Devendra Fadnavis's 'Mughal culture' jab at Sanjay Raut over PM succession claimAttacking Sanjay Raut over his 'Mughal' mindset, Fadnavis said, 'In Indian culture, the younger ones do not think this way while elders are present. This is Mughal culture.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-nagpur-visit-rss-headquarters-modi-successor-sanjay-raut-maharashtra-2701609-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM visited RSS office to 'announce September retirement plan', Sanjay Raut claimsSanjay Raut has claimed that the RSS will decide Prime Minister Narendra Modi's successor, linking the latter's recent Nagpur visit to a leadership transition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/not-able-to-create-ghibli-style-images-here-is-a-prompt-that-should-work-2701560-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not able to create Ghibli style images? Here is a prompt that should workA primary reason why some users are unable to generate Ghibli-style images is that they are not using the right prompt. Here is how to quickly create Ghibli style images on ChatGPT or Grok AI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/the-hidden-dangers-of-indias-obsession-with-self-medication-2701540-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The hidden dangers of India's obsession with self-medicationSelf-medication can lead to unintended side effects and even serious health risks. Indians obsessing over self-medication comes from various aspects, including financial constraints, cultural beliefs, and a general distrust of the medical system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/did-rana-sanga-invite-babur-to-india-here-is-what-history-says-2701666-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did Rana Sanga invite Babur to India? Here's what history saysThe controversy surrounding whether Rana Sangram Singh Sisodia, the Rana of Mewar, invited Zahiruddin Muhammad Babur to invade India, and whether by doing so he was a traitor, started with a remark made by Ramji Lal Suman, a Samajwadi Party MP in the Rajya Sabha. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/french-far-right-leader-le-pen-found-guilty-of-embezzlement-presidential-bid-at-risk-2701714-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "French far-right leader found guilty of embezzlement, barred from running for officeMarine Le Pen left a French courtroom after being barred from public office following her conviction for embezzling EU funds. The judge has yet to announce the length of her ineligibility, which could impact her 2027 presidential bid. Le Pen and her party members were found guilty of misusing EU funds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/regularly-experiencing-stuffy-nose-headache-sinus-dry-skin-rhinitis-asthma-it-could-be-your-air-conditioner-ac-2701692-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Are you regularly experiencing stuffy nose, headache? It could be your ACWhile air conditioners help cool the room, they also remove moisture from the air, which can cause dryness in the nose, throat, and skin. This is where a humidifier can help."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kl-rahul-intent-delhi-capitals-debut-hemang-badani-coach-2701834-2025-03-31",
      "headline": "KL Rahul 2.0? Hemang Badani lauds early glimpse in Delhi Capitals debutIPL 2025: Making his debut for Delhi Capitals on Sunday in Visakhapatnam, KL Rahul smashed 15 from just 5 deliveries in their successful chase of 164 against SunRisers Hyderabad. Rahul is expected to play an aggressor's role in the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-kkr-live-score-ipl-match-today-updates-mumbai-hardik-ajinkya-2701831-2025-03-31",
      "headline": "MI vs KKR Live: Struggling Mumbai bank on Wankhede magic vs KolkataMumbai Indians (MI) vs Kolkata Knight Riders (KKR) Live Score and Updates, IPL 2025: Kolkata knight Riders have travelled to Mumbai to play their third match of the season. Sunil Narine is expected to return to the line-up for Kolkata. On the other hand, Hardik's Mumbai are still searching for their first point.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-varun-chakravarthy-sunil-narine-relationship-2701798-2025-03-31",
      "headline": "Sunil Narine will be MVP for Knight Riders IPL 2025 too: Varun ChakravarthyIPL 2025: Varun Charkavarthy spoke about his partnership with Sunil Narine in the IPL, backing the West Indies star to become the Most Valuable Player in the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jakub-mensik-thanks-atp-physio-after-miami-open-title-win-for-miracle-treatment-2701789-2025-03-31",
      "headline": "Jakub Mensik thanks ATP physio after Miami Open title win for 'miracle' treatmentJakub Mensik thanked an ATP phyiso after winning the Miami Open title win on Sunday, March 30. Mensik was about to withdraw from the tournament due to a knee injury before the physio  helped him heal in quick time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-riyan-parag-slammed-for-tossing-phone-after-selfie-rr-vs-csk-2701743-2025-03-31",
      "headline": "Watch: Riyan Parag slammed for tossing phone after selfie with security personnelRajasthan Royals' stand-in captain Riyan Parag was slammed for casually tossing the phone towards security personnel after clicking a selfie in Guwahati following his team's win over Chennai Super Kings (CSK)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-riyan-parag-captaincy-guwahati-2701733-2025-03-31",
      "headline": "Riyan Parag's bold claim: Always felt like I was captaining Rajasthan from Day 1Riyan Parag made the bold claim that he felt like he was captaining Rajasthan Royals from the time he joined the franchise. Riyan joined the franchise during the 2018 auction and has been a regular in the side since then. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ambati-rayudu-suggests-sending-naman-dhir-at-number-3-2701696-2025-03-31",
      "headline": "Rayudu suggests batting order shift for struggling MI: Send Naman Dhir at no 3Former India cricketer Ambati Rayudu has suggested Mumbai Indians to promote Naman Dhir at number three in the upcoming game against Kolkata Knight Riders (KKR) in Indian Premier League 2025 (IPL 2025)"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-angkrish-raghuvanshi-wankhede-stadium-2701680-2025-03-31",
      "headline": "KKR want to forget past results at Wankhede vs MI: Angkrish RaghuvanshiAngkrish Raghuvanshi has said that KKR doesn't want to focus on their past results at the Wankhede stadium when they take on MI on Monday, March 31. KKR doesn't have a great record while playing at the iconic ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-yuzvendra-chahal-shreyas-iyer-arshdeeps-heartwarming-meet-up-with-special-fan-2701650-2025-03-31",
      "headline": "Watch: Chahal, Shreyas Iyer, Arshdeep's heartwarming meet up with 'special' fanPunjab Kings cricketers Yuzvendra Chahal, Shreyas Iyer and Arshdeep Singh met with a special fan ahead of their game against Lucknow Super Giants (LSG) on April 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-chennai-super-kings-fielding-ambati-rayudu-2701648-2025-03-31",
      "headline": "CSK's mistakes in IPL 2025 have been painful to watch: Rayudu after RR lossAmbati Rayudu launched a scathing attack on Chennai Super Kings' fielding efforts on Sunday, March 30 during their loss against the Rajasthan Royals in Guwahati. CSK were sloppy on the field against RR. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shardul-thakur-asks-for-fair-chance-for-bowlers-2701623-2025-03-31",
      "headline": "Shardul Thakur asks for fair chance for bowlers amid run fests in IPL 2025Lucknow Super Giants (LSG) all-rounder Shardul Thakur asked for the restoration of balance between bat and ball amid the ongoing run fests in the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ambati-rayudu-suggests-sending-naman-dhir-at-number-3-2701696-2025-03-31",
      "headline": "Rayudu suggests batting order shift for struggling MI: Send Naman Dhir at no 3Former India cricketer Ambati Rayudu has suggested Mumbai Indians to promote Naman Dhir at number three in the upcoming game against Kolkata Knight Riders (KKR) in Indian Premier League 2025 (IPL 2025)"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-angkrish-raghuvanshi-wankhede-stadium-2701680-2025-03-31",
      "headline": "KKR want to forget past results at Wankhede vs MI: Angkrish RaghuvanshiAngkrish Raghuvanshi has said that KKR doesn't want to focus on their past results at the Wankhede stadium when they take on MI on Monday, March 31. KKR doesn't have a great record while playing at the iconic ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-yuzvendra-chahal-shreyas-iyer-arshdeeps-heartwarming-meet-up-with-special-fan-2701650-2025-03-31",
      "headline": "Watch: Chahal, Shreyas Iyer, Arshdeep's heartwarming meet up with 'special' fanPunjab Kings cricketers Yuzvendra Chahal, Shreyas Iyer and Arshdeep Singh met with a special fan ahead of their game against Lucknow Super Giants (LSG) on April 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-chennai-super-kings-fielding-ambati-rayudu-2701648-2025-03-31",
      "headline": "CSK's mistakes in IPL 2025 have been painful to watch: Rayudu after RR lossAmbati Rayudu launched a scathing attack on Chennai Super Kings' fielding efforts on Sunday, March 30 during their loss against the Rajasthan Royals in Guwahati. CSK were sloppy on the field against RR. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shardul-thakur-asks-for-fair-chance-for-bowlers-2701623-2025-03-31",
      "headline": "Shardul Thakur asks for fair chance for bowlers amid run fests in IPL 2025Lucknow Super Giants (LSG) all-rounder Shardul Thakur asked for the restoration of balance between bat and ball amid the ongoing run fests in the Indian Premier League 2025 (IPL 2025)."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}