{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-slashes-import-duty-on-bourbon-whiskey-to-50-per-cent-pm-modi-donald-trump-talks-2680358-2025-02-15",
      "headline": "India slashes import duty on bourbon whisky to 100% after Trump's criticismThe reduction in customs duty on bourbon whisky was notified on February 13 just ahead of Prime Minister Narendra Modi's talks with US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-digital-lending-5-key-benefits-you-should-know-2680169-2025-02-14",
      "headline": "What is digital lending? 5 key benefits you should know Digital lending platforms make use of advanced technology, thereby making the loan process faster, simpler and more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-has-it-really-been-simplified-for-taxpayers-2680087-2025-02-14",
      "headline": "New Income Tax bill: Has it really been simplified for taxpayers?The proposed income tax bill seeks to simplify and revamp the Income Tax Act of 1961, which has often been criticised for its complexity, making it challenging for ordinary taxpayers to navigate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-transactions-changes-from-february-15-all-you-need-to-know-2680055-2025-02-14",
      "headline": "New UPI transaction rule: All you need to know about auto chargeback processThe changes are primarily regarding auto acceptance and rejection of chargebacks, thereby making the system more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-end-lower-fiis-continue-to-exit-dalal-street-2680072-2025-02-14",
      "headline": "Sensex, Nifty end lower as FIIs continue to exit Dalal StreetThe S&P BSE Sensex lost 199.76 points to end at 75,939.21, while the NSE Nifty50 lost 102.15 points to close at 22,929.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-stock-price-tumbles-6-today-what-triggered-the-slide-2680054-2025-02-14",
      "headline": "Explained: Why Vodafone Idea share price tumbled nearly 6%VI shares were down 5.09% to Rs 8.22 at around 3:15 pm. Earlier during the trading session, shares of the telecom operator fell as much as 6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ambanis-top-asias-rich-list-here-are-other-indians-who-made-it-mistry-birla-bajaj-hinduja-2680007-2025-02-14",
      "headline": "Ambani family richest in Asia. Check which Indian families made the top 20The Ambani family tops Bloomberg's list of Asia's 20 richest families. The family's flagship company, Reliance Industries, is presently headed by Mukesh Ambani, son of late industrialist Dhirubhai Ambani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-curbs-on-new-india-co-operative-bank-how-does-it-impact-customers-what-to-do-2680031-2025-02-14",
      "headline": "RBI curbs on New India Co-operative Bank: How does it impact customers?New India Co-operative Bank has been struggling with financial losses in recent years. According to its annual report, the bank recorded a loss of Rs 22.78 crore in the financial year ending March 2024, following a loss of Rs 30.75 crore in the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/new-india-co-operative-banks-financial-operations-halted-after-notice-from-rbi-2680025-2025-02-14",
      "headline": "New India Co-operative Bank's financial operations halted after notice from RBIThe Reserve Bank of India (RBI) has restricted Mumbai-based New India Co-operative Bank from issuing loans, accepting deposits, or permitting withdrawals for six months. The move comes amid concerns over the bank's financial health and liquidity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-trump-tariffs-but-this-is-whats-making-stock-market-investors-anxious-fii-selling-stock-market-fall-2680000-2025-02-14",
      "headline": "Not Trump's tariffs, but this is what's making stock market investors anxiousThe stock market jitters have occurred despite government measures, including tax relief and the Reserve Bank of India's (RBI) decision to reduce the repo rate by 25 basis points."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-issues-notice-to-halt-all-financial-operations-of-new-india-co-operative-bank-2679968-2025-02-14",
      "headline": "RBI issues notice to halt all financial operations of New India Co-operative BankRBI's move comes after what it called 'recent material developments' at the bank. Although the central bank did not provide specific details, it stated that these directions were issued to protect depositors' interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-all-your-questions-answered-2679917-2025-02-14",
      "headline": "New income tax bill: All you questions answeredThe new income tax bill, compared to the Income Tax Act, 1961, is nearly half the size, containing 259,676 words, 23 chapters, 536 sections, 57 tables and 46 formulae."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jay-z-reacts-after-rape-lawsuit-against-him-dropped-2680571-2025-02-15",
      "headline": "Today is a victory: Jay-Z reacts after rape lawsuit against him droppedIn a significant legal victory, rapper Jay-Z has seen a sexual assault lawsuit against him dismissed. The rapper and entrepreneur expressed relief and satisfaction over the court's decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mahabharat-actor-saurav-gurjar-threatens-ranveer-allahbadia-samay-raina-controversy-indias-got-latent-stmp-2680542-2025-02-15",
      "headline": " No one can save him: Mahabharat actor threatens Ranveer Allahbadia Actor Saurav Gurjar openly threatened Ranveer Allahbadia over his recent remarks on India's Got Latent. In a video message, the actor requested the government to take strict action against the podcaster. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/drake-releases-new-album-amid-feud-with-kendrick-lamar-fails-to-impress-fans-2680481-2025-02-15",
      "headline": "Drake releases new album amid feud with Kendrick Lamar, fails to impress fansDrake appears to have ended his feud with Kendrick Lamar in his latest album, but fans remain unimpressed. Released on Valentine's Day, the album in collaboration with PartyNextDoor marks his first new work since the Super Bowl halftime show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bharti-singh-supports-samay-raina-indias-got-latent-controversy-ranveer-allahbadia-good-talented-guy-2680407-2025-02-15",
      "headline": "Bharti Singh supports Samay Raina amid India's Got Latent controversyComedian Bharti Singh supported Samay Raina amid the India's Got Latent controversy. The comedian praised Samay and said that he is very sweet, and anyone can become his fan once they get to meet him. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-18-chum-darang-elvish-yadav-racist-remarks-2680401-2025-02-15",
      "headline": "Women's panel summons Elvish Yadav over remarks against Chum Darang on Feb 17YouTuber Elvish Yadav has been summoned by a women's panel following his racist remarks against Chum Darang. Yadav criticised her name and nationality, sparking courage among northeastern citizens. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/apoorva-mukhija-aka-rebel-kid-removed-from-official-iifa-ambassador-list-indias-got-latent-controversy-2680258-2025-02-14",
      "headline": "Apoorva Mukhija aka Rebel Kid removed from official IIFA ambassador listApoorva Mukhija, known as Rebel Kid, has been removed from the IIFA ambassador list following controversy over her appearance in Samay Raina's show, India's Got Latent. The decision follows threats from Karni Sena to disrupt her upcoming shoot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fighting-zombies-to-playing-a-psychopath-the-many-faces-of-choi-woo-shik-2680124-2025-02-14",
      "headline": "Fighting zombies to playing a psychopath: The many faces of Choi Woo-shikLong before Choi Woo-shik became a household name thanks to Parasite, he had already amassed an impressive filmography. On this week's K-Fix, we'll have a closer look at his notable works, crafted long before his Oscar-winning turn in Parasite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-potato-lab-trailer-kang-tae-oh-is-set-to-headline-upcoming-rom-com-2680071-2025-02-14",
      "headline": "The Potato Lab trailer: Kang Tae-oh is set to headline upcoming rom-comThe trailer for The Potato Lab, a romantic comedy-drama starring Kang Tae-oh and Lee Sun-bin, has been released. The series, set in a rural potato research institute, promises a blend of romance, comedy, and workplace drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhoom-dhaam-review-yami-gautam-pratik-gandhi-2679912-2025-02-14",
      "headline": "Dhoom Dhaam review: Romance meets thrill in this Yami Gautam-Pratik Gandhi filmReleased-Fri Feb 14, 2025Dhoom Dhaam movie review: Dhoom Dhaam blends romance with action and comedy, offering a refreshing alternative to traditional Valentine's Day films. Starring Yami Gautam and Pratik Gandhi, the movie delivers a thrilling and entertaining experience perfect for a cosy night in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-benny-blanco-song-scared-of-loving-you-released-new-album-i-said-i-love-you-first-2679975-2025-02-14",
      "headline": "Scared of Loving You: Selena Gomez's new song for her Valentine Benny Blanco out Lovebirds Selena Gomez and Benny Blanco have now collaborated for a new album titled I Said I Love You First. On the occasion of Valentine's Day 2025, Selena released the first single from the album, Scared of Loving You.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/music-composer-ilayaraja-madras-high-court-dispute-with-music-master-over-his-compositions-2679766-2025-02-14",
      "headline": "Ilaiyaraaja appears in Court in dispute with music company over his compositionsIn 2010, Music Master filed a lawsuit seeking a ban on the use of these songs on YouTube and social media platforms, calling it \"unauthorised\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/are-k-drama-men-written-by-women-too-good-to-be-true-valentine-day-special-2679923-2025-02-14",
      "headline": "Are K-Drama men written by women too good to be true? | Valentine Special K-drama male leads have captivated audiences with their idealised traits, offering a romantic fantasy of the perfect partner. These characters, crafted by female screenwriters, challenge traditional portrayals. This Valentine's Day we analyse if they are too good to be true. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-love-jihad-religious-conversion-law-committee-formed-2680501-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Law against 'love jihad' in Maharashtra soon? 7-member committee formedThe committee, which will be headed by the Maharashtra Director General of Police, will suggest measures to tackle complaints related to forced conversions and 'love jihad'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tamil-nadu-j-jayalalithaa-disproportionate-assets-case-crown-sword-2680588-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gold crown, gold sword: Jayalalithaa's seized assets transferred to Tamil NaduTamil Nadu officially received former Chief Minister J Jayalalithaa's seized assets, including 27.5 kg of gold, over a tonne of silver, and land documents. Karnataka authorities transferred the valuables under court supervision, revealing her vast wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-west-global-democracy-double-standards-munich-security-conference-panel-2680452-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "S Jaishankar tears into West over global democracy: 'Practice what you preach'Flagging the \"double standards\" of the West over its view on global democracy, External Affairs Minister S Jaishankar said Western leaders treated democracy as a \"Western characteristic\". He urged them to embrace the successful models of non-Western countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/darien-gap-most-dangerous-stretch-on-donkey-route-indian-deported-from-us-trump-darien-gap-explained-2676300-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Where the dead warn the living: Darien Gap, deadliest stretch on donkey routeA second flight with over 100 Indians who migrated illegally to the US will land in Amritsar today. Most of them and others who are in the US illegally took the donkey route. The Darien Gap -- a 97-km stretch on the border of Columbia and Panama -- is the most dangerous part of the South American donkey route. Here's all about the Darien Gap and its dangers that have forced immigrants even to abandon their children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-shah-rukh-khan-aamir-khan-last-bollywood-superstars-pankaj-tripathi-sooraj-barjatya-2679306-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The last of the stars: Why Bollywood has a superstar crisis after the Khans The Khans-Salman Khan, Shah Rukh Khan, and Aamir Khan - share an indelible stardom like no other. But, will there be any successor to their superstardom throne? Industry veterans discuss how digital accessibility has diminished the aura of superstardom.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-illegal-immigration-more-and-more-indian-asylum-seekers-to-us-are-speaking-a-different-tongue-immighrants-2679990-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "More and more Indian asylum seekers to US are speaking a different tonguePunjabi speakers formed 66% of all asylum-seekers from India from 2001 to 2022, according to an analysis by Johns Hopkins University researchers. However, the five years from 2017 to 2022 saw a 30% rise in asylum petitions being filed in the US by Hindi-speaking Indians. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ukraine-president-volodymyr-zelenskyy-ukraine-russia-peace-deal-not-possible-without-kyiv-2680589-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ukraine won't accept peace deal made behind our backs: ZelenskyyUkrainian president Volodymyr Zelenskyy said that his country will not accept any peace deal made without the involvement of Kyiv as US President Donald Trump held a phone call with Russian President Vladimir Putin on phone this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-arrest-mug-shot-photo-frame-oval-office-while-house-pm-modi-visit-2680556-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's infamous arrest mugshot seen in White House during PM Modi's visitThe image of the mugshot, in an ornate gold frame and hung outside the Oval Office, went viral on social media as Donald Trump greeted PM Modi before their meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-india-co-operative-bank-ex-manager-hitesh-pravinchand-mehta-arrested-in-fraud-case-2680600-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New India Co-operative Bank ex-manager arrested in Rs 122 crore fraud caseThe Economic Offences Wing arrested former General Manager of New India Co-operative Bank Limited, Hitesh Pravinchand Mehta, for allegedly embezzling Rs 122 crore from the bank during his tenure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-classics-india-vs-south-africa-semi-final-2002-2680598-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Champions Trophy Classics: India's miraculous turnaround vs SA in 2002 semisThe India vs South Africa match in the semi-finals of the Champions Trophy 2002 turned out to be a classic in Colombo. Down and out midway through the second innings, India made an incredible comeback for the ages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-donald-trump-meeting-agreements-trade-tariffs-american-experts-decode-takeaways-2680431-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Modi has pulled off magic in US, says Ashley Tellis: India Today ExclusiveModi-Trump meet: American foreign policy experts were unanimous in their verdict that the wide-ranging agreements, from defence equipment to trade, left no doubt that the US-India relationship was off to a very good start during Trump 2.0. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/which-walk-is-more-effective-for-weight-loss-empty-stomach-or-post-meal-stmp-2679595-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Walking on an empty stomach vs after a meal: Which one burns more fat?While many head out for a walk after hearty meals, others prefer walking on an empty stomach, thinking that it will burn more calories. Know it from experts on which one is more effective."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-ex-goa-mla-lavoo-mamledar-dies-auto-rickshaw-driver-slap-belagavi-2680557-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ex-Goa MLA dies shortly after auto-rickshaw driver slaps him in KarnatakaThe dispute escalated when the auto-rickshaw driver, identified as Mujahid Sanadi, slapped 68-year-old Lavoo Mamledar, a former Goa MLA in Karnataka's Belagavi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jannik-sinner-ban-doping-2680538-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "World No.1 Jannik Sinner banned for 3 months on doping chargesWorld No.1 Jannik Sinner has accepted a 3-month doping ban having tested positive for a banned substance in 2024. Sinner's ban comes weeks after his Australian Open victory where he beat Germany's Alexander Zverev in straight sets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-releases-three-more-israeli-hostages-gaza-ceasefire-deal-palestinian-prisoners-idf-2680513-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hamas frees 3 more hostages, including an American, under Gaza truce dealThree more Israeli hostages, including an American, were released by Hamas after 498 days, after the Palestinian group and Israel threatened each other with resuming fighting over alleged violation of a ceasefire deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/blinkit-delivery-agent-grwm-video-goes-viral-internet-says-his-sass-is-contagious-2680447-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Blinkit delivery agent's sassy style in GRWM video is off the charts. Watch videoA Blinkit delivery agent's GRWM video has gone viral on social media. The internet, impressed by his effortless confidence, says his sass is contagious. Scroll down to watch the video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-450-14-02-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mahabharat-actor-saurav-gurjar-threatens-ranveer-allahbadia-samay-raina-controversy-indias-got-latent-stmp-2680542-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": " No one can save him: Mahabharat actor threatens Ranveer Allahbadia Actor Saurav Gurjar openly threatened Ranveer Allahbadia over his recent remarks on India's Got Latent. In a video message, the actor requested the government to take strict action against the podcaster. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/revanth-reddy-pm-modi-remark-on-caste-birth-row-bjp-congress-hyderabad-2680471-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Revanth Reddy claims PM is 'legally converted backward class', BJP hits backTelangana Chief Minister Revanth Reddy claimed that Prime Minister Narendra Modi is from the \"legally converted Backward Class (BC)\" and not born in the BC category. The BJP hit back at Revanth Reddy for his remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/can-ozempic-curb-alcohol-cravings-new-study-2680146-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can Ozempic help curb alcohol cravings?A new study published in the journal JAMA Psychiatry found that semaglutide (sold under brand names like Ozempic and Wegovy) can help curb alcohol cravings. But the limitations of the study, such as the small sample size, can't be overlooked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-flight-indian-deportees-amritsar-donald-trump-immigration-crackdown-government-shackles-2680508-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US plane with 120 Indian migrants to land today; most from Punjab, HaryanaA second flight carrying 120 illegal Indian immigrants deported from the US will land at the Amritsar airport around 10 pm today, official sources said. A third plane with 157 deportees is expected to land on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vicky-kaushal-master-of-period-dramas-perfect-chameleon-chhaava-sam-bahadur-sardar-udham-2680500-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The Perfect Chameleon: What makes Vicky Kaushal master of period dramasVicky Kaushal has mastered period dramas, seamlessly embodying real-life figures like Udham Singh, Sam Manekshaw, and Chhatrapati Sambhaji Maharaj. His intense prep, physical transformations, and emotional depth make history compelling on screen, cementing his legacy in Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jay-z-reacts-after-rape-lawsuit-against-him-dropped-2680571-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Today is a victory: Jay-Z reacts after rape lawsuit against him droppedIn a significant legal victory, rapper Jay-Z has seen a sexual assault lawsuit against him dismissed. The rapper and entrepreneur expressed relief and satisfaction over the court's decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/photo/tovino-thomas-shares-pics-with-ms-dhoni-rohit-sharma-and-irfan-pathan-2680601-2025-02-15",
      "headline": "Tovino Thomas shares pics with MS Dhoni, Rohit Sharma and Irfan PathanIn a heartwarming moment, Malayalam actor Tovino Thomas met cricketers MS Dhoni, Rohit Sharma, and Irfan Pathan. He shared the pictures on social media on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kartik-aaryan-sreeleela-musical-drama-aashiqui-3-to-release-on-diwali-2680597-2025-02-15",
      "headline": "Kartik Aaryan, Sreeleela's romantic musical to release on Diwali, first look outKartik Aaryan and Sreeleela's highly anticipated romantic film is set to hit theatres on Diwali 2025. Kartik announced the release with an intriguing first-look video on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jay-z-reacts-after-rape-lawsuit-against-him-dropped-2680571-2025-02-15",
      "headline": "Today is a victory: Jay-Z reacts after rape lawsuit against him droppedIn a significant legal victory, rapper Jay-Z has seen a sexual assault lawsuit against him dismissed. The rapper and entrepreneur expressed relief and satisfaction over the court's decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ileana-dcruz-confirms-second-pregnancy-with-new-post-2680563-2025-02-15",
      "headline": "Ileana D'Cruz confirms second pregnancy with new postBollywood actor Ileana D'Cruz has confirmed her second pregnancy shortly after giving birth to her son, Koa Phoenix Dolan. She also shared a sneak peek into her midnight cravings with her fans."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-classics-india-vs-south-africa-semi-final-2002-2680598-2025-02-15",
      "headline": "Champions Trophy Classics: India's miraculous turnaround vs SA in 2002 semisThe India vs South Africa match in the semi-finals of the Champions Trophy 2002 turned out to be a classic in Colombo. Down and out midway through the second innings, India made an incredible comeback for the ages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rcb-rajat-patidar-captain-virat-kohli-kaif-2680584-2025-02-15",
      "headline": "Virat Kohli effectively runs RCB, wanted Rajat Patidar to be captain: KaifFormer India cricketer Mohammed Kaif feels that Rajat Patidar would not have become the RCB captain unless Virat Kohli wanted him to be. Kaif said that the decision was taken keeping franchise's future in mind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-2025-babar-azam-opener-pakistan-cricket-team-mohammad-amir-2680574-2025-02-15",
      "headline": "Babar should play at No.3: Amir not a fan of Pakistan star's new roleFormer Pakistan pacer Mohammad Amir feels that Babar Azam should be batting at the No.3 spot during the Champions Trophy. Babar was used as an opener during the tri-series ahead of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-harbhajan-singh-spotted-at-a-party-with-ms-dhoni-after-no-friendship-claims-2680573-2025-02-15",
      "headline": "Watch: Harbhajan Singh spotted at a party with Dhoni after 'no friendship' claimsFormer India spinner Harbhajan Singh was spotted with MS Dhoni months after claiming that the duo don't talk to each other."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-pep-guardiola-takes-bizarre-jibe-at-liverpool-cannot-do-100-points-already-2680567-2025-02-15",
      "headline": "Pep Guardiola takes bizarre jibe at Liverpool: Cannot do 100 points alreadyManchester City boss Pep Guardiola took a bizarre jibe at Liverpool, claiming that Arne Slot's team won't be able to reach the 100-point mark this season. Liverpool are leading the points table at the moment, while City are in 5th. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-david-lloyd-rues-best-bowler-japrit-bumrahs-absence-bumrah-injury-2680550-2025-02-15",
      "headline": "Former England cricketer rues 'best bowler' Bumrah's absence in Champions TrophyFormer England cricketer David Lloyd said that he would miss fast bowler Jasprit Bumrah's presence in the upcoming ICC Champions Trophy. Bumrah has been ruled out of the tournament due to a lower back injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-signs-autographs-for-fans-before-leaving-for-dubai-2680541-2025-02-15",
      "headline": "Watch: Virat Kohli signs autographs for fans before leaving for Champions TrophyStar India batter Virat Kohli was seen signing autographs for fans at the Mumbai airport before leaving for Dubai for the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jannik-sinner-ban-doping-2680538-2025-02-15",
      "headline": "World No.1 Jannik Sinner banned for 3 months on doping chargesWorld No.1 Jannik Sinner has accepted a 3-month doping ban having tested positive for a banned substance in 2024. Sinner's ban comes weeks after his Australian Open victory where he beat Germany's Alexander Zverev in straight sets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-team-india-first-batch-rohit-sharma-virat-kohli-gautam-gambhir-take-off-dubai-2680523-2025-02-15",
      "headline": "Watch: India's first batch takes off for Dubai ahead of Champions TrophyThe first batch of India Champions Trophy squad, including captain Rohit Sharma, Virat Kohli, Gautam Gambhir and other staff members took off for Dubai, where they will be playing all their group stage clashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-australia-team-analysis-2680519-2025-02-15",
      "headline": "Will Champions Trophy turn out to be Australia's worst-ever ICC tournament?An injury-stricken Australia fell to their worst defeat in Asia on Friday, February 14, losing Sri Lanka by 174 runs. Without their entire first choice fast bowling group, could the Champions Trophy turn out to be Australia's worst outing ever in ICC tournaments?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-david-lloyd-rues-best-bowler-japrit-bumrahs-absence-bumrah-injury-2680550-2025-02-15",
      "headline": "Former England cricketer rues 'best bowler' Bumrah's absence in Champions TrophyFormer England cricketer David Lloyd said that he would miss fast bowler Jasprit Bumrah's presence in the upcoming ICC Champions Trophy. Bumrah has been ruled out of the tournament due to a lower back injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-signs-autographs-for-fans-before-leaving-for-dubai-2680541-2025-02-15",
      "headline": "Watch: Virat Kohli signs autographs for fans before leaving for Champions TrophyStar India batter Virat Kohli was seen signing autographs for fans at the Mumbai airport before leaving for Dubai for the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jannik-sinner-ban-doping-2680538-2025-02-15",
      "headline": "World No.1 Jannik Sinner banned for 3 months on doping chargesWorld No.1 Jannik Sinner has accepted a 3-month doping ban having tested positive for a banned substance in 2024. Sinner's ban comes weeks after his Australian Open victory where he beat Germany's Alexander Zverev in straight sets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-team-india-first-batch-rohit-sharma-virat-kohli-gautam-gambhir-take-off-dubai-2680523-2025-02-15",
      "headline": "Watch: India's first batch takes off for Dubai ahead of Champions TrophyThe first batch of India Champions Trophy squad, including captain Rohit Sharma, Virat Kohli, Gautam Gambhir and other staff members took off for Dubai, where they will be playing all their group stage clashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-australia-team-analysis-2680519-2025-02-15",
      "headline": "Will Champions Trophy turn out to be Australia's worst-ever ICC tournament?An injury-stricken Australia fell to their worst defeat in Asia on Friday, February 14, losing Sri Lanka by 174 runs. Without their entire first choice fast bowling group, could the Champions Trophy turn out to be Australia's worst outing ever in ICC tournaments?\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}