{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-bull-run-sensex-reclaims-78000-after-1100-point-rally-nifty-ends-above-23600-2698202-2025-03-24",
      "headline": "Sensex reclaims 78,000 after 1,100-point rally, Nifty ends above 23,600The S&P BSE Sensex surged 1,078.87 points to close at 77,984.38, while the NSE Nifty50 added 323.55 points to end at 23,673.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-united-states-exclude-sector-specific-reciprocal-tariffs-scale-back-april-2-2698189-2025-03-24",
      "headline": "US planning to scale back April 2 reciprocal tariffs for specific sectors: ReportsUS President Donald Trump's administration may exclude a set of sector-specific tariffs while applying reciprocal levies on April 2, Bloomberg News and the Wall Street Journal reported, citing officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/japanese-stock-market-zensho-holdings-co-share-fall-unexpected-rodent-incident-report-2698187-2025-03-24",
      "headline": "A rat did it: Japanese stock tanks after unexpected rodent incidentThe stock of the Japanese firm Zensho Holdings Co fell 7.1% in one of its biggest declines since February 13 due to an incident involving a rodent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-zerodha-founder-and-ceo-nithin-kamath-left-a-lasting-impression-on-a-customer-they-won-my-trust-for-life-2698143-2025-03-24",
      "headline": "How Zerodha's Nithin Kamath left a lasting impression on a customerNithin Kamath not only acknowledged the customer's concern but also took immediate action. Zerodha's team quickly looked into the compliance issue and assured the customer that they were working on resolving it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-dalal-street-green-flags-what-investors-should-know-2698127-2025-03-24",
      "headline": "Red flags turn green on Dalal Street: Will the stock market bull run continue?Stock market rally today: With today's rebound, both indices have nearly erased most of the losses suffered in the first two months of 2025. It may be noted that the total market capitalisation of all BSE-listed firms swelled by over Rs 5 lakh crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/volkswagen-tax-case-why-government-doesnt-want-to-quash-14-billion-demand-2698086-2025-03-24",
      "headline": "Volkswagen tax case: Why government stands firm on $1.4 billion demandThe government's tax demand is against Skoda Auto Volkswagen India, which is accused of wrongly classifying imported parts for some Audi, VW and Skoda cars to avoid paying higher import taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bull-run-continues-on-dalal-street-as-sensex-surges-1000-points-2698085-2025-03-24",
      "headline": "Sensex surges 1,000 points as FIIs chase Dalal Street rallyBull run on Dalal Street: The S&P BSE Senses added 1,003.06 points to 77,908.57, while the NSE Nifty50 gained 286.95 points to 23,637.35 as of 12:37 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-middle-class-under-pressure-cautions-saurabh-mukherjea-what-are-its-key-challenges-2698060-2025-03-24",
      "headline": "Is India's middle class losing momentum? See what this expert saysThe rise of automation is a growing threat to jobs. Machines are replacing traditional roles in both factories and offices. The next phase of automation, powered by generative AI, is expected to accelerate job displacement across multiple sectors, Saurabh Mukherjea said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fii-selling-stop-return-to-dalal-street-why-comeback-on-sensex-nifty-key-reasons-2698064-2025-03-24",
      "headline": "Why foreign investors are rushing back to bet on Dalal Street FIIs returning to Dalal Street has given a sharp boost to domestic investors, with the main indices extending gains for the sixth consecutive session. The S&P BSE Sensex was up 950 points and Nifty rose 273 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-gainers-loser-stocks-on-sensex-and-nifty-stock-market-today-titan-kotak-bank-bhel-infosys-ntpc-lt-2698016-2025-03-24",
      "headline": "Stock market rally: Check top gainers and losers on Dalal StreetSensex surged over 800 points to surpass the 77,700 mark, and Nifty jumped over 200 points to trade above the 23,500 level as Dalal Street continued its winning streak.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-gains-dalal-street-no-impact-of-reciprocal-tariffs-explained-2698012-2025-03-24",
      "headline": "Why Trump's tariffs aren't spooking Dalal Street investors anymoreForeign investors are back, and markets are rallying. But with Trump's reciprocal tariffs set for April 2, will the optimism last, or is another sell-off on the way?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-stock-market-rising-today-sensex-jumps-500-points-nifty-up-key-reasons-fii-selling-stop-good-marco-expert-view-2697999-2025-03-24",
      "headline": "Sensex jumps over 1,000 points, extends rally: 5 things to knowStock Market Today: As of 11:06 am, the S&P BSE Sensex went up by 1000.10 points to reach 77,905.61. At the same time, the NSE Nifty50 increased by 289.85 points to 23,640.25."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zeenat-aman-love-for-accessories-as-she-gives-a-peek-into-her-closet-2698161-2025-03-24",
      "headline": "Zeenat Aman shares her love for accessories as she gives a peek into her closetVeteran actor Zeenat Aman shared her love for accessories, revealing her preference for boutiques over high street brands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-pop-group-newjeans-defy-court-order-perform-as-njz-before-announcing-hiatus-2698210-2025-03-24",
      "headline": "K-pop group NewJeans defy court order, perform as NJZ before announcing hiatusIn a surprising move, K-pop group NewJeans performed under the name NJZ at ComplexCon Hong Kong, defying a South Korean court ruling. The group debuted a new song and announced a temporary pause in activities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pranav-mohanlal-teams-up-with-bramayugam-director-rahul-sadasivan-for-his-next-2698209-2025-03-24",
      "headline": "Pranav Mohanlal teams up with Bramayugam director Rahul Sadasivan for his nextMalayalam actor Pranav Mohanlal has teamed up with director Rahul Sadasivan for his next film. He began filming on March 24. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaya-bachchan-defends-kunal-kamra-controversy-freedom-of-speech-eknath-shinde-2698203-2025-03-24",
      "headline": "Jaya Bachchan defends Kunal Kamra amid controversy: Where is freedom of speech?Actor and SP MP Jaya Bachchan reacted to the Kunal Kamra controversy over his comments on Maharashtra Deputy Chief Minister, Eknath Shinde. The actor questioned the limits placed on freedom of expression in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zakir-khan-standup-special-delulu-express-trailer-prime-video-2698204-2025-03-24",
      "headline": "Delulu Express trailer: Zakir Khan returns with a stand-up comedy specialThe trailer of Zakir Khan's new stand-up special, Delulu Express, is out. It promises a laughter riot and will premiere on Prime Video on March 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-visits-baps-temple-abu-dhabi-offers-prayers-2698183-2025-03-24",
      "headline": "Allu Arjun visits BAPS temple in Abu Dhabi, offers prayers. WatchAllu Arjun recently visited the BAPS temple in Abu Dhabi. A video of the Pushpa actor offering prayers at the temple has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-breathtaking-third-episode-netflix-stephen-graham-owen-cooper-2698174-2025-03-24",
      "headline": "In praise of Adolescence's breathtaking third episode: A perfect stormStephen Graham and Jack Thorne's Adolescence is a masterclass in filmmaking. However, its pivotal third episode deserves a special appreciation note. The show, starring Owen Cooper in the lead, is streaming on Netflix. (Spoilers ahead). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rhea-chakraborty-visits-siddhivinayak-after-closure-in-sushant-singh-rajput-case-2698177-2025-03-24",
      "headline": "Rhea Chakraborty visits Siddhivinayak after closure in Sushant Singh Rajput caseActor Rhea Chakraborty and her family visited Mumbai's famous Siddhivinayak temple on Monday after her name was cleared in the closure report filed by the CBI in the Sushant Singh Rajput death case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/amul-shoutout-to-adolescence-with-cute-doodle-2698173-2025-03-24",
      "headline": "Making sense of Adolescence: Amul's tribute to British show taking over the worldThe latest Amul doodle gave a special shoutout to the Netflix show Adolescence. The British psychological thriller has been receiving rave reviews since its release on March 14.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-on-concerned-fans-saying-he-is-getting-old-have-still-got-it-in-me-2698160-2025-03-24",
      "headline": "Salman Khan on concerned fans saying he's getting old: Have still got it in meActor Salman Khan appeared during the trailer launch of his film 'Sikandar' and shushed those who speculated about his health and age after a few photos of his clean-shaven look went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-branded-arrogant-asking-for-scripts-lost-many-movies-2698154-2025-03-24",
      "headline": "Actor Yash was initially branded 'arrogant' for asking scripts: Lost many moviesActor Yash said that he was branded arrogant in the initial days of his career when he asked directors to share the scripts. He spoke about this at the trailer launch of the Kannada film, Manada Kadalu, in Bengaluru."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-trailer-sunny-deol-randeep-hooda-gopichand-malineni-2698150-2025-03-24",
      "headline": "Jaat trailer: Sunny Deol and his 'dhaai kilo ka haath' promise to impress SouthThe trailer of Sunny Deol's film Jaat, featuring Randeep Hooda as the antagonist, is now out. It promises action-packed sequences that will impress the Pan India audience. Directed by Gopichand Malineni, the film is set to release on April 10."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/emraan-hashmi-announces-awarapan-2-release-date-on-his-46th-birthday-2698148-2025-03-24",
      "headline": "Emraan Hashmi announces Awarapan 2 release date on his 46th birthdayActor Emraan Hashmi announced his most-awaited film, Awarapan 2, on his 46th birthday. The film is set to release in April next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ajay-devgn-raid-2-release-may-after-facing-multiple-delays-vaani-kapoor-riteish-deshmukh-2698136-2025-03-24",
      "headline": "Ajay Devgn's Raid 2 to release in May after multiple delaysAjay Devgn's Raid 2 is set to release in theatres on May 1. The film also stars Vaani Kapoor and Riteish Deshmukh in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anirudh-ravichander-reveals-interesting-detail-about-ms-dhoni-influence-in-rajnikanth-song-hukum-2698081-2025-03-24",
      "headline": "MS Dhoni influence in Rajnikanth song? Anirudh Ravichander reveals interesting detailAnirudh Ravichander wanted the Jailer song Hukum to resonate with both Rajinikanth and Mahendra Singh Dhoni. The music composer also shared his long-standing dream of performing at Chennai's Chepauk Stadium.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prateik-smita-patil-wife-priya-banerjee-says-raj-babbar-never-there-for-actor-2698133-2025-03-24",
      "headline": "Prateik Smita Patil drops Babbar, wife Priya says 'that family was never there'Prateik Babbar has dropped his father's surname, adopted his mother's name and will be known as Prateik Smita Patil. His wife, Priya Banerjee, also defended not calling the Babbars to their wedding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-expresses-happiness-as-her-hair-grows-after-chemotherapy-2698072-2025-03-24",
      "headline": "Hina Khan expresses happiness as her hair grows after chemotherapyTelevision star Hina Khan, who has been diagnosed with cancer, recently debuted her new look during an awards ceremony. She expressed her happiness at the regrowth of her hair post-chemotherapy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bb-kannada-contestants-rajat-kishan-vinay-gowda-legal-trouble-over-posing-with-sickle-weapon-on-social-media-2698055-2025-03-24",
      "headline": "Case against Bigg Boss Kannada contestants for posing with arms on social mediaAn FIR was filed against two past contestants of reality show Bigg Boss Kannada for posing with a weapon, raising concerns for public safety. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-chapter-2-teaser-akshay-kumar-jallianwala-bagh-massacre-2698045-2025-03-24",
      "headline": "Kesari 2 teaser: Akshay Kumar promises powerful retelling of Jallianwala BaghThe teaser for Akshay Kumar's Kesari Chapter 2: The Untold Story of Jallianwala Bagh was released on Monday. It explores the events following the massacre, with Akshay Kumar portraying Sir C Sankaran Nair.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/bail-shiv-sena-workers-vandalised-mumbai-habitat-studio-kunal-kamra-eknath-shinde-controversy-2698215-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bail to 12 Sena workers who ransacked studio where Kunal Kamra performedA Mumbai court granted bail to 12 Shiv Sena (Shinde faction) workers arrested for vandalising Habitat Studio after Kunal Kamra's parody song. The case has sparked political controversy, with municipal authorities later demolishing parts of the venue.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/salary-daily-allowance-pension-hike-of-mps-parliament-april-2023-2698249-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre notifies 24% hike in salaries, pensions for MPs and ex-ParliamentariansSitting MPs will now receive a monthly salary of Rs 1.24 lakh as against Rs 1 lakh they received earlier. The daily allowances have been increased from Rs 2,000 to Rs 2,500."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dk-shivakumar-bjp-spar-over-constitution-change-remarks-2698221-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DK Shivakumar says his 'Constitution change' remark misquoted: What's the row?As BJP claims DK Shivakumar hinted at changing the Constitution for religion-based reservations, the Karnataka Deputy Chief Minister vehemently denied the charge. He called it the Centre's political ploy to take the focus away from more pressing matters. Here's what has happened so far.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kunal-kamra-row-habitat-studio-demolition-bmc-officials-eknath-shinde-sena-maharashtra-2698156-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Demolition begins at Mumbai studio where Kunal Kamra mocked Eknath ShindeThe controversy erupted after Kamra, known for his sharp criticism of the ruling dispensation, used a parody of a popular Hindi song to describe Shinde's 2022 rebellion against his former boss, Uddhav Thackeray."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/what-makes-revanth-reddy-and-kt-rama-rao-enemies-in-hyderabad-frenemies-in-chennai-2698164-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What makes Revanth Reddy and KT Rama Rao enemies in Hyderabad, frenemies in ChennaiRevanth Reddy and KT Rama Rao, who are at each other's throats in Hyderabad almost every day, found themselves singing the same tune in Chennai. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/chennai/story/rippling-0xppl-founder-prasanna-sankar-x-twitter-thread-harassed-by-wife-chennai-police-son-custody-post-divorce-2697961-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tech entrepreneur alleges harassment by wife, Chennai cops over child custodyThe founder of the software company Rippling and tech entrepreneur Prasanna Sankar made serious allegations against his estranged wife, amid their divorce and custody battle. While he claimed harassment by the police, the wife accused him of financial and sexual misconduct."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/condemnation-for-kunal-kamra-not-vandalism-shinde-senas-selective-criticism-raises-brows-2698149-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Condemnation for Kamra, not vandalism? Mahayuti's selective criticism called outKunal Kamra's controversial joke about Eknath Shinde drew condemnation from party leaders, but the violent rampage at Habitat Comedy Club by Shinde Sena workers has largely gone unaddressed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-csk-vs-mi-chennai-super-kings-vs-mumbai-indians-2697888-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Rohit Sharma's Champions Trophy method should take a backseat in IPL 2025Mumbai Indians captain Rohit Sharma was dismissed for a four-ball duck in the opening game of the Indian Premier League 2025 (IPL 2025) against Chennai Super Kings (CSK). After the game, former cricketers Krishnamachari Srikkanth and Shane Watson had some suggestions for Rohit on his approach in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-breathtaking-third-episode-netflix-stephen-graham-owen-cooper-2698174-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "In praise of Adolescence's breathtaking third episode: A perfect stormStephen Graham and Jack Thorne's Adolescence is a masterclass in filmmaking. However, its pivotal third episode deserves a special appreciation note. The show, starring Owen Cooper in the lead, is streaming on Netflix. (Spoilers ahead). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/comedian-samay-raina-to-record-statement-in-indias-got-latent-row-over-month-after-cyber-cell-summons-2698200-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Samay Raina to record statement in Latent row over month after cyber cell summonsRaina, who had been travelling outside India, had requested the Cyber Cell to record his statement via video conferencing, which the agency turned down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-bull-run-sensex-reclaims-78000-after-1100-point-rally-nifty-ends-above-23600-2698202-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex reclaims 78,000 after 1,100-point rally, Nifty ends above 23,600The S&P BSE Sensex surged 1,078.87 points to close at 77,984.38, while the NSE Nifty50 added 323.55 points to end at 23,673.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-f-1-visa-approval-rejection-american-university-indian-students-decreasing-donald-trump-decade-data-biden-2698122-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US visas for Indian students shrinking, but don't blame Trump yetWhile US President Donald Trump's return to the White House has sparked fears of stricter student visa rules and immigration policies, data shows that the US has been reducing the number of F-1 student visas over the last two years. The number of student visas approved for Indians in FY 2024 dipped by 34% when compared to FY 2023."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaya-bachchan-defends-kunal-kamra-controversy-freedom-of-speech-eknath-shinde-2698203-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jaya Bachchan defends Kunal Kamra amid controversy: Where is freedom of speech?Actor and SP MP Jaya Bachchan reacted to the Kunal Kamra controversy over his comments on Maharashtra Deputy Chief Minister, Eknath Shinde. The actor questioned the limits placed on freedom of expression in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/uttar-pradesh-government-to-build-indias-first-night-safari-in-lucknow-2698205-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uttar Pradesh government to build India's first night safari in LucknowWhen the city sleeps, the wild awakens. Lucknow's night safari promises an after-dark adventure. Moonlit trails, roaring predators, and eco-tourism—India's first night safari is set to transform Lucknow. All you need to know.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-high-court-judge-yashwant-varma-duties-withdrawn-cash-recovery-row-2698069-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi High Court derosters Justice Varma after cash recovered from his homeDelhi HC judge Yashwant Varma's judicial duties were withdrawn after cash was found at his residence following a fire incident. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/chennai/story/prasanna-sankar-sankaranarayan-rippling-cofounder-0xppl-founder-tech-entrepreneur-profile-2698094-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Prasanna Sankar, Rippling co-founder engaged in custody battle with wife?Tech entrepreneur Prasanna Sankar accused his estranged wife of harassing him amid an acrimonious divorce and custody battle. In a series of tweets, he described the events that followed after he found out that his wife was having an affair. But who is his tech entrepreneur?  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/grok-says-this-and-grok-says-that-but-you-should-never-believe-a-scholastic-parrot-2698089-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Grok says this and Grok says that, but you should never believe a scholastic parrotElon Musk's Grok AI is in the news in India because it is saying all things unsayable, including addressing Indians with a language that will put a Delhi bro to shame. But you should not believe everything Grok says, or everything that AI systems like ChatGPT tell you. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uddhav-thackeray-backs-comedian-kunal-kamra-controversy-gaddar-traitor-jibe-eknath-shinde-joke-habitat-shiv-sena-vandalism-2698139-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gaddar is a gaddar: Uddhav Thackeray backs Kunal Kamra over Eknath Shinde jokeShiv Sena (UBT) chief Uddhav Thackeray extended full support to comic Kunal Kamra amid a controversy over the latter's \"traitor\" dig at Maharashtra Deputy Chief Minister Eknath Shinde in a joke."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/12-year-old-us-boy-builds-nuclear-fusion-reactor-gets-visit-from-fbi-2697413-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "12-year-old builds nuclear fusion reactor, gets visit from FBI12-year-old Jackson Oswalt, from Memphis, US, has built a nuclear fusion reactor in his bedroom and made a Guinness World Record for the youngest person to achieve fusion. Later on, he got a visit from the FBI to make sure all was good. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/insult-or-freedom-of-speech-sena-vs-sena-over-kunal-kamras-eknath-shinde-joke-2698121-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Insult or freedom of speech? Sena vs Sena over Kunal Kamra's Eknath Shinde jokeThe Shinde Camp slammed Kunal Kamra's remarks on Eknath Shinde as \"insult\" while the leaders of the Uddhav Thackeray camp extended support to the comedian."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/amul-shoutout-to-adolescence-with-cute-doodle-2698173-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Making sense of Adolescence: Amul's tribute to British show taking over the worldThe latest Amul doodle gave a special shoutout to the Netflix show Adolescence. The British psychological thriller has been receiving rave reviews since its release on March 14.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rhea-chakraborty-visits-siddhivinayak-after-closure-in-sushant-singh-rajput-case-2698177-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rhea Chakraborty visits Siddhivinayak after closure in Sushant Singh Rajput caseActor Rhea Chakraborty and her family visited Mumbai's famous Siddhivinayak temple on Monday after her name was cleared in the closure report filed by the CBI in the Sushant Singh Rajput death case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-zerodha-founder-and-ceo-nithin-kamath-left-a-lasting-impression-on-a-customer-they-won-my-trust-for-life-2698143-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Zerodha's Nithin Kamath left a lasting impression on a customerNithin Kamath not only acknowledged the customer's concern but also took immediate action. Zerodha's team quickly looked into the compliance issue and assured the customer that they were working on resolving it. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kunal-kamra-controversy-ajit-pawar-reaction-eknath-shinde-joke-habitat-vandalism-sena-workers-2698023-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Won't tolerate this, Kunal Kamra should apologise: Devendra Fadnavis on joke rowMaharashtra Chief Minister Devendra Fadnavis slammed stand-up comedian Kunal Kamra amid a row over his joke on Eknath Shinde, saying no insults or defamatory remarks against leaders will be tolerated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/video/yash-arrives-in-mumbai-with-wife-radhika-ahead-of-toxic-post-production-work-2698242-2025-03-24",
      "headline": "Video: Yash arrives in Mumbai with wife Radhika ahead of Toxic post-production workActor Yash arrived in Mumbai on March 24 with wife Radhika Pandit. This came ahead of the actor's shooting for upcoming film, Ramayan. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/sunny-deol-randeep-hooda-vineet-kumar-singh-jaat-trailer-launch-2698239-2025-03-24",
      "headline": "Sunny Deol holds Randeep Hooda, Vineet Kumar Singh close at Jaat trailer launchThe trailer of Sunny Deol's upcoming film, Jaat, was released today. During the launch, Deol posed with Randeep Hooda and Vineet Kumar Singh, as well as director Gopichand Malineni. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zeenat-aman-love-for-accessories-as-she-gives-a-peek-into-her-closet-2698161-2025-03-24",
      "headline": "Zeenat Aman shares her love for accessories as she gives a peek into her closetVeteran actor Zeenat Aman shared her love for accessories, revealing her preference for boutiques over high street brands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pranav-mohanlal-teams-up-with-bramayugam-director-rahul-sadasivan-for-his-next-2698209-2025-03-24",
      "headline": "Pranav Mohanlal teams up with Bramayugam director Rahul Sadasivan for his nextMalayalam actor Pranav Mohanlal has teamed up with director Rahul Sadasivan for his next film. He began filming on March 24. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-rohit-sharma-poor-start-kane-williamson-2698247-2025-03-24",
      "headline": "Rohit Sharma's poor IPL 2025 start played down by Kane Williamson: Just 1st matchRohit Sharma's poor start to IPL 2025 has been played down by Kane Williamson. The Mumbai opener was dismissed for a 4-ball duck against Chennai Super Kings in the first El Clasico of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-touchdown-chennai-csk-virat-kohli-watch-2698237-2025-03-24",
      "headline": "Watch: Virat Kohli, RCB stars touchdown in Chennai ahead of CSK clashRCB, led by skipper Rajat Patidar, and star batter Virat Kohli arrived in Chennai ahead of their highly anticipated IPL 2025 clash against arch-rivals CSK on March 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-deepak-chahar-kattappa-sister-reference-2698213-2025-03-24",
      "headline": "IPL 2025: Deepak Chahar's sister makes 'Kattappa' reference in MI vs CSKDeepak Chahar's MI debut sparked social media frenzy, intensified by sister Malti's 'Kattappa' reference, as he impressed against his former team CSK in a high-profile IPL 2025 clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-vignesh-puthur-mumbai-indians-best-bowler-award-nita-ambani-2698188-2025-03-24",
      "headline": "CSK vs MI: Vignesh Puthur rewarded by Nita Ambani after sensational debutAfter his fantastic performance with the ball, Mumbai Indians' Vignesh Puthur received a special award from Nita Ambani on Sunday, March 23. Vignesh was the star with the ball for MI despite their loss to CSK. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-banned-india-commentators-ipl-2025-2698179-2025-03-24",
      "headline": "Irfan Pathan banned? Other instances of Indian commentators facing the heatFormer India all-rounder Irfan Pathan isn't a part of the commentary panel for IPL 2025 after being excluded due to dissatisfaction amongst broadcasters over bringing personal grudges into his commentary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-csk-vs-mi-rachin-ravindra-press-conference-chennai-2698172-2025-03-24",
      "headline": "An honour to open for CSK knowing the history: Rachin Ravindra after MI winRachin Ravindra said it is an honour to open for the Chennai Super Kings in the IPL knowing the history connected with it. Rachin scored a fine fifty to help CSK defeat their arch-rivals, Mumbai Indians, by four wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-central-contracts-smriti-mandhana-india-women-harleen-deol-2698132-2025-03-24",
      "headline": "BCCI announces central contract for India Women, no Harleen DeolHarleen Deol is the major omission from India Women's central contracts for the 2024-25 announced by the BCCI on Monday. Shreyanka Patil and Titas Sadhu are amongst the new entrants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-ball-tampering-video-viral-chennai-2698124-2025-03-24",
      "headline": "Ball tampering in El Clasico? Fans accuse CSK of malpractice as video goes viralA section of fans is accusing the Chennai Super Kings of tampering with the ball during their clash against Mumbai Indians at Chepauk on Sunday, March 23. CSK won the match to start their campaign in fine fashion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tamim-iqbal-bangladesh-cricket-dhaka-premier-league-chest-pain-2698070-2025-03-24",
      "headline": "Tamim Iqbal admitted to hospital in critical condition after chest pain in Dhaka leagueTamim Iqbal has been rushed to the hospital in critical condition after he suffered from chest pain during a Dhaka Premier League match between Mohammedan Sporting Club and Shinepukur Cricket Club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-ms-dhoni-performance-navjot-singh-sidhu-2698068-2025-03-24",
      "headline": "Fifty at 50: MS Dhoni tipped to achieve incredible IPL feat by Navjot Singh SidhuNavjot Singh Sidhu has claimed that MS Dhoni could achieve an incredible feat in the IPL by scoring a fifty at the age of 50. Dhoni started his 18th season of the IPL with a win on Sunday, March 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-axar-patel-delhi-capitals-lsg-mantra-2698061-2025-03-24",
      "headline": "Keep it simple: Axar Patel on Delhi Capitals' mantra before clash vs LSGIPL 2025: Axar Patel said that Delhi Capitals would look to keep things simple when they face Rishabh Pant's Lucknow Super Giants (LSG) on Monday in Visakhapatnam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-central-contracts-smriti-mandhana-india-women-harleen-deol-2698132-2025-03-24",
      "headline": "BCCI announces central contract for India Women, no Harleen DeolHarleen Deol is the major omission from India Women's central contracts for the 2024-25 announced by the BCCI on Monday. Shreyanka Patil and Titas Sadhu are amongst the new entrants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-ball-tampering-video-viral-chennai-2698124-2025-03-24",
      "headline": "Ball tampering in El Clasico? Fans accuse CSK of malpractice as video goes viralA section of fans is accusing the Chennai Super Kings of tampering with the ball during their clash against Mumbai Indians at Chepauk on Sunday, March 23. CSK won the match to start their campaign in fine fashion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tamim-iqbal-bangladesh-cricket-dhaka-premier-league-chest-pain-2698070-2025-03-24",
      "headline": "Tamim Iqbal admitted to hospital in critical condition after chest pain in Dhaka leagueTamim Iqbal has been rushed to the hospital in critical condition after he suffered from chest pain during a Dhaka Premier League match between Mohammedan Sporting Club and Shinepukur Cricket Club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-ms-dhoni-performance-navjot-singh-sidhu-2698068-2025-03-24",
      "headline": "Fifty at 50: MS Dhoni tipped to achieve incredible IPL feat by Navjot Singh SidhuNavjot Singh Sidhu has claimed that MS Dhoni could achieve an incredible feat in the IPL by scoring a fifty at the age of 50. Dhoni started his 18th season of the IPL with a win on Sunday, March 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-axar-patel-delhi-capitals-lsg-mantra-2698061-2025-03-24",
      "headline": "Keep it simple: Axar Patel on Delhi Capitals' mantra before clash vs LSGIPL 2025: Axar Patel said that Delhi Capitals would look to keep things simple when they face Rishabh Pant's Lucknow Super Giants (LSG) on Monday in Visakhapatnam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-mayank-yadav-injury-update-justin-langer-press-conference-2698037-2025-03-24",
      "headline": "IPL 2025: LSG pacer Mayank Yadav's recovery faces setback with fresh injuryJustin Langer revealed that Mayank Yadav has faced a setback in his recovery with a fresh injury. Mayank injured his toe while rehabbing and his return date has been pushed back further. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-royal-challengers-bengaluru-green-jersey-kolkata-2698026-2025-03-24",
      "headline": "Royal Challengers Bengaluru launch new green jersey in KolkataIPL 2025: Royal Challengers Bangalore will don a green jersey during one of their matches to highlight the importance of environmental protection and promote the message of greenery.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-match-pitch-report-weather-forecast-aca-international-cricket-stadium-vizag-2698018-2025-03-24",
      "headline": "DC vs LSG, pitch, weather report IPL 2025: Will rain affect Vizag clash?Delhi Capitals and Lucknow Super Giants are all set to square off in an intense North Indian derby in Vizag. How will the pitch and weather behave on Monday, March 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/miami-open-2025-novak-djokovic-mirra-andreeva-alexandra-eala-2698013-2025-03-24",
      "headline": "Novak Djokovic scripts history, Mirra Andreeva's fairytale run endsMiami Open 2025: Former World No.1 Novak Djokovic beat Camilo Ugo Carabelli to break Rafael Nadal's record for most matches won in ATP 1000 Masters events.  Mirra Andreeva lost to Amanda Anisimova while Alexandra Eala beat Madison Keys. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-csk-vs-mi-chennai-super-kings-vs-mumbai-indians-2697888-2025-03-24",
      "headline": "Why Rohit Sharma's Champions Trophy method should take a backseat in IPL 2025Mumbai Indians captain Rohit Sharma was dismissed for a four-ball duck in the opening game of the Indian Premier League 2025 (IPL 2025) against Chennai Super Kings (CSK). After the game, former cricketers Krishnamachari Srikkanth and Shane Watson had some suggestions for Rohit on his approach in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-wicketkeeping-csk-vs-mi-chennai-super-kings-2697998-2025-03-24",
      "headline": "Dhoni on IPL wicketkeeping heroics: I look like a rice sack falling from truckMS Dhoni played down his wicketkeeping heroics in recent times, saying that his focus is to remain a safe person behind the stumps. Dhoni continues to show incredible skills behind the stumps despite being 43. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rachin-ravindra-ms-dhoni-csk-vs-mi-chepauk-2697991-2025-03-24",
      "headline": "Hard to ignore the excitement: Rachin Ravindra on batting with DhoniIPL 2025, CSK vs MI: Rachin Ravindra was amazed by the fan-following for MS Dhoni when the Chepauk crowd erupted after the Chennai Super Kings veteran went out to bat against Mumbai Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dc-vs-lsg-match-preview-ipl-2025-delhi-capitals-vs-lucknow-super-giants-indian-premier-league-rishabh-pant-2697974-2025-03-24",
      "headline": "Rishabh Pant meets familiar foes as injury-hit Lucknow face DelhiIPL 2025, Delhi Capitals vs Lucknow Super Giants Match Preview: Rishabh Pant's LSG have their task cut out as they face DC in Vizag on Monday, March 24. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-csk-vs-mi-chennai-super-kings-vs-mumbai-indians-2697888-2025-03-24",
      "headline": "Why Rohit Sharma's Champions Trophy method should take a backseat in IPL 2025Mumbai Indians captain Rohit Sharma was dismissed for a four-ball duck in the opening game of the Indian Premier League 2025 (IPL 2025) against Chennai Super Kings (CSK). After the game, former cricketers Krishnamachari Srikkanth and Shane Watson had some suggestions for Rohit on his approach in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-wicketkeeping-csk-vs-mi-chennai-super-kings-2697998-2025-03-24",
      "headline": "Dhoni on IPL wicketkeeping heroics: I look like a rice sack falling from truckMS Dhoni played down his wicketkeeping heroics in recent times, saying that his focus is to remain a safe person behind the stumps. Dhoni continues to show incredible skills behind the stumps despite being 43. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rachin-ravindra-ms-dhoni-csk-vs-mi-chepauk-2697991-2025-03-24",
      "headline": "Hard to ignore the excitement: Rachin Ravindra on batting with DhoniIPL 2025, CSK vs MI: Rachin Ravindra was amazed by the fan-following for MS Dhoni when the Chepauk crowd erupted after the Chennai Super Kings veteran went out to bat against Mumbai Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dc-vs-lsg-match-preview-ipl-2025-delhi-capitals-vs-lucknow-super-giants-indian-premier-league-rishabh-pant-2697974-2025-03-24",
      "headline": "Rishabh Pant meets familiar foes as injury-hit Lucknow face DelhiIPL 2025, Delhi Capitals vs Lucknow Super Giants Match Preview: Rishabh Pant's LSG have their task cut out as they face DC in Vizag on Monday, March 24. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dc-vs-lsg-playing-11-ipl-2025-team-prediction-kl-rahul-rishabh-pant-2697969-2025-03-24",
      "headline": "DC vs LSG Playing 11 Prediction: Will KL Rahul play a part in Vizag opener?DC vs LSG Playing 11, Delhi Capitals vs Lucknow Super Giants Prediction: Delhi Capitals and Lucknow Super Giants are all set to lock horns and all eyes will be on Rishabh Pant and KL Rahul on Monday, March 24. But will Rahul be ready in time for the contest in Vizag?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/tiger-woods-donald-trump-relationship-golf-vanessa-2697938-2025-03-24",
      "headline": "Tiger Woods reveals he is dating Donald Trump's ex-daughter-in-lawTiger Woods, the 82-time TOUR winner, confirmed his relationship with Donald Trump's ex-daughter-in-law Vanessa Trump after posting a couple of pictures on his social media account. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vignesh-puthur-paras-mhambrey-csk-vs-mi-2697926-2025-03-24",
      "headline": "Vignesh Puthur kept his nerves, handled pressure brilliantly: MI bowling coachIPL 2025: MI bowling coach Paras Mhambrey lauded Vignesh Puthur after the left-arm wrist spinner picked up three wickets against Chennai Super Kings on Sunday at Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishan-kishan-abhishek-sharma-srh-vs-rr-century-2697923-2025-03-24",
      "headline": "Hit every ball? Ishan Kishan recalls funny phone call with Abhishek SharmaIshan Kishan made a sensational comeback in the Indian Premier League with the SunRisers Hyderabad on Sunday, March 23. At the press conference, Kishan briefly spoke about his struggles and how clarity from SRH helped him perform well in his first IPL 2025 game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-text-message-virat-kohli-refuses-details-bond-2697911-2025-03-24",
      "headline": "MS Dhoni refuses to disclose details of his text to Virat Kohli, stresses trustIPL 2025: In a recent interview, MS Dhoni opened up about his friendship with Virat Kohli, recalling how their bond grew over time. However, Dhoni declined to reveal details of a text message he sent to Kohli during the latter's lean patch in international cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-stumping-video-noor-ahmad-ruturaj-gaikwad-2697908-2025-03-24",
      "headline": "Noor thanks Dhoni for incredible CSK debut, Gaikwad spills 'stumping' secretNoor Ahmad spun a web around the Mumbai Indians batting line-up, picking up 4 wickets on his CSK debut. After the win, Noor thanked MS Dhoni for guiding him throughout the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-202-csk-vs-mi-ms-dhoni-vignesh-puthur-kerala-spinner-video-2697907-2025-03-24",
      "headline": "Watch: MS Dhoni applauds Kerala spinner Vignesh Puthur in heartwarming momentIPL 2025, CSK vs MI: 24-year-old Kerala spinner, Vignesh Puthur, was starstruck when he had the opportunity to interact with MS Dhoni on Sunday in Chennai. Vignesh made a fine debut for MI, taking three wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-deepak-chahar-hits-bat-csk-vs-mi-chennai-2697904-2025-03-24",
      "headline": "Watch: MS Dhoni playfully hits Deepak Chahar with bat in post-match banterIPL 2025, CSK vs MI: MS Dhoni was in the mood to have some fun as he playfully hit Deepak Chahar with his bat after Chennai Super Kings defeated Mumbai Indians by 4 wickets on Sunday, March 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishan-kishan-batting-srh-vs-rr-2697885-2025-03-23",
      "headline": "Ishan turns round corner for SRH: 2 sessions a day at his academy in PatnaIshan Kishan, out of the national team and Mumbai Indians made a sensational comeback in IPL 2025. Ishan scored a hundred in his first match with SRH."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-will-make-me-play-even-on-a-chair-ms-dhoni-2697884-2025-03-23",
      "headline": "Even if I am in a wheelchair, CSK will say 'Don't worry, you play': MS DhoniLegendary India and Chennai Super Kings (CSK) wicketkeeper batter MS Dhoni addressed his retirement rumours and said that his team is even willing to play him on a chair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-score-ms-dhoni-vignesh-puthur-chennai-2697879-2025-03-23",
      "headline": "Noor Ahmed spins CSK to dominant win as MI's opening-day jinx continuesIPL 2025, CSK vs MI: Noor Ahmed's spin-bowling masterclass and steady fifties from Rachin Ravindra and Ruturaj Gaikwad helped Chennai Super Kings begin their campaign in style. Mumbai Indians lost their opening game for the last 14 years in the T20 league. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vignesh-puthur-details-mumbai-indians-scouting-kerala-spinner-2697877-2025-03-23",
      "headline": "Who is Vignesh Puthur? Auto rickshaw driver's son is MI's latest scouting gemIPL 2025, CSK vs MI: 24-year-old Vignesh Puthur was scouted by Mumbai Indians when he was playing club cricket in Kerala. The left-arm wrist-spinner, an auto-rickshaw driver's son, was a net bowler with MI Cape Town in SA20 2025. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}