{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/crazy-capitalist-over-organised-socialist-ruchir-sharma-on-why-billionaires-back-donald-trump-2631143-2024-11-10",
      "headline": "Ruchir Sharma on why billionaires support 'crazy capitalist' Donald TrumpDespite his 'crazy capitalist' persona, Donald Trump's pro-business approach continues to win over America's influential elites and billionaires.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cryptocurrencies-here-to-stay-as-an-asset-class-says-ruchir-sharma-2630941-2024-11-09",
      "headline": "Cryptocurrencies here to stay as an asset class, says Ruchir SharmaIn an interview with India Today News Director Rahul Kanwal, Ruchir Sharma explained why cryptocurrencies, alongside gold, are emerging as long-term alternatives to traditional assets, particularly the US dollar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-stimulus-economic-crisis-us-deal-india-stance-interview-ruchir-sharma-2630931-2024-11-09",
      "headline": "China's stimulus may stabilise economy, but won't solve crisis: Ruchir SharmaIn an interview with India Today News Director Rahul Kanwal, Ruchir Sharma highlighted that China's growth is unlikely to exceed 2.5% annually over the next decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ruchir-sharma-foreign-investors-outflows-indian-stock-market-2630910-2024-11-09",
      "headline": "Only a weaker dollar will bring foreign investors back to India: Ruchir SharmaIn an interview with India Today News Director Rahul Kanwal, Ruchir Sharma explained that the primary factor hindering foreign capital inflows into India is the strength of the dollar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ruchir-sharma-donald-trump-india-us-trade-ties-tariff-plans-interview-2630877-2024-11-09",
      "headline": "Should India worry about Donald Trump's tariff plans? Ruchir Sharma explainsRuchir Sharma warned that under Donald Trump, India must brace for a more transactional approach, where deals could be made based on America's interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bookingcom-parent-company-booking-holdings-job-cuts-company-reorganisation-plan-2630694-2024-11-09",
      "headline": "Booking plans job cuts as part of company's reorganisation planBooking Holdings, which owns brands like Booking.com and Kayak, did not disclose how many jobs would be affected but said it expected to provide more details on timing, likely impact on employees and financials \"in due course\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-market-value-rises-electric-automaker-shares-jumped-elon-musk-donald-trump-2630662-2024-11-09",
      "headline": "Elon Musk's Tesla hits $1 trillion market value after Trump winThe electric automaker's shares jumped 8.2 per cent to $321.22, catapulting the company's valuation above the trillion-dollar mark for the first time in more than two years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/business-today-most-powerful-women-2024-awards-kalli-purie-speech-2630633-2024-11-09",
      "headline": "A woman's soulmate is another woman: Kalli Purie at Business Today MPW 2024Kalli Purie, Vice-Chairperson and Executive Editor-in-Chief, India Today Group, delivered the vote of thanks at Business Today's Most Powerful Women 2024 awards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/indias-women-achivers-honoured-at-business-todays-most-powerful-women-2024-awards-2630631-2024-11-09",
      "headline": "Watch: Trailblazers awarded at Business Today's Most Powerful Women 2024Business Today unveiled the 21st edition of its Most Powerful Women in Business list on Friday, celebrating 60 exceptional women leaders who are pioneering change, driving growth, and inspiring progress across diverse industries. This year's edition brings in 12 fresh faces and recognises four returning achievers, underscoring the dynamic nature of leadership in business. Watch the award ceremony here on India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/i-salute-the-trailblazers-kalli-purie-at-business-todays-most-powerful-women-event-2630629-2024-11-09",
      "headline": "I salute the trailblazers: Kalli Purie at Business Today's Most Powerful Women eventKalli Purie, Vice-Chairperson and Executive Editor-in-Chief, India Today Group, lauded the growing accomplishments and transformation of women leaders in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trailblazers-on-business-today-most-powerful-women-2024-list-2630545-2024-11-08",
      "headline": "Trailblazers on Business Today's Most Powerful Women 2024 listThis year's Business Today Most Powerful Women list introduces 12 new faces, four returning achievers, and 37 repeat honourees from last year. Two trailblazers entered the MPW Hall of Fame after seven-time wins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/americans-can-learn-a-lesson-or-two-from-india-piyush-goyal-on-women-representation-2630574-2024-11-08",
      "headline": "Americans can learn a lesson or two from India: Piyush Goyal on women representationUnion Minister of Commerce & Industry Piyush Goyal lauded India's approach to women's empowerment and said that Americans can learn a lesson or two from India on women representation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-india-cut-tariffs-harley-davidson-donald-trump-us-president-2630573-2024-11-08",
      "headline": "Harley-Davidson tariffs to be cut after Trump's return? Piyush Goyal respondsSpeaking at the Business Today's Most Powerful Women 2024 event, Piyush Goyal expressed India's openness to reconsidering the tariffs on the iconic motorcycles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-leaders-share-insights-on-achieving-work-life-balance-and-success-at-bt-mpw-2024-2630562-2024-11-08",
      "headline": "Women leaders share insights on achieving work-life balance and success at BT MPW 2024At the Business Today MPW 2024 session, Ritu Arora, CEO & CIO of Allianz Investment Management, Asia Pacific, Nirupa Shankar, Joint MD of Brigade Group; and Devita Saraf, Chairperson & CEO of Vu Group, shared insights on striking a fine balance between work, life, health and wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-need-to-move-from-being-savers-to-investors-radhika-gupta-2630549-2024-11-08",
      "headline": "Women need to move from being savers to investors: Radhika GuptaSpeaking at the Business Today Most Powerful Women 2024 event, Radhika Gupta, MD and CEO of Edelweiss Mutual Fund, emphasised the need for women to move beyond saving and start investing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/edelweiss-mutual-fund-radhika-gupta-on-women-phenomenal-savers-should-not-outsource-money-management-to-men-2630490-2024-11-08",
      "headline": "It's not complicated: Radhika Gupta urges women to manage their own moneySpeaking at Business Today's Most Powerful Women 2024 event, Edelweiss Mutual Fund Managing Director and CEO Radhika Gupta said that while women have been the \"chief financial officers\" of their households for generations, it's time to extend that role into the financial markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-have-always-had-a-tough-time-breaking-barriers-in-business-padmaja-ruparel-at-bt-mpw-2024-2630469-2024-11-08",
      "headline": "Women have always had a tough time breaking barriers in business: Padmaja Ruparel at BT MPW 2024Speaking at Business Today's Most Powerful Women 2024 event, Padmaja Ruparel said women always had a tough time breaking barriers in business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-swiggy-accused-of-breaching-antitrust-laws-competition-commission-of-india-2630326-2024-11-08",
      "headline": "Zomato, Swiggy accused of unfair practices in food delivery market: ReportThe investigation found these companies implemented practices that gave preferential treatment to certain restaurants on their platforms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-fii-selling-it-gains-weak-q2-earnings-2630311-2024-11-08",
      "headline": "Sensex, Nifty end in red as FII selling offsets IT gains; RVNL tanks 6%The S&P BSE Sensex dropped 55.47 points to settle at 79,486.32, while the NSE Nifty50 fell 89.95 points to 24,109.40.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shiv-nadar-billionaire-edelgive-hurun-india-philanthropy-list-2024-rs-2153-crore-fy24-2630279-2024-11-08",
      "headline": "Shiv Nadar, billionaire with a big heart, donates Rs 2,153 crore in FY24For the third time in five years, Shiv Nadar and his family have topped the EdelGive-Hurun India Philanthropy List 2024, contributing Rs 2,153 crore in the fiscal year 2024."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/benjamin-netanyahu-okayed-pager-attacks-lebanon-death-toll-report-hezbollah-2631286-2024-11-10",
      "headline": "Netanyahu confirms he okayed Lebanon pager attacks that killed nearly 40: ReportConfirmation by Benjamin Netanyah came days after Lebanon filed a complaint with the United Nations's International Labour Organization (ILO) about the deadly pager blasts which took place in September. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/another-shooter-arrested-in-baba-siddique-murder-case-was-trying-to-flee-to-nepal-2631262-2024-11-10",
      "headline": "Man who shot Baba Siddique arrested, admits to being part of Lawrence Bishnoi gangShiv Kumar revealed that the murder was carried out on the instructions of Lawrence Bishnoi's brother, Anmol Bishnoi. Shiv Kumar also stated that his contact with Anmol Bishnoi was facilitated multiple times by Shubham Lonkar, who is believed to be a close aide of Lawrence Bishnoi. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/khalistani-terrorist-khalistan-tiger-force-arsh-dalla-hardeep-singh-nijjar-arrested-canada-2631200-2024-11-10",
      "headline": "Khalistani terrorist Arsh Dalla, close aide of Nijjar, arrested in Canada: SourcesAccording to Indian intelligence agencies, Arsh Dalla, who is wanted for various criminal activities in India, has been living in Canada with his wife. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-varun-chakravarthy-tristan-stubbs-2nd-t20i-report-2631293-2024-11-10",
      "headline": "Varun Chakravarthy five in vain as South Africa level series 1-1SA vs IND, 2nd T20I: South Africa drew level in the four-match series after winning by three wickets on Sunday at the St George's Park in Gqeberha. Varun Chakravarthy picked up five wickets but his efforts went in vain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-vice-president-elect-jd-vance-calls-indian-veg-the-best-recalls-first-meal-made-for-wife-usha-vance-2631288-2024-11-10",
      "headline": "JD Vance says Indian veg is best, recalls meal he made for wife Usha in viral clipJD Vance admitted he had a rudimentary understanding of Indian cuisine before he met Usha Vance. He further claimed he had no idea what vegetarians ate when he met Usha. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bhopal/story/digital-arrest-bhopal-man-rescued-by-mp-police-online-fraud-cybercrime-2631292-2024-11-10",
      "headline": "Cops rescue Bhopal man from 6-hour 'digital arrest', saved from multi-crore scamMadhya Pradesh Cyber Police saved a man held in \"digital arrest\" by scammers impersonating officials, preventing a multi-crore fraud, making it the first-ever live rescue in such cases. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/goa-tourism-decline-data-x-user-ramanuj-mukherjee-writes-to-cm-pramod-sawant-2631235-2024-11-10",
      "headline": "Tourists felt cheated: Entrepreneur after case filed over his post on Goa tourismA viral post on Goa's tourism decline has led to a police complaint and an open letter from Ramanuj Mukherjee, who alleged tourists \"felt cheated\" and urged Chief Minister Pramod Sawant for reforms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/hyderabad-man-injures-eye-after-daughters-boyfriend-shoots-him-with-air-gun-for-sending-her-to-us-2631301-2024-11-11",
      "headline": "Hyderabad man shoots at girlfriend's father for sending her to the USThe woman's father sustained an eye injury after the accused shot him with the air gun. The accused shot the 57-yeaer-old when he was sitting inside his car. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/humare-ram-ramayana-drama-theatre-play-ashutosh-rana-questions-on-sanatana-dharma-adipurush-ott-2630948-2024-11-10",
      "headline": "How a Ramayana play became superhit while big-budget movie bombedHumare Ram, a theatrical Ramayana retelling, is seeing full houses across the country. This theatre version of Ramayana, in which Ashutosh Rana plays Ravan, gained success while a big-budget movie based on the epic bombed. This is how Humare Ram, a play that answers questions on Sanatana and Dharma, got it right."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-will-not-travel-to-pakistan-for-champions-trophy-icc-informs-pcb-2631268-2024-11-10",
      "headline": "India will not travel to Pakistan for Champions Trophy, ICC informs PCBIndia will not travel to Pakistan for Champions Trophy, the ICC has informed Pakistan Cricket Board via an official email, India Today has learnt that the PCB have forwarded the information to the government and are waiting for their advice."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jawan-killed-three-commandos-encounter-terrorists-in-jammu-kashmir-kishtwar-2631229-2024-11-10",
      "headline": "Soldier killed, three other commandos injured in encounter in J&K's KishtwarNaib Subedar Rakesh Kumar of the Army's 2 Para (SF) unit was killed, and three other commandoes were injured in an encounter in Jammu and Kashmir's Kishtwar district on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/wayanad-bypolls-congress-priyanka-gandhi-reacts-pinarayi-vijayans-jamaat-link-charge-says-shouldnt-distract-people-2631253-2024-11-10",
      "headline": "Priyanka Gandhi responds to Pinarayi Vijayan's Jamaat remark: Shouldn't distractPriyanka Gandhi's remark came after Kerala Chief Minister Pinarayi Vijayan alleged that Congress general secretary was contesting the Wayanad bypoll with the backing of Jamaat-e-Islami."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/natasa-stankonic-move-to-serbia-divorce-hardik-pandya-son-agastya-2631219-2024-11-10",
      "headline": "Natasa Stankovic shares if she'll move to Serbia after separating from HardikNatasa Stankovic addressed rumours about moving to Serbia after separation from Hardik Pandya. She emphasised her commitment to staying in India for her son's well-being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/high-mighty-the-boardroom-beacons-2630781-2024-11-09",
      "headline": "High & Mighty: The boardroom beaconsThe most influential business leaders who featured in INDIA TODAY's High & Mighty Power List 2024\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-not-travelling-to-australia-with-team-1st-test-participation-in-doubt-2631281-2024-11-10",
      "headline": "Rohit Sharma not travelling to Australia ahead of 1st TestIndia captain Rohit Sharma is not travelling with the team to Australia. Rohit is expected to miss the opening Test match at Perth and then join the team ahead of the 2nd game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/non-veg-food-alcohol-menu-uk-prime-minister-keir-starmer-diwali-reception-event-triggers-row-british-hindus-2631206-2024-11-10",
      "headline": "Non-veg food, alcohol on menu of UK PM's Diwali reception event triggers rowA group called 'Insight UK' questioned whether Hindu community organisations and religious leaders were consulted ahead of the event to ensure greater cultural sensitivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ajay-devgn-reacts-to-his-viral-dance-meme-credits-it-to-prabhudeva-2631180-2024-11-10",
      "headline": "Ajay Devgn reacts to his viral dance meme, credits PrabhudevaBollywood star Ajay Devgn has reacted to his viral dance video from the film Action Jackson, directed by Prabhudeva. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-business-sports-entertainment-politics-430-09-11-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/lalu-yadav-jharkhand-polls-narendra-modi-bjp-uproot-rjd-india-bloc-2631269-2024-11-10",
      "headline": "Who is Narendra Modi? Lalu Yadav asks, vows to uproot BJP from JharkhandAddressing an election rally in Jharkhand's Koderma, Lalu Yadav claimed that the BJP has lost its influence, positioning it as a weaker political force compared to the INDIA bloc, a coalition that includes his party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jharkhand-assembly-polls-pm-narendra-slams-jawahar-lal-nehru-indira-gandhi-rajiv-gandhi-obc-reservation-2631188-2024-11-10",
      "headline": "Ek rahoge toh safe rahoge: PM alleges plot to break Backward classes in JharkhandAlleging that the Congress wants to divide OBCs by pitting sub-castes against each other, Prime Minister Narendra Modi told the people that \"if they stay united, they will remain safe\" (ek rahoge toh safe rahoge)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/when-shilpa-shetty-met-american-influencer-logan-paul-and-youtuber-mr-beast-2631231-2024-11-10",
      "headline": "When Shilpa Shetty met American influencer Logan Paul and YouTuber Mr BeastBollywood star Shilpa Shetty recently met up with American influencer and wrestler Logan Paul and YouTuber Mr Beast. She shared photos and a video from the meeting on her social media handle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ukraine-fires-drones-towards-moscow-in-biggest-strike-since-war-in-2022-2631195-2024-11-10",
      "headline": "Ukraine fires 34 drones towards Moscow in biggest strike since war in 2022Ukraine launched its largest drone attack on Moscow since the war began, diverting flights and injuring one person, while Russia intercepted 36 drones over Western regions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/banarasi-is-getting-a-western-makeover-this-wedding-season-2628572-2024-11-10",
      "headline": "Banarasi is getting a Western makeover this wedding season Banarasi is undergoing a makeover through a wave of Westernisation. Think of Banarasi in modish silhouettes like corsets, tops, pantsuits, and even short dresses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/dy-chandrachud-retirement-cji-supreme-court-sajiv-khanna-bar-council-senior-lawyers-2631178-2024-11-10",
      "headline": "Transformative yet unfulfilled: Senior lawyers on Chief Justice Chandrachud's tenureAs Chief Justice DY Chandrachud retires, senior advocates reflect on his tenure, praising his digital reforms and progressive judgments while noting some missed opportunities and challenges within the judiciary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kanguva-trailer-suriya-promises-a-massive-electric-entertainer-bobby-deol-siva-2631249-2024-11-10",
      "headline": "Kanguva trailer: Suriya promises a massive, electric entertainerThe second trailer of the highly-anticipated Suriya entertainer, Kanguva, is here. The film promises a larger-than-life spectacle. It releases this November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/steve-jyrwa-wins-india-best-dancer-season-4-takes-home-rs-15-lakh-2631161-2024-11-10",
      "headline": "Steve Jyrwa wins India's Best Dancer Season 4, takes home Rs 15 lakhAfter months of intense competition, India's Best Dancer Season 4 has finally found its winner in Shillong's Steve Jyrwa. Apart from the coveted trophy, the winner took home prize money of Rs 15 lakh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/when-shilpa-shetty-met-american-influencer-logan-paul-and-youtuber-mr-beast-2631231-2024-11-10",
      "headline": "When Shilpa Shetty met American influencer Logan Paul and YouTuber Mr BeastBollywood star Shilpa Shetty recently met up with American influencer and wrestler Logan Paul and YouTuber Mr Beast. She shared photos and a video from the meeting on her social media handle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/soaps/story/shaktimaan-teaser-mukesh-khanna-promises-return-of-india-first-super-teacher-2631226-2024-11-10",
      "headline": "Shaktimaan teaser: Mukesh Khanna promises return of 'super teacher'Veteran actor Mukesh Khanna, best known for playing Shaktimaan in the 90s, has promised the return of the desi superhero to screens. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/inzamam-wants-india-to-play-champions-trophy-in-pakistan-2631319-2024-11-11",
      "headline": "Inzamam wants India to play Champions Trophy in Pakistan: No threat hereFormer Pakistan captain Inzamam Ul Haq has claimed that India will be well taken care of in Pakistan. Inzamam has urged the team to visit Pakistan in the Champions Trophy and said that there is no threat to the cricket team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-t20i-tristan-stubbs-pressure-moms-birthday-gqeberha-knock-2631318-2024-11-11",
      "headline": "Stubbs opens up on special Gqeberha knock vs India on 'Mom's Birthday'Tristan Stubbs led South Africa to victory over India with a composed, match-winning 47*, showcasing grit under pressure, especially with his mother present for her birthday. Varun Chakravarthy's brilliant five-for went in vain as India failed top defend such a low-total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-rues-2nd-t20i-loss-vs-south-africa-on-son-birthday-2631316-2024-11-11",
      "headline": "Varun Chakravarthy rues 2nd T20I loss: Wanted to win match on son's birthdaySouth Africa vs India: Spinner Varun Chakravarthy rued the result of India's 2nd T20I match despite taking a 5-wicket-haul in Gqeberha. Varun said that he wanted India to win on his son's birthday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-lockie-ferguson-2nd-t20i-report-2631315-2024-11-11",
      "headline": "Lockie Ferguson hat-trick helps New Zealand defend their lowest score SL vs NZ: Lockie Ferguson and Glenn Phillips picked up three wickets apiece as New Zealand beat Sri Lanka by five runs on Sunday. The two-match T20I series ended at 1-1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-ind-varun-chakravarthy-becomes-5th-indian-to-take-up-5-wicket-haul-in-t20is-2631294-2024-11-10",
      "headline": "Varun Chakravarthy becomes 5th Indian to take up 5-wicket-haul in T20IsIndia spinner Varun Chakravarthy became only the 5th Indian to take a 5-wicket-haul in T20Is. Varun's incredible spell completely changed the complexion of the 2nd T20I.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-varun-chakravarthy-tristan-stubbs-2nd-t20i-report-2631293-2024-11-10",
      "headline": "Varun Chakravarthy five in vain as South Africa level series 1-1SA vs IND, 2nd T20I: South Africa drew level in the four-match series after winning by three wickets on Sunday at the St George's Park in Gqeberha. Varun Chakravarthy picked up five wickets but his efforts went in vain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/watch-first-batch-of-india-players-leave-for-australia-ahead-of-border-gavaskar-trophy-2631289-2024-11-10",
      "headline": "Watch: 1st batch of India players leave for Australia for Border Gavaskar TrophyThe first batch of India players left for Australia ahead of the Border-Gavaskar Trophy. India play Australia in 5 Test matches, with the first one starting on November 22 in Perth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-slammed-for-slow-knock-in-2nd-t20i-auditioning-for-australia-tests-2631287-2024-11-10",
      "headline": "Auditioning for Australia: Hardik slammed for slow knock in 2nd T20IIndian cricket fans criticised Hardik Pandya for a poor show with the bat in the 2nd T20I vs South Africa, Hardik scored 39 off 45 after India had lost a flurry of top-order wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-bangladesh-3rd-odi-live-streaming-shanto-rashid-khan-2631282-2024-11-10",
      "headline": "Afghanistan vs Bangladesh, 3rd ODI: When and where to watch live?AFG vs BAN, 3rd ODI: Afghanistan and Bangladesh will be up against each other in the third and final game of the three-match ODI series on Monday at the Sharjah Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-not-travelling-to-australia-with-team-1st-test-participation-in-doubt-2631281-2024-11-10",
      "headline": "Rohit Sharma not travelling to Australia ahead of 1st TestIndia captain Rohit Sharma is not travelling with the team to Australia. Rohit is expected to miss the opening Test match at Perth and then join the team ahead of the 2nd game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-2nd-t20i-tilak-varma-david-miller-video-2631272-2024-11-10",
      "headline": "Watch: Tilak Varma stunned after David Miller pulls of incredible catch SA vs IND, 2nd T20I: Tilak Varma scored 20 runs off as many balls before David Miller took a stunning catch off Aiden Markram to send him packing in the second T20I at the St George's Park in Gqeberha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/watch-first-batch-of-india-players-leave-for-australia-ahead-of-border-gavaskar-trophy-2631289-2024-11-10",
      "headline": "Watch: 1st batch of India players leave for Australia for Border Gavaskar TrophyThe first batch of India players left for Australia ahead of the Border-Gavaskar Trophy. India play Australia in 5 Test matches, with the first one starting on November 22 in Perth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-slammed-for-slow-knock-in-2nd-t20i-auditioning-for-australia-tests-2631287-2024-11-10",
      "headline": "Auditioning for Australia: Hardik slammed for slow knock in 2nd T20IIndian cricket fans criticised Hardik Pandya for a poor show with the bat in the 2nd T20I vs South Africa, Hardik scored 39 off 45 after India had lost a flurry of top-order wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-bangladesh-3rd-odi-live-streaming-shanto-rashid-khan-2631282-2024-11-10",
      "headline": "Afghanistan vs Bangladesh, 3rd ODI: When and where to watch live?AFG vs BAN, 3rd ODI: Afghanistan and Bangladesh will be up against each other in the third and final game of the three-match ODI series on Monday at the Sharjah Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-not-travelling-to-australia-with-team-1st-test-participation-in-doubt-2631281-2024-11-10",
      "headline": "Rohit Sharma not travelling to Australia ahead of 1st TestIndia captain Rohit Sharma is not travelling with the team to Australia. Rohit is expected to miss the opening Test match at Perth and then join the team ahead of the 2nd game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-2nd-t20i-tilak-varma-david-miller-video-2631272-2024-11-10",
      "headline": "Watch: Tilak Varma stunned after David Miller pulls of incredible catch SA vs IND, 2nd T20I: Tilak Varma scored 20 runs off as many balls before David Miller took a stunning catch off Aiden Markram to send him packing in the second T20I at the St George's Park in Gqeberha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-will-not-travel-to-pakistan-for-champions-trophy-icc-informs-pcb-2631268-2024-11-10",
      "headline": "India will not travel to Pakistan for Champions Trophy, ICC informs PCBIndia will not travel to Pakistan for Champions Trophy, the ICC has informed Pakistan Cricket Board via an official email, India Today has learnt that the PCB have forwarded the information to the government and are waiting for their advice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-flop-show-angers-india-fans-intent-cannot-be-excuse-2631263-2024-11-10",
      "headline": "Abhishek Sharma flop-show angers India fans: Intent cannot be excuseAbhishek Sharma's poor show continued in the 2nd match of the series vs South Africa. Sharma got out in single digits trying to hit Gerald Coetzee for a six in the 2nd over of the match.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aggressive-abhishek-sharma-feeling-the-heat-because-of-samsons-form-boucher-2631251-2024-11-10",
      "headline": "Abhishek Sharma feeling the heat because of Samson's form: BoucherFormer South Africa coach Mark Boucher feels Abhishek Sharma will feel the urgency to score some big runs. The former cricketer said that with Sanju scoring centuries, Abhishek will be under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-auction-rishabh-pant-to-csk-ceo-kasi-viswanathan-chennai-2631254-2024-11-10",
      "headline": "Rishabh Pant to Chennai? CSK CEO responds to IPL 2025 Auction rumoursCSK CEO Kasi Viswanathan has responded to the rumours that Chennai will be aiming to get Rishabh Pant during the IPL 2025 auction. Pant will be one of the big players in demand during the auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-must-sign-sergio-ramos-guti-hernandez-bold-suggestion-injury-centre-backs-2631238-2024-11-10",
      "headline": "'Real Madrid must sign Sergio Ramos': Former player makes bold suggestionGuti Hernandez called for Real Madrid to re-sign Sergio Ramos as injuries to key defenders, including Eder Militao, leave Carlo Ancelotti's backline in need of experienced reinforcement, sparking debate on how the club should address their defensive crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-refereeing-chief-says-standards-improving-amidst-mounting-concerns-in-isl-2631236-2024-11-10",
      "headline": "AIFF refereeing chief says standards improving amidst mounting concerns in ISLPoor refereeing in the Indian Super League (ISL) has long been a source of frustration for many coaches, but the national federation's top officer Trevor Kettle on Sunday claimed that the standard of referees in the country is \"improving in many competencies\".\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-must-sign-sergio-ramos-guti-hernandez-bold-suggestion-injury-centre-backs-2631238-2024-11-10",
      "headline": "'Real Madrid must sign Sergio Ramos': Former player makes bold suggestionGuti Hernandez called for Real Madrid to re-sign Sergio Ramos as injuries to key defenders, including Eder Militao, leave Carlo Ancelotti's backline in need of experienced reinforcement, sparking debate on how the club should address their defensive crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-refereeing-chief-says-standards-improving-amidst-mounting-concerns-in-isl-2631236-2024-11-10",
      "headline": "AIFF refereeing chief says standards improving amidst mounting concerns in ISLPoor refereeing in the Indian Super League (ISL) has long been a source of frustration for many coaches, but the national federation's top officer Trevor Kettle on Sunday claimed that the standard of referees in the country is \"improving in many competencies\".\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-2nd-t20i-live-cricket-score-today-expert-reactions-suryakumar-varun-chakravarthy-abhishek-sharma-2631230-2024-11-10",
      "headline": "2nd T20I Highlights and Reactions: Varun's five-wicket-haul in vain as South Africa draw levelSouth Africa (SA) vs. India (IND), 2nd T20I Live Updates and Reactions from Gqeberha: Some brilliant batting at the very death of the game by Gerald Coetzee and Tristan Stubbs guided South Africa to a 3 wicket win over India to level the 4-match series 1-1. While spinners shone bright for India, seamers cost them the game. Of what was a btting flop-show by the rest of the Proteas batters, Stubbs and Coetzee did the job on their own."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wbbl-2024-ellyse-perry-fan-sydney-sixers-video-2631227-2024-11-10",
      "headline": "Watch: Ellyse Perry wins hearts after playing cricket with young fan WBBL 2024: Ellyse Perry won hearts after playing cricket with a young fan. On Sunday, Perry played in the match against Sydney Thunder at the iconic Sydney Cricket Ground. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/womens-asian-champions-trophy-start-of-2026-world-cup-2028-olympics-journey-india-coach-harendra-singh-2631221-2024-11-10",
      "headline": "Asian Champions Trophy start of 2026 World Cup, 2028 Olympics journey: India coachIndia coach Harendra Singh has claimed that the women's team will use the Asian Champions Trophy 2024 and will be the base for their journey to the World Cup 2026 and the Olympics 2028. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-bangladesh-mustafizur-rahman-odi-t20i-series-2631213-2024-11-10",
      "headline": "Set to become father, Mustafizur likely to miss ODI, T20Is vs West IndiesBangladesh may not get the services of Mustafizur Rahman in their upcoming ODI and T20I series against the West Indies. Mustafizur is set to become a father later this year. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}