{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-ceo-aims-for-expanded-growth-in-india-through-new-partnerships-2622409-2024-10-24",
      "headline": "Nvidia CEO Jensen Huang aims for growth in India through new partnershipsIndia is seen as a key player in the AI market, with its population of 1.4 billion increasingly adopting AI across various sectors such as agriculture, education, and manufacturing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-share-allotment-status-multibagger-listing-gmp-key-details-2622393-2024-10-24",
      "headline": "Waaree Energies share allotment: GMP signals multibagger listing, details hereWaaree Energies IPO share allotment: The IPO was open for subscription from October 21 to October 23, offering shares within a fixed price range of Rs 1,427-1,503 per share."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hindalco-industries-share-price-falls-7-percent-early-trade-today-explained-2622344-2024-10-24",
      "headline": "Explained: Why Hindalco shares plunged over 7% in early trade todayHindalco Industries share price: By around 12:38 am, shares of Hindalco Industries were trading at Rs 683.50, reflecting a 4.73% decrease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/deepak-builders-engineers-ipo-allotment-check-status-gmp-expected-listing-gains-2622334-2024-10-24",
      "headline": "Deepak Builders & Engineers IPO allotment: Check status, expected listing gainsDeepak Builders & Engineers allotment: Investors who have bid for the IPO can check their allotment status online. They can log in to either the BSE website or the website of Kfin Technologies Limited, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-shares-rally-outlook-in-near-term-foreign-brokerage-clsa-explains-expet-view-2622306-2024-10-24",
      "headline": "Zomato shares fall 2%: Here's what brokerage firm CLSA says Zomato recently received board approval for a qualified institutional placement (QIP) to raise up to $1 billion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kpit-technologies-shares-tank-10-percent-what-shoul-investors-do-buy-dip-expert-view-2622290-2024-10-24",
      "headline": "KPIT Technologies share price tanks 10%: Time to buy the dip?KPIT Technologies stock price: Analysts are concerned that the company's growth could settle closer to 18%, which indicates a slower pace compared to recent performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-update-sensex-nifty-foreign-investors-selling-pressure-2622282-2024-10-24",
      "headline": "Sensex, Nifty trade flat as FII selling pressure hurts investor sentimentsThe S&P BSE Sensex was up just 9.75 points at 90,091.73 at 10:20 am, while the NSE Nifty50 fell 7.25 points to trade at 24,428.25."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hul-shares-drop-over-5-percent-after-weak-q2-results-what-should-investors-do-buy-sell-hold-2622267-2024-10-24",
      "headline": "HUL shares drop over 5% after weak Q2 results: Buy, sell, or hold?HUL's standalone net profit for Q2 FY25 dropped by 4% to Rs 2,612 crore, down from Rs 2,717 crore reported in the same quarter last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-allotment-online-guide-check-status-expected-listing-gains-gmp-2622249-2024-10-24",
      "headline": "Waaree Energies IPO allotment: Step-by-step guide to check statusWaaree Energies IPO allotment: Investors can check their allotment status online. They can log in to either the BSE website or the website of Link Intime India Private Ltd, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wazirx-transfers-175-million-dollars-in-cypto-to-240000-lakh-wallets-many-linked-to-china-2622077-2024-10-23",
      "headline": "WazirX transfers $175 million in cypto to 2.40 lakh wallets, many linked to ChinaDespite WazirX's public claim of ending their contract with Liminal after the hack, they continued using Liminal's services for several months. Liminal also criticised WazirX for lacking transparency, contrasting it with Radiant Capital, which handled a similar incident more openly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foreign-investors-fiis-indian-markets-exodus-china-stimulus-dalal-street-diwali-sparkle-2621958-2024-10-23",
      "headline": "Is China stealing Dalal Street's Diwali sparkle as foreign investors exit India?With Diwali around the corner, foreign investors are betting on China's stimulus and withdrawing from India. What does this FII exodus mean for the Indian stock market?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-erase-gains-volatility-dalal-street-2621863-2024-10-23",
      "headline": "Sensex, Nifty erase gains to end lower as volatility disrupts Dalal StreetThe S&P BSE Sensex ended 138.74 points lower at 80,081.98, while the NSE Nifty50 fell 36.60 points to 24,435.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-share-price-gains-today-brokerages-optimistic-about-growth-2621850-2024-10-23",
      "headline": "Hyundai Motor shares gain after weak listing. When is the right time to buy? Hyundai Motor India share price: Despite Hyundai Motor India's underwhelming market listing, several brokerages remain optimistic about the long-term prospects of the automaker, pointing to solid growth potential, both in domestic and export markets"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-gmp-rises-on-final-day-check-subscription-details-2621797-2024-10-23",
      "headline": "Waaree Energies IPO: GMP rises on final day, check subscription details Waaree Energies IPO: The grey market premium (GMP) for Waaree Energies suggests a potential listing gain of nearly 95%, with the company commanding a premium of Rs 1,415 in the unofficial market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-today-11-percent-increase-q2-results-npci-approval-upi-explained-2621757-2024-10-23",
      "headline": "Explained: Why Paytm share price surged over 11% todayPaytm stock price: At around 1:18 pm, shares of the company were trading 10:12% higher at Rs 756.85. The development comes a day after the company reported its Q2 results, following which shares tumbled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coforge-share-price-12-percent-jump-q2fy25-results-explained-2621673-2024-10-23",
      "headline": "Explained: Why Coforge share price jumped 12% after Q2 results Coforge share price: The IT firm's stock gained sharply in early trade a day after it reported Q2FY25 financial results. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-share-price-recovery-early-trade-5-dip-q2fy25-results-should-you-buy-or-sell-2621667-2024-10-23",
      "headline": "Zomato shares recover after falling 5% after Q2 results. Should you buy? Zomato share price: The early selloff was driven by mixed brokerage insights, despite an overall bullish outlook on the stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-in-green-early-trade-zomato-paytm-bajaj-finance-2621653-2024-10-23",
      "headline": "Sensex, Nifty gain in early trade; Zomato jumps 2%, Paytm gains 5%The S&P BSE Sensex was up 162.52 points to 80,383.24 at 9:57 am, while the NSE Nifty50 rose 46.45 points to trade at 24,518.55."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/paytm-new-upi-onboard-approval-national-payments-corporation-of-india-one97-communications-2621562-2024-10-23",
      "headline": "Paytm gets approval from National Payments Corporation to onboard new UPI usersThe approval is subject to adherence to all NPCI procedural guidelines and circulars, including guidelines and circulars issued specifically on risk management, brand guidelines for app and QR, multi-bank guidelines, among others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-disney-mega-media-merger-approved-competition-commission-of-india-published-report-2621353-2024-10-22",
      "headline": "Reliance-Disney merger approved, parties agree not to bundle cricket ad slotsA detailed order approving the mega media assets merger of Reliance Industries and Walt Disney was published by the Competition Commission of India on Tuesday."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mallikarjun-kharge-snubbed-priyanka-gandhi-wayanad-nomination-filing-video-bjp-2622391-2024-10-24",
      "headline": "Congress chief snubbed at Priyanka Gandhi's nomination? What went downThe BJP has accused Congress of disrespecting Mallikarjun Kharge after a video showed the party chief waiting outside a room where Priyanka Gandhi was filing her nomination papers. However, here is what actually happened, as per India Today's correspondent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cyclone-dana-odisha-braces-landfall-tonight-kolkata-airport-suspend-flights-trains-cancelled-west-bengal-rescue-teams-2622190-2024-10-24",
      "headline": "Cyclone Dana: Heavy rain in Odisha, Bengal as landfall approaches, flights hit  Live UpdatesCyclone Dana News: Authorities in Odisha have already evacuated more than 3 lakh people by Wednesday evening in view of cyclone Dana that is threatening to impact nearly half of the state's population."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliamentary-panel-public-accounts-committee-postpones-review-meet-after-sebi-chief-madhabi-puri-buch-skips-summons-2622312-2024-10-24",
      "headline": "Congress vs BJP after Sebi chief skips parliamentary review panel meetMadhabi Puri Buch was summoned today for a review of Sebi amid allegations of conflict of interest by US short-seller Hindenburg and holding an office of profit at ICICI Bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/justin-trudeau-canada-parliament-brokenist-pierre-poilievre-reacts-video-2622329-2024-10-24",
      "headline": "He's breaking English language: Opposition mocks Trudeau's Parliament speechThe use of the word 'brokenist' by Justin Trudeau while defending his government's record on immigration and economic policies drew chuckles from the opposition camp."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-rain-waterlogging-viral-videos-traffic-jam-electronic-city-flyover-commuters-abandon-vehicles-walk-home-2622242-2024-10-24",
      "headline": "Videos: Stuck in Bengaluru flyover jam, commuters abandon vehicles, walk homeBengaluru's Electronic City flyover was hit by a massive traffic jam on Wednesday night after heavy rain, leaving commuters stranded for over three hours. Videos show thousands abandoning their vehicles and walking back home as waterlogging worsened the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/decoding-chinese-chatter-on-modi-xi-diplomacy-in-kazan-opinion-2622362-2024-10-24",
      "headline": "Decoding Chinese chatter on Modi-Xi diplomacy in KazanAlthough it may look like a \"sudden development\", Chinese observers pointed out that a \"quiet but significant\" shift in China-India relations had already been underway in the past few months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-high-court-seeks-centre-response-unethical-coldplay-diljit-dosanjh-concert-ticket-sales-2622415-2024-10-24",
      "headline": "Court notice to Centre on unethical Coldplay, Diljit Dosanjh show ticket re-salesWhile Diljit Dosanjh's \"Dil-Luminati Tour\" is scheduled to take place at the JLN Stadium in Delhi on October 26 and 27, British rock band Coldplay will perform in Mumbai from January 19 to 21, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/why-a-birkin-in-the-hands-of-yahya-sinwar-wife-made-headlines-all-over-the-world-2621969-2024-10-24",
      "headline": "Why a (fake?) Birkin in the hands of Yahya Sinwar's wife made headlines all over the worldBirkin, the world's most coveted bag, has found itself at the centre of the Israel-Hamas war after apparently being spotted in the hands of the wife of slain Hamas chief Yahya Sinwar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/elevating-your-career-with-iim-kozhikodes-advanced-operations-analytics-and-supply-chain-management-programme-2621116-2024-10-22",
      "headline": "Elevating Your Career with IIM Kozhikode's Advanced Operations Analytics and Supply Chain Management ProgrammeElevate your career with IIM Kozhikode's comprehensive programme, designed to equip professionals with the latest tools and strategies in operations management and data analytics. Gain hands-on experience through live sessions, capstone projects, and industry-relevant assignments, while accessing the prestigious IIMK Executive Alumni network. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-election-stacey-williams-accused-donald-trump-sexual-misconduct-twisted-game-jeffrey-epstein-2622381-2024-10-24",
      "headline": "'Hands all over...': Ex-model accuses Donald Trump of groping her in 1993A former model, Stacey Williams, has accused Donald Trump of groping her without consent at Trump Tower in 1993. Williams claims she was introduced to Trump by convicted sex offender Jeffrey Epstein, and described the incident as part of a \"twisted game\" between the two men."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/teen-commits-suicide-after-forming-attachment-with-characterai-chatbot-mother-holds-company-responsible-2622389-2024-10-24",
      "headline": "Teen commits suicide after forming attachment with CharacterAI chatbot, mother holds company responsibleA 14-year-old boy has commit suicide after becoming emotionally attached to an AI chatbot. His mother has sued the company behind the chatbot, Character.ai. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pakistani-model-roma-michael-bikini-ramp-walk-video-controversy-who-is-she-2622325-2024-10-24",
      "headline": "Pakistani model Roma Michael's bikini ramp walk triggers controversy. Who is she?Roma Michael trended furiously on social media after reports suggested that she deleted her bikini ramp walk video following tremendous backlash over her choice of outfit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-priyanka-gandhi-vadra-in-parliament-could-bring-to-congress-and-national-politics-2622002-2024-10-23",
      "headline": "What Priyanka Gandhi in Parliament could bring to Congress, national politicsAs Priyanka Gandhi Vadra enters the fray in Wayanad, the stakes are high—not just for her, but also for the Congress and the national political landscape she aims to reshape"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/eknath-shinde-shiv-sena-objects-bjp-fielding-candidates-from-4-seats-2622353-2024-10-24",
      "headline": "Shinde Sena objects to BJP fielding candidates from 4 seats in MaharashtraThe Shiv Sena faction led by Chief Minister Eknath Shinde has objected to BJP fielding its candidates from Kalyan East, Thane, Airoli and Murbad Assembly constituencies. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-accuses-al-jazeera-journalists-palestinian-militants-gaza-network-denies-unfounded-claims-2622314-2024-10-24",
      "headline": "Israel accuses 6 Al Jazeera journalists of being militants, network deniesAccording to the Israel Defense Forces, Al Jazeera journalists Anas al-Sharif, Hossam Shabat, Ismael Abu Omar, and Talal Arrouki have ties to Hamas, while Ashraf Saraj and Alaa Salameh were affiliated with the Islamic Jihad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-priyanka-gandhi-35-years-campaigner-now-seeks-vote-as-first-time-candidate-strategist-wayanad-by-election-2621943-2024-10-24",
      "headline": "How campaigner Priyanka now seeks vote for debutante PriyankaPriyanka Gandhi Vadra started campaigning when she was just 17. That was for her father, Rajiv Gandhi. In the next 35 years, she became an ace campaigner for the Congress. For the first time, Priyanka, a seasoned campaigner, will seek votes for Priyanka, the first-time candidate, in Kerala's Wayanad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/akhilesh-yadav-rahul-gandhi-samajwadi-congress-seat-sharing-up-bypolls-cycle-symbol-india-bloc-2622201-2024-10-24",
      "headline": "Why Akhilesh Yadav wants INDIA candidates to fight UP bypolls on cycle symbolUP bypolls: Sources said political experts had predicted that the Congress wouldn't be able to win Ghaziabad Sadar and Khair, the two seats which the BJP won earlier, and the party wasn't keen to contest the bypolls after not getting their desired seats."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-crackdown-immigrants-foreign-workers-justin-trudeau-government-liberal-party-2622208-2024-10-24",
      "headline": "Canadians first: Trudeau says fewer foreign temporary workers will be allowedJustin Trudeau's announcement on a cut in immigration numbers came a month after his government announced a further cut in the number of study permits for international students."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/nvidia-rolls-out-hindi-language-ai-model-in-india-as-ceo-jensen-huang-visits-2622315-2024-10-24",
      "headline": "Nvidia rolls out Hindi-language AI model in India as CEO Jensen Huang visitsNvidia is rolling out its new small language model, dubbed Nemotron-4-Mini-Hindi-4B, with 4 billion parameters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/singer-billie-eilish-falls-off-stage-while-performing-shares-pic-of-bruise-2622318-2024-10-24",
      "headline": "Singer Billie Eilish falls off stage while performing, shares pic of bruiseAmerican singer Billie Eilish recently fell off the stage while performing at a New York concert. She later shared a photo of the same on her social media handle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hezbollah-confirms-death-hassan-nasrallah-cousin-potential-successor-hashem-safieddine-israeli-strike-2622293-2024-10-24",
      "headline": "Hezbollah confirms death of Nasrallah's potential successor in Israeli strikeHezbollah issued a statement on Wednesday mourning Safieddine as a \"great leader and a great martyr\" who lived an \"honourable life\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-terrorist-attack-tral-district-bijnoor-migrants-injured-19-year-old-boy-2622260-2024-10-24",
      "headline": "Teen migrant shot at by terrorists in J&K's Tral, 3rd attack in a weekThe teenager, Shubam Kumar, 19, from Uttar Pradesh's Bijnor, suffered bullet injures in his hand. He has been admitted to hospital and is stable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-prime-minister-justin-trudeau-unhappy-legislators-liberal-party-poor-show-polls-2622177-2024-10-24",
      "headline": "Quit by October 28: Trudeau faces ultimatum from own party amid India-Canada rowOpinion polls suggest that with Justin Trudeau at the helm, the Liberal party will lose to the official opposition Conservatives in the next general election, which must be held by the end of October 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/madhuri-dixit-vidya-balan-face-off-ami-je-tomar-shoot-bhool-bhulaiyaa-3-2622431-2024-10-24",
      "headline": "Viral video: Madhuri Dixit, Vidya Balan's face-off from Ami Je Tomar 3.0 shootActors Madhuri Dixit and Vidya Balan engaged in a captivating face-off in the viral video from Ami Je Tomar 3.0 shoot. The video of the Bhool Bhulaiyaa 3 song releases on October 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/bts-j-hope-dances-to-blackpink-rose-apt-and-fans-cannot-keep-calm-2622395-2024-10-24",
      "headline": "Watch: BTS J-hope dances to Blackpink Rose's APT and fans can't keep calmBTS' rapper and lead dancer J-hope recently delighted fans as he swayed to the beats of Blackpink Rose's new song with Bruno Mars, APT. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/the-tribe-alanna-panday-on-making-her-own-career-beyond-privileged-background-2622368-2024-10-24",
      "headline": "Alanna Panday on making her own career beyond 'privileged background'In an exclusive interview with us, social media influencer Alanna Panday, cousin of actor Ananya Panday, talked about navigating her own career path despite coming from a 'privileged background' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/alice-kaushik-says-will-never-do-bigg-boss-with-boyfriend-kanwar-dhillon-2622392-2024-10-24",
      "headline": "Actor Alice Kaushik says will never do Bigg Boss with boyfriend Kanwar DhillonActor Alice Kaushik, who is currently a participant of Bigg Boss 18, spoke to India Today Digital about doing the reality TV show with her boyfriend Kanwar Dhillon. Kanwar co-starred with Kaushik in The Pandya Store. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-rawalpindi-babar-azam-jason-gillespie-2622418-2024-10-24",
      "headline": "Babar Azam will return to peak form in all formats: Pakistan coach Jason GillespiePakistan men's Test coach Jason Gillespie backed Babar Azam to return to peak form and deliver for the senior national team across all formats of the game. Babar was dropped from the Test squad in the middle of their series against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-record-viewership-india-vs-new-zealand-2622417-2024-10-24",
      "headline": "Women's T20 World Cup sets new record in massive turnout in UAEThe Women's T20 World Cup witnessed a huge 30 percent increase in viewership from the 2023 edition. Sophie Devine's New Zealand won the tournament after beating Laura Wolvaardt's South Africa in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-south-africa-najmul-hossain-shanto-mehidy-hasan-mirpur-test-2622402-2024-10-24",
      "headline": "Mehidy showed character, but Bangladesh need collective efforts: ShantoBAN vs SA: Najmul Hossain Shanto said that Mehidy Hasan Miraz showed character with his 97-run knock in the second innings, but admitted that Bangladesh need collective efforts to improve in Test cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-new-zealand-women-first-odi-harmanpreet-kaur-rested-smriti-mandhana-ahmedabad-2622378-2024-10-24",
      "headline": "IND vs NZ: Harmanpreet Kaur rested for 1st ODI, Smriti Mandhana to leadIndia's captain Harmanpreet Kaur has been rested for the first ODI against New Zealand due to a niggle. Smriti Mandhana will take over the captaincy as India begins their series at the Narendra Modi Stadium in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-3rd-test-rawalpindi-harry-brook-sajid-khan-noman-ali-2622367-2024-10-24",
      "headline": "Harry Brook's love affair with Pakistan over? Star batter fails in Rawalpindi TestPakistan vs England, 3rd Test: Harry Brook, who began the tour with a triple hundred in Multan, has been struggling to put bat to ball ever since the pitches in Pakistan began favouring the spin bowlers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-past-nathan-lyon-7th-highest-wicket-taker-in-test-history-2622354-2024-10-24",
      "headline": "Ashwin goes past Lyon, becomes 7th highest wicket-taker in Test historyIndia vs New Zealand, Pune Test: Ravichandran Ashwin went past Australia's Nathan Lyon to become the seventh-highest wicket-taker in Test history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/inaugural-global-super-league-centrestage-lahore-qalandars-2622348-2024-10-24",
      "headline": "Global Super League set to hit centrestage on November 26 with 5 teamsLahore Qalandars and Rangpur Riders are amongst the five teams in the Inaugural Global Super League to be held from November 26 to December 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-barcelona-vs-bayern-munich-hansi-flick-reaction-el-clasico-2622351-2024-10-24",
      "headline": "Bayern Munich thrashing gives Barcelona confidence before El Clasico: Hansi FlickBarcelona boss Hansi Flick has claimed that the win over Bayern Munich in the Champions League will serve as a confidence booster for his side ahead of their El Clasico clash against Real Madrid in the weekend. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-qualification-scenario-south-africa-win-india-final-chance-2622337-2024-10-24",
      "headline": "How South Africa's win in Bangladesh has hurt India's WTC final chancesWorld Test Championship: South Africa's Mirpur Test win has shaken up the ICC World Test Championship standings, tightening the race for a top-two finish and complicating India's path to the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-south-africa-1st-test-kagiso-rabada-report-2622327-2024-10-24",
      "headline": "South Africa end 11-year wait with 7-wicket win vs Bangladesh South Africa beat Bangladesh by seven wickets and moved to fourth in the 2023-25 WTC standing. Kyle Verreynne won the Player of the Match award for his hundred in the first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-past-nathan-lyon-7th-highest-wicket-taker-in-test-history-2622354-2024-10-24",
      "headline": "Ashwin goes past Lyon, becomes 7th highest wicket-taker in Test historyIndia vs New Zealand, Pune Test: Ravichandran Ashwin went past Australia's Nathan Lyon to become the seventh-highest wicket-taker in Test history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/inaugural-global-super-league-centrestage-lahore-qalandars-2622348-2024-10-24",
      "headline": "Global Super League set to hit centrestage on November 26 with 5 teamsLahore Qalandars and Rangpur Riders are amongst the five teams in the Inaugural Global Super League to be held from November 26 to December 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-barcelona-vs-bayern-munich-hansi-flick-reaction-el-clasico-2622351-2024-10-24",
      "headline": "Bayern Munich thrashing gives Barcelona confidence before El Clasico: Hansi FlickBarcelona boss Hansi Flick has claimed that the win over Bayern Munich in the Champions League will serve as a confidence booster for his side ahead of their El Clasico clash against Real Madrid in the weekend. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-qualification-scenario-south-africa-win-india-final-chance-2622337-2024-10-24",
      "headline": "How South Africa's win in Bangladesh has hurt India's WTC final chancesWorld Test Championship: South Africa's Mirpur Test win has shaken up the ICC World Test Championship standings, tightening the race for a top-two finish and complicating India's path to the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-south-africa-1st-test-kagiso-rabada-report-2622327-2024-10-24",
      "headline": "South Africa end 11-year wait with 7-wicket win vs Bangladesh South Africa beat Bangladesh by seven wickets and moved to fourth in the 2023-25 WTC standing. Kyle Verreynne won the Player of the Match award for his hundred in the first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-tour-of-australia-ruturaj-gaikwad-squad-jet-off-ishan-kishan-2622326-2024-10-24",
      "headline": "Ruturaj Gaikwad-led India A jet off to Australia for first-class seriesThe India A team, led by Ruturaj Gaikwad, has jetted off to Australia for the first-class series against Australia A. The tour, which will begin on October 31, will see the side face the Indian senior team before the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-r-ashwin-nathan-lyon-world-test-championship-most-wickets-2622316-2024-10-24",
      "headline": "R Ashwin goes past Nathan Lyon to set new World Test Championship recordIndia vs New Zealand, 2nd Test: After picking two wickets in the first session on Thursday, R Ashwin also equalled Nathan Lyon on the all-time list of wicket-takers in Test cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-second-test-day-one-sarfaraz-khan-drs-review-virat-kohli-rohit-sharma-pune-2622310-2024-10-24",
      "headline": "Watch: Sarfaraz Khan, Virat Kohli convince Rohit Sharma for brilliant DRS callIn a thrilling moment during the Pune Test, Sarfaraz Khan and Virat Kohli's convincing arguments led Rohit Sharma to take a successful DRS review, dismissing New Zealand's Will Young. The decision received applause from both commentators and fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-add-cox-rehan-to-limited-overs-squad-west-indies-2622295-2024-10-24",
      "headline": "England add Cox and Rehan Ahmed to limited-overs squad for West Indies tourEngland have announced the inclusion of Jordan Cox and Rehan Ahmed in their white-ball squad for the West Indies tour. The team is set to play their first ODI in Antigua next Thursday, with Cox joining as a backup keeper due to Jos Buttler's injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-pune-test-washington-sundar-kuldeep-yadav-sanjay-manjrekar-2622283-2024-10-24",
      "headline": "Common sense selection: Sanjay Manjrekar justifies dropping Kuldeep for Pune TestIndia vs New Zealand, 2nd Test: Former batter Sanjay Manjrekar said he was able to understand why the Indian team management brought in Washington Sundar, replacing Kuldeep Yadav for the second Test in Pune. India played two off-spinners in their XI on a spin-friendly pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-withdraws-from-paris-masters-hints-at-early-end-to-season-2622279-2024-10-24",
      "headline": "Djokovic withdraws from Paris Masters, hints at early end to seasonNovak Djokovic announced his withdrawal from the Paris Masters, where he holds a record seven titles, a decision that could mark the conclusion of his tumultuous season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-pune-test-team-news-sunil-gavaskar-simon-doull-panic-washington-2622251-2024-10-24",
      "headline": "Panic in India camp? Pundits question 3 changes, Washington Sundar call for Pune TestIndia vs New Zealand: Former India captains Sunil Gavaskar and Anil Kumble reflected on India's playing XI after the hosts announced three changes for the 2nd Test in Pune. Washington Sundar, who was added late to the squad, was brought into the XI straightaway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-pune-test-washington-sundar-kuldeep-yadav-sanjay-manjrekar-2622283-2024-10-24",
      "headline": "Common sense selection: Sanjay Manjrekar justifies dropping Kuldeep for Pune TestIndia vs New Zealand, 2nd Test: Former batter Sanjay Manjrekar said he was able to understand why the Indian team management brought in Washington Sundar, replacing Kuldeep Yadav for the second Test in Pune. India played two off-spinners in their XI on a spin-friendly pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-withdraws-from-paris-masters-hints-at-early-end-to-season-2622279-2024-10-24",
      "headline": "Djokovic withdraws from Paris Masters, hints at early end to seasonNovak Djokovic announced his withdrawal from the Paris Masters, where he holds a record seven titles, a decision that could mark the conclusion of his tumultuous season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-pune-test-team-news-sunil-gavaskar-simon-doull-panic-washington-2622251-2024-10-24",
      "headline": "Panic in India camp? Pundits question 3 changes, Washington Sundar call for Pune TestIndia vs New Zealand: Former India captains Sunil Gavaskar and Anil Kumble reflected on India's playing XI after the hosts announced three changes for the 2nd Test in Pune. Washington Sundar, who was added late to the squad, was brought into the XI straightaway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-washington-sundar-kuldeep-yadav-pune-test-2622237-2024-10-24",
      "headline": "Washington Sundar, Akash Deep replace Kuldeep Yadav, Siraj for Pune TestIND vs NZ: India made three changes for the Pune Test, bringing in Washington Sundar, Akash Deep and Shubman Gill for Kuldeep Yadav, Mohammed Siraj and KL Rahul. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-kl-rahul-dropped-2nd-test-gautam-gambhir-backing-2622233-2024-10-24",
      "headline": "KL Rahul dropped from Pune Test days after backing from Gautam GambhirIndia vs New Zealand: India dropped KL Rahul, who scored only 0 and 12 runs in the first Test against New Zealand, from the playing XI for the second Test, which will be played at the Maharashtra Cricket Association (MCA) Stadium."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pt-usha-breaks-silence-on-2026-commonwealth-games-dropping-major-sports-2622221-2024-10-24",
      "headline": "PT Usha breaks silence on 2026 Commonwealth Games dropping major sportsThe Indian Olympic Association president, PT Usha, voiced concerns over the exclusion of wrestling, hockey, and badminton from the 2026 Commonwealth Games. Usha highlights the necessity of cost reduction and reassures the possibility of these sports returning in future editions."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}