{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-accounting-fraud-employees-under-scanner-posts-1st-quarterly-loss-in-nearly-20-years-2728290-2025-05-21",
      "headline": "IndusInd Bank posts first loss in nearly 2 decades, flags employee fraudIndusInd Bank said its Q4 numbers reflect the impact of all the discrepancies identified so far through ongoing investigations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/governments-notice-to-uber-over-advance-tip-feature-sources-say-similar-move-likely-against-rapido-2728285-2025-05-21",
      "headline": "After Uber, government likely to probe Rapido over advance tips for rideThe government crackdown on ride-hailing apps urging advance tipping may soon widen. After Uber, Rapido could be next in line for a probe over the controversial feature."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/uber-advance-tip-feature-government-notice-cab-services-rapido-ccpa-2728284-2025-05-21",
      "headline": "Government notice to Uber over 'advance tip' feature for faster serviceWhile booking a ride, Uber prompts users to tip Rs 50, 75, or 100 — not for service rendered, but for faster confirmation and pickup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-full-exemption-of-26-percent-reciprocal-tariff-2728230-2025-05-21",
      "headline": "India seeks full 26% tariff exemption in trade deal with US: ReportThe reciprocal duty, announced by the Trump administration on April 2, is currently suspended until July 9 under a 90-day pause meant to allow room for negotiations. The US's baseline 10% tariff, however, remains in place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/onion-glut-crashes-prices-across-maharashtra-farmers-count-losses-2728145-2025-05-21",
      "headline": "Onion glut crashes prices across Maharashtra, farmers count lossesIn Navi Mumbai's Vashi APMC—the main supplier of onions to the Mumbai Metropolitan Region—wholesale prices have dropped from Rs 35–40 per kilogram in February to just Rs 7–17 in May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-410-points-higher-nifty-above-24800-bajaj-finserv-gains-2-percent-2728139-2025-05-21",
      "headline": "Sensex ends 410 points higher; Nifty above 24,800; Bajaj Finserv gains 2%The S&P BSE Sensex gained 410.19 points to close at 81,596.63, while the NSE Nifty added 129.55 points to end at 24,813.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/can-sensex-hit-100000-in-12-months-heres-what-morgan-stanley-analyst-ridham-desai-says-2728127-2025-05-21",
      "headline": "Can Sensex hit 1,00,000 in 12 months? Here's what Morgan Stanley saysThe bull case, where Sensex hits 1 lakh within the next 12 months, rests on more aggressive assumptions: oil prices persistently below $65/barrel, progress on farm reforms, GST rate cuts, and CAGR of 19% in corporate earnings. Relief from global trade tensions would further fuel this scenario."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/leela-hotels-ipo-details-check-price-band-gmp-subscription-and-listing-date-2728116-2025-05-21",
      "headline": "Leela Hotels IPO details: Check price band, GMP, subscription and listing dateLeela Hotels IPO will open for bidding on May 26, 2025 and will close on May 28, 2025. Price band for the IPO has been set between Rs 413 and Rs 435 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-engineering-fraud-nfra-probe-financial-record-account-book-sebi-investigation-2728102-2025-05-21",
      "headline": "Gensol's books under review: NFRA launches preliminary probeIn April, Sebi took action against Gensol Engineering and its promoters brothers Anmol Jaggi and Puneet Jaggi. The market regulator barred the two from accessing the stock markets and called for a forensic audit into the affairs of the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/moody-credit-rating-agency-explains-india-economy-not-affected-tariff-threat-2728067-2025-05-21",
      "headline": "Explained : Why Moody's thinks tariffs won't slow down India's economyThe credit ratings agency said India is in a better position than many other emerging markets to handle the tariff challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/accenture-promotions-15000-india-six-month-delay-report-global-salary-hike-it-consulting-job-2728039-2025-05-21",
      "headline": "Accenture promotions: 15,000 India staff finally get nod, says reportAccenture will offer 50,000 promotions globally. The global consulting and technology firm, which is headquartered in Dublin, had initially planned to roll out promotions in December 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bengaluru-peepalco-group-ceo-ashish-singhal-middle-class-salary-crisis-2728029-2025-05-21",
      "headline": "'Biggest scam': Bengaluru CEO on India's silent middle-class salary crisisIn a LinkedIn post, PeepalCo Group CEO Ashish Singhal called India's middle-class salary stagnation amid soaring costs \"the biggest scam no one talks about\"."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rana-daggubati-venkatesh-rana-naidu-2-release-date-announced-2728359-2025-05-21",
      "headline": "Rana Naidu Season 2: Rana Daggubati's gritty actioner set for June releaseThe release date of Rana Daggubati and Venkatesh's 'Rana Naidu Season 2' has been announced. The makers shared the announcement with a fresh new promo on May 21. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/kapil-sharmas-shows-team-mourns-photographer-krishna-dass-death-he-was-family-2728340-2025-05-21",
      "headline": "Kapil Sharma's show's team mourns photographer Krishna Das's death: He was familyComedian Kiku Sharda and the team of Kapil Sharma's show expressed grief after the death of photographer Krishna Das. The team released an emotional statement. Dada, who was seen interacting with celebrities in The Kapil Sharma Show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zootopia-2-trailer-nick-and-judy-reunite-for-a-new-case-disney-unveils-fresh-faces-2728337-2025-05-21",
      "headline": "Zootopia 2 trailer: Nick and Judy reunite for a new case, Disney unveils fresh facesDisney has dropped the first 'Zootopia 2' trailer, reuniting the iconic duo with a fresh squad. Stealing the spotlight is Gary De'Snake, a hilarious new pit viper character.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-team-gets-emotional-as-it-receives-9-minute-standing-ovation-at-cannes-film-festival-2025-2728318-2025-05-21",
      "headline": "Homebound team gets emotional as it receives 9-minute standing ovation at CannesNeeraj Ghaywan's 'Homebound' received a heartwarming 9-minute standing ovation at the Cannes Film Festival 2025, leaving the cast and crew emotional. The only Indian feature at Cannes this year, the film has been praised for its powerful storytelling and performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-wife-aarti-files-petition-seeking-rs-40-lakh-monthly-alimony-2728322-2025-05-21",
      "headline": "Actor Ravi Mohan's wife Aarti files petition seeking Rs 40 lakh monthly alimonyRavi Mohan's estranged wife, Aarti, has demanded a hefty alimony of Rs 40 lakh per month in their ongoing divorce case. The couple appeared before the Chennai Family Court, where both filed their respective petitions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-unveils-magnum-opus-vrusshabha-first-look-back-in-warrior-king-mode-2728255-2025-05-21",
      "headline": "Mohanlal unveils Vrusshabha first look, back in warrior-king modeActor Mohanlal unveiled the first look of his upcoming magnum opus 'Vrusshabha' on his 65th birthday. The actor also shared a personal message for fans revealing the release date of the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-there-is-no-hera-pheri-without-paresh-rawals-baburao-ganpatrao-apte-2728247-2025-05-21",
      "headline": "Why there's no Hera Pheri without Paresh Rawal's Baburao Ganpatrao ApteParesh Rawal's portrayal of Baburao Ganpatrao Apte aka Babu Bhaiya in the 'Hera Pheri' franchise is considered one of his best performances. What makes it one of the most iconic cinematic portrayals in Hindi cinema? Why can nobody replace Rawal as Baburao? A glimpse at how the actor is an inevitable force of the 'Hera Pheri' franchise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/maranamass-director-sivaprasad-unconventional-dark-comedy-basil-joseph-tovino-thomas-2728229-2025-05-21",
      "headline": "Maranamass director discusses crafting unconventional dark comedy with Basil JosephMalayalam director Sivaprasad made a striking commercial debut with 'Maranamass', a dark comedy thriller that brings a fresh and experimental flavour to the industry. In an interview with us, he talked about how the film blends humour with unconventional storytelling to offer a unique cinematic experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/campus-beats-creator-on-k-dramas-popularity-in-india-exclusive-2728291-2025-05-21",
      "headline": "Campus Beats creator on K-dramas' popularity in India: We have nothing for youthCampus Beats, a dance-based fiction show created by Palki Malhotra, has resonated deeply with young Indian audiences by addressing their relatable experiences and emotions. The show's success highlights a gap in Indian youth content, especially when compared to the popularity of Korean dramas during the OTT boom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ex-pentagon-k-pop-artist-kino-wants-to-collaborate-with-wish-girl-band-reacts-exclusive-2728196-2025-05-21",
      "headline": "Ex-Pentagon member Kino wants to collaborate with W.i.S.H. Girl band reactsSouth Korean artist Kino expressed his desire to collaborate with Indian girl band W.i.S.H, sparking excitement among the group. The band members feel thrilled that their music has reached South Korea and are eager for future global collaborations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-gets-objectionable-item-song-lyrics-changed-in-hari-hara-veera-mallu-2728192-2025-05-21",
      "headline": "Pawan Kalyan gets objectionable item song lyrics changed in Hari Hara Veera MalluAhead of the release of 'Hari Hara Veera Mallu: Part 1 – Sword vs Spirit', music director MM Keeravani revealed that Pawan Kalyan had the item song lyrics rewritten to avoid objectification.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-brown-bail-london-assault-charge-music-producer-attack-tour-2728238-2025-05-21",
      "headline": "Chris Brown granted bail in London assault case ahead of world tourChris Brown was granted bail by a London court after a serious assault charge. This development allows his world tour to proceed despite ongoing legal challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rahul-bhat-on-playing-sanjay-gandhi-in-sudhir-mishra-summer-of-77-exclusive-2728146-2025-05-21",
      "headline": "Rahul Bhat on playing politician Sanjay Gandhi: Tried to get his aura rightRahul Bhat is gearing up to portray politician Sanjay Gandhi in Sudhir Mishra's 'Summer of 77', aiming to capture his unique aura. In an exclusive interview, he also opened up about the time when he met the politician as a child."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shabana-azmi-aparna-sen-ankur-tribute-shyam-benegal-50-years-cinema-2728138-2025-05-21",
      "headline": "Thank you for not doing it: Shabana Azmi to Aparna Sen for turning down AnkurVeteran actors Shabana Azmi and Aparna Sen came together at the Habitat Film Festival to honour late filmmaker Shyam Benegal. The event also celebrated Shabana's remarkable 50-year journey in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ar-rahman-collaboration-mani-ratnam-he-has-seen-my-growth-2728176-2025-05-21",
      "headline": "AR Rahman on long-standing collaboration with Mani Ratnam: He has seen my growthComposer AR Rahman, in an interview with India Today, opened up about his collaboration with director Mani Ratnam. He also shared that they have mutual respect for each other."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rahul-bhat-kennedy-release-delay-in-india-it-hurts-hope-it-releases-soon-exclusive-2728079-2025-05-21",
      "headline": "Rahul Bhat on Kennedy release delay: It hurts, hope it releases soonActor Rahul Bhat is hopeful about the release of his offbeat film 'Kennedy' this year despite its delay. He emphasises the need for dedicated theatres for such films and the importance of art reaching its audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-cannes-2025-backless-green-dress-brings-desi-drama-styled-by-rhea-kapoor-2728170-2025-05-21",
      "headline": "Janhvi Kapoor continues to bring desi drama at Cannes in backless dressActor Janhvi Kapoor is representing a bit of India at Cannes this year. She attended the premiere of her film 'Homeboound' in a green sculpted dress that came with backless detailing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-shooting-war-2-was-not-easy-we-have-given-our-everything-jr-ntr-2728165-2025-05-21",
      "headline": "Hrithik Roshan says shooting War 2 was not easy: We have given our everythingHrithik Roshan and Jr NTR starrer 'War 2' teaser released on May 20. Amid all the love from fans, Hrithik thanked fans and shared how making 'War 2' was not easy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/special-budget-separate-rooms-for-drugs-malayalam-producer-sandra-thomas-makes-explosive-claims-2728134-2025-05-21",
      "headline": "Special budget, separate rooms for drugs: Malayalam producer's explosive claimsActor-turned-producer Sandra Thomas has made shocking revelations about the drug crisis on Mollywood movie sets. She alleged that shooting often gets stalled because of the menace."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-flight-srinagar-hailstorm-rain-damaged-nose-delhi-weather-emergency-landing-2728347-2025-05-21",
      "headline": "Panic, cries as IndiGo flight hits turbulence, lands in Srinagar with broken noseAn IndiGo flight 6E2142 encountered severe hailstorm turbulence while approaching Srinagar, damaging the aircraft's nose cone while attempting to land. All passengers and crew members were evacuated safely upon landing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nambala-keshava-rao-basavaraju-killed-chhattisgarh-naxal-encounter-red-terror-2728416-2025-05-21",
      "headline": "Maoist Basavaraju killed: How 50-hour-long Op Kagar ended era of red terrorMaoist General Secretary Nambala Keshava Rao, aka Basavaraju, was killed in a 50-hour operation in Chhattisgarh's Abujhmad forests, dealing a major blow to the CPI (Maoist) leadership and network."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-declares-pak-high-commission-staffer-persona-non-grata-asks-official-to-leave-in-24-hours-2728320-2025-05-21",
      "headline": "Another Pak High Commission staffer expelled by India, second in 8 daysThe Pakistani High Commission official was declared persona non grata and asked to leave India within 24 hours."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-confronts-south-african-president-cyril-ramaphosa-over-white-genocide-claims-2728424-2025-05-21",
      "headline": "At White House, Trump confronts South African President over white genocide claimsIn a tense White House meeting, President Trump confronted South African President Cyril Ramaphosa with graphic claims of violence against white farmers, including a video and news clippings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/army-chief-puts-yunus-on-notice-what-it-means-for-a-beleaguered-bangladesh-2728339-2025-05-21",
      "headline": "Army chief puts Yunus on notice: What it means for a beleaguered BangladeshOn Wednesday, in a Durbar bringing together \"all available officers in combat uniform\" at Dhaka's Senaprangan, General Waker declared that the interim government will have to hold national elections by December this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/we-did-something-good-trump-again-claims-he-brokered-india-pakistan-ceasefire-glbs-2728455-2025-05-22",
      "headline": "We did something good: Trump again claims he brokered India-Pakistan ceasefireDonald Trump again claimed he brokered peace between India and Pakistan through trade and diplomacy, despite India rejecting any US role in de-escalating tensions or linking trade to a ceasefire.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abishek-porel-stumping-controversy-ipl-2025-mumbai-indians-delhi-capitals-2728432-2025-05-21",
      "headline": "Out or Not Out? Fans question controversial umpiring decision in MI's win over DCAbishek Porel's contentious stumping during Delhi Capitals' must-win match against Mumbai Indians at the Wankhede Stadium on Wednesday has sparked widespread debate, overshadowing what was otherwise a dominant 59-run win for the home side.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/india-first/video/operation-murshidabad-exposes-the-masterminds-of-riots-in-bengal-2728368-2025-05-21",
      "headline": "Operation Murshidabad exposes the masterminds of riots in BengalIn this episode of India First, watch India Today's special investigation Operation Murshidabad, which exposes how locals were involved in mobilising youth for the violence that took place in West Bengal's Murshidabad on April 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/aishwarya-rai-bachchan-cannes-2025-ivory-saree-sindoor-manish-malhotra-2728394-2025-05-21",
      "headline": "Ivory saree and sindoor: Aishwarya Rai Bachchan's regal Cannes comebackAishwarya Rai Bachchan returned to Cannes red carpet, clad in an elegant ivory saree by designer Manish Malhotra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/turkey-linked-aviation-firm-celebi-lost-clearance-tells-delhi-high-court-indian-employees-2728244-2025-05-21",
      "headline": "We are Indian, employees are Indians, Turkey-linked Celebi Aviation tells courtThe security clearance of Celebi Aviation was revoked on May 15, days after Turkey backed Pakistan and condemned India's strikes on terror camps in the neighbouring country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nambala-keshav-rao-naxal-top-commander-killed-chhattisgarh-encounter-2728178-2025-05-21",
      "headline": "Who was Basavaraju, 'backbone' of Naxal movement, killed in encounter?Nambala Keshav Rao was part of the Naxalite movement since the late 1970s and was one of its most feared strategists. He was killed in an encounter with security forces in Chhattisgarh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/whos-next-bjp-chief-nadda-kharge-congress-rahul-gandhi-party-president-2728219-2025-05-21",
      "headline": "Who's the next BJP chief? Naddaji, Khargeji, Kya farak padta jiThe answer to the question — who's the next BJP chief — is a question — does it really matter? The party president's post in both the BJP and the Congress comes with great responsibilities, and little power. In the BJP, the party chief is in the driving seat of a Tesla Autopilot, steered remotely. But at least, its present and future are safe."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/video-intense-turbulence-srinagar-bound-indigo-flight-2728412-2025-05-21",
      "headline": "Help, help, passenger cries out on Srinagar-bound IndiGo flight amid turbulencePassengers onboard IndiGo flight 6E-2142 from Delhi to Srinagar experienced a terrifying ordeal mid-air as the aircraft was caught in a severe hailstorm. The turbulence was so intense that it damaged the nose cone of the plane. A dramatic video shot by a passenger captures the chaos inside the cabin — shaky visuals, jolting movements, and a chilling cry for \"Help, help\" from one of the fliers. Watch the tense moments as the flight battled the storm before landing safely."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/massive-dust-storm-rain-in-parts-of-delhi-ncr-wind-speed-at-79-kmph-2728341-2025-05-21",
      "headline": "Big storm, heavy rain and hailstorm in Delhi-NCR, metro lines affectedVisuals from Delhi-NCR showed trees swaying violently as winds whip through the streets. Visibilty reduced sharply due to dust storm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-score-playoffs-qualification-mumbai-2728428-2025-05-21",
      "headline": "Clinical MI crush Delhi Capitals, reach playoffs after familiar resurgenceIPL 2025, MI vs DC: Suryakumar Yadav's well-paced 73 and a spin-bowling masterclass from Mitchell Santner helped Mumbai Indians hammer Delhi Capitals by 59 runs and qualify for the playoffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-there-is-no-hera-pheri-without-paresh-rawals-baburao-ganpatrao-apte-2728247-2025-05-21",
      "headline": "Why there's no Hera Pheri without Paresh Rawal's Baburao Ganpatrao ApteParesh Rawal's portrayal of Baburao Ganpatrao Apte aka Babu Bhaiya in the 'Hera Pheri' franchise is considered one of his best performances. What makes it one of the most iconic cinematic portrayals in Hindi cinema? Why can nobody replace Rawal as Baburao? A glimpse at how the actor is an inevitable force of the 'Hera Pheri' franchise. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-weather-heavy-rain-flights-delayed-cancelled-airport-dust-storm-hail-2728390-2025-05-21",
      "headline": "50 flights delayed, 10 diverted as storm impacts Delhi airport operationsParts of Delhi-NCR witnessed massive storms, heavy rain and hailstorms and the city saw a 14 degrees Celsius drop in temperature."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-nita-ambani-celebration-viral-playoffs-2728453-2025-05-22",
      "headline": "Watch: Nita Ambani's No. 6 celebration goes viral after MI reach IPL playoffsIPL 2025 MI vs DC: Following Mumbai Indians' commanding 59-run win over Delhi Capitals on Wednesday, owner Nita Ambani was seen holding up six fingers, telling the world that the five-time champions are coming for the big prize. MI became the fourth and final team to qualify for the playoffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/governments-notice-to-uber-over-advance-tip-feature-sources-say-similar-move-likely-against-rapido-2728285-2025-05-21",
      "headline": "After Uber, government likely to probe Rapido over advance tips for rideThe government crackdown on ride-hailing apps urging advance tipping may soon widen. After Uber, Rapido could be next in line for a probe over the controversial feature."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/singapore-woman-meets-indian-origin-ceo-piyush-gupta-bali-plot-twist-it-was-not-him-dbs-bank-linkedin-post-2728243-2025-05-21",
      "headline": "Woman meets Indian-origin CEO 'Piyush Gupta' in Bali. Plot twist: It wasn't himJanney Hujic, a Singapore-based professional, shared a detailed account of what she believed was a meaningful conversation with the Indian-origin CEO.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-weather-heatwave-feels-like-temperature-higher-humidity-factor-2728396-2025-05-21",
      "headline": "Why Delhi feels hotter than it is: The science behind 50 degrees heat stressDelhi is reeling under intense heat, with 'feels like' temperatures soaring to 50°C despite actual readings staying lower. High humidity is driving up both the heat index and wet bulb temperature, making conditions dangerously uncomfortable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/court-pauses-provision-granting-tamil-nadu-government-authority-to-appoint-vice-chancellors-to-universities-2728314-2025-05-21",
      "headline": "Court pauses provision granting Tamil Nadu authority to appoint vice-chancellorsThe Madras High Court has stayed Tamil Nadu's amended Acts that gave the Chief Minister power to appoint vice-chancellors, reigniting the legal tussle between the Governor and the state government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indus-canal-water-protests-pakistan-sindh-boils-two-activists-dead-pak-army-asim-munir-minister-home-torched-2728086-2025-05-21",
      "headline": "Sindh turns battlefield over Pak Army's Indus canals, 2 shot deadNorthern Sindh turned into a \"virtual battlefield\" as people protesting against the Pakistan Army's Indus canals project set oil tankers and a minister's house on fire. Two activists were killed and 15 injured as police opened fire. PPP leader Bilawal Bhutto and his party were criticised by Sindhi activists, who blame Punjab's dominance for their woes."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-nita-ambani-celebration-viral-playoffs-2728453-2025-05-22",
      "headline": "Watch: Nita Ambani's No. 6 celebration goes viral after MI reach IPL playoffsIPL 2025 MI vs DC: Following Mumbai Indians' commanding 59-run win over Delhi Capitals on Wednesday, owner Nita Ambani was seen holding up six fingers, telling the world that the five-time champions are coming for the big prize. MI became the fourth and final team to qualify for the playoffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-suryakumar-yadav-reaction-man-of-the-match-73-vs-delhi-capitals-2728451-2025-05-22",
      "headline": "Suryakumar recalls wife's sweet story after ending wait for POTM awardIPL 2025, MI vs DC: Suryakumar Yadav dedicated his Player of the Match award to his wife after his match-winning 73-run knock helped Mumbai Indians hammer Delhi Capitals by 59 runs to book a place in the playoffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abishek-porel-stumping-controversy-ipl-2025-mumbai-indians-delhi-capitals-2728432-2025-05-21",
      "headline": "Out or Not Out? Fans question controversial umpiring decision in MI's win over DCAbishek Porel's contentious stumping during Delhi Capitals' must-win match against Mumbai Indians at the Wankhede Stadium on Wednesday has sparked widespread debate, overshadowing what was otherwise a dominant 59-run win for the home side.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-score-playoffs-qualification-mumbai-2728428-2025-05-21",
      "headline": "Clinical MI crush Delhi Capitals, reach playoffs after familiar resurgenceIPL 2025, MI vs DC: Suryakumar Yadav's well-paced 73 and a spin-bowling masterclass from Mitchell Santner helped Mumbai Indians hammer Delhi Capitals by 59 runs and qualify for the playoffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-suryakumar-yadav-73-reaction-2728418-2025-05-21",
      "headline": "Suryakumar Yadav finds joy in long-awaited rescue act, smashes 43-ball 73IPL 2025, MI vs DC: Suryakumar Yadav played an uncharacteristic knock, waiting for his moment before going big. The experienced batter hit 73 off 43 balls to help Mumbai post 180 in a crunch game on Wednesday, May 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/andrew-balbirnie-ireland-beat-west-indies-by-124-runs-in-1st-odi-2728399-2025-05-21",
      "headline": "IRE vs WI: Andrew Balbirnie, bowlers set up historic 124-win in 1st ODIIreland registered a historic 124-win over West Indies in the first ODI of the three-match series in Dublin. Andrew Balbirnie and Barry McCarthy were the top performers for the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-lsg-gujarat-titans-assistant-coach-matthew-wade-press-conference-2728393-2025-05-21",
      "headline": "Gujarat Titans opts for innovative training to keep middle order match-readyGujarat Titans assistant coach Matthew Wade revealed that the management has introduced a 'no nets up' training method to help the middle-order batters get accustomed to match situations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-hopes-backs-arshdeep-singh-and-shreyas-iyer-to-be-picked-for-england-tests-2728377-2025-05-21",
      "headline": "PBKS bowling coach backs Arshdeep and Shreyas to be picked for England TestsPunjab Kings' bowling coach James Hopes has backed Arshdeep Singh and Shreyas Iyer to be picked in the Indian Test squad for the upcoming series against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-lsg-matthew-wade-on-jos-buttler-absence-playoff-2728361-2025-05-21",
      "headline": "GT not worried about Buttler's absence in playoffs, others will step up: WadeGujarat Titans assistant coach Matthew Wade was confident that GT's untested middle order will step up in Jos Buttler's absence during the IPL 2025 playoffs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-sumit-nagal-exits-second-round-qualifying-2728349-2025-05-21",
      "headline": "Sumit Nagal fails to make it to French Open main draw, loses in qualifyingFrench Open 2025: India's top-ranked singles player Sumit Nagal failed to qualify for the main draw of the Roland Garros. He lost to lower-ranked Jurij Rodionov of Austria in straight sets in the second round of qualifying tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-continues-left-arm-seam-woes-falls-prey-to-mustafizur-rahman-2728338-2025-05-21",
      "headline": "Rohit Sharma continues left-arm seam woes, falls prey to Mustafizur RahmanMumbai Indians opening batter Rohit Sharma once again got dismissed by a left-arm seamer against Delhi Capitals (DC) as he fell prey to Mustafizur Rahman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-lsg-gujarat-titans-assistant-coach-matthew-wade-press-conference-2728393-2025-05-21",
      "headline": "Gujarat Titans opts for innovative training to keep middle order match-readyGujarat Titans assistant coach Matthew Wade revealed that the management has introduced a 'no nets up' training method to help the middle-order batters get accustomed to match situations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-hopes-backs-arshdeep-singh-and-shreyas-iyer-to-be-picked-for-england-tests-2728377-2025-05-21",
      "headline": "PBKS bowling coach backs Arshdeep and Shreyas to be picked for England TestsPunjab Kings' bowling coach James Hopes has backed Arshdeep Singh and Shreyas Iyer to be picked in the Indian Test squad for the upcoming series against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-lsg-matthew-wade-on-jos-buttler-absence-playoff-2728361-2025-05-21",
      "headline": "GT not worried about Buttler's absence in playoffs, others will step up: WadeGujarat Titans assistant coach Matthew Wade was confident that GT's untested middle order will step up in Jos Buttler's absence during the IPL 2025 playoffs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-sumit-nagal-exits-second-round-qualifying-2728349-2025-05-21",
      "headline": "Sumit Nagal fails to make it to French Open main draw, loses in qualifyingFrench Open 2025: India's top-ranked singles player Sumit Nagal failed to qualify for the main draw of the Roland Garros. He lost to lower-ranked Jurij Rodionov of Austria in straight sets in the second round of qualifying tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-continues-left-arm-seam-woes-falls-prey-to-mustafizur-rahman-2728338-2025-05-21",
      "headline": "Rohit Sharma continues left-arm seam woes, falls prey to Mustafizur RahmanMumbai Indians opening batter Rohit Sharma once again got dismissed by a left-arm seamer against Delhi Capitals (DC) as he fell prey to Mustafizur Rahman."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}