{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-chair-jerome-powell-signals-possible-september-rate-cut-cites-rising-job-market-risks-2775428-2025-08-22",
      "headline": "US Fed chair signals possible September rate cut, cites rising job market risksUS Federal Reserve Chair Jerome Powell's comments open the door to a rate cut at the Fed's September 16-17 meeting, but also put heavy weight on jobs and inflation reports that will be received before then."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/schengen-visa-price-hike-europe-trip-plan-costly-rise-hike-upset-trip-budget-2775365-2025-08-22",
      "headline": "Planning Europe trip? Schengen visa hike may upset your trip budgetThe Schengen visa allows travellers to visit 29 European countries for up to 90 days within a 180-day period. Applicants must submit standard documents, including travel plans, insurance, and financial proof."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/avadhut-sathe-sebi-raid-pune-finfluencer-karjat-trading-academy-2775356-2025-08-22",
      "headline": "Sebi strikes at finfluencer Avadhut Sathe's Karjat Trading AcademyThe action followed complaints that penny stocks were being promoted during his training sessions, allegedly presented as classroom examples while encouraging students to invest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/which-bank-offers-higher-1-year-fd-see-rates-from-hdfc-icici-sbi-and-3-others-2775342-2025-08-22",
      "headline": "Which bank offers higher 1-year FD? See rates from HDFC, ICICI, SBI and 3 othersMost lenders usually announce similar interest rates on one-year deposits, making it seem as if there isn't much of a difference in where you invest. However, a closer look at the latest rates reveals small but meaningful variations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-694-points-lower-nifty-below-25000-asian-paints-down-2-percent-2775268-2025-08-22",
      "headline": "Sensex closes 694 points lower, Nifty below 25,000; Asian Paints down 2%The S&P BSE Sensex closed 694 points lower at 81.306.85 points, while the NSE Nifty50 declined by 213.65 points to end at 24,870.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/this-investor-cut-his-rs-10-lakh-tax-bill-to-0-heres-the-trick-2775257-2025-08-22",
      "headline": "This investor cut his Rs 10 lakh tax bill to 0. Here's howMany taxpayers assume that once the financial year ends, their chance to save tax is gone.and Ramesh was no exception. But instead of rushing, he used a little-known route that brought his tax bill down to nothing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-vikran-engineering-anlon-healthcare-market-listings-gmp-patel-vikram-solar-gem-shreeji-2775259-2025-08-22",
      "headline": "Dalal Street gears up for busy week with 5 market debuts, 2 IPOs in pipelineMangal Electrical Industries is set to debut on August 28 after finalising its allotment on August 25. Patel Retail, Vikram Solar, Gem Aromatics, and Shreeji Shipping Global will all list on August 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wealthy-asian-families-bet-big-on-crypto-report-2775211-2025-08-22",
      "headline": "Wealthy Asian families bet big on crypto: ReportThe growing interest comes as Bitcoin recently hit an all-time high of over $124,000. New rules, such as Hong Kong's stablecoin legislation and the United States' GENIUS Act, have further boosted confidence in the sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/money-based-gaming-ban-rocks-advertising-sports-sponsorships-whats-at-stake-2775202-2025-08-22",
      "headline": "Real-money gaming ban rocks advertising, sports sponsorships: What's at stake?The rise of money-based platforms created billions in advertising spend, now facing a sudden halt. This article examines how the ban on real-money gaming is reshaping India's advertising, sports sponsorships, and emerging e-sports opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cibil-credit-score-rating-how-to-improve-loans-emis-transparent-trans-union-personal-finance-2775191-2025-08-22",
      "headline": "Credit score confusion: Is CIBIL transparent enough in deciding your financial fate?The credit score by CIBIL can decide whether someone gets a car loan, a home loan, or even a credit card. Yet, very few actually know how CIBIL works or who controls it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2024-25-comparing-deductions-under-old-and-new-tax-regime-2775132-2025-08-22",
      "headline": "ITR filing 2024–25: Comparing deductions under old and new tax regimeFiling your Income Tax Return for FY 2024–25? Before you decide on old or new tax regime, it's important to know how deductions differ. The right choice could help reduce your taxable income and overall tax burden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-middle-class-feels-stuck-between-taxes-and-emis-explains-ca-2775094-2025-08-22",
      "headline": "Why middle class feels stuck between taxes and EMIs, explains CAThe burden is not just about taxes. Price hikes on fuel, food, education, and healthcare hit the middle class the hardest. Unlike the rich, they cannot hedge against inflation with high-value assets. Unlike the poor, they don't receive government relief."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-mother-in-law-shows-off-dance-moves-fans-praise-her-confidence-2775782-2025-08-23",
      "headline": "SRK's mother-in-law shows-off dance moves, fans praise her confidence. WatchActor Shah Rukh Khan's mother-in-law was captured dancing with her son in a viral video. Fans says, now they understand where Gauri gets her confidence from."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-trial-2-trailer-kajol-jisshu-sengupta-tense-battle-takes-centre-stage-2775738-2025-08-23",
      "headline": "The Trial 2 trailer: Kajol and Jisshu Sengupta's marital battle takes centre stageActor Kajol returns with Season 2 of 'The Trial: Pyaar, Kanoon, Dhokha' on JioHotstar. The trailer teases more twists, courtroom clashes, and political intrigue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-lakshya-lalwani-sahher-bambba-chemistry-shines-in-badli-si-hawa-track-2775720-2025-08-23",
      "headline": "The Ba***ds of Bollywood: Lakshya, Sahher's chemistry shines in Badli Si Hawa trackThe first song from Aryan Khan's upcoming release 'The Ba***ds of Bollywood' is out. Titled 'Badli Si Hawa', the track highlights the chemistry between Lakshya and Sahher Bambba. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/daisy-shah-says-ex-partner-objected-to-her-working-with-male-co-stars-2775709-2025-08-23",
      "headline": "Daisy Shah says ex-partner objected to her working with male co-starsActor Daisy Shah recently spoke about having been in two relationships with toxic men. Here's what she shared."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-when-and-where-to-watch-salman-khan-show-confirmed-contestants-and-more-2775708-2025-08-23",
      "headline": "BB 19: When and where to watch Salman Khan show, confirmed contestants and moreWith just a day left for the grand premiere of Salman Khan-hosted 'Bigg Boss 19', fans are excited to know more about the show and the stars entering the show as contestants. Read to know more here.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-team-denies-malaysia-meet-and-greet-fake-unauthorised-2775685-2025-08-23",
      "headline": "Rajinikanth's team denies actor's ties with Malaysia meet and greet, calls it fakeActor Rajinikanth's team has dismissed reports of a meet and greet in Malaysia. In a statement on social media, they called it fake and unauthorised. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-town-3-0-mumbai-taemin-super-junior-de-yedam-debut-indian-kpop-festival-2775689-2025-08-23",
      "headline": "Taemin and D&E to perform in India for first time at K-Town 3.0Mumbai will host K-Town 3.0, a major Korean cultural festival, on November 1, 2025. The event marks significant K-pop debuts in India and highlights the rising Hallyu wave."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shruti-haasan-reacts-to-unfair-tag-on-coolie-role-preethi-its-someone-elses-vision-lokesh-kanagaraj-rajinikanth-2775669-2025-08-23",
      "headline": "Shruti Haasan reacts to unfair tag on Coolie role: It's someone else's visionActor Shruti Haasan responded to a fan who asked if her role in Rajinikanth's 'Coolie' was unfair. The actor wrote how it was all about someone else's vision. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saira-banu-joins-x-on-81st-birthday-to-talk-about-life-memories-of-dilip-kumar-2775670-2025-08-23",
      "headline": "Saira Banu joins X on 81st birthday to talk about life, memories of Dilip saabVeteran actor Saira Banu celebrated her 81st birthday on August 23. Marking the occasion, she made her debut on X, and shared a heartfelt photograph with her late husband, Dilip Kumar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-saif-ali-khan-reunite-after-17-years-haiwaan-shoot-2775636-2025-08-23",
      "headline": "Khiladi Akshay, Anaari Saif reunite after 17 years as they start Haiwaan shootAfter 17 years, Akshay Kumar and Saif Ali Khan have come together once again for the upcoming film 'Haiwaan'. Helmed by Priyadarshan, the movie commenced shooting today in Kochi, Kerala.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-praises-siddhant-chaturvedi-triptii-dimri-complex-roles-in-dhadak-2-thanks-censor-board-2775634-2025-08-23",
      "headline": "KJo praises Siddhant, Triptii's complex roles in Dhadak 2, thanks censor boardKaran Johar, in a lengthy note, gave a shout-out to the entire team of 'Dhadak 2', including leads Siddhant Chaturvedi and Triptii Dimri.  He even thanked the censor board for their guidance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/paradha-review-an-honest-non-preachy-film-that-lays-bare-everyday-patriarchy-2775612-2025-08-23",
      "headline": "Paradha review: An honest, non-preachy film that lays bare everyday patriarchyRelease Date:Fri Aug 22, 2025Paradha movie review: Director Praveen Kandregula's 'Paradha', starring Anupama Parameswaran, Darshana Rajendran and Sangeetha Krish, is a thoughtful film on patriarchy, women coming out of their shells and sisterhood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/25-years-later-smriti-irani-amar-upadhyay-relive-kyunki-saas-bhi-kabhi-bahu-thi-scene-2775609-2025-08-23",
      "headline": "25 years later, Smriti Irani and Amar Upadhyay relive their iconic Kyunki sceneActor-politician Smriti Irani's scene from 'Kyunki Saas Bhi Kabhi Bahu Thi', in which Tulsi and Mihir accidentally collide, was a firm favourite among fans in the early 2000s."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywood-swipes-right-on-love-again-saiyaara-metro-in-dino-param-sundari-sidharth-malhotra-trade-expert-metro-in-dino-2774604-2025-08-23",
      "headline": "Bollywood swipes right on love again: Films rediscover romance but for how long?With the latest romantic releases like 'Saiyaara', 'Metro In Dino', Bollywood is witnessing a fresh wave of romance on the big screen. Directors and actors agree that romance never truly disappeared-it just evolved with changing times."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/mouni-roy-shuts-down-troll-mocking-looks-with-choose-better-surgeon-remark-2775571-2025-08-23",
      "headline": "Mouni Roy shuts down troll mocking her looks with choose better surgeon remarkActor Mouni Roy recently responded to a negative comment about her appearance on social media. The actor reacted to a troll who suggested she consult a better surgeon for her surgeries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hostage-review-an-ambitious-thriller-derailed-by-emotional-histrionics-cliches-2775542-2025-08-23",
      "headline": "Hostage review: An ambitious thriller derailed by emotional histrionics and clichesRelease Date:Thu Aug 21, 2025Hostage review: The show reflects on the humane aspect of world leaders involved in geopolitical negotiations and strategic decision-making. Is the series worth your time? Here is our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-thankful-mammootty-recovery-prayed-for-him-in-sabarimala-2775557-2025-08-23",
      "headline": "Mohanlal thankful for Mammootty's recovery: Prayed for him at SabarimalaVeteran actor Mohanlal expressed his happiness over Mammootty's recovery amid a health scare. During the promotion of his upcoming film 'Hridayapoorvam', the actor said that he prayed for the 73-year-old in Sabarimala. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/5-times-salman-khan-proved-no-one-can-host-bigg-boss-better-than-him-2775309-2025-08-23",
      "headline": "5 times Salman Khan proved no one can host Bigg Boss better than himActor Salman Khan has been hosting 'Bigg Boss' since Season 4, which aired in 2010. Over the span of 15 years, the actor has navigated through some of the biggest controversies the show has ever seen and shown how no one can host the show better than him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-salman-khan-hints-first-contestant-fans-guess-awez-darbar-2775549-2025-08-23",
      "headline": "Bigg Boss 19: Salman Khan hints at first contestant, fans say Awez DarbarIn a new promo video, Salman Khan teased the first contestant to enter the house. The face was not revealed, but fans guessed him as dancer Awez Darbar."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-post-to-suspend-us-bound-parcels-from-august-29-after-new-american-duty-rules-2775703-2025-08-23",
      "headline": "India Post suspends US-bound parcels from August 25 after new American duty rulesIndia Post will suspend the booking of all types of articles for the US from August 25, except for letters, documents, and gift items valued up to USD 100."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/people-tired-of-repeated-voting-piyush-goyal-pushes-for-one-nation-one-election-2775743-2025-08-23",
      "headline": "People tired of repeated voting: Piyush Goyal pushes for One Nation One ElectionThe \"One Nation, One Election\" proposal envisages integrating and synchronising Lok Sabha and all state assembly elections to reduce election frequency, administrative costs, and disruptions caused by staggered polls. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/dharmasthala-mass-burial-case-whistleblower-arrested-for-false-evidence-lying-skull-2775587-2025-08-23",
      "headline": "Big twist in Dharmasthala case, whistleblower arrested for giving false evidencePolice sources revealed that the skull initially produced by the whistleblower was fake. He was later arrested on charges of perjury and furnishing false evidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jaishankar-opens-up-on-trumps-foreign-policy-on-tariffs-india-pakistan-russian-oil-purchase-2775641-2025-08-23",
      "headline": "Never had a US President who...: S Jaishankar lays into Trump's foreign policyMinister of External Affairs S Jaishankar said he found it \"funny\" that those working for a \"pro-business American administration\" were not minding their own business and were instead \"accusing others of doing business.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amit-shah-corrupt-neta-removal-bills-opposition-ministers-arrest-2775699-2025-08-23",
      "headline": "12 Opposition ministers arrested since 2014, most would've lost post under new billNo sitting ministers from the BJP or NDA were arrested in this period; 10 of the arrests were made by the CBI and the ED."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/heavy-rain-thunderstorms-lash-delhi-ncr-red-alert-for-next-3-hours-2775781-2025-08-23",
      "headline": "Heavy rain, thunderstorms lash Delhi-NCR, red alert for next 3 hoursThe red alert came as several areas of Delhi received showers on Saturday afternoon, bringing some relief from the humid weather."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/syrian-gang-raises-money-from-gujarat-mosques-in-name-of-gaza-victims-1-arrested-2775715-2025-08-23",
      "headline": "Syrian gang raises money from Gujarat mosques in name of Gaza victims, 1 arrestedThe arrested accused told the police that the money collected from mosques was actually being used to \"fund their lavish lifestyle\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indian-astronauts-share-what-gaganyaan-mission-can-do-for-earth-2775745-2025-08-23",
      "headline": "Indian astronauts share what Gaganyaan mission can do for EarthSpeaking at a panel discussion on the occasion of National Space Day, astronaut Shubhanshu Shukla, along with other Gaganyaan astronauts, stressed the transformative nature of seeing Earth from orbit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywood-swipes-right-on-love-again-saiyaara-metro-in-dino-param-sundari-sidharth-malhotra-trade-expert-metro-in-dino-2774604-2025-08-23",
      "headline": "Bollywood swipes right on love again: Films rediscover romance but for how long?With the latest romantic releases like 'Saiyaara', 'Metro In Dino', Bollywood is witnessing a fresh wave of romance on the big screen. Directors and actors agree that romance never truly disappeared-it just evolved with changing times."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/indian-man-shares-8-point-take-on-dark-side-of-life-after-returning-from-us-viral-reddit-post-2775693-2025-08-23",
      "headline": "Indian man shares 8-point take on 'dark side' of life after returning from USPosting on the subreddit r/returnToIndia, he titled his post \"Regrets of Moving Back to India - The Dark Side (Truth) Nobody Warns You About\" and offered a candid account of his struggles after returning."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/boy-5-found-dead-in-trains-washroom-at-mumbai-railway-station-2775732-2025-08-23",
      "headline": "Boy, 5, found dead in train's washroom at Mumbai railway stationThe body of a 5-year-old was found by cleaning staff, inside the toilet of AC coach B2 of the Kushinagar Express, during routine maintenance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/iit-bombay-students-turn-chandrayaan-2-data-into-fresh-lunar-discoveries-2775694-2025-08-23",
      "headline": "IIT Bombay students decode Moon's secrets with Chandrayaan-2 dataIIT Bombay students have taken data from India's Chandrayaan-2 mission to study the Moon's surface in greater detail. Their work focuses on understanding lunar chemistry, offering fresh insights into the minerals present on the Moon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-mother-in-law-shows-off-dance-moves-fans-praise-her-confidence-2775782-2025-08-23",
      "headline": "SRK's mother-in-law shows-off dance moves, fans praise her confidence. WatchActor Shah Rukh Khan's mother-in-law was captured dancing with her son in a viral video. Fans says, now they understand where Gauri gets her confidence from."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/days-after-online-gambling-ban-ed-arrests-congress-mla-kc-veerendra-seizes-rs-12-crore-2775691-2025-08-23",
      "headline": "Days after online gambling ban, ED arrests Congress MLA, seizes Rs 12 croreDuring the searches, the ED seized approximately Rs 12 crore in cash, including Rs 1 crore in foreign currency, gold jewellery worth around Rs 6 crore, 10 kg of silver articles, and four high-end vehicles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-appoints-sergio-gor-us-ambassador-to-india-amid-tariff-hike-and-political-challenges-2775539-2025-08-23",
      "headline": "Meet Sergio Gor, Trump's India envoy pick Elon Musk once called 'a snake'Sergio Gor is considered one of the most powerful behind-the-scenes figures in Trump's team and had reportedly played a key role in the fallout between Donald Trump and Elon Musk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mp-chief-minister-mohan-yadav-questions-makhan-chor-tag-for-krishna-congress-hits-back-2775596-2025-08-23",
      "headline": "Mohan Yadav questions 'makhan chor' tag for Lord Krishna, Congress hits backMadhya Pradesh Chief Minister Mohan Yadav's objection to calling Lord Krishna \"makhan chor\" during a Janmashtami event has sparked a political row. Yadav described the term as improper, saying Krishna's fondness for butter symbolised a rebellion against Kansa."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/up-police-search-for-spider-man-after-stunt-videos-at-meerut-clock-tower-go-viral-2775748-2025-08-23",
      "headline": "UP Police search for 'Spider-Man' after stunt videos at Meerut clock tower go viralUttar Pradesh Police is looking for a man in Meerut after videos of him performing dangerous stunts in a Spider-Man costume went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-516-22-08-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musk-announces-macrohard-an-ai-run-microsoft-clone-that-could-replace-human-workers-2775579-2025-08-23",
      "headline": "Elon Musk announces Macrohard, AI-run Microsoft clone that could replace humanElon Musk has recently dropped another AI plan, which may see the light of day soon. Musk defines Macrohard, a firm that will function as a purely AI software company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-novak-djokovic-masters-press-conference-2775739-2025-08-23",
      "headline": "Family first, Slams second: Djokovic explains skipping Masters before US OpenNovak Djokovic skipped the Toronto and Cincinnati Masters to prioritise family time, saying he now focusses mainly on Grand Slams rather than ranking points. Ahead of his US Open opener, the 38-year-old admitted he may even miss his daughter's birthday during the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/handwriting-anxiety-fear-of-writing-trauma-psychology-explained-2775409-2025-08-23",
      "headline": "The lost art of handwriting: Why pen and paper terrify so manyHandwriting may seem like a harmless task, but for many, it triggers panic, pain, and deep-rooted memories of humiliation. In India, where exams and careers still demand pen-and-paper skills, this fear creates real barriers. As digital life takes over, handwriting anxiety reveals both a generational struggle and an urgent call for recognition and change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-when-and-where-to-watch-salman-khan-show-confirmed-contestants-and-more-2775708-2025-08-23",
      "headline": "BB 19: When and where to watch Salman Khan show, confirmed contestants and moreWith just a day left for the grand premiere of Salman Khan-hosted 'Bigg Boss 19', fans are excited to know more about the show and the stars entering the show as contestants. Read to know more here.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/susan-polgar-defends-gukesh-kasparov-world-chess-championship-2775785-2025-08-23",
      "headline": "Susan Polgar defends D Gukesh after Gary Kasparov world championship jibeSusan Polgar has jumped to the defence of D Gukesh after Garry Kasparov took a jibe at the Indian grandmaster over his World Championship win. Gukesh won the title in 2024 when he defeated Ding Liren in Decemeber. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/gen-z-treat-culture-overburden-wallet-2774760-2025-08-23",
      "headline": "Why treat culture is draining Gen Z's wallets (and also their minds)Gen Z loves treating themselves on good days and bad, but these seemingly harmless, mood-boosting indulgences come with hidden costs - mental and financial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-mother-in-law-shows-off-dance-moves-fans-praise-her-confidence-2775782-2025-08-23",
      "headline": "SRK's mother-in-law shows-off dance moves, fans praise her confidence. WatchActor Shah Rukh Khan's mother-in-law was captured dancing with her son in a viral video. Fans says, now they understand where Gauri gets her confidence from."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/alia-bhatt-back-in-mumbai-with-soni-razdan-shields-rahas-face-from-paps-video-2775761-2025-08-23",
      "headline": "Alia Bhatt back in Mumbai with Soni Razdan, shields Raha's face from paps. VideoActor Alia Bhatt, her mother Soni Razdan, and friend Akansha Ranjan Kapoor arrived in Mumbai. Her daughter Raha also joined her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/daisy-shah-says-ex-partner-objected-to-her-working-with-male-co-stars-2775709-2025-08-23",
      "headline": "Daisy Shah says ex-partner objected to her working with male co-starsActor Daisy Shah recently spoke about having been in two relationships with toxic men. Here's what she shared."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-team-denies-malaysia-meet-and-greet-fake-unauthorised-2775685-2025-08-23",
      "headline": "Rajinikanth's team denies actor's ties with Malaysia meet and greet, calls it fakeActor Rajinikanth's team has dismissed reports of a meet and greet in Malaysia. In a statement on social media, they called it fake and unauthorised. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/susan-polgar-defends-gukesh-kasparov-world-chess-championship-2775785-2025-08-23",
      "headline": "Susan Polgar defends D Gukesh after Gary Kasparov world championship jibeSusan Polgar has jumped to the defence of D Gukesh after Garry Kasparov took a jibe at the Indian grandmaster over his World Championship win. Gukesh won the title in 2024 when he defeated Ding Liren in Decemeber. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-south-africa-keshav-maharaj-t20i-odi-squads-2775775-2025-08-23",
      "headline": "After No.1 ODI ranking, Keshav Maharaj earns T20I recall for England tourKeshav Maharaj returns to South Africa's ODI and T20I squads after claiming the No.1 ICC ODI bowler ranking, while Lizaad Williams, Marco Jansen, David Miller, and Donovan Ferreira also rejoin the white-ball side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/suraj-narredu-shergar-cup-ascot-2400-wins-no-recognition-2775772-2025-08-23",
      "headline": "Narredu on why winning Shergar title in Ascot is historic for Indian horse racingIndian jockey Suraj Narredu reflects on his historic Shergar Cup win at Ascot and why the feat is monumental for horse racing in India during an exclusive interaction with India Today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/malaysia-hockey-team-arrival-hero-asia-cup-2025-rajgir-2775746-2025-08-23",
      "headline": "Hero Asia Cup 2025: Malaysia become 1st team to reach Rajgir ahead of tournamentMalaysia became the first team to reach Rajgir ahead of the start of the Hero Asia Cup 2025. Malaysia finished as runners-up in the last edition and is aiming for another podium finish this time around. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-novak-djokovic-masters-press-conference-2775739-2025-08-23",
      "headline": "Family first, Slams second: Djokovic explains skipping Masters before US OpenNovak Djokovic skipped the Toronto and Cincinnati Masters to prioritise family time, saying he now focusses mainly on Grand Slams rather than ranking points. Ahead of his US Open opener, the 38-year-old admitted he may even miss his daughter's birthday during the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-on-shah-rukh-khan-arrange-chartered-flight-2775714-2025-08-23",
      "headline": "Shah Rukh Khan took me on a chartered flight after team India snub: Rinku SinghIndia and Kolkata Knight Riders (KKR) batter Rinku Singh revealed how his IPL team owner Shah Rukh Khan asked him to travel on a special chartered flight with him after Rinku's team India snub."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-trains-hard-at-lords-poses-with-fans-after-practice-2775701-2025-08-23",
      "headline": "Virat Kohli trains hard at Lord's, poses with fans after practiceStar India batter Virat Kohli was recently spotted posing for photos with fans after his training session at Lord's. Kohli is enjoying time with his family ahead of his return to international cricket in October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/raghvi-bist-india-a-vs-australia-a-womens-test-2775697-2025-08-23",
      "headline": "Raghvi Bist brilliance lifts India A hopes in gripping Test vs Australia ARaghvi Bist's classy 86 guided India A Women to 260 for eight in their second innings, extending their lead to 254 runs on Day 3 in Brisbane. The contest remains evenly poised, with Australia A needing early breakthroughs on the final morning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/xlg-dragon-ranger-gaming-qualify-vct-china-valorant-champions-2025-paris-2775695-2025-08-23",
      "headline": "XLG, DRG secure final 2 spots for VALORANT Champions 2025 from ChinaXLG Esports and Dragon Ranger Gaming (DRG) have officially secured the final two spots from the VCT China region for VALORANT Champions 2025 in Paris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-damien-priest-clashes-with-aleister-black-after-r-truths-smackdown-2775684-2025-08-23",
      "headline": "WWE: Damien Priest clashes with Aleister Black after R-Truth's SmackDown mix-upSmackDown Dublin took an unexpected turn when R-Truth, set to face Aleister Black, hilariously revealed he had flown to Dublin, Georgia instead of Dublin, Ireland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-novak-djokovic-andrew-castle-grand-slams-2775682-2025-08-23",
      "headline": "Djokovic is done in terms of winning Grand Slams: Former British No.1Andrew Castle feels Novak Djokovic's Grand Slam-winning days may be over, with Carlos Alcaraz and Jannik Sinner emerging as dominant forces. The Serb, stuck on 24 majors since the 2023 US Open, faces doubts about adding a 25th title amid younger rivals' rise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-trains-hard-at-lords-poses-with-fans-after-practice-2775701-2025-08-23",
      "headline": "Virat Kohli trains hard at Lord's, poses with fans after practiceStar India batter Virat Kohli was recently spotted posing for photos with fans after his training session at Lord's. Kohli is enjoying time with his family ahead of his return to international cricket in October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/raghvi-bist-india-a-vs-australia-a-womens-test-2775697-2025-08-23",
      "headline": "Raghvi Bist brilliance lifts India A hopes in gripping Test vs Australia ARaghvi Bist's classy 86 guided India A Women to 260 for eight in their second innings, extending their lead to 254 runs on Day 3 in Brisbane. The contest remains evenly poised, with Australia A needing early breakthroughs on the final morning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/xlg-dragon-ranger-gaming-qualify-vct-china-valorant-champions-2025-paris-2775695-2025-08-23",
      "headline": "XLG, DRG secure final 2 spots for VALORANT Champions 2025 from ChinaXLG Esports and Dragon Ranger Gaming (DRG) have officially secured the final two spots from the VCT China region for VALORANT Champions 2025 in Paris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-damien-priest-clashes-with-aleister-black-after-r-truths-smackdown-2775684-2025-08-23",
      "headline": "WWE: Damien Priest clashes with Aleister Black after R-Truth's SmackDown mix-upSmackDown Dublin took an unexpected turn when R-Truth, set to face Aleister Black, hilariously revealed he had flown to Dublin, Georgia instead of Dublin, Ireland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-novak-djokovic-andrew-castle-grand-slams-2775682-2025-08-23",
      "headline": "Djokovic is done in terms of winning Grand Slams: Former British No.1Andrew Castle feels Novak Djokovic's Grand Slam-winning days may be over, with Carlos Alcaraz and Jannik Sinner emerging as dominant forces. The Serb, stuck on 24 majors since the 2023 US Open, faces doubts about adding a 25th title amid younger rivals' rise."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}