{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-claim-denials-material-change-clause-hidden-in-fine-print-2800524-2025-10-10",
      "headline": "Hidden in fine print: This silent clause can hike your health insurance premiumThe Material Change clause in health policies can let insurers raise premiums or limit coverage after a claim, but policyholders can challenge it to protect their lifelong renewability and benefits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-sanctions-over-50-entities-including-indians-over-links-to-iran-oil-trade-glbs-2800775-2025-10-10",
      "headline": "US sanctions over 50 entities, including Indians, over links to Iran oil tradeAmong those sanctioned are Varun Pula, Soniya Shrestha, and Iyappan Raja, all Indian nationals accused of facilitating shipments of Iranian oil and LPG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/7-alternative-ways-to-diversify-your-portfolio-this-diwali-2800429-2025-10-09",
      "headline": "7 alternative ways to diversify your portfolio this DiwaliAs Diwali approaches, many are thinking about not just celebrations but also financial planning. Diversifying your portfolio across multiple assets can help manage risk and make your money work harder in the long run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-history-seizing-opportunity-and-waging-war-at-sea-in-the-early-years-2800578-2025-10-09",
      "headline": "Tata history: Seizing opportunity and waging war at sea in the early yearsEmerging from the colonial opium and cotton trades and a transformative Abyssinian contract, the Tata family overcame crises to pioneer Indian textile manufacturing and challenge imperial monopolies, shaping a nationalist industrial legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tcs-q2-results-pat-profit-revenue-it-stocks-dividend-rs-11-it-firm-financial-result-2800496-2025-10-09",
      "headline": "TCS Q2 FY26 results: Profit rises 1.4% to Rs 12,075 croreThe company's net profit grew 1.4% year-on-year to Rs 12,075 crore, compared with Rs 11,909 crore in the same quarter last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/priya-kapur-cinderella-stepmother-karisma-kapurs-children-allege-she-shifted-sunjay-kapur-assets-to-her-kids-2800487-2025-10-09",
      "headline": "Priya Kapur a Cinderella stepmother, Karisma's children allege in assets battleKarisma Kapur's children have accused Priya Kapur of giving them \"Cinderella stepmother\" treatment by diverting Sanjay Kapur's assets to her own children, limiting their shares, and intensifying the dispute over the allegedly forged will."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-in-green-metal-it-shares-rise-tcs-q2-results-2800467-2025-10-09",
      "headline": "Metal, IT stock help markets end higher ahead of TCS Q2 resultsThe S&P BSE Sensex added 398.44 points to end at 82,172.10, while the NSE Nifty50 gained 135.65 points to close at 25,181.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-international-funding-dispute-rs-1000-crore-rift-noel-tata-trust-members-report-2800405-2025-10-09",
      "headline": "Funding dispute at Tata International behind deepening rift in Tata Trusts: ReportThe Rs 1,000 crore capital infusion plans for the loss-making Tata International, chaired by Noel Tata, has turned into the latest flashpoint in the widening divide within one of India's most powerful charitable trusts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/radhika-gupta-explains-why-a-5050-gold-silver-split-works-for-investors-2800385-2025-10-09",
      "headline": "Radhika Gupta explains why a 50:50 gold–silver split works for investorsRadhika Gupta explains how a balanced approach to gold and silver investing can help investors navigate volatility with ease."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-refiners-russian-oil-payment-chinese-yuan-benefit-explained-2800368-2025-10-09",
      "headline": "Has India started paying for Russian oil in Chinese yuan?Traders supplying Russian crude have reportedly asked Indian state refiners to settle a few recent shipments in yuan instead of the usual dollars or UAE dirhams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/forbes-india-100-richest-list-mukesh-ambani-net-worth-centibillionaire-gautam-adani-jindal-2800340-2025-10-09",
      "headline": "Mukesh Ambani only centibillionaire in Forbes India's 100 RichestWith a net worth of $105 billion, Ambani has maintained his lead as the country's wealthiest individual. At the second position is Gautam Adani and family, with a fortune of $92 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-anniversary-ads-irony-internal-feud-tata-group-tata-sons-2800330-2025-10-09",
      "headline": "Irony unfolds: Front-page ads hail Ratan Tata as guiding light amid internal feudThe internal turmoil within Tata Trusts, the majority shareholder in Tata Sons, has coincided with the first death anniversary of Ratan Tata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/how-is-jewar-international-airport-shaping-noidas-next-big-real-estate-boom-2800323-2025-10-09",
      "headline": "How is Jewar International Airport shaping Noida's next big real estate boomBeyond serving as a travel gateway, Jewar International Airport is poised to power NCR's economic and real estate growth. The project has already fuelled rising demand in areas like the Yamuna Expressway, Noida Extension, and Greater Noida."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-and-silver-prices-dip-slightly-after-record-highs-should-you-buy-or-sell-2800305-2025-10-09",
      "headline": "Gold and silver prices dip slightly after record highs. Should you buy or sell?After touching record highs earlier this week, gold and silver prices cooled off slightly on Thursday as investors booked profits. With both metals still near lifetime peaks, the big question is—should you buy the dip or wait for further correction?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pharma-stocks-india-trump-tariff-on-medicines-generic-drug-exports-aurobindo-pharma-lupin-cipla-2800276-2025-10-09",
      "headline": "Pharma shares rally after report hints tariff relief for genericsThe Nifty Pharma and Healthcare indices opened strong, gaining 1.14% each, as optimism spread across the market. Almost all major pharmaceutical and healthcare companies traded higher."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/looking-to-invest-these-stocks-could-be-worth-your-money-2800257-2025-10-09",
      "headline": "Looking to invest? These stocks could be worth your moneyMarket experts suggest that metals, healthcare, banking, and even commodities like silver continue to show strength and could offer attractive short-term opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-today-key-expectations-layoffs-growth-margin-pressure-h1b-visa-2800246-2025-10-09",
      "headline": "TCS Q2 results: From layoffs to muted growth expectations, 8 key things to knowTCS's Q2 results will set the tone for India's $250-billion IT industry, testing its resilience amid layoffs, wage pressures, and AI disruption. It will also reveal whether India's tech titan can still outpace global headwinds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/lupin-stock-price-rises-new-pharma-facility-in-us-2800225-2025-10-09",
      "headline": "Lupin share price rises over 3% in early trade. What's driving the rally?At around 9:28 am, shares of Lupin were trading at Rs 1,968.75, up Rs 63.05, or 3.31%, on the Bombay Stock Exchange (BSE). Read to know what's driving the rally in shares of the pharma company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-q2-earnings-tcs-earnings-2800219-2025-10-09",
      "headline": "Sensex, Nifty gain as Q2 earnings remain in focus; pharma stocks gainAt around 9:21 am, the S&P BSE Sensex was trading 92.15 points higher at 81,865.81, while the NSE Nifty50 rose 40 points to 25,086.15. Broader market indices also saw modest gains, indicating a largely positive but measured start to the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-ipo-subscription-gmp-listing-gains-allotment-date-profit-for-investors-day-3-2800202-2025-10-09",
      "headline": "LG Electronics IPO: Here's how much you can earn per share if you bid todayLG India IPO has received a strong response from investors since opening for subscription on October 7. According to exchange data available till October 8 (Day 2), the issue was subscribed 3.33 times overall. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-47-day-46-written-updates-malti-chahar-cooking-refusal-tanya-mittal-captaincy-task-2800743-2025-10-09",
      "headline": "Bigg Boss 19 episode 47: Malti Chahar's refusal to cook irks entire house All the 'Bigg Boss 19' contestants turned their backs on wild card contestant Malti Chahar after she refused to do her kitchen duty. The latter was also seen warning Tanya Mittal about her perceived image outside the show during the captaincy task. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-defends-8-hour-work-demand-slams-industry-bias-spirit-kalki-2898-ad-sandeep-reddy-vanga-2800715-2025-10-09",
      "headline": "Deepika Padukone defends 8-hour work demand, slams industry bias Actor Deepika Padukone has addressed the controversy surrounding her departure from 'Spirit' and 'Kalki 2898 AD'. She pointed out that a lot of male actors have been working for 8 hours a day for years. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vedang-raina-sharvari-wagh-golden-temple-visit-imtiaz-ali-directorial-film-2800649-2025-10-09",
      "headline": "Vedang Raina starts Imtiaz Ali's next, visits Golden Temple with Sharvari Ahead of his new film's shoot, actor Vedang Raina visited the Golden Temple with his next co-star, Sharvari Wagh. The film is directed by Imtiaz Ali and also stars Diljit Dosanjh and Naseeruddin Shah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/maarigallu-puneeth-rajkumar-in-animated-avatar-as-karnatakas-first-king-2800680-2025-10-09",
      "headline": "Maarigallu: Puneeth Rajkumar in animated avatar as Karnataka's first king Four years on, Puneeth Rajkumar's legacy comes alive in 'Maarigallu', a bold blend of animation, heritage, and heartfelt tribute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-exits-s-s-rajamouli-dadasaheb-phalke-project-here-is-why-2800650-2025-10-09",
      "headline": "Jr NTR exits S S Rajamouli's Dadasaheb Phalke project. Here's why Jr NTR has reportedly stepped away from the Dadasaheb Phalke biopic, citing creative choices and timing as key reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/punjabi-actor-varinder-ghuman-dies-due-to-heart-attack-in-amritsar-2800656-2025-10-09",
      "headline": "Punjabi actor Varinder Singh Ghuman dies due to heart attack in Amritsar Punjabi actor Varinder Singh Ghuman died due to a heart attack in Amritsar. He featured as the lead actor in the Punjabi film 'Kabaddi Once Again' in 2012 and later appeared in several Bollywood films. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pooja-bhatt-on-not-judging-mahesh-bhatt-as-a-child-when-he-came-home-intoxicated-2800615-2025-10-09",
      "headline": "Pooja Bhatt on not judging Mahesh Bhatt as a child when he came home intoxicated Filmmaker Mahesh Bhatt opened up about a painful childhood moment on his daughter Pooja Bhatt's podcast. Their conversation revealed deep family emotions and complex relationships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-monster-season-4-production-ella-beatty-lizzie-borden-2800641-2025-10-09",
      "headline": "Netflix's Monster returns: Lizzie Borden takes the spotlight in Season 4 Netflix announced the fourth season of its acclaimed true-crime series 'Monster', this time focusing on the infamous Lizzie Borden case. The new season promises a compelling portrayal of the historic murders featuring a talented ensemble cast led by Ella Beatty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tollywoods-iconic-pair-nagarjuna-and-tabu-to-reunite-for-king-100-report-2800501-2025-10-09",
      "headline": "Tollywood's iconic pair Nagarjuna and Tabu to reunite for King 100: Report Tollywood's beloved pair, Nagarjuna and Tabu, are reportedly set to reunite on the big screen with a meaty collaboration for Nagarjuna's iconic 100th project, sparking excitement among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-vrusshabha-gets-new-release-date-misses-diwali-2025-2800553-2025-10-09",
      "headline": "Mohanlal's Vrusshabha gets new release date, misses Diwali 2025 Mohanlal's much-anticipated period action drama 'Vrusshabha' now moves out of the Diwali race, setting its sights on a November 6 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-ss-rajamoulis-ssmb29-title-locked-varanasi-2800606-2025-10-09",
      "headline": "Mahesh Babu and SS Rajamouli's SSMB29 title locked, work underway: Report The long-speculated SS Rajamouli and Mahesh Babu global adventure film might finally have a title, and it seems deeply rooted in Indian culture and mythology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-kardashian-alls-fair-legal-drama-trailer-jiohotstar-2025-2800607-2025-10-09",
      "headline": "All's Fair trailer: Kim Kardashian and Sarah Paulson lock horns in legal drama Kim Kardashian stars with Sarah Paulson in Ryan Murphy's legal drama 'All's Fair'. The trailer previews a fierce rivalry and sharp dialogue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-film-haal-lands-in-trouble-as-censor-board-cites-religious-concerns-2800609-2025-10-09",
      "headline": "Censor Board flags beef biryani scene in Malayalam film Haal, makers move High Court The Censor Board has ordered cuts in the Malayalam film 'Haal' citing religious sensitivities, following which the makers have approached the Kerala High Court. Starring Shane Nigam and featuring songs by Atif Aslam, the film remains a major release despite the controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shehnaaz-gill-touching-message-for-brother-shehbaz-badesha-2800540-2025-10-09",
      "headline": "You protect me from evil: Shehnaaz Gill's touching message for brother Shehbaz Shehnaaz Gill shared a heartfelt message for her brother, Shehbaz Badesha, who is currently participating in 'Bigg Boss 19.' The actor-singer expressed her gratitude and explained how much her brother has done for her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/maharani-season-4-trailer-rani-bharti-national-politics-sony-liv-2800602-2025-10-09",
      "headline": "Maharani Season 4 trailer: Huma Qureshi as Rani Bharti eyes national politics Actor Huma Qureshi is set to return in the fourth season of 'Maharani', with her character Rani Bharti now setting her sights on the national political stage. The trailer for the series is out now. Watch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/richa-chadha-explains-homebound-failure-monopoly-killing-independent-cinema-2800595-2025-10-09",
      "headline": "Richa Chadha explains Homebound failure, says monopoly killing independent cinema Actor Richa Chadha voiced support for producers following Karan Johar's remarks on the challenges of making another 'Homebound'. She highlighted issues like high ticket prices and monopolies restricting independent films' reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/who-is-kavita-banerjee-the-actor-engaged-to-uttaran-fame-nandish-sandhu-2800596-2025-10-09",
      "headline": "Who is Kavita Banerjee, the actor engaged to Uttaran fame Nandish Sandhu? TV actor Nandish Singh Sandhu has announced his engagement to Kavita Banerjee, leaving fans delighted. Banerjee is a fellow TV actor, who has featured in shows like 'Bhagya Lakshmi' and 'Rishton Ka Manjha'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/navjot-singh-sidhu-jokes-kapil-sharma-looked-45-with-pot-belly-2800545-2025-10-09",
      "headline": "Navjot Singh Sidhu jokes Kapil Sharma looked 45 with pot-belly in early days Former cricketer Navjot Singh Sidhu discussed Kapil Sharma's early challenges and rise in comedy. Sidhu recounts a meeting with former US President George W Bush regarding 'Sidhuism'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/nandish-sandhu-kavita-banerjee-engagement-private-ceremony-2025-2800563-2025-10-09",
      "headline": "Uttaran actor Nandish Sandhu announces engagement to Kavita Banerjee Television actor Nandish Sandhu and Kavita Banerjee announced their engagement on social media. Industry colleagues and fans congratulated the couple online."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/fir-filed-against-2-haryana-top-cops-over-officers-suicide-after-wife-alleges-years-of-harassment-in-compl-2800721-2025-10-09",
      "headline": "Case against 2 Haryana top cops on complaint of wife of officer who died by suicideOn Tuesday, Y Puran Kumar allegedly shot himself in the head with his service revolver while seated on a chair at his house in Sector 11, Chandigarh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-speaks-to-trump-congratulates-him-on-success-of-historic-gaza-peace-plan-reviews-trade-talk-progress-2800676-2025-10-09",
      "headline": "PM Modi speaks to Trump, Netanyahu; congratulates them on Gaza peace dealEarlier in the day, PM Modi welcomed Trump's announcement of Israel and Hamas agreeing to the first phase of his 20-point Gaza peace plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-south-africa-report-richa-ghosh-vizag-2800716-2025-10-09",
      "headline": "Nadine's sensational 84 trumps Richa's 94 as South Africa stun India in VizagWomen's World Cup: Richa Ghosh's stunning 94 went in vain as Nadine de Klerk powered South Africa to a three-wicket win, ending India's imperfect unbeaten run in the group clash at the ACA–VDCA Cricket Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/pk-fields-rk-mishra-doctors-mathematician-gives-identity-to-jan-suraaj-prashant-kishore-bihar-polls-bhagalpur-riots-2800598-2025-10-09",
      "headline": "PK fields supercop, doctors, mathematician, gives identity to Jan SuraajPrashant Kishor's Jan Suraaj has released the list of 51 candidates for the upcoming Bihar Assembly polls. Among the candidates, PK's party has fielded a supercop who helped control the 1989 Bhagalpur riots, several doctors and a renowned mathematician. By fielding these imminent personalities, PK has given an identity to his political start-up, which he has asserted is different from the traditional parties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/mount-everests-true-discoverer-radhanath-sikdar-who-was-overlooked-by-history-2800414-2025-10-09",
      "headline": "Everest didn't find Everest: An Indian did, and history forgot himRadhanath Sikdar was the first person to calculate the height of Mount Everest in 1852. He did it using different stations. Yet when the world learned of the tallest peak, it wasn't his name that stayed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israeli-cabinet-approves-outline-deal-release-hostages-held-hamas-glbs-2800773-2025-10-10",
      "headline": "Israeli Cabinet approves outline of Gaza deal to release hostages held by HamasA brief statement from Prime Minister Benjamin Netanyahu's office said the Cabinet approved the \"outline\" of a deal to release the hostages, without mentioning other aspects of the plan that are more controversial."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/blast-rocks-kabul-taliban-launches-probe-says-no-information-on-casualties-yet-2800781-2025-10-10",
      "headline": "Blast rocks Kabul, Taliban launches probe, says no information on casualties yetSeveral explosions rocked the Afghan capital, Kabul, late Thursday evening, according to local eyewitnesses and the Taliban administration. It remains unclear who caused the blasts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/symbol-of-social-poison-rahul-gandhi-targets-bjp-rss-over-punjab-cops-suicide-2800648-2025-10-09",
      "headline": "Symbol of social poison: Rahul Gandhi targets BJP, RSS over Haryana cop's suicideCongress leader Rahul Gandhi condemned the suicide of Haryana IPS officer Y Puran Kumar, describing it as a symbol of the \"deepening social poison\" of caste-based discrimination. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gaza-war-update-is-war-in-palestine-finally-over-will-peace-last-israel-hamas-conflict-trump-netanyahu-agreement-2800654-2025-10-09",
      "headline": "Gaza war ends, finally. But how long will peace last?After more than two years of war, Israel and Hamas have agreed to halt hostilities and release hostages and prisoners under a US-brokered deal. The truce, mediated by Egypt, Qatar, and Turkey, marks the first real sign of peace since the 2023 attacks, but deep mistrust and fragile politics threaten to shatter the calm again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-nobel-peace-prize-2025-unlikely-to-win-top-contenders-2800491-2025-10-09",
      "headline": "Why it may not be a good Friday for TrumpWhile Donald Trump's confidence is as grand as ever on winning the Nobel Peace Prize, the probability of him joining the ranks of Roosevelt and Obama seems far-fetched. We delve into the reasons behind it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bsp-chief-mayawati-kanshi-ram-lucknow-rally-samajwadi-party-congress-bjp-2027-assembly-election-explained-2800389-2025-10-09",
      "headline": "Mayawati returns with a massive rally: What woke up the slumbering elephant?After years of silence and dwindling electoral fortune, Mayawati's BSP is stirring things up. On Thursday, Mayawati addressed a BSP rally that was also a show of strength. Lucknow got painted in the BSP blue. Mayawati attacked the Samajwadi Party and the Congress, in a bid to reclaim her political space and constituents.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/benjamin-netanyahu-pauses-security-cabinet-meet-to-speak-with-pm-modi-on-gaza-peace-deal-glbs-2800758-2025-10-10",
      "headline": "Netanyahu pauses security cabinet meet to speak with PM Modi on Gaza peace dealIsraeli PM Netanyahu paused a cabinet meeting on the Gaza peace deal to speak with PM Modi, who congratulated him on the agreement and reaffirmed India's support for peace and cooperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/i-am-an-orthopaedic-doctor-dr-amyn-rajani-and-this-is-how-i-care-for-my-knees-and-bones-2799793-2025-10-09",
      "headline": "I am an orthopaedic doctor and this is how I care for my knees and bonesAn orthopaedic surgeon reveals his golden rules for maintaining joint health through balanced exercise and nutrition. Every extra kilo adds more stress to the knees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-2025-preview-delhi-pitch-team-news-2800608-2025-10-09",
      "headline": "IND vs WI 2nd Test: Nearing perfection, India aim for 1st clean sweep under Gill eraIND vs WI 2nd Test preview: After a thumping win in Ahmedabad, the Indian team will be looking to complete their first clean sweep under the leadership of captain Shubman Gill. With bigger challenges awaiting, the hosts will look to keep their foot on the gas and secure the win against a West Indies team that has struggled to find answers to their perennial issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/nobel-committee-expected-to-overlook-trump-despite-his-claim-of-ending-eight-wars-glbs-2800765-2025-10-10",
      "headline": "Nobel Committee expected to overlook Trump despite his claim of ending 'eight wars'Donald Trump claims he ended eight wars and deserves the honour, even as the Norwegian Nobel Committee is expected to overlook him again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-is-shatrujeet-kapur-haryana-top-cop-named-in-ips-officers-suicide-case-2800745-2025-10-09",
      "headline": "Who is Shatrujeet Kapur? Haryana top cop named in IPS officer's suicide caseShatrujeet Kapur, the Haryana DGP and former head of the state's Anti-Corruption Bureau, is in the spotlight following the suicide of senior IPS officer Y Puran Kumar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-defends-8-hour-work-demand-slams-industry-bias-spirit-kalki-2898-ad-sandeep-reddy-vanga-2800715-2025-10-09",
      "headline": "Deepika Padukone defends 8-hour work demand, slams industry biasActor Deepika Padukone has addressed the controversy surrounding her departure from 'Spirit' and 'Kalki 2898 AD'. She pointed out that a lot of male actors have been working for 8 hours a day for years. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-warns-poll-panel-bjp-over-sir-exercise-bengal-2800645-2025-10-09",
      "headline": "Even British feared Bengal, Mamata Banerjee warns poll panel, BJP over SIR exerciseMamata Banerjee invoked Bengal's history as a reminder of the state's political strength and warned the BJP and the Election Commission to \"not play with fire\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-bumper-sales-are-expected-this-festive-season-2799799-2025-10-08",
      "headline": "Why bumper sales are expected this festive seasonSpending is likely to rise due to GST cuts, income tax relief, pent-up demand from the past few quarters and a decline in inflation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/radicalism-has-no-space-in-democratic-societies-pm-urges-uks-starmer-to-act-against-khalistani-extremists-2800586-2025-10-09",
      "headline": "PM flags Khalistani extremism in meeting with Starmer: Need to move against themVikram Misri described Keir Starmer's visit as \"truly a partnership for the people\", highlighting that India and the UK are working together on multiple fronts to benefit citizens of both countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/brazilian-influencers-death-after-fox-eyes-surgery-exposes-beauty-cultures-dark-side-2800538-2025-10-09",
      "headline": "The beauty trend that went too far and ended in tragedyThe Brazilian influencer's death post 'fox eyes' surgery has reignited conversations around the risks of cosmetic enhancements and how easily social media trends can blur the line between self-expression and self-endangerment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/priya-kapur-cinderella-stepmother-karisma-kapurs-children-allege-she-shifted-sunjay-kapur-assets-to-her-kids-2800487-2025-10-09",
      "headline": "Priya Kapur a Cinderella stepmother, Karisma's children allege in assets battleKarisma Kapur's children have accused Priya Kapur of giving them \"Cinderella stepmother\" treatment by diverting Sanjay Kapur's assets to her own children, limiting their shares, and intensifying the dispute over the allegedly forged will."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-odi-captaincy-snub-sourav-ganguly-groom-shubman-gill-2800666-2025-10-09",
      "headline": "Rohit Sharma captaincy snub: Happened to me and Dravid as well, says GangulySourav Ganguly commented on Rohit Sharma's ODI captaincy snub and said that it happens with players towards the end of their careers. Ganguly felt it was the right call to groom Shubman Gill as the new captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/netanyahu-tries-to-manifest-a-nobel-win-for-trump-with-ai-image-2800667-2025-10-09",
      "headline": "He deserves it: Netanyahu's AI-powered hype for Trump's Nobel bidOn the eve of the announcement of the Nobel Peace Prize, Israeli Prime Minister Benjamin Netanyahu shared an AI-generated image of him with Trump with the Nobel medal around his neck."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-defends-8-hour-work-demand-slams-industry-bias-spirit-kalki-2898-ad-sandeep-reddy-vanga-2800715-2025-10-09",
      "headline": "Deepika Padukone defends 8-hour work demand, slams industry biasActor Deepika Padukone has addressed the controversy surrounding her departure from 'Spirit' and 'Kalki 2898 AD'. She pointed out that a lot of male actors have been working for 8 hours a day for years. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vedang-raina-sharvari-wagh-golden-temple-visit-imtiaz-ali-directorial-film-2800649-2025-10-09",
      "headline": "Vedang Raina starts Imtiaz Ali's next, visits Golden Temple with SharvariAhead of his new film's shoot, actor Vedang Raina visited the Golden Temple with his next co-star, Sharvari Wagh. The film is directed by Imtiaz Ali and also stars Diljit Dosanjh and Naseeruddin Shah."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-predicted-xi-will-bumrah-get-rested-2800760-2025-10-10",
      "headline": "India vs West Indies 2nd Test predicted XI: Will Bumrah get rested in Delhi? India look to complete a 2-0 series victory over West Indies in Delhi. Team management may look to rest Jasprit Bumrah or Mohammed Siraj ahead of the South Africa Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nadine-de-klerk-unbeaten-84-powers-south-africa-win-over-india-womens-world-cup-2025-2800751-2025-10-10",
      "headline": "Nadine lost for words after pulling of incredible heist against India in Vizag Nadine de Klerk's unbeaten 84 helped South Africa chase down 252 against India in a thrilling World Cup match. The win ended their five-match losing streak against India and revived their campaign after an early setback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-reaction-india-vs-south-africa-womens-world-cup-2025-2800754-2025-10-10",
      "headline": "IND vs SA: Harmanpreet Kaur rues India's batting frailty after South Africa loss India captain Harmanpreet Kaur rued the batting woes of her side as they slumped to a 3-wicket loss to South Africa in Vizag on Thursday, October 9. India's top and middle-order issues were exposed again by South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-south-africa-report-richa-ghosh-vizag-2800716-2025-10-09",
      "headline": "Nadine's sensational 84 trumps Richa's 94 as South Africa stun India in Vizag Women's World Cup: Richa Ghosh's stunning 94 went in vain as Nadine de Klerk powered South Africa to a three-wicket win, ending India's imperfect unbeaten run in the group clash at the ACA–VDCA Cricket Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/new-zealand-vs-bangladesh-womens-world-cup-amelia-kerr-press-conference-2800724-2025-10-09",
      "headline": "How New Zealand plans to tackle Bangladesh's spin threat? Amelia Kerr explains Amelia Kerr said that New Zealand are wary of the spin threat posed by Bangladesh and explained how they plan to tackle it during their clash on Friday, October 10 in Guwahati. New Zealand are chasing their first win of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/amelia-kerr-praises-sophie-devine-womens-world-cup-2025-ban-vs-nz-2800719-2025-10-09",
      "headline": "Sophie Devine has been so switched on for World Cup 2025: Amelia Kerr Amelia Kerr heaped praise on Sophie Devine and said that the all-rounder has been so switched on during the tournament. Devine has started the tournament in fine form with a hundred and fifty in the first two games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-marufa-akter-fit-to-bowl-against-new-zealand-icc-womens-world-cup-2800692-2025-10-09",
      "headline": "Women's World Cup: Nahida Akter gives update on Marufa's injury ahead of NZ clash Bangladesh vice-captain Nahida Akter gave a fitness update on pace bowler Marufa Akter ahead of their third clash in the Women's World Cup 2025 against New Zealand in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-jalaj-saxena-join-maharashtra-ranji-trophy-2025-2800677-2025-10-09",
      "headline": "Amidst bust-up investigation, Shaw added to Maharashtra Ranji Trophy squad Amidst the investigation into his bust-up incident with Musheer Khan, Prithvi Shaw has been added to Maharashtra's Ranji Trophy squad for the upcoming season. Jalaj Saxena also finds a spot in the squad for the new campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-odi-captaincy-snub-sourav-ganguly-groom-shubman-gill-2800666-2025-10-09",
      "headline": "Rohit Sharma captaincy snub: Happened to me and Dravid as well, says Ganguly Sourav Ganguly commented on Rohit Sharma's ODI captaincy snub and said that it happens with players towards the end of their careers. Ganguly felt it was the right call to groom Shubman Gill as the new captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-ind-vs-sa-richa-ghosh-rescues-india-shatters-records-with-94-2800647-2025-10-09",
      "headline": "IND-W vs SA-W: Richa Ghosh rescues India, shatters record books with explosive 94 Richa Ghosh played a stunning innings of 94 to guide India from 102/6 to 251 against South Africa in their third fixture of the Women's World Cup 2025 in Visakhapatnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-2025-preview-delhi-pitch-team-news-2800608-2025-10-09",
      "headline": "IND vs WI 2nd Test: Nearing perfection, India aim for 1st clean sweep under Gill era IND vs WI 2nd Test preview: After a thumping win in Ahmedabad, the Indian team will be looking to complete their first clean sweep under the leadership of captain Shubman Gill. With bigger challenges awaiting, the hosts will look to keep their foot on the gas and secure the win against a West Indies team that has struggled to find answers to their perennial issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-marufa-akter-fit-to-bowl-against-new-zealand-icc-womens-world-cup-2800692-2025-10-09",
      "headline": "Women's World Cup: Nahida Akter gives update on Marufa's injury ahead of NZ clash Bangladesh vice-captain Nahida Akter gave a fitness update on pace bowler Marufa Akter ahead of their third clash in the Women's World Cup 2025 against New Zealand in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-jalaj-saxena-join-maharashtra-ranji-trophy-2025-2800677-2025-10-09",
      "headline": "Amidst bust-up investigation, Shaw added to Maharashtra Ranji Trophy squad Amidst the investigation into his bust-up incident with Musheer Khan, Prithvi Shaw has been added to Maharashtra's Ranji Trophy squad for the upcoming season. Jalaj Saxena also finds a spot in the squad for the new campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-odi-captaincy-snub-sourav-ganguly-groom-shubman-gill-2800666-2025-10-09",
      "headline": "Rohit Sharma captaincy snub: Happened to me and Dravid as well, says Ganguly Sourav Ganguly commented on Rohit Sharma's ODI captaincy snub and said that it happens with players towards the end of their careers. Ganguly felt it was the right call to groom Shubman Gill as the new captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-ind-vs-sa-richa-ghosh-rescues-india-shatters-records-with-94-2800647-2025-10-09",
      "headline": "IND-W vs SA-W: Richa Ghosh rescues India, shatters record books with explosive 94 Richa Ghosh played a stunning innings of 94 to guide India from 102/6 to 251 against South Africa in their third fixture of the Women's World Cup 2025 in Visakhapatnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-2025-preview-delhi-pitch-team-news-2800608-2025-10-09",
      "headline": "IND vs WI 2nd Test: Nearing perfection, India aim for 1st clean sweep under Gill era IND vs WI 2nd Test preview: After a thumping win in Ahmedabad, the Indian team will be looking to complete their first clean sweep under the leadership of captain Shubman Gill. With bigger challenges awaiting, the hosts will look to keep their foot on the gas and secure the win against a West Indies team that has struggled to find answers to their perennial issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-singapore-1-1-afc-asian-cup-2027-qualifier-2800640-2025-10-09",
      "headline": "10-man India fight back, escape with 1-1 draw vs Singapore in Asian Cup qualifierRahim Ali was India's hero as they fought back to secure a 1-1 draw against Singapore in their AFC Asian Cup 2027 qualifier on Thursday, October 9. India secured the draw after losing Sandesh Jhingan to a red card early in the second half. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brad-haddin-on-shubman-gill-odi-captaincy-rohit-sharma-virat-kohli-india-australia-2025-2800576-2025-10-09",
      "headline": "Shubman Gill getting ODI captaincy might free up Rohit Sharma: Brad HaddinFormer Australia cricketer has backed Rohit Sharma to play more freely after Shubman Gill's appointment as the ODI captain. He also urged fans to come in huge numbers to watch Rohit and Virat Kohli play on their last tour to Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-rohit-sharma-gautam-gambhir-forced-india-retirement-test-2800542-2025-10-09",
      "headline": "Rohit Sharma and Gautam Gambhir didn't force my retirement: AshwinRavichandran Ashwin clarified that his retirement from international cricket was entirely his personal decision. He dismissed rumours suggesting Rohit Sharma or Gautam Gambhir forced him to step away from the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-ind-vs-sa-smriti-mandhana-breaks-belinda-clarks-world-record-2800535-2025-10-09",
      "headline": "Women's World Cup: Smriti Mandhana breaks Belinda Clark's world record in VizagSmriti Mandhana broke the 28-year-old record held by the legendary Belinda Clark during the Women's World Cup 25 fixture against South Africa. She achieved the milestone with a massive six straight down the ground against Ayabonga Khaka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-shubman-gill-praises-ravindra-jadeja-no1-test-allrounder-2025-2800513-2025-10-09",
      "headline": "India lucky to have No.1 Test all-rounder Ravindra Jadeja in team: Shubman GillShubman Gill heaped praise on Ravindra Jadeja and said that the team is lucky to have him in the squad ahead of the second Test against West Indies. Jadeja was the Player Of The Match in the Ahmedabad Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dilip-vengsarkar-to-investigate-prithvi-shaws-on-field-spat-with-musheer-khan-2800472-2025-10-09",
      "headline": "Dilip Vengsarkar to investigate Prithvi Shaw's on-field spat with Musheer KhanDilip Vengsarkar has been appointed to investigate the confrontation involving Prithvi Shaw and Musheer Khan during the Mumbai vs Maharashtra warm-up fixture. Both state associations have initiated a formal inquiry into the on-field dispute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-vs-sa-w-womens-world-cup-2025-amanjot-kaur-returns-renuka-singh-dropped-vizag-2800481-2025-10-09",
      "headline": "IND-W vs SA-W: Amanjot Kaur returns as India drop Renuka Singh for Vizag clashIndia have decided to bring back Amanjot Kaur for the clash against South Africa in Vizag on Thursday, October 9. Renuka Singh has been dropped from the lineup for the match after playing in the win against Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-shubman-gill-praises-ravindra-jadeja-no1-test-allrounder-2025-2800513-2025-10-09",
      "headline": "India lucky to have No.1 Test all-rounder Ravindra Jadeja in team: Shubman GillShubman Gill heaped praise on Ravindra Jadeja and said that the team is lucky to have him in the squad ahead of the second Test against West Indies. Jadeja was the Player Of The Match in the Ahmedabad Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dilip-vengsarkar-to-investigate-prithvi-shaws-on-field-spat-with-musheer-khan-2800472-2025-10-09",
      "headline": "Dilip Vengsarkar to investigate Prithvi Shaw's on-field spat with Musheer KhanDilip Vengsarkar has been appointed to investigate the confrontation involving Prithvi Shaw and Musheer Khan during the Mumbai vs Maharashtra warm-up fixture. Both state associations have initiated a formal inquiry into the on-field dispute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-vs-sa-w-womens-world-cup-2025-amanjot-kaur-returns-renuka-singh-dropped-vizag-2800481-2025-10-09",
      "headline": "IND-W vs SA-W: Amanjot Kaur returns as India drop Renuka Singh for Vizag clashIndia have decided to bring back Amanjot Kaur for the clash against South Africa in Vizag on Thursday, October 9. Renuka Singh has been dropped from the lineup for the match after playing in the win against Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-ameesh-manek-indian-origin-director-of-football-brentford-career-2800471-2025-10-09",
      "headline": "Who is Ameesh Manek? Man United's new Indian-origin director of footballAmeesh Manek is set to join Manchester United as director of football operations, bringing Premier League and corporate experience to Old Trafford. He will oversee day-to-day football operations for both men's and women's teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/shubman-gill-india-vs-west-indies-press-conference-delhi-test-play-win-all-formats-2800433-2025-10-09",
      "headline": "Shubman Gill sets his challenge as India captain: Want to play and win in all formatsIndia captain Shubman Gill made his intentions clear during the pre-match press conference ahead of the second Test against West Indies in New Delhi, stating that his goal is to play and win titles across all formats. Gill was recently promoted as India's ODI captain, adding to his role as Test skipper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harleen-deol-ms-dhoni-injury-recovery-womens-world-cup-form-2800413-2025-10-09",
      "headline": "Harleen Deol recalls special MS Dhoni chat during tough injury layoffWomen's World Cup: Harleen Deol fondly recalled her inspiring interaction with MS Dhoni during her six-month injury layoff, calling him her idol both on and off the field. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/melbourne-cricket-ground-drop-in-pitches-india-vs-australia-2800411-2025-10-09",
      "headline": "Watch: Drop-in pitches gets installed at MCG ahead of India's tour of AustraliaThe Melbourne Cricket Ground is ready to welcome the Indian team for their white-ball series down under. Ahead of summer, the ground is transitioning from a football field to a cricket ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-backs-sai-sudharsan-number-3-batter-india-vs-west-indies-test-2800407-2025-10-09",
      "headline": "Shubman Gill backs Sai Sudharsan amidst Test struggles: Still trust him at no.3India captain Shubman Gill has backed Sai Sudharsan despite early struggles in Test cricket. Gill emphasised patience, highlighting Sudharsan's potential and reaffirming his belief that the youngster can hold India's No. 3 spot long-term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-odi-world-cup-shubman-gill-2800379-2025-10-09",
      "headline": "Rohit, Virat strongly in the mix for ODI World Cup 2027: GillIndia captain Shubman Gill has cleared the air on Rohit Sharma and Virat Kohli's futures in ODI cricket. Shubman has said that the duo are firmly in India's plans for the ODI World Cup 2027.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-womens-world-cup-live-score-visakhapatnam-harmanpreet-kaur-2800347-2025-10-09",
      "headline": "IND vs SA Highlights: Nadine de Klerk special guides South Africa to 3-wicket winINDW vs SAW, Women's World Cup Highlights: Nadine de Klerk helped South Africa register a thrilling three-wicket win over India with a breathtaking innings of 84* (54). She whacked eight fours and five sixes to help her team chase down 252 in 48.5 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/travis-head-pat-cummins-ipl-offer-aakash-chopra-2800341-2025-10-09",
      "headline": "West Indians will not be able to deny Cummins' rumoured IPL deal: Akash ChopraPat Cummins and Travis Head reportedly rejected a massive Rs 58 crore contract to play only in franchise leagues. Aakash Chopra questioned whether a player from the West Indies would have been able to turn down such a big offer."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}