{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ben-and-jerrys-co-founder-jerry-greenfield-quits-accuses-unilever-of-silencing-brands-activism-2788978-2025-09-17",
      "headline": "Ben & Jerry's co-founder quits, accuses Unilever of silencing brand's activismBen & Jerry's co-founder Jerry Greenfield has stepped down from the company after 47 years, saying its independence to speak on social issues has been eroded under Unilever's ownership. Unilever, which is spinning off its ice cream business, thanked Greenfield for his service but disagreed with his claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/stock-market-tips-it-defence-psu-banking-sector-likely-to-see-growth-on-dalal-street-expert-advice-2788858-2025-09-17",
      "headline": "IT, defence or PSU banking: Which sector is likely to see growth on D-Street?PSU banking stocks have started gaining attention after a long period of underperformance, while the IT sector remains in a state of uncertainty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-continue-winning-run-amid-india-us-trade-talk-optimism-2788829-2025-09-17",
      "headline": "Sensex, Nifty continue winning run amid India-US trade talk optimismThe S&P BSE Sensex rose 313.02 points to close at 82,693.71, while the NSE Nifty50 added 91.25 points to end at 25,330.25. Broader markets also held their ground, with midcap and smallcap indices finishing in the green."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-birthday-wishes-business-leaders-ambani-kotak-mahindra-bill-gates-2788816-2025-09-17",
      "headline": "Business leaders extend heartfelt wishes to PM Modi on 75th birthdayProminent business leaders across India as he celebrated his 75th birthday on Tuesday, with several industrialists praising his transformational leadership and unwavering commitment to the nation's progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/home-loan-easy-method-ai-tool-hom-i-basic-home-loan-fintech-atul-monga-2788796-2025-09-17",
      "headline": "Want a home loan without the headache? Here's how AI can help youFrom lengthy paperwork to long waiting periods, applying for a home loan often becomes a tedious process filled with red tape, but an AI tool can now make it easy for you. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cotton-farmers-face-new-challenge-as-quality-issues-threaten-msp-2788758-2025-09-17",
      "headline": "Cotton farmers face new challenge as quality issues threaten MSPDuring this Kharif season, northern states such as Haryana, Punjab, and Rajasthan, and southern states including Andhra Pradesh and Telangana, experienced prolonged and abnormal rainfall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-india-launch-siddharth-jain-first-india-inc-tesla-owner-boost-ev-adoption-2788714-2025-09-17",
      "headline": "Elon Musk congratulates Siddharth Jain, India Inc's 1st executive to own a TeslaElon Musk congratulated Siddharth Jain of INOX Group on owning the first Tesla in India Inc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blackbuck-startup-usd-1-billion-leaves-office-bengaluru-pothole-ceo-rajesh-kumar-yabaji-2788677-2025-09-17",
      "headline": "$1 billion startup BlackBuck leaves Bengaluru office, blames potholesBengaluru firm BlackBuck, worth over $1 billion has decided to move out of their office in the city due to worsening pothole conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bel-share-price-new-order-should-you-buy-explained-2788588-2025-09-17",
      "headline": "BEL share price: Why is it rising today and should you buy?BEL shares rose during the trading session on strong Rs 712 crore order inflow, supported by robust backlog and bullish technicals, keeping investor sentiment positive and suggesting potential further upside in the near-term trading sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-shares-list-at-58-premium-over-ipo-price-book-profit-or-hold-explained-2788567-2025-09-17",
      "headline": "Urban Company shares list at 58% premium: Should you book profit or hold?Urban Company share price: The strong debut reflects the high demand for Urban Company's IPO, which had been among the most closely watched offerings of 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-share-price-bse-nse-58-percent-premium-2788559-2025-09-17",
      "headline": "Urban Company share price: Stock makes bumper debut at 58% premiumUrban Company listed at a 57.5% premium at Rs 162.25 on the NSE. On the BSE, the shares opened at Rs 161, marking a 56% gain over the Rs 103 issue price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/experts-bet-big-financial-stock-bajaj-finance-record-high-psu-banking-sbi-defence-idea-forge-2788554-2025-09-17",
      "headline": "Experts bet big on this financial stock at record high. Should you buy?Experts recommend the financial stock as a strong buy for investors focusing on financial stocks, while also suggesting PSU banks, defence tech firms, and auto ancillary stocks as potential picks."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/aryan-khan-turns-photographer-as-srk-poses-at-the-bads-of-bollywood-premiere-2789067-2025-09-17",
      "headline": "Aryan Khan turns photographer as SRK poses at The B***ds of Bollywood premiereAryan Khan turned photographer for Shah Rukh Khan at 'The B***ds of Bollywood' premiere. Gauri, Suhana and AbRam also arrived for the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/no-other-choice-review-park-chan-wook-comedy-satire-family-drama-busan-film-festival-2789041-2025-09-17",
      "headline": "No Other Choice review: Park Chan-wook film is darkly funny and deeply unsettlingRelease Date:Fri Aug 29, 2025No Other Choice movie review: Park Chan-wook's 'No Other Choice' is a darkly funny film blending satire and family drama. It critiques capitalism's cruelty while delivering a deeply unsettling narrative. It was the opening film at the Busan International Film Festival today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-morning-show-season-4-review-ai-threat-newsroom-drama-2789006-2025-09-17",
      "headline": "The Morning Show 4 review: Jennifer-Reese's show remains compulsively watchableRelease Date:Wed Sep 17, 2025The Morning Show season 4 sees Jennifer Aniston and Reese Witherspoon return with fierce performances. The season explores AI's impact on newsrooms and power struggles behind the scenes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karnataka-defends-200-cinema-ticket-cap-court-multiplex-challenge-2788855-2025-09-17",
      "headline": "Karnataka government defends Rs 200 ticket cap in court, cites public interestThe Karnataka government defended its Rs 200 cinema ticket cap in court, calling it a public measure, while theatre owners argued it curbs business rights and investments.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/anaconda-trailer-jack-black-paul-rudd-join-forces-meta-horror-reboot-2788993-2025-09-17",
      "headline": "Anaconda trailer: Jack Black, Paul Rudd join forces in meta horror reboot'Anaconda' returns to cinemas this Christmas with a mix of action and comedy. The film brings a fresh take on creature chaos featuring actors Jack Black and Paul Rudd in pivotal roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sydney-sweeney-offered-rs-530-crore-deal-for-bollywood-debut-report-2788989-2025-09-17",
      "headline": "Hollywood star Sydney Sweeney offered Rs 530 crore deal for Bollywood debut: ReportAs a testament to her growing popularity in India, Hollywood actor Sydney Sweeney has reportedly been offered a role in a high-budget Bollywood film. The offer includes a paycheck of over Rs 530 crore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/gauahar-slams-amaal-malliks-language-in-bb-19-says-respect-legacy-2788986-2025-09-17",
      "headline": "Gauahar slams Amaal Mallik's language in BB 19, says respect legacyIn a staunch criticism, actor Gauahar Khan urged singer Amaal Mallik to pay attention to his remarks against other contestants in 'Bigg Boss 19'. In her X post, the 'Bigg Boss 7' winner said she hopes his language is discussed during Weekend Ka Vaar. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/karan-johar-calls-aryan-khan-debut-big-night-says-proud-beyond-words-2788971-2025-09-17",
      "headline": "Karan Johar calls Aryan Khan's debut a big night, says he's proud beyond wordsDirector-producer Karan Johar wrote an emotional note ahead of the premiere of Aryan Khan's directorial debut 'The B***ds of Bollywood'. He praised Aryan's dedication towards storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/who-is-unni-mukundan-the-malayalam-actor-playing-pm-modi-in-his-biopic-maa-vande-2788962-2025-09-17",
      "headline": "Who is Unni Mukundan, the Malayalam actor playing PM Modi in his biopic Maa Vande?On PM Narendra Modi's 75th birthday, a biopic titled 'Maa Vande' was announced with Malayalam actor Unni Mukundan set to play the Prime Minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prahlad-kakkar-recalls-priyanka-chopra-early-career-struggle-with-bad-skin-2788832-2025-09-17",
      "headline": "Prahlad Kakkar recalls Priyanka Chopra's early career struggle with bad skinAd filmmaker Prahlad Kakkar recalled the struggles Priyanka Chopra faced at the start of her career, from industry biases to personal challenges, and praised her determination to succeed. He also praised her bold move to Hollywood when Bollywood began sidelining her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditi-rao-hydari-siddharth-celebrate-first-wedding-anniversary-with-special-note-2788910-2025-09-17",
      "headline": "Aditi Rao Hydari-Siddharth celebrate first wedding anniversary with special noteActors Aditi Rao Hydari and Siddharth celebrated their first wedding anniversary with heartfelt photos and a touching Instagram note."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-3-finale-review-dreamy-parisian-farewell-worth-the-wait-belly-conrad-jeremiah-fisher-2788934-2025-09-17",
      "headline": "The Summer I Turned Pretty 3 finale review: Dreamy Parisian farewell worth the waitRelease Date:Wed Sep 17, 2025A romantic fairytale, some butterflies, and a few tears. The finale of 'The Summer I Turned Pretty Season 3' on Prime Video was a perfect send-off to the love story we've been bingeing on for years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/manipuri-film-boong-premiere-indian-cinemas-19-september-2025-2788921-2025-09-17",
      "headline": "Manipuri film Boong gets India release date after festival acclaimManipuri film 'Boong', directed by Lakshmipriya Devi, will be released in select Indian theatres on September 19. The film, previously premiered at the Toronto International Film Festival, marks a significant moment for Manipuri cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-nigam-ishitta-arun-bijuria-recreation-dharma-sunny-sanskari-tulsi-kumari-2788901-2025-09-17",
      "headline": "Sonu Nigam, Ishitta Arun bring back Bijuria after 26 years with fresh twist. WatchGet ready to groove! Sonu Nigam and Ishitta Arun bring back the magic of Bijuria in a brand-new avatar for 'Sunny Sanskari Ki Tulsi Kumari' starring Varun Dhawan, Janhvi Kapoor, Sanya Malhotra, and Rohit Saraf."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/karan-johars-personality-rights-to-be-protected-his-photo-voice-name-cant-be-used-without-permission-cou-2788947-2025-09-17",
      "headline": "Karan Johar's rights protected; no use of his name, photo, voice: CourtFilmmaker Karan Johar has been granted relief by the Delhi High Court in his personality rights case. He had filed a plea regarding the misuse of his name, voice and photos on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sylvester-stallone-opens-up-about-struggling-days-cleaning-lion-cages-new-york-2788893-2025-09-17",
      "headline": "Sylvester Stallone opens up about struggling days cleaning lion cages in New YorkActor Sylvester Stallone opened up about his difficult jobs before becoming a Hollywood star. He shared his experience of working as a cage cleaner in a zoo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/muzammil-ibrahim-opens-up-on-losing-aditya-roy-kapur-role-avi-in-ayan-mukerji-yeh-jawaani-hai-deewani-2788635-2025-09-17",
      "headline": "Muzammil Ibrahim recalls losing out on role in Ayan Mukerji's Yeh Jawaani Hai DeewaniActor Muzammil Ibrahim revealed that the role of Avi in 'Yeh Jawaani Hai Deewani', later played by Aditya Roy Kapur, was originally written for him, but the casting decision eventually moved out of director Ayan Mukerji's hands. He later clarified the misunderstanding with Ayan, explaining that the casting was handled by agents."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/why-demon-slayers-infinity-castle-belongs-to-its-villain-akaza-not-the-heroes-2788868-2025-09-17",
      "headline": "Why Demon Slayer's Infinity Castle belongs to its villain Akaza, not the heroesDiscover how Akaza, the villain of 'Demon Slayer: Infinity Castle', stole the spotlight and became the antihero fans can't stop rooting for."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rise-and-fall-akriti-negi-kubbra-sait-conspire-arjun-bijlani-in-basement-2788780-2025-09-17",
      "headline": "Rise & Fall: Akriti and Kubbra conspire for Arjun Bijlani's return to basementArjun Bijlani made his way to the basement to join the workers once again in the latest episode of 'Rise & Fall'. Although Arjun recently became a ruler, Akriti Negi and Kubbra Sait conspired to bring him back to the basement. Aahana Kumra also became a worker after losing the task. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/special-intensive-revision-delhi-election-commission-preparations-for-voter-roll-revision-in-city-2789091-2025-09-18",
      "headline": "SIR in Delhi: Poll panel kicks off preparations for voter roll revision in cityThe Delhi poll body said that anyone whose name does not appear on the 2002 voter list will need to provide identity proof when submitting their enumeration form."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/masood-azhar-jem-terrorist-implicated-delhi-mumbai-attacks-balakot-base-2788741-2025-09-17",
      "headline": "Masood Azhar behind Parliament attack, 26/11: Jaish leader's 2nd admission nails PakMasood Ilyas Kashmiri, a top Jaish commander, admitted in a video that Masood Azhar orchestrated deadly terror attacks in India from his base in Pakistan's Balakot, knocking Islamabad's denials of harbouring terror groups on its soil."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/air-india-pane-crash-victim-families-file-lawsuit-against-boeing-honeywell-glbs-2789116-2025-09-18",
      "headline": "Families of 4 victims sue Boeing, Honeywell in US court over Air India plane crashThe flight had departed Ahmedabad for London on June 12 but went down shortly after takeoff, killing 229 passengers, 12 crew members, and 19 people on the ground. Only one passenger survived."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/disha-patani-house-firing-case-two-injured-arrested-after-ghaziabad-encounter-up-stf-rohit-godara-goldy-brar-gang-2788988-2025-09-17",
      "headline": "Two shooters who fired outside Disha Patani's Bareilly home killed in encounterThe accused, Ravindra alias Kallu from Rohtak and Arun from Sonipat, were identified as members of the Rohit Godara–Goldy Brar gang. They were critically injured in an exchange of fire with UP STF and later died in hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/trump-india-and-the-continuing-trade-flux-2788902-2025-09-17",
      "headline": "Trump, India and the continuing trade fluxThe India-US equation has lately resembled a high-stakes game that has both sides hedging their bets. Yet, Donald Trump seemingly softening stance may give revival of ties a real chance"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-cji-gavai-pray-lord-vishnu-khajuraho-idol-remark-controversy-impeachment-2788939-2025-09-17",
      "headline": "Go ask deity: Chief Justice Gavai's remark on plea to restore Vishnu idol stirs rowA bench led by Chief Justice of India BR Gavai rejected a plea seeking the restoration of a damaged Lord Vishnu idol in Madhya Pradesh. However, the CJI's remarks to the petitioner were perceived as insensitive by a section of advocates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/handshake-row-pakistan-boycott-asia-cup-group-clash-against-uae-report-2788938-2025-09-17",
      "headline": "Pak's boycott threats over handshake row fail, no demands met, match onPakistan was asked to bat first as the crucial Asia Cup game against the UAE had started an hour late from its scheduled start on Wednesday. Pakistan cricket team reached the Dubai clash after a dramatic delay caused by their protest against the ICC's refusal to remove Andy Pycroft as match referee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/pay-attention-trumps-air-force-one-has-close-encounter-with-spirit-jet-glbs-2789086-2025-09-17",
      "headline": "Get off iPad: Trump's Air Force pilot scolded after close call with another planeA Spirit Airlines jet came too close to Air Force One over Long Island, prompting urgent controller warnings as President Trump and Melania travelled to London.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-3-finale-review-dreamy-parisian-farewell-worth-the-wait-belly-conrad-jeremiah-fisher-2788934-2025-09-17",
      "headline": "The Summer I Turned Pretty 3 finale review: Dreamy Parisian farewell worth the waitRelease Date:Wed Sep 17, 2025A romantic fairytale, some butterflies, and a few tears. The finale of 'The Summer I Turned Pretty Season 3' on Prime Video was a perfect send-off to the love story we've been bingeing on for years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-80-gap-why-most-indians-are-underinsured-and-why-its-time-to-act-2787740-2025-09-15",
      "headline": "The 80% gap: Why most Indians are underinsured and why it's time to actThe solution lies in choosing a comprehensive life cover that reflects modern realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-where-careers-begin-with-confidence-2788009-2025-09-16",
      "headline": "University of Bath School of Management: Where Careers Begin With ConfidenceWith students from over 160 countries and a strong alumni network spanning 130 nations, the School creates a community that feels global in reach yet personal in experience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-match-refree-andy-pycroft-didnt-apologise-for-handshake-row-but-for-miscommunication-2789017-2025-09-17",
      "headline": "Referee Andy Pycroft apologises after Pak drama but not for handshake rowAsia Cup: Match referee Andy Pycroft was given a clean chit by the International Cricket Council over the handshake row. The senior official apologised to Pakistan for miscommunication before the Pakistan Cricket Board made a U-turn on its boycott threat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/khalistan-movement-complex-journey-from-india-to-canada-the-lowdown-2788767-2025-09-17",
      "headline": "Khalistan Movement's Complex Journey From India to CanadaFrom its roots in colonial India to its deep entrenchment in Canada's Sikh diaspora, the Khalistan movement remains a complex and sensitive issue, marked by political tension, historical trauma, and transnational activism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-javelin-final-neeraj-vs-arshad-india-pakistan-2789014-2025-09-17",
      "headline": "Neeraj's one and done, Arshad's save: Javelin set for fascinating final in TokyoThe World Athletics Championship saw a fascinating contest in the men's javelin qualification round. After struggling for months to reach his peak, Neeraj got the job done in just one throw. Arshad Nadeem, the Olympic champion, nearly got knocked out in the first round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-pakistan-beat-uae-seals-super-4-spot-face-india-2789113-2025-09-18",
      "headline": "Asia Cup: Pakistan beat UAE after boycott drama, to face India in Super 4Pakistan secured their place in the Asia Cup Super 4s with a 41-run win over the UAE in Dubai on Wednesday. The victory, which came on a drama-filled evening, set up a high-voltage Super 4 opener against arch-rivals India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-is-abbas-ramsada-grew-up-with-modi-at-his-gujarat-vadnagar-home-pm-75-birthday-childhood-friend-heeraben-pankaj-2788982-2025-09-17",
      "headline": "Who is Abbas, who grew up with Modi at his Vadnagar home?Prime Minister Narendra Modi, in a blogpost on his mother Heeraben in 2022, spoke about Abbas, who as a child stayed at their Vadnagar home. Who was Abbas? Revisiting Abbas and Modi's childhood on his 75th birthday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sydney-sweeney-offered-rs-530-crore-deal-for-bollywood-debut-report-2788989-2025-09-17",
      "headline": "Hollywood star Sydney Sweeney offered Rs 530 crore deal for Bollywood debut: ReportAs a testament to her growing popularity in India, Hollywood actor Sydney Sweeney has reportedly been offered a role in a high-budget Bollywood film. The offer includes a paycheck of over Rs 530 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ben-and-jerrys-co-founder-jerry-greenfield-quits-accuses-unilever-of-silencing-brands-activism-2788978-2025-09-17",
      "headline": "Ben & Jerry's co-founder quits, accuses Unilever of silencing brand's activismBen & Jerry's co-founder Jerry Greenfield has stepped down from the company after 47 years, saying its independence to speak on social issues has been eroded under Unilever's ownership. Unilever, which is spinning off its ice cream business, thanked Greenfield for his service but disagreed with his claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/coloured-candidate-photos-serial-numbers-on-evms-poll-body-issues-new-rules-beginning-with-bihar-2788874-2025-09-17",
      "headline": "Coloured photos, serial numbers on EVMs: Poll body's new rules start with BiharCandidates' photographs will now be printed in colour, replacing the earlier black-and-white or no-photo versions, to facilitate clearer identification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-opposition-boycott-assembly-amoebic-meningitis-brain-eating-amoeba-deaths-data-cover-up-2788960-2025-09-17",
      "headline": "Kerala Opposition alleges cover-up by state after brain-eating amoeba kills 19The Opposition in Kerala staged a boycott of the Assembly session during an adjournment motion on amoebic meningoencephalitis, accusing the government of concealing figures, lacking treatment protocols, and politicising the crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/when-your-partner-and-parent-dont-get-along-just-like-in-the-girlfriend-2788911-2025-09-17",
      "headline": "When your partner and parent don't get alongHow do you deal with a tricky situation when two of the most important people (your partner and parent) in your life just can't seem to see eye to eye?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/repeat-offender-street-dogs-uttar-pradesh-up-life-imprisonment-yogi-government-supreme-court-animal-rights-2788912-2025-09-17",
      "headline": "Repeat-offender street dogs to get life imprisonment in UPThe government of Uttar Pradesh has rolled out tough new rules against street dogs, mandating life imprisonment for repeat attackers. The move follows a Supreme Court ruling that sought to tackle the street-dog menace in Delhi NCR."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/antonie-van-leeuwenhoek-the-cloth-merchant-who-discovered-microorganisms-2788931-2025-09-17",
      "headline": "Antonie van Leeuwenhoek, the cloth merchant who discovered microorganismsOn September 17, 1683, Antonie van Leeuwenhoek, a Delft cloth merchant with handmade microscopes, astonished the Royal Society by reporting \"animalcules\" — the first glimpse of bacteria and microscopic life. His letters and lenses earned him worldwide fame as the father of microbiology, forever changing science."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajendra-lodha-ex-director-of-lodha-developers-arrested-for-rs-85-crore-fraud-threatening-ceo-2788984-2025-09-17",
      "headline": "Lodha Developers ex-director arrested for Rs 85-crore fraud, threatening CEOMumbai Police have arrested former Lodha Developers director Rajendra Lodha for allegedly masterminding a fraud of over Rs 85 crore through bogus land deals, undervalued sales, and benami transactions."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-pakistan-beat-uae-seals-super-4-spot-face-india-2789113-2025-09-18",
      "headline": "Asia Cup: Pakistan beat UAE after boycott drama, to face India in Super 4Pakistan secured their place in the Asia Cup Super 4s with a 41-run win over the UAE in Dubai on Wednesday. The victory, which came on a drama-filled evening, set up a high-voltage Super 4 opener against arch-rivals India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/venus-williams-health-comeback-break-navratilova-record-la-2028-olympics-2789097-2025-09-18",
      "headline": "Venus Williams fights health to chase record and Olympic dreamDespite facing health challenges, Venus Williams remains determined to break a long-standing tennis record, highlighting her resilience and her pursuit of Olympic glory at LA 2028."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-on-match-winning-century-vs-australia-mullanpur-2789099-2025-09-18",
      "headline": "Smriti Mandhana delighted with her first match-winning century against AustraliaSmriti Mandhana scored a match-winning 117 to guide India to a 102-run victory over Australia in the second ODI at Dubai. It was her first match-winning century against Australia in ODIs as the last two ended in losing cause."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ramiz-raja-questions-icc-referee-andy-pycroft-neutrality-india-vs-pakistan-2789092-2025-09-18",
      "headline": "Andy Pycroft is India's favourite: Ramiz Raza questions ICC referee's neutralityFormer Pakistan Cricket Board (PCB) chairman Ramiz Raja has launched a scathing attack on ICC match referee Andy Pycroft, questioning his neutrality and calling him a 'favourite' of the Indian team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-kpmg-consult-isl-clubs-commercial-rights-tender-2789074-2025-09-17",
      "headline": "AIFF to consult ISL clubs as KPMG prepares new commercial rights tenderAIFF has appointed KPMG to consult all ISL clubs for preparing the commercial rights tender. This move aims to ensure transparency and incorporate club inputs for Indian football's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ire-vs-eng-1st-t20i-philip-salts-89-guides-england-to-4-wicket-win-2789066-2025-09-17",
      "headline": "IRE vs ENG 1st T20I: Philip Salt's breathtaking 89 guides England to 4-wicket winPhilip Salt's fiery 89 helped England chase down 197 against Ireland in the first T20I and go 1-0 up in the three-match series in Dublin. Salt smashed ten fours and four sixes in his innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neera-chopra-arshad-nadeem-battle-world-athletic-championships-2025-javelin-final-tokyo-2789036-2025-09-17",
      "headline": "One and done Neeraj Chopra confident ahead of javelin final in lucky TokyoNeeraj Chopra secured his place in the javelin final at the Tokyo World Athletics Championships with a strong first throw. He now prepares to face Arshad Nadeem and defend his title amid high expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/madan-lal-on-pakistan-boycotting-asia-cup-2025-2789023-2025-09-17",
      "headline": "Boycotting Asia Cup, would've crippled Pakistan cricket: Madan LalFormer India cricketer Madan Lal feels Pakistan would've done irreparable damage to their cricket if they had boycotted the Asia Cup 2025. The Salman Agha-led side had threatened to pull out of the tournament ahead of their fixture against the UAE after the ICC rejected their demand to remove Andy Pycroft as Match Referee from the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-signed-world-cup-jersey-gift-pm-modi-india-tour-2025-2789020-2025-09-17",
      "headline": "Lionel Messi sends signed World Cup jersey to PM Modi ahead of India tourLionel Messi has sent a signed jersey to PM Modi ahead of his India visit. The tour highlights growing football enthusiasm and includes stops in Kolkata, Mumbai, and Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-match-refree-andy-pycroft-didnt-apologise-for-handshake-row-but-for-miscommunication-2789017-2025-09-17",
      "headline": "Referee Andy Pycroft apologises after Pak drama but not for handshake rowAsia Cup: Match referee Andy Pycroft was given a clean chit by the International Cricket Council over the handshake row. The senior official apologised to Pakistan for miscommunication before the Pakistan Cricket Board made a U-turn on its boycott threat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-beat-aus-w-smriti-mandhana-kranti-goud-2789015-2025-09-17",
      "headline": "Smriti Mandhana guides India women to a series-leveling 102-run win vs AustraliaOpener Smriti Mandhana slammed a fine century as India handed Australia a massive 102-run defeat in the second women's ODI to level the three-match series 1-1 in Mullanpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neera-chopra-arshad-nadeem-battle-world-athletic-championships-2025-javelin-final-tokyo-2789036-2025-09-17",
      "headline": "One and done Neeraj Chopra confident ahead of javelin final in lucky TokyoNeeraj Chopra secured his place in the javelin final at the Tokyo World Athletics Championships with a strong first throw. He now prepares to face Arshad Nadeem and defend his title amid high expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/madan-lal-on-pakistan-boycotting-asia-cup-2025-2789023-2025-09-17",
      "headline": "Boycotting Asia Cup, would've crippled Pakistan cricket: Madan LalFormer India cricketer Madan Lal feels Pakistan would've done irreparable damage to their cricket if they had boycotted the Asia Cup 2025. The Salman Agha-led side had threatened to pull out of the tournament ahead of their fixture against the UAE after the ICC rejected their demand to remove Andy Pycroft as Match Referee from the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-signed-world-cup-jersey-gift-pm-modi-india-tour-2025-2789020-2025-09-17",
      "headline": "Lionel Messi sends signed World Cup jersey to PM Modi ahead of India tourLionel Messi has sent a signed jersey to PM Modi ahead of his India visit. The tour highlights growing football enthusiasm and includes stops in Kolkata, Mumbai, and Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-match-refree-andy-pycroft-didnt-apologise-for-handshake-row-but-for-miscommunication-2789017-2025-09-17",
      "headline": "Referee Andy Pycroft apologises after Pak drama but not for handshake rowAsia Cup: Match referee Andy Pycroft was given a clean chit by the International Cricket Council over the handshake row. The senior official apologised to Pakistan for miscommunication before the Pakistan Cricket Board made a U-turn on its boycott threat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-beat-aus-w-smriti-mandhana-kranti-goud-2789015-2025-09-17",
      "headline": "Smriti Mandhana guides India women to a series-leveling 102-run win vs AustraliaOpener Smriti Mandhana slammed a fine century as India handed Australia a massive 102-run defeat in the second women's ODI to level the three-match series 1-1 in Mullanpur."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}