{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/imf-billion-dollar-loan-pakistan-criticims-india-abstains-from-voting-explained-2722671-2025-05-10",
      "headline": "Explained: Why the IMF is under fire for $1 billion loan to PakistanThe disbursement, approved on Friday under the Extended Fund Facility (EFF), raises total payouts under the programme to $2.1 billion. But the timing of the announcement has provoked a fierce backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-india-pakistan-tensions-what-it-means-for-dalal-street-investors-2722620-2025-05-10",
      "headline": "India–Pakistan tensions escalate. What's next for Dalal Street investors?While the Sensex and Nifty ended over 1% lower in the previous session, experts suggest that the decline was far less than what could have been expected in such a volatile environment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharama-asks-banks-to-stay-on-alert-amid-rising-indo-pak-tensions-2722375-2025-05-09",
      "headline": "Nirmala Sitharama asks banks to stay on alert amid rising Indo-Pak tensionsThe directive comes a day after India successfully intercepted multiple missile and drone attacks launched from Pakistan late on May 8. While India reported no major damage, the government has since asked all critical institutions to bolster their cybersecurity infrastructure in anticipation of potential retaliatory attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/go-homestays-cuts-ties-with-turkish-airlines-over-anti-india-stand-2722299-2025-05-09",
      "headline": "'Unsupportive stance towards India': Go Homestays ends ties with Turkish AirlinesGo Homestays ends ties with Turkish Airlines after Turkey backs Pakistan following 'Operation Sindoor'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/india-pak-tensions-oil-psus-assure-ample-fuel-stocks-urge-against-panic-buying-2722194-2025-05-09",
      "headline": "India-Pak tensions: Oil PSUs assure ample fuel stocks, urge against panic buyingIndian oil companies have issued statements assuring ample fuel stocks across the country. The Indian Oil Corporation and Bharat Petroleum Corporation Limited have emphasised that there is no shortage of petrol, diesel, CNG, or LPG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bharti-airtel-in-talks-to-acquire-49-percent-stake-in-haier-india-report-2722238-2025-05-09",
      "headline": "Bharti Airtel in talks to acquire 49% stake in Haier India: ReportSunil Mittal, the billionaire-founder of Indian telecom operator Bharti Airtel, has partnered with private equity firm, Warburg Pincus to buy a substantial stake in Haier India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/telecom-regulator-trai-recommends-5-year-satellite-spectrum-allotment-report-2722224-2025-05-09",
      "headline": "Telecom regulator recommends 5-year satellite spectrum allotment: ReportThe move comes amid growing interest in satellite internet services from global players like Elon Musk's Starlink and domestic telecom giants."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-880-points-lower-nifty-above-24000-titan-ends-4-percent-up-2722207-2025-05-09",
      "headline": "Sensex closes 880 points lower, Nifty above 24,000; Titan ends 4% upThe S&P BSE Sensex lost 880.34 points to end at 79,454.47, while the NSE Nifty50 was down by 265.80 points to close at 24,008.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-faces-no-shortage-of-essentials-items-government-amid-rising-tensions-pakistan-war-2722173-2025-05-09",
      "headline": "Essential goods supply to remain unaffected across India amid geopolitical heatPrices of key food items, including pulses and vegetables, are being watched closely to make sure they stay under control. Efforts are also being made to keep the supply of these items steady across all cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-an-fd-in-2025-check-these-6-banks-offering-attractive-interest-rates-2722156-2025-05-09",
      "headline": "Planning an FD in 2025? Check these 6 banks offering attractive interest ratesFor fixed deposits between 15 and 21 months, HDFC Bank is offering 7.05% to general citizens, while senior citizens get 7.55%"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-pakistan-tensions-finance-minister-nirmala-sitharaman-review-cyber-readiness-banks-financial-institutions-2722163-2025-05-09",
      "headline": "Finance Minister to review cyber readiness of banks, financial institutionsThe meeting will bring together representatives from several key institutions like the Reserve Bank of India (RBI), the National Payments Corporation of India (NPCI), the Bombay Stock Exchange (BSE), the National Stock Exchange (NSE), etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-share-price-jumped-over-7-percent-today-key-reasons-explained-2722110-2025-05-09",
      "headline": "Explained: Why Yes Bank share price jumped over 7% todayThe Yes Bank stock has now gained nearly 11% over the past five sessions, sparking investor curiosity."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neil-nitin-mukesh-young-actors-upping-their-game-2723090-2025-05-11",
      "headline": "Neil Nitin Mukesh on young actors: All of them are upping their game | ExclusiveNeil Nitin Mukesh shares his admiration for young Bollywood actors, naming Vicky Kaushal, Kartik Aaryan and others as promising talents. He also reflects on recent films that impressed him and his passion for watching movies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/ranveer-allahbadia-deleted-post-for-pakistani-brothers-sisters-faces-backlash-2723088-2025-05-11",
      "headline": "Ranveer Allahbadia deletes post for 'Pakistani brothers-sisters' after backlashPodcaster Ranveer Allahbadia is at the centre of a new controversy for making an Instagram post addressed to 'dear Pakistani brothers and sisters' amid India's Operation Sindoor against terrorism. He deleted the post later following criticism on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-dad-died-fans-asked-for-a-picture-2723024-2025-05-11",
      "headline": "Samantha says fans asked her for a pic on the day my dad died: I never say noActor Samantha Ruth Prabhu, in a recent interview, talked about how she never says no when fans ask her for a picture. She recalled the incident when a fan approached her for a photo when she was on her way to Chennai to attend her father's funeral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-madame-tussauds-wax-statue-pet-dog-rhyme-launched-in-london-2723076-2025-05-11",
      "headline": "Ram Charan's wax statue with pet dog Rhyme unveiled in London. WatchRam Charan and his pet dog, Rhyme's statues, were unveiled in London. Their statues will be kept on display at Madame Tussauds Singapore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bollywood-celebs-nushrratt-bharucha-pashmina-roshan-nikita-dutta-share-what-a-mother-means-she-moves-mountains-for-her-children-she-moves-mountains-for-her-children-2723064-2025-05-11",
      "headline": "She moves mountains for her children: Bollywood celebs share what a mother meansCinema has been celebrating motherhood since its inception in India. And every shade of motherhood finds a place in Indian films. On International Mother's Day 2025, we asked Bollywood celebs how they define a mother. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-sethupathi-ace-trailer-heist-film-arumugakumar-2723055-2025-05-11",
      "headline": "Ace trailer: Vijay Sethupathi powers through heist film with style and swagActors Vijay Sethupathi and Rukmini Vasanth have joined hands for director Arumugakumar's heist thriller. The trailer was launched by Sivakarthikeyan on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-kenishaa-franciss-rumoured-partner-heavy-trolling-aarti-divorce-2723042-2025-05-11",
      "headline": "Actor Ravi Mohan, rumoured partner Kenishaa attend reception amid heavy trollingActor Ravi Mohan and his rumoured partner Kenishaa made yet another public appearance at producer Ishari Ganesh's daughter's wedding reception in Chennai. This comes a day after the two were trolled for their appearance amid Ravi's divorce battle with wife Aarti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-recalls-shaking-on-oo-antava-sets-who-thinks-of-me-for-a-special-song-2723025-2025-05-11",
      "headline": "Samantha recalls 'shaking' on Oo Antava sets: Who thinks of me for a special song?Samantha reminisced about dancing in front of '500 junior artistes' on the sets of the 'Oo Antava' song in 'Pushpa'. She said she took it as an opportunity and did it even when she was 'shaking' out of nervousness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/taylor-swifts-team-blasts-justin-baldoni-over-subpoena-in-black-lively-case-2722990-2025-05-11",
      "headline": "Taylor Swift's team blasts Justin Baldoni over subpoena in Blake Lively caseThe representatives of Taylor Swift's team talked to the media and criticised actor Justin Baldoni for involving her in his lawsuit against Blake Lively. The team called this a 'tabloid clickbait move'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/did-salman-khan-make-a-post-on-india-pakistan-ceasefire-and-later-delete-it-2722979-2025-05-11",
      "headline": "Did Salman Khan make a post on India-Pakistan ceasefire and later delete it?Several screenshots of Salman Khan's X-post about the India-Pakistan ceasefire are going viral on social media. It seems like the Bollywood superstar posted about the ceasefire on Saturday and deleted it later. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-breaks-silence-on-operation-sindoor-after-blank-posts-on-x-skips-pm-modi-mention-2722967-2025-05-11",
      "headline": "Big B breaks silence on Operation Sindoor after series of blank posts on XAmitabh Bachchan made a long, emotional, and empowering note about Operation Sindoor, mentioning the woman who lost her husband, asked a terrorist to kill her as well. The actor shared his father's poetry in the post. His post comes almost 20 days after the Pahalgam terrorist attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rajkummar-rao-bhool-chuk-release-until-next-hearing-june-16-after-pvr-sued-maddock-films-2722850-2025-05-10",
      "headline": "No Bhool Chuk Maaf's release till next hearing on June 16: Bombay courtPVR sued Maddock Films, the production house, for cancelling the release of 'Bhool Chuk Maaf' citing Indo-Pak conflict. Now, Bombay High Court has restrained the film's release till the next hearing, which will take place on June 16."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nimrat-kaur-martyr-daughter-india-pakistan-conflict-terrorism-has-no-place-2722841-2025-05-10",
      "headline": "Actor Nimrat Kaur on Indo-Pak conflict: Terrorism has no placeActor Nimrat Kaur shared her personal journey as a martyr's daughter and highlighted the urgent need to address terrorism's root causes for lasting peace. She appealed to citizens to stay calm and support the armed forces amid Indo-Pak tensions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-says-need-assurance-that-attacks-wont-happen-again-saif-ali-khan-salutes-military-operation-sindoor-2722833-2025-05-10",
      "headline": "Op Sindoor: Aamir Khan wants assurance of no attacks in future, Saif salutes armyAamir Khan, at a recent event, spoke about the Pahalgam attack and said that we, as a nation, would need assurance that such attacks will not happen again. Saif Ali Khan applauded the armed forces for their bravery and Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-hit-3-success-meet-indo-pak-tension-2722801-2025-05-10",
      "headline": "Telugu actor Nani reveals why he went ahead with HIT 3 event amid Indo-Pak tensionsTelugu actor Nani was called out for holding 'HIT 3' success event amid escalating Indo-Pak tensions. He stated that he didn't want to give terrorists the satisfaction of cancelling an event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pvr-sues-maddock-films-after-cancellation-of-bhool-chuk-maaf-theatrical-release-2722768-2025-05-10",
      "headline": "PVR sues Maddock Films after cancellation of Bhool Chuk Maaf theatrical releasePVR has sued Maddock Films for Rs 60 crore for the last-minute cancellation of the theatrical release of Bhool Chuk Maaf. Maddock Films is yet to release an official statement on the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/black-white-and-gray-the-uncomfortable-fiction-of-this-highly-rated-crime-series-2722310-2025-05-10",
      "headline": "Black, White and Gray: The uncomfortable fiction of this highly rated crime series'Black, White and Gray - Love Kills' is a gripping mockumentary series on SonyLIV that blurs the line between fiction and reality with its true-crime-style storytelling set in Nagpur. This six-episode show masterfully explores obsession and truth, leaving viewers questioning what is real in relationships and crime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/all-about-film-on-operation-sindoor-makers-apology-and-clarification-2722755-2025-05-10",
      "headline": "All about film on Operation Sindoor, makers' apology and clarificationFilmmaker Uttam Maheshwari deleted the poster of his film titled 'Operation Sindoor', and also apologised for hurting the sentiments of people, while India continues to defend its sovereignty amid escalating tensions between India and Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rhea-chakraborty-moving-tribute-to-indian-army-from-one-fauji-home-to-another-2722728-2025-05-10",
      "headline": "Rhea Chakraborty's moving tribute to Indian army: From one fauji home to another...Actor Rhea Chakraborty wrote an emotional and empowering note as the 'daughter' of an Indian army officer. She sent her love to the families of the soldiers who are fighting for the country amid escalating tensions between India and Pakistan. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-air-force-says-operation-sindoor-still-ongoing-after-india-pak-ceasefire-briefing-in-due-course-2723045-2025-05-11",
      "headline": "Op Sindoor still ongoing, briefing soon: Air Force after India-Pak ceasefireThe Indian Air Force (IAF) on Sunday stated that Operation Sindoor -- launched as a counter-offensive against the dastardly attack by Pakistan-backed terrorists in Pahalgam -- is still in progress, a day after US President Donald Trump announced a ceasefire between New Delhi and Islamabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-ceasefire-missile-debris-found-in-rajasthasn-sparks-speculation-about-use-of-brahmos-in-op-sindoor-2723074-2025-05-11",
      "headline": "BrahMos hit Jaish headquarters in Pak during Op Sindoor? Booster debris foundThe debris, believed to be ejected components typically discarded shortly after a missile launch, was found in a remote area close to the Indo-Pak border, raising questions about whether the high-speed BrahMos missile was deployed in India's recent precision attacks on Pakistani military infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jd-vance-call-pm-modi-us-role-limited-getting-india-pak-talk-cnn-2722975-2025-05-11",
      "headline": "Vance had to call PM Modi, US role limited to getting India and Pak to talk: CNNAs per CNN, US Vice President JD Vance had to call Prime Minister Narendra Modi to inform him about a \"high probability of dramatic escalation\" over the weekend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-airforce-spokesperson-aurangzeb-admits-to-role-in-pulwama-terror-attack-amid-pahalgam-heat-2722821-2025-05-11",
      "headline": "Pakistan admits to role in Pulwama terror attack amid Pahalgam heatPakistan military admitted to its involvement in the 2019 Pulwama attack, in which 40 CRPF personnel were killed, after years of denial. A top Pakistan Air Force officer publicly called the Pulwama attack \"tactical brilliance\". The rare admission, made on Friday, amid heat over India's \"focused, measured and non-escalatory\" Operation Sindoor, exposes the Islamabad-Rawalpindi regime's dirty terror secret."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/post-operation-sindoor-pakistan-claiming-victory-narrative-war-time-to-deploy-ins-tharoor-icbm-asaduddin-owaisi-2723063-2025-05-11",
      "headline": "Post-Op Sindoor: Time to Deploy INS Tharoor & ICBM OwaisiPost-Operation Sindoor, the battle has shifted from airbases to airwaves, and India is losing ground. Congress leader Shashi Tharoor's gravitas and Lok Sabha MP Asaduddin Owaisi's firepower could prove to be India's best shot at reclaiming the global narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-violates-ceasefire-live-updates-india-pak-tension-conflict-breach-news-drone-attack-missile-blackout-operation-sindoor-pahalgam-terror-attack-2722944-2025-05-11",
      "headline": "Live: Pak calls for communication on ceasefire, says troops should exercise restraintIndia-Pakistan Tension Live Updates: India accused Pakistan of ceasefire violation hours after foreign secretary Vikram Misri announced that India and Pakistan had reached an understanding to stop all firings and military actions on land, air and sea with immediate effect late on Saturday. However, the situation along the LoC is stable now while western border states are on high alert. PM Modi is currently having a security meeting with NSA Ajit Doval, Defence minister Rajnath Singh, CDS Anil Chauhan and military chiefs. India and Pakistan agreed to halt military actions hours after intense cross-border strikes. The escalation followed India's Operation Sindoor, launched in response to the April 22 Pahalgam terror attack that killed 26 people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/woman-doctor-arrested-cocaine-worth-rs-5-lakh-bought-whatsapp-2723016-2025-05-11",
      "headline": "Woman doctor arrested with cocaine worth Rs 5 lakh bought on WhatsAppThe investigation revealed that the doctor had ordered the drug from a supplier based in Mumbai and paid him Rs 5 lakh through an online transaction on May 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/ranveer-allahbadia-deleted-post-for-pakistani-brothers-sisters-faces-backlash-2723088-2025-05-11",
      "headline": "Ranveer Allahbadia deletes post for 'Pakistani brothers-sisters' after backlashPodcaster Ranveer Allahbadia is at the centre of a new controversy for making an Instagram post addressed to 'dear Pakistani brothers and sisters' amid India's Operation Sindoor against terrorism. He deleted the post later following criticism on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-breaks-silence-on-operation-sindoor-after-blank-posts-on-x-skips-pm-modi-mention-2722967-2025-05-11",
      "headline": "Big B breaks silence on Operation Sindoor after series of blank posts on XAmitabh Bachchan made a long, emotional, and empowering note about Operation Sindoor, mentioning the woman who lost her husband, asked a terrorist to kill her as well. The actor shared his father's poetry in the post. His post comes almost 20 days after the Pahalgam terrorist attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/appreciate-trumps-willingness-to-resolve-kashmir-issue-pakistan-welcomes-uss-offer-to-mediate-2723097-2025-05-11",
      "headline": "Pakistan welcomes Trump's offer to mediate Kashmir issuePakistan praised the United States for its role in facilitating a ceasefire with India and also welcomed President Donald Trump's offer to mediate on the Kashmir issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajnath-singh-inaugurate-brahmos-production-unit-2723002-2025-05-11",
      "headline": "Rajnath Singh inaugurates BrahMos production unit, will make 100 missiles a yearRajnath Singh on Sunday will inaugurate the BrahMos super Sonic missile production unit at the Uttar Pradesh Defence Industrial Corridor in Lucknow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/will-work-with-india-pak-for-resolution-on-kashmir-says-trump-after-ceasefire-2722981-2025-05-11",
      "headline": "Will work with India, Pak for solution to Kashmir issue: Trump after ceasefireUS President Donald Trump expressed his gratitude to the leaders of both countries, calling it a wise decision 'to stop the current aggression that could have led to the death and destruction of so many, and so much.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/immersive/india-mens-relay-team-national-record/",
      "headline": "Banshee Unleashed: India's sprinting quartet roars, eyes on Asian gloryMeet the quartet of Gurindervir Singh, Animesh Kujur, Manikanta Hoblidhar and then in the final stretch, Amlan Borgohain, stoic, upright yet with shades of a banshee, a maelstrom of raw, untamed energy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-ceasefire-must-begin-tomorrow-if-russia-wants-to-end-war-zelenskyy-putin-2723081-2025-05-11",
      "headline": "Ceasefire must begin tomorrow if Russia wants to end war: ZelenskyyVolodymyr Zelenskyy said on Sunday it was a positive sign that Russia had begun to consider ending the war, but that the first step towards that was to start a ceasefire on May 12."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/roar-our-armed-forces-heard-rawalpind-rajnath-singh-operation-sindoor-pakistan-india-tension-missile-ceasefire-2723080-2025-05-11",
      "headline": "Roar of our armed forces heard even in Rawalpindi: Rajnath Singh on Op SindoorSpeaking at the inauguration of the BrahMos supersonic cruise missile production unit at the Uttar Pradesh Defence Industrial Corridor in Lucknow, Union Defence Minister Rajnath Singh said that the Army's actions were not limited to border areas alone but echoed loudly even in the Pakistan Army Headquarters in Rawalpindi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-confirms-use-of-brahmos-missile-in-operation-sindoor-ask-pak-about-its-power-2723052-2025-05-11",
      "headline": "Yogi Adityanath says BrahMos missile used in Op Sindoor: Ask Pak about its powerYogi Adityanath on Sunday confirmed the use of BrahMos missile in Operation Sindoor. He was speaking at the inauguration of the BrahMos supersonic cruise missile production unit in Lucknow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/what-is-brahmos-india-used-supersonic-cruise-missile-in-strikes-against-pakistan-2723092-2025-05-11",
      "headline": "India used BrahMos in strikes against Pak: All about supersonic cruise missileBrahMos is a long-range supersonic cruise missile known for its high accuracy. It operates on 'Fire and Forget Principle', adopting a variety of flights on its way to the target."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-482-10-05-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-x-user-urges-donald-trump-to-escalate-ejipura-flyover-construction-namma-metro-projects-2723083-2025-05-11",
      "headline": "X user urges Donald Trump to 'escalate' construction of Bengaluru's Ejipura flyoverIn a now-viral post on X, a social media user from Bengaluru appealed to US President Donald Trump to intervene in two long-pending infrastructure projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/princess-gauravi-kumari-on-royal-beauty-secrets-and-what-she-loves-about-gen-z-2722301-2025-05-11",
      "headline": "Princess Gauravi Kumari on royal beauty secrets and what she loves about Gen ZIn an exclusive interview with India Today Digital, Princess Gauravi Kumari shares what she loves about being Gen Z, along with her skincare rituals and wellness routine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-ceasefire-war-is-pitiless-p-chidambaram-backs-governments-ceasefire-move-with-pak-2722998-2025-05-11",
      "headline": "Wise decision: P Chidambaram praises PM Modi for ceasefire deal with PakWriting in the aftermath of the Indian strikes on May 7 as part of 'Operation Sindoor', P Chidambaram noted that Prime Minister Narendra Modi had recognised the dangers of a wider war and had \"wisely chosen a calibrated military response limited to selected targets\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-sher-skewers-pakistan-ceasefire-flip-2722942-2025-05-11",
      "headline": "Uski fitrat hai...: Shashi Tharoor's 'sher' skewers Pak over ceasefire flipAfter Pakistan breached the ceasefire despite peace talks, Congress MP Shashi Tharoor took a veiled jibe at the same and wrote on X that it is \"his nature to turn away\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-pakistan-ceasefire-deal-pakistan-pm-shehbaz-sharif-calls-ceasefire-deal-with-india-a-victory-for-pakistan-2722976-2025-05-11",
      "headline": "Shehbaz Sharif calls ceasefire deal with India a victory for PakistanWhile addressing the nation, Pakistan PM Shehbaz Sharif accused India of using the April 22 Pahlagam attack as an \"excuse\" to launch an attack on the nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neil-nitin-mukesh-young-actors-upping-their-game-2723090-2025-05-11",
      "headline": "Neil Nitin Mukesh on young actors: All of them are upping their game | ExclusiveNeil Nitin Mukesh shares his admiration for young Bollywood actors, naming Vicky Kaushal, Kartik Aaryan and others as promising talents. He also reflects on recent films that impressed him and his passion for watching movies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/ranveer-allahbadia-deleted-post-for-pakistani-brothers-sisters-faces-backlash-2723088-2025-05-11",
      "headline": "Ranveer Allahbadia deletes post for 'Pakistani brothers-sisters' after backlashPodcaster Ranveer Allahbadia is at the centre of a new controversy for making an Instagram post addressed to 'dear Pakistani brothers and sisters' amid India's Operation Sindoor against terrorism. He deleted the post later following criticism on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-madame-tussauds-wax-statue-pet-dog-rhyme-launched-in-london-2723076-2025-05-11",
      "headline": "Ram Charan's wax statue with pet dog Rhyme unveiled in London. WatchRam Charan and his pet dog, Rhyme's statues, were unveiled in London. Their statues will be kept on display at Madame Tussauds Singapore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bollywood-celebs-nushrratt-bharucha-pashmina-roshan-nikita-dutta-share-what-a-mother-means-she-moves-mountains-for-her-children-she-moves-mountains-for-her-children-2723064-2025-05-11",
      "headline": "She moves mountains for her children: Bollywood celebs share what a mother meansCinema has been celebrating motherhood since its inception in India. And every shade of motherhood finds a place in Indian films. On International Mother's Day 2025, we asked Bollywood celebs how they define a mother. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/deepika-kumari-archery-world-cup-stage-2-bronze-medal-win-2723108-2025-05-11",
      "headline": "Deepika Kumari wins Bronze medal in Archery World Cup stage 2Deepika Kumari showcased grit and composure to clinch a bronze at the Archery World Cup Stage 2, avenging her semifinal loss with a strong finish. Her podium return added to India's growing medal tally, led by compound archers' dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kagiso-rabada-cocaine-doping-ban-ipl-return-gujarat-titans-2723105-2025-05-11",
      "headline": "The drug Kagiso Rabada tested positive for was cocaine: ReportKagiso Rabada served a short doping ban during the IPL 2025. A news report coming out of South Africa states that the banned drug that Rabada used was cocaine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohlis-old-interview-goes-viral-amid-retirement-rumours-2723100-2025-05-11",
      "headline": "Virat Kohli's old interview goes viral: Want smooth transition in Indian cricketAmid retirement reports of the star India batter Virat Kohli, his old interview has been going viral on social media where he could be seen talking about smooth transition in Indian cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/indian-athletics-asian-championship-glory-rising-stars-2723067-2025-05-11",
      "headline": "Banshee Unleashed: India's sprinting quartet roars, eyes on Asian gloryMeet the quartet of Gurindervir Singh, Animesh Kujur, Manikanta Hoblidhar and then in the final stretch, Amlan Borgohain, stoic, upright yet with shades of a banshee, a maelstrom of raw, untamed energy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-hits-11th-odi-hundred-in-tri-series-final-vs-sri-lanka-2723056-2025-05-11",
      "headline": "Smriti Mandhana hits 11th ODI hundred in Tri series final vs Sri LankaStar India batter Smriti Mandhana brought up her 11th ODI century in the tri-series final against Sri Lanka in Colombo. Mandhana scored a magnificent 116 (101) with the help of 15 fours and two sixes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-vs-real-madrid-el-clasico-laliga-coaches-said-carlo-ancelotti-hansi-flick-2723053-2025-05-11",
      "headline": "FC Barcelona vs Real Madrid: What the coaches said ahead of El ClasicoAs LaLiga title hopes hang in the balance, Real Madrid and Barcelona prepare for a high-voltage El Clasico, potentially Carlo Ancelotti's last, with both coaches rallying their squads for one final charge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-cricketers-urge-go-on-ambati-rayudu-michael-clarke-2723020-2025-05-11",
      "headline": "Virat Kohli please don't retire: Cricketers urge India star to extend Test stayAs India braces for a transition in Test cricket, the spotlight is firmly on Virat Kohli's next move. Former legends believe his presence remains pivotal for India's success in the red-ball format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/englands-2027-world-cup-qualification-in-danger-after-odi-rankings-update-2723010-2025-05-11",
      "headline": "England's 2027 World Cup qualification in danger after ODI rankings updateThe England cricket team are in danger of not earning direct qualification for the ODI World Cup 2027 as they slipped to the eighth position after the annual rankings update by the ICC. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-afraid-of-england-seamers-county-cricket-takes-a-dig-at-star-batter-2722987-2025-05-11",
      "headline": "Virat Kohli afraid of England seamers? County cricket takes a dig at star batterThe official page of England's premier domestic first-class competition, County Championship, has taken a dig at Virat Kohli amid reports of his retirement from Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-for-business-not-growth-indian-super-league-i-league-ranjit-bajaj-2722982-2025-05-11",
      "headline": "All shine, no spine: Why Indian football is built for business, not growthThe glitzy Indian Super League may shine on the surface, but beneath the fireworks and packed stadiums lies a deeper issue: a league built more for profit than for nurturing talent and creating a sustainable football ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-cricketers-urge-go-on-ambati-rayudu-michael-clarke-2723020-2025-05-11",
      "headline": "Virat Kohli please don't retire: Cricketers urge India star to extend Test stayAs India braces for a transition in Test cricket, the spotlight is firmly on Virat Kohli's next move. Former legends believe his presence remains pivotal for India's success in the red-ball format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/englands-2027-world-cup-qualification-in-danger-after-odi-rankings-update-2723010-2025-05-11",
      "headline": "England's 2027 World Cup qualification in danger after ODI rankings updateThe England cricket team are in danger of not earning direct qualification for the ODI World Cup 2027 as they slipped to the eighth position after the annual rankings update by the ICC. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-afraid-of-england-seamers-county-cricket-takes-a-dig-at-star-batter-2722987-2025-05-11",
      "headline": "Virat Kohli afraid of England seamers? County cricket takes a dig at star batterThe official page of England's premier domestic first-class competition, County Championship, has taken a dig at Virat Kohli amid reports of his retirement from Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-for-business-not-growth-indian-super-league-i-league-ranjit-bajaj-2722982-2025-05-11",
      "headline": "All shine, no spine: Why Indian football is built for business, not growthThe glitzy Indian Super League may shine on the surface, but beneath the fireworks and packed stadiums lies a deeper issue: a league built more for profit than for nurturing talent and creating a sustainable football ecosystem."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}