{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-plans-to-eliminate-loan-foreclosure-charges-and-prepayment-penalties-2684812-2025-02-24",
      "headline": "RBI plans to eliminate loan foreclosure charges and prepayment penalties The central bank has invited feedback from the public and stakeholders on a draft circular directing banks not to levy foreclosure charges and pre-payment penalties on loans by March 21, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/these-3-banks-slash-loan-interest-rates-after-rbi-repo-rate-cut-bom-sbi-pnb-2684760-2025-02-24",
      "headline": "These 3 banks slash loan interest rates after RBI's repo rate cut The RBI, after a gap of five years, announced a reduction in the repo rate by 25 bps to 6.25%. A dip in the repo rate can lead to lower interest rates on loans, thereby making loans cheaper, and vice versa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-reciprocal-tariffs-india-impact-explained-2684743-2025-02-24",
      "headline": "Will Donald Trump's tariffs hurt India? Here's what S&P saysIn its latest report, titled 'Asia-Pacific Economies Likely To Be Hit By US Trade Tariffs', S&P pointed out that countries like Vietnam, Taiwan, Thailand, and South Korea have stronger trade ties with the US."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-dalal-street-ends-in-red-sensex-loses-over-850-points-it-stocks-crash-wipro-infosys-2684708-2025-02-24",
      "headline": "Dalal Street ends in red: Sensex loses over 850 points, IT stocks crashThe S&P BSE Sensex lost 856.55 points to close at 74,454.41, while the NSE Nifty50 shed 242.55 points to end at 22,553.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tax-planning-2025-3-easy-ways-to-maximise-tax-savings-before-march-31-2684662-2025-02-24",
      "headline": "Tax planning 2025: 3 easy ways to maximise tax savings before March 31One can invest in Equity Linked Saving Schemes (ELSS), Public Provident Fund (PPF), life insurance premiums, National Savings Certificate (NSC) and tax-saving fixed deposits, to claim deductions of up to Rs 1,50,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nifty-set-for-its-longest-losing-streak-in-28-years-should-you-be-worried-2684694-2025-02-24",
      "headline": "Nifty set for longest losing run in 28 years. Should you be worried?The Nifty losing for five months straight is a rare sight. Last time this happened was in 1996, and before that in 1994-95, when it fell 31.4% over eight months. Right now, the index has fallen over 11% since October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/former-icici-bank-chief-chanda-kochhar-launches-podcast-journey-unscripted-youtube-2684681-2025-02-24",
      "headline": "Former ICICI Bank chief Chanda Kochhar launches podcast Chanda Kochhar, 63, joined ICICI Bank in 1984 and worked her way up to become its Managing Director (MD) and Chief Executive Officer (CEO) in 2009. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-rate-cut-expectations-reduce-lending-rates-again-in-april-policy-meeting-governor-sanjay-malhotra-2684655-2025-02-24",
      "headline": "Will RBI reduce lending rates again in April policy meeting?The recent MPC meeting, held from February 5-7, saw all members agreeing that a rate cut was needed to support slowing economic growth, as inflation was no longer a major concern."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sip-investment-options-nps-ppf-or-mutual-funds-which-is-best-for-you-2684617-2025-02-24",
      "headline": "NPS, PPF, or mutual funds: Which SIP investment should you opt for? Are you looking to invest in SIP but unsure where to put your money? Read to know whether you should opt for PPF, NPS, or mutual funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-bill-what-is-clubbing-of-income-under-family-taxation-2684606-2025-02-24",
      "headline": "Income Tax Bill: What is clubbing of income under family taxation In certain cases, income earned by an individual can be included in another taxpayer's income. In such cases, the latter is eligible to pay taxes not only on his income but also on the income of the other person as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-today-5-things-to-know-about-sensex-nifty-crash-2684586-2025-02-24",
      "headline": "Sensex, Nifty in red. 5 things to know about stock market bloodbathSeveral factors are behind the bloodbath on Dalal Street, especially the exodus of foreign institutional investors (FIIs) who have sold stocks over Rs 2 lakh crore since October 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/earning-up-to-rs-1275-lakh-why-you-should-opt-for-new-income-tax-regime-2684562-2025-02-24",
      "headline": "Earning up to Rs 12.75 lakh? Why you should opt for new income tax regimeEarlier, taxpayers earning up to Rs 7 lakh paid nil taxes under the new regime. Now that limit has been raised to Rs 12 lakh. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-800-points-nifty-down-3-reasons-why-stock-market-is-falling-today-nse-bse-fiis-it-stocks-2684495-2025-02-24",
      "headline": "Sensex tanks 800 points: 3 reasons why stock market is falling todayThe S&P BSE Sensex lost 676.83 points to 74,634.23, while the NSE Nifty50 fell 203.05 points to 22,592.85 as of 10 AM. IT stocks were the worst hit, with HCLTech falling nearly 3%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-red-sensex-down-700-points-hcltech-falls-3-percent-2684485-2025-02-24",
      "headline": "Stock market opens in red: Sensex down 700 points. HCLTech falls 3%The S&P BSE Sensex lost 672.83 points to 74,638.23, while the NSE Nifty50 shed 216.80 points to 22,579.10 as of 9:40 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-fii-selling-dampens-investor-sentiment-dalal-street-when-will-it-stop-sensex-nifty-2684477-2025-02-24",
      "headline": "FII selling dampens investor sentiment on Dalal Street: When will it stop? Foreign institutional investors (FII) have been on a selling spree which has hampered investor sentiment on Dalal Street, affecting Sensex and Nifty as they are moving funds to other markets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/quality-power-ipo-listing-market-debut-dalal-street-check-latest-gmp-2684459-2025-02-24",
      "headline": "Quality Power IPO listing: Will it make a strong market debut? Check latest GMPQuality Power IPO opened for subscription on February 14, 2025, aiming to raise Rs 858.70 crore. The public issue consisted of a fresh issue of 53 lakh shares worth Rs 225 crore and an offer for sale (OFS) of 1.49 crore shares worth Rs 633.70 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-rewards-executives-with-200-percent-bonus-despite-ongoing-job-cuts-3600-layoff-2684450-2025-02-24",
      "headline": "Meta rewards executives with 200% bonuses despite ongoing job cutsThe bonus for top executives was increased to 200% from 75% and the decision was approved by Meta's Compensation, Nominating, and Governance Committee (CNGC) after recent layoff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/health-insurance-4-tips-to-reduce-premiums-for-senior-citizens-2683576-2025-02-21",
      "headline": "Health insurance: 4 tips to reduce premiums for senior citizens Purchasing a health insurance policy at a younger age can help in securing reduced premium rates. Generally, lower insurance premiums are offered to younger people as they are considered low risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/index-funds-vs-etfs-5-key-things-every-investor-should-know-2683517-2025-02-21",
      "headline": "Index Funds vs. ETFs: 5 key things every investor should know Exchange-Traded Funds are traded like shares on the stock market and can be sold or purchased at existing market prices during the day, while Index Funds are traded only once at the closure of the share market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icmai-seeks-cost-accountant-inclusion-as-accountant-in-income-tax-bill-2683530-2025-02-21",
      "headline": "ICMAI demands 'accountant' status for cost accountants in new Income Tax BillIn its memorandum, ICMAI highlighted the extensive training of Cost and Management Accountants (CMAs), which includes expertise in taxation, finance, auditing, corporate laws, and strategic risk management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-regime-3-deductions-that-can-help-taxpayers-maximise-savings-nps-gratuity-standard-deduction-2683419-2025-02-21",
      "headline": "New tax regime: 3 deductions that can help taxpayers maximise savings  Though the new regime offered concessional tax rates, it reduced several popular deductions and exemptions, like HRA, LTA, interest on home loans, Section 80C, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ai-to-take-center-stage-at-the-3rd-digital-news-publishers-association-conclave-2683481-2025-02-21",
      "headline": "AI to take centre stage at the 3rd Digital News Publishers Association ConclaveThrough various keynote sessions, panel discussions and expert presentations, this year's DNPA Conclave aims to decode various critical issues, future strategies, opportunities and models that can power an equitable, inclusive and sustainable digital media ecosystem in an era of rapid technological advancement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/association-of-mutual-funds-amfi-launches-chhoti-sip-tarun-yojana-and-mitra-all-you-need-to-know-2683468-2025-02-21",
      "headline": "AMFI launches Chhoti SIP, Tarun Yojana, and MITRA. All you need to knowThe latest initiative by AMFI reinforces its goal of making mutual fund investments accessible to all investors across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-fall-another-session-auto-stocks-tumble-2683435-2025-02-21",
      "headline": "Sensex, Nifty end lower for another session; auto stocks tumbleThe S&P BSE Sensex ended 424.90 points to 75,311.06 at the closing bell, while the NSE Nifty50 fell 117.25 points to settle at 22,795.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/best-high-conviction-stocks-should-you-invest-or-not-explained-2683399-2025-02-21",
      "headline": "Explained: What are 'high-conviction stocks' and why investors should track themHigh-conviction stocks are shares that investors, analysts, or fund managers strongly believe will deliver higher-than-average returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-when-will-it-be-formed-a-look-at-the-past-trends-2683359-2025-02-21",
      "headline": "8th Pay Commission: When will it be formed? A look at the past trendsA Pay Commission recommends changes to the salary structure, allowances and benefits to be offered to employees depending upon the prevailing economic structure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahindra-and-mahindra-share-price-falls-6-percent-today-rights-issue-subsidiaries-explained-2683333-2025-02-21",
      "headline": "Explained: Why M&M share price tumbled 6% todayThe stock tumbled after the company said it will put money into a rights issue for its two subsidiaries—Mahindra & Mahindra Financial Services (MMFSL) and Mahindra Lifespace Developers (MLDL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/worried-about-volatile-stock-market-check-these-10-best-multibagger-stocks-investment-2683312-2025-02-21",
      "headline": "Worried about volatile stock market? Check these 10 potential multibagger stocksThe most important factor for determining multibagger stocks is to check earnings and growth potential. Investors should seek stocks that consistently deliver revenue and profit, check metrics like PE ratio and dividend yield, and compare their performance with sectoral or broader market trends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/planning-to-start-sip-2-reasons-why-you-should-consider-nps-national-pension-scheme-2683286-2025-02-21",
      "headline": "Planning to start SIP? 2 reasons why you should consider NPSBy investing in NPS, individuals can claim tax benefits of up to Rs 1.5 lakh under Section 80C and an additional Rs 50,000 under Section 80CCD (1B)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/religare-enterprises-stock-price-jump-up-to-9-percent-today-burman-family-takeover-2683282-2025-02-21",
      "headline": "Explained: Why Religare Enterprises share price jumped up to 9% today Soon after the announcement, Religare's stock price climbed 8.52% to hit Rs 242 on the Bombay Stock Exchange. At around 11:24 am, shares of the company were trading 2.31% higher at Rs 228.15. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-may-let-foreign-electric-vehicle-makers-like-tesla-test-market-before-investing-2683262-2025-02-21",
      "headline": "India may let foreign EV makers like Tesla test market before investing: ReportThe government may let foreign electric vehicle makers like Tesla sell cars first and invest later, with final SMEC guidelines expected soon to kickstart local manufacturing incentives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-the-share-market-falling-today-3-key-reasons-to-know-2683247-2025-02-21",
      "headline": "Sensex tanks nearly 500 points. 3 reasons why stock market is falling todayThe S&P BSE Sensex was down 461.08 points to 75,274.88 at 11:32 am and the NSE Nifty50 fell 144.45 points to trade at 22,768.70. Here are 3 things investors need to know about today's stock market downturn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-fall-as-fii-selling-trumps-tariff-threat-batter-d-street-2683240-2025-02-21",
      "headline": "Sensex, Nifty fall as FII selling, Trump's tariff threat batter D-StreetThe S&P BSE Sensex was down 272.61 points to 75,463.64 at around 9:51 am, while the NSE Nifty50 declined 91.80 points to 22,821.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/punjab-national-bank-interest-rates-pnb-revises-interest-rates-check-new-home-car-and-personal-loan-rates-2683021-2025-02-20",
      "headline": "PNB revises interest rates. Check new home, car and personal loan rates There will be zero processing fees and documentation charges on most of PNB's home loan schemes till March 31, 2025, thereby making housing loans more affordable and more accessible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-smart-pension-plan-check-eligibility-and-other-details-2682975-2025-02-20",
      "headline": "LIC Smart Pension Plan: Check eligibility and other details The Smart Pension Plan requires a minimum investment of Rs 1,00,000, while there is no cap on the maximum purchase limit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-electric-vehicle-set-for-india-entry-with-first-ev-shipment-in-coming-months-report-2682925-2025-02-20",
      "headline": "Tesla set for India entry with first EV shipment in coming months: Report The US carmaker plans to start selling these cars in the three major cities of Mumbai, Delhi, and Bangalore around the third quarter of the year, say reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-ends-200-points-lower-nifty-below-23000-hdfc-falls-over-2-2682897-2025-02-20",
      "headline": "Sensex ends 200 points lower, Nifty below 23,000; HDFC falls over 2%Stock market closing today: The S&P BSE Sensex ended 203.22 points lower at 75,735.96, while the NSE Nifty50 fell 19.75 points to settle at 22,913.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-impact-on-indian-rupee-jefferies-explained-2682872-2025-02-20",
      "headline": "Will Donald Trump's reciprocal tariffs hurt Indian rupee? It may be noted that India was the 10th biggest exporter to the US in 2024, and higher tariffs might make it tougher for Indian businesses to sell their goods there."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/supreme-court-gratuity-act-can-employers-deny-gratuity-in-any-situation-check-ruling-2682833-2025-02-20",
      "headline": "Can employers deny gratuity in any situation? Here's all you need to knowWith the latest ruling, the Supreme Court has stated that if an employer dismisses an employee on grounds of moral turpitude, his gratuity can be forfeited without waiting for a court's verdict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fiis-continue-to-dump-indian-stocks-which-stocks-are-feeling-the-heat-2682829-2025-02-20",
      "headline": "FIIs continue to dump Indian stocks: Which stocks are feeling the heat? Data from National Securities Depository Limited (NSDL) showed that FPIs have dumped $3.5 billion worth of financial stocks in 2025 so far, accounting for 31% of their total sales of $11.45 billion as of February 14."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/ranveer-allahbadia-runs-to-car-after-recording-statement-in-latent-probe-2684803-2025-02-24",
      "headline": "Ranveer Allahbadia runs to car after recording statement in Latent probeRanveer Allahbadia was clicked in a hurried state, running towards his car as the paparazzi tried to capture his pictures on Monday. The YouTuber visited the Maharashtra Cyber office in Mahape after recording his statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kaushaljis-vs-kaushal-review-a-simple-yet-complex-tale-of-second-chance-in-love-2684706-2025-02-24",
      "headline": "Kaushaljis vs Kaushal review: A simple yet complex tale of second chance in loveReleased-Fri Feb 21, 2025Kaushaljis vs Kaushal movie review: This film is a heartfelt exploration of second chances in love, focusing on a middle-aged couple navigating the complexities of separation and familial expectations. Set in the relatable backdrop of Kannauj, the film captivates with its simplicity and stellar performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dupahiya-trailer-a-wedding-a-missing-bike-and-a-lot-of-chaos-in-offing-2684642-2025-02-24",
      "headline": "Dupahiya trailer: A wedding, a missing bike and a lot of chaos in offingThe first full trailer of Prime Video's upcoming comedy series, Dupahiya, is here. The show will feature actors such as Sparsh Shrivastava and Gajraj Rao in pivotal roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-dances-to-zingaat-with-fiance-at-mehndi-ceremony-watch-2684622-2025-02-24",
      "headline": "Bride-to-Be Prajakta Koli dances to Zingaat with fiance at mehndi ceremony. WatchPrajakta Koli shared glimpses of her mehndi ceremony as she danced joyfully with fiance Vrishank Khanal. The couple is set to marry on February 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zero-day-netflix-review-robert-de-niro-angela-bassett-jesse-plemons-political-drama-2684414-2025-02-24",
      "headline": "Zero Day review: Star power can't save this weakly executed political dramaReleased-Thu Feb 20, 2025Zero Day, directed by Lesli Linka Glatter, is a political drama featuring a stellar cast including Robert De Niro and Angela Bassett. While the performances are strong, the series struggles with plot depth and resolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/watch-jennie-and-doechii-bring-the-heat-with-extral-ahead-of-ruby-2684489-2025-02-24",
      "headline": "Watch: Jennie and Doechii bring the heat with ExtraL ahead of RubyJennie and Doechii are making waves with their latest collaboration, ExtraL. As Jennie gears up for her solo debut with the album Ruby, fans can expect a bold new chapter in her musical journey."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/munawar-faruqui-insulting-religion-jiohotstar-show-hafta-vasooli-complaint-2684460-2025-02-24",
      "headline": "Complaint against Munawar Faruqui for 'insulting religion' on Hafta Vasooli showComedian Munawar Faruqui landed in legal trouble after a complaint was filed against him for hurting religious sentiments through his show, Hafta Vasooli. The advocate shared a copy of the complaint on X. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mismatched-actor-prajakta-koli-shares-dreamy-pics-from-her-mehndi-ceremony-2684350-2025-02-23",
      "headline": "'Mismatched' actor Prajakta Koli shares dreamy pics from her mehndiContent creator and actor Prajakta Koli has started her pre-wedding celebrations with a vibrant mehndi ceremony. She shared joyful moments with her fiance Vrishank Khanal and family on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singhs-millionaire-concert-in-mumbai-comeback-stage-aajtak-2684255-2025-02-23",
      "headline": "Honey Singh's Millionaire concert in Mumbai showed what grand comebacks look likeYo Yo Honey Singh made a powerful return to the stage in Mumbai, captivating fans with his energy and heartfelt messages. His performance was a testament to his resilience and dedication to the art."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-indias-got-latent-controversy-tanmay-bhat-joke-unfiltered-tour-2684268-2025-02-23",
      "headline": "Samay Raina recalls what he asked Tanmay Bhat after India's Got Latent controversyComedian Samay Raina addresses the controversy surrounding YouTuber Ranveer Allahbadia's inappropriate remark on his show, India's Got Latent, during his tour in Canada. He recalled what he had asked Tanmay Bhat after the controversy erupted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-dig-badshah-raftaar-millionaire-india-tour-stage-aajtak-video-2684165-2025-02-23",
      "headline": "Honey Singh's jibe at Raftaar, Badshah: People say they'll write my destinyHoney Singh took a direct dig at fellow artists Badshah and Raftaar at the first Millionaire India Tour stop in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-take-on-diljit-dosanjh-punjabi-aa-gaya-oye-millionaire-tour-mumbai-stage-aajtak-2684161-2025-02-23",
      "headline": "Watch: Honey Singh's take on Diljit Dosanjh's 'Punjabi Aa Gaya Oye'Honey Singh launched his Millionaire India Tour in Mumbai, delivering a captivating performance that engaged a sold-out audience. He shared his take on Diljit Dosanjh's 'Punjabi aa gays oye', emphasising unity among diverse Indian communities."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/aap-bjp-br-ambedkar-bhagat-singh-photos-removal-claim-delhi-chief-minister-office-rekha-gupta-2684703-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AAP vs BJP on 'removal' of Ambedkar's photo from Delhi Chief Minister's officeThe opposition AAP and ruling BJP in Delhi sparred after the former alleged that photos of Dr BR Ambedkar and Bhagat Singh were taken down from the Chief Minister's office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ranveer-allahbadia-ashish-chanchalani-statements-police-obscene-remarks-indias-got-latent-2684705-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ranveer Allahbadia, Ashish Chanchalani record statements over Latent rowYouTubers Ranveer Allahbadia and Ashish Chanchalani have appeared before the Maharashtra Cyber Police to record their statements in connection with the 'India's Got Latent' controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-new-visa-immigration-rules-temporary-residents-tourist-students-work-impact-indians-2684702-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Canada lets officials cancel study, work visas; thousands of Indians may be hitOttawa's new immigration regulations have granted Canadian border officials greater authority to cancel study and work permits under specific conditions. The move could affect thousands of Indian students, workers and tourists in Canada. With the suspension of the Student Direct Stream (SDS) visa programme months back, Canada's stricter oversight may cause delays, financial losses, and uncertainty for thousands of Indians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-makhana-superfood-bihar-bhagalpur-rally-production-2684730-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM, in Bihar, prescribes superfood makhana, says he has it 300 days a yearPrime Minister Narendra Modi, addressing a rally in Bihar's Bhagalpur, said Makhana is a superfood and is an important part of breakfast for people across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-rivalry-dubai-drubbing-virat-kohli-2684785-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dubai drubbing confirms India vs Pakistan is no longer cricket's El ClasicoOnce considered to be the greatest rivalry in world cricket, it has now been reduced to a show of India's bench strength and the performances of their world-class stars. The gap between India and Pakistan has killed off the great rivalry and the match in Dubai in the Champions Trophy was proof of that. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/well-near-disputed-sambhal-mosque-on-public-land-uttar-pradesh-government-to-supreme-court-2684792-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Well near disputed Sambhal mosque situated on public land: UP to Supreme CourtThe Uttar Pradesh said a private well, locally known as Dharani Varah Koop, was situated on public land near the disputed mosque in Sambhal. It maintained that the land is situated near the disputed religious site, not inside it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/lokayukta-skips-ed-probe-clears-siddaramaiah-in-muda-land-case-2684729-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lokayukta ignores ED probe, asks Siddaramaiah just 30 questions in Muda caseThe Lokayukta filed a \"B Report\" clearing Chief Minister Siddaramaiah in the Muda scam, after asking him just 30 questions. The report exclusively accessed by India Today shows that the Lokayukta ignored critical findings from the Enforcement Directorate's investigation.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pak-intel-warns-of-islamic-state-plot-to-kidnap-foreigners-at-champions-trophy-2684573-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pak intel warns of Islamic State plot to kidnap foreigners at Champions TrophyPakistan's Intelligence Bureau has warned that ISKP plans to kidnap foreigners, especially Chinese and Arab nationals, attending the ICC Champions Trophy 2025. The group is reportedly conducting surveillance at key locations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/standpoint/story/dabidi-dibidi-lyrics-urvashi-rautela-nandamuri-balakrishna-sexualisation-vulgar-moves-2684720-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dabidi Dibidi: The overlooked role of lyrics in the sexualisation of Daaku Maharaaj songThe Telugu film Daaku Maharaaj is currently streaming on Netflix. Featuring Nandamuri Balakrishna and Urvashi Rautela, the song Dabidi Dibidi faced flak for overtly sexualising women, through its vulgar choreography and lyrics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/lpus-2025-batch-final-year-student-bags-rs-103-crore-118000-placement-package-2682322-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LPU's 2025 Batch Final Year Student Bags Rs 1.03 Crore ($1,18,000) Placement Package-Betireddy Naga Vamsi Reddy B. Tech student has secured a 1.03 Crore ($1,18,000) package with an AI robotics company and is set to graduate in May 2025. \r\n\r\n-Over 1,700 students have received packages ranging from Rs 10 LPA – Rs 1 Crore per annum \r\n\r\n-1,912 students received multiple job offers while Adireddy Vasu, secured 7 job offers, setting a rare and impressive record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/prisoners-of-war-russia-zelenskyy-proposal-putin-ukraine-war-end-us-2684691-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Zelenskyy proposes 'all for all' prisoners' swap with Russia to start end of warUkrainian President Volodymyr Zelenskyy proposed swapping all prisoners of war with Russia in a bid to end the ongoing war between the two nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/india-bloc-ked-the-opposition-front-as-a-grand-illusion-2683912-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "INDIA bloc-ked? The Opposition front as a grand illusionMost respondents to INDIA TODAY's Mood of the Nation poll value a strong Opposition even as doubts mount over the front's leadership and unity"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-delhi-railway-station-stampede-lady-rpf-constable-baby-crowds-dangers-laws-constitutions-legal-explained-2684684-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why RPF's celebration of constable with baby is earning it wrathInstead of ensuring a safe and supportive work environment, the Railway Protection Force (RPF) chose to celebrate a distressing visual a day after the stampede at New Delhi Railway station that killed 18 people. The RPF shared a photo of a woman constable managing the crowd on the platform while carrying her one-year-old child. This was slammed as \"optics of Nari Shakti\" and failure to provide basic support to a working mother."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/punjabi-donald-trump-viral-song-us-deport-illegal-immigrants-indians-cheema-y-gur-sidhu-diljit-dosanjh-2682278-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Punjabi Trump song got Indians deported from US, claim people. Here's whyThe Punjabi song Trump, which boasts of illegal immigration to the US, was uploaded on YouTube 6 months ago and used in reels by those crossing into the US illegally. With the Trump administration now sending back illegal immigrants, Indians are claiming in hilarious posts that the US President started deporting Indians after listening to the Punjabi song. Even Diljit Dosanjh recently referred to the Trump song, which has 54 million views."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uddhav-thackeray-cousin-rajs-smiling-photos-spark-strong-reunion-buzz-2684566-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uddhav Thackeray, cousin Raj's smiling photos spark strong reunion buzzRecent photos of Uddhav Thackeray, his wife Rashmi Thackeray and Raj Thackeray at a wedding together have sparked a strong reunion buzz between the Thackeray cousins after two decades of split."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-prepares-for-fiery-return-to-earth-aboard-dragon-2684714-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sunita Williams prepares for fiery return to Earth aboard DragonThe Crew-9 team is set to undock from the International Space Station (ISS) about a week after the arrival of Nasa's SpaceX Crew-10 mission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/maha-kumbh-2025-vicky-kaushal-katrina-kaif-to-milind-soman-celebs-who-took-holy-dip-in-2684763-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vicky Kaushal, Katrina to Milind Soman: Celebs who took holy dip in Maha Kumbh 2025One of the biggest spiritual gathering in the world, Maha Kumbh Mela 2025 is nearing its end. The gathering saw the presence of several celebrities, including Vijay Deverakonda, Katrina Kaif, Vicky Kaushal, Preity Zinta and Rajkummar Rao, among others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nifty-set-for-its-longest-losing-streak-in-28-years-should-you-be-worried-2684694-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nifty set for longest losing run in 28 years. Should you be worried?The Nifty losing for five months straight is a rare sight. Last time this happened was in 1996, and before that in 1994-95, when it fell 31.4% over eight months. Right now, the index has fallen over 11% since October."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-cox-bazar-air-force-base-terror-attack-death-casualties-muhammad-yunus-2684625-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "1 killed after 'criminals' attack Bangladesh air force base in Cox's BazarIn a brief statement, the Inter-Services Public Relations (ISPR), the public relations division of the Bangladesh Armed Forces, said the unprecedented attack at the base in Cox's Bazar led to a confrontation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/explosion-heard-near-russian-consulate-in-frances-marseille-report-2684639-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Russian consulate in France's Marseille attacked, Molotov cocktails thrown: ReportBelarusian media house NEXTA reported that unknown persons threw two Molotov cocktails into the garden within the premises of the consulate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/noida-woman-detained-beats-up-boy-lift-when-dog-owners-ignore-fear-filth-responsibility-2684635-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Love me, love my dog: India needs norms for pet-owner etiquette in public spacesA viral incident in Noida, where a woman dragged a scared child out of a lift over a dispute involving her unleashed dog, highlights a larger issue: the entitlement of pet owners. From ignored fears to unscooped waste, India's cities are grappling with the consequences of irresponsible dog ownership."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-tunnel-collapse-army-ndrf-deploy-machinery-to-rescue-trapped-people-2684496-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Telangana tunnel collapse: Hope fading for survivors, 40 metres left to goAs hope diminishes of the survival of the eight people trapped inside a collapsed tunnel, rescue operations intensified with specialised machinery being brought in to reach the final distance to those trapped inside. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/washroom-off-limits-forced-bribe-food-vasundhara-pankaj-oswal-on-uganda-prison-horror-investment-2684593-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Denied washroom, food: Indian-origin tycoon's daughter recounts Uganda jail horrorVasundhara Oswal, daughter of Indian-origin billionaire businessman Pankaj Oswal, has narrated the horrors she faced for three weeks in an Ugandan prison where she was jailed under false charges. She was denied washroom access as punishment and had to bribe officials for food, she recounted in interviews."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/rajasthan/story/congress-supporters-protest-jaipur-uproar-controversial-remarks-rajasthan-minister-avinash-gehlot-dadi-jibe-2684596-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chaos as cops block Congress workers' march to Rajasthan assembly over 'dadi' digDuring a discussion in the Rajasthan Assembly on February 21, state Minister Avinash Gehlot made the controversial \"in your Dadi's name\" remarks, seen as an allusion to former Prime Minister Indira Gandhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-in-sanam-teri-kasam-if-it-was-made-in-90s-2684810-2025-02-24",
      "headline": "Would cast Salman Khan in Sanam Teri Kasam if it was made in 90s: DirectorSanam Teri Kasam director Vinay Sapru spoke to us about the success of Sanam Teri Kasam and how they would have loved to cast superstar Salman Khan in it had it been made in the 90s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/katrina-kaif-takes-holy-dip-with-mother-in-law-in-triveni-sangam-at-maha-kumbh-2684814-2025-02-24",
      "headline": "Katrina Kaif takes a holy dip with her mother-in-law in Triveni Sangam at Maha KumbhKatrina Kaif takes a holy dip with her mother-in-law in Triveni Sangam at Maha Kumbh\r\nBollywood actor Katrina Kaif took a holy dip in Triveni Sangam with her mother-in-law Veena Kaushal. Speaking about her experience, she said, \"I am very fortunate that I could come here this time. I am really happy and grateful. I met Swami Chidanand Saraswati and took his blessings. I am just starting my experience here. I like the energy, beauty, and significance of everything. I am looking forward to spending the whole day here.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/maha-kumbh-2025-vicky-kaushal-katrina-kaif-to-milind-soman-celebs-who-took-holy-dip-in-2684763-2025-02-24",
      "headline": "Vicky Kaushal, Katrina to Milind Soman: Celebs who took holy dip in Maha Kumbh 2025One of the biggest spiritual gathering in the world, Maha Kumbh Mela 2025 is nearing its end. The gathering saw the presence of several celebrities, including Vijay Deverakonda, Katrina Kaif, Vicky Kaushal, Preity Zinta and Rajkummar Rao, among others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/ranveer-allahbadia-joke-indias-got-latent-allu-arjun-arrest-are-celebs-soft-target-2682430-2025-02-24",
      "headline": "Are celebrities soft targets? The answer is uncomfortably obviousMisplaced outrage over a tasteless joke by Ranveer Allahbadia raises a larger question: why does society fixate on punishing public figures while real issues remain sidelined? While they should be held accountable for their words and gestures because of the influence they enjoy, is it okay to treat them like criminals?"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-abrar-ahmed-shubman-gill-wasim-akram-reactiion-2684816-2025-02-24",
      "headline": "Be humble: Wasim Akram blasts Abrar Ahmed for send-off to Shubman Gill CT 2025 India vs Pakistan: Legendary Wasim Akram said he was not happy with Abrar Ahmed's send-off to Shubman Gill despite the brilliance of the delivery. Abrar fought a lone battle in Pakistan's disappointing show against their arch-rivals on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-temba-bavuma-heinrich-klaasen-injury-2684815-2025-02-24",
      "headline": "Temba Bavuma shares update on Heinrich Klaasen before Australia clash Champions Trophy 2025: South African captain Temba Bavuma shared an update on Heinrich Klaasen, who missed the match against Afghanistan due to a left elbow soft tissue injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-australias-alex-carey-happy-with-high-scoring-tracks-in-pakistan-a-lot-of-fun-2684806-2025-02-24",
      "headline": "Australia's Alex Carey happy with high-scoring tracks in Pakistan: A lot of funAustralia's Alex Carey has said that he is enjoying the high-scoring tracks in Pakistan after their amazing run-chase against England. Australia next face South Africa at Rawalpindi on February 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-rivalry-dubai-drubbing-virat-kohli-2684785-2025-02-24",
      "headline": "Dubai drubbing confirms India vs Pakistan is no longer cricket's El ClasicoOnce considered to be the greatest rivalry in world cricket, it has now been reduced to a show of India's bench strength and the performances of their world-class stars. The gap between India and Pakistan has killed off the great rivalry and the match in Dubai in the Champions Trophy was proof of that. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-wasim-akram-abhishek-sharma-2684769-2025-02-24",
      "headline": "Watch: Wasim Akram praises Abhishek, gives priceless advice to batterChampions Trophy 2025: Abhishek Sharma had a chance to meet the legendary Wasim Akram when India and Pakistan played on Sunday, February 23 at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-south-africa-alex-carey-bowling-attack-steve-smith-2684742-2025-02-24",
      "headline": "AUS vs SA: Alex Carey backs inexperienced Australia bowling to defend big totalsAlex Carey has backed Australia's inexperienced bowling attack to defend any total ahead of their clash against South Africa on February 25. Australia defeated England in their first match of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-australia-south-africa-rabada-smith-inglis-2684731-2025-02-24",
      "headline": "Australia vs South Africa, all you need to know: Predicted playing XI, Pitch reportChampions Trophy 2025: Steve Smith's Australia and Temba Bavuma's South Africa will face each other in an important Group B match on Tuesday, February 25 at the Rawalpindi Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-fielding-medal-ceremony-shikhar-dhawan-virat-kohli-2684687-2025-02-24",
      "headline": "Virat Kohli enjoys 'guest' Shikhar Dhawan's swagger in happy dressing room Champions Trophy 2025: Virat Kohli enjoyed the return of Shikhar Dhawan to the Indian dressing room. The former opener was invited as the special guest to the customary fielding medal ceremony after India hammered Pakistan by six wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-kuldeep-yadav-death-over-bowling-2684680-2025-02-24",
      "headline": "Is Kuldeep India's new death bowler? Spinner talks role after Pakistan heroicsChampions Trophy 2025: Kuldeep Yadav bowled a successful spell in the death overs against Pakistan. The spinner spoke about his new role and explained why Rohit Sharma has been using him in the final 10 overs of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-bangladesh-rachin-ravindra-recovers-injury-team-changes-2684649-2025-02-24",
      "headline": "Rachin Ravindra recovers from nasty blow, makes Champions Trophy debutChampions Trophy 2025, NZ vs BAN: All-rounder Rachin Ravindra, who suffered a head injury in Pakistan last week, made his Champions Trophy debut on Monday in Rawalpindi. Bangladesh also made two changes, bringing back the experienced Mahmadullah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-pakistan-sunil-gavaskar-virat-kohli-dubai-2684628-2025-02-24",
      "headline": "Pakistan's green shirt brings the best out of Virat Kohli: Sunil Gavaskar Champions Trophy, IND vs PAK: Former India captain Sunil Gavaskar, speaking to India Today, shed light on Virat Kohli's dominant hundred against Pakistan in India's six-wicket win in Dubai. Kohli hit 100 off 111 deliveries as India chased down 242. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-australia-south-africa-rabada-smith-inglis-2684731-2025-02-24",
      "headline": "Australia vs South Africa, all you need to know: Predicted playing XI, Pitch reportChampions Trophy 2025: Steve Smith's Australia and Temba Bavuma's South Africa will face each other in an important Group B match on Tuesday, February 25 at the Rawalpindi Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-fielding-medal-ceremony-shikhar-dhawan-virat-kohli-2684687-2025-02-24",
      "headline": "Virat Kohli enjoys 'guest' Shikhar Dhawan's swagger in happy dressing room Champions Trophy 2025: Virat Kohli enjoyed the return of Shikhar Dhawan to the Indian dressing room. The former opener was invited as the special guest to the customary fielding medal ceremony after India hammered Pakistan by six wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-kuldeep-yadav-death-over-bowling-2684680-2025-02-24",
      "headline": "Is Kuldeep India's new death bowler? Spinner talks role after Pakistan heroicsChampions Trophy 2025: Kuldeep Yadav bowled a successful spell in the death overs against Pakistan. The spinner spoke about his new role and explained why Rohit Sharma has been using him in the final 10 overs of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-bangladesh-rachin-ravindra-recovers-injury-team-changes-2684649-2025-02-24",
      "headline": "Rachin Ravindra recovers from nasty blow, makes Champions Trophy debutChampions Trophy 2025, NZ vs BAN: All-rounder Rachin Ravindra, who suffered a head injury in Pakistan last week, made his Champions Trophy debut on Monday in Rawalpindi. Bangladesh also made two changes, bringing back the experienced Mahmadullah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-pakistan-sunil-gavaskar-virat-kohli-dubai-2684628-2025-02-24",
      "headline": "Pakistan's green shirt brings the best out of Virat Kohli: Sunil Gavaskar Champions Trophy, IND vs PAK: Former India captain Sunil Gavaskar, speaking to India Today, shed light on Virat Kohli's dominant hundred against Pakistan in India's six-wicket win in Dubai. Kohli hit 100 off 111 deliveries as India chased down 242. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-shoaib-akhtar-india-vs-pakistan-team-management-brainless-2684522-2025-02-24",
      "headline": "Shoaib Akhtar slams Pakistan: It is a brainless, clueless team managementPakistan are all but out of the Champions Trophy 2025 after their limp defeat to India. Legendary fast bowler Shoaib Akhtar lashed out at the team, highlighting the lack of winning culture. Virat Kohli's unbeaten 100 handed Pakistan a six-wicket hammering in Dubai on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-virat-kohli-babar-azam-2684546-2025-02-24",
      "headline": "Virat Kohli deserves to be called 'King', not Babar Azam: Ex-Pakistan captainFormer Pakistan captain Mohammad Hafeez has slammed the spokesperson of Babar Azam, who hype the player on social media. Hafeez has said that if anyone deserves the title of 'King' it is Virat Kohli."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-pakistan-talk-about-virat-kohli-mohammad-rizwan-dubai-2684533-2025-02-24",
      "headline": "We should talk about Virat Kohli: Mohammad RizwanPakistan captain Mohammad Rizwan lauded Virat Kohli's match-winning century against his team, shutting down critics of the Indian batter before even addressing Pakistan's defeat. With this loss, Pakistan's hopes of reaching the Champions Trophy semi-finals came to an end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-virat-kohli-spin-struggles-ind-vs-pak-51st-century-dubai-2684413-2025-02-24",
      "headline": "How Virat Kohli conquered his spin demons to demolish Pakistan in DubaiStar India batter Virat Kohli was seen at his vintage best, playing a match-winning innings of 100* (111) against Pakistan in the ICC Champions Trophy 2025. The batting stalwart had to conquer his spin demons to rise above the odds and script another masterful chase for the Men in Blue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-shreyas-iyer-blessing-chance-dubai-2684527-2025-02-24",
      "headline": "Shreyas Iyer relishing India spot as 'blessing' after heroics vs PakistanShreyas Iyer is making the most of his ODI opportunity, proving his worth with a crucial fifty against Pakistan. His consistent performances have solidified his place as India's No. 4 ahead of the Champions Trophy semi-finals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-new-zealand-vs-bangladesh-ready-do-or-die-phil-simmons-2684491-2025-02-24",
      "headline": "Bangladesh ready for do-or-die clash against New Zealand: Phill SimonsBangladesh head coach Phil Simmons emphasised that his side is all geared up to face off in a do-or-die Champions Trophy clash against New Zealand on February 24. He highlighted how his side has had good training sessions in build up to the crucial Group A clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-rohit-sharma-injury-update-india-vs-pakistan-2684490-2025-02-24",
      "headline": "Rohit Sharma, Mohammed Shami injuries: Shreyas Iyer provides crucial updatesIndia vs Pakistan: India captain Rohit Sharma and fast bowler Mohammed Shami were away from the field for a fair amount of time due to injury concerns on Sunday. Shreyas Iyer provides a crucial update on the players after their second group stage game in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-virat-kohli-spin-struggles-ind-vs-pak-51st-century-dubai-2684413-2025-02-24",
      "headline": "How Virat Kohli conquered his spin demons to demolish Pakistan in DubaiStar India batter Virat Kohli was seen at his vintage best, playing a match-winning innings of 100* (111) against Pakistan in the ICC Champions Trophy 2025. The batting stalwart had to conquer his spin demons to rise above the odds and script another masterful chase for the Men in Blue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-shreyas-iyer-blessing-chance-dubai-2684527-2025-02-24",
      "headline": "Shreyas Iyer relishing India spot as 'blessing' after heroics vs PakistanShreyas Iyer is making the most of his ODI opportunity, proving his worth with a crucial fifty against Pakistan. His consistent performances have solidified his place as India's No. 4 ahead of the Champions Trophy semi-finals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-new-zealand-vs-bangladesh-ready-do-or-die-phil-simmons-2684491-2025-02-24",
      "headline": "Bangladesh ready for do-or-die clash against New Zealand: Phill SimonsBangladesh head coach Phil Simmons emphasised that his side is all geared up to face off in a do-or-die Champions Trophy clash against New Zealand on February 24. He highlighted how his side has had good training sessions in build up to the crucial Group A clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-rohit-sharma-injury-update-india-vs-pakistan-2684490-2025-02-24",
      "headline": "Rohit Sharma, Mohammed Shami injuries: Shreyas Iyer provides crucial updatesIndia vs Pakistan: India captain Rohit Sharma and fast bowler Mohammed Shami were away from the field for a fair amount of time due to injury concerns on Sunday. Shreyas Iyer provides a crucial update on the players after their second group stage game in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-hardik-pandya-jasprit-bumra-esque-performance-2684478-2025-02-24",
      "headline": "IND vs PAK: Hardik delivers a Bumrah-esque performance to win over fansHardik Pandya was an unsung hero for India during their win against Pakistan as he played the role of Jasprit Bumrah during the match. Hardik picked up the wickets of Babar Azam and Mohammad Rizwan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-virat-kohli-islamabad-fans-century-cheering-2684474-2025-02-24",
      "headline": "Watch: Kohli fans in Islamabad celebrate batter's century vs PakistanVirat Kohli's brilliance transcends rivalries, as Pakistan fans cheered his century during India's Champions Trophy win. The star batter's 51st ODI ton anchored India's dominant chase, proving yet again why he's adored worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-pakistan-shreyas-iyer-adaptability-dubai-2684462-2025-02-24",
      "headline": "Shreyas Iyer credits 'adaptability' for Dubai heroics vs PakistanIndia's Shreyas Iyer stressed the importance of adaptability in high-pressure matches, especially against rivals like Pakistan. Demonstrating this approach, he played a vital knock, scoring a crucial fifty and forging a game-changing 114-run partnership with century-maker Virat Kohli in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-views-jiohotstar-2684461-2025-02-24",
      "headline": "India vs Pakistan clash breaks viewership record on JioHotstarThe India vs Pakistan Champions Trophy match broke records on JioHotstar on Sunday, February 23. According to news agency PTI, 60.2 corer people viewed the match just on the streaming platform."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}