{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-staying-consistent-matters-more-than-timing-the-market-says-expert-2795674-2025-09-30",
      "headline": "Why staying consistent matters more than timing the market, says expertWhile market swings grab attention, experts insist that consistent investing, rather than trying to predict peaks and dips, is what helps investors achieve reliable growth over time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zoho-made-in-india-founder-sridhar-vembu-arattai-free-of-cost-whatsapp-competition-2795665-2025-09-30",
      "headline": "Is Zoho made in India? Founder Sridhar Vembu answersSridhar Vembu, founder and former CEO of Zoho Corporation, has addressed concerns about where Zoho products are developed, where user data is stored, and the pricing of its messaging service, Arattai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-reasons-why-gold-hit-a-record-high-today-should-you-buy-2795630-2025-09-30",
      "headline": "5 reasons why gold hit a record high today. Should you buy?Today, gold touched a historic high, fuelled by global uncertainty and market trends. We break down five key factors behind the rise, and whether it's a smart buy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/tcs-layoff-job-cut-staff-fluidity-list-it-shares-free-fall-h1b-visa-decline-orders-report-2795595-2025-09-30",
      "headline": "TCS shares slide as uncertainty grows over job cuts, staff report fluidity listTCS stock has fallen 4.65% in the past five days and 6.72% in the past month. Over the past year, it has lost nearly a third of its value, with reports of large-scale layoffs creating fresh panic among employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-post-office-savings-schemes-like-ppf-and-nsc-witness-a-rate-cut-2795557-2025-09-30",
      "headline": "Will Post Office Savings Schemes like PPF and NSC witness a rate cut?With the Finance Ministry set to review small savings rates at the end of September, many investors are wondering if schemes like PPF and NSC will see a cut. The RBI's recent repo rate reductions have only added to the speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/where-to-invest-in-psu-bank-nbfcs-analysts-pick-top-stocks-bajaj-pbn-housing-2795541-2025-09-30",
      "headline": "Where to invest in PSU banks and NBFCs? Analysts pick top stocksPSU banks remain one of the most attractive options in the current market. With the Reserve Bank of India (RBI) scheduled to meet soon, market watchers are keeping a close eye on any rate-related decisions"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-proposal-new-rules-gold-silver-loans-easy-borrowing-tighten-credit-checks-2795519-2025-09-30",
      "headline": "New RBI proposals to make borrowing easier, tighten credit checksAnnounced through seven directions and circulars on September 29, 2025, three of these changes will take effect from October 1, while four others have been released for public consultation until October 20, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-250-points-nifty-above-24500-bel-gains-1-percent-2795491-2025-09-30",
      "headline": "Sensex jumps 250 points, Nifty above 24,500; BEL gains 1%The S&P BSE Sensex was up 299.85 points to 80,664.79, while the NSE Nifty50 added 71 points to 24,705.90 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-ipo-wework-india-gmp-listing-gains-price-band-important-dates-should-you-invest-2795474-2025-09-30",
      "headline": "Tata Capital vs WeWork India: Which IPO should you invest in?Two names drawing strong attention this week are Tata Capital Ltd and WeWork India Management Ltd, both preparing to make their market debuts in October 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-new-rules-claim-settlement-of-deceased-account-holders-will-nominee-15-days-penalty-2795362-2025-09-29",
      "headline": "RBI simplifies process for claim settlement of deceased account holdersThe new framework by the Reserve Bank of India (RBI) has been introduced to remove the confusion caused by different practices followed by banks earlier."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/when-will-the-8th-pay-commission-be-implemented-here-is-what-you-should-know-2795162-2025-09-29",
      "headline": "When will the 8th Pay Commission be implemented? Here's what you should knowThe Pay Commission affects much more than basic salaries. It influences allowances, pensions, and long-term financial security. In times of rising inflation, employees and pensioners are especially keen for the Commission's work to begin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arattai-zoho-sridhar-vembu-whatsapp-alternative-piyush-goyal-radhika-gupta-2795288-2025-09-29",
      "headline": "From CEOs to ministers, support pours in for Zoho's ArattaiThe rise of Arattai has caught the attention of users, industry leaders, and public figures, many of whom have shared their support and congratulations for Zoho and its founder, Sridhar Vembu."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-the-taj-story-no-shiv-temple-claim-taj-mahal-controversy-2795672-2025-09-30",
      "headline": "Paresh Rawal's Taj Story poster sparks backlash, makers issue clarification The poster for Paresh Rawal's film 'The Taj Story' drew criticism for depicting a Shiva idol atop the Taj Mahal. Following backlash, filmmakers stated the film makes no religious claims and does not assert a Shiv temple exists in the monument."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/orry-rekha-viral-moment-star-studded-party-wins-internet-video-2795614-2025-09-30",
      "headline": "Orry and Rekha's viral moment at star-studded party wins over Internet. Watch Influencer Orry shared a video on Monday from producer Boney Kapoor's party. However, it was his interaction with veteran actor Rekha that is now going viral. The video has garnered more than a million views on Instagram. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vikram-good-bad-ugly-to-og-are-fanboy-films-the-new-formula-or-a-scary-trend-2795577-2025-09-30",
      "headline": "Vikram, Good Bad Ugly to OG: Are fanboy films the new formula or a scary trend? Indian cinema is witnessing a shift where fans influence film narratives, creating star-centric spectacles.  While these films thrill fanbases, concerns grow over storytelling being sidelined for mass appeal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahakali-akshaye-khanna-first-look-as-shukracharya-revealed-during-durga-puja-2795628-2025-09-30",
      "headline": "Mahakali: Akshaye Khanna's first look as Shukracharya revealed during Durga Puja Actor Akshaye Khanna's striking look as Shukracharya in 'Mahakali' was unveiled on Durga Puja. This marks a monumental chapter in the Prasanth Varma Cinematic Universe with Khanna's Telugu debut in a never-seen-before role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-resumes-patriot-filming-october-health-break-2795642-2025-09-30",
      "headline": "Mammootty resumes Patriot filming in October after 8-month health-related hiatus Malayalam superstar Mammootty will return to shoot after an eight-month-long break for health treatment. Director Mahesh Narayanan confirmed the actor's involvement during absence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-bachchan-sweet-moment-with-queer-fan-goes-viral-2795644-2025-09-30",
      "headline": "Got married because of you: Aishwarya Rai's sweet moment with queer fan goes viral Aishwarya Rai Bachchan shared a heartwarming moment with queer influencer Aditya Madiraju at Paris Fashion Week, who shared he got married because of her. The actor was touched by the story and gifted him a lipstick, praising his talent and sending blessings to his family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zurich-summit-sees-debut-of-ai-actor-tilly-norwood-dubbed-next-scarlett-johannson-2795593-2025-09-30",
      "headline": "Zurich Summit sees debut of AI actor Tilly Norwood, dubbed 'next Scarlett' AI actor Tilly Norwood debuts at the Zurich Summit, sparking interest from talent agencies. Creator Eline Van der Velden highlights the advantages of AI talent and industry attitudes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-javed-akhtar-farhan-akhtar-celebrate-amitabh-bachchan-birthday-on-show-2795607-2025-09-30",
      "headline": "KBC 17: Javed-Farhan Akhtar to celebrate Amitabh Bachchan's birthday on the show Amitabh Bachchan's 83rd birthday celebrations will be grand this year on the 'KBC 17' set. This time, Javed Akhtar and Farha Akhtar will grace the show as special guests to mark the joyous occasion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-supports-kantara-ticket-hike-opposes-film-boycotts-regional-tensions-2795615-2025-09-30",
      "headline": "Pawan Kalyan condemns Kantara boycott calls, says art should unite people Actor Pawan Kalyan supported a ticket hike for 'Kantara: Chapter 1' in Andhra Pradesh despite 'OG's' release challenges. He condemned calls to boycott or restrict films based on regional disputes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-simpsons-movie-sequel-release-date-here-2795623-2025-09-30",
      "headline": "The Simpsons Movie sequel announced; check out the release date here A sequel to The Simpsons Movie has been confirmed for release, two decades after the first film became a global hit in 2007. The Simpsons Movie sequel brings back Homer, Marge, Bart, Lisa and Maggie Simpson with fresh satire and new comic drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/proud-kannadiga-rishab-shetty-reacts-after-kantara-row-love-kannada-respect-all-languages-2795592-2025-09-30",
      "headline": "Proud Kannadiga Rishab Shetty reacts after row: Love Kannada, respect all languages Rishab Shetty has shared that he is learning Hindi to connect with audiences across India while staying proud of his Kannada roots. He recently faced criticism for speaking Kannada at a Hyderabad event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/katrina-kaif-first-outing-pregnancy-news-sunny-kaushal-birthday-bash-2795590-2025-09-30",
      "headline": "Katrina's first outing after pregnancy news, joins Sunny Kaushal's birthday bash After sharing her pregnancy news, actor Katrina Kaif celebrated her brother-in-law, actor Sunny Kaushal's birthday on Monday. Mini Mathur posted a photo featuring Katrina, Sunny, Isabelle Kaif, and herself from the birthday bash on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-shankar-criticised-remarks-rukmini-vasanth-jr-ntr-film-promotion-2795568-2025-09-30",
      "headline": "Producer asks Rukmini Vasanth to match 80% of Jr NTR's performance, gets trolled Telugu producer Ravi Shankar faced criticism for comments on Rukmini Vasanth at 'Kantara: Chapter 1' pre-release event in Hyderabad. The producer's remarks, intended to highlight Jr NTR's talent, were viewed as disrespectful to Rukmini."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papon-cancels-shows-until-october-1-following-death-of-zubeen-garg-2795572-2025-09-30",
      "headline": "In honour of Zubeen Garg, Papon cancels all shows Singer-composer Papon has suspended all shows and professional commitments following the death of Zubeen Garg. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/subhash-ghais-cryptic-post-amid-misconduct-claims-scary-to-meet-unknown-guys-2795571-2025-09-30",
      "headline": "Subhash Ghai's cryptic post amid misconduct claims: Scary to meet unknown guys Veteran film-maker Subhash Ghai reacted to sexual misconduct allegations with a cryptic post on social media. This came after actor Nehal Vadoliya shared her uncomfortable experience with the director. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-clears-air-on-instagram-unfollow-rumours-with-deepika-padukone-2795582-2025-09-30",
      "headline": "Farah Khan clears air on Instagram unfollow rumours with Deepika Padukone Farah Khan has clarified that she and Deepika Padukone were never following each other on Instagram, calling out rumours of a fallout as false. She also explained her eight-hour work comment was a joke and emphasised the importance of privacy over social media speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-37-day-36-written-update-baseer-ali-nehal-chudasama-halwa-fight-2795569-2025-09-30",
      "headline": "Bigg Boss 19 episode 37: Baseer, Nehal rock house with shouting match over halwa Baseer Ali and Nehal Chudasama engaged in an intense fight over the halwa made for Tanya Mittal's birthday. Their fight became the highlight of episode 37 of 'Bigg Boss 19'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ott-releases-madharaasi-play-dirty-steve-films-shows-to-watch-online-netflix-prime-video-sonyliv-2795534-2025-09-30",
      "headline": "OTT this week: Madharaasi, Steve, Play Dirty and more: What to watch, where and when This week, fans will be in for some interesting films and shows releasing on OTT. So it's time to grab your popcorn and feel comfortable while you select your favourite watch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/exclusive-rukmini-vasanth-credits-rishab-shetty-for-shaping-her-kantara-journey-2795525-2025-09-30",
      "headline": "Exclusive: Rukmini Vasanth credits Rishab Shetty for shaping her Kantara journey Rukmini Vasanth, who joins 'Kantara Chapter 1' as a warrior princess, called the experience \"a huge education.\" She credited Rishab Shetty and the writers for helping her understand the film's cultural roots and push herself through intense training.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/explosion-at-frontier-corps-headquarters-in-eastern-quetta-in-pakistan-5-killed-at-least-15-injured-2795653-2025-09-30",
      "headline": "8 killed in car bombing, firing outside Frontier Corps HQ in Pak's Quetta8 people died and several were injured in a blast near Quetta FC headquarters. Initial reports suggest the blast was of high intensity, but the exact nature of the explosion has not yet been determined. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-companies-eye-india-for-offshore-operations-amid-h-ib-visa-fee-surge-tech-companies-trump-global-capability-centres-2795678-2025-09-30",
      "headline": "US companies eye India for offshore operations amid H-1B fee surgeUS companies are eyeing India's 1,700 global capability centres (GCCs) for offshore operations as President Donald Trump's $100,000 H-1B visa fee disrupts talent strategies. India, hosting over half the world's GCCs, is evolving into a hub for high-value tasks like AI and drug discovery. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/arattai-app-sridhar-vembu-tamil-nadu-entrepreneurs-learn-hindi-business-dealings-zoho-founder-language-debate-2795318-2025-09-30",
      "headline": "Simple app, difficult name? Arattai revives language debateEarlier this year, Zoho's Sridhar Vembu urged Tamils to learn Hindi for business, sparking outrage in the south. Months later, his app Arattai, named in Tamil, has sparked a debate over its \"hard to pronounce\" name for Hindi speakers. The name of the app, whose downloads are soaring, has also revived the language debate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-p-chidambaram-mumbai-terror-attack-international-pressure-condoleeza-rice-bjp-reactions-2795429-2025-09-30",
      "headline": "US stopped us: Chidambaram's big 26/11 admission, BJP says too little, too lateAt the time of the attacks in 2008, the Congress veteran leader was the Union Home Minister. He revealed that the then US Secretary of State Condoleeza Rice had visited India to meet him and the Prime Minister, asking them not to react to the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hilsa-expensive-bengal-kolkata-luxury-bangladesh-2795641-2025-09-30",
      "headline": "This Durga Puja, why must-have Hilsa has become a luxury for many BengalisHilsa spawning grounds have shifted towards Bangladesh, India Today analysis shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-women-world-cup-2025-opening-ceremony-india-vs-sri-lanka-live-score-2795664-2025-09-30",
      "headline": "IND vs SL Live: Sri Lanka win crucial toss in GuwahatiWomen's Cricket World Cup Live Updates: Sri Lanka have won the toss and opted to bowl first in overcast Guwahati. The match is expected to be affected by rain later in the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cctv-doesnt-support-deliberate-ramming-of-bike-it-shows-loss-of-control-court-on-bail-to-bmw-crash-accused-2795603-2025-09-30",
      "headline": "CCTV doesn't support deliberate ramming of bike: Court on bail to BMW crash accusedThe court also flagged serious lapses by ambulance staff, who arrived within seconds but failed to assist the victim, weakening the prosecution's \"golden hour\" argument."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-president-donald-trump-nobel-peace-prize-gaza-peace-plan-middle-east-israel-qatar-arab-nations-2795600-2025-09-30",
      "headline": "Finally, Trump has a real shot at the Nobel Peace PrizeUS President Donald Trump's ambitious Gaza peace plan, backed by Israel, Qatar, and other Arab nations, has reignited speculation about his Nobel Peace Prize chances. If implemented, the deal could reshape Middle East diplomacy and secure Trump the award he had aggressively lobbied for. If not this year, then next, Trump now looks to have a real shot at the Peace Nobel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhanashree-verma-claims-yuzvendra-chahal-cheated-on-her-two-months-into-marriage-2795481-2025-09-30",
      "headline": "Dhanashree Verma claims Yuzvendra Chahal cheated on her two months into marriageDhanashree Verma has opened up about her troubled marriage with cricketer Yuzvendra Chahal, claiming infidelity just two months after their wedding. The couple divorced after three years, with Dhanashree focusing on personal well-being amidst public speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/israel-haifa-indian-troops-liberation-ottoman-rule-1918-2795228-2025-09-29",
      "headline": "Indian troops, not British, liberated Haifa: Israeli city to correct schoolbooksThe school history books in Israel's Haifa are being corrected to credit Indian soldiers for liberating the city from Ottoman rule in 1918, said Mayor Yona Yahav."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-india-vs-pakistan-asia-cup-final-operation-tilak-press-conference-2795673-2025-09-30",
      "headline": "Tilak Varma refuses to call India's Asia Cup win over Pakistan Operation TilakSpeaking to the press in Hyderabad on Tuesday, Tilak Varma said he was thrilled to have made the country proud with his match-winning knock against Pakistan in the Asia Cup final. The 22-year-old struck an unbeaten 69 to guide India to a successful chase of 147 in Dubai on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-rishab-shetty-pan-indian-film-2025-1000-crore-2795245-2025-09-30",
      "headline": "Kantara Chapter 1: The last Rs 1,000 crore hope for Indian cinema in 2025With the success of its predecessor and a bold prequel set in the Kadamba era, Rishab Shetty's 'Kantara Chapter 1' is the most anticipated Rs 1,000 crore contender of 2025 in Indian cinema. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/whats-behind-the-sudden-spell-of-heavy-rain-in-delhi-ncr-imd-explains-2795677-2025-09-30",
      "headline": "What's behind the sudden spell of heavy rain in Delhi-NCR?Heavy rains and festive rush combined to create a double blow for Delhiites, as they struggled through traffic jams on their way to their destinations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jk-rowling-calls-emma-watson-ignorant-over-transgender-rights-dispute-2795457-2025-09-30",
      "headline": "Ignorant of how ignorant she is: JK Rowling slams Emma Watson amid trans rights rowJK Rowling publicly responded to Emma Watson's comments on their relationship and transgender rights, calling her ignorant. The 'Harry Potter' author accused Watson of fuelling controversy during a period of personal threats and heightened security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/meet-pavan-davuluri-the-new-windows-chief-leading-microsofts-big-ai-powered-comeback-2795685-2025-09-30",
      "headline": "Meet Pavan Davuluri, the new Windows chief leading Microsoft's big AI-powered comebackIn a major reorganisation move, Microsoft has reunited its Windows engineering teams under Pavan Davuluri, the newly promoted President of Windows and Devices. Davuluri is now in-charge of driving Microsoft's AI-powered vision for Windows.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-the-taj-story-no-shiv-temple-claim-taj-mahal-controversy-2795672-2025-09-30",
      "headline": "Paresh Rawal's Taj Story poster sparks backlash, makers issue clarificationThe poster for Paresh Rawal's film 'The Taj Story' drew criticism for depicting a Shiva idol atop the Taj Mahal. Following backlash, filmmakers stated the film makes no religious claims and does not assert a Shiv temple exists in the monument."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/high-fever-kidney-failure-14-children-die-of-suspected-acute-encephalitis-syndrome-nagpur-chhindwara-investigation-2795654-2025-09-30",
      "headline": "High fever to kidney failure: 14 children die of suspected encephalitisFourteen children under 15 have died in Nagpur and Chhindwara hospitals in the past month from acute encephalitis syndrome (AES). Health authorities have launched investigations, while teams from national institutes are examining potential causes as more cases emerge."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-alleges-hamas-involvement-aid-flotilla-greta-thunberg-gaza-2795692-2025-09-30",
      "headline": "Israel claims Hamas ties to aid flotilla with Greta Thunberg on boardIsrael claims documents recovered in Gaza show Hamas links to the Global Sumud aid flotilla. The allegations raise tensions as the flotilla approaches the blockaded territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/can-festivals-decide-who-you-should-fall-in-love-with-2795200-2025-09-30",
      "headline": "Love in India now comes with a festival testWould you date someone who doesn't share your excitement for pandal hopping or garba nights? Festivals can reveal a lot about your partner, but should they really decide your love story?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/proud-kannadiga-rishab-shetty-reacts-after-kantara-row-love-kannada-respect-all-languages-2795592-2025-09-30",
      "headline": "Proud Kannadiga Rishab Shetty reacts after row: Love Kannada, respect all languagesRishab Shetty has shared that he is learning Hindi to connect with audiences across India while staying proud of his Kannada roots. He recently faced criticism for speaking Kannada at a Hyderabad event."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/didnt-even-check-pulse-court-raps-ambulance-staff-who-abandoned-delhi-bmw-crash-victim-2795663-2025-09-30",
      "headline": "Didn't even check pulse: Court raps ambulance staff who abandoned BMW crash victimThe court said the vehicle was \"miraculously\" right behind the accident, empty, and headed towards a hospital, yet the staff failed to check the victim's pulse or provide any aid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-origin-man-mumbai-ganesh-shenoy-extradited-after-20-years-to-face-manslaughter-charges-us-long-island-accident-2795596-2025-09-30",
      "headline": "Man from India extradited as US pursues 20-year-old driving-death caseA 54‑year‑old Indian-origin man has been extradited from Mumbai to the US to face manslaughter charges in a 2005 car crash on New York's Long Island. Ganesh Shenoy allegedly fled New York two weeks after the accident. The US Marshals, Department of Justice (DoJ) and the US Embassy in India facilitated his extradition on September 25, the first from India to the US since 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/why-howard-gardner-thinks-classrooms-will-be-obsolete-by-2050-and-why-india-should-listen-2795460-2025-09-30",
      "headline": "Why classrooms may vanish by 2050, and what India must do nowAt a recent Harvard forum, Howard Gardner predicted that the traditional classroom model may become obsolete by 2050, thanks to AI. In India, where rigid exams still rule, this isn't just a prediction, it's a warning. The question is this: Will we evolve, or be left behind in this BIG education revolution?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-sanskari-ki-tulsi-kumari-kissing-scene-trimmed-anti-alcohol-disclaimer-added-2795680-2025-09-30",
      "headline": "Sunny Sanskari: Kissing scene trimmed, anti-alcohol disclaimer added'Sunny Sanskari Ki Tusli Kumari' has been granted UA certification by the censor board. The makers have been asked to add an anti-alcohol disclaimer along with a kissing scene reduced by 60 per cent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/pataudi-family-joins-soha-ali-kunaal-kemmu-to-celebrate-daughter-inaayas-birthday-2795686-2025-09-30",
      "headline": "Pataudi family joins Soha Ali-Kunaal Kemmu to celebrate daughter Inaaya's birthdaySoha and Kunal, who married in 2015, welcomed their daughter Inaaya in 2017. The family celebrated her 8th birthday on Monday, September 29. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/tilak-varma-echoes-suryakumar-india-vs-pakistan-rivalry-no-longer-worth-the-hype-2795687-2025-09-30",
      "headline": "Tilak Varma echoes Suryakumar: India vs Pakistan rivalry no longer worth the hype Asia Cup 2025: Tilak Varma addressed the press upon his arrival in Hyderabad on Tuesday. From playing down the buzzword Operation Tilak to echoing Suryakumar Yadav's hot take on the India vs Pakistan rivalry, the young batter fielded a variety of questions. Tilak hit a match-winning 69 in the final against Pakistan in Dubai on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-india-vs-pakistan-asia-cup-final-operation-tilak-press-conference-2795673-2025-09-30",
      "headline": "Tilak Varma refuses to call India's Asia Cup win over Pakistan Operation Tilak Speaking to the press in Hyderabad on Tuesday, Tilak Varma said he was thrilled to have made the country proud with his match-winning knock against Pakistan in the Asia Cup final. The 22-year-old struck an unbeaten 69 to guide India to a successful chase of 147 in Dubai on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-women-world-cup-2025-opening-ceremony-india-vs-sri-lanka-live-score-2795664-2025-09-30",
      "headline": "IND vs SL Live: Sri Lanka win crucial toss in Guwahati Women's Cricket World Cup Live Updates: Sri Lanka have won the toss and opted to bowl first in overcast Guwahati. The match is expected to be affected by rain later in the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-vs-sri-lanka-livestream-pitch-report-2795570-2025-09-30",
      "headline": "Women's World Cup: IND vs SL livestreaming details, pitch and weather report The 2025 ICC Women's ODI World Cup kicks off on September 30, with India facing Sri Lanka in Guwahati. Here's everything you need to know about the fixture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/royal-challengers-bengaluru-sale-ipl-title-2024-diageo-valuation-2795612-2025-09-30",
      "headline": "RCB for sale? Lalit Modi fuels speculation, predicts record valuation Lalit Modi's social media post, along with ongoing reports, suggests that Royal Challengers Bengaluru, fresh from their maiden IPL title, may soon change ownership, as Diageo explores a sale that could establish new valuation benchmarks for the league."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-saim-ayub-asia-cup-test-squad-vs-south-africa-2795613-2025-09-30",
      "headline": "Pakistan punish Saim Ayub, all rounder loses place in Test squad Pakistan have pusnished Saim Ayub for his horrid run in the Asia Cup. The young all-rounder has been left out of the team's Test squad vs South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-vs-west-indies-ian-bishop-captian-rohit-paudel-presentation-ceremony-2795561-2025-09-30",
      "headline": "Watch: West Indies great inspires Nepal captain with touching words after T20I upset Former West Indies pacer Ian Bishop came up with a heartwarming gesture after Nepal's historic T20I win, pausing during the presentation to praise captain Rohit Paudel.  Nepal outclassed West Indies by 90 runs on Monday in Sharjah to win a T20I series against the former world champions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-afc-champions-league-withdraw-2795547-2025-09-30",
      "headline": "Mohun Bagan withdraw from ACL 2 as foreign players refuse to travel to Iran Indian football giant Mohun Bagan has withdrawn from the AFC Champions League 2 after six foreign players refused to travel to Iran due to safety concerns. The club has approached the Court of Arbitration for Sport seeking a fair resolution amid potential sanctions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-cricket-2025-world-cup-maiden-title-challenge-harmanpreet-kaur-2794717-2025-09-30",
      "headline": "Can Harmanpreet Kaur's Team India script history at home? Women's World Cup 2025 Preview: Harmanpreet Kaur faces a challenging task as India begin their quest for a maiden ICC title against Sri Lanka on September 30 at the Barsapara Stadium in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-collapse-asia-cup-final-india-captaincy-controversy-2795294-2025-09-30",
      "headline": "Mischievous schoolboys can't win Asia Cup: Pakistan focus on theatrics, fail as pros Asia Cup 2025: Pakistan's campaign was a disaster on every level and the team prioritised antics over cricket. Until they abandon theatrics and focus on basics, Pakistan will keep humiliating themselves despite early promise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistn-tilak-varma-shivam-dube-ms-dhoni-yuvraj-2795486-2025-09-30",
      "headline": "In Tilak Varma-Shivam Dube's epic stand, shades of MS Dhoni-Yuvraj Singh duo linger In Dubai's City of Gold, Tilak Varma and Shivam Dube shone under pressure, forging a partnership that echoed Dhoni and Yuvraj. Their calm yet explosive stand carried India past Pakistan to Asia Cup glory, thus establishing their legacy within Indian cricket history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-vs-west-indies-ian-bishop-captian-rohit-paudel-presentation-ceremony-2795561-2025-09-30",
      "headline": "Watch: West Indies great inspires Nepal captain with touching words after T20I upset Former West Indies pacer Ian Bishop came up with a heartwarming gesture after Nepal's historic T20I win, pausing during the presentation to praise captain Rohit Paudel.  Nepal outclassed West Indies by 90 runs on Monday in Sharjah to win a T20I series against the former world champions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-afc-champions-league-withdraw-2795547-2025-09-30",
      "headline": "Mohun Bagan withdraw from ACL 2 as foreign players refuse to travel to Iran Indian football giant Mohun Bagan has withdrawn from the AFC Champions League 2 after six foreign players refused to travel to Iran due to safety concerns. The club has approached the Court of Arbitration for Sport seeking a fair resolution amid potential sanctions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-cricket-2025-world-cup-maiden-title-challenge-harmanpreet-kaur-2794717-2025-09-30",
      "headline": "Can Harmanpreet Kaur's Team India script history at home? Women's World Cup 2025 Preview: Harmanpreet Kaur faces a challenging task as India begin their quest for a maiden ICC title against Sri Lanka on September 30 at the Barsapara Stadium in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-collapse-asia-cup-final-india-captaincy-controversy-2795294-2025-09-30",
      "headline": "Mischievous schoolboys can't win Asia Cup: Pakistan focus on theatrics, fail as pros Asia Cup 2025: Pakistan's campaign was a disaster on every level and the team prioritised antics over cricket. Until they abandon theatrics and focus on basics, Pakistan will keep humiliating themselves despite early promise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistn-tilak-varma-shivam-dube-ms-dhoni-yuvraj-2795486-2025-09-30",
      "headline": "In Tilak Varma-Shivam Dube's epic stand, shades of MS Dhoni-Yuvraj Singh duo linger In Dubai's City of Gold, Tilak Varma and Shivam Dube shone under pressure, forging a partnership that echoed Dhoni and Yuvraj. Their calm yet explosive stand carried India past Pakistan to Asia Cup glory, thus establishing their legacy within Indian cricket history."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}