{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/lpg-commercial-gas-cylinder-price-delhi-mumbai-chennai-increase-new-rate-2591614-2024-09-01",
      "headline": "Commercial LPG cylinders to get costlier from today, price hiked by Rs 39The price of commercial LPG cylinders has been increased nationwide, with a Rs 39 hike in Delhi for a 19 kg cylinder, now priced at Rs 1,691.50 as of September 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q1-gdp-fall-shaktikanta-das-rbi-government-spending-lok-sabha-elections-2591540-2024-08-31",
      "headline": "Lok Sabha polls, reduced spending: RBI Governor's reasons for Q1 GDP fallIndia's GDP growth slowed to 6.7 per cent in the April-June quarter, down from 8.2 per cent a year ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jp-morgan-and-isg-partner-to-bring-ondc-seller-app-at-global-fintech-fest-2024-2591461-2024-08-31",
      "headline": "JP Morgan and ISG partner to bring ONDC seller app at Global Fintech Fest 2024The partnership creates a 'one stop shop' solution for digital commerce by leveraging ISG's ONDC tech stack, powered by its ecosystem partner Protean, and the banking capabilities of JP Morgan in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-ipo-frenzy-why-companies-are-rushing-to-go-public-advantage-disadvantage-future-outlook-stock-markets-2591411-2024-08-31",
      "headline": "India's IPO frenzy: Why companies are rushing to go publicIn the first half of 2024, while global IPO markets cooled, India's IPO market has been on fire, bucking the trend seen in the US, Japan, and even China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gdp-growth-q1fy25-short-of-estimates-key-details-2590913-2024-08-30",
      "headline": "India's Q1 GDP grows at 6.7%, lowest in 5 quartersQ1 GDP growth: While the 6.7% growth is broadly in line with what experts had estimated, it falls short of the Reserve Bank of India's (RBI) projection of 7.2% for the same period.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-e-verification-deadline-penalty-august-30-pay-section-234f-2590894-2024-08-30",
      "headline": "ITR e-verification: You will have to pay penalty if...If you miss the 30-day window to e-verify, the date you finally verify your ITR will be considered as the filing date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bonus-issue-failed-to-impress-brokerages-dalal-street-explained-2590882-2024-08-30",
      "headline": "Explained: Why Reliance's bonus issue left brokerages unimpressedIt may be noted that there was no word on the potential listing of RIL's two key businesses—Reliance Jio and Reliance Retail."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-rise-over-12-percent-today-what-should-investors-do-2590857-2024-08-30",
      "headline": " Paytm shares rise over 12% today: What should investors do?This rise in shares comes amid important developments within the company, including the recent sale of its entertainment ticketing business to online food aggregator Zomato for Rs 2,048 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/simplified-pension-application-form-launched-for-retiring-government-employees-2590843-2024-08-30",
      "headline": "Simplified pension form launched for retiring government staff. Check detailsThe new form consolidates nine separate forms into a single, unified Form 6A. It also offers the option to download the ePPO, ensuring a seamless transition from employment to retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-investors-q1-gdp-data-rvnl-share-price-2590815-2024-08-30",
      "headline": "Sensex, Nifty end higher as investors await Q1 GDP data; RVNL up 4%The S&P BSE Sensex rose 231.16 points to 82,365.77, while the NSE NIfty50 settled 83.95 higher at 25,235.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q1-gdp-growth-preview-data-what-to-watch-out-for-outlook-expectations-2590803-2024-08-30",
      "headline": "India Q1 GDP growth preview: What to watch out for Analysts predict growth in the range of 6%-7.1% for Q1 FY25, compared with 7.8% in the previous quarter (Q4 FY24). Rating agencies and financial institutions have varying expectations for Q1 GDP growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rvnl-shares-surge-5-cross-rs-600-whats-behind-the-rally-2590746-2024-08-30",
      "headline": "RVNL shares cross Rs 600 mark after jumping 5%. What's behind the rally?Shares of this multibagger railway PSU have sharply corrected over the past month but are still up over 230% year-to-date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bonus-shares-issue-what-is-it-and-how-does-it-benefit-investors-2590685-2024-08-30",
      "headline": "Reliance bonus issue: What is it and how will it benefit shareholders?A bonus issue, also known as a bonus share issue, occurs when a company distributes additional shares to its existing shareholders at no cost to them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-global-fintech-fest-jan-dhan-yojana-pivotal-in-boosting-financial-inclusion-women-empowerment-2590680-2024-08-30",
      "headline": "'Jan Dhan Yojana pivotal in boosting financial inclusion': PM ModiSpeaking at the Global Fintech Fest (GFF), he mentioned how the scheme has been a game-changer in ensuring that banking services reach every corner of the country."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/uk-insurer-aviva-found-guilty-in-ud-26-million-fake-invoice-scandal-in-india-report-2590627-2024-08-30",
      "headline": "UK's Aviva found guilty in $26 million fake invoice scandal in India: ReportBritish insurer Aviva has been accused of violating regulations in India by using fake invoices and secret cash payments to bypass commission limits for sales agents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vistara-air-india-merger-check-impact-on-ticket-bookings-flight-operations-and-more-2590615-2024-08-30",
      "headline": "Vistara-Air India merger: Check impact on ticket bookings, flight operations and moreVistara-Air India merger: Travelers can expect expanded services and improved connectivity. Read on to see how this change will impact your bookings, flight operations, and travel experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-vistara-merger-likely-to-be-finalised-on-november-12-2590580-2024-08-30",
      "headline": "No Vistara flight bookings from September 3 ahead of merger with Air IndiaVistara-Air India merger: Starting from September 3, 2024, customers will no longer be able to book Vistara flights for travel on or after November 12, 2024. Bookings for these routes will be redirected to Air India's website."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/premier-energies-ipo-allotment-status-step-by-step-guide-gmp-today-2590555-2024-08-30",
      "headline": "Premier Energies IPO allotment: Step-by-step guide to check status Premier Energies IPO allotment: Investors can check their Premier Energies IPO allotment status online via the BSE website or Kfin Technologies Limited, the issue's registrar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-record-high-markets-moody-revises-growth-india-gdp-forecast-2590531-2024-08-30",
      "headline": "Sensex, Nifty rally to new peaks as Moody's revises India's growth forecast to 7.2%Sensex, Nifty rally to new peaks as Moody's revises India's growth forecast to 7.2%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-at-record-highs-as-moodys-lifts-indias-gdp-forecast-to-72-percent-2590522-2024-08-30",
      "headline": "Sensex, Nifty open at record highs as Moody's lifts India's GDP forecast to 7.2%The S&P BSE Sensex added 502.42 points to 82,637.03, while the NSE Nifty50 gained 87.45 points to 25,239.40. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/enforcement-directorate-aap-mla-amanatullah-khan-delhi-waqf-board-2591998-2024-09-02",
      "headline": "ED team at AAP MLA Amanatullah Khan's home, party claims he will be arrestedED team at AAP MLA Amanatullah Khan's home, party claims he will be arrested"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/andhra-pradesh-telangana-rains-flooding-weather-forecast-met-alert-trains-cancelled-pm-modi-2591982-2024-09-02",
      "headline": "Andhra, Telangana rain fury: 19 dead, schools shut, 140 trains cancelledAs incessant rain in Andhra Pradesh and Telangana caused severe flooding, property damage, and loss of lives, Prime Minister Narendra Modi spoke to Chief Ministers of both states and assured them of full support. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-nishad-kumar-silver-high-jump-2nd-medal-tokyo-2591969-2024-09-02",
      "headline": "Nishad Kumar wins silver in men's high jump, his 2nd medal at the Games Paris Paralympics: Nishad Kumar, 24, won a silver medal in the men's high jump T47 event, finishing behind America's Roderick Townsend. It was Nishad's second Paralympic medal after his silver in the same event in Tokyo in 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ias-sarada-muraleedharan-succeeds-husband-v-venu-kerala-chief-secretary-2591994-2024-09-02",
      "headline": "Mr and Mrs Chief Secretary: Husband passes top Kerala government post to wifeIAS officer Sarada Muraleedharan succeeded her husband, V Venu, as the Chief Secretary of Kerala, marking the first time in the state's history that a husband-wife duo has held the top bureaucratic post in succession."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/how-to-do-intermittent-fasting-right-2590788-2024-09-02",
      "headline": "How to do intermittent fasting rightLooking to shed those extra kilos and maintain a healthy lifestyle? Consider giving intermittent fasting a try. But before you do, remember that this dietary approach only delivers results when done the right way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gaza-war-israel-tel-aviv-jerusalem-protests-hostages-killed-in-gaza-2591987-2024-09-02",
      "headline": "Israelis protest against killing of 6 hostages in Gaza, demand ceasefire dealCrowds estimated up to 500,000 strong demonstrated in Jerusalem, Tel Aviv and other cities, demanding that Prime Minister Benjamin Netanyahu do more to bring home the remaining 101 hostages, about a third of whom Israeli officials estimate have died."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-mens-doubles-rohan-bopanna-matthew-ebden-maximo-gonzalez-andres-molteni-2591981-2024-09-02",
      "headline": "US Open: Rohan Bopanna-Matthew Ebden crash out of men's doubles in pre-quarters Rohan Bopanna crashed out of the US Open men's doubles event along with partner Matthew Ebden with straight sets loss against Maximo Gonzalez and Andrés Molteni."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/hyderabad-rains-floods-schools-colleges-shut-it-firms-employees-work-from-home-policy-red-alert-imd-2591972-2024-09-02",
      "headline": "Hyderabad schools shut today amid floods, work from home advisory for IT firmsSchools and colleges in flood-hit Hyderabad will remain shut on Monday following a red alert for extremely heavy rain in the city and other parts of the state. IT companies have been asked to allow their employees to work from home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-sheetal-devi-video-bullseye-crowd-commentators-delight-reaction-2591920-2024-09-01",
      "headline": "Watch: Armless archer Sheetal leaves Paris crowd in awe by shooting bullseyeParis Paralympics 2024: India's Sheetal Devi, the only armless archer in the women's section in the Paris Paralympics, left the crowd at the Invalides arena in awe when she hit the bullseye with her first shot on Saturday. Sheetal flaunted her skill and accuracy before losing the Round of 16 by the narrowest of margins. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengali-actors-civil-groups-overnight-protests-kolkata-trainee-doctor-rape-murder-cbi-case-2591966-2024-09-02",
      "headline": "Bengali actors take part in overnight protests over Kolkata doctor's rape-murderProminent Bengali actors and other personalities from the film industry took part in the overnight protests, demanding justice for a trainee doctor who was raped and murdered at RG Kar hospital, which triggered nationwide outrage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-coco-gauff-shock-exit-emma-navarro-pre-quarters-2591974-2024-09-02",
      "headline": "Defending champion Coco Gauff makes shock exit in pre-quartersUS Open 2024: Defending champion Coco Gauff failed to make her way through to the quarterfinals of the women's singles after losing to Emma Navarro. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/release-of-kangana-ranauts-emergency-postponed-due-to-censor-board-issues-death-threats-to-actor-sources-2591921-2024-09-01",
      "headline": "Release of Kangana Ranaut's 'Emergency' postponed: SourcesWhile confirming the postponement of the film, sources close to Kangana's team said that the Mandi Lok Sabha MP remains hopeful that the film will be released within the next 10 days. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-rain-floods-constables-save-man-drowning-flooded-stream-nagarkurnool-imd-red-alert-2591973-2024-09-02",
      "headline": "Video: Telangana cops risk their lives to save man from flooded streamTwo constables in Telangana's Nagarkurnool district risked their lives to save a man from being washed away by a flooded stream amid heavy rainfall. A video of the incident has gone viral."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/kolkata-rape-murder-case-protest-woman-molested-police-probe-2591937-2024-09-01",
      "headline": "Man flashes woman during Kolkata rape-murder protestAccording to witnesses, the accused, who is believed to be mentally unstable, flashed his private parts to a protesting woman. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-presidential-elections-kamala-harris-more-predictable-than-donald-trump-says-russia-2591927-2024-09-01",
      "headline": "Kamala Harris more predictable than Donald Trump, says RussiaKremlin spokesman Dmitry Peskov appeared dismissive of Trump's boast that he could end the Ukraine war within 24 hours if U.S. voters returned him to the White House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-muslims-attacks-minorities-beef-suspicion-bjp-maharashtra-haryana-2591936-2024-09-01",
      "headline": "Rahul Gandhi jabs BJP over attacks on minorities, 'specifically Muslims'Congress leader Rahul Gandhi criticised the BJP-led government for being a \"mute spectator\" amid a rise in attacks on minorities across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chennai-night-street-race-naga-chaitanya-exclusive-interview-2591971-2024-09-02",
      "headline": "Naga Chaitanya flaunts love for motorsports at Chennai night street raceTelugu film superstar Naga Chaitanya, speaking to India Today, said he was thrilled to witness Chennai hosting the night street race. The owner of Hyderabad Blackbirds in the Indian Racing Festival, the actor called for more such initiatives across the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-badminton-wrap-iit-graduate-nitesh-ias-officer-suhas-finals-2591968-2024-09-02",
      "headline": "IIT graduate Nitesh, IAS officer Suhas storm into badminton finalsSuhas Yathiraj and Nitesh Kumar led India's charge in badminton at the Paris Paralympics on Sunday, September 1. The duo reached the finals of their respective categories to secure a medal in the Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/simi-rose-expelled-kerala-congress-exploitation-of-women-in-party-2591909-2024-09-01",
      "headline": "Congress expels Kerala leader who alleged exploitation of women in partySenior Congress leader from Kerala Simi Rosebell John was expelled hours after she accused the grand old party of having a casting couch system similar to the one in film industry. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-visa-ban-on-six-bangladeshi-student-leaders-fake-news-bangladesh-crisis-2591960-2024-09-01",
      "headline": "India calls visa ban on 6 Bangladeshi student leaders fake news: ReportThe reports in Bangladeshi media also claimed that the \"action\" was taken against the students for whipping up \"anti-India\" sentiments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/did-anubhav-sinhas-ic-814-changed-hijackers-names-to-hindu-heres-the-truth-2591786-2024-09-01",
      "headline": "Row over hijackers' Hindu names in 'IC 814'. Here's the truthAnubhav Sinha's web series 'IC 814' has courted controversy after a section of social media accused the filmmaker of deliberately \"changing\" the names of two of the hijackers to Bhola and Shankar. Here's the truth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-preethi-pal-200m-women-bronze-double-historic-track-2591962-2024-09-02",
      "headline": "After 100m, Preethi Pal wins 200m bronze in historic Games showParalympics 2024: Preethi Pal, 23, won the women's 200m T35 bronze medal, days after finishing on the podium in the 100m final. Preethi became the first Indian to win a track medal at the Paralympics.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/odisha-man-poses-police-inspector-woman-facebook-fake-marriage-arrested-2591977-2024-09-02",
      "headline": "Odisha man posing as cop dupes woman by marrying her, arrestedA man from Odisha's Bhadrak has been arrested on charges of duping a woman whom he befriended on Facebook and married after posing himself as a police inspector."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-police-accused-arrested-chief-ministers-relief-fund-scam-judicial-remand-2591976-2024-09-02",
      "headline": "2 arrested in alleged Telangana Chief Minister's Relief Fund scamThe Telangana Police arrested two people in Nalgonda district for allegedly embezzling funds from the Chief Minister's Relief Fund by submitting fake medical bills intended to help patients in need."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-nandamuri-balakrishna-balayya-50-years-in-telugu-cinema-2591993-2024-09-02",
      "headline": "Chiranjeevi at actor Balayya's golden jubilee bash: Want to do a film with himMegastar Chiranjeevi was one of the chief guests at actor-politician Nandamuri Balakrishna's event to celebrate his 50 years in Telugu cinema. He expressed his wish to do a film with him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/video/release-of-kangana-ranauts-emergency-postponed-sources-2591956-2024-09-01",
      "headline": "Release of Kangana Ranaut's 'Emergency' postponed: SourcesThe release of the upcoming biographical political drama \"Emergency\", which also marks the directorial debut of actor-turned politician Kangana Ranaut, has been postponed, sources told India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/video/aparna-sen-says-protests-would-continue-rg-kar-kolkata-rape-murder-case-2591925-2024-09-01",
      "headline": "Aparna Sen says protests will continue, but citizens have to be patientAparna Sen, who joined the protest against the rape and murder of a doctor in a government hospital in Kolkata, spoke about the delay in justice. While she urged everyone to keep patience, as the highest investigating agency is now handling it, she also said that the protests will continue. She also urged citizens to be mindful, asking them not to halt day-to-day activities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/release-of-kangana-ranauts-emergency-postponed-due-to-censor-board-issues-death-threats-to-actor-sources-2591921-2024-09-01",
      "headline": "Release of Kangana Ranaut's 'Emergency' postponed: SourcesWhile confirming the postponement of the film, sources close to Kangana's team said that the Mandi Lok Sabha MP remains hopeful that the film will be released within the next 10 days. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/alexander-zverev-us-open-2024-brandon-nakashima-aryna-sabalenka-elise-mertens-2591992-2024-09-02",
      "headline": "US Open: Alexander Zverev edges past Nakashima, Sabalenka eases into quarterfinalsAlexander Zverev qualified to the quarter-final of the US Open men's singles beating Brandon Nakashima by 3-6, 6-1,6-2, 6-2. Aryna Sabalenka also eased into quarter-finals with straight sets win over Elise Mertens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-mens-doubles-rohan-bopanna-matthew-ebden-maximo-gonzalez-andres-molteni-2591981-2024-09-02",
      "headline": "US Open: Rohan Bopanna-Matthew Ebden crash out of men's doubles in pre-quarters Rohan Bopanna crashed out of the US Open men's doubles event along with partner Matthew Ebden with straight sets loss against Maximo Gonzalez and Andrés Molteni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-coco-gauff-shock-exit-emma-navarro-pre-quarters-2591974-2024-09-02",
      "headline": "Defending champion Coco Gauff makes shock exit in pre-quartersUS Open 2024: Defending champion Coco Gauff failed to make her way through to the quarterfinals of the women's singles after losing to Emma Navarro. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chennai-night-street-race-naga-chaitanya-exclusive-interview-2591971-2024-09-02",
      "headline": "Naga Chaitanya flaunts love for motorsports at Chennai night street raceTelugu film superstar Naga Chaitanya, speaking to India Today, said he was thrilled to witness Chennai hosting the night street race. The owner of Hyderabad Blackbirds in the Indian Racing Festival, the actor called for more such initiatives across the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-nishad-kumar-silver-high-jump-2nd-medal-tokyo-2591969-2024-09-02",
      "headline": "Nishad Kumar wins silver in men's high jump, his 2nd medal at the Games Paris Paralympics: Nishad Kumar, 24, won a silver medal in the men's high jump T47 event, finishing behind America's Roderick Townsend. It was Nishad's second Paralympic medal after his silver in the same event in Tokyo in 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-badminton-wrap-iit-graduate-nitesh-ias-officer-suhas-finals-2591968-2024-09-02",
      "headline": "IIT graduate Nitesh, IAS officer Suhas storm into badminton finalsSuhas Yathiraj and Nitesh Kumar led India's charge in badminton at the Paris Paralympics on Sunday, September 1. The duo reached the finals of their respective categories to secure a medal in the Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-taylor-fritz-knocks-casper-ruud-out-with-dominating-win-in-quarters-2591967-2024-09-02",
      "headline": "Taylor Fritz knocks Casper Ruud out with dominating win in pre-quarters US Open 2024: Casper Ruud made his way into the quarters after beating USA's Taylor Fritz in four sets on Sunday at the Louis Armstrong Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-grigor-dimitrov-storms-into-quarters-thriller-vs-andrey-rublev-2591965-2024-09-02",
      "headline": "Grigor Dimitrov storms into quarters after thriller vs Andrey RublevUS Open 2024: Grigor Dimitrov fended off Andrey Rublev in a thrilling five-setter and secured his berth in the quarterfinal of the men's singles at Flushing Meadows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gus-atkinson-after-honours-board-double-at-lords-will-take-a-while-to-sink-in-2591963-2024-09-02",
      "headline": "Will take a while to sink in: Atkinson after Lord's Honours board double ENG vs SL: Gus Atkinson had a dream outing in the Lord's Test against Sri Lanka after he scored a hundred and picked up a five-wicket haul at the Lord's Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-preethi-pal-200m-women-bronze-double-historic-track-2591962-2024-09-02",
      "headline": "After 100m, Preethi Pal wins 200m bronze in historic Games showParalympics 2024: Preethi Pal, 23, won the women's 200m T35 bronze medal, days after finishing on the podium in the 100m final. Preethi became the first Indian to win a track medal at the Paralympics.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-paula-badosa-wang-yafan-yuki-bhambri-pre-quarters-2591951-2024-09-01",
      "headline": "Yuki Bhambri out in pre-quarters, Paula Badosa into maiden quarterfinalUS Open 2024: Paula Badosa stormed into the quarterfinals of the women's singles after beating China's Wang Yafan. India's Yuki Bhambri crashed out in the pre-quarters of the men's doubles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-taylor-fritz-knocks-casper-ruud-out-with-dominating-win-in-quarters-2591967-2024-09-02",
      "headline": "Taylor Fritz knocks Casper Ruud out with dominating win in pre-quarters US Open 2024: Casper Ruud made his way into the quarters after beating USA's Taylor Fritz in four sets on Sunday at the Louis Armstrong Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-grigor-dimitrov-storms-into-quarters-thriller-vs-andrey-rublev-2591965-2024-09-02",
      "headline": "Grigor Dimitrov storms into quarters after thriller vs Andrey RublevUS Open 2024: Grigor Dimitrov fended off Andrey Rublev in a thrilling five-setter and secured his berth in the quarterfinal of the men's singles at Flushing Meadows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gus-atkinson-after-honours-board-double-at-lords-will-take-a-while-to-sink-in-2591963-2024-09-02",
      "headline": "Will take a while to sink in: Atkinson after Lord's Honours board double ENG vs SL: Gus Atkinson had a dream outing in the Lord's Test against Sri Lanka after he scored a hundred and picked up a five-wicket haul at the Lord's Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-preethi-pal-200m-women-bronze-double-historic-track-2591962-2024-09-02",
      "headline": "After 100m, Preethi Pal wins 200m bronze in historic Games showParalympics 2024: Preethi Pal, 23, won the women's 200m T35 bronze medal, days after finishing on the podium in the 100m final. Preethi became the first Indian to win a track medal at the Paralympics.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-paula-badosa-wang-yafan-yuki-bhambri-pre-quarters-2591951-2024-09-01",
      "headline": "Yuki Bhambri out in pre-quarters, Paula Badosa into maiden quarterfinalUS Open 2024: Paula Badosa stormed into the quarterfinals of the women's singles after beating China's Wang Yafan. India's Yuki Bhambri crashed out in the pre-quarters of the men's doubles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-0-3-liverpool-luis-diaz-salah-arne-slot-2591938-2024-09-01",
      "headline": "Misery for Man United as ruthless Liverpool win 3-0 at Old TraffordPremier League: Luis Diaz's brace and Mo Salah's strike helped Liverpool secure a dominant 3-0 win at Manchester United. Arne Slot became the first Liverpool manager since 1936 to win on his first visit to the Old Trafford. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gus-atkinson-lords-love-affair-england-sri-lanka-test-series-2591931-2024-09-01",
      "headline": "Atkinson continues Lord's love affair as England sweep series 2-0 ENG vs SL: Ollie Pope's England beat Sri Lanka by 190 runs at the iconic Lord's Cricket Ground and claimed the two-match series 2-0. Gus Atkinson won the Player of the Match award for scoring a hundred and picking up a five-wicket haul. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-paris-badminton-wrap-nitesh-sl3-medal-suhas-sukant-nithya-2591928-2024-09-01",
      "headline": "Paralympics: Nitesh Kumar, IIT graduate, assured of badminton medalParis Paralympics 2024: Nitesh Kumar stormed into the final of the men's singles SL3 category. The IIT Mandi graduate was assured of his maiden Paralympics medal as India continued dominate the class in para-badminton at the Games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-yulia-putintseva-apologises-ball-girl-controversy-pissed-at-myself-2591923-2024-09-01",
      "headline": "Was pissed at myself: Yulia Putintseva apologises to ball girl US Open 2024: Yulia Putinseva issued a public apology after she misbehaved with a ball girl during her third round match against Jasmine Paolini on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-sheetal-devi-video-bullseye-crowd-commentators-delight-reaction-2591920-2024-09-01",
      "headline": "Watch: Armless archer Sheetal leaves Paris crowd in awe by shooting bullseyeParis Paralympics 2024: India's Sheetal Devi, the only armless archer in the women's section in the Paris Paralympics, left the crowd at the Invalides arena in awe when she hit the bullseye with her first shot on Saturday. Sheetal flaunted her skill and accuracy before losing the Round of 16 by the narrowest of margins. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/assam-t20-pride-cup-2024-live-streaming-squads-schedule-and-all-you-need-to-know-2591906-2024-09-01",
      "headline": "Assam T20 Pride Cup 2024: Squads, schedule and all you need to knowThe Assam T20 Pride Cup 2024 will be held from September 2 to 18 at the Nehru Stadium in Guwahati. New Star Club are the defending champions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-litton-das-hundred-2591905-2024-09-01",
      "headline": "Not my best Test innings: Litton Das on epic rescue act vs PakistanLitton Das refused to term his heroic 138 in Rawalpindi vs Pakistan as his best Test innings. Litton said that he was happy to play his part in Bangladesh getting back into the game after the team was 26/6 in the morning session on Day 3 of the Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yorgraj-singh-ms-dhoni-forgive-yuvraj-singh-bharat-ratna-biopic-2591897-2024-09-01",
      "headline": "Yuvraj Singh deserves Bharat Ratna, MS Dhoni 'ruined' his career: YograjFormer India cricketer Yograj Singh said his son Yuvraj should be recognised with the Bharat Ratna for his contribution to Indian cricket. In another attack against MS Dhoni, Yograj said the former captain 'ruined' his son's career by cutting it short by four to five years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-sheetal-devi-video-bullseye-crowd-commentators-delight-reaction-2591920-2024-09-01",
      "headline": "Watch: Armless archer Sheetal leaves Paris crowd in awe by shooting bullseyeParis Paralympics 2024: India's Sheetal Devi, the only armless archer in the women's section in the Paris Paralympics, left the crowd at the Invalides arena in awe when she hit the bullseye with her first shot on Saturday. Sheetal flaunted her skill and accuracy before losing the Round of 16 by the narrowest of margins. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/assam-t20-pride-cup-2024-live-streaming-squads-schedule-and-all-you-need-to-know-2591906-2024-09-01",
      "headline": "Assam T20 Pride Cup 2024: Squads, schedule and all you need to knowThe Assam T20 Pride Cup 2024 will be held from September 2 to 18 at the Nehru Stadium in Guwahati. New Star Club are the defending champions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-litton-das-hundred-2591905-2024-09-01",
      "headline": "Not my best Test innings: Litton Das on epic rescue act vs PakistanLitton Das refused to term his heroic 138 in Rawalpindi vs Pakistan as his best Test innings. Litton said that he was happy to play his part in Bangladesh getting back into the game after the team was 26/6 in the morning session on Day 3 of the Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yorgraj-singh-ms-dhoni-forgive-yuvraj-singh-bharat-ratna-biopic-2591897-2024-09-01",
      "headline": "Yuvraj Singh deserves Bharat Ratna, MS Dhoni 'ruined' his career: YograjFormer India cricketer Yograj Singh said his son Yuvraj should be recognised with the Bharat Ratna for his contribution to Indian cricket. In another attack against MS Dhoni, Yograj said the former captain 'ruined' his son's career by cutting it short by four to five years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-vs-east-bengal-derby-lucknow-when-and-where-to-watch-2591896-2024-09-01",
      "headline": "Mohun Bagan vs East Bengal: Why are the teams playing Derby in Lucknow?Mohun Bagan Super Giant are set to take on arch-rivals East Bengal in a Derby game at Lucknow. Here's everything you need to know about the fixture and why the teams are playing a Derby away from home.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ban-khurram-shahzad-credits-jason-gillespie-after-maiden-5-wicket-haul-2591894-2024-09-01",
      "headline": "Khurram Shahzad credits Jason Gillespie after maiden 5-wicket haul PAK vs BAN: Khurram Shahzad thanked Jason Gillespie for helping him out after he picked up his maiden five-wicket haul in Tests against Bangladesh in Rawalpindi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/ravi-rongali-shot-put-paris-paralympics-personal-best-fifth-final-2591881-2024-09-01",
      "headline": "Ravi Rongali sets personal best thrice in shot put final, misses medal Paris Paralympics: 28-year-old Ravi Rongali, who won silver in the Asian Para Games last year, came up with a spirited effort in the F40 shot put final, setting a personal best as many as three times on Sunday, September 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ban-litton-das-mehidy-hasan-khurram-shahzad-day-2-rawalpindi-report-2591883-2024-09-01",
      "headline": "Litton Das, Mehidy Hasan's rescue act rocks Pakistan in 2nd Test PAK vs BAN: Litton Das and Mehidy Hasan not only helped Bangladesh recover from the early blows, but also put them in a position of command in the second Test. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}