{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-declines-to-6-year-low-of-316-in-april-2724166-2025-05-13",
      "headline": "Retail inflation declines to 6-year low of 3.16% in AprilRetail inflation dropped to a six-year low of 3.16% in April 2025 from 3.34% in March, thanks to cheaper vegetables, fruits, pulses, and protein-rich food."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-vs-new-tax-regime-should-your-home-loan-decide-for-you-2724141-2025-05-13",
      "headline": "Old vs new tax regime: Should your home loan decide for you?Home loan benefits are important, but they aren't the only ones to think about. Other deductions under the old regime, like Section 80D (health insurance), Section 80G (donations) and HRA (House Rent Allowance), also make a difference."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-1282-points-lower-nifty-below-24600-infosys-down-nearly-4-percent-2724104-2025-05-13",
      "headline": "Sensex ends 1,282 points lower, Nifty below 24,600; Infosys down nearly 4%The S&P BSE Sensex was down by 1,281.68 points to end at 81,148.22, while the NSE Nifty50 lost 346.35 points to close at 24,578.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nissan-q4-result-loss-usd-45-billion-japan-carmaker-honda-jv-job-cut-2724084-2025-05-13",
      "headline": "Nissan reports loss of $4.5 billion amid financial woesNissan Q4: This is one of the biggest yearly losses in the company's history and a major drop compared to the previous year's net profit of 426.6 billion yen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/staying-invested-and-staying-patient-radhika-gupta-md-and-ceo-of-edelweiss-mutual-fund-advice-after-stock-market-surge-may-12-2724069-2025-05-13",
      "headline": "'Staying invested and staying patient': Radhika Gupta's advice after market surgeIndian stock markets surged over 3.7% on May 12, their strongest performance in nearly a year. The rally came after a ceasefire agreement between India and Pakistan over the weekend, along with positive signals from global markets and strong mutual fund inflows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/crypto-platforms-asked-to-track-jk-transactions-for-money-laundering-report-2724035-2025-05-13",
      "headline": "Crypto platforms asked to track J&K transactions for money laundering: ReportOver the last year, exchanges have made crypto withdrawals more restrictive, requiring users to provide more information about who is receiving the funds and why. These measures aim to curb misuse, given the anonymous and borderless nature of crypto."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-recovers-as-us-china-tariff-truce-spurs-bargain-buying-2724029-2025-05-13",
      "headline": "Gold recovers as US-China tariff truce spurs bargain-buyingSpot gold was up 0.6% at $3,254.39 an ounce, as of 0639 GMT. Bullion recorded a 2.7% decline in the previous session. US gold futures GCcv1 were up 1% at $3,258.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-sensex-nifty-fall-1000-points-investors-not-panic-dalal-street-bullish-experts-stay-calm-2724017-2025-05-13",
      "headline": "Sensex drops over 1,200 points, but here's why you shouldn't panicThe market pulled back from the gains made in the last session. The Sensex dropped over 1,000 points in early trade, and Nifty also slipped as investors booked profits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-shares-continue-to-rally-up-4-percent-today-buy-sell-or-hold-2724013-2025-05-13",
      "headline": "Yes Bank shares continue to rally, up 4% today. Buy, sell or hold?The stock has now climbed nearly 19% in just five trading sessions and 21% in a month, but top brokerages remain unconvinced. Most still have a 'sell' or 'neutral' rating on the lender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-all-7-forms-out-key-changes-taxpayers-must-know-itr-1-itr-2-itr-3-itr-4-itr-5-itr-6-itr-7-2723975-2025-05-13",
      "headline": "ITR Filing 2025: All 7 forms out, key changes taxpayers must knowOne big change this year affects salaried individuals and small business owners who earn long-term capital gains (LTCG) from listed shares or mutual funds. If the gains are up to Rs 1.25 lakh a year, they can now file returns using ITR-1 or ITR-4 forms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/swiggy-share-price-fall-7-percent-all-time-low-52-week-down-why-ipo-lock-in-period-expire-2723951-2025-05-13",
      "headline": "Explained: Why Swiggy shares fell up to 7% to hit 52-week low todaySwiggy shares have fallen around 45% since the beginning of the year. Over the past month, the stock has dropped 10%, and in the last three months, it has declined by 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-share-price-announce-q4-results-today-what-to-expect-pat-revenue-profit-2723930-2025-05-13",
      "headline": "Tata Motors to announce Q4 results today. Here's what to expectTata Motors stock: The company's share price fell nearly 1% during morning trade on Tuesday. It opened at Rs 720.55 and dropped to a day's low of Rs 714.35 as investors showed caution ahead of the results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-plans-counter-tariffs-on-us-goods-over-steel-and-aluminium-duties-2723916-2025-05-13",
      "headline": "India proposes retaliatory tariffs on select US goods over steel duties: ReportIndia is mulling retaliatory duties on select US goods exported to the country in response to Washington's tariffs on steel and aluminium products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-sensex-nifty-fall-after-ceasefire-rally-why-is-dalal-street-declining-today-2723897-2025-05-13",
      "headline": "Sensex sinks over 1,200 points: Why is the stock market falling today?At 1:03 pm, the BSE Sensex had dropped 1150.76 points to 81,285.65, while the NSE Nifty50 slipped 284.80 points to 24,641.65. Most Nifty sectoral indices were mixed, reflecting broader uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-300-points-lower-nifty-above-24800-infosys-falls-1-percent-2723885-2025-05-13",
      "headline": "Sensex, Nifty in red after Monday's rally; IT stocks take biggest hitThe S&P BSE Sensex was down by 1,000.64 points to 81,429.26, while the NSE Nifty50 lost 261.75 points to 24,662.95 as of 10:39 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-pharma-shares-us-president-donald-trump-order-trading-dalal-street-today-2723881-2025-05-13",
      "headline": "Pharma stocks to be in focus today on Dalal Street. 3 things to knowThe sudden focus on pharmaceutical shares is due to a new executive order signed by US President Donald Trump on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-rally-dalal-street-may-13-trading-setup-2723872-2025-05-13",
      "headline": "Stock market opening: Will Sensex, Nifty continue their rally today?GIFT Nifty on the NSE International Exchange was trading 26 points lower, or 0.10%, at 24,922 as of 8:13 am. This signals a weaker start for domestic markets on Tuesday, following Monday's steep gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-13-nse-bse-trading-tata-steel-hero-motocorp-airtel-tata-motors-2723862-2025-05-13",
      "headline": "Stocks to watch on May 13: Tata Steel, Hero MotoCorp, Airtel, Tata MotorsA ceasefire agreement between India and Pakistan gave a boost to investor confidence on Monday, leading to a sharp rise on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-tariff-truce-sparks-wall-street-rally-sp-500-hits-two-month-high-glbs-2723824-2025-05-13",
      "headline": "US-China tariff truce sparks Wall Street rally, S&P 500 hits two-month highWall Street surged Monday as the S&P 500 hit a two-month high, fueled by a temporary US-China tariff truce that eased trade war fears and boosted investor confidence in global markets.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/nissan-to-cut-20000-jobs-as-losses-mount-and-sales-drop-2723610-2025-05-12",
      "headline": "Nissan to cut 20,000 jobs as losses mount and sales drop: ReportNissan recently warned that it expects a record net loss of 700-750 billion yen ($4.74–$5.08 billion) for the last financial year, mainly due to impairment charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-6-must-know-tips-before-you-file-your-tax-return-2723569-2025-05-12",
      "headline": "ITR filing 2025: 6 Must-know tips before you file your tax returnBefore you even think about filing your tax return, make sure your Aadhaar is linked to your PAN. Also, choosing the correct ITR form is important. Filing the wrong one may lead to rejection of your return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-jumps-nearly-3000-points-nifty-above-24900-as-india-pakistan-ceasefire-fuels-relief-rally-2723556-2025-05-12",
      "headline": "Sensex jumps nearly 3,000 points as India-Pakistan ceasefire fuels relief rallyThe S&P BSE Sensex jumped 2,975.43 points to close at 82,429.90, while the NSE Nifty50 added 916.70 points to end at 24,924.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-hcltech-tech-mahindra-tcs-why-are-it-stocks-rising-today-2723539-2025-05-12",
      "headline": "Infosys, HCLTech, Tech Mahindra, TCS: Why are IT stocks rising today?The Nifty IT index surged over 6%, emerging as the top sectoral gainer on the NSE. Oracle Financial Services Software (OFSS) led the rally with a nearly 9% jump, followed by Coforge and Persistent Systems, which rose over 8% each. Blue-chip heavyweight Infosys gained close to 8%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/interglobe-aviation-ltd-indigo-shares-rise-10-percent-reason-notam-notice-2723531-2025-05-12",
      "headline": "IndiGo takes off on D-Street with 10% jump: What's behind the rally?IndiGo's share price jumped as much as 9.78% to touch a high of Rs 5,599. By noon, the stock was trading 7.45% higher at Rs 5,479.85. With this rise, IndiGo's share price has gone up 19.35% so far in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-loses-shine-as-us-china-trade-talks-ease-market-jitters-2723511-2025-05-12",
      "headline": "Gold loses shine as US-China trade talks ease market jittersThe US and China ended high-stakes trade talks on a positive note on Sunday, with US officials touting a \"deal\" to reduce the U.S. trade deficit, while Chinese officials said they had reached an \"important consensus\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-2600-points-to-cross-82000-mark-for-1st-time-in-7-months-2723495-2025-05-12",
      "headline": "Sensex surges over 3,000 points, best rally in a yearThe stock market rally was led by easing geopolitical tensions, supportive global cues, and renewed investor confidence after a sovereign credit upgrade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-fraud-auditors-ask-discrepancy-market-news-report-2723466-2025-05-12",
      "headline": "IndusInd Bank faces tough questions from auditors over possible fraud: ReportSo far, IndusInd Bank has described the issue as a 'discrepancy'. This is the term it has used in its stock exchange notices and in talks with analysts and credit rating firms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-opting-for-old-tax-regime-here-is-why-form-10-iea-is-a-must-itr-3-itr-4-2723486-2025-05-12",
      "headline": "ITR Filing 2025: Opting for old tax regime? Here's why Form 10-IEA is a mustForm 10-IEA is a declaration form for those who do not want to follow the new tax regime. If you earn income from a business or profession, and you wish to continue with the old tax regime, this form is essential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/united-states-china-90-day-reciprocal-tariff-pause-slashing-levels-donald-trump-xi-jinping-agreement-deal-consensus-2723464-2025-05-12",
      "headline": "US and China pause tariff war for 90 days, to slash reciprocal duties by 115%Under the agreement, the US will reduce tariffs on Chinese goods from 145% to 30%, while China will slash its tariffs on American imports from 125% to 10%, according to a joint statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-expectations-what-next-for-dalal-street-investors-after-india-pakistan-ceasefire-rally-2723445-2025-05-12",
      "headline": "Dalal Street soars after ceasefire. Should you buy, hold or sell stocks?After today's euphoric rally driven by the ceasefire between India and Pakistan, investors are basking in green screens. But with uncertainty still looming, the big question remains—what should they do next?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-share-price-rise-9-percent-why-sbmc-stake-sale-sbi-reason-japan-2723439-2025-05-12",
      "headline": "YES Bank share price rises 9%. Here's whyThe stake sale news led to a rise in Yes Bank's stock price, making it one of the top gainers of the day. The share price of Yes Bank went up by as much as 9% during the trading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-services-simplified-now-check-your-pf-balance-with-just-a-call-or-sms-2723437-2025-05-12",
      "headline": "EPFO services simplified: Now check your PF balance with just a call or SMSBefore you use these services, make sure your Universal Account Number (UAN) is active and linked to at least one of these: your bank account, Aadhaar number or PAN. Also, your mobile number must be registered with your UAN on the EPFO portal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pakistans-stock-exchange-halts-trading-for-an-hour-heres-why-2723417-2025-05-12",
      "headline": "Pakistan's stock exchange halts trading for an hour. Here's whyAccording to a notification from the Pakistan Stock Exchange (PSX), all equity and equity-based markets were temporarily suspended after the KSE-30 index rose more than 5% from the previous session's close — the threshold for a market halt under PSX rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/share-market-today-bse-sensex-rises-2000-points-top-stocks-check-list-2723404-2025-05-12",
      "headline": "Eternal, Adani Ports, Infosys: Top stocks as Sensex jumps over 2,000 pointsEternal (Zomato) led the gains, surging nearly 5% to become the top performer on the 30-share BSE Sensex. Other major gainers included Adani Ports, NTPC and HCLTech, all trading up more than 4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-india-trade-with-turkey-azerbaijan-suffer-amid-tensions-with-pakistan-2723400-2025-05-12",
      "headline": "Will India's trade with Turkey, Azerbaijan suffer amid tensions with Pakistan?Over the years, the trade between India and Azerbaijan has grown significantly, jumping from $50 million in 2005 to $1.435 billion in 2023. Further, India imported goods worth $1.235 billion and exported products worth $201 million to Azerbaijan, according to the official data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pakistan-stock-market-rise-9-percent-india-dalal-street-rally-ceasefire-sensex-nifty-2723383-2025-05-12",
      "headline": "Pakistan stock market jumps over 9% as India ceasefire brings calmPakistan's benchmark index surged over 9% on Monday, while Dalal Street also saw gains with Sensex and Nifty jumping 3%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-strong-rally-investors-celebrate-india-pakistan-ceasefire-what-to-expect-next-on-dalal-street-2723380-2025-05-12",
      "headline": "Sensex, Nifty up 3% after India-Pakistan ceasefire. What should investors do?With tensions easing and markets surging, global cues and earnings looking strong, should investors ride the momentum or wait for clearer signals before taking fresh positions?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-bull-run-sensex-nifty-up-3-percent-investor-wealth-rs-11-lakh-crore-stocks-driving-rally-2723370-2025-05-12",
      "headline": "Investors add Rs 11 lakh crore on D-Street: Which stocks are driving the rally?The Sensex jumped over 2,000 points, while the Nifty came close to the 24,700 mark. The overall mood on the street was upbeat, as investors welcomed signs of calm after days of concern."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-strong-opening-today-india-pakistan-ceasefire-strong-domestic-indicators-2723354-2025-05-12",
      "headline": "Sensex surges over 3,000 points. Why is the stock market rallying today?Stock market rally today: The BSE Sensex was up 2,975.93 points to 82,430.40 at around 3:26 pm, while the NSE Nifty50 climbed 920.50 points to trade at 24,928.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-rallies-1700-points-nifty-above-24500-ril-up-2-2723353-2025-05-12",
      "headline": "Sensex rallies 2,000 points; Nifty above 24,500; RIL up 3%The S&P BSE Sensex jumped 1,915.43 points to 81,369.90, while the NSE Nifty50 soared 572.80 points to 24,580.20 as of 9:30 am."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-sitaare-zameen-par-trailer-new-talent-inspiring-story-2724354-2025-05-13",
      "headline": "Sitaare Zameen Par trailer: Aamir Khan returns with an uplifting new storyAamir Khan's new film 'Sitaare Zameen Par' trailer has been released, showcasing a heartwarming story. The film promotes inclusivity and introduces fresh talent, creating high expectations among audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hina-khan-recreates-iconic-goblin-scene-with-rocky-jaiswal-during-south-korea-trip-2724292-2025-05-13",
      "headline": "Hina Khan recreates iconic Goblin scene with Rocky Jaiswal during South Korea tripTelevision star Hina Khan is currently exploring South Korea, recreating iconic K-drama scenes with Rocky Jaiswal at the locations where they were filmed.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-jumps-from-10000-feet-in-mission-impossible-8-stunt-2724275-2025-05-13",
      "headline": "Tom Cruise jumps from 10,000 feet in Mission Impossible - Final Reckoning stuntTom Cruise shared BTS video from 'Mission: Impossible – The Final Reckoning', showcasing his stunt training for 10,000 feet jump from airplane. The film, releasing on May 23, 2025, marks the franchise's epic finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/amar-kaushik-to-direct-lust-stories-3-with-vikramaditya-motwane-kiran-rao-2724250-2025-05-13",
      "headline": "Amar Kaushik to direct Lust Stories 3 with Vikramaditya Motwane: ReportDirector Amar Kaushik will join Vikramaditya Motwane, Kiran Rao, and Shakun Batra to direct a short film in Netflix's upcoming 'Lust Stories 3'. This will mark Kaushik's first project outside his usual horror-comedy genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-to-postpone-her-cannes-debut-amid-india-pak-tension-2724260-2025-05-13",
      "headline": "Alia Bhatt to postpone her Cannes debut amid India-Pak tensionActor Alia Bhatt is set to postpone her Cannes debut this year due to tensions between India and Pakistan. The actor was set to attend the festival on its opening day, May 13.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-sreeleela-pose-together-wrap-schedule-of-anurag-basu-untiled-film-2724241-2025-05-13",
      "headline": "Kartik Aaryan shares pic with Sreeleela as they wrap schedule of Anurag Basu's filmKartik Aaryan shared a picture with Sreeleela from the sets of their upcoming film by Anurag Basu. The two shared their excitement as they wrapped a schedule of the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kapil-sharmas-kis-kisko-pyaar-karoon-2-to-release-in-september-2724106-2025-05-13",
      "headline": "Kapil Sharma's Kis Kisko Pyaar Karoon 2 to release in September: ReportKapil Sharma will return with 'Kis Kisko Pyaar Karoon 2', which is likely to release on September 26, 2025. The date will mark exactly 10 years since the release of the original film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rounak-gulia-nikhil-singh-battleground-winners-abhishek-malhan-rubina-dilaik-2724217-2025-05-13",
      "headline": "Battleground: Rounak Gulia, Nikhil Singh emerge winnersThe 'Battleground' finale took place on May 10, where Rounak Gulia and Nikhil Singh were announced as the winners in the female and male categories, respectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-suniel-shetty-shilpa-shetty-dhadkan-re-release-in-theatres-2724207-2025-05-13",
      "headline": "Akshay Kumar, Suniel Shetty and Shilpa Shetty's Dhadkan to re-release in theatresPopular romantic film 'Dhadkan', starring Akshay Kumar, Suniel Shetty, and Shilpa Shetty, is set to re-release in theatres on May 23 in a digitally remastered format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gerard-depardieu-convicted-sexual-assault-french-cinema-2724189-2025-05-13",
      "headline": "French actor Gerard Depardieu convicted of sexual assaultFrench actor Gerard Depardieu has been convicted of sexually assaulting two women on a film set. The verdict marks a significant moment in addressing misconduct in the French film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-office-spinoff-the-paper-announced-to-premiere-in-september-2724147-2025-05-13",
      "headline": "The Office spinoff The Paper announced, to premiere in September'The Office' fans globally have a reason to rejoice as the new spinoff, 'The Paper', has been officially announced. The series will feature fresh cast members, promising to bring back the beloved humour and charm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/simi-garewal-cannes-film-festival-red-carpet-debut-aranyer-din-ratri-screening-2724156-2025-05-13",
      "headline": "Simi Garewal to make Cannes red carpet debut for Aranyer Din Ratri screeningVeteran actor Simi Garewal is set to make her Cannes red carpet debut. She will be attending the screening of the 4K restored version of Satyajit Ray's film 'Aranyer Din Ratri' (1970)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/bloodlines-actor-brec-bassinger-favourite-death-sequence-final-destination-franchise-exclusive-2724154-2025-05-13",
      "headline": "Brec Bassinger shares favourite death sequence in Final Destination franchiseFinal Destination: Bloodlines actor Brec Bassinger spoke about her experience of joining the Final Destination franchise, which is making a return after 15 years. The actor also spoke about the massive production scale of the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-indian-house-adaptation-passion-driven-acting-2724120-2025-05-13",
      "headline": "Nawazuddin Siddiqui skips watching House before Indian adaptationNawazuddin Siddiqui reveals he hasn't watched the original 'House MD' series before starring in the Indian adaptation. He aims to maintain originality and avoid influences while focusing on his passion-driven career."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/tom-cruise-meets-influencers-jannat-zubair-avneet-kaur-in-london-2724128-2025-05-13",
      "headline": "Namaste India! Tom Cruise meets influencers Jannat Zubair, Avneet Kaur in LondonHollywood star Tom Cruise recently met Jannat Zubair and Avneet Kaur in London ahead of 'Mission Impossible- The Final Reckoning'.  The film is set to release in India on May 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lee-do-hyun-military-discharge-new-drama-offers-career-comeback-2724098-2025-05-13",
      "headline": "Lee Do-hyun discharged from military service: What's Next for Korean actor?South Korean actor Lee Do-hyun has been officially discharged from his military service after 21 months. His return to the entertainment industry is expected to bring new projects and rekindle his rising career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-royals-wasted-zeenat-amans-comeback-ishaan-khatter-bhumi-pednekar-2724066-2025-05-13",
      "headline": "All smoke, no screen time: How The Royals wasted Zeenat Aman's comebackVeteran actor Zeenat Aman makes her much-anticipated comeback in Netflix's 'The Royals', but her return leaves fans disheartened. Read to find out how her presence was reduced to ornamental screen time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/cannes-film-festival-2025-homebound-to-charak-indian-films-set-for-global-spotlight-2724076-2025-05-13",
      "headline": "Cannes 2025: Homebound to Charak, Indian films set for global spotlightIndian films are making a strong mark at the Cannes Film Festival 2025 with films including 'Homebound', 'Aranyer Din Ratri', 'Tanvi The Great' and 'Charak'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-tory-lanez-attacked-in-prison-while-serving-time-in-megan-thee-stallion-case-2724065-2025-05-13",
      "headline": "Rapper Tory Lanez attacked in prison while serving time in Megan Thee Stallion caseRapper Tory Lanez was stabbed 14 times while serving his time in California prison for shooting American rapper and songwriter Megan Thee Stallion."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/omar-abdullah-kashmiris-killed-pakistan-shelling-operation-sindoor-pahalgam-terror-attack-2724359-2025-05-13",
      "headline": "Not enough being said about Kashmiris killed in Pak shelling: Omar AbdullahSpeaking to India Today TV, Omar Abdullah expressed disappointment at what he termed a \"lack of national attention\" to the deaths of citizens of Jammu and Kashmir caused by Pakistan's cross-border shelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-india-pakistan-terrorist-camp-attack-pahalgam-strike-ai-video-indian-army-2724294-2025-05-13",
      "headline": "Watch India Today special: Operation Sindoor reconstructed using AIIndia Today TV's special report on Operation Sindoor, using AI, reconstructs the daring, covert 100-hour Indian military mission that eliminated over 100 terrorists across nine cross-border camps with precision airstrikes, sending a powerful message of deterrence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/issue-of-trade-did-not-come-up-government-rejects-trumps-claim-on-india-pak-ceasefire-2724206-2025-05-13",
      "headline": "New Delhi rejects Trump's claim on India-Pak ceasefire, says trade never came upThe Ministry of External Affairs (MEA) clarified that the Indian and US leadership were in touch during the tense standoff with Pakistan, but there was no conversation on trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/bjp-minister-vijay-shahs-pakistan-swipe-at-col-sofia-qureshi-backfires-what-he-said-2724176-2025-05-13",
      "headline": "BJP Minister's 'Pak' remark for Colonel Sofiya Qureshi backfires: What he saidThe MP tribal welfare minister's comments appeared to be an attempt to eulogise PM Modi over Operation Sindoor; the Congress has demanded his resignation\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-india-pakistan-crasefire-united-states-strategic-partnership-donald-trump-quad-grouping-2724105-2025-05-13",
      "headline": "Sindoor tests India's ties with Trump's QuadWhile India waged a war on Pakistan-sponsored terror through Operation Sindoor, her so-called Quad allies ghosted her in real time. US President Donald Trump's diplomacy visibly turned the Quad from a strategic alliance into a WhatsApp group chat, leaving messages unread. The Quad's silence is bizarre as Pakistan is nothing more than a frontline Chinese province, and the grouping was formed with an eye on China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/padmashri-awardee-scientist-subbanna-ayyappan-death-cauvery-river-police-swimming-mystery-investigation-2724316-2025-05-13",
      "headline": "Cop says Padma Shri scientist couldn't swim: Suicide, accident or foul play?Police say Padma Shri scientist Dr Subbanna Ayyappan could not swim, yet his body was recovered from the Cauvery River. With no injuries or CCTV, the case raises troubling questions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/man-from-bengaluru-held-for-viral-video-urging-bombing-of-pm-modis-house-2724170-2025-05-13",
      "headline": "Bengaluru man asks 'why no one's bombing PM Modi's house' in video, arrestedA Bengaluru-based man was arrested for posting a provocative video on social media calling for a bomb attack on Prime Minister Modi's residence. He was traced by police and sent to Parappana Agrahara jail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-to-remove-sanctions-against-syria-gives-chance-at-greatness-to-country-2724330-2025-05-13",
      "headline": "Trump to lift sanctions on Syria in 'chance at greatness' to countryUS.President Donald Trump on Tuesday announced plans to lift all sanctions on Syria, aiming to normalise relations and give the country's new government \"a chance at peace\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-sitaare-zameen-par-trailer-new-talent-inspiring-story-2724354-2025-05-13",
      "headline": "Sitaare Zameen Par trailer: Aamir Khan returns with an uplifting new storyAamir Khan's new film 'Sitaare Zameen Par' trailer has been released, showcasing a heartwarming story. The film promotes inclusivity and introduces fresh talent, creating high expectations among audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-high-commission-official-declared-persona-non-grata-by-india-2724299-2025-05-13",
      "headline": "India expels Pak High Commission staffer over activities outside official roleThe move came amid heightened tensions between New Delhi and Islamabad following Operation Sindoor targeting terror camps in Pakistan and Pakistan-Occupied-Kashmir after the April 22 Pahalgam terror attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/bjp-leader-dilip-ghosh-wife-rinku-majumder-son-pritam-found-dead-kolkata-west-bengal-2724174-2025-05-13",
      "headline": "Son of BJP leader Dilip Ghosh's wife from her first marriage found deadPritam Majumdar, the 26-year-old son of BJP leader Dilip Ghosh's wife from a previous marriage, was found dead in Kolkata on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/kashish-chaudhary-balochistan-first-hindu-woman-assistant-commissioner-2724301-2025-05-13",
      "headline": "Meet Kashish Chaudhary, Balochistan's first Hindu woman Assistant CommissionerKashish Chaudhary, accompanied by her father Girdhari Lal, met Balochistan Chief Minister Sarfaraz Bugti in Quetta and told him that she would work for the empowerment of women and minorities, and the overall development of the province."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/cbse-results-2025-over-24k-score-over-95-nearly-2-lakh-over-90-surge-in-toppers-2724153-2025-05-13",
      "headline": "Over 24k get over 95%, nearly 2 lakh over 90%: CBSE marks losing their meaning?Over 24,000 Class 12 students scored above 95% in the CBSE results 2025, while over 1.1 lakh students crossed the 90% mark. The numbers are even higher in CBSE Class 10 with nearly 2 lakh students scoring above 90%. But are these high marks truly meaningful, or are we just going through the motions?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/action-conventional-domain-nuclear-threat-during-india-pak-conflict-2724213-2025-05-13",
      "headline": "What nuclear, fighting was always conventional: India junks Trump's claimIndia firmly rejected US President Donald Trump's claim of averting a nuclear conflict with Pakistan, asserting that the military action between the neighbours remained strictly conventional. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-names-anita-anand-foreign-minister-what-to-know-about-her-indian-roots-glbs-2724379-2025-05-14",
      "headline": "Canada names Anita Anand foreign minister: What to know about her Indian rootsAnita Anand has been named Canada's new Foreign Minister in PM Mark Carney's Cabinet reshuffle. A former Defence and Transport Minister, Anand is known for her work on Ukraine aid and military reform. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/operation-sindoor-the-historic-100-hours-reconstructed-using-ai-watch-2724290-2025-05-13",
      "headline": "Operation Sindoor: The historic 100 hours reconstructed using AI. WatchDays after Operation Sindoor concluded, we at India Today, with the help of artificial intelligence (AI), and a team of graphics artists, military and strategic experts, have recreated the operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/kailash-mansarovar-pilgrimage-264-13-05-2025",
      "headline": "There's life before Kailash Mansarovar and there's life after. What's yours?As the unmissable pilgrimage to the Tibet region resumes this year, here's an experiential piece from a pilgrim setting out what this year's probable yatris will see and the consolation for those who have missed applying.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/uk-tightens-work-visa-citizenship-norms-5-top-points-indian-immmigrants-british-migration-policy-work-student-2724071-2025-05-13",
      "headline": "UK tightens work visa, citizenship norms. 5 top pointsBritish PM Keir Starmer attributed many of the UK's problems to immigration. This was followed by several stringent regulations on study, work and family visas. The policy change will impact Indians applying for work, stay and studies in the UK. Here are the top five points from the new regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-place-in-pakistan-where-terrorists-can-hide-ghar-mein-ghus-kar-maarenge-pms-address-at-adampur-airbase-2724117-2025-05-13",
      "headline": "Ghar mein ghus kar maarenge: PM says no place in Pak where terrorists can hideReiterating India's aggressive policy on cross-border terrorism, PM Modi said that \"the Armed Forces will enter the homes of terrorists and strike.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjp-leader-vijay-shash-remarks-colonel-sofiya-qureshi-congress-demands-dismissal-2724293-2025-05-13",
      "headline": "Congress slams BJP leader's 'vulgar, insulting' remarks on Col Sofiya QureshiBJP leader Vijay Shah allegedly made objectionable comments about Colonel Sofiya Qureshi, who was among the officials representing the armed forces during the briefing on Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-to-postpone-her-cannes-debut-amid-india-pak-tension-2724260-2025-05-13",
      "headline": "Alia Bhatt to postpone her Cannes debut amid India-Pak tensionActor Alia Bhatt is set to postpone her Cannes debut this year due to tensions between India and Pakistan. The actor was set to attend the festival on its opening day, May 13.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-to-tailor-skincare-to-your-needs-2724122-2025-05-13",
      "headline": "How to tailor skincare to your needsFrom K-beauty to old-school solutions, the best skincare isn't about what's trending but what keeps your skin healthy and happy\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-saudi-arabia-142-billion-defence-deal-white-house-donald-trump-riyadh-2724277-2025-05-13",
      "headline": "Saudi Arabia to invest $600 billion in US, signs $142 billion arms dealTrump punched the air as he emerged from Air Force One to be greeted by Prince Mohammed bin Salman, who later signed an agreement with the US President which Saudi state television said covered energy, defence, mining and other areas."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-indian-student-cons-elders-50k-elder-using-child-porn-bluff-arrested-trend-indians-duping-senior-citizens-2724211-2025-05-13",
      "headline": "Indian student arrested in US, conned elderly couple of $50K with child-porn ruseAn Indian student in the US who scammed a Michigan couple of $50,000 by claiming their credit card was used to purchase child pornography, was arrested. The police suspect the money has been routed to India.\r\nThis is the fourth such arrest in three weeks, as Indian students have been arrested for targeting elderly Americans in fraud schemes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/cassie-testifies-against-diddy-freak-offs-became-a-job-in-sex-trafficking-trial-glbs-2724382-2025-05-14",
      "headline": "Cassie testifies against Diddy: \"Freak offs became a job\" in sex trafficking trialCassie delivered harrowing testimony in Diddy's sex trafficking trial, alleging years of abuse, coercion, and control. The court viewed damning video evidence as the trial against the music mogul intensifies.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-sitaare-zameen-par-trailer-new-talent-inspiring-story-2724354-2025-05-13",
      "headline": "Sitaare Zameen Par trailer: Aamir Khan returns with an uplifting new storyAamir Khan's new film 'Sitaare Zameen Par' trailer has been released, showcasing a heartwarming story. The film promotes inclusivity and introduces fresh talent, creating high expectations among audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hina-khan-recreates-iconic-goblin-scene-with-rocky-jaiswal-during-south-korea-trip-2724292-2025-05-13",
      "headline": "Hina Khan recreates iconic Goblin scene with Rocky Jaiswal during South Korea tripTelevision star Hina Khan is currently exploring South Korea, recreating iconic K-drama scenes with Rocky Jaiswal at the locations where they were filmed.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/payal-kapadia-returns-to-cannes-film-festival-as-jury-member-2724274-2025-05-13",
      "headline": "Filmmaker Payal Kapadia returns to Cannes Film Festival as jury memberFilmmaker Payal Kapadia returned to the Cannes Film Festival this year as a jury member. She made an appearance for a photocall at the opening ceremony of the festival as part of the prestigious gala's jury panel."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-emotional-fan-confrontation-mumbai-airport-test-retirement-2724362-2025-05-13",
      "headline": "Why did you retire? Watch heartbroken fan confront Virat Kohli at airportVirat Kohli was confronted by a fan at Mumbai airport a day after announcing his retirement from Test cricket. Kohli announced his retirement from Test cricket, drawing the curtains on a stellar red-ball career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-14-year-old-son-debuts-for-portugal-u15-vs-japan-2724355-2025-05-13",
      "headline": "Cristiano Ronaldo delighted as 14-year-old son debuts for Portugal U15 vs JapanCristiano Ronaldo was beaming with pride as his 14-year-old son, Cristiano Ronaldo Jr., made his debut for Portugal's U15 national team in a friendly match against Japan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-test-captaincy-sanjay-manjrekar-reaction-2724325-2025-05-13",
      "headline": "Sanjay Manjrekar shocked by Test captaincy rumours, strongly backs BumrahFormer India cricketer Sanjay Manjrekar has expressed disbelief at reports suggesting Jasprit Bumrah was not the frontrunner to replace Rohit Sharma as India's next Test captain.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-retirement-rumours-india-tour-of-england-test-squad-selection-2724327-2025-05-13",
      "headline": "Mohammed Shami quashes retirement rumour ahead of England Test squad selectionIndia tour of England: Fast bowler Mohammed Shami has been struggling for rhythm in IPL 2025, managing just 6 wickets in nine matches for SunRisers Hyderabad. India's Test squad for the tour of England is set to be picked in the third week of May. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-joins-rafael-nadal-completes-masters-1000-quarterfinal-set-2724312-2025-05-13",
      "headline": "Carlos Alcaraz joins Nadal in elite list, completes Masters 1000 quarter setCarlos Alcaraz joined his idol Rafael Nadal on the elite list after earning a hard-fought win over Karen Khachanov to storm to the quarter-finals at the 2025 Italian Open. Alcaraz has now reached the quarter-finals at all nine Masters 1000 tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/preity-zinta-calls-out-sexist-troll-glenn-maxwell-ipl-2025-2724308-2025-05-13",
      "headline": "Preity Zinta slams troll over Glenn Maxwell marriage joke: Stop the gender biasPreity Zinta confronted a sexist troll who questioned Glenn Maxwell's performance in IPL 2025. She called for greater respect towards women and highlighted the persistent gender bias in sports and on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carlo-ancelotti-proud-of-unforgettable-years-at-real-madrid-2724304-2025-05-13",
      "headline": "Carlo Ancelotti proud of unforgettable years at Real MadridCarlo Ancelotti on Tuesday reflected with pride on his second spell at Real Madrid, calling it a remarkable four-year journey filled with unforgettable moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-resumption-bcci-overseas-player-availability-2724280-2025-05-13",
      "headline": "Pat Cummins likely to return as BCCI talks to boards on player availabilityIPL 2025: Pat Cummins and Travis Head are expected to return to SunRisers Hyderabad for the remainder of the season, resuming May 17. The BCCI has been in touch with foreign boards over availability of players. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-coach-shukri-conrad-reaction-on-ipl-2025-extension-2724268-2025-05-13",
      "headline": "South Africa coach reacts to IPL 2025 extension: Want our players back on May 26Despite the extended Indian Premier League (IPL) 2025 season and its resumption on May 17, South Africa head coach Shukri Conrad has made it clear that his players must report back in time to prepare for the World Test Championship (WTC) 2025 Final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-has-good-brain-moeen-ali-backs-gt-skipper-to-lead-indian-test-side-2724249-2025-05-13",
      "headline": "Shubman Gill has good brain: Moeen Ali backs GT skipper to lead Indian Test sideFormer England all-rounder Moeen Ali has backed Shubman Gill to captain India in the upcoming Test series in England beginning from June 20. Rohit Sharma's retirement has left India's Test captaincy spot vacant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chamari-athapaththu-fined-10-percent-match-fee-for-breaching-icc-code-of-conduct-2724220-2025-05-13",
      "headline": "Chamari Athapaththu fined 10 percent match fee for breaching ICC Code of ConductSri Lanka women's cricket team captain Chamari Athapaththu has been fined ten per cent of her match fee for breaching Level 1 of the ICC Code of Conduct during tri-series fixture against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carlo-ancelotti-proud-of-unforgettable-years-at-real-madrid-2724304-2025-05-13",
      "headline": "Carlo Ancelotti proud of unforgettable years at Real MadridCarlo Ancelotti on Tuesday reflected with pride on his second spell at Real Madrid, calling it a remarkable four-year journey filled with unforgettable moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-resumption-bcci-overseas-player-availability-2724280-2025-05-13",
      "headline": "Pat Cummins likely to return as BCCI talks to boards on player availabilityIPL 2025: Pat Cummins and Travis Head are expected to return to SunRisers Hyderabad for the remainder of the season, resuming May 17. The BCCI has been in touch with foreign boards over availability of players. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-coach-shukri-conrad-reaction-on-ipl-2025-extension-2724268-2025-05-13",
      "headline": "South Africa coach reacts to IPL 2025 extension: Want our players back on May 26Despite the extended Indian Premier League (IPL) 2025 season and its resumption on May 17, South Africa head coach Shukri Conrad has made it clear that his players must report back in time to prepare for the World Test Championship (WTC) 2025 Final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-has-good-brain-moeen-ali-backs-gt-skipper-to-lead-indian-test-side-2724249-2025-05-13",
      "headline": "Shubman Gill has good brain: Moeen Ali backs GT skipper to lead Indian Test sideFormer England all-rounder Moeen Ali has backed Shubman Gill to captain India in the upcoming Test series in England beginning from June 20. Rohit Sharma's retirement has left India's Test captaincy spot vacant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chamari-athapaththu-fined-10-percent-match-fee-for-breaching-icc-code-of-conduct-2724220-2025-05-13",
      "headline": "Chamari Athapaththu fined 10 percent match fee for breaching ICC Code of ConductSri Lanka women's cricket team captain Chamari Athapaththu has been fined ten per cent of her match fee for breaching Level 1 of the ICC Code of Conduct during tri-series fixture against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-confirm-vinicius-jr-lucas-vazquez-out-with-injuries-2724216-2025-05-13",
      "headline": "Real Madrid confirm Vinicius Jr, Lucas Vazquez out with injuriesReal Madrid have confirmed that forward Vinicius Junior and defender Lucas Vázquez are injury doubts about the final stretch of the LaLiga season after both players were forced off during Sunday's 4-3 Clasico defeat to Barcelona."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-absence-will-give-a-massive-boost-to-england-moeen-ali-2724210-2025-05-13",
      "headline": "Rohit Sharma, Virat Kohli's absence will give a massive boost to England: Moeen AliFormer all-rounder Moeen Ali believes the absence of Rohit Sharma and Virat Kohli eases the pressure on England's bowlers and gives the hosts a clear psychological edge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/will-jacks-returns-in-england-squads-for-white-ball-series-vs-west-indies-2724191-2025-05-13",
      "headline": "Will Jacks returns in England squad for white-ball series vs West IndiesEngland all-rounder Will Jacks marked his return to the national side after November 2024 as they announced their squad for the white-ball series against West Indies beginning from June 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mark-boucher-recalls-how-he-motivated-virat-kohli-to-be-next-sachin-tendulkar-2724157-2025-05-13",
      "headline": "Mark Boucher recalls how he motivated Virat Kohli to be next Sachin TendulkarLegendary South Africa wicketkeeper Mark Boucher recently revealed how he motivated star India batter Virat Kohli quite early in his career to be the next Sachin Tendulkar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-r-ashwin-reaction-2724137-2025-05-13",
      "headline": "Virat Kohli had one or two more years of Test cricket left in him: R AshwinFormer India spinner R Ashwin said he couldn't shake the feeling that Virat Kohli still had one or two more years of red-ball cricket left in him. Kohli retired from Test cricket on Monday, drawing the curtain on a stellar red-ball career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mike-hesson-appointed-pakistans-white-ball-head-coach-2724118-2025-05-13",
      "headline": "Mike Hesson appointed Pakistan's white-ball head coachNew Zealand's Mike Hesson has been appointed Pakistan's new white-ball head coach. He brings global experience and stability to a role frequently changed by PCB amid recent turbulence in team management and performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/from-dhonis-bystanders-to-virats-warriors-how-indias-greatest-revived-test-fortunes-2723592-2025-05-13",
      "headline": "From Dhoni's bystanders to Virat's warriors: How India's greatest revived Test fortunesAs the sun sets on Kohli's Test empire, we look back on how his resolve to make India the most formidable Test team in the world turned their fortunes in whites and brought a cultural shift for the generations to follow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-rohit-sharma-virat-kohli-test-retirement-gautam-gambhir-era-england-vs-india-2724124-2025-05-13",
      "headline": "Start of Gambhir era: R Ashwin on Tests post Rohit, Kohli retirementsWith Rohit Sharma and Virat Kohli retiring from Tests, R Ashwin believes Indian cricket is now firmly entering the Gautam Gambhir era, as the team prepares for a tough five-match series in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-r-ashwin-reaction-2724137-2025-05-13",
      "headline": "Virat Kohli had one or two more years of Test cricket left in him: R AshwinFormer India spinner R Ashwin said he couldn't shake the feeling that Virat Kohli still had one or two more years of red-ball cricket left in him. Kohli retired from Test cricket on Monday, drawing the curtain on a stellar red-ball career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mike-hesson-appointed-pakistans-white-ball-head-coach-2724118-2025-05-13",
      "headline": "Mike Hesson appointed Pakistan's white-ball head coachNew Zealand's Mike Hesson has been appointed Pakistan's new white-ball head coach. He brings global experience and stability to a role frequently changed by PCB amid recent turbulence in team management and performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/from-dhonis-bystanders-to-virats-warriors-how-indias-greatest-revived-test-fortunes-2723592-2025-05-13",
      "headline": "From Dhoni's bystanders to Virat's warriors: How India's greatest revived Test fortunesAs the sun sets on Kohli's Test empire, we look back on how his resolve to make India the most formidable Test team in the world turned their fortunes in whites and brought a cultural shift for the generations to follow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-rohit-sharma-virat-kohli-test-retirement-gautam-gambhir-era-england-vs-india-2724124-2025-05-13",
      "headline": "Start of Gambhir era: R Ashwin on Tests post Rohit, Kohli retirementsWith Rohit Sharma and Virat Kohli retiring from Tests, R Ashwin believes Indian cricket is now firmly entering the Gautam Gambhir era, as the team prepares for a tough five-match series in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-australia-wtc-final-squad-temba-bavuma-video-2724114-2025-05-13",
      "headline": "Watch: Temba Bavuma unveils South Africa's WTC 2025 Final squad in fiery videoWorld Test Championship final: South Africa announced their 15-man squad for the summit clash against Australia in London. Fast bowler Lungi Ngidi returned to the Test set-up for the first time since October 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-rises-to-2nd-spot-in-odi-batting-rankings-2724089-2025-05-13",
      "headline": "Smriti Mandhana rises to 2nd spot in ODI batting rankings after prolific tri seriesStar India batter Smriti Mandhana climbed to second spot in the ICC women's ODI batting rankings following her prolific run in the India's recent tri-nation series triumph in Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-andy-murry-coach-split-french-open-2025-2724086-2025-05-13",
      "headline": "Novak Djokovic ends partnership with coach Andy Murray after poor start to seasonNovak Djokovic ended his partnership with coach Andy Murray after enduring a horror run on clay. Djokovic has not won a match on one of his favourite surfaces in the lead-up to this year's French Open. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-tribute-fans-rcb-vs-kkr-ipl-2025-viral-2724075-2025-05-13",
      "headline": "RCB fans call on crowd to wear Test whites for Virat Kohli tribute vs KKRRCB fans plan to wear whites in emotional tribute to Virat Kohli's iconic Test career during the team's first match after IPL 2025's restart against KKR at the Chinnaswamy Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-and-rohit-sharma-deserved-proper-send-off-bcci-must-look-into-it-anil-kumble-2724058-2025-05-13",
      "headline": "Both Kohli and Rohit deserved proper send-off, BCCI must look into it: Anil KumbleLegendary India spinner Anil Kumble feels that Virat Kohli and Rohit Sharma deserved proper farewells and the authorities must look into it. Rohit and Kohli announced their retirement from Tests within a space of six days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-has-set-an-example-often-senior-players-are-removed-childhood-coach-2723978-2025-05-13",
      "headline": "Virat Kohli has set an example, often senior players are removed: Childhood coachStar India batter Virat Kohli's childhood coach Rajkumar Sharma has said that he has set an example by announcing his retirement as often senior players are forced to leave the team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-fitness-culture-cheteshwar-pujara-2723977-2025-05-13",
      "headline": "Virat Kohli brought the fitness culture to India Test team: Cheteshwar PujaraIndia batter Cheteshwar Pujara recalled how Virat Kohli revolutionised the team's Test cricket culture by prioritising fitness, intensity, and a results-driven mindset — setting new standards that reshaped the way India approached the red-ball format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-anushka-sharma-arrive-virndavan-test-rertirement-watch-video-2723960-2025-05-13",
      "headline": "Virat Kohli arrives in Vrindavan with wife Anushka day after Test retirementVirat Kohli and his wife Anushka visited Vrindavan's Premanand Maharaj a day after his sudden Test retirement. The popular couple have made multiple visits to spiritual centres in recent years, often in times of transition as this one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-set-to-clash-with-international-calendar-after-resumption-2723952-2025-05-13",
      "headline": "IPL 2025 set to clash with international calendar after resumptionThe Indian Premier League 2025 (IPL 2025) is all set to clash with the international calendar as it re-starts on May 17 with a fixture between Royal Challengers Bengaluru (RCB) and Kolkata Knight Riders (KKR). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sairaj-pardeshi-weightlifting-gold-medal-khelo-india-youth-games-2723928-2025-05-13",
      "headline": "Sairaj breaks youth national records to win 81kg weightlifting goldSairaj Pardeshi stole the spotlight at the Khelo India Youth Games with three national records in weightlifting, while athletics saw multiple meet records shattered and Kerala surged up the medal tally with a kalarippayattu sweep."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-world-test-championship-final-squad-cameron-green-returns-2723915-2025-05-13",
      "headline": "Cameron Green returns as Australia name squad for WTC finalCameron Green's return headlines Australia's strong squad for the World Test Championship Final against South Africa, as Pat Cummins leads a balanced mix of experience and youth into the high-stakes clash at the Lord's Stadium in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-test-captain-sunil-gavaskar-workload-management-2723884-2025-05-13",
      "headline": "Make Jasprit Bumrah Test captain: Sunil Gavaskar rubbishes workload concernsSunil Gavaskar believes Jasprit Bumrah was the ideal choice to lead India's Test team, dismissing concerns around his workload and backing the pacer's ability to manage his fitness and responsibilities as captain."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}