{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-revival-primary-market-upcoming-public-listings-should-investors-put-money-leela-hotel-lg-ril-2729465-2025-05-23",
      "headline": "Fresh IPOs likely to flood Dalal Street: Time to ride the wave?Four IPOs are lined up to open in the last week of May. These include Scoda Tubes, Prostarm Info Systems, Leela Hotels (Schloss Bangalore Limited), and Aegis Vopak Terminals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-10-crore-for-child-education-edelweiss-ceo-and-md-radhika-gupta-maths-and-message-2729440-2025-05-23",
      "headline": "Rs 10 crore for child's education? Edelweiss' Radhika Gupta's maths and messageRadhika Gupta explained that the current cost of a full higher education in the US is around Rs 2.5 crore. Now, if you consider average inflation of 5% and currency depreciation of 4% every year, the value of that education will go up a lot over the next 16 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-769-points-higher-nifty-above-24800-eternal-ends-with-3-percent-gain-fmcg-it-banking-2729441-2025-05-23",
      "headline": "Sensex, Nifty close higher over US-China trade hopes despite FII outflow fearsThe S&P BSE Sensex added 769.09 points to close at 81,721.08, while the NSE Nifty50 gained 243.45 points to end at 24,853.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-google-and-more-cut-over-61000-jobs-in-2025-here-is-why-2729361-2025-05-23",
      "headline": "Microsoft, Google and more cut over 61,000 jobs in 2025: Here's why?One of the biggest cuts came from Microsoft, which let go of 6,000 employees, its largest round of job losses since 2023. Nearly 2,000 of these were in Washington state alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-power-rpower-share-price-rise-18-percent-why-reason-should-you-buy-2729360-2025-05-23",
      "headline": "Reliance Power Ltd share price rises over 18%. Should you buy?Reliance Power has gained 20.77% in the last month, 51.98% over the last six months, and 99.13% over the past year. Over the last five years, it has gone up by a massive 2,820.56%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-plans-to-let-us-other-foreign-firms-bid-for-government-contracts-report-2729355-2025-05-23",
      "headline": "India plans to let US, other foreign firms bid for government contracts: ReportContracts worth over $50 billion, primarily issued by federal agencies, could soon be accessible to US companies as part of a broader effort to strike a limited trade agreement with Washington by early July."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bajaj-auto-acquisition-to-take-over-ktm-800-million-euro-deal-financial-trouble-2729351-2025-05-23",
      "headline": "Bajaj Auto to take over KTM with massive €800 million dealThe move is aimed at helping KTM recover from financial trouble and marks a major step forward for Bajaj, which has been a minority investor in KTM since 2007."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/data-can-be-misleading-zerodha-founder-and-ceo-nithin-kamath-on-rise-of-tier-2-and-3-city-investors-2729307-2025-05-23",
      "headline": "'Data can be misleading': Nithin Kamath on rise of Tier 2 and 3 city investorsZerodha's Nithin Kamath explained that if you look at the addresses provided by users during their KYC process, it appears many traders are from Tier 2 and Tier 3 towns. However, this can be misleading because most people don't update their address when they move to a new city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-share-price-rises-rising-today-today-check-brokerage-views-should-you-buy-sell-hold-2729293-2025-05-23",
      "headline": "ITC share price rises 3% today. Check brokerage views and what should investors do?The stock was trading 2.78% higher at Rs 437.95, recovering from Thursday's close of Rs 426.10, as investors appeared to focus on the company's long-term fundamentals rather than short-term headwinds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/some-individuals-do-not-need-to-file-an-itr-are-you-one-of-them-2729270-2025-05-23",
      "headline": "Some individuals don't need to file an ITR. Are you one of them?As the 2025–26 financial year begins, the Income Tax Department has released all the seven ITR forms along with the ITR-U form.  But did you know not everyone is required to file a return?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-to-invest-rs-50000-crore-in-northeast-over-next-decade-says-gautam-adani-2729269-2025-05-23",
      "headline": "Adani Group to invest Rs 50,000 crore in Northeast over next decadeThe fresh investment commitment comes just months after the Adani Group pledged Rs 50,000 crore in Assam alone, targeting sectors like airports, aero cities, city gas distribution, transmission, cement, and road infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-loan-bailout-package-pakistan-usd-1-billion-why-reason-india-objection-terror-11-conditions-2729243-2025-05-23",
      "headline": "Explained: Why IMF gave Pakistan $1 billion despite India's objectionsThe IMF agreed to support Pakistan with a total of $7 billion under the EFF programme. So far, it has given $2.1 billion in two separate instalments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bse-shares-appear-65-percent-lower-trading-apps-has-multibagger-stock-crashed-2729212-2025-05-23",
      "headline": "Have BSE shares really crashed? Here's why some apps show a 66% fallThe apparent crash was just a technical adjustment following the company's 2:1 bonus issue, which turned the stock ex-bonus today. Some trading platforms may not have accounted for this corporate action in their price charts, leading to misleading visuals of a steep 65% drop. In reality, the share price simply adjusted to reflect the bonus allotment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rising-today-key-reasons-behind-sensex-nifty-rebound-explained-2729199-2025-05-23",
      "headline": "Sensex jumps 900 points: Why stock market is rising today and what next?Market watchers suggest the current bounce is likely driven by a 'buy-on-dips' strategy that many investors have adopted amid recent volatility. Despite concerns about the global macro environment, the strength in domestic fundamentals seems to be offering support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/honasa-consumer-share-price-rise-13-percent-revenue-rise-decline-in-q4-net-profit-reason-why-2729197-2025-05-23",
      "headline": "Honasa shares rise 13% despite decline in Q4 net profitThe company's revenue from operations went up by 13% year-on-year (YoY), reaching Rs 534 crore in Q4FY25. However, despite the rise in revenue, Honasa's consolidated net profit fell by 18% YoY."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-sensex-opens-flat-nifty-below-24700-sun-pharma-falls-5-2729185-2025-05-23",
      "headline": "Sensex, Nifty move up in early session despite concerns over FII flowsThe S&P BSE Sensex went up by 289.27 points to 81,241.26, while the NSE Nifty50 added 119.15 points to 24,728.85 as of 9:29 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-allotment-how-to-check-status-listing-date-expectation-gmp-online-guide-2729182-2025-05-23",
      "headline": "Borana Weaves IPO allotment: Step-by-step guide to check statusBorana Weaves IPO opened for subscription on May 20 and closed on May 22. The IPO saw strong demand from all investor groups. It was subscribed 147.85 times in total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-change-tax-slab-revamp-talks-begin-government-officials-report-2729163-2025-05-23",
      "headline": "GST rates may change soon as fresh revamp talks begin: ReportGST, which was launched in July 2017, brought together many indirect taxes into one system and created a single national market. The latest round of talks follows the government's introduction of a bill in February this year to simplify income tax laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-may-23-trading-setup-sensex-nifty-nse-bse-2729159-2025-05-23",
      "headline": "Sensex, Nifty opening: Stock market likely to open higher today. Here's whyStock market opening: The Nifty50 index may open slightly above its previous close. Gift Nifty futures were trading at 24,692.5 at 7:59 am, showing a possible rise from Thursday's close of 24,609.7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-23-trading-tips-nse-bse-itc-ola-honasa-sun-pharma-jsw-steel-2729154-2025-05-23",
      "headline": "Stocks to watch on May 23: ITC, Ola, Honasa, Sun Pharma, JSW SteelA number of companies will release their January-March quarter results today. These include JSW Steel, Ashok Leyland, Glenmark Pharmaceuticals, Afcons Infrastructure, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-645-points-lower-nifty-below-24700-indusind-bank-gains-2-percent-it-auto-stocks-2728770-2025-05-22",
      "headline": "Sensex closes 645 points lower, Nifty below 24,700; IndusInd Bank gains 2%The S&P BSE Sensex lost 644.64 points to end at 80,951.99, while the NSE Nifty50 was down by 203.75 points to close at 24,609.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-day-3-subscription-bidding-over-100-times-check-latest-gmp-listing-date-2728751-2025-05-22",
      "headline": "Borana Weaves IPO booked over 100 times: Check latest subscription, GMPAllotment for the Borana Weaves IPO is expected to be finalised on Friday, May 23, 2025. The company is likely to list its shares on the stock exchanges on Tuesday, May 27, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-to-start-solar-module-factory-this-year-report-2728719-2025-05-22",
      "headline": "Reliance to start solar module factory this year: ReportThis year, Reliance Industries will launch its solar module factory, aiming to meet India's clean energy goals by producing 20 GW annually. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/most-happiest-and-unhappiest-careers-of-the-world-revealed-is-your-job-among-them-2728702-2025-05-22",
      "headline": "World's happiest and unhappiest careers revealed. Is your job among them?Researchers at the University of Tartu in Estonia looked at 263 different jobs and asked over 59,000 people about their work and life satisfaction. They also used health data from the Estonian Biobank to get a better picture of what really makes people happy in their jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-down-rising-covid-cases-pause-dalal-street-bull-run-sensex-nifty-outlook-investor-expert-insight-2728677-2025-05-22",
      "headline": "Covid cases surge in India: Will it trigger a stock market crash?Stock market today: The S&P BSE Sensex had dropped by over 900 points to 80,681.76, while the NSE Nifty50 was down 266 points at 24,547.45 as of 12:45 pm. The fall in the market comes after days of strong performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/walmart-to-cut-1500-jobs-in-restructuring-move-report-employee-layoff-2728662-2025-05-22",
      "headline": "Walmart to cut 1,500 jobs in restructuring move: ReportThe job cuts will affect several areas, including Walmart's global tech team, the e-commerce section in US stores, and its advertising arm, Walmart Connect. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-adds-1458-lakh-members-in-march-women-and-youth-lead-the-way-2728646-2025-05-22",
      "headline": "EPFO adds 14.58 lakh members in March. Women and youth lead the wayMost of the new members who joined EPFO for the first time in March were youngsters. Around 4.45 lakh people in the 18–25 age group signed up in March, making up nearly 59% of all new subscribers. Many in this age group are first-time jobseekers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-teleservices-shares-jumps-11-percent-today-whats-driving-the-rally-2728642-2025-05-22",
      "headline": "Tata Teleservices shares jumps 11% today. What's driving the rally?The trigger behind the rally appears to be growing speculation around a potential capital infusion by Tata Sons Ltd into its struggling telecom subsidiary, Tata Teleservices Ltd (TTSL). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/abfrl-demerger-brokerages-assign-fair-value-to-new-fashion-twins-details-here-2728621-2025-05-22",
      "headline": "ABFRL demerger: Brokerages assign fair value to new fashion twins. Details hereBrokerages have begun breaking down the newly split entities, laying out distinct growth paths and fair value estimates for both ABFRL and ABLBL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/all-itr-forms-are-out-but-you-still-cannot-file-what-causing-the-delay-e-filing-utilities-portal-2728606-2025-05-22",
      "headline": "All ITR forms are out, but you still can't file. What's causing the delay?While all seven ITR forms (ITR-1 to ITR-7) and even the updated ITR-U form are ready, the filing process can't begin until the government activates the utility software. These utilities are essential tools that help taxpayers fill in, check, and submit their returns online or offline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/aditya-birla-fashion-and-retail-ltd-abfrl-business-demerger-stock-drop-66-percent-2728594-2025-05-22",
      "headline": "ABFRL stock drops 66% post demerger. What investors should know The sharp decline from Wednesday's close of Rs 268.95 reflects the market's adjustment for the value of the demerged entity, not a deterioration in Aditya Birla Fashion and Retail Ltd's fundamentals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vaibhav-taneja-salary-tesla-cfo-more-pay-than-sunder-pichai-google-satya-nadella-microsoft-2728585-2025-05-22",
      "headline": "Who is Vaibhav Taneja? Tesla CFO who made more than Pichai and NadellaWhile Sundar Pichai took home $10.73 million and Satya Nadella received $79.1 million in 2024, Taneja's total earnings far exceeded both. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/itc-q4-results-today-check-dividend-revenue-profit-expectations-2728571-2025-05-22",
      "headline": "ITC set to report Q4 results today: Earnings, dividend payout in focusSo far this financial year, the diversified FMCG and cigarette giant has already handed out an interim dividend of Rs 6.50 per share. Given its track record, investors are now eyeing another generous payout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-fresh-record-high-us-dollar-stability-risks-other-key-reasons-explained-2728564-2025-05-22",
      "headline": "Explained: Why bitcoin has hit a fresh all-time high The world's most valuable cryptocurrency has gained over 50% since April, propelled by improving global risk appetite and a flight to alternatives as doubts over the US dollar's stability grow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/government-notice-to-uber-over-advance-tipping-union-minister-calls-it-unethical-2728524-2025-05-22",
      "headline": "Government notice to Uber over advance tipping, Union Minister calls it 'unethical'The Consumer Protection Body has issued a notice to Uber regarding its practice of collecting advanced tips from users. Union Minister Prahlad Joshi has termed the practice 'deeply concerning', 'unethical and exploitative'. Uber has been given 15 days to respond to the notice. The government is widening its crackdown on practices violating consumer protection norms, with Rapido potentially facing a probe as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-300-acre-plant-devanahalli-building-dorms-women-workers-iphone-production-india-report-2728554-2025-05-22",
      "headline": "Foxconn building dorms at 300-acre iPhone campus in India: ReportThe dorms are part of the company's plan to support numerous workers at its plant, which is expected to play a major role in Apple's growing operations in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-nifty-tumbles-weak-global-cues-us-bonds-2728552-2025-05-22",
      "headline": "Sensex crashes 1,000 points: Why is stock market falling today?At around 12:51 pm, the BSE Sensex was down 966.37 points at 80,630.26, while the NSE Nifty50 slumped 269 points to 24,544.45. Market volatility spiked, dragging down broader indices and putting pressure on small- and mid-cap stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-share-price-falls-stock-in-focus-fradu-q4-loss-2728548-2025-05-22",
      "headline": "IndusInd Bank shares in focus after Q4 loss amid fraud. Buy, hold or sell?The private lender reported a net loss of Rs 2,236 crore for the fourth quarter, a sharp reversal from a profit of Rs 2,347 crore in the same period last year. This marks a pivotal moment for the bank, which has now admitted that certain employees may have engaged in fraudulent activity that impacted its financial reporting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-465-points-lower-nifty-below-24700-indusind-bank-down-3-percent-2728539-2025-05-22",
      "headline": "Sensex, Nifty tank as IT stocks bleed over US deficit fearsThe S&P BSE Sensex was down by 753.42 points to 80,843.21, while the NSE Nifty50 fell by 209.65 points to 209.65 as of 9:27 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-22-itc-indusind-bank-indigo-sun-pharma-rvnl-nse-bse-trading-2728506-2025-05-22",
      "headline": "Stocks to watch on May 22: ITC, IndusInd Bank, IndiGo, Sun Pharma, RVNLSeveral companies are set to announce their January–March quarter (Q4) earnings today, such as ITC, Sun Pharmaceutical Industries, Grasim Industries, Honasa Consumer, etc. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/taarak-mehta-ka-ooltah-chashmah-deepti-sadhwani-cannes-comeback-sitara-2729453-2025-05-23",
      "headline": "Deepti Sadhwani makes stylish Cannes comeback with film Sitara'Taarak Mehta Ka Ooltah Chashmah' fame Deepti Sadhwani attended the Cannes Film Festival in a black outfit. This is the second time that the actor has returned to the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/narivetta-tovino-thomas-powerful-film-systemic-oppression-muthanga-incident-2729438-2025-05-23",
      "headline": "Narivetta review: Tovino Thomas headlines powerful film on systemic oppressionReleased-Fri May 23, 2025Narivetta movie review: Director Anuraj Manohar's 'Narivetta' is based on the 2003 Muthanga incident that led to the loss of lives after a clash between police officers and the Adivasi community. The film's gripping narrative post-interval makes up for its sluggish first half. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-did-not-shoot-a-single-scene-before-exiting-hera-pheri-3-report-2729444-2025-05-23",
      "headline": "Paresh Rawal didn't shoot a single scene before exiting Hera Pheri 3: ReportA new development in the Paresh Rawal vs Hera Pheri 3 case suggested that the actor had not shot a single scene for the film, as opposed to the claims made by Akshay Kumar's team in their legal suit against the actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-veer-x-twitter-reviews-fans-say-sooraj-pancholi-suniel-shetyy-film-is-history-not-mythology-2729420-2025-05-23",
      "headline": "Kesari Veer X Reviews: Fans say Sooraj Pancholi's film is 'history,' not 'mythology'The audiences seem to have given a thumbs-up to Sooraj Pancholi-Suniel Shetty's 'Kesari Veer: Legends of Somnath.' Fans hailed the film for depicting a 'forgotten chapter of India's history.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/lilo-and-stitch-review-a-worthy-live-action-remake-with-delightful-performances-2729407-2025-05-23",
      "headline": "Lilo & Stitch review: A worthy live-action remake with delightful performancesReleased-Fri May 23, 2025Lilo and Stitch movie review: The live-action remake beautifully captures the essence of the beloved 2002 animated classic with heartfelt performances and emotional depth. This charming film celebrates the spirit of family and friendship against the stunning backdrop of Hawaii, making it a delightful watch for all ages, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-trisha-varsham-returns-to-theatres-fans-turn-screenings-into-a-fest-2729396-2025-05-23",
      "headline": "Prabhas-Trisha's Varsham returns to theatres, fans turn screenings into a festFans went wild as Prabhas and Trisha's 2004 blockbuster 'Varsham' re-released in theatres in 4K. Videos featuring the crowd celebrating screenings like a festival have taken over social media.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fans-praise-aishwarya-rai-gown-with-bhagwad-gita-verse-at-cannes-2729356-2025-05-23",
      "headline": "Queen is queen-ing!: Fans praise Aishwarya Rai in Gita-inspired gown at CannesFans worldwide erupted in admiration as Aishwarya Rai Bachchan graced Cannes 2025 in a striking Gaurav Gupta gown featuring a Bhagavad Gita verse. Social media buzzed with praise, hailing her as timeless, iconic, and spiritually powerful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/adarsh-gourav-says-tu-yaa-main-march-video-was-just-an-announcement-not-a-teaser-2729334-2025-05-23",
      "headline": "Adarsh Gourav says Tu Yaa Main March video was just an announcement, not a teaserAdarsh Gourav revealed that the March teaser for 'Tu Yaa Main' was merely an announcement video, with actual filming set to begin in June. The film, co-starring Shanaya Kapoor, is slated for a Valentine's Day 2026 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/singer-keneeshaa-says-wont-run-faces-death-threats-amid-ravi-aarti-divorce-2729316-2025-05-23",
      "headline": "Singer Keneeshaa says 'won't run', faces death threats amid Ravi-Aarti's divorceSinger Keneeshaa Francis responded to the online death threats amid actor Ravi Mohan-Aarti's divorce battle. In a clear message to trolls, Keneeshaa wrote she 'won't run' or 'turn off comments.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyadarshan-says-akshay-was-heartbroken-over-pareshs-hera-pheri-3-exit-had-tears-2729374-2025-05-23",
      "headline": "Priyadarshan says Akshay was heartbroken over Paresh's Hera Pheri 3 exit: Had tears  'Hera Pheri 3' director Priyadarshan talked about the state of Akshay Kumar's mental health when he heard about Paresh Rawal's abrupt exit from the film. The filmmaker shared that the actor never suggested he cut Rawal or anyone else's role from the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/homebound-actor-vishal-jethwa-feels-like-a-misfit-in-new-world-of-bollywood-2729369-2025-05-23",
      "headline": "Homebound actor Vishal Jethwa feels like a 'misfit' in 'new world' of BollywoodActor Vishal Jethwa opened up about feeling like a misfit in the industry. He will next be seen in Neeraj Ghaywan's 'Homebound'. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/helen-flaunts-her-fitness-game-at-85-2729368-2025-05-23",
      "headline": "Pilate to trampoline jumps: Helen flaunts her fitness game at 85Helen's recent video of working out in the gym has caught the attention of all. From Pilate to trampoline jumps, her workout regime is sure to motivate fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mumbai-police-tighten-security-salman-khan-galaxy-apartments-trespassing-2729347-2025-05-23",
      "headline": "Mumbai Police tightens security at Salman Khan's Galaxy after trespassing casesMumbai police is set to enhance security protocols at Salman Khan's Galaxy Apartments following recent trespassing incidents. The new measures aim to protect the actor while maintaining privacy for other residents."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/kerala-high-court-refuses-to-quash-cheating-case-against-malayalam-film-manjummel-boys-producers-2729354-2025-05-23",
      "headline": "Kerala High Court refuses to quash cheating case against Manjummel Boys producersThe Kerala High Court has declined to quash criminal proceedings in a cheating case involving the producers of 'Manjummel Boys'. The ruling has now cleared the way for continued police investigation into the profit dispute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-kantara-chapter-1-makers-clarify-delay-rumours-2729346-2025-05-23",
      "headline": "Rishab Shetty's Kantara Chapter 1 makers clarify delay rumoursThe makers of Rishab Shetty's 'Kantara: Chapter One' clarified rumours of a possible delay in the film's release. They shared an official statement on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-traitors-karan-johar-brings-glitz-drama-betrayal-to-new-reality-show-2729335-2025-05-23",
      "headline": "The Traitors: Karan Johar brings glitz, drama and betrayal to new reality showKaran Johar is set to bring glitz and drama with his new reality show, 'The Traitors'. The show will premiere on Prime Video on June 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/materialists-trailer-dakota-johnson-chris-evans-pedro-pascal-in-swooning-romance-with-the-prettiest-faces-in-business-2729314-2025-05-23",
      "headline": "Materialists trailer: A swooning romance with the prettiest faces in businessThe trailer of 'Materialists' establishes that it is a treat for the lovers of Hollywood rom-coms. The film features the most stunning faces in the industry - Dakota Johnson, Chris Evans, and Pedro Pascal - in a love triangle, making it all look more swoon-worthy than you had imagined. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-kid-cudi-testifies-against-sean-diddy-combs-alleges-break-in-and-arson-2729297-2025-05-23",
      "headline": "Rapper Kid Cudi testifies against Sean Diddy Combs, alleges break-in and arsonOn Day 9 of Sean Diddy's trial, rapper Kid Cudi took the stand and testified against him. Heb recalled instances where he alleged that the music mogul broke into his home and set his Porsche on fire. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-wishes-he-had-cut-unwanted-stuff-from-lindia-got-latent-2729275-2025-05-23",
      "headline": "Samay Raina wishes he had cut 'unwanted stuff' from life, shares update on LatentComedian Samay Raina reflected on the controversy surrounding his show 'India's Got Latent', expressing regret over not editing out sensitive content. While Raina hinted the show might return, he emphasised that it would take some time."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/national-herald-case-congress-leaders-donated-lakhs-to-rahul-gandhi-sonia-gandhi-young-indian-ed-enforcement-2729332-2025-05-23",
      "headline": "Congress leaders donated in lakhs to Rahul, Sonia Gandhi-led company on request: EDThe ED has alleged in its chargesheet that senior Congress leaders, acting on instructions from top party leaders, donated crores to the company involved in the National Herald case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-to-raise-issue-of-world-bank-funding-to-pak-ahead-of-likely-20-billion-aid-approval-sources-2729372-2025-05-23",
      "headline": "India to strike Pak economy, approach World Bank and terror financing bodySources said India will ask the World Bank to reconsider its expected approval of a USD 20 billion package to Pakistan in June.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-news-pahalgam-attack-ceasefire-indus-water-treaty-water-flow-dam-flushing-satellite-photo-2729373-2025-05-23",
      "headline": "One month since Indus Waters Treaty suspension: What satellite images revealSince India suspended the Indus Waters Treaty after the April 22 Pahalgam terror attack, satellite and flow data show India has intensified dam flushing operations, causing fluctuating water flows into Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/how-climate-change-is-fuelling-clean-air-turbulence-mid-flight-2729460-2025-05-23",
      "headline": "How climate change is fuelling clean air turbulence mid-flightWhile turbulence caused by storms is familiar, the aviation industry is increasingly troubled by a more insidious danger: clear-air turbulence (CAT). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/india-paklistan-war-1965-field-marshall-km-cariappa-snubbed-pak-dictator-ayub-khan-field-marshal-offer-2729382-2025-05-23",
      "headline": "Not my son, he's prisoner of war: When Gen Cariappa snubbed Pak dictator's offerDuring the 1965 India-Pakistan War, Flight Lieutenant KC Cariappa's plane was shot down, and he was held captive by the Pakistani army. His father, General KM Cariappa (later a Field Marshal), turned down an offer from Pakistan's military dictator Field Marshal Ayub Khan, who served under him earlier, to release his son. This story from 70 years ago also highlights the contrast between the two Field Marshals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-frees-man-convicted-of-sex-with-minor-using-special-powers-article-142-2729322-2025-05-23",
      "headline": "She didn't see it as crime: Supreme Court frees man convicted of sex with minorIn its verdict, the Supreme Court said the victim, now the accused's wife, did not view the act as a crime and suffered more due to the legal fallout of the incident itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-announces-breakthrough-prisoners-swap-russia-ukraine-war-2729458-2025-05-23",
      "headline": "Trump says Russia-Ukraine prisoners swap completed, hints at 'something big'Russia and Ukraine have completed a major prisoner swap, as announced by US President Donald Trump. The exchange follows recent direct talks between the two countries in Istanbul.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/woman-who-trespassed-into-salman-khans-house-in-mumbais-galaxy-apartments-sent-to-14-day-judicial-custody-2729446-2025-05-23",
      "headline": "Woman who trespassed into Salman Khan's house sent to 14-day judicial custodyA woman claiming Salman Khan invited her was remanded to 14-day custody after attempting to trespass into his Galaxy Apartments in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-did-not-shoot-a-single-scene-before-exiting-hera-pheri-3-report-2729444-2025-05-23",
      "headline": "Paresh Rawal didn't shoot a single scene before exiting Hera Pheri 3: ReportA new development in the Paresh Rawal vs Hera Pheri 3 case suggested that the actor had not shot a single scene for the film, as opposed to the claims made by Akshay Kumar's team in their legal suit against the actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-pakistan-pak-army-spokesperson-lieutenant-general-ahmed-sharif-chaudhry-speech-if-you-stop-water-hafiz-saeed-2729191-2025-05-23",
      "headline": "We will choke you..: Pak Army official threatens India in Hafiz Saeed's wordsA Pakistani military spokesperson's threatening remarks towards India, echoing Lashkar-e-Taiba chief Hafiz Saeed's inflammatory language about water, highlighted the alarming overlap between the Pakistan Army's rhetoric and the country's terror networks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-boy-suicide-note-after-being-scolded-publicly-maa-i-didnt-steal-chips-2729378-2025-05-23",
      "headline": "Maa, I didn't steal chips: Bengal boy's suicide note after being scolded publiclyIn West Bengal's Paschim Medinipur, a Class 7 student allegedly died by suicide after consuming pesticide. He was accused of stealing a packet of chips from a shop when its owner was not around."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/harvard-university-indian-foreign-students-enrollment-future-trump-conditions-2729193-2025-05-23",
      "headline": "Harvard's Indian, foreign students can stay if they meet 6 conditions in 3 daysIn 72 hours, Harvard University has been asked by the Trump administration to comply with six strict conditions to enroll foreign students again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/from-packed-tiffins-to-roadside-dhaba-stops-indias-timeless-family-drive-2729403-2025-05-23",
      "headline": "One car, endless memories: The classic Indian family road tripRoad trips have a timeless charm beyond just getting from one place to another. They're about the winding roads, unexpected tea stalls, playlists that become memories, and the quiet joy of watching the landscape change through the window."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/srinagar-indigo-flight-turbulence-pakistan-airspace-lahore-thunderstorm-inside-details-2729315-2025-05-23",
      "headline": "Refused by Lahore, IndiGo pilots decided to fly through storm: What went downThe New Delhi-Srinagar flight, carrying more than 220 people, including TMC MPs, landed safely at 6.30 pm on May 21, with the nose (radome) of the aircraft severely damaged."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/lucknow-woman-jumps-out-of-moving-e-rickshaw-to-escape-harassment-up-police-arrest-accused-2729419-2025-05-23",
      "headline": "Video: UP woman assaulted by men in e-rickshaw, jumps out to save herselfA nursing student jumped from a moving e-rickshaw in Lucknow while trying to escape assault by the driver and his three accomplices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/haveri-gangrape-accused-karnataka-bail-roadshow-celebrations-outrage-2729306-2025-05-23",
      "headline": "Roadshow and open arms: Karnataka gang rape accused get heroes' welcome after bailSeven accused of a gangrape reported in January 2024 from Haveri, Karnataka, were recently granted bail by a local court. They were felicitated with a celebratory roadshow, sparking public outrage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fans-praise-aishwarya-rai-gown-with-bhagwad-gita-verse-at-cannes-2729356-2025-05-23",
      "headline": "Queen is queen-ing!: Fans praise Aishwarya Rai in Gita-inspired gown at CannesFans worldwide erupted in admiration as Aishwarya Rai Bachchan graced Cannes 2025 in a striking Gaurav Gupta gown featuring a Bhagavad Gita verse. Social media buzzed with praise, hailing her as timeless, iconic, and spiritually powerful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/if-this-language-nonsense-continues-says-founder-moving-firm-to-pune-from-bengaluru-over-kannada-language-row-2729418-2025-05-23",
      "headline": "'Language nonsense…,' says entrepreneur about moving firm from Bengaluru to PuneCiting a viral video of a State Bank of India manager refusing to speak Kannada, an entrepreneur has decided to move operations from Bengaluru to Pune, highlighting growing concerns around language tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/nine-month-old-baby-covid-positive-bengaluru-stable-vani-vilas-hospital-2729479-2025-05-23",
      "headline": "Nine-month-old baby tests positive for Covid-19 in Bengaluru, under medical careA nine-month-old boy in Bengaluru has tested positive for Covid-19 and is currently under treatment at a private hospital. Karnataka now has 16 active Covid-19 cases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-2027-odi-world-cup-gautam-gambhir-on-future-2729425-2025-05-23",
      "headline": "Virat Kohli and Rohit Sharma for 2027 World Cup? Gambhir on ODI futuresGautam Gambhir dismissed speculation around the 2027 World Cup, stressing India's primary focus is on the 2026 T20 World Cup. He urged younger players to step up after Kohli and Rohit's red-ball retirements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/bhool-chuk-maaf-review-rajkummar-rao-in-time-loop-of-misogyny-and-lopsided-love-2729179-2025-05-23",
      "headline": "Bhool Chuk Maaf review: Rajkummar Rao in time loop of misogyny and lopsided loveReleased-Fri May 23, 2025In 'Bhool Chuk Maaf', pregnancy jokes and outdated concepts of love are given way more importance than an attempt at bringing a progressive story from the heartland of India. Even Rajkummar Rao can't save this lost in a loop, lacking in love film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/march-for-yunus-dhaka-to-witness-fresh-protests-as-army-chief-pushes-for-election-2729311-2025-05-23",
      "headline": "March for Yunus: Dhaka to witness fresh protests as Army chief pushes for electionYunus' supporters have announced 'March For Yunus' at Dhaka's Shahbagh on Saturday. Posters have been put up in the capital city calling on people to join the march. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ncp-leader-rajendra-tukaram-hagawane-daughter-in-law-death-case-2728479-2025-05-23",
      "headline": "Suicide or murder? NCP leader, his family arrested after daughter-in-law's deathWhile the case initially appeared to be a suicide, physical injuries and marks on the neck of the deceased have led investigators to suspect foul play. The police have arrested all five accused, including NCP leader Rajendra Tukaram Hagawane in this case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/monsoon-likely-to-hit-kerala-in-the-next-two-days-heavy-rains-imminent-2729437-2025-05-23",
      "headline": "Monsoon likely to hit Kerala in the next two days, heavy rains imminentThis system is anticipated to move northwards and intensify into a depression within the next 24 hours, setting the stage for widespread rainfall along India's western coastline."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-orlen-memorial-poland-javelin-live-streaming-date-timing-2729466-2025-05-23",
      "headline": "Neeraj Chopra at Janusz Kusocinski Memorial 2025 live streaming, date and timeIndia's Neeraj Chopra will compete in a strong field at the Orlen Memorial Janusza Kusocinskiego in Chorzów, Poland on Friday, May 23. Neeraj will be battling against Julian Weber, who won the Doha Diamond League earlier in May. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/doping-anti-doping-games-athletics-2729454-2025-05-23",
      "headline": "Doping-Enhanced Games to launch in 2026, bucking global anti-doping normsThe Enhanced Games are launching their first-ever event in May 2026, taking place in Las Vegas. The competition will feature swimming, athletics, and weightlifting, specifically for athletes who use substances prohibited in traditional sports, drawing concern from anti-doping organisations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-2027-odi-world-cup-gautam-gambhir-on-future-2729425-2025-05-23",
      "headline": "Virat Kohli and Rohit Sharma for 2027 World Cup? Gambhir on ODI futuresGautam Gambhir dismissed speculation around the 2027 World Cup, stressing India's primary focus is on the 2026 T20 World Cup. He urged younger players to step up after Kohli and Rohit's red-ball retirements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/angelo-mathews-test-cricket-retirement-bangladesh-series-2729398-2025-05-23",
      "headline": "Mathews to retire from Test cricket, available for white-ball selectionSri Lankan all-rounder Angelo Mathews will retire from Test cricket after the opening Test against Bangladesh in June at the Galle International Stadium.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-josh-hazlewood-rcb-return-playoffs-shoulder-injury-2729385-2025-05-23",
      "headline": "Josh Hazelwood likely to return for RCB's IPL 2025 playoffs: ReportsRCB are set for a key boost as Josh Hazlewood eyes a comeback for the IPL 2025 playoffs after recovering from injury. His return could be pivotal in the franchise's hunt for their maiden title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/luka-modric-real-madrid-legacy-trophies-laliga-worst-signing-ballon-dor-winner-2729345-2025-05-23",
      "headline": "From LaLiga's worst signing to Ballon d'Or icon: Luka Modric's Real Madrid legacyLuka Modric's Real Madrid journey defied every odd—transforming early criticism into legendary status. From benchwarmer to Ballon d'Or winner, his 13-year spell defined an era of dominance, humility, and unrivalled midfield mastery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/luka-modric-real-madrid-exit-emotional-tributes-kylian-mbappe-vinicius-jr-jude-bellingham-2729276-2025-05-23",
      "headline": "Luka Modric gets emotional tributes from Real Madrid stars: Thank you legendLuka Modric bid an emotional farewell to Real Madrid, receiving heartfelt tributes from teammates and legends like Rafael Nadal, honoring his legendary career, unmatched leadership, and lasting impact on the club's historic success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-lsg-avesh-khan-every-game-for-a-win-2729248-2025-05-23",
      "headline": "LSG play every game for a win: Avesh Khan after GT winAfter a string of losses and playoff elimination, Avesh Khan said LSG focused on finishing strong, calling their 33-run win over GT a confidence booster ahead of their final IPL 2025 clash against RCB."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-lsg-confidence-booster-avesh-khan-season-end-on-high-2729245-2025-05-23",
      "headline": "GT win was a boost: Avesh Khan says LSG aim to end IPL 2025 strongAvesh Khan believes LSG's morale-boosting win over Gujarat Titans showed their intent to finish IPL 2025 on a strong note, even after crashing out of the playoffs race earlier this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-josh-hazlewood-rcb-return-playoffs-shoulder-injury-2729385-2025-05-23",
      "headline": "Josh Hazelwood likely to return for RCB's IPL 2025 playoffs: ReportsRCB are set for a key boost as Josh Hazlewood eyes a comeback for the IPL 2025 playoffs after recovering from injury. His return could be pivotal in the franchise's hunt for their maiden title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/luka-modric-real-madrid-legacy-trophies-laliga-worst-signing-ballon-dor-winner-2729345-2025-05-23",
      "headline": "From LaLiga's worst signing to Ballon d'Or icon: Luka Modric's Real Madrid legacyLuka Modric's Real Madrid journey defied every odd—transforming early criticism into legendary status. From benchwarmer to Ballon d'Or winner, his 13-year spell defined an era of dominance, humility, and unrivalled midfield mastery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/luka-modric-real-madrid-exit-emotional-tributes-kylian-mbappe-vinicius-jr-jude-bellingham-2729276-2025-05-23",
      "headline": "Luka Modric gets emotional tributes from Real Madrid stars: Thank you legendLuka Modric bid an emotional farewell to Real Madrid, receiving heartfelt tributes from teammates and legends like Rafael Nadal, honoring his legendary career, unmatched leadership, and lasting impact on the club's historic success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-lsg-avesh-khan-every-game-for-a-win-2729248-2025-05-23",
      "headline": "LSG play every game for a win: Avesh Khan after GT winAfter a string of losses and playoff elimination, Avesh Khan said LSG focused on finishing strong, calling their 33-run win over GT a confidence booster ahead of their final IPL 2025 clash against RCB."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-lsg-confidence-booster-avesh-khan-season-end-on-high-2729245-2025-05-23",
      "headline": "GT win was a boost: Avesh Khan says LSG aim to end IPL 2025 strongAvesh Khan believes LSG's morale-boosting win over Gujarat Titans showed their intent to finish IPL 2025 on a strong note, even after crashing out of the playoffs race earlier this week."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}