{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-zerodha-founder-and-ceo-nithin-kamath-says-crypto-derivatives-need-urgent-regulation-2827073-2025-11-27",
      "headline": "Why Zerodha's Nithin Kamath says crypto derivatives need urgent regulationKamath described the current state of crypto derivative exchanges as \"a bit like Schrödinger's cat — neither fully regulated nor unregulated.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-refund-still-pending-here-is-how-to-check-your-status-using-pan-2826992-2025-11-27",
      "headline": "ITR refund still pending? Here's how to check your status using PANIf your ITR refund for FY24–25 hasn't arrived yet, you're not alone. Many taxpayers are seeing longer delays this year. The good news: you can quickly check your refund status online using just your PAN."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-codes-5-key-benefits-you-must-know-2826962-2025-11-27",
      "headline": "New labour codes: 5 key benefits you must knowWith the new labour codes, gig and platform workers are now officially recognised, giving them entry into an organised safety net that includes insurance, PF benefits and pension provisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-nifty-sensex-record-high-2026-outlook-explained-2826943-2025-11-27",
      "headline": "Markets at record high: Is a bigger bull run coming in 2026?After 14 months of waiting, domestic markets have finally broken past their earlier ceilings. Strong flows, better earnings and a powerful technical breakout now raise a bigger question about whether 2026 becomes the real breakout year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-all-time-high-gdp-data-friday-financial-shares-rise-2826938-2025-11-27",
      "headline": "Sensex, Nifty touch all-time highs before cooling off, investors await GDP dataThe S&P BSE Sensex added 110.87 points to end at 85,720.38, while the NSE Nifty50 gained 10.25 points to close at 26,215.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/flexible-work-places-why-corporates-are-preferring-over-permanent-office-commercial-real-estate-2826911-2025-11-27",
      "headline": "Why more companies are choosing flexible offices over owning spaceCorporations are now intentionally reallocating portions of their real estate portfolios into flexible and fully serviced workspaces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-wedding-insurance-is-becoming-the-next-big-trend-in-india-2826875-2025-11-27",
      "headline": "Why wedding insurance is becoming the next big trend in IndiaIndian weddings are getting grander, costlier and far more unpredictable. As families pour months of planning and significant savings into these celebrations, a single last-minute disruption can derail everything. This rising uncertainty is quietly driving a new trend—wedding insurance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/crypto-futures-and-options-trade-hidden-tax-trap-young-investors-2826869-2025-11-27",
      "headline": "From crypto to F&O: The hidden tax trap young investors keep missingYoung investors are trading faster than ever, but many overlook how crypto and F&O profits are taxed. Strict rules, tougher scrutiny and poor record-keeping are turning quick gains into unexpected tax headaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/psu-bank-merger-government-plan-finance-minister-nirmala-sitharaman-employee-problems-salary-promotion-hr-2826868-2025-11-27",
      "headline": "PSU bank mergers: Do bigger banks mean happier employees?India's tryst with PSB (public sector bank) consolidation dates back more than three decades. The first post-nationalisation merger took place in 1993, when Punjab National Bank (PNB) absorbed the New Bank of India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-plans-to-update-credit-scores-every-7-days-what-is-means-for-borrowers-2826835-2025-11-27",
      "headline": "RBI plans to update credit scores every 7 days: What is means for borrowersWith credit scores updating every seven days, access to loans, credit cards, and better interest rates may become more immediate and more closely linked to a person's most recent financial behaviour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-refunds-2025-do-salaried-individuals-receive-quicker-refunds-than-business-filers-income-tax-2826812-2025-11-27",
      "headline": "ITR refunds 2025: Do salaried individuals receive quicker refunds than business filers?As refund delays continue this year, many taxpayers are wondering whether salaried individuals truly get their money back faster than business filers. With processing moving more slowly for Assessment Year 2025–26, the question has become more relevant than ever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/whirlpool-share-price-plummets-10-percent-why-is-it-falling-today-2826803-2025-11-27",
      "headline": "Whirlpool share price plummets over 10%. Why is it falling today? The slump followed a large 1.5 crore share transaction that took place in early trade as part of a block deal, making it one of the biggest single-day deals for the consumer durables major in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-fresh-record-high-14-month-stocks-to-watch-investing-tips-bse-nse-top-shares-2826761-2025-11-27",
      "headline": "Sensex, Nifty hit all-time high: Check top stocks you can invest inThe S&P BSE Sensex climbed more than 400 points to move past 86,000, while the Nifty50 touched a record above 26,300. This is the first time in 14 months that both benchmarks have hit new peaks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/irdai-customer-first-grievance-redressal-claim-denied-impact-2826739-2025-11-27",
      "headline": "When in doubt, choose the customer: IRDAI chief on insurers' grievance handlingIRDAI has stepped in with a strong message to insurers, urging a clear shift toward faster, fairer grievance handling at a time when policyholders are increasingly frustrated with delays and opaque processes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-nifty-all-time-high-after-14-months-what-next-for-domestic-equities-2826712-2025-11-27",
      "headline": "Sensex, Nifty hit all-time high after 14 months. What next for stock markets? A fresh Sensex and Nifty record has reignited confidence across Dalal Street, lifting traders' moods and shifting market sentiment firmly to the upside. With bulls in control again, is another milestone already on the horizon?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-150-points-higher-nifty-above-26200-mahindra-up-1-percent-2826691-2025-11-27",
      "headline": "Sensex, Nifty hit all-time high as bull run continues on D-StreetThe S&P BSE Sensex added 224.80 points to 85,836.74, while the NSE Nifty50 gained 60.85 points to 26,266.15 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-expectation-sensex-nifty-trading-view-setup-record-high-on-cards-us-rate-cut-crude-oil-price-2826680-2025-11-27",
      "headline": "Sensex, Nifty today: Will the stock market hit a record high?Sensex, Nifty today: The upbeat mood in global and domestic markets, softer crude oil prices and steady foreign inflows are expected to support the market at the opening bell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sip-investment-tips-stock-market-investing-long-term-returns-wealth-personal-finance-compounding-money-2826670-2025-11-27",
      "headline": "Why relying only on SIPs may hurt your returns in the long runAMFI's October 2025 figures show just how deeply SIPs have entered the Indian investing culture. Monthly SIP contributions touched Rs 29,529.37 crore, the highest ever for the second month in a row and up 16.6% from a year earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cabinet-approves-rs-7280-crore-scheme-to-promote-manufacturing-of-rare-earth-magnets-2826354-2025-11-26",
      "headline": "Cabinet clears Rs 7,280 crore rare earths scheme amid China's export curbsThe government has cleared a financial outlay of Rs 7,280 crore to set up 6,000 metric tonnes per year of fully integrated REPM manufacturing capacity in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-your-take-home-pay-drop-new-labour-code-basic-salary-allowance-2826385-2025-11-26",
      "headline": "Will the new labour codes cut your in-hand salary? Here's the mathNow that the new labour codes are in force and wages are being recalculated, will your monthly take-home salary take a hit?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bigg-boss-episode-96-day-95-written-update-gaurav-khanna-wins-ticket-to-finale-ashnoor-kaur-hits-tanya-mittal-2827201-2025-11-27",
      "headline": "Bigg Boss episode 96: Gaurav wins ticket to finale, Ashnoor hits Tanya Gaurav Khanna clinched the first spot in the 'Bigg Boss 19' finale after a tense ticket-to-finale task. Meanwhile, the task left Tanya Mittal emotional following a physical confrontation with Ashnoor Kaur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/inside-dharmendra-prayer-meet-memories-emotions-a-musical-tribute-2827191-2025-11-27",
      "headline": "Inside Dharmendra's prayer meet: Memories, emotions and a musical tribute A musical tribute was reportedly performed during Dharmendra's prayer meet in Mumbai. The Deol family and numerous film industry figures gathered in Mumbai on Thursday to remember the iconic actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/celina-jaitly-emotional-note-after-filing-for-divorce-peter-haag-i-am-a-soldier-daughter-2827163-2025-11-27",
      "headline": "I am a soldier's daughter: Celina Jaitly's emotional note after filing for divorce Actor Celina Jaitly has shared an emotional note sharing her feelings after initiating divorce proceedings from her husband, Peter Haag. She expressed that her upbringing as the daughter of a soldier had shaped her approach to adversity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranbir-kapoor-vicky-kaushal-first-look-love-and-war-sets-viral-photos-air-force-officers-2827112-2025-11-27",
      "headline": "Ranbir Kapoor, Vicky Kaushal's Air Force look from Love & War sets sparks buzz Some behind-the-scenes images from director Sanjay Leela Bhansali's upcoming film 'Love & War' have surfaced online. The photos offer a glimpse of actors Ranbir Kapoor and Vicky Kaushal in their roles as Air Force officers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-introducing-son-azad-to-dharmendra-missing-prayer-meet-2827117-2025-11-27",
      "headline": "Aamir Khan on introducing son Azad to Dharmendra, missing prayer meet Aamir Khan has shared insights into his close bond with Dharmendra. The superstar opened up about the heartwarming moment when he took his son Azad to meet the late celebrated star. He also explained his absence from the prayer meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-on-south-trend-he-doesnt-like-when-it-comes-to-casting-hindi-heroes-2827087-2025-11-27",
      "headline": "Suniel Shetty on South trend he doesn't like when it comes to casting Hindi heroes Suniel Shetty has highlighted a trend of typecasting Hindi heroes in negative roles. The actor reflected on his recent film choices in a recent interview and said he accepted a role in 'Darbar' because he wanted to work with Rajinikanth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-video-zee5-jiohotstar-ott-releases-this-week-kantara-a-legend-hindi-raktabeej-2-bel-air-2826973-2025-11-27",
      "headline": "Prime Video, ZEE5, JioHotstar this week: Kantara Hindi, Raktabeej 2, Bel Air and more A mix of period dramas, political thrillers, comedies, and action-packed titles is set to release on OTT between November 24 and November 28. Here is a range of options for your next watch."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bobby-deol-sharman-joshi-and-others-arrive-at-dharmendra-prayer-meet-in-mumbai-2827025-2025-11-27",
      "headline": "Dharmendra prayer meet: Salman, Shabana Azmi arrive; join Bobby Deol, Vidya Balan A prayer meet for late actor Dharmendra was being held in Mumbai following his death on November 24, 2025. Bobby Deol, Salman Khan, Shabana Azmi and other celebrities arrived to pay respects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-this-week-stranger-things-sunny-sanskari-ki-tulsi-kumari-and-more-2826923-2025-11-27",
      "headline": "Netflix this week: Stranger Things 5, Sunny Sanskari Ki Tulsi Kumari and more From Sunny Sanskari ki Tulsi Kumari to Stranger Things Season 5 Volume 1, a range of highly anticipated films and series debut on Netflix this week. Viewers can expect a mix of romantic comedies, intense thrillers, period dramas and family entertainment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/andhra-king-taluka-review-ram-pothineni-as-a-fan-whose-heart-becomes-the-films-spine-2826985-2025-11-27",
      "headline": "Andhra King Taluka review: Ram Pothineni delivers his strongest performance yetRelease Date:Thu Nov 27, 2025 Andhra King Taluka movie review: Andhra King Taluka captures the purity of fan devotion with heart and sincerity, even as predictable writing and commercial choices hold it back from becoming the truly great film it could have been."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-addresses-street-harassment-in-new-video-urges-women-to-stand-up-2827000-2025-11-27",
      "headline": "Aishwarya Rai addresses street harassment in new video, urges women to stand up Aishwarya Rai delivers a powerful message on street harassment through a new campaign video, urging women not to blame themselves and receiving widespread support online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rasha-thadani-telugu-debut-ajay-bhupathi-srinivasa-mangapuram-fan-excitement-2826912-2025-11-27",
      "headline": "Get ready to witness a cult: Rasha Thadani shares AB4 poster ahead of first look Actor Rasha Thadani unveiled a new poster for director Ajay Bhupathi's forthcoming project, hinting at an imminent first look and confirming her Telugu film debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-celebrates-bharat-ki-betiyan-praises-indian-women-athletes-2826975-2025-11-27",
      "headline": "Priyanka Chopra celebrates 'Bharat Ki Betiyan', praises Indian women athletes Priyanka Chopra celebrated Indian women athletes as 'Bharat Ki Betiyan' in a social media reel, urging them to inspire young girls; fans lauded the actor, calling her the 'Desi Girl' for her appreciation of national talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/does-dhurandhar-karvaan-song-resemble-british-band-queen-another-one-bites-the-dust-2826933-2025-11-27",
      "headline": "Does Dhurandhar's Karvaan resemble British band Queen's Another One Bites the Dust? Dhurandhar's newly released song Karvaan is making waves for its bold fusion of Roshan's classic qawwali with modern rock elements. The track's opening beats find a striking resemblance to Queen's legendary Another One Bites the Dust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahmed-khan-rangeela-caused-a-rift-with-saroj-khan-ram-gopal-verma-2826946-2025-11-27",
      "headline": "Rangeela caused a rift between Saroj Khan and him, recalls Ahmed Khan In an exclusive interview with India Today, choreographer Ahmed Khan spoke about his rift with the legendary Saroj Khan during the Rangeela days and how it gave him a break into the industry as an independent choreographer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-season-5-will-byers-emotional-finale-duffer-brothers-netflix-2826902-2025-11-27",
      "headline": "Stranger Things creators Duffer Brothers on toughest season, Will Byers and India Stranger Things Season 5 marks the emotional conclusion of the beloved series. The Duffer Brothers bring the story full circle with Will Byers at its heart, promising a deeply layered finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhanush-shares-kulhad-chai-memories-from-varanasi-ahead-of-tere-ishk-mein-release-2826910-2025-11-27",
      "headline": "Dhanush shares kulhad chai memories from Varanasi ahead of Tere Ishk Mein release Dhanush revisits his Raanjhanaa roots in Varanasi, sipping kulhad chai and walking through familiar lanes ahead of the release of Tere Ishk Mein. The actor shares emotional memories of Kundan while introducing his new character, Shankar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-kardashian-discusses-co-parenting-challenges-kanye-west-public-custody-disputes-2826895-2025-11-27",
      "headline": "Kim Kardashian admits she avoids Kanye West after his social media attacks Kim Kardashian has spoken about her decision not to engage with Kanye West's social media comments, following his public accusations about access to their children. Their ongoing co-parenting challenges have featured in recent episodes of The Kardashians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aukaat-ke-bahar-trailer-elvish-yadav-debut-promises-romance-college-politics-2826882-2025-11-27",
      "headline": "Aukaat Ke Bahar trailer: Elvish Yadav's debut promises romance, college politics Elvish Yadav makes his lead acting debut in 'Aukaat Ke Bahar' as a fiery Haryana boy who challenges elite Delhi college norms, sparking an intense romance with his ambitious senior, Antara Shukla, amidst high-stakes campus politics."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/word-power-is-world-power-remark-was-for-constitution-day-dk-shivakumar-clears-air-amid-karnataka-cm-tussle-2827204-2025-11-27",
      "headline": "'Word power' remark was for Constitution Day: Shivakumar amid Karnataka drama Live UpdatesKarnataka Deputy Chief Minister DK Shivakumar said his \"word power is world power\" remark was made in the context of Constitution Day and not aimed at the Congress leadership, amid renewed speculation over a power-sharing pact with Chief Minister Siddaramaiah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/hong-kong-fire-over-80-killed-nearly-300-missing-rescuers-battle-reach-trapped-residents-latest-developments-2827195-2025-11-27",
      "headline": "83 killed in huge Hong Kong blaze as rescuers battle to reach trapped residentsEarly investigations pointed to highly flammable renovation materials, leading to three arrests, while the government announced a HKD 300 million relief fund and ordered city-wide safety inspections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-federal-agencies-uscis-ice-detaining-foreigners-during-green-card-interviews-attorney-generals-immigration-san-diego-2827139-2025-11-27",
      "headline": "Go for Green Card, get handcuffed: US agencies arresting people during interviewsUS federal agencies, including the ICE, are detaining individuals during Green Card interviews at USCIS offices in San Diego. Attorneys said individuals, including spouses of US citizens, with visa overstays but no criminal history, are being taken into custody. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cyclone-ditwah-pre-cyclone-watch-tamil-nadu-puducherry-south-andhra-pradesh-2827020-2025-11-27",
      "headline": "Cyclone Ditwah to hit Tamil Nadu, Andhra coasts by Nov 30; heavy rain likelyCyclone Ditwah formed over the southwest Bay of Bengal and is moving toward the north Tamil Nadu–Puducherry–south Andhra Pradesh coasts. A pre-cyclone watch has been issued. Heavy rain, thunderstorms and strong winds are expected across southern states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-auction-full-players-sold-unsold-list-most-expensive-buys-2827166-2025-11-27",
      "headline": "WPL Auction: Full list of players sold, updated squads ahead of 2026 seasonWPL Auction: The Women's Premier League mega auction concluded with the franchise buying a total of 67 players. Deepti Sharma was the most expensive buy of the day, while Alyssa Healy and Alana King made headlines due to shocking omissions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/uae-stops-issuing-visas-to-pakistanis-to-check-crime-saudi-arabia-blue-diplomatic-passport-holders-work-visa-pakistan-dubai-2827105-2025-11-27",
      "headline": "To check crime, UAE stops issuing visas to PakistanisThe UAE has halted most visa issuances for Pakistanis amid concerns over criminal activity. Pakistani officials have warned that restrictions could escalate into a full ban. This dents Pakistan's passport reputation, which is ranked the fourth-last in the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mandate-for-5-years-siddaramaiah-hits-back-at-shivakumar-word-dig-amid-tussle-2827128-2025-11-27",
      "headline": "'Word' play continues as Siddaramaiah gives back to Shivakumar amid riftThe power tussle between the two camps was laid bare when Siddaramaiah's close aide G Parameshwara said he would accept DK Shivakumar as his Chief Minister if the party's top brass chose so, giving a fresh twist to the on-and-off battle for the top post that has gripped Karnataka for the past few months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hong-kong-fire-bamboo-scaffolding-vs-chinese-nets-what-really-caused-deadly-blaze-explained-2827049-2025-11-27",
      "headline": "What made Hong Kong fire deadly, cheap Chinese nets or bamboo scaffolding?A deadly fire tore through a Hong Kong high-rise, killing 75, with hundreds still unaccounted for. As investigators probe the cause, there are theories circulating. Was it the traditional bamboo scaffolding or the low-quality Chinese construction nets that spread the inferno? The fire raises urgent questions about building safety standards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-imran-khan-death-asim-munir-army-fielod-marshal-power-pathan-pashturn-power-punjab-tussle-2826851-2025-11-27",
      "headline": "Why Imran Khan the Pathan spooks Punjabi General MunirAsim Munir might have the entire Pakistani army under his command, but nothing scares him more than Imran Khan. Munir engineered a regime change and put Imran behind bars, but the cricketer-turned-politician's aura has only grown. This is why one Pathan scares Pakistan's Punjabi-led hybrid regime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazons-siddharth-bhagat-breaks-down-indias-new-beauty-economy-from-global-trends-to-tech-led-discovery-2825952-2025-11-26",
      "headline": "Amazon's Siddharth Bhagat Breaks Down India's New Beauty Economy—From Global Trends to Tech-Led DiscoveryTracing India's changing beauty codes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/sir-case-supreme-court-hearing-aadhaar-citizenship-proof-ec-surya-kant-poll-panel-2826753-2025-11-27",
      "headline": "Can foreigners with Aadhaar be allowed to vote? Supreme Court on plea against SIRThe Supreme Court held that Aadhaar is not absolute proof of citizenship as it began final hearings on pleas challenging the Election Commission's Special Intensive Revision (SIR) of electoral rolls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/nikki-haley-son-nalin-asks-republican-listen-disillusioned-gen-z-mamdani-us-h1b-visa-immigration-family-roots-india-2827030-2025-11-27",
      "headline": "Nikki Haley's son distances self from Indian roots, tells Republicans to woo Gen ZNalin Haley, son of Indian-American Republican leader Nikki Haley, has distanced himself from his Indian roots, saying he holds loyalty only to the United States. He also criticised Republicans for failing to listen to Gen Z voices. The 24-year-old also attributed Democrat Zohran Mamdani's victory in the New York City's mayoral race to Gen Z voters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/volcanoes-quakes-solar-storms-earth-system-crisis-magma-movement-inner-core-2826971-2025-11-27",
      "headline": "Volcanoes, quakes, solar storms: What on Earth is going on?From major volcanic eruptions, to supercharged earthquakes to deadly wildfires and floods, Earth's systems are going through a period of intense, overlapping stress in 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/from-serenity-to-celebration-gujarat-in-all-its-shades-2823221-2025-11-20",
      "headline": "From Serenity to Celebration - Gujarat in All Its ShadesAnother destination that has stood the test of time and modernisation is Vadnagar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/mumbai-ethiopia-volcanic-ash-air-pollution-maharashtra-aqi-bombay-high-court-2827036-2025-11-27",
      "headline": "Don't blame volcanic ash from Ethiopia: Court raps Maharashtra over pollutionThe Bombay High Court said the visibility in Mumbai was poor well before the volcanic eruption in Ethiopia on November 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-assembly-passes-bill-prohibiting-polygamy-strict-penalties-compensation-victims-2827047-2025-11-27",
      "headline": "Assam passes anti-polygamy bill with 10-year jail term, CM says it's not anti-IslamAhead of the Assam Assembly passing the bill, Chief Minister Himanta Biswa Sarma told the House that it was \"not against Islam\" and that any \"true Islamic people will welcome this.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/this-thanksgiving-americans-maga-supporters-are-not-thanking-us-president-donald-trump-inflation-rising-grocery-turkey-prices-2826823-2025-11-27",
      "headline": "Why Trump's rage against India will get him no thanks on ThanksgivingThe cost of an average turkey, the most important part of a Thanksgiving family meal, has risen 25% since last year's celebrations. Trump's tariffs have played a crucial role in that. Not just Turkey, other household items of every day use too have shot through the roof in the US. Tariffs are hurting Americans more than anyone else."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-modi-meets-indian-blind-womens-cricket-team-historic-t20-world-cup-win-2827137-2025-11-27",
      "headline": "PM Modi meets Indian blind women's cricket team after historic T20 World Cup triumphPM Narendra Modi met the Indian women's blind cricket team after their unbeaten run to the inaugural Blind Women's T20 World Cup title, celebrating their historic win."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/dk-shivakumar-word-power-post-karnataka-power-tussle-siddaramaiah-congress-leadership-2826872-2025-11-27",
      "headline": "It's fake: DK Shivakumar on viral 'word power' post amid Karnataka power tussleDK Shivakumar has rejected a viral quote on his X account as 'fake', even as speculation over a 2023 Karnataka power-sharing pact resurfaced and the Congress leadership weighed its options at the government's halfway mark."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/where-is-imran-khan-pakistan-adiala-jail-reacts-death-rumours-2826725-2025-11-27",
      "headline": "Where is Imran Khan? Pak's Adiala jail responds amid death rumoursImran Khan: A day after violent protests were seen outside Pakistan's Adiala Jail amid rumours that Imran Khan had died in custody, the prison administration clarified on the former PM's health and his whereabouts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/engineer-to-doctor-akriti-goel-from-bits-pilani-to-cracking-neet-air-1118-2827007-2025-11-27",
      "headline": "This engineer quit startups, cracked NEET and became a doctor. Here's howAkriti Goel left a high-pressure startup career after burnout, studied for NEET, scored AIR 1118 and is now an MBBS final-year at Hindu Rao. Her story — mixing engineering, startups and content creation — normalises late career shifts and shows how purpose can reshape professional life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-siddaramaiah-g-parameshwara-backs-dk-shivakumar-as-cm-if-congress-decides-transition-2826743-2025-11-27",
      "headline": "Rift in Siddaramaiah camp? Aide says will accept Shivakumar for top post if…Karnataka Home Minister G Parameshwara signalled a major endorsement by saying he would accept DK Shivakumar as Chief Minister if the Congress decides on a transition. Minister Zameer Ahmed Khan, however, said that the Chief Ministerial seat is not empty till 2028."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nalin-haley-calls-vivek-ramaswamy-a-creep-slams-his-reforms-as-third-world-parenting-2826954-2025-11-27",
      "headline": "This creep...: Nikki Haley's son attacks Vivek Ramaswamy over education reformsRamaswamy, who is running for Ohio governor in 2026, has announced reforms aimed at raising academic standards, expanding phonics-based learning, linking teacher pay to performance, and increasing school-choice options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/mahindra-xev-9s-launched-rs-1995-lakh-first-mass-market-seven-seater-electric-suv-2826732-2025-11-27",
      "headline": "Mahindra XEV 9S launched at Rs 19.95 lakh as first mass-market 7-seater electric SUVMahindra has launched the XEV 9S at Rs 19.95 lakh (ex-showroom), introducing India's first mass-market 7-seater electric SUV with a tech-rich cabin, versatile battery options and true family-oriented practicality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/inside-dharmendra-prayer-meet-memories-emotions-a-musical-tribute-2827191-2025-11-27",
      "headline": "Inside Dharmendra's prayer meet: Memories, emotions and a musical tributeA musical tribute was reportedly performed during Dharmendra's prayer meet in Mumbai. The Deol family and numerous film industry figures gathered in Mumbai on Thursday to remember the iconic actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/celina-jaitly-emotional-note-after-filing-for-divorce-peter-haag-i-am-a-soldier-daughter-2827163-2025-11-27",
      "headline": "I am a soldier's daughter: Celina Jaitly's emotional note after filing for divorceActor Celina Jaitly has shared an emotional note sharing her feelings after initiating divorce proceedings from her husband, Peter Haag. She expressed that her upbringing as the daughter of a soldier had shaped her approach to adversity."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/9-year-old-indian-origin-talent-urban-negi-signs-evertons-youth-academy-2827220-2025-11-28",
      "headline": "9-year-old Indian-origin talent Urban Negi signs for Everton's youth academy Indian-origin youngster Urban Negi, aged nine, has signed with Everton's youth academy after impressing in London. His progress brings hope for greater Indian representation in elite football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-virat-kohli-rishabh-pant-attendance-ms-dhoni-home-ranchi-get-together-2827211-2025-11-27",
      "headline": "Kohli, Pant in attendance at MS Dhoni's high-profile get-together in Ranchi Virat Kohli, Rishabh Pant and other Indian players visited MS Dhoni's Ranchi home ahead of the ODI series against South Africa as the team regroups after the Test defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-auction-deepti-sharma-most-expensive-player-up-warriorz-signings-2827196-2025-11-27",
      "headline": "From Sophie Ecclestone to Kranti Goud: 5 steal deals in WPL 2026 mega auction The WPL 2026 auction delivered high drama as franchises spent Rs 40.8 crore to reshuffle squads, headlined by Deepti Sharma's record Rs 3.2 crore return to UP Warriorz and several surprise bargains and omissions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-auction-full-list-of-indians-sold-deepti-sharma-shikha-pandey-shree-charani-2827180-2025-11-27",
      "headline": "44 Indians headline blockbuster WPL auction as franchises cash in on homegrown stars The 2026 WPL mega auction was dominated by Indian talent, with 44 players earning contracts led by Deepti Sharma's joint-record RTM signing. Franchises focused heavily on homegrown strength, shaping what could be the most competitive WPL season yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-auction-full-players-sold-unsold-list-most-expensive-buys-2827166-2025-11-27",
      "headline": "WPL Auction: Full list of players sold, updated squads ahead of 2026 season WPL Auction: The Women's Premier League mega auction concluded with the franchise buying a total of 67 players. Deepti Sharma was the most expensive buy of the day, while Alyssa Healy and Alana King made headlines due to shocking omissions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-rohit-sharma-virat-kohli-practice-session-video-2827156-2025-11-27",
      "headline": "Virat Kohli, Rohit Sharma lead India's practice in Ranchi ahead of 1st ODI Virat Kohli and Rohit Sharma had their first net session in Ranchi ahead of India's first ODI against South Africa. The star duo return for their first international game since playing the 3-match ODI series in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-rohit-virat-kohli-sunil-gavaskar-2827142-2025-11-27",
      "headline": "Stop saying India would've beaten South Africa with Kohli, Rohit: Sunil Gavaskar IND vs SA: Would India have avoided the Test series disaster against South Africa if Rohit Sharma and Virat Kohli were still around? Legendary Sunil Gavaskar makes strong remarks on the burning question that has been floating on social media since the defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-modi-meets-indian-blind-womens-cricket-team-historic-t20-world-cup-win-2827137-2025-11-27",
      "headline": "PM Modi meets Indian blind women's cricket team after historic T20 World Cup triumph PM Narendra Modi met the Indian women's blind cricket team after their unbeaten run to the inaugural Blind Women's T20 World Cup title, celebrating their historic win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-jr-mens-hockey-world-cup-2025-preview-squad-schedule-2826864-2025-11-27",
      "headline": "Jr. Men's Hockey World Cup: PR Sreejesh's young India chase third title The Indian team will be aiming to win their third title as they step on to the field for the Jr.men's Hockey World Cup in Chennai and Madurai, starting from November 28. With PR Sreejesh at the helm and filled with HIL stars, India will look to end a nine-year wait for the crown. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-auction-shikha-pandey-24-crore-up-warriorz-2827126-2025-11-27",
      "headline": "Old is gold: Ageless Shikha Pandey bags Rs 2.4 crore move to UP Warriorz Shikha Pandey has been keeping herself active by taking part in leagues across the globe. This experience has certainly upped her stocks, which resulted in a Rs 2.4 crore deal with the UP Warriorz at the WPL 2026 mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/tanvi-sharma-stuns-nozomi-okuahara-syed-modi-international-upsets-indian-shuttlers-2827097-2025-11-27",
      "headline": "16-year-old Tanvi shocks ex-world champ, Prannoy beaten by teen compatriot Tanvi Sharma upset former world champion Nozomi Okuhara to reach Syed Modi International quarterfinals in Lucknow on Thursday. Meanwhile, 19-year-old Manraj Singh defeated HS Prannoy in men's singles second round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-rohit-virat-kohli-sunil-gavaskar-2827142-2025-11-27",
      "headline": "Stop saying India would've beaten South Africa with Kohli, Rohit: Sunil Gavaskar IND vs SA: Would India have avoided the Test series disaster against South Africa if Rohit Sharma and Virat Kohli were still around? Legendary Sunil Gavaskar makes strong remarks on the burning question that has been floating on social media since the defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-modi-meets-indian-blind-womens-cricket-team-historic-t20-world-cup-win-2827137-2025-11-27",
      "headline": "PM Modi meets Indian blind women's cricket team after historic T20 World Cup triumph PM Narendra Modi met the Indian women's blind cricket team after their unbeaten run to the inaugural Blind Women's T20 World Cup title, celebrating their historic win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-jr-mens-hockey-world-cup-2025-preview-squad-schedule-2826864-2025-11-27",
      "headline": "Jr. Men's Hockey World Cup: PR Sreejesh's young India chase third title The Indian team will be aiming to win their third title as they step on to the field for the Jr.men's Hockey World Cup in Chennai and Madurai, starting from November 28. With PR Sreejesh at the helm and filled with HIL stars, India will look to end a nine-year wait for the crown. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-auction-shikha-pandey-24-crore-up-warriorz-2827126-2025-11-27",
      "headline": "Old is gold: Ageless Shikha Pandey bags Rs 2.4 crore move to UP Warriorz Shikha Pandey has been keeping herself active by taking part in leagues across the globe. This experience has certainly upped her stocks, which resulted in a Rs 2.4 crore deal with the UP Warriorz at the WPL 2026 mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/tanvi-sharma-stuns-nozomi-okuahara-syed-modi-international-upsets-indian-shuttlers-2827097-2025-11-27",
      "headline": "16-year-old Tanvi shocks ex-world champ, Prannoy beaten by teen compatriot Tanvi Sharma upset former world champion Nozomi Okuhara to reach Syed Modi International quarterfinals in Lucknow on Thursday. Meanwhile, 19-year-old Manraj Singh defeated HS Prannoy in men's singles second round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-auction-teams-parth-jindal-delhi-capitals-2827084-2025-11-27",
      "headline": "Pretty sure BCCI is planning on adding one more team to WPL: DC ownerWPL Auction: Delhi Capitals owner Parth Jindal believes that the Indian Cricket Board will add at least one more team to the Women's Premier League in the near future. Jindal said that the home and away format would be ideal for the league."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-gautam-gambhir-critics-robin-uthappa-reaction-2827080-2025-11-27",
      "headline": "Ex-KKR teammate defends Gambhir: Everyone blames coach, few question playersIndia vs South Africa: Robin Uthappa pushes back against the piling on of Gautam Gambhir, warning that India's Test crisis won't be fixed by scapegoating one man."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-ireland-1st-t20i-updates-chattogram-litton-das-2827076-2025-11-27",
      "headline": "Bangladesh vs Ireland, 1st T20I: Highlights from ChattogramBAN vs IRE, 1st T20I Highlights: Litton Das' Bangladesh have won the toss and opted to field. The Tigers recently won the Test series and will look to carry the momentum into the shorter format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/manoj-tiwary-hammers-gautam-gambhir-india-test-team-new-head-coach-2827072-2025-11-27",
      "headline": "Manoj Tiwary hammers Gautam Gambhir, says India's Test team needs a new head coachFormer India cricketer, Manoj Tiwary believes that the Indian Test team needs a new coach and Gautam Gambhir was never the man for the job."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-sri-lanka-tri-series-updates-babar-azam-2827071-2025-11-27",
      "headline": "Pakistan vs Sri Lanka, T20I tri-series, Match 6: Highlights from RawalpindiPAK vs SL, T20I tri-series, Match 4 Highlights: Pakistan have won the toss and opted to bowl first in Rawalpindi. The game will decide between Sri Lanka and Zimbabwe, who will join Pakistan in the final.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-auction-most-expensive-player-deepti-sharma-2826963-2025-11-27",
      "headline": "WPL Auction: Deepti, Kerr bag big money, Healy unsold in marquee listWPL Auction: World Cup hero Deepti Sharma fetched the biggest price in the marquee list in the Women's Premier League mega-auction on Thursday, November 27. Australia captain Alyssa Healy was the only player to remain unsold from the list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-schedule-navi-mumbai-vadodara-bcci-dates-venues-2826924-2025-11-27",
      "headline": "BCCI announces WPL schedule: 4th edition from Jan 9 to Feb 5 in two citiesThe Women's Premier League 2026 will be played across two venues — Navi Mumbai and Vadodara. WPL chairman Jayesh George confirmed that the season will begin on 9 January in Navi Mumbai and conclude on 5 February in Vadodara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-rishabh-pant-apology-guwahati-test-loss-2826907-2025-11-27",
      "headline": "Rishabh Pant says sorry to fans in long post after India's 0-2 loss to SAIndia vice-captain Rishabh Pant has apologised to the fans after the team's embarrassing 0-2 series loss against South Africa. The Indian team were outclassed by the Proteas, who defeated the hosts by 408 runs in Guwahati Test. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-sri-lanka-tri-series-updates-babar-azam-2827071-2025-11-27",
      "headline": "Pakistan vs Sri Lanka, T20I tri-series, Match 6: Highlights from RawalpindiPAK vs SL, T20I tri-series, Match 4 Highlights: Pakistan have won the toss and opted to bowl first in Rawalpindi. The game will decide between Sri Lanka and Zimbabwe, who will join Pakistan in the final.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-auction-most-expensive-player-deepti-sharma-2826963-2025-11-27",
      "headline": "WPL Auction: Deepti, Kerr bag big money, Healy unsold in marquee listWPL Auction: World Cup hero Deepti Sharma fetched the biggest price in the marquee list in the Women's Premier League mega-auction on Thursday, November 27. Australia captain Alyssa Healy was the only player to remain unsold from the list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-schedule-navi-mumbai-vadodara-bcci-dates-venues-2826924-2025-11-27",
      "headline": "BCCI announces WPL schedule: 4th edition from Jan 9 to Feb 5 in two citiesThe Women's Premier League 2026 will be played across two venues — Navi Mumbai and Vadodara. WPL chairman Jayesh George confirmed that the season will begin on 9 January in Navi Mumbai and conclude on 5 February in Vadodara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-rishabh-pant-apology-guwahati-test-loss-2826907-2025-11-27",
      "headline": "Rishabh Pant says sorry to fans in long post after India's 0-2 loss to SAIndia vice-captain Rishabh Pant has apologised to the fans after the team's embarrassing 0-2 series loss against South Africa. The Indian team were outclassed by the Proteas, who defeated the hosts by 408 runs in Guwahati Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-leads-perth-scorchers-to-narrow-four-wicket-win-over-melbourne-renegades-2826900-2025-11-27",
      "headline": "Ahead of WPL 2026 auction, Sophie Devine sets the stage on fire in WBBLSophie Devine's all-round performance guided Perth Scorchers to a four-wicket win over Melbourne Renegades, overcoming a late collapse to secure the points at Junction Oval. Alice Capsey's four wickets threatened to turn the contest, but the visitors held their nerve in a tense finish."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-return-ashes-test-australia-squad-update-brendan-doggett-khawaja-injury-2826893-2025-11-27",
      "headline": "Fit-again Australia captain Pat Cummins set to return for Brisbane TestAustralian captain Pat Cummins is poised to make his comeback for the second Ashes Test in Brisbane, with selectors expected to name him in the squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-india-test-transition-strategy-home-defeats-2826617-2025-11-27",
      "headline": "Ashwin questions India's Test transition plan after home whitewashRavichandran Ashwin has criticised India's unclear long-format transition strategy following successive home Test defeats. His remarks highlight urgent needs for better communication and knowledge transfer in Indian cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-rohan-kunnummal-record-opening-partnership-syed-mushtaq-ali-trophy-2826842-2025-11-27",
      "headline": "Sanju Samson, Rohan Kunnummal script SMAT history with record opening standSanju Samson and Rohan S. Kunnummal tore through Odisha's attack with a record 177-run unbeaten opening stand, steering Kerala to a resounding 10-wicket win in the Syed Mushtaq Ali Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-mega-auction-live-updates-sold-unsold-retained-players-list-womens-premier-league-2826830-2025-11-27",
      "headline": "Highlights: Deepti, Kerr star as Rs 40.8 cr spent, 90 players pickedWPL 2026 Auction Highlights: Deepti Sharma and Amelia Kerr emerged as the standout names of the WPL 2026 auction that saw 90 players picked and Rs 40.8 crore spent overall. The franchises went big on proven performers, with top talents drawing fierce bidding across teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-wedding-jemimah-rodrigues-brisbane-heat-wbbl-2826820-2025-11-27",
      "headline": "Jemimah stays back for Smriti Mandhana after wedding postponed, skips WBBLThe Brisbane Heat have announced that Jemimah Rodrigues will stay back in India to support Smriti Mandhana and will miss the remainder of the WBBL campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-home-test-decline-kris-srikkanth-solution-2826804-2025-11-27",
      "headline": "Kris Srikkanth's cheeky solution to India's Test woes: Avoid playing home matchesSpeaking after India were whitewashed 0-2 by South Africa on Wednesday, Kris Srikkanth joked that India should stop playing at home to halt the slide. The sad part? In their current state, it doesn't sound entirely outrageous."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sergio-lobera-appointed-mohun-bagan-head-coach-to-boost-indian-super-league-campaign-2826773-2025-11-27",
      "headline": "Mohun Bagan appoint ISL winner Sergio Lobera as new head coachMohun Bagan has appointed Sergio Lobera as their new head coach replacing Jose Molina. Lobera brings with him experience finding success in Indian football as he won the ISL title in 2021. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}