{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindustan-unilever-ltds-nitin-paranjape-shares-dramatic-account-of-companys-5-lakh-store-leap-2828035-2025-11-29",
      "headline": "HUL's Nitin Paranjape shares dramatic account of company's 5-lakh store leapNitin Paranjpe recalled proposing the addition of five lakh outlets, a number he admitted sounded unrealistic at first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-zerodha-founder-and-ceo-nithin-kamath-warning-investors-against-pre-ipo-hype-2827686-2025-11-28",
      "headline": "Why is Zerodha's Nithin Kamath warning investors against pre-IPO hype?With IPO buzz at its peak, Nithin Kamath has stepped in to warn investors about the increasing speculation in the unlisted market, where many buyers are chasing inflated pre-IPO valuations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-do-you-recover-money-after-credit-card-fraud-steps-you-must-know-2827637-2025-11-28",
      "headline": "How do you recover money after credit card fraud? Steps you must knowRecovering money after credit card fraud can feel stressful, but the process is simpler if you act quickly. Knowing the right steps — and your rights, can greatly improve your chances of getting your money back."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gdp-growth-accelerates-to-82-in-q2fy26-beats-estimates-2827593-2025-11-28",
      "headline": "India's GDP rises by 8.2% in Q2 despite Trump tariffs, highest in six quartersIndia's 8.2% Q2 GDP print has beaten forecasts despite pressure from US tariffs, with manufacturing and services driving momentum and reaffirming the nation's place as the fastest-growing major economy heading into FY26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-end-flat-as-dalal-street-takes-breather-after-hitting-all-time-highs-2827579-2025-11-28",
      "headline": "Sensex, Nifty end flat as Dalal Street takes breather after hitting all-time highsThe S&P BSE Sensex slipped 13.71 points to close at 85,706.67, while the NSE Nifty50 ended 12.60 points lower at 26,202.95. The broader market also remained subdued, with most major sectoral indices finishing in the red."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-millennials-relying-too-heavily-on-mutual-fund-sips-drawbacks-explained-2827567-2025-11-28",
      "headline": "Are millennials relying too heavily on SIPs for wealth building?Millennials swear by SIPs for long term investing, but are they mistaking convenience for safety? As market cycles turn unpredictable, is it time to rethink what \"safe investing\" really means?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-tax-deadlines-to-lpg-prices-pensions-ups-atf-prices-5-major-financial-changes-starting-december-1-2827505-2025-11-28",
      "headline": "From tax deadlines to LPG, pensions: 5 major financial changes starting December 1Before December begins, it's worth noting that several new financial rules will kick in, affecting your bills, savings and even travel plans. Whether it's cooking gas, pension rules or tax filings, here's what to expect as the calendar turns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sudeep-pharma-shares-rise-nearly-29-percent-over-ipo-price-what-should-investors-do-2827446-2025-11-28",
      "headline": "Sudeep Pharma shares rise nearly 29% over IPO price. What should investors do?Sudeep Pharma's strong debut has impressed investors, but with valuations now stretched, is this the right moment to book profits or should investors stay put and ride the long-term story?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-ipo-price-band-gmp-company-details-all-you-need-to-know-2827438-2025-11-28",
      "headline": "From GMP to price band: 5 things to know about Meesho IPOThe SoftBank-backed e-commerce platform has set a price band of Rs 105 to Rs 111 per share, valuing the company at nearly Rs 50,100 crore at the upper end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-your-pension-stop-after-november-30-check-now-2827427-2025-11-28",
      "headline": "Will your pension stop after November 30? Check nowThe deadline to submit the annual Life Certificate is almost here, and missing it could put your pension on hold. Pensioners must complete the process by 30 November to avoid any interruption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-labour-codes-benefits-challenges-payroll-impact-take-home-pay-2827422-2025-11-28",
      "headline": "New labour codes bring major employee benefits, but what are the big challenges?The new labour codes promise stronger protection and wider benefits for workers, but the real test begins now as businesses brace for higher costs, major restructuring and a challenging transition across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-is-tax-department-sending-sms-alerts-to-25000-taxpayers-about-foreign-assets-2827404-2025-11-28",
      "headline": "Why is tax department sending SMS alerts to 25,000 taxpayers about foreign assets?Tax officials examined data received from foreign jurisdictions through the Automatic Exchange of Information (AEOI) system. This international framework allows countries to share details of financial accounts held abroad by their residents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-ipo-opening-december-3-price-band-gmp-listing-expectations-2827389-2025-11-28",
      "headline": "Meesho IPO opening on December 3: What investors need to knowMeesho IPO is all set to open for subscription, backed by strong GMP cues and rising investor interest, but can the value-commerce giant turn pre-listing hype into sustained market performance? Here is all you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-your-money-lying-unclaimed-here-is-how-delhis-new-campaign-help-you-recover-it-2827382-2025-11-28",
      "headline": "Is your money lying unclaimed? Here's how Delhi's new campaign help you recover itThe move is part of the Centre's ongoing 'Apki Punji, Apka Adhikar' campaign, which focuses on returning such funds to their rightful owners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sudeep-pharma-share-price-strong-ipo-listing-hold-sell-book-profit-2827376-2025-11-28",
      "headline": "Sudeep Pharma makes strong market debut. Hold or book profit now?A blockbuster debut has rewarded Sudeep Pharma IPO investors. Should you cash out while sentiment is high or hold on for the company's expansion and export growth story?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sudeep-pharma-ipo-listing-23-percent-premium-in-strong-stock-market-debut-2827332-2025-11-28",
      "headline": "Sudeep Pharma shares list at 23% premium in strong market debutThe Rs 895-crore issue, which was subscribed an extraordinary 93.71 times between November 21 and 25, opened at Rs 730 on the NSE and Rs 725 on the BSE, against the upper-end IPO price of Rs 593. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gail-share-price-today-pipeline-tariff-hike-impact-psu-stock-falls-2827323-2025-11-28",
      "headline": "GAIL share price tumbles 6%. Here's why the PSU stock is falling todayThe slump in GAIL's share price reflects investor disappointment over a tariff hike that landed far below expectations. With a full review pushed to 2028, the market is recalibrating its outlook on earnings support for the PSU major."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-pause-record-highs-2827304-2025-11-28",
      "headline": "Sensex, Nifty take breather after hitting record highsThe S&P BSE Sensex was up 65.92 points at 85,786.30 around 9:22 am, while the NSE Nifty50 slipped 16.65 points to 26,232.20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-zerodha-founder-and-ceo-nithin-kamath-says-crypto-derivatives-need-urgent-regulation-2827073-2025-11-27",
      "headline": "Why Zerodha's Nithin Kamath says crypto derivatives need urgent regulationKamath described the current state of crypto derivative exchanges as \"a bit like Schrödinger's cat — neither fully regulated nor unregulated.\" "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/cynthia-erivo-ariana-grande-in-non-demi-curious-semi-binary-relationship-see-here-2828165-2025-11-29",
      "headline": "Cynthia Erivo, Ariana Grande in 'non-demi-curious-semi-binary' relationship? Viral posts alleging a unique relationship between Hollywood actors Cynthia Erivo and Ariana Grande have surfaced on social media. Here's everything you need to know about their 'non-demi-curious semi-binary relationship' label."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-weekend-ka-vaar-written-update-salman-khan-evicts-ashnoor-kaur-for-hitting-tanya-mittal-2828145-2025-11-29",
      "headline": "Bigg Boss 19 Weekend Ka Vaar: Salman Khan evicts Ashnoor for hitting Tanya Ashnoor Kaur was evicted by 'Bigg Boss 19' host Salman Khan, a week before the grand finale. Her eviction comes after a physical altercation with co-contestant Tanya Mittal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-on-ott-when-and-where-to-stream-ranveer-singh-film-reports-2828131-2025-11-29",
      "headline": "Dhurandhar on OTT: When and where to stream Ranveer Singh's film, as per reports Details have emerged surrounding the OTT release of Ranveer Singh's film 'Dhurandhar'. The much-awaited film is slated for a theatrical release on December 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-film-chaudhary-aslam-widow-naureen-threatens-legal-action-film-portrayal-ranveer-singh-sanjay-dutt-2828114-2025-11-29",
      "headline": "Dhurandhar: Chaudhary Aslam's widow threatens legal action over film portrayal Naureen Aslam, the widow of Karachi police officer Chaudhary Aslam, has voiced her concern over his portrayal in the upcoming film 'Dhurandhar'. She threatened to take legal action if Chaudhary Aslam is misrepresented."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shatrughan-sinha-meets-sunny-bobby-deol-pays-tribute-to-dharmendra-throwback-pics-2828111-2025-11-29",
      "headline": "Shatrughan Sinha meets Deols, pays tribute to Dharmendra with throwback pics Veteran actor Shatrughan Sinha on Saturday reflected on his emotional visit to the home of late actor Dharmendra to meet his family. He remembered Dharmendra for the many lives he influenced and expressed deep admiration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urmila-matondkar-open-to-rangeela-remake-cinema-never-belonged-to-anybody-2828097-2025-11-29",
      "headline": "Urmila Matondkar open to Rangeela remake: Cinema never belonged to anybody Actor Urmila Matondkar is open to a remake of the film 'Rangeela', a project many fans consider untouchable. In a recent interview, she emphasised that cinema ultimately belongs to its audience and not any individual."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-emotional-note-kaun-banega-crorepati-team-dinner-father-harivansh-rai-bachchan-birth-anniversary-2828082-2025-11-29",
      "headline": "Big B shares emotional note after KBC team dinner on his father's birth anniversary Amitabh Bachchan admitted feeling emotional after a 'Kaun Banega Crorepati' team dinner unknowingly coincided with his father's birth anniversary. His late father, renowned poet Harivansh Rai Bachchan, was born on November 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fan-emotional-journey-to-meet-rajinikanth-goes-viral-watch-2828054-2025-11-29",
      "headline": "Rajinikanth fan's emotional journey to meet the superstar goes viral. Watch A video of a Rajinikanth fan detailing his experience meeting the superstar and obtaining his autograph has gained widespread attention on social media. The fan's story comes as Rajinikanth was recently honoured for 50 years in cinema at the 56th International Film Festival of India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vijay-varma-shares-surreal-moment-after-receiving-gulzar-saab-signed-note-2828055-2025-11-29",
      "headline": "Vijay Varma shares surreal moment after receiving Gulzar Saab's signed note Vijay Varma called it a \"surreal\" moment after receiving autographs and heartfelt encouragement from the legendary Gulzar Saab, a gesture he took days to process before sharing publicly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-sister-anisha-reportedly-to-wed-rohan-acharya-related-to-deols-bimal-roy-2828034-2025-11-29",
      "headline": "Deepika's sister Anisha reportedly to wed Rohan Acharya, related to Deols, Bimal Roy Deepika Padukone's sister Anisha Padukone is reportedly preparing to marry Rohan Acharya. Here's how the wedding will connect the Padukone family to the Deols and the lineage of renowned filmmaker Bimal Roy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-bhaang-marijuana-experience-why-he-swore-off-them-2828032-2025-11-29",
      "headline": "Anupam Kher recalls the time when he laughed for eight hours straight Veteran actor Anupam Kher recently shared hilarious stories from his youth involving marijuana and bhaang on a recent podcast, and spoke of the effects that led him to avoid such substances thereafter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tillotama-shome-jim-sarbh-goa-holiday-photos-spark-social-media-buzz-2828021-2025-11-29",
      "headline": "Tillotama Shome-Jim Sarbh's Goa holiday photos are trending. See pics Actors Tillotama Shome and Jim Sarbh have sparked dating rumours after sharing candid photos from their Goa vacation on Instagram, showing cosy and fun moments together. Fans quickly flooded the comments, speculating about a possible romance between the two Bollywood stars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/yami-gautam-celebrates-37th-birthday-on-film-set-shares-warm-thank-you-note-2828010-2025-11-29",
      "headline": "Yami Gautam celebrates 37th birthday on film set, shares warm thank you note Yami Gautam celebrated her 37th birthday on set and shared a heartfelt note saying \"working birthdays are one of the best,\" thanking fans and well-wishers for their love. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/jaya-bhattacharya-on-abusive-childhood-forced-to-act-beaten-with-hunter-shoes-2827999-2025-11-29",
      "headline": "Jaya Bhattacharya on abusive childhood: Forced to act; beaten with hunter, shoes Jaya Bhattacharya opened up about her traumatic childhood, sharing years of physical abuse from her mother and the impact of her parents' toxic marriage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/randeep-hooda-and-lin-laishram-announce-pregnancy-on-2nd-wedding-anniversary-2827988-2025-11-29",
      "headline": "Randeep Hooda and Lin Laishram announce pregnancy on 2nd wedding anniversary Randeep Hooda and Lin Laishram announced that they are expecting their first child as they marked their second wedding anniversary with a heartfelt Instagram post. The couple shared a dreamy bonfire picture and expressed their joy, calling their baby \"a little wild one on the way.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/choreographer-nandika-cheating-claims-smriti-palaash-wedding-put-on-hold-2827978-2025-11-29",
      "headline": "Choreographer Nandika on cheating claims after Smriti–Palaash wedding is put on hold Choreographer Nandika Dwivedi has denied cheating allegations after rumours linked her to Smriti Mandhana and Palash Muchhal's wedding being put on hold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/superstar-rajinikanth-wins-hearts-as-he-poses-with-paps-at-iffi-2025-red-carpet-2827987-2025-11-29",
      "headline": "Superstar Rajinikanth wins hearts as he poses with paps at IFFI 2025 red carpet Superstar Rajinikanth lit up the IFFI 2025 red carpet as he greeted and posed with paps, drawing massive attention from fans and media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vir-das-turns-lyricist-to-highlight-mumbai-pollution-with-a-witty-song-2827956-2025-11-29",
      "headline": "Vir Das turns lyricist to highlight Mumbai pollution with a witty song. Video Vir Das turned lyricist to highlight Mumbai's worsening smog, posting a witty song with lines like \"AQI, AQI, let me die\" that has humour with the city's pollution woes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tere-ishk-mein-box-office-collection-day-1-dhanush-kriti-sanon-film-earns-rs-1650-crore-2827932-2025-11-29",
      "headline": "Tere Ishk Mein box office Day 1: Dhanush-Kriti Sanon's film earns Rs 16.50 crore Tere Ishk Mein, starring Dhanush and Kriti Sanon, opened strongly at the box office with a Rs 16.50 crore collection on Day 1, supported by solid occupancy across major cities."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cyclone-ditwah-tightens-grip-landfall-in-tamil-nadu-in-24-hours-red-alert-issued-2827903-2025-11-29",
      "headline": "Red alert in Tamil Nadu, Puducherry, Andhra as Cyclone Ditwah set to make landfall Live UpdatesCyclone Ditwah is steadily advancing towards Tamil Nadu and Andhra Pradesh coasts, prompting high alert and extensive preparedness measures. The storm has already caused severe devastation in Sri Lanka, with India gearing up for potential impact and providing aid to its neighbour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-tensions-jaishankar-supply-diversification-self-reliance-2828171-2025-11-29",
      "headline": "Politics trumps economics: S Jaishankar's veiled dig at US amid trade tensionsJaishankar's comments come against the backdrop of recent trade disputes and steep US tariffs, including a 50 percent rate on Indian imports levied by US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russian-tankers-mayday-call-before-ukrainian-drone-attack-it-said-this-is-virat-need-help-2828122-2025-11-29",
      "headline": "This is Virat, need help: Russian tanker's mayday call before Ukrainian drone attackThe crew of the tanker had issued an open-frequency radio distress call reporting a \"drone attack,\" though they were actually referring to unmanned maritime drones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mahmood-madani-oppression-jihad-remark-judiciary-minority-rights-2828057-2025-11-29",
      "headline": "There will be jihad if oppression happens: Jamiat chief's shocking remarkJamiat Ulema-e-Hind chief Mahmood Madani triggered a political storm by saying \"if there is oppression, there will be jihad,\" while accusing the judiciary and government of undermining minority rights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/oxford-pakistan-wins-debate-against-india-never-meant-held-j-sai-deepak-priyanka-chaturvedi-farce-moosa-harraj-defence-links-2828037-2025-11-29",
      "headline": "Exposed: Pak's game of deceit against India in name of Oxford Union debatePakistan claimed that the Indian side pulled out of the Oxford Union debate, but connecting the dots suggests the debate was never meant to happen. It was a staged stunt, designed to show Indians as unwilling to engage in an open debate. Oxford Union President Moosa Harraj, the son of the Pakistani defence production minister, used the good ol' cheating playbook of Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-air-india-warn-of-delays-as-a320-glitch-hits-over-200-aircraft-in-india-glbs-2827877-2025-11-29",
      "headline": "Airbus A320 glitch: IndiGo's fleet modifications done, Air India nearing completionIndiGo announced that all 200 A320-family aircraft have completed the mandatory Airbus system upgrade, crediting its engineering and operations teams for carrying out the work without cancellations or major disruptions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zelenskyy-says-plan-to-end-war-with-dignity-possible-ahead-of-us-talks-glbs-2828176-2025-11-30",
      "headline": "Plan for dignified end to war possible as US shows constructive approach: ZelenskyyZelenskyy said Ukraine's delegation is heading to the US for Geneva-based talks, expressing optimism that both sides can soon agree on concrete steps toward a dignified and negotiated end to the war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/govt-tells-whatsapp-to-do-mandatory-sim-binding-log-out-users-every-6-hours-from-web-app-2828052-2025-11-29",
      "headline": "Soon, you can't WhatsApp anymore without an active SIM cardThe Indian government has introduced new rules requiring messaging apps to maintain active SIM linkage. This aims to enhance traceability and reduce cyber fraud but faces scepticism from experts over its effectiveness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/australian-prime-minister-anthony-albanese-marries-jodie-haydon-canberra-2828017-2025-11-29",
      "headline": "Anthony Albanese marries Jodie Haydon, is 1st Australian PM to be hitched in officeAnthony Albanese has married his partner of five years, Jodie Haydon, at a ceremony at the prime minister's official residence in Canberra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazons-siddharth-bhagat-breaks-down-indias-new-beauty-economy-from-global-trends-to-tech-led-discovery-2825952-2025-11-26",
      "headline": "Amazon's Siddharth Bhagat Breaks Down India's New Beauty Economy—From Global Trends to Tech-Led DiscoveryTracing India's changing beauty codes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-congress-leadership-tussle-rahul-gandhi-mallikarjun-kharge-delhi-talks-siddaramaiah-dk-shivakumar-2828098-2025-11-29",
      "headline": "Rahul Gandhi, Congress chief huddle on Karnataka riddle, decision likely in 2 daysDuring their Delhi meeting, Rahul Gandhi and Mallkarjun Kharge reviewed multiple options and assessed the political implications of any potential restructuring."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/arjun-meghwal-advocates-protection-act-lawyers-insurance-reforms-2828127-2025-11-29",
      "headline": "Law on protecting advocates being worked out, says Minister Arjun MeghwalUnion Law Minister Arjun Ram Meghwal said the Law Commission is actively working on the Advocates Protection Act and the government will meet on December 8 to discuss insurance for lawyers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/car-turns-into-fireball-on-mumbai-pune-highway-passengers-safe-2828160-2025-11-29",
      "headline": "Video: Car turns into fireball on Mumbai-Pune highway, passengers safeA speeding car caught fire on the Pune–Mumbai Expressway near the Amrutanjan Bridge around 12:30 pm, triggering panic but causing no injuries as all passengers managed to escape in time"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/from-serenity-to-celebration-gujarat-in-all-its-shades-2823221-2025-11-20",
      "headline": "From Serenity to Celebration - Gujarat in All Its ShadesAnother destination that has stood the test of time and modernisation is Vadnagar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/3-killed-2-injured-in-south-delhi-after-a-house-catches-fire-firefighters-bringing-blaze-under-control-2828157-2025-11-29",
      "headline": "3 killed after house catches fire in Delhi; blaze brought under controlThe fire first broke out at a shoe shop on the ground floor of the four-storeyed house and soon spread upwards, killing three."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/municipal-corporation-of-delhi-by-election-test-bjp-months-after-assembly-election-success-2828152-2025-11-29",
      "headline": "Delhi civic body bypolls big test for BJP months after Assembly election successThe voting will be held across 143 locations with around 580 polling booths set up for the electorate to cast their ballot beginning 7:30 am on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-film-chaudhary-aslam-widow-naureen-threatens-legal-action-film-portrayal-ranveer-singh-sanjay-dutt-2828114-2025-11-29",
      "headline": "Dhurandhar: Chaudhary Aslam's widow threatens legal action over film portrayalNaureen Aslam, the widow of Karachi police officer Chaudhary Aslam, has voiced her concern over his portrayal in the upcoming film 'Dhurandhar'. She threatened to take legal action if Chaudhary Aslam is misrepresented."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-547-28-11-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-cabinet-rejig-likely-next-month-jdu-may-get-six-more-cabinet-berths-following-bjps-three-2828109-2025-11-29",
      "headline": "Bihar cabinet rejig likely next month, JDU may get lion's shareAt present, the BJP has 17 ministers, the JD(U) has 15 (including the Chief Minister), the Lok Janashakti Party (LJP) has two, the Hindustan Awam Morcha (HAM) has one, and the Rashtriya Lok Samata Party (RLP) has one. The BJP is entitled to get three more ministers, and the JD(U) can go for three more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-1st-odi-predicted-playing-xi-ranchi-pitch-weather-2828075-2025-11-29",
      "headline": "1st ODI predicted XI: Pant vs Ruturaj  for middle-order spot in Ranchi?India (IND) vs South Africa (SA), 1st ODI predicted playing XI: With KL Rahul confirming he will continue to bat at No. 6, India have a few middle-order spots to fill. Yashasvi Jaiswal is expected to open with Rohit Sharma, while either Ruturaj Gaikwad or Rishabh Pant could slot in at No. 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rangeela-at-30-does-the-trendsetter-superhit-survive-new-age-scrutiny-2827644-2025-11-29",
      "headline": "Rangeela at 30: Does the trendsetter superhit survive new-age scrutiny?As Rangeela's 4K restoration lights up screens this November 28, Cinematic Saturday looks at the blueprint that changed it all, while analysing if its tropes pass in 2025?\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/consider-venezuelan-airspace-shut-for-you-trump-tells-drug-dealers-amid-standoff-with-nicolas-maduro-2828110-2025-11-29",
      "headline": "Consider Venezuelan airspace shut, Trump warns drug dealers amid tiff with MaduroThe Trump administration also recently designated Venezuela's Cartel of the Suns as a foreign terrorist organisation, alleging it is run by senior military officials and led by Maduro himself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-power-tussle-siddaramaiah-dk-shivakumar-breakfast-chief-minister-congress-high-command-2827979-2025-11-29",
      "headline": "We're united: Siddaramaiah, Shivakumar's bonhomie after breakfast meetSiddaramaiah and DK Shivakumar used a high-command-prompted breakfast meeting in Bengaluru to project unity, discuss 2028 election strategy and dismiss speculation of a leadership rift in Karnataka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/us-graduate-loan-rules-to-change-in-2026-new-limits-for-11-professional-degrees-2827707-2025-11-29",
      "headline": "US sets $200,000 loan cap for 11 graduate degrees under new 2026 rulesThe United States is preparing one of the most significant changes to graduate lending in more than a decade. The new framework will reshape borrowing limits, programme categories and access to federal loans for thousands of students."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/cynthia-erivo-ariana-grande-in-non-demi-curious-semi-binary-relationship-see-here-2828165-2025-11-29",
      "headline": "Cynthia Erivo, Ariana Grande in 'non-demi-curious-semi-binary' relationship?Viral posts alleging a unique relationship between Hollywood actors Cynthia Erivo and Ariana Grande have surfaced on social media. Here's everything you need to know about their 'non-demi-curious semi-binary relationship' label."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-on-ott-when-and-where-to-stream-ranveer-singh-film-reports-2828131-2025-11-29",
      "headline": "Dhurandhar on OTT: When and where to stream Ranveer Singh's film, as per reportsDetails have emerged surrounding the OTT release of Ranveer Singh's film 'Dhurandhar'. The much-awaited film is slated for a theatrical release on December 5. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-beat-oman-junior-hockey-world-cup-goal-fest-arshdeep-singh-manmeet-singh-chennai-2828170-2025-11-29",
      "headline": "India hammer Oman 17-0 to secure back-to-back Junior Hockey World Cup wins India stormed to their second straight Junior Hockey World Cup victory with a 17-0 demolition of Oman, powered by three hat-tricks and relentless attacking play in rain-hit Madurai as they moved closer to topping Pool B."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-blind-women-world-cup-champions-president-draupadi-murmu-signed-bat-2828169-2025-11-29",
      "headline": "President Murmu meets Blind Women's T20 World Cup champions, receives signed team bat India's Blind Women's T20 World Cup champions met President Droupadi Murmu at Rashtrapati Bhavan, gifting her an autographed bat as she honoured their historic unbeaten title run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/niki-poonacha-australian-open-2026-doubles-wildcard-kslta-reward-2828158-2025-11-29",
      "headline": "Niki Poonacha earns Australian Open doubles wildcard after Asia-Pacific playoff win Niki Kaliyanda Poonacha sealed a main-draw berth for the 2026 Australian Open men's doubles after winning the Asia-Pacific Wildcard Playoff with Thai partner Pruchya Isaro. The KSLTA announced a ₹1 lakh reward to celebrate the Indian's Grand Slam breakthrough."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/ind-vs-sa-kl-rahul-hails-return-of-rohit-kohli-eyes-fresh-start-after-test-whitewash-ytvd-2828156-2025-11-29",
      "headline": "IND vs SA ODI Series: KL Rahul Hails Return of Rohit, Kohli, Eyes Fresh Start After Test Whitewash In this special report, stand-in captain KL Rahul addresses the media ahead of India's three-match ODI series against South Africa in Ranchi. Following a disappointing 0-2 Test series whitewash, Rahul emphasises the need to 'forget what happened a week ago' and focus on winning. He welcomes the return of senior stalwarts Rohit Sharma and Virat Kohli, stating, 'Their importance at any point is huge. To have senior players in the team obviously makes the dressing room feel a lot more confident.' The report also details Shubman Gill's absence due to a neck injury and the likely inclusion of Yashasvi Jaiswal and Ruturaj Gaikwad in the playing XI. Rahul highlights the value of a settled team as India looks to bounce back on home soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-beat-sri-lanka-tri-series-final-shaheen-nawaz-babar-azams-chase-2828147-2025-11-29",
      "headline": "Shaheen, Nawaz and Babar star as Pakistan hammer Sri Lanka to win tri-series final Shaheen Afridi and Mohammad Nawaz picked up three wickets each before Babar Azam guided Pakistan's chase to a commanding six-wicket win over Sri Lanka in the tri-series final in Rawalpindi on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-criticises-india-pitches-no-real-off-spinner-after-ravichandran-ashwin-2828144-2025-11-29",
      "headline": "Harbhajan Singh criticises India's pitches, says no real off-spinner after Ashwin Harbhajan Singh criticised India's continued use of rank turners, saying such pitches limit the growth of both batters and bowlers. He also warned that India currently lack a specialist off-spinner after R. Ashwin's retirement, calling for more workload for Washington Sundar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-odi-series-livestreaming-fixtures-schedule-squad-2828143-2025-11-29",
      "headline": "IND vs SA, ODI series live-streaming, when and where to watch: All you need to know IND vs SA: India look to reset after a stinging 2–0 Test defeat as Rohit Sharma and Virat Kohli return for the ODI series against South Africa. With KL Rahul leading and de Kock in top form, the contest promises intensity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sl-tri-series-final-fakhar-zaman-argues-umpire-diving-catch-ruled-not-out-2828118-2025-11-29",
      "headline": "Fakhar Zaman argues with umpire after diving catch gets not-out Fakhar Zaman was left fuming at the on-field umpire after his stunning diving catch was ruled not out. The players even took a cheeky dig at the umpire in the very next delivery by appealing for a dismissal that was clean bowled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-quinton-de-kock-rohit-sharma-virat-kohli-effect-odi-series-ashwell-prince-2828106-2025-11-29",
      "headline": "Quinton de Kock brings the Ro-Ko effect to SA dressing room: Ashwell Prince IND vs SA: South Africa batting coach Ashwell Prince says Quinton de Kock gives his team the same stabilising presence Rohit Sharma and Virat Kohli provide India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/syed-modi-badminton-kidambi-srikanth-tanvi-sharma-gayatri-gopichand-treesa-2828105-2025-11-29",
      "headline": "Syed Modi: Kidambi Srikanth storms into final, Tanvi's dream run ends in semis Syed Modi International 2025: Former champion Kidambi Srikanth outclassed compatriot Mithun Manjunath to storm into the final. Young guns Tanvi Sharma and Unati Hooda lost in the women's singles semifinal in Lucknow on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/faf-du-plessis-ipl-2026-auction-pakistan-super-league-statement-2828099-2025-11-29",
      "headline": "Faf du Plessis pulls out of IPL 2026 auction, commits to playing in Pakistan Super League Faf du Plessis has pulled out of the IPL 2026 auction as he eyes a fresh new challenge in the Pakistan Super League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-odi-series-livestreaming-fixtures-schedule-squad-2828143-2025-11-29",
      "headline": "IND vs SA, ODI series live-streaming, when and where to watch: All you need to know IND vs SA: India look to reset after a stinging 2–0 Test defeat as Rohit Sharma and Virat Kohli return for the ODI series against South Africa. With KL Rahul leading and de Kock in top form, the contest promises intensity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sl-tri-series-final-fakhar-zaman-argues-umpire-diving-catch-ruled-not-out-2828118-2025-11-29",
      "headline": "Fakhar Zaman argues with umpire after diving catch gets not-out Fakhar Zaman was left fuming at the on-field umpire after his stunning diving catch was ruled not out. The players even took a cheeky dig at the umpire in the very next delivery by appealing for a dismissal that was clean bowled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-quinton-de-kock-rohit-sharma-virat-kohli-effect-odi-series-ashwell-prince-2828106-2025-11-29",
      "headline": "Quinton de Kock brings the Ro-Ko effect to SA dressing room: Ashwell Prince IND vs SA: South Africa batting coach Ashwell Prince says Quinton de Kock gives his team the same stabilising presence Rohit Sharma and Virat Kohli provide India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/syed-modi-badminton-kidambi-srikanth-tanvi-sharma-gayatri-gopichand-treesa-2828105-2025-11-29",
      "headline": "Syed Modi: Kidambi Srikanth storms into final, Tanvi's dream run ends in semis Syed Modi International 2025: Former champion Kidambi Srikanth outclassed compatriot Mithun Manjunath to storm into the final. Young guns Tanvi Sharma and Unati Hooda lost in the women's singles semifinal in Lucknow on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/faf-du-plessis-ipl-2026-auction-pakistan-super-league-statement-2828099-2025-11-29",
      "headline": "Faf du Plessis pulls out of IPL 2026 auction, commits to playing in Pakistan Super League Faf du Plessis has pulled out of the IPL 2026 auction as he eyes a fresh new challenge in the Pakistan Super League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-sri-lanka-tri-series-final-live-score-updates-scorecard-commentary-rawalpindi-2828091-2025-11-29",
      "headline": "Pakistan vs Sri Lanka highlights, T20I tri-series final updates from RawalpindiPakistan vs Sri Lanka highlights, T20I tri-series final: Pakistan went on to take a dominant six-wicket win thanks to a collective bowling display led by both Shaheen Afridi and Mohammad Nawaz. This was then followed by a calm chase led by Babar Azam with the bat to win by six wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-ryan-williams-oci-players-need-khalid-jamil-2828088-2025-11-29",
      "headline": "India need more players like Ryan Williams, but I need time to prepare: Khalid JamilIndia head coach Khalid Jamil has called for a wider pool of Indian-origin overseas players to lift the national team out of its worst phase in years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-1st-odi-predicted-playing-xi-ranchi-pitch-weather-2828075-2025-11-29",
      "headline": "1st ODI predicted XI: Pant vs Ruturaj  for middle-order spot in Ranchi?India (IND) vs South Africa (SA), 1st ODI predicted playing XI: With KL Rahul confirming he will continue to bat at No. 6, India have a few middle-order spots to fill. Yashasvi Jaiswal is expected to open with Rohit Sharma, while either Ruturaj Gaikwad or Rishabh Pant could slot in at No. 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/sultan-azlan-shah-cup-india-overpower-canada-14-3-enter-final-2828051-2025-11-29",
      "headline": "India overpower Canada 14–3 to enter Sultan Azlan Shah Cup finalIndia's men's hockey team sweeps Canada aside 14-3, clinching a place in the Sultan Azlan Shah Cup final through swift, relentless attacking and a flurry of goals that highlight clinical finishing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mark-wood-set-to-miss-2nd-ashes-test-in-brisbane-due-to-knee-injury-2828039-2025-11-29",
      "headline": "Mark Wood set to miss 2nd Ashes Test in Brisbane due to knee injury: ReportEngland fast bowler Mark Wood is likely to miss the second Ashes Test due to knee soreness. The first Test in Perth marked Wood's first competitive appearance since the Champions Trophy in February, where he bowled 11 overs in the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-odi-series-rohit-sharma-virat-kohli-different-energy-playing-in-india-temba-bavuma-2828040-2025-11-29",
      "headline": "Rohit, Kohli bring a different type of energy when playing in India: Temba BavumaIND vs SA ODIs: South Africa's captain, Temba Bavuma, believes that both Rohit Sharma and Virat Kohli bring a different type of energy, especially when playing in front of a home crowd, a challenge the Proteas skipper is looking forward to in the upcoming series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-sa-1st-odi-press-conference-kl-rahul-virat-kohli-rohit-sharma-2828029-2025-11-29",
      "headline": "Rohit Sharma, Virat Kohli make dressing room feel more confident: KL RahulIndia vs South Africa: KL Rahul, speaking to the press on the eve of the first ODI, welcomed the return of Rohit Sharma and Virat Kohli, emphasising their importance in the dressing room. The stand-in captain also discussed the team combination, with the likes of Rishabh Pant and Ruturaj Gaikwad available. Rahul further acknowledged the fading ability of India's Test batters to play spin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/sultan-azlan-shah-cup-india-overpower-canada-14-3-enter-final-2828051-2025-11-29",
      "headline": "India overpower Canada 14–3 to enter Sultan Azlan Shah Cup finalIndia's men's hockey team sweeps Canada aside 14-3, clinching a place in the Sultan Azlan Shah Cup final through swift, relentless attacking and a flurry of goals that highlight clinical finishing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mark-wood-set-to-miss-2nd-ashes-test-in-brisbane-due-to-knee-injury-2828039-2025-11-29",
      "headline": "Mark Wood set to miss 2nd Ashes Test in Brisbane due to knee injury: ReportEngland fast bowler Mark Wood is likely to miss the second Ashes Test due to knee soreness. The first Test in Perth marked Wood's first competitive appearance since the Champions Trophy in February, where he bowled 11 overs in the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-odi-series-rohit-sharma-virat-kohli-different-energy-playing-in-india-temba-bavuma-2828040-2025-11-29",
      "headline": "Rohit, Kohli bring a different type of energy when playing in India: Temba BavumaIND vs SA ODIs: South Africa's captain, Temba Bavuma, believes that both Rohit Sharma and Virat Kohli bring a different type of energy, especially when playing in front of a home crowd, a challenge the Proteas skipper is looking forward to in the upcoming series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-sa-1st-odi-press-conference-kl-rahul-virat-kohli-rohit-sharma-2828029-2025-11-29",
      "headline": "Rohit Sharma, Virat Kohli make dressing room feel more confident: KL RahulIndia vs South Africa: KL Rahul, speaking to the press on the eve of the first ODI, welcomed the return of Rohit Sharma and Virat Kohli, emphasising their importance in the dressing room. The stand-in captain also discussed the team combination, with the likes of Rishabh Pant and Ruturaj Gaikwad available. Rahul further acknowledged the fading ability of India's Test batters to play spin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-excited-for-ms-dhoni-ranchi-odi-south-africa-november-30-2828016-2025-11-29",
      "headline": "KL Rahul hints MS Dhoni could come to Ranchi ODI, lift crowd and team's energyIndia's stand in captain KL Rahul has said that MS Dhoni's attendance at the Ranchi for the first ODI against South Africa is expected to boost team spirit and excite fans alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-odi-kl-rahul-spin-struggles-learn-seniors-2828015-2025-11-29",
      "headline": "Indian batters have a problem vs spin, willing to learn from ex-players: KL RahulIndia vs South Africa: Speaking to the press on the eve of the Ranchi ODI, KL Rahul admitted that Indian batters are struggling against spin in Test cricket. The senior campaigner said the players are open to learning from former greats who were masters of playing spin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-backs-rishabh-pant-press-conferenece-south-africa-odi-series-2828011-2025-11-29",
      "headline": "Rishabh Pant good enough to play as a specialist batter: KL Rahul before Ranchi ODIIND vs SA: KL Rahul said Rishabh Pant is fully capable of playing as a specialist batter in the Ranchi ODI but confirmed that if Pant is in the XI, he will take the wicketkeeping gloves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/urvil-patel-gujarat-smat-chennai-super-kings-ms-dhoni-2827994-2025-11-29",
      "headline": "When in MS Dhoni sir's team, definition of success changes: Gujarat's Urvil PatelUrvil Patel has been retained by Chennai Super Kings for the IPL 2026 season. The aggressive wicketkeeper-batter began the Syed Mushtaq Ali Trophy tournament with a 31-ball hundred for Gujarat against Services on November 26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/milly-illingworth-mumbai-indians-wpl-contract-wbbl-bowling-figures-2026-season-2827995-2025-11-29",
      "headline": "After dream WPL deal, 20-year-old Australia pacer stuns with career-best WBBL spellMilly Illingworth earned her maiden WPL deal with the Mumbai Indians and celebrated it by producing her best-ever WBBL spell of 3 for 19 for the Melbourne Renegades. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/perth-stadium-pitch-criticism-usman-khawaja-cricket-australia-response-ashes-test-2827990-2025-11-29",
      "headline": "Usman Khawaja asked to explain Perth pitch comments by Cricket AustraliaAustralian opener Usman Khawaja has been called to explain his criticism of the Perth Stadium pitch, following remarks made after the first Ashes Test against England. Cricket Australia officials expressed dissatisfaction with Khawaja's comments, which described the surface in negative terms, despite the match referee rating it as 'very good.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-ab-de-villiers-on-jasprit-bumrah-workload-management-2827983-2025-11-29",
      "headline": "No Bumrah for home Tests? Ashwin, AB de Villiers send India pacer big messageFormer India all rounder Ravichandran Ashwin and former South Africa batter AB de Villiers have advised fast bowler Jasprit Bumrah to focus more on white-ball cricket and play only the crucial Test matches for India. Bumrah has been rested for three-match Test series against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-india-vs-south-africa-ranchi-odi-video-2827980-2025-11-29",
      "headline": "Watch: Virat Kohli rock solid in intense nets session before 1st ODI vs South AfricaIND vs SA: Veteran batter Virat Kohli looked in superb touch during an intense Ranchi nets session, signalling strong form and confidence ahead of the first ODI against South Africa.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}