{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-proposes-stricter-digital-banking-rules-what-it-means-for-you-2759405-2025-07-22",
      "headline": "RBI proposes stricter digital banking rules: What it means for youTo keep online fraud in check, all banks must use proper fraud detection tools and keep an eye on unusual transactions. They should also study how customers usually spend money so that any odd activity can be spotted quickly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/astronomer-now-a-household-name-new-ceos-first-statement-after-kiss-cam-scandal-2759370-2025-07-22",
      "headline": "Astronomer now a household name: New CEO's first statement after kiss-cam scandalFormer CEO Andy Byron stepped down days after a video of him and Chief People Officer Kristin Cabot appearing on a 'kiss cam' at a Coldplay concert near Boston went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-ban-sebi-removal-with-conditions-investigation-ongoing-stock-market-manipulation-2759369-2025-07-22",
      "headline": "Sebi clears Jane Street to resume trading, with strings attachedJane Street was allowed to return to the markets after it complied with a key part of Sebi's interim order. The firm deposited Rs 4,844 crore in an escrow account held with a scheduled commercial bank in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-shares-see-sharp-rally-after-q1-results-buy-sell-or-hold-2759367-2025-07-22",
      "headline": "Eternal shares see sharp rally after Q1 results. Buy, sell or hold?The rally comes on the back of strong performance across verticals, with quick commerce overtaking food delivery in terms of Net Order Value (NOV) for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-shares-jump-14-after-q1-results-check-target-price-brokerage-views-2759364-2025-07-22",
      "headline": "Eternal shares jump 14% after Q1 results. Check target price, brokerage viewsThe stock rose 13.38% to Rs 307.50 on the Bombay Stock Exchange at 9:34 am, crossing the Rs 300 milestone for the first time and extending its recent upward trajectory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-finance-md-anup-kumar-resigns-fuels-buzz-around-indusind-bank-ceo-role-2759355-2025-07-22",
      "headline": "Bajaj Finance MD Anup Kumar Sinha resigns amid IndusInd Bank CEO role buzBajaj Finance shares were up 0.82% on the Bombay Stock Exchange around 9:17 am, while IndusInd Bank rose nearly 2.4%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-rally-sensex-opens-267-points-higher-nifty-above-25100-eternal-jumps-10-2759351-2025-07-22",
      "headline": "Sensex opens 267 points higher, Nifty above 25,100; Eternal jumps 10%The S&P BSE Sensex was up by 204.96 points to 82,405.30, while the NSE Nifty5o gained 43.90 points to 25,123.55 as of 9:30 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-paid-auto-sector-ceo-salary-pawan-munjal-hero-rajiv-bajaj-anish-shah-mahindra-jayadev-galla-2759339-2025-07-22",
      "headline": "Pawan Munjal top paid auto sector CEO in India. Check others on the listHero MotoCorp chairman and managing director Pawan Munjal remained the highest-paid auto sector CEO in FY25. His total pay stood at Rs 109.41 crore, the same as in FY24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-update-news-government-starts-talks-with-states-ministries-da-hike-salary-news-2759330-2025-07-22",
      "headline": "8th Pay Commission update: Government kickstarts talks with states, ministriesThe government adjusts the salaries of employees and pensioners through dearness allowance (DA), which is reviewed every six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/mango-millionaire-makes-money-feel-relatable-radhika-gupta-niranjan-awasthi-2758912-2025-07-21",
      "headline": "From Bollywood to dal-chawal, Mango Millionaire makes money feel relatable'Mango Millionaire' turns personal finance into a relatable conversation, using Bollywood, family meals, and everyday metaphors to explain money matters. It's simple, practical, and feels more like advice from a friend than a finance manual."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/louis-vuitton-faces-scrutiny-over-hong-kong-data-leak-2759100-2025-07-21",
      "headline": "Louis Vuitton faces scrutiny over Hong Kong data leakHong Kong's Office of the Privacy Commissioner for Personal Data said on Monday that it has started an investigation into how this happened and whether the company told the authorities on time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/salary-survey-2025-foundit-appraisals-done-not-enough-employees-want-to-change-jobs-2759058-2025-07-21",
      "headline": "Over 85% of employees plan to change jobs after salary hikes in 2025: SurveyMost hikes fell in the 5–10% range, with only a small fraction crossing the 20% mark. Advertising, education, and IT saw the highest share of professionals reporting no hike at all, while sectors like energy and BFSI offered relatively better payouts."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hrithik-roshan-jr-ntr-war-2-trailer-to-release-on-this-day-mark-your-calendars-2759407-2025-07-22",
      "headline": "Hrithik Roshan-Jr NTR's War 2 trailer to release on this day - mark your calendars!The trailer for 'War 2', starring Hrithik Roshan, Jr NTR and Kiara Advani, will release this month. The film is set for a grand release on August 14 as a big Independence Day experience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-4-detailed-report-yrf-unlocks-smashing-monday-rs-150-crore-week-ahead-2759403-2025-07-22",
      "headline": "Saiyaara box office Day 4: YRF unlocks smashing Monday, Rs 150 crore week aheadSaiyaa box office Day 4: YRF's new love story is winning the hearts of the audience. The Mohit Suri-directorial has already crossed the benchmark of Rs 100 crore and is looking at wrapping up its first week at around Rs 150 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashish-chanchlani-denies-dating-elli-avrram-calls-her-difficult-to-work-with-music-video-chaandaniya-2759380-2025-07-22",
      "headline": "Ashish Chanchlani says he could never date Elli AvrRam. Here's whyInfluencer Ashish Chanchlani and actor Elli AvrRam addressed dating rumours in a recent live session on Instagram. Chanchlani denied dating the actor and shared the challenges of working with her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-flies-to-sri-lanka-for-daughters-birthday-before-ssmb29-shoot-2759135-2025-07-22",
      "headline": "Mahesh Babu flies to Sri Lanka for a quick getaway with family amid SSMB 29 shootTelugu actor Mahesh Babu flew to Sri Lanka with his family to celebrate daughter Sitara's birthday. The actor will resume shooting for SS Rajamouli's 'SSMB 29' soon, with Priyanka Chopra, Prithviraj and R Madhavan likely to join the ensemble cast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-clears-rs-600-premiere-ticket-hikes-for-pawan-kalyans-hari-hara-veera-mallu-despite-revanth-reddys-earlier-ban-after-pushpa-2-stampede-allu-arjun-2759386-2025-07-22",
      "headline": "Telangana okays premiere, price hike for Pawan Kalyan film despite Pushpa 2 tragedyThe Telangana government approved a Rs 600 premiere and ticket hikes for Pawan Kalyan's Hari Hara Veera Mallu, sparking a political row. This contradicts Revanth Reddy's earlier vow to ban such privileges after the Pushpa 2 stampede. Producer AM Rathnam credited Rohin Reddy, Revanth Reddy's aide, for securing permissions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shraddha-kapoor-varun-dhawan-ranveer-singh-praise-ahaan-panday-aneet-padda-film-saiyaara-2759346-2025-07-22",
      "headline": "Saiyaara se Aashiqui: Shraddha, Varun and Ranveer praise Ahaan and Aneet's filmActors Shraddha Kapoor, Varun Dhawan and Ranveer Singh have praised the recently released 'Saiyaara' on social media. The film stars newcomers Ahaan Panday and Aneet Padda in lead roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ramayana-hopes-mahavatar-narasimha-director-ashwin-kumar-exclusive-2759368-2025-07-22",
      "headline": "All hopes on Ramayana now: Mahavatar Narsimha director Ashwin Kumar | ExclusiveAshwin Kumar reflects on the setbacks of Adipurush and the enduring appeal of Bharat's ancient stories. He shares optimism about the high-budget Ramayana duologyand the growing demand for culturally rooted Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-fahadh-faasil-nazriya-nazim-hridayapoorvam-moment-2759350-2025-07-22",
      "headline": "Mohanlal, Fahadh and Nazriya's night to remember after viral Hridayapoorvam momentMohanlal, his family, Fahadh Faasil and Nazriya enjoyed a get-together with their friends. This celebration comes after the release of 'Hridayapoorvam' teaser."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/avatar-fire-and-ash-introduces-new-villain-varang-see-first-look-poster-2759327-2025-07-22",
      "headline": "Avatar Fire and Ash introduces new villain Varang. See first look posterThe first-look poster for the much-anticipated film 'Avatar: Fire and Ash' was released on Tuesday. It introduces a new villain, Varang, who will be portrayed by actor Oona Chaplin. The film's trailer will be shown in cinemas with the release of 'The Fantastic Four: First Steps' on July 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-embraces-femininity-mammootty-gay-kaathal-malayalam-superstars-redefine-heroism-2758928-2025-07-22",
      "headline": "Mohanlal embraces femininity, Mammootty plays gay: How superstars redefine heroismMohanlal wore diamond jewellery and struck feminine poses in a recent commercial for a jewellery brand. Mammootty, on the other hand, was praised for playing a homosexual in 'Kaathal'. The two Malayalam superstars are redefining heroism with inclusive choices.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-twirls-her-way-into-our-hearts-from-london-holiday-with-ranbir-kapoor-2759319-2025-07-22",
      "headline": "Alia Bhatt twirls her way into our hearts from London holiday with Ranbir KapoorAlia Bhatt gave a glimpse of her London holiday with her husband, Ranbir Kapoor, and daughter, Raha Kapoor. Sharing a cute reel, she called herself 'twirl girl'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/siddhant-chaturvedi-triptii-dimri-dhadak-2-eyes-august-1-release-to-clash-with-ajay-devgn-son-of-sardaar-2-2759313-2025-07-22",
      "headline": "Siddhant-Triptii's Dhadak 2 eyes August 1 release, to clash with Son of Sardaar 2Amid reports of speculation, Siddhant Chaturvedi and Triptii Dimri's 'Dhadak 2' will release on August 1. The makers confirmed the film's release date along with the release of the second single."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sushmita-sen-ex-rohman-shawl-gift-22-carat-diamond-meri-aukaat-nahi-bollywood-2759178-2025-07-21",
      "headline": "Sushmita Sen's ex Rohman on gifting her the diamond she wants: Meri aukaat nahiActor Rohman Shawl recently opened up about ex-Sushmita Sen's love for diamonds. He also spoke about the possibility of gifting expensive diamonds to Sushmita. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-bts-video-ahaan-panday-aneet-share-warm-moments-mohit-suri-emotional-2759143-2025-07-21",
      "headline": "Ahaan Panday-Aneet share warm moments as Mohit Suri tears up in Saiyaara BTS videoA viral video from the last day shoot of 'Saiyaara' captures director Mohit Suri getting emotional. The BTS clip also shows actors Ahaan Panday and Aneet Padda in a warm hug. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-sponsors-her-cook-dilips-childrens-english-medium-education-2759182-2025-07-21",
      "headline": "Farah Khan sponsors her cook Dilip's children's English-medium educationFarah Khan shared in her vlog that she is supporting her cook Dilip's children by enrolling them in an English-medium school and getting one of them a culinary diploma. She said that her aim is to help them build a better future and work in good places instead of doing domestic work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-jisoo-wins-outstanding-asian-star-newtopia-seoul-drama-awards-2759180-2025-07-21",
      "headline": "BLACKPINK's Jisoo wins outstanding Asian star at Seoul Drama AwardsJisoo has bagged her first major acting award for 'Newtopia', earning the title of Outstanding Asian Star. Her win has sent BLACKPINK fans into a celebratory frenzy online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kalki-koechlin-recalls-casting-couch-experiences-2759139-2025-07-21",
      "headline": "Kalki Koechlin recalls casting couch experiences, says producer wanted to know meKalki Koechlin opened up about her personal experiences with casting couch incidents, both before and after joining the film industry. She highlighted how such encounters have a lasting impact and emphasised the need to acknowledge and address them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prithviraj-sukumaran-patriotism-pride-indian-sarzameen-jiocinema-premiere-2759133-2025-07-21",
      "headline": "Prithviraj Sukumaran on patriotism: I am proud of the fact that I am IndianPrithviraj Sukumaran expresses his strong pride in being Indian and redefines patriotism. His upcoming film 'Sarzameen' explores themes of national duty and personal sacrifice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tara-sutaria-veer-pahariyas-my-and-mine-game-on-instagram-sparks-dating-rumours-2759066-2025-07-21",
      "headline": "Tara Sutaria-Veer Pahariya's my and mine game on Instagram sparks dating rumoursActor Tara Sutaria's reply to Veer Pahariya's comment has sparked dating rumours. Fans speculate that it is more than friendship."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-president-jagdeep-dhankhar-rajya-sabha-business-advisory-jp-nadda-kiren-rijiju-parliament-2759363-2025-07-22",
      "headline": "Jagdeep Dhankhar 'snubbed'? Row over Nadda, Kiren Rijiju skipping key House meetJagdeep Dhankhar was allegedly disappointed over the absence of key ministers JP Nadda and Kiren Rijiju at the crucial Business Advisory Committee meeting on Monday evening.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-2025-live-bihar-sir-pahalgam-oppsition-mps-lok-sabha-rahul-gandhi-modi-2759323-2025-07-22",
      "headline": "Live: Jagdeep Dhankhar skips chairing Rajya Sabha after late-night resignationParliament Session Live Updates: The Monsoon Session resumed at 11 am on Tuesday after a stormy start marked by repeated adjournments and Jagdeep Dhankhar's surprise resignation as the Vice President. There was a meeting of floor leaders of both Lok Sabha and Rajya Sabha, with Leader of Opposition Rajya Sabha Mallikarjun Kharge and Leader of Opposition Lok Sabha Rahul Gandhi present. Several opposition MPs have moved adjournment notices seeking a debate on alleged irregularities in Bihar's voter rolls. Meanwhile, a motion to remove a High Court judge Yashwant Varma, signed by several opposition MPs, has been filed with the Rajya Sabha Chairman. A similar notice, backed by 152 MPs including Rahul Gandhi, has gone to the Lok Sabha Speaker. Sources said both Houses may admit the motions and begin forming an inquiry committee under the Judges (Inquiry) Act. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-president-jagdeep-dhankar-resigns-health-reasons-political-speculation-congress-india-bloc-parliament-lok-sabha-rajya-sabha-monsoon-2759318-2025-07-22",
      "headline": "Despite frequent run-ins, why Veep's surprise exit left Opposition in disbeliefVice President Jagdeep Dhankhar's sudden resignation citing health reasons has taken both the ruling and opposition parties by surprise. The unexpected move has triggered intense speculation and prompted swift strategic huddles among political leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/serious-matter-centre-approaches-top-court-against-high-court-verdict-acquitting-mumbai-train-blasts-accused-2759401-2025-07-22",
      "headline": "Mumbai train blasts acquittals challenged in Supreme Court, hearing on July 24The Bombay High Court flagged torture allegations and lack of evidence to acquit 12 men in the 2006 Mumbai blasts case, a ruling the Maharashtra Police has now challenged in the Supreme Court."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uk-royal-navys-f-35-flies-out-of-keralas-thiruvananthapuram-airport-after-being-stranded-for-37-days-2759389-2025-07-22",
      "headline": "After month-long snag in Kerala, British F-35 fighter jet finally flies homeAfter being grounded for over a month due to a technical glitch, the British F-35 fighter jet stationed at Thiruvananthapuram International Airport finally flies back home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/decades-before-epsteins-arrest-accuser-maria-farmer-told-fbi-to-investigate-trump-report-glbs-2759298-2025-07-22",
      "headline": "Kept staring at my legs: Epstein accuser recalls late-night encounter with TrumpAccording to Maria Farmer, an artist, Trump kept staring at her legs when she visited Jeffrey Epstein's Manhattan office in 1996."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-pulls-up-cbi-dont-have-guts-misses-indiabulls-housing-finance-hearing-2759344-2025-07-22",
      "headline": "Don't even have guts to come here? Supreme Court blasts CBI for no-showThe top court was hearing a petition challenging the Delhi High Court's order rejecting a plea for a court-monitored probe into allegations of siphoning of funds by Indiabulls Housing Finance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/in-narendra-modis-kali-durga-stage-cry-a-new-bjp-vocabulary-for-bengal-2759065-2025-07-21",
      "headline": "In Modi's 'Kali-Durga' stage-cry, a new BJP vocabulary for Bengal?Ram-centric Hindutva not delivering to promise, so the BJP's pivot to foreground Bengal's most-revered deities to culturally align itself to the softer Hindu voter"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-embraces-femininity-mammootty-gay-kaathal-malayalam-superstars-redefine-heroism-2758928-2025-07-22",
      "headline": "Mohanlal embraces femininity, Mammootty plays gay: How superstars redefine heroismMohanlal wore diamond jewellery and struck feminine poses in a recent commercial for a jewellery brand. Mammootty, on the other hand, was praised for playing a homosexual in 'Kaathal'. The two Malayalam superstars are redefining heroism with inclusive choices.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gita-gopinath-to-leave-imf-in-august-return-to-harvard-as-professor-glbs-2759299-2025-07-22",
      "headline": "Gita Gopinath to leave IMF in August, return to Harvard as professorGopinath will become the inaugural Gregory and Ania Coffey Professor of Economics in Harvard's Department of Economics. She first joined the IMF in 2019 as Chief Economist. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/astronomer-now-a-household-name-new-ceos-first-statement-after-kiss-cam-scandal-2759370-2025-07-22",
      "headline": "Astronomer now a household name: New CEO's first statement after kiss-cam scandalFormer CEO Andy Byron stepped down days after a video of him and Chief People Officer Kristin Cabot appearing on a 'kiss cam' at a Coldplay concert near Boston went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/monsoon-brain-fog-effects-working-professionals-mental-sharpness-tips-2759134-2025-07-22",
      "headline": "Monsoon brain fog is real: The hidden effects of high humidity on your mindOn World Brain Day, neurologist Dr. Santosh Sontakke decodes the effects of monsoon on the brain, affecting memory and focus, especially among working professionals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-maoist-insurgency-affected-gadchiroli-moved-on-from-rifle-bore-to-iron-ore-2759300-2025-07-22",
      "headline": "How Gadchiroli moved on from rifle bore to iron oreOnce a stronghold of Maoists, Gadchiroli is now witnessing a shift towards progress with the launch of an iron ore beneficiation plant, a state-of-the-art hospital, and a school, along with a makeshift film theatre. Infrastructure growth in the most infamous Red Corridor district shows how India is winning against what was once considered the country's biggest internal security threat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/vellapally-natesan-urges-hindu-women-in-kerala-to-have-more-children-warns-of-muslims-becoming-majority-and-political-bias-ldf-udf-sndp-2759375-2025-07-22",
      "headline": "Kerala leader urges Hindu women to have more children, warns of Muslim majorityVellapally Natesan, a Hindu community leader in Kerala, urged Hindu women to have more children, warning the state could soon be Muslim-majority. He criticised political parties for favouring Muslims. Natesan cited demographic shifts in assembly seats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bihar-sir-voter-list-revision-citizenship-aadhaar-election-commission-supreme-court-2759322-2025-07-22",
      "headline": "Poll body says no to Aadhaar in Bihar roll revision, clarifies citizenship issueThe Election Commission's response was to charges by the opposition that the SIR in Bihar was a 'citizenship screening' exercise and would lead to mass disenfranchisement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/up-teacher-massages-head-plays-songs-in-class-bulandshahr-viral-video-2759392-2025-07-22",
      "headline": "Viral video shows UP teacher applying hair oil in classroom as students watchA primary school teacher from UP's Bulandshahr was suspended after a video of her oiling her hair and playing Bollywood songs in class while students sat silently went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nisar-launch-how-this-nasa-isro-mission-will-scan-entire-earth-in-12-days-2759413-2025-07-22",
      "headline": "Nisar launch: This Nasa-Isro mission will scan entire Earth in 12 daysThe NISAR satellite, with a mass of 2,392 kg, will be launched aboard Isro's GSLV-F16 rocket from the Satish Dhawan Space Centre (SDSC SHAR) in Sriharikota. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saharanpur-mla-rajeev-gumber-takes-out-cash-pocket-power-department-meeting-video-2759385-2025-07-22",
      "headline": "No 'funds' to remove poles from middle of road, UP MLA gives cash from pocketThe incident happened after power department officials cited a cash crunch for not removing two electric poles that had come up in the middle of a road. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-rivals-ideate-nitish-kumar-inks-the-script-behind-the-bihar-election-sop-story-2025-bihar-assembly-elections-2759029-2025-07-21",
      "headline": "What rivals ideate, Nitish inks: The script behind the Bihar election sop storyCall him a borrower of plans or a master of the political long game, Nitish Kumar may well be turning Opposition blueprints into a poll-winning manifesto of his own"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/avatar-fire-and-ash-introduces-new-villain-varang-see-first-look-poster-2759327-2025-07-22",
      "headline": "Avatar Fire and Ash introduces new villain Varang. See first look posterThe first-look poster for the much-anticipated film 'Avatar: Fire and Ash' was released on Tuesday. It introduces a new villain, Varang, who will be portrayed by actor Oona Chaplin. The film's trailer will be shown in cinemas with the release of 'The Fantastic Four: First Steps' on July 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/scientists-decode-molecular-secret-behind-hair-loss-regrowth-without-transplant-2759077-2025-07-21",
      "headline": "New hair loss discovery from India could end the need for transplantsThey found five key systems in the body that manage the hair growth cycle. In people with hair loss, these systems stop talking to each other properly, causing hair follicles to \"go to sleep.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-backs-washington-sundar-india-test-all-rounder-2759356-2025-07-22",
      "headline": "Ravi Shastri backs Washington Sundar to be genuine all-rounder for many yearsFormer India coach Ravi Shastri has endorsed Washington Sundar as a long-term all-rounder in Test cricket. Sundar's potential and performances suggest he could become a key player if given more opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-president-jagdeep-dhankhar-resigns-health-reasons-political-speculation-2759294-2025-07-22",
      "headline": "Far more than meets the eye: Opposition stunned by Jagdeep Dhankhar's resignationSenior Congress leader Jairam Ramesh said while Jagdeep Dhankhar's health should indeed be prioritised, there were suspicions of underlying motives for his resignation. Ramesh, however, cautioned against any speculation at this stage, emphasising the need for clarity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hrithik-roshan-jr-ntr-war-2-trailer-to-release-on-this-day-mark-your-calendars-2759407-2025-07-22",
      "headline": "Hrithik Roshan-Jr NTR's War 2 trailer to release on this day - mark your calendars!The trailer for 'War 2', starring Hrithik Roshan, Jr NTR and Kiara Advani, will release this month. The film is set for a grand release on August 14 as a big Independence Day experience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-4-detailed-report-yrf-unlocks-smashing-monday-rs-150-crore-week-ahead-2759403-2025-07-22",
      "headline": "Saiyaara box office Day 4: YRF unlocks smashing Monday, Rs 150 crore week aheadSaiyaa box office Day 4: YRF's new love story is winning the hearts of the audience. The Mohit Suri-directorial has already crossed the benchmark of Rs 100 crore and is looking at wrapping up its first week at around Rs 150 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashish-chanchlani-denies-dating-elli-avrram-calls-her-difficult-to-work-with-music-video-chaandaniya-2759380-2025-07-22",
      "headline": "Ashish Chanchlani says he could never date Elli AvrRam. Here's whyInfluencer Ashish Chanchlani and actor Elli AvrRam addressed dating rumours in a recent live session on Instagram. Chanchlani denied dating the actor and shared the challenges of working with her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-flies-to-sri-lanka-for-daughters-birthday-before-ssmb29-shoot-2759135-2025-07-22",
      "headline": "Mahesh Babu flies to Sri Lanka for a quick getaway with family amid SSMB 29 shootTelugu actor Mahesh Babu flew to Sri Lanka with his family to celebrate daughter Sitara's birthday. The actor will resume shooting for SS Rajamouli's 'SSMB 29' soon, with Priyanka Chopra, Prithviraj and R Madhavan likely to join the ensemble cast. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-burns-emotional-reaction-italy-reach-icc-t20-world-cup-2026-2759418-2025-07-22",
      "headline": "Really proud of this group: Burns emotional after leading Italy to T20 World CupProudly guiding Italy to their first-ever ICC Men's T20 World Cup qualification, Joe Burns called it one of the most emotional and meaningful moments of his cricketing journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-england-vs-india-ricky-ponting-rahul-dravid-4th-test-2759419-2025-07-22",
      "headline": "Joe Root aims to kill three birds with one stone, eyes massive jumpENG vs IND, 4th Test: Joe Root has the chance to become the second-highest run-scorer in Test cricket, going past Ricky Ponting, Jacques Kallis and Rahul Dravid. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-joins-list-of-marquee-withdrawals-from-canadian-open-2759394-2025-07-22",
      "headline": "Carlos Alcaraz withdraws from Canadian Open citing muscle fatigueWorld No.2 Carlos Alcaraz has joined the growing list of top players withdrawing from next week's Canadian Open in Toronto, citing the need to recover from muscle issues following his defeat to Jannik Sinner in the Wimbledon final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-test-team-pace-bowling-confusion-kamboj-recalled-manchester-test-2759371-2025-07-22",
      "headline": "Aakash Chopra questions Indian team management over Kamboj-Rana confusionFormer India opener Aakash Chopra has raised concerns over the Indian men's Test team management, calling out the lack of clarity in their handling of pace bowling options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/video/breaking-kayfabe-cm-punk-rhea-ripley-on-wwe-unreal-aj-lee-return-2759281-2025-07-22",
      "headline": "Breaking kayfabe: CM Punk, Rhea Ripley on WWE Unreal, AJ Lee returnSpeaking exclusively to India Today, WWE Superstars CM Punk and Rhea Ripley opened up on WWE's new docuseries on NetFlix 'WWE: Unreal' and how breaking kayfabe meant for them. The duo also commented on AJ Lee's potential return to the company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-backs-washington-sundar-india-test-all-rounder-2759356-2025-07-22",
      "headline": "Ravi Shastri backs Washington Sundar to be genuine all-rounder for many yearsFormer India coach Ravi Shastri has endorsed Washington Sundar as a long-term all-rounder in Test cricket. Sundar's potential and performances suggest he could become a key player if given more opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zheng-qinwen-us-open-elbow-surgery-2759357-2025-07-22",
      "headline": "Paris gold medallist Zheng Qinwen pulls out of US Open after elbow surgeryUS Open 2025: China's Zheng Qinwen has withdrawn from the upcoming hard-court major following elbow surgery and will not compete in the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/cm-punk-rhea-ripley-netflix-unreal-john-cena-aj-lee-return-2759224-2025-07-22",
      "headline": "Punk, Ripley keep it Unreal: WWE stars on Netflix docuseries, Cena and moreIn an exclusive interaction with India Today, CM Punk and Rhea Ripley showed off their real-life personas and talked about WWE's new docuseries on NetFlix, John Cena and the return of AJ Lee to the company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-sign-bryan-mbeumo-reaction-brentford-premier-league-2759328-2025-07-22",
      "headline": "Bryan Mbeumo completes Manchester United move: Club of my dreamsManchester United have signed forward Bryan Mbeumo from Brentford until 2030, with the option to extend for a further year, United said on Monday. United paid 65 million pounds ($88 million) to Brentford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-brendon-mccullum-england-vs-india-lords-2759333-2025-07-22",
      "headline": "No more nice guys: Brook on how McCullum encouraged England at Lord'sENG vs IND: Harry Brook said how Brendon McCullum motivated England not to be the guys in the Lord's Test, which the home team narrowly won by 22 runs to go 2-1 up in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brydon-carse-england-lords-test-2759320-2025-07-22",
      "headline": "England showed at Lord's that they can adapt and adjust: Brydon CarseENG vs IND: Brydon Carse said that England were happy with their approach in the Lord's Test, which they had won by 22 runs to take a crucial 2-1 lead in the five-match series. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zheng-qinwen-us-open-elbow-surgery-2759357-2025-07-22",
      "headline": "Paris gold medallist Zheng Qinwen pulls out of US Open after elbow surgeryUS Open 2025: China's Zheng Qinwen has withdrawn from the upcoming hard-court major following elbow surgery and will not compete in the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/cm-punk-rhea-ripley-netflix-unreal-john-cena-aj-lee-return-2759224-2025-07-22",
      "headline": "Punk, Ripley keep it Unreal: WWE stars on Netflix docuseries, Cena and moreIn an exclusive interaction with India Today, CM Punk and Rhea Ripley showed off their real-life personas and talked about WWE's new docuseries on NetFlix, John Cena and the return of AJ Lee to the company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-sign-bryan-mbeumo-reaction-brentford-premier-league-2759328-2025-07-22",
      "headline": "Bryan Mbeumo completes Manchester United move: Club of my dreamsManchester United have signed forward Bryan Mbeumo from Brentford until 2030, with the option to extend for a further year, United said on Monday. United paid 65 million pounds ($88 million) to Brentford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-brendon-mccullum-england-vs-india-lords-2759333-2025-07-22",
      "headline": "No more nice guys: Brook on how McCullum encouraged England at Lord'sENG vs IND: Harry Brook said how Brendon McCullum motivated England not to be the guys in the Lord's Test, which the home team narrowly won by 22 runs to go 2-1 up in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brydon-carse-england-lords-test-2759320-2025-07-22",
      "headline": "England showed at Lord's that they can adapt and adjust: Brydon CarseENG vs IND: Brydon Carse said that England were happy with their approach in the Lord's Test, which they had won by 22 runs to take a crucial 2-1 lead in the five-match series. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}