{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-iphone-600-ton-airlift-india-to-us-amid-trump-tariff-china-import-why-reason-explained-2707997-2025-04-12",
      "headline": "Why is Apple in a race against time to fly iPhones back to the US?Apple's long-term goal is to reduce its dependence on Chinese factories and shift more production to other countries, with India playing a big part in that plan.  However, it relies heavily on a network of suppliers and trained workers that only exists at the required scale in parts of Asia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-whatsapp-channel-qr-code-number-heres-how-to-access-banking-digital-safety-2707973-2025-04-12",
      "headline": "RBI launches WhatsApp Channel: Here's how to access it via QR codeThe RBI said that the goal of the WhatsApp channel is to provide verified and timely information about banking, digital safety, and other important topics directly to users. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pentagon-ends-5-billion-contracts-accenture-deloitte-pete-hegseth-2707949-2025-04-12",
      "headline": "Pentagon cuts $5.1 billion contracts with Accenture, Deloitte: Wasteful spendingThe contracts appeared to be wide-ranging cuts to consulting services for the Navy, the Air Force, the Defense Advanced Research Projects Agency (DARPA) and the Defense Health Agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-bounces-back-after-wild-week-fueled-by-tariff-war-2707818-2025-04-12",
      "headline": "Wall Street bounces back after wild week fueled by tariff warAll three major US indexes ended the session sharply higher after assurances from Boston Federal Reserve President Susan Collins that the Fed is prepared to keep financial markets functioning should the need arise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-pushing-trade-deals-with-us-eu-with-high-urgency-s-jaishankar-trump-tariffs-2707776-2025-04-11",
      "headline": "India pushing for trade deals with US, EU with high urgency: JaishankarOn Wednesday, Trump announced a 90-day pause on his sweeping tariffs on all countries, except China as countries around the world wilted under the impact of the seismic action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-trump-tariffs-could-make-iphones-cars-and-clothes-in-the-us-2707519-2025-04-11",
      "headline": "How Trump tariffs could make iPhones, cars, and clothes costlier in the USTrump's latest plan includes a massive 145% tax on goods coming from China. Experts say this could end the long run of cheap, imported goods that Americans have enjoyed for decades. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-1300-points-higher-nifty-above-22500-tata-steel-up-5-percent-metal-stocks-gain-2707506-2025-04-11",
      "headline": "Sensex ends 1,300 points higher, Nifty above 22,500; Tata Steel up 5%The S&P BSE Sensex jumped 1,310.11 points to close at 75,157.26, while the NSE Nifty50 added 429.40 points to end at 22,828.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-sip-vs-ppf-what-rs-1-lakh-a-year-can-earn-in-15-years-2707471-2025-04-11",
      "headline": "Mutual fund SIP vs PPF: What Rs 1 lakh a year can earn in 15 yearsPPF is a government scheme with a current interest rate of around 7.1% per annum. On the other hand, SIPs typically offer higher interest when invested over the long term, especially in equity mutual funds. But they carry some risk, as returns depend on the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muthoot-finance-share-price-fall-over-8-percent-today-manappuram-finance-iifl-finance-stock-low-rbi-rules-2707451-2025-04-11",
      "headline": "Explained: Why Muthoot Finance shares fell over 8% todayMuthoot Finance stock price: Muthoot Finance, one of India's largest gold loan companies, has seen its share price decline by 14% in the past five trading sessions. The stock is also down 7% over the past month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-amfi-data-march-2025-sips-decrease-reason-trump-tariff-global-uncertainty-2707415-2025-04-11",
      "headline": "Mutual fund inflows hit in March. Trump tariffs to blame?The largest outflows were seen in debt mutual funds, where investors pulled out Rs 2.02 lakh crore, possibly due to end-of-year financial needs by institutions and ongoing global uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-ceo-nithin-kamath-money-advice-no-shortcuts-to-getting-rich-it-takes-good-habits-and-patience-2707411-2025-04-11",
      "headline": "Zerodha CEO Nithin Kamath's money advice: 'No shortcuts to getting rich'Nithin Kamath shared a video with a powerful message—earning more doesn't mean you're saving more. In fact, higher income often leads to more spending on gadgets, clothes, dining out, or things meant just to impress others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-china-trade-war-lower-loan-emis-repo-rate-rbi-explained-2707412-2025-04-11",
      "headline": "Trump tariffs, trade war fears could bring your loan EMIs down further this yearBorrowers could emerge as the unexpected winners if global headwinds linger and domestic growth slows further, with the RBI likely to step in again to lower the key interest rates. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhanush-kriti-sanon-tere-ishk-mein-in-leh-aanand-l-rai-pic-viral-2708080-2025-04-12",
      "headline": "Dhanush, Kriti Sanon begin Tere Ishk Mein in Leh? Aanand L Rai's pic goes viralDhanush and Kriti Sanon are expected to begin 'Tere Ishk Mein' shooting in Leh. Director Aanand L Rai shared a picture from the picturesque location. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sandeep-vangas-spirit-to-go-on-floors-in-october-prabhas-to-do-own-stunts-report-2708069-2025-04-12",
      "headline": "Prabhas to sport lean physique in Sandeep Vanga's Spirit, shoot in October: ReportDirector Sandeep Reddy Vanga's upcoming film, Spirit, is one of the highly anticipated films of the year. As per reports, the makers are expected to begin shooting in October this year. \r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anupama-parameswaran-dhruv-vikram-dating-rumours-kissing-pic-spotify-playlist-2708071-2025-04-12",
      "headline": "Anupama Parameswaran, Dhruv Vikram dating? Leaked Spotify playlist sparks buzzActor Anupama Parameswaran and Dhruv Vikram are rumoured to be dating. Their joint Spotify playlist reportedly featured a photo of them kissing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sushmita-sen-on-pakistani-actors-in-bollywood-there-should-be-no-boundaries-2708043-2025-04-12",
      "headline": "Sushmita Sen on Pakistani actors in Bollywood: There should be no boundariesSushmita Sen reacted to Pakistani actors in Indian cinema. The actor stated that there should be no boundaries when it comes to 'talent and creativity.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coachella-2025-blackpinks-lisa-sets-stage-ablaze-as-rose-cheers-her-on-2708040-2025-04-12",
      "headline": "Coachella 2025: BLACKPINK's Lisa sets stage ablaze as Rose cheers her onBLACKPINK's Lisa captivated the audience at Coachella 2025 with her solo act, performing hits from her album 'ALTER EGO'. Her stage presence and energy left a lasting impression on fans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/bella-thorne-accuses-mickey-rourke-injure-genital-on-girl-sets-2708029-2025-04-12",
      "headline": "Actor Bella Thorne says Mickey Rourke injured her genitals on 'Girl' setsActor Bella Thorne has accused co-star Mickey Rourke of injuring her during the filming of 'Girl'. Thorne claims Rourke's actions were humiliating and among the worst in her career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jaideep-ahlawat-dance-moves-jewel-thief-song-jadu-fans-go-tauba-tauba-vicky-kaushal-2708011-2025-04-12",
      "headline": "Jaideep Ahlawat's dance moves in Jewel Thief song make fans go 'Tauba Tauba'Jaideep Ahlawat's dance moves in the 'Jewel Thief' song, 'Jadu', have surprised fans. The Netflix film will premiere on April 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-kennedy-release-india-2708004-2025-04-12",
      "headline": "Anurag Kashyap teases Kennedy's India releaseFilmmaker Anurag Kashyap hinted at the release of his film 'Kennedy' in India. Despite the film's Cannes premiere in 2023, it failed to get a release in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-kumar-sons-immerse-ashes-in-ganga-at-haridwar-family-members-attend-2707987-2025-04-12",
      "headline": "Manoj Kumar's sons immerse ashes in Ganga at Haridwar, family members attendManoj Kumar's sons Kunal Goswami and Vishal Goswami, along with other relatives, immersed the veteran actor's ashes in Haridwar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priya-prakash-varrier-viral-wink-thottu-thottu-pesum-sultana-good-bad-ugly-2707983-2025-04-12",
      "headline": "Beyond the wink: Priya Prakash Varrier's second viral wave with Good Bad UglyPriya Prakash Varrier is hogging all the limelight after the re-creation of the evergreen Tamil song, 'Thottu Thottu Pesum' in Ajith Kumar's 'Good Bad Ugly'. In an exclusive chat with India Today Digital, she talked about going viral in 2018 and again in 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-wants-british-government-king-charles-watch-kesari-chapter-2-they-should-say-sorry-2707962-2025-04-12",
      "headline": "Akshay Kumar wants King Charles to watch Kesari Chapter 2: They should say sorryAkshay Kumar shared that he wants the British government and King Charles to watch Kesari Chapter 2. The actor said, 'they should say sorry.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hema-malini-dharamendra-is-happy-with-jaat-success-esha-deol-praises-sunny-deol-2707946-2025-04-12",
      "headline": "Hema Malini says Dharamendra is happy with Jaat's success, Esha praises Sunny DeolHema Malini and Esha Deol praised Sunny Deol's 'Jaat'. The veteran actor stated that 'Dharam ji is very happy' over the film's bumper opening. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/phule-director-anant-mahadevan-controversy-caste-representation-2707928-2025-04-12",
      "headline": "Phule director calls controversy over film 'unnecessary', reveals why it was delayed'Phule' director Anant Mahadevan called the controversy around the film 'exaggerated' and 'unnecessary'. He said that the censor board was not the reason for postponing the release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-kundrra-slams-reports-of-wedding-with-tejasswi-sick-of-you-marrying-me-off-2707918-2025-04-12",
      "headline": "Karan Kundrra slams reports of wedding with Tejasswi: Sick of you marrying me offKaran Kundrra lost cool on reports of his wedding with Tejasswi Prakash. The actor shared a post and urged the media to verify information before publishing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-2-sunny-deol-gopichand-malineni-2707907-2025-04-12",
      "headline": "Jaat box office Day 2: Sunny Deol's film struggles to take off, mints Rs 16 croreDirector Gopichand Malineni's 'Jaat', starring Sunny Deol', seems to be struggling for a boost at the box office. In two days, the film has raked in Rs 16 crore nett in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sharmila-tagore-lung-cancer-2023-no-chemotherapy-soha-ali-khan-2707884-2025-04-12",
      "headline": "Sharmila Tagore didn't require chemotherapy: Soha on mother's lung cancer battleActor Soha Ali Khan, in a recent interview, revealed that her mother, Sharmila Tagore, battled 'stage zero' lung cancer in 2023. She underwent surgery to remove the tumour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/how-marvel-tv-brought-the-mcu-back-to-life-after-endgames-uncertain-future-2707617-2025-04-12",
      "headline": "How Marvel TV brought the MCU back to life after Endgame's uncertain futureAfter 'Avengers: Endgame', Marvel fans were uncertain about the future. However, shows like 'Agatha All Along' and 'Daredevil: Born Again' have reignited excitement and faith in the MCU."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-bad-ugly-box-office-collection-day-2-ajith-kumar-film-dip-big-numbers-over-first-weekend-2707861-2025-04-12",
      "headline": "Good Bad Ugly box office Day 2: Ajith's film dips, eyes big numbers over weekendAjith Kumar's 'Good Bad Ugly' saw a drop in numbers on Day 2. However, trade experts suggest that the film will make the most of the extended weekend due to Tamil New Year holiday on April 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/apoorva-mukhija-smiling-photo-cryptic-caption-publix-apology-2707855-2025-04-12",
      "headline": "Apoorva Mukhija posts smiling pic with cryptic caption after public apologyInfluencer and actor Apoorva Mukhija shared a smiling photo of herself with a cryptic caption on Friday. A couple of days ago, she publicly apologised for her comments and talked about the rape and death threats she received amid India's Got Latent controversy."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/murshidabad-violence-waqf-protest-west-bengal-case-arrest-latest-news-mamata-banerjee-2708023-2025-04-12",
      "headline": "Father, son hacked to death in Bengal as Waqf protest turns violent; 110 arrestedA father and son were hacked to death by a mob in Murshidabad on Saturday amid violence over the Waqf Amendment Act. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-sonia-gandhi-enforcement-directorate-national-herald-property-seized-ed-2708008-2025-04-12",
      "headline": "National Herald case: ED begins possession of assets linked to Sonia, Rahul GandhiThe National Herald case, stemming from a 2014 complaint by BJP leader Subramanian Swamy, alleges that Young Indian fraudulently acquired AJL's properties worth over Rs 2,000 crore for just Rs 50 lakh. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/dmk-mk-stalin-on-nda-aiadmk-bjp-alliance-for-tn-2026-polls-surrendered-itself-like-old-bonded-slave-vijay-ttv-dhinakaran-react-2708041-2025-04-12",
      "headline": "Surrendered like old bonded slave: MK Stalin slams AIADMK for reuniting with BJPTamil Nadu Chief Minister MK Stalin launched a scathing attack on the AIADMK-BJP alliance announced for Tamil Nadu's 2026 polls. Among other criticisms, he described it as an alliance driven by hunger for power. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-illegal-immigrants-registration-rule-indian-h1b-visa-green-card-holders-documentation-2707985-2025-04-12",
      "headline": "Indian H-1B, green card holders need to carry ID 24x7? What new US rule saysThe rule came into effect on April 11. A US court allowed the Trump administration to enforce the contentious rule requiring illegal immigrants to register with the government and carry documentation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/how-marvel-tv-brought-the-mcu-back-to-life-after-endgames-uncertain-future-2707617-2025-04-12",
      "headline": "How Marvel TV brought the MCU back to life after Endgame's uncertain futureAfter 'Avengers: Endgame', Marvel fans were uncertain about the future. However, shows like 'Agatha All Along' and 'Daredevil: Born Again' have reignited excitement and faith in the MCU."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-deadline-3-months-president-bills-referred-by-governors-2707895-2025-04-12",
      "headline": "In a first, Supreme Court sets deadline for President to decide on billsThe Supreme Court's ruling came as it set aside the Tamil Nadu Governor's decision to withhold assent to pending bills. The order was made public on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/drs-ipl-2025-ambati-rayudu-csk-commentary-ms-dhoni-2707998-2025-04-12",
      "headline": "IPL 2025: Is it okay for commentators to be biased toward teams and players?IPL 2025: Ambati Rayudu's recent statements on the IPL broadcast have caused a stir amongst the fans. They have questioned Rayudu's loyalty to MS Dhoni. In this edition of the Democratic Review System, we explore the idea of whether the commentators should be biased, or should they be objective through and through?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/om-birla-attends-pulwama-martyr-daughter-wedding-2708014-2025-04-12",
      "headline": "Om Birla fulfils promise, attends wedding of slain Pulwama jawan's daughterLok Sabha Speaker Om Birla attended the wedding of the daughter of slain Pulwama jawan Hemraj Meena. Meena was killed in the 2019 Pulwama terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-aiadmk-alliance-looks-good-math-will-it-score-in-chemistry-tamil-nadu-assembly-election-2026-experts-explain-2707701-2025-04-12",
      "headline": "BJP-AIADMK alliance is good maths, but will it score in chemistry?The BJP and the AIADMK have confirmed an alliance for the 2026 Assembly polls. Post-Jayalalithaa, the AIADMK has become a fractured force, and the BJP is still trying to find its feet in Tamil Nadu. Here's a look at the maths and chemistry of the alliance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sukma-animal-cruelty-villagers-chhattisgarh-torture-bear-to-death-nails-plucked-mouth-broken-2708025-2025-04-12",
      "headline": "Nails plucked, mouth broken: Villagers torture bear to death in ChhattisgarhA video of the incident has gone viral on social media, prompting the forest department to order an inquiry into the matter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/upi-services-down-for-many-users-india-npci-working-resolve-issue-latest-transactions-decline-update-downdetector-2707966-2025-04-12",
      "headline": "UPI services suffer outage, digital payments body says 'working to resolve issue'Users across platforms such as Paytm and Google Pay expressed frustration online, saying they were unable to complete UPI transactions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/noida-woman-grabs-another-by-hair-pins-her-down-viral-video-2708026-2025-04-12",
      "headline": "Noida woman grabs another by hair, pins her down. Police react as video goes viralA personal dispute between two women in a Noida society intensified into violence, and a video of the incident went viral on social media.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/jindal-university-student-sneaks-girl-hidden-in-suitcase-into-boys-hostel-viral-video-2707969-2025-04-12",
      "headline": "Student caught sneaking girl hidden in suitcase into boys' hostel. Video goes viralA student at Jindal University in Haryana tried to sneak a girl into the boys' hostel by hiding her in a suitcase, but was caught red-handed by the hostel guards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-murshidabad-west-bengal-peace-remain-calm-message-riots-violence-waqf-protests-chief-minister-2707977-2025-04-12",
      "headline": "Won't implement Waqf law, don't incite riots for politics: Mamata BanerjeeDeclaring that she will not implement the Narendra Modi government's newly-enacted Waqf law in the state, West Bengal Chief Minister Mamata Banerjee on Saturday reached out to the violence-hit areas of Murshidabad district, appealing for peace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-govt-notifies-10-pending-acts-without-governor-or-presidents-assent-only-sc-order-public-2707950-2025-04-12",
      "headline": "In a first, Tamil Nadu notifies 10 Acts without Governor, President assentThe Tamil Nadu government notified 10 Acts without receiving assent from either the Governor or the President. This move was enabled by a recent Supreme Court verdict. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/india-us-bilateral-amphibious-exercise-tiger-triumph-2025-exercise-andhra-pradesh-video-2708054-2025-04-12",
      "headline": "Watch: India, US forces flex air capabilities in massive Tiger Triumph drillThe fourth edition of the India-US Bilateral Tri-Service Humanitarian Assistance and Disaster Relief (HADR) Amphibious Exercise Tiger Triumph 2025, which was held in Andhra Pradesh's Kakinada, concluded on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-472-11-04-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pentagon-ends-5-billion-contracts-accenture-deloitte-pete-hegseth-2707949-2025-04-12",
      "headline": "Pentagon cuts $5.1 billion contracts with Accenture, Deloitte: Wasteful spendingThe contracts appeared to be wide-ranging cuts to consulting services for the Navy, the Air Force, the Defense Advanced Research Projects Agency (DARPA) and the Defense Health Agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/aiadmk-bjp-join-hands-challenge-dmk-tamil-nadu-2026-assembly-polls-2707951-2025-04-12",
      "headline": "Back to the future: BJP and AIADMK hit reverse gear with eye on 2026 electionAmit Shah's Chennai visit signalled the BJP's full tilt toward AIADMK, stressing Tamil pride, political tact, and a revived alliance - one that hopes to challenge the DMK's stronghold ahead of 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-csk-fall-ipl-2025-2707902-2025-04-12",
      "headline": "CSK's fall in IPL 2025: Gotham burns and the Dark Knight can't save itIn IPL 2025, Chennai Super Kings are struggling in a deep slump, with MS Dhoni unable to turn the tide. Despite their rich legacy, the team's outdated tactics and lack of spark leave them on the brink of collapse, with no clear hero to save them.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/if-netflixs-adolescence-was-made-in-india-would-the-plot-take-a-darker-turn-2707733-2025-04-12",
      "headline": "If Netflix's Adolescence was made in India, would the plot take a darker turn?Adolescence left many contemplating several things - upbringing, peer influence, the challenges of being a teenager in the social media era. But for me, the biggest question was this: if a series like this were made in India, would the narrative have been any different?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sukhbir-singh-badal-re-elected-unopposed-as-shiromani-akali-dal-president-november-2024-resigned-religious-misconduct-2707990-2025-04-12",
      "headline": "Sukhbir Badal back as Akali chief months after resigning over religious misconductSukhbir Singh Badal re-elected Shiromani Akali Dal chief 5 months after resigning due to religious misconduct"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-iphone-600-ton-airlift-india-to-us-amid-trump-tariff-china-import-why-reason-explained-2707997-2025-04-12",
      "headline": "Why is Apple in a race against time to fly iPhones back to the US?Apple's long-term goal is to reduce its dependence on Chinese factories and shift more production to other countries, with India playing a big part in that plan.  However, it relies heavily on a network of suppliers and trained workers that only exists at the required scale in parts of Asia."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-2024-25-final-mohun-bagan-vs-bengaluru-fc-live-score-updates-kolkata-2708090-2025-04-12",
      "headline": "ISL 2025 final, Mohun Bagan vs Bengaluru FC Live: Titleholders face Chhetri & CoISL Final, Mohun Bagan vs Bengaluru FC Live: Mohun Bagan will be aiming for a historic double in front of their home crowd as Bengaluru FC and Sunil Chhetri will be out to stop them. Can the defending champions hold on to their crown?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-pbks-live-score-sunrisers-hyderabad-vs-punjab-kings-today-reactions-2708089-2025-04-12",
      "headline": "SRH vs PBKS LIVE: Hyderabad look to arrest slump at homeSunrisers Hyderabad (SRH) vs Punjab Kings (PBKS) LIVE Score, IPL 2025: The Sunrisers are languishing at the bottom of the table and will be looking to return to winning ways. The Kings, on the other hand, will want to make their way into the top four. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vaibhav-suryavanshi-jofra-archer-rajasthan-royals-nets-session-watch-video-2708081-2025-04-12",
      "headline": "Watch: 14-year-old Vaibhav Suryavanshi takes on fiery Jofra Archer in RR netsRR's 14-year-old Vaibhav Suryavanshi faced Jofra Archer in the nets and looked fearless, raising expectations about his debut. Suryavanshi is yet to make his IPL debut, with cpach Rahul Dravid having emphasised the importance of timing his exposure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/i-league-champions-controversy-inter-kashi-churchill-brothers-aiff-verdict-2708066-2025-04-12",
      "headline": "I-League title row explained: Inter Kashi, Churchill await AIFF verdictSix days since the I-League ended, the title remains undecided. Inter Kashi and Churchill Brothers wait as AIFF prepares a crucial verdict on a match dispute that could rewrite the season's final outcome."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-to-wear-green-jerseys-vs-rr-to-promote-sustainability-2708060-2025-04-12",
      "headline": "IPL 2025: RCB to wear green jerseys vs RR to promote sustainabilityRoyal Challengers Bengaluru (RCB) are set to wear green jerseys in their sixth fixture of the Indian Premier League 2025 (IPL 2025) against Rajasthan Royals (RR)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-ajinkya-rahane-ottis-gibson-chennai-2708015-2025-04-12",
      "headline": "Like Dhoni, Kohli, Ajinkya Rahane role model for KKR: Ottis Gibson after CSK winKKR assistant coach Ottis Gibson heaped praise on Ajinkya Rahane for being a role model for the team. Rahane has been KKR's best batter this season and has guided them to a good start to the IPL 2025 campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/diamond-harbour-fc-i-league-2708012-2025-04-12",
      "headline": "Diamond Harbour enters I-League, 4th Bengal-based club to enter tournamentDiamond Harbour FC secured promotion to the I-League after defeating Sports Academy Tirur 2-1 in I-League 2. They became the fourth Bengal-based club to play in the prestigious national football league."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-mitchell-marsh-not-playing-lsg-vs-gt-ipl-2708006-2025-04-12",
      "headline": "Rishabh Pant explains why fit Marsh was ruled out of GT clashLucknow Super Giants were forced to leave out a fit Mitchell Marsh out of their playing line-up against Gujarat Titans. Marsh was ruled out due to his daughter falling ill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/drs-ipl-2025-ambati-rayudu-csk-commentary-ms-dhoni-2707998-2025-04-12",
      "headline": "IPL 2025: Is it okay for commentators to be biased toward teams and players?IPL 2025: Ambati Rayudu's recent statements on the IPL broadcast have caused a stir amongst the fans. They have questioned Rayudu's loyalty to MS Dhoni. In this edition of the Democratic Review System, we explore the idea of whether the commentators should be biased, or should they be objective through and through?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-pbks-match-preview-precited-xi-weather-forecast-hyderabad-2707980-2025-04-12",
      "headline": "SRH vs PBKS, Match Preview: Struggling Hyderabad's test of fate against Project PunjabIPL 2025, SRH vs PBKS Match Preview: Sunrisers Hyderabad face a red-hot Punjab Kings side in a must-win encounter, with SRH battling form and confidence while PBKS continue their dominant run in IPL 2025 under the steady hands of Shreyas Iyer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lsg-vs-gt-srh-vs-pbks-digvesh-rathi-celebration-ipl-moral-policing-2707976-2025-04-12",
      "headline": "From Digvesh to Maxwell: Should IPL stop moral policing its players?IPL has continually fined cricketers for either celebrating a wicket or showing frustration while getting out. If the players cannot do either, what remains to be the point of sports?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/diamond-harbour-fc-i-league-2708012-2025-04-12",
      "headline": "Diamond Harbour enters I-League, 4th Bengal-based club to enter tournamentDiamond Harbour FC secured promotion to the I-League after defeating Sports Academy Tirur 2-1 in I-League 2. They became the fourth Bengal-based club to play in the prestigious national football league."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-mitchell-marsh-not-playing-lsg-vs-gt-ipl-2708006-2025-04-12",
      "headline": "Rishabh Pant explains why fit Marsh was ruled out of GT clashLucknow Super Giants were forced to leave out a fit Mitchell Marsh out of their playing line-up against Gujarat Titans. Marsh was ruled out due to his daughter falling ill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/drs-ipl-2025-ambati-rayudu-csk-commentary-ms-dhoni-2707998-2025-04-12",
      "headline": "IPL 2025: Is it okay for commentators to be biased toward teams and players?IPL 2025: Ambati Rayudu's recent statements on the IPL broadcast have caused a stir amongst the fans. They have questioned Rayudu's loyalty to MS Dhoni. In this edition of the Democratic Review System, we explore the idea of whether the commentators should be biased, or should they be objective through and through?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-pbks-match-preview-precited-xi-weather-forecast-hyderabad-2707980-2025-04-12",
      "headline": "SRH vs PBKS, Match Preview: Struggling Hyderabad's test of fate against Project PunjabIPL 2025, SRH vs PBKS Match Preview: Sunrisers Hyderabad face a red-hot Punjab Kings side in a must-win encounter, with SRH battling form and confidence while PBKS continue their dominant run in IPL 2025 under the steady hands of Shreyas Iyer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lsg-vs-gt-srh-vs-pbks-digvesh-rathi-celebration-ipl-moral-policing-2707976-2025-04-12",
      "headline": "From Digvesh to Maxwell: Should IPL stop moral policing its players?IPL has continually fined cricketers for either celebrating a wicket or showing frustration while getting out. If the players cannot do either, what remains to be the point of sports?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-glenn-phillips-ruled-out-groin-injury-gujarat-titans-2707933-2025-04-12",
      "headline": "Gujarat Titans star Glenn Phillips ruled out of IPL 2025 with groin injuryIPL 2025: Gujarat Titans have suffered another setback as Glenn Phillips has been ruled out of IPL 2025 with a groin injury, joining Kagiso Rabada on the list of key players missing this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-rizwan-not-educated-english-speaking-psl-2707924-2025-04-12",
      "headline": "Mohammad Rizwan: Pakistan's demand from me is cricket, not EnglishPakistan captain Mohammed Rizwan has said that he is not ashamed his poor English. In an emotional rant, Rizwan has said that what Pakistan needs from him is cricket and not perfect English.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-super-giant-vs-bengaluru-fc-isl-final-live-streaming-tv-channel-2707917-2025-04-12",
      "headline": "ISL Final MBSG vs BFC,  Live streaming: When and where to watchA familiar rivalry is renewed as Mohun Bagan Super Giant and Bengaluru FC face off in the ISL 2025 Final, reigniting memories of their thrilling 2023 title clash in Kolkata's Salt Lake Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-csk-fall-ipl-2025-2707902-2025-04-12",
      "headline": "CSK's fall in IPL 2025: Gotham burns and the Dark Knight can't save itIn IPL 2025, Chennai Super Kings are struggling in a deep slump, with MS Dhoni unable to turn the tide. Despite their rich legacy, the team's outdated tactics and lack of spark leave them on the brink of collapse, with no clear hero to save them.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-vs-srh-ipl-2025-nehwal-wadhera-2707893-2025-04-12",
      "headline": "Out of form SRH still a very dangerous side: Nehal WadheraPunjab Kings play SRH in the evening game on Saturday, April 12. Ahead of the match, Nehal Wadhera has said that they are wary of SunRisers Hyderabad despite them being woefully out of form in IPL 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-csk-vs-kkr-kolkata-knight-riders-wicketkeeper-quinton-de-kock-press-conference-2707894-2025-04-12",
      "headline": "Ajinkya Rahane's familiarity with Chepauk helped KKR beat CSK, says de KockKolkata Knight Riders wicketkeeper Quinton de Kock said Ajinkya Rahane and Moeen Ali's familiarity with the Chepauk pitch helped his side beat Chennai Super Kings. \"When we bowled, it seemed a lot slower. We have guys Ajinkya and Moeen, who have been here (Chepauk) before and they knew it. That's why the selectors played an extra spinner against CSK,\" Moeen Ali said in the post-match press conference after the win over CSK."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-csk-vs-kkr-chennai-super-kings-batting-coach-michael-hussey-press-conference-2707874-2025-04-12",
      "headline": "KKR loss hurts a lot, time for self-reflection, says CSK batting coachChennai Super Kings' batting coach Michael Hussey said the entire team was disappointed after the heavy loss to Kolkata Knight Riders. \"Obviously, we are very disappointed with the result and the performance tonight,\" Hussey said in the post-match press conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-csk-fall-ipl-2025-2707902-2025-04-12",
      "headline": "CSK's fall in IPL 2025: Gotham burns and the Dark Knight can't save itIn IPL 2025, Chennai Super Kings are struggling in a deep slump, with MS Dhoni unable to turn the tide. Despite their rich legacy, the team's outdated tactics and lack of spark leave them on the brink of collapse, with no clear hero to save them.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-vs-srh-ipl-2025-nehwal-wadhera-2707893-2025-04-12",
      "headline": "Out of form SRH still a very dangerous side: Nehal WadheraPunjab Kings play SRH in the evening game on Saturday, April 12. Ahead of the match, Nehal Wadhera has said that they are wary of SunRisers Hyderabad despite them being woefully out of form in IPL 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-csk-vs-kkr-kolkata-knight-riders-wicketkeeper-quinton-de-kock-press-conference-2707894-2025-04-12",
      "headline": "Ajinkya Rahane's familiarity with Chepauk helped KKR beat CSK, says de KockKolkata Knight Riders wicketkeeper Quinton de Kock said Ajinkya Rahane and Moeen Ali's familiarity with the Chepauk pitch helped his side beat Chennai Super Kings. \"When we bowled, it seemed a lot slower. We have guys Ajinkya and Moeen, who have been here (Chepauk) before and they knew it. That's why the selectors played an extra spinner against CSK,\" Moeen Ali said in the post-match press conference after the win over CSK."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-csk-vs-kkr-chennai-super-kings-batting-coach-michael-hussey-press-conference-2707874-2025-04-12",
      "headline": "KKR loss hurts a lot, time for self-reflection, says CSK batting coachChennai Super Kings' batting coach Michael Hussey said the entire team was disappointed after the heavy loss to Kolkata Knight Riders. \"Obviously, we are very disappointed with the result and the performance tonight,\" Hussey said in the post-match press conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-mike-hussey-press-conference-2707859-2025-04-12",
      "headline": "CSK not ready to surrender yet: Defiant Hussey hopeful of playoffs spotIPL 2025: CSK batting coach Mike Hussey said that the team is not ready to surrender just yet. CSK fell to a heavy defeat against KKR on Friday, April 11, losing their 5th game in a row.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-chennai-super-kings-t20-cricket-evolve-csk-failure-2707851-2025-04-12",
      "headline": "Wake up CSK! T20 cricket is evolving and it's leaving you behindCSK's reluctance to move from their mantra of banking on experienced stars have massively backfired, leaving the five-time champions in one of their worst phases in IPL history. With T20 cricket evolving, Chennai are under the threat of being left behind the rest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-csk-vs-kkr-drs-out-controversy-ipl-2025-virender-sehwag-2707854-2025-04-12",
      "headline": "MS Dhoni out or not out vs KKR? Virender Sehwag's brutal take goes viralFormer cricketer Virender Sehwag has taken yet another sharp dig at MS Dhoni after the team's heavy defeat against KKR on Friday. Sehwag said even if Dhoni had been not out, it would not have made any difference to the result of the game. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-matthew-hayden-ms-dhoni-csk-powerplay-approach-2707847-2025-04-12",
      "headline": "CSK conservative in powerplay: MS Dhoni's viewpoint criticised by Matthew HaydenMatthew Hayden doesn't agree with MS Dhoni's viewpoint that CSK has to be conservative in the powerplay after their loss to KKR. CSK suffered a big loss at home to remain in the 9th spot on the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-mike-hussey-ms-dhoni-2707831-2025-04-12",
      "headline": "Michael Hussey defends CSK's experience mantra despite heavy defeat to KKRIPL 2025, CSK vs KKR: Michael Hussey showed faith in the Chennai Super Kings veterans to do well later in the tournament, backing them after the heavy defeat to Kolkata Knight Riders at Chepauk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-quinton-de-kock-sunil-narine-csk-vs-kkr-press-conference-2707800-2025-04-12",
      "headline": "Narine prides himself on accuracy, his batting is an X factor: De KockIPL 2025, CSK vs KKR: Quinton de Kock praised his teammates Varun Chakravarthy and Sunil Narine after Kolkata Knight Riders thrashed Chennai Super Kings on Friday at the MA Chidambaram Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lsg-vs-gt-preview-ipl-2025-predicted-11s-pitch-report-lucknow-weather-2707636-2025-04-12",
      "headline": "Gujarat aim to tighten top spot grip against confident LucknowIPL 2025, LSG vs GT: Gujarat Titans have won four matches on the trot and will be looking to build on their momentum when they face Rishabh Pant's Lucknow Super Giants in the first of Saturday's doubleheader. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-ravichandran-ashwin-aakash-chopra-2707791-2025-04-12",
      "headline": "R Ashwin hasn't bowled well at all, he adds salt to CSK's wounds: Aakash ChopraIPL 2025, CSK vs KKR: Aakash Chopra slammed R Ashwin, saying the senior off-spinner's struggles have only added salt to CSK's wounds. Ashwin has taken 6 wickets in five matches while conceding at 9.90 runs per over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/srh-vs-pbks-daniel-vettori-press-conference-ipl-2025-2707804-2025-04-12",
      "headline": "SRH batters are usually at their best if they dominate the powerplay: VettoriIPL 2025, SRH vs PBKS: Daniel Vettori, in the pre-match press conference, backed the Sunrisers Hyderabad batters to make a strong comeback in their upcoming clash against Punjab Kings at the Rajiv Gandhi International Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kelsie-whitmore-eyes-history-in-mexican-baseball-league-with-el-aguila-de-veracruz-glbs-2707802-2025-04-12",
      "headline": "Kelsie Whitmore eyes history in Mexican Baseball League with El Águila de VeracruzKelsie Whitmore, the trailblazing pitcher and outfielder who became the first woman to play in an MLB-partnered league, is on the verge of making history once again, this time in Mexico."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-powerplay-test-match-kris-srikkanth-2707787-2025-04-11",
      "headline": "One of CSK's worst defeats; powerplay felt like Test match practice: SrikkanthIPL 2025, CSK vs KKR: Former cricketer Kris Srikkanth wasn't a happy man after the Chennai Super Kings were hammered by the Kolkata Knight Riders in the clash on Friday at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-chennai-super-kings-memes-ms-dhoni-2707786-2025-04-11",
      "headline": "Pretending to be a cricket team: CSK memes viral after humiliating KKR lossFans decided to have some fun at the expense of the Chennai Super Kings as memes went viral on social media after their humbling loss to Kolkata Knight Riders at the Chepauk on Friday, April 11. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}